{
    "chapters":{
        "1":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Comics",
                "TV shows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which form of the franchise will you choose?<br>\r\n<br>\r\nComics<br>\r\n<br>\r\nor<br>\r\n<br>\r\nTV shows<br>\r\n<br>\r\nTake your pick!</span></div></span></div>",
            "created":1582520400,
            "id":2792327,
            "title":"Let it begin!"
        },
        "11":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Uncanny X-Men (1963)",
                "Excalibur (1988)",
                "Wolverine First Class (2008)",
                "Wolverine and the X-Men (2011)",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>Which shall it be?<br>\r\n<br>\r\nUncanny X-Men (1963)<br>\r\n<br>\r\nExcalibur (1988)<br>\r\n<br>\r\nWolverine First Class (2008)<br>\r\n<br>\r\nWolverine and the X-Men (2011)<br>\r\n<br>\r\nor<br>\r\n<br>\r\nOthers<br>\r\n<br>\r\nWhich will you decide?<br>\r\n<br>\r\n</span></div></div>",
            "created":1582520400,
            "id":2792333,
            "title":"Comics"
        },
        "111":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "The entire team",
                "Psylocke",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which will it be?<br>\r\n<br>\r\nThe entire team<br>\r\n<br>\r\nPsylocke<br>\r\n<br>\r\nor<br>\r\n<br>\r\nMore<br>\r\n<br>\r\nTake your pick!</span></div></span></div>",
            "created":1582606800,
            "id":2792618,
            "title":"Uncanny X-Men (1963)"
        },
        "1113":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Storm",
                "Rogue",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who're some more choices?<br>\r\n<br>\r\nStorm<br>\r\n<br>\r\nRogue<br>\r\n<br>\r\nor<br>\r\n<br>\r\nMore<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1582606800,
            "id":2792619,
            "title":"More"
        },
        "11133":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Yes, let's go with Jean",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Jean?<br>\r\n<br>\r\nYes, let's go with Jean<br>\r\n<br>\r\nor<br>\r\n<br>\r\nNo</span></div></span></div>",
            "created":1582606800,
            "id":2792620,
            "title":"More"
        },
        "111332":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Yes, Logan's clone",
                "Nah, somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about X-23?<br>\r\n<br>\r\nYes, Logan's clone<br>\r\n<br>\r\nor<br>\r\n<br>\r\nNah, somebody else<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1582606800,
            "id":2792622,
            "title":"No"
        },
        "1113321":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Over the next month",
                "Skip a few months"
            ],
            "content":"<div class=\"\"><div> <span>X-23, or Laura, as she likes to be called while not on missions, winced as the smell of the bar's patrons came to her very sensitive nose. <br>\r\n<br>\r\n\"And this is supposed to be fun?\" she remarked to her companions and teammates Shadowcat and Wolfsbane. <br>\r\n<br>\r\n\"Of course!\" Kitty smiled. \"Ya just gotta have somethin' to drink!\" <br>\r\n<br>\r\nRahne nodded in agreement. Sighing, Laura went with her friends, the trio grabbed stools at the bar and ordered some drinks. Laura was hesitant at first, but Kitty and Rahne both gave her suggestions. <br>\r\n<br>\r\nWhen Laura's beer came, it was massive. White foam on top, the liquid almost golden in light, something inside Laura seemed drawn to it. Picking it up, she started chugging it and after a minute, all the liquid was inside Laura's belly. <br>\r\n<br>\r\nPlacing the glass on the counter, she asked for more. <br>\r\n<br>\r\nGLUG... GLUG... GLUG. <br>\r\n<br>\r\nBeer after beer went down Laura's throat, belly expanding after each one as her healing factor wasn't able to keep up with how much alcohol she was consuming. <br>\r\n<br>\r\nKitty and Rahne both laughed as Laura burped loudly, but were soon burping as well as Laura challenged them to keep up with her.<br>\r\n<br>\r\nAt the end of the night, the trio left the bar. The only one still sober was X-23, healing factor keeping her from getting intoxicated. Though she still sported a beer crammed belly. Poking it, Laura was surprised by how good it really felt as the trio went home.</span></div></div>",
            "created":1582606800,
            "id":2792837,
            "title":"Yes, Logan's clone"
        },
        "11133211":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "She tries a new beer (get gassier)",
                "Starts ordering delivery (lazy and poor manners)"
            ],
            "content":"<div class=\"\"><div> <span>X-23 and her friends started enjoying going to the bar. A lot. <br>\r\n<br>\r\nThe next weekend they came back and had even more beers than last time. Laura had over 20, being able to handle it without intoxication. By the end of the night, she wasn't able to finish a sentence without burping. Kitty and Rahne both ended up drunk and passed out, leaving Laura to carry them both home. She laid in bed that night, rubbing her belly and enjoying the feeling of being fat from the alcohol. <br>\r\n<br>\r\nThen, it became a nightly ordeal. They went back the next night and before they knew it, they were going back every night that week. More beer was ordered, Laura getting more than the previous night and chugging from larger glasses. Not only that, but they also discovered the bar's menu. This resulted in Laura chowing down on burgers and chicken as she guzzled more beer. <br>\r\n<br>\r\nThen, one day as Laura laid in bed, rubbing her big belly, a chubbier Kitty ran in to tell her that the bar was now serving earlier! Laura got very excited as they immediately went and spent the day eating more and downing dozens of beers. Then they went the next day. And the next day. <br>\r\n<br>\r\nThe month passed and the three girls had spent the majority of the past four weeks at the bar. They were turning into favorites of the owners. Kitty and Wolfsbane were getting fat, sure, but Laura had definitely bloated the most. Now a whopping 220 pounds, the big clone was greatly enjoying her new world of pigging out at the bar.<br>\r\n<br>\r\n'Course, it wasn't the only change in store for her...</span></div></div>",
            "created":1582606800,
            "id":2792849,
            "title":"Over the next month"
        },
        "111332112":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Grab Wolfsbane and hit the bar!",
                "Wolfsbane, shocked by her weight, tries to convince the gals to exercise"
            ],
            "content":"<div class=\"\"><div> <span>Laura was aware of the bar's delivery menu the day it was released. While she had earned her share of friends since her time with the X-Men, part of her was still the girl raised in near isolation in a laboratory base. Being able to snack on the bar's famous beer-battered chicken and towering burgers made a quiet day away from the bustle outside extremely great for Laura. Wolfsbane was no more extroverted than Laura and so quickly fell in line with ordering massive delivery requests. Kitty, perfectly happy with spending the day on a computer, reading a book or playing video games, saw no logical flaws in the waves of greasy food showing up on the Xavier Institute's doorstep. <br>\r\n<br>\r\nIt wasn't long before Laura took to ordering beers. What started as a six pick turned into stacks of cans, to the point where a sea of aluminum that surrounded Laura by the time she was ready to retreat to her room after spending the day in the recreation room. She found that time seemed to fly by as she lazed around; she could burn a whole day watching movies while gulping down dipping cheese and gushing streams of beers. She often took to wearing shirts she'd outgrown, allowing her large soft gut to hang out. She could be seen resting one hand on it as she filled it with more sustenance. Laura's butt had swelled to take up two cushions and her tummy was big enough to keep up with her thighs. Her chest was getting weightier and her face was now swollen into a double chin. Laura noticed that her body was starting to rankle at her new diet; the constant stream of junk food and frothy beer had given her a case of omnipresent gas and Laura found herself plague with tummy cramps not even her healing factor could prevent. Rahne, possessing a heightened sense of smell, often wrinkled her nose when Laura was near, often remarking that she now had worse manners than Logan. <br>\r\n<br>\r\nThis went on until Laura decided to re-prioritize. She was going through beer quicker than it could be delivered. Bending over to pick up fresh bags among the trash among her was making her sweat like a broken sprinkler and she definitely didn't have time to shower all the time, not with food to be eaten! <br>\r\n<br>\r\n\"Kitty? You there?\" Shadowcat was sitting at her computer, loudly stripping a large chicken drumstick clean. Laura noticed her friend's arms were plumper than a few months ago and that she was wearing jeans missing their button, allowing a handful of pale flesh to poke through from under her just-too-tight t-shirt.  \"I was thinking we could head back to the bar at night... just because we're ordering delivery all day doesn't mean we can't go out, y'know?\" Kitty turned, licking sauce from her lips rather loudly. \"Sure. Though surely you're not goin' out like that?\" Laura's skin-tight pants had split on both thighs and her belly hung over her pants' waistband. \"Well, I haven't been out much...\" Laura examined herself, trying to look like her clothes' state was due to her ignorance, instead of her reluctance to go out. Kitty got out of her chair and gestured to her belly and hips, where most of her 90 pound WG had been going. Laura saw that while Kitty's jeans were tight enough to mold her sides into love handles, they were bigger than her previous ones. <br>\r\n<br>\r\nX-23 rose her eyebrows. \"When'd you go clothes shopping?\" Kitty smiled. \"I just ordered stuff online!\" Laura tried not to blush. Even going online for just 10 minutes seemed like a chore. \"Well, just throw on some sweatpants or something for tonight. I'll order you some better fitting clothes. It'll be great to go out again. I tell you, this stuff is greasy! Maybe the walk to the bar'll help us loose a few pounds...\" Kitty's eyes widened as she let out a ginormous fart escaped her butt, splitting her jeans down the middle. Laura saw her friend's panties were bunched up to a thong-like position due to their lack of a size update. She smiled. \"I kinda doubt that, but maybe we'll air ourselves out a little!\" Laura put her hand on her hip and let out a fart she'd been planning to unleash silently until just now. Kitty tried not to giggle, but ultimately failed. \"I wonder if Rahne's been hit by the food as hard as us... I kind of hope so, because *bbuuurraaapppp!* tryin' to be sneaky about this is gonna be trouble!\" \"No kidding.\" Kitty sighed, fanning one hand beside her butt and cocking her head slightly.</span></div></div>",
            "created":1582606800,
            "id":2792881,
            "title":"Starts ordering delivery (l..."
        },
        "1113321122":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Head to the bar!",
                "The gals go clothes shopping first."
            ],
            "content":"<div class=\"\"><div> <span>Rahne, though she had been eating nearly as much as Kitty and Laura, wasn't enthused when she learned they were going to be introducing even more food into their diets. \"Y'know, I've eaten like a starved wolf before and I think we're outdoin' a pack of 'em with how much we're stuffin' ourselves!\" Rahne's shoulder-length red hair framed her chubby face, which was getting rounder by the day. Her upper body was getting the worst of her weight gain, her boobies already reaching D-Cups and her belly wrapped in a too-tight t-shirt, hanging like a large stack of feed over her waistband. Shorter than her pals by over half a foot, Rahne's generous cleavage was basically on display for her friends. Kitty noticed that there wasn't any excess flesh popping out of her clothes, indicating that Rahne had been more self-conscious about how rapidly they were fattening up. <br>\r\n<br>\r\n\"So you're saying you don't wanna come with?\" Laura rose an eyebrow. Rahne licked her lips. \"Well now, let's not be hasty! Why don't we just try to get some exercise in first?\" <br>\r\n<br>\r\nRahne quickly decided jogging was out when her boobies nearly flopped out of her t-shirt. <br>\r\n<br>\r\nKitty just shook her head. \"I do squats, I'm gonna split my shorts.\"  <br>\r\n<br>\r\nAfter only her first sit-up, Laura started using her claws, using their force to push her body up, letting a large fart out after each one. Still she was winded after her third and her tummy barley made it possible anyhow!<br>\r\n<br>\r\nRahne pinched her nose. \"Laura, would you stop with the gas? I can't spot you like this! I'll faint!\" Kitty rose her hand. \"I'll take over. You get used to it after awhile, Rahne!\" Laura shook her head. \"More? Next thing you'll be suggesting is that I left weights instead of those ice cream tubs!\" Rahne's eyes widened. \"When did you switch those out with the dumbbells?!?! My eyes've been watering so much!\" <br>\r\n<br>\r\n\"I don't really have an excuse for skipping soccer. I'm just a computer nerd.\" Kitty smiled at Rahne as she booted the ball hard, sending a jiggle through her thigh fat.<br>\r\n<br>\r\n\"Well, Rahne, we've been at this for two hours and we've gotten...\" <br>\r\n<br>\r\n\"Sweaty and *Urp* a bad *Belch* case of *Hurp!* indigestion from eatin' those extra big things of power bars.\" Rahne let out a giant burp. <br>\r\n<br>\r\n\"Amen.\" Laura replied. <br>\r\n<br>\r\n\"Well, we should hop in the shower before we hit the bar...\" Kitty started back to the mansion, her booty bouncing up and down through her tight-fitting black exercise shorts.<br>\r\n<br>\r\nLaura rose her arm and sniffed her armpit. She noted that she definitely smelled ripe. \"We're not-that-bad!\" She put her fist on her mouth to stifle an extra big burp.<br>\r\n<br>\r\nRahne pinched her belly fat. \"We stink enough already. I doubt anybody's gonna notice a little post-workout stench... geez... my tummy's killin' me! I should've known better than ta run with a belly full o' fried food!\"</span></div></div>",
            "created":1582606800,
            "id":2792966,
            "title":"Wolfsbane, shocked by her weight, tries to conv..."
        },
        "11133211222":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Get to the bar and learn there's a special feast",
                "The girls find the bar is closed"
            ],
            "content":"<div class=\"\"><div> <span>After their showers, the girls had a bit of trouble. Fitting into their clothes was becoming a bit harder than usual. Laura ripped two pairs of pants wide open after trying to fit into them. Kitty went through half a dozen shirts before finding one that stretched over her large belly. It took Rahne fifteen minutes just to find a bra that didn't snap open. Frustrated, Rahne demanded that they go clothes shopping first. Kitty and Laura tried to convince her otherwise, but Rahne's fierce eyes caused them to back off.<br>\r\n<br>\r\nAll three were far too pooped to even consider walking. Rahne brought her car out as they squeezed inside and took off. Laura unleashed a jumbo fart in the backseat as she sighed, rubbing her belly. <br>\r\n<br>\r\n\"Mannn, I haven't had anything to eat in two minutes!\" She groaned. \"I'm gonna starve to death!\" <br>\r\n<br>\r\n\"Get over it, Laura.\" Rahne replied as her fat belly pressed into the wheel. \"We're just gonna grab some clothes to slip in our new bodies at the moment. We won't be there for more than ten minutes, max.\" <br>\r\n<br>\r\nShe pulled into the parking garage and they got out. Kitty unleashed a giant burp that echoed throughout the building, causing her and Laura to giggle and slap hands, clearly enjoying their fat and slob-like natures now. The three girls walked inside to the giant clothes store as they made their way to the women's section. They each grabbed some larger clothes and went to the changing rooms to try them on. However, each of them had trouble fitting into larger clothes!<br>\r\n<br>\r\n\"This isn't going well.\" Laura huffed as she stepped out. \"I just tried several sizes and they just barely fit!\" <br>\r\n<br>\r\nKitty and Rahne both stepped out, also wearing disappointed expressions. An employee noticed their faces. <br>\r\n<br>\r\n\"Is anything wrong, ladies?\" she asked. <br>\r\n<br>\r\n\"We're all too fat for these clothes!\" Kitty whined with a jumbo fart that nearly caused her to poop her panties.<br>\r\n<br>\r\n\"You know, this might be the wrong store for you three,\" the woman replied, \"A new store called Wide Woman just opened the other day that has much larger sizes than we offer. You can find it at the other side of the mall.\" <br>\r\n<br>\r\nThe three walked off and soon found the new store called Wide Women. Inside, they were all happy as they found plenty of items that fit them perfectly. Laura found a t-shirt that covered her belly perfectly, even though the t-shirt was large enough to cover her previous body. Rahne found a verity of bras that didn't loose support. Kitty was happy to find some pants that actually fit over her big butt. They also found plus sized diapers and decided to buy those as well, having found that using the bathroom took up too much eating time. The girls bought a few bags of clothes and diapers and changed into them in the changing rooms. They came out, very happy in their new attires. Laura thought she was very cute with her new t-shirt, which had a pig eating from a trough.<br>\r\n<br>\r\nOf course, the girls couldn't leave without first stopping at the food court. The three of them sat in the car as Rahne drove to the bar, Kitty eating a large bucket of fried chicken and Laura polishing off her fifth baconburger.<br>\r\n<br>\r\n\"URRRRRPPP!!\" Laura burped as grease fell onto her t-shirt. \"That was a great idea, Rahne! With these new clothes and snacks, we're ready for more grub!\" </span></div></div>",
            "created":1582693200,
            "id":2793148,
            "title":"The gals go clothes shopping first."
        },
        "111332112222":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Kitty and Rahne join her",
                "Laura downs the entire basin herself"
            ],
            "content":"<div class=\"\"><div> <span>The girls climbed out of the car, repositioning their new clothes to cope with their standing positions. Laura eagerly waddled to the door, when she stopped short. She felt Rahne's front briefly press into her back as she almost bumped into her. Laura balled her hands into fists. \"Closed, owners on vacation for the weekend?!?!\" Kitty could hear the loud growling emanating from Laura's large belly... and Laura herself. \"Woah, Laura! Bad idea!\" X-23 had released her claws to cut through the front doors of the bar to gain entry. Kitty sunk her hand into Laura's soft forearm just in time. Laura wheeled to look at her friend. \"Are you suggesting we go to bed hungry tonight?\" Kitty smiled and puffed a big burp into Laura's scowl. \"No way, I'm starving.\" Kitty sauntered through her friend and continued to phase through the front door of the bar. She then simply undid the lock from the inside. \"...Oh.\" said Laura, kicking herself for obvious oversight. <br>\r\n<br>\r\nLaura then went straight for the beer tap. Setting up a few stools, she laid on her back under one of the taps (her bulging belly being stabbed by the other taps) and depressed the lever. Laura's eyes almost rolled to the back of her head with pleasure as a constant stream of calorie-laden beer poured into her gullet. <br>\r\n<br>\r\nMeanwhile, Rahne had fired up the fat fryer. She indulged in a long, drawn out fart as she began to smell the chicken and ribs starting to fry. Then, Rahne glanced at Kitty, hoping she didn't gross her friend out. Kitty gave a little nod of approval and licked her lips, also half-hypnotized by the smell of cooking meat. \"I'll fire up the grill!\" Kitty declared, deciding that fried foods wouldn't cut it. Rahne grinned, an animalistic hunger flashing in her eyes. \"When the burgers and hot dogs are done, toss 'em into the fryer.\" Kitty's eyes widened as she imagined the taste and set to work.<br>\r\n<br>\r\nLaura had guzzled at least 8 liters of beer before taking her first break. Heaving herself up, she felt the occasional buzz coupled with fierce gas. No one around to judge her, Laura began letting out deep, throaty burps that sounded like an air horn going off inside a bullfrog. She peaked into the kitchen to see her friends heaping burgers, chicken, ribs and hot dogs onto plates, often grabbing three and stuffing them into their faces. Rahne had developed some serious pit stains and Kitty's chin was dripping oil from their unhealthy concoctions. \"Hey, save some for me!\" Laura exclaimed, starling the girls with another burp. As they tore into the meal, the girls began to tire of only fried meat. \"Fried Oreo time!\" Kitty whooped, dumping sleeve after sleeve into the fryer, which at this point was practically shining with residue. <br>\r\n<br>\r\nWashed down with generous amounts of beer, the feast went by quickly and the final course of double fried foods seemed to go by the fastest. By the end, all three girls were unabashedly flatulent, unable to keep even the slightest amount of politeness. Laura rubbed her tummy contentedly. \"Let's stop in for breakfast, we'll buy two hundred eggs and like eighty pounds of bacon, get the fryer going again.\" Kitty and Rahne both made sympathetic groans of hunger at the idea. Rahne perked up slightly. *UUURRRRPPP* \"Laura, what're you lookin' at?\" Laura was staring at the fat fryer. \"Ooooh… the grease is cooling...\" Like a girl possessed, she got up and stumbled to the fryer. Rahne gasped. \"Laura, no way!!\" She had stuck her face into the grease and was slurping it up from the basin.</span></div></div>",
            "created":1582693200,
            "id":2793184,
            "title":"The girls find the bar is closed"
        },
        "1113321122221":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Run outta grease and go back for more the next day",
                "Something happens at the school"
            ],
            "content":"<div class=\"\"><div> <span>Kitty and Rahne watched in awe as Laura was face first in the grease, drinking it like a horse with a river. They could hear her gulping the thick liquid. Some of her hair got in the grease and was now wet with the substance. She stopped to take a breath after several gulps, savoring the taste and licking her lips. The top of her t-shirt was stained and some of the grease dripped from her lips.<br>\r\n<br>\r\n\"Wow, Laura!\" exclaimed Kitty, adjusting her wet diaper's waistband. \"Why'd you do that?\"<br>\r\n<br>\r\n*PHHHHHHHHHFRT!* Laura's gas was even smellier now as she stroked her greasy hair while her poopy diaper sagged slightly. <br>\r\n<br>\r\n\"I dunno. I just thought it looked really yummy and I dove right in!\" She said. \"It's sooooo good! It tastes like a meaty drink!\" <br>\r\n<br>\r\n\"Wow,\" said Rahne, still shocked by what had happened. \"I dunno, Laura. No way can that be healthy...\" <br>\r\n<br>\r\nLaura just rolled her eyes. <br>\r\n<br>\r\n\"Are you STILL going on about that, girls? Come on, look at us. We're not exactly striking models now.\" <br>\r\n<br>\r\nThe other girls looked down at their big dirty t-shirts and messy diapers and bodies. They definitely felt like they'd changed a lot this past month, almost unrecognizable from their old selves.<br>\r\n<br>\r\n\"Maybe it's not healthy! So what! I'm tired of people telling me what's good or what's not. If I can absorb alcohol with no problem, why not grease?\" <br>\r\n<br>\r\nShe stuck her head back in and went back to feeding off the grease. Kitty and Rahne look on for a second.<br>\r\n<br>\r\n\"Y,know, maybe it's not too bad?\" Rahne said, hitching up her wet and poopy diaper. \"It doesn't hurt to try somethin' new...\" <br>\r\n<br>\r\n\"Mmmm, yeah, it does smell pretty yummy right now...\" said Kitty, her wet diaper sagging again.<br>\r\n<br>\r\nThe two girls cautiously walked over to Laura as each of them slowly put their faces in. They felt the grease mere inches from their faces as each took their tongues out and lapped up some of the grease. Laura stopped and watched. They both looked cute.<br>\r\n<br>\r\n\"So, what's the verdict?\" She asked.<br>\r\n<br>\r\nAfter some tasting, Rahne looked up. She tried to say something, but only let out a fiery burp. Laura giggled.<br>\r\n<br>\r\n\"It's... it's pretty good!\" Rahne said. \"This tastes more yummy than the soda I was havin'! I can't believe it!\"<br>\r\n<br>\r\nShe dove back in and dunked her face into the grease. Kitty didn't even bother to explain her option. She was already chugging and slurping it up like water after a drought. Laura got thirsty again and dove in with the two girls, all three of them drinking up the contents. Their faces became coated with grease as they continued on with the dessert.<br>\r\n<br>\r\n\"We better get back to the academy.\" Laura said as she carried a large bucket of grease to the car. \"It's 1 o'clock and I'm sure they'll wonder if we don't get back soon.\" <br>\r\n<br>\r\nAfter about 40 minutes with the tasty grease, they'd noticed the time and decided it was time to hoof it. Because they loved the grease so much, they'd cooked up another batch (along with some more hot dogs and burgers, which they happily ate) and put it into buckets to take home once it cooled off. Rahne was carrying three more buckets, including her thermos, which she had emptied of her coffee and replaced with the far better grease. They place the buckets into the car as Kitty relocked the door.<br>\r\n<br>\r\nThe girls weren't heavier, only several extra pounds each, but they definitely weren't hygienic models now. Laura's greasy hair laid on her shoulder, as she sucked some of the grease from her t-shirt. At the same time, Kitty was breaking out in zits. Rahne was farting so much that she didn't notice half the time and the sweat on her body was as bad as ever. And all three of their diapers were still soiled and starting to really stink. With a quick gulp from her grease thermos, Rahne started the car up and drove back to the school.</span></div></div>",
            "created":1582693200,
            "id":2793409,
            "title":"Kitty and Rahne join her"
        },
        "11133211222212":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "New food court installed",
                "Forced exercise"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens?<br>\r\n<br>\r\nThere's a new food court installed<br>\r\n<br>\r\nor<br>\r\n<br>\r\nThere's gonna be forced exercise</span></div></span></div>",
            "created":1582693200,
            "id":2793410,
            "title":"Something happens at the school"
        },
        "111332112222122":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "They flip a coin. Heads one doesn't exercise and Tails the other does work out",
                "Kitty and Laura decide to escape",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>BRRRRRT BRRRRRT BRRRRRT BRRRRT<br>\r\n<br>\r\nLaura extended a flabby forearm and stabbed her alarm clock.<br>\r\n<br>\r\n\"What the poop? I didn't set an alarm...\" Laura groggily groaned through clenched teeth and red eyes. <br>\r\n<br>\r\nKNOCK KNOCK KNOCK<br>\r\n<br>\r\n\"Laura! Get up now! We need to get moving!\"<br>\r\n<br>\r\n'That voice...' Laura thought as she groggily got her soft, greasy body up and her legs over the bedside. \"Was that... Logan?\" Laura sleepily said to herself. She slowly heaved herself up and, with no one watching, scratched her butt with one extended claw in her diaper. But as she reached the doorknob, she found herself grabbing a greasy roll of belly flab as Kitty had phased herself through the door... and landed with a 'thump' on top of Laura.<br>\r\n<br>\r\n\"Kitty, what the hell?\" Laura said, trying to push the flabby and diapered X-Girl off her belly. <br>\r\n<br>\r\n\"Sorry Laura, I needed a place to hide from 'em. Needed to plan.\" Kitty said, clearly stressed and sweating, her diaper bulging with a big load of poop.<br>\r\n<br>\r\n\"Hide from who? What's goin' on?\" Laura answered, still grumpy about being awake before 1 in the afternoon. The door then creaked open and revealed a rather energetic Rahne, who was wearing a blue and grey sports bra that barely managed to hold her assets and made her flabby arms look even bigger at the same time. Her middle was compressed into a large muffin top that had her fat midsection spilling out all 360 degrees of her body. Below that, her diaper and solid black shorts were wrapped around her booty, which, admittedly to Laura and Kitty, didn't look nearly as fat as their own when squeezed into their shorts. The shorts emphasized her thunder thighs and flabby legs which, while in no way marathon material, where slightly more in shape than Kitty and Laura's.<br>\r\n<br>\r\n\"Um, did I come at a bad time?\" Rahne asked, eying one flabby half dressed body from the waist down on top of another entering the room. Laura blushed and quickly pushed Kitty off her tummy.<br>\r\n<br>\r\n\"What's going on, Rahne?\" Laura asked now clearly angry.<br>\r\n<br>\r\n\"Oh, you don't know? Um... you might wanna look outside.\" <br>\r\n<br>\r\nLaura and Kitty both crawled to the window and looked outside. What they saw made their hearts stink to their diapers. Most of their classmates were outside in exercising clothes and stretching. <br>\r\n<br>\r\n\"Logan and Professor X decided that it would be beneficial to have a daily run every morning for the next month. Team building and that kinda thing!\" Rahne was definitely excited to get her body back more than the other two. \"Well, I don' wanna keep you two, you guys still need to get clean nappies and some pants on! See you out there!\" Rahne left, leaving the other two girls staring at each other.<br>\r\n<br>\r\n\"Now what?\" Laura asked coldly.<br>\r\n<br>\r\n\"Now what?!?!?\" Kitty nearly shrieked, her diaper sagging even more due to her stress pooping. \"Do you remember what happened yesterday when we tried to work out with Rahne? It was humiliating and that was with the three of us! Can you imagine how terrible it'll be if the whole freaking school sees how outta shape we are!\" Kitty's face was red and yelling. <br>\r\n<br>\r\n\"Calm down... I actually have an idea for both of us to avoid exercising...\" Laura smirked.</span></div></div>",
            "created":1582693200,
            "id":2793440,
            "title":"Forced exercise"
        },
        "1113321122221222":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Hit the pool",
                "Check out the buffet",
                "Go to the gym"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, so what's your plan?\" Kitty asked Laura after changing her diaper, using one of Laura's. Laura smiled happily.<br>\r\n<br>\r\n\"We pretend to be hungover and then we'll leave once the others go.\" she explained with a fart and while picking her nose.<br>\r\n<br>\r\n\"Okay?\" Kitty said, clearly confused. Laura rolled her eyes and let out a tiny burp of frustration. \"We'll go to a hotel or something and hide out so we don't have to work out with them. We'll use a gym at the hotel.\" Laura explained as calmly as she could. Kitty thought about it for a moment and then nodded. <br>\r\n<br>\r\n\"That could work, Laura. Good idea.\" She smiled as they high fived and burped in unison.<br>\r\n<br>\r\nSoon, the duo had slipped out of the mansion after the students and teachers had left for the run while Professor X had left for another matters. Luckily, he hadn't read the duo's minds beforehand. Kitty and Laura, using a spare car from the garage, went to a nice hotel in the heart of Manhattan. <br>\r\n<br>\r\n\"What're we gonna do for money?\" asked Kitty as she and X-23 pulled their duffel bags and suitcases out of their car after going to a parking garage. \"Don't worry. I've won a bit of money from the bar playin' cards over the last month. It should cover us for at least a month.\" Laura smiled. \"Alright!\" Kitty cheered as they went to get checked in. Soon, they had gone up to their room. It was amazing. It had two large water beds, a flat screen TV, a gorgeous bathroom and many other neat features. <br>\r\n<br>\r\nKitty then stopped after putting her suitcase and duffel bag down. \"What?\" Laura asked as she laid on her bed, letting out a wet fart. \"I just remembered! We're gonna need a cover story for when we return!\" Kitty said nervously. <br>\r\n<br>\r\n\"Nah. I left a note, telling them that my healing factor finally kicked in, curing my hangover and that we decided to take a month or so off.\" Laura smiled, using her claws to scratch her belly. \"So, what do ya wanna do?\" she asked.</span></div></div>",
            "created":1582779600,
            "id":2793977,
            "title":"Kitty and Laura decide to escape"
        },
        "11133211222212223":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "They have a surprisingly moderate meal at the buffet before a pig out at the bar",
                "They pig out at both places"
            ],
            "content":"<div class=\"\"><div> <span>\"We should probably check out the gym.\" Kitty suggested, taking her plus-sized jeans off and replacing them with her new extra large gym shorts. \"Fiiinnnne…\" Laura pouted as she got up and also changed into her shorts. <br>\r\n<br>\r\n\"Should we wear our new panties or diapers?\" Kitty asked. \"Um, maybe go with the panties. We'll save the diapers for bed and when we hit the bar.\" Laura decided as they quickly changed out of their still clean diapers and replaced them with their large panties. <br>\r\n<br>\r\nThey then went to the gym, on the second floor. When they got there, they were impressed. People were lifting weights, jogging on treadmills, using rowing machines and so on. <br>\r\n<br>\r\n\"This is kinda cool.\" Kitty smiled, covering her mouth to muffle a big burp. \"Yeah, I gotta admit it's pretty awesome.\" Laura agreed with a smile. <br>\r\n<br>\r\nThe duo warmed up with a few stretches and then started their workout.<br>\r\n<br>\r\nKitty suggested they do the stairclimbing machine since it was a bit easier so they did a few minutes on it before switching to the rowing machine. Laura liked that one. After that, they did some pushups, sit-ups (Laura still needing to use her claws to pull herself up), squats and finally wrapped up with the treadmill. <br>\r\n<br>\r\nAfter two hours, the duo staggered out of the gym and managed to make it to their room before flopping onto Kitty's bed, wheezing, panting and huffing loudly.<br>\r\n<br>\r\n\"Okay... maybe... we *wheeze* *pant* overdid it *pant* *pant* a little...\" Kitty gasped before starting to chug from her water bottle. <br>\r\n<br>\r\n\"*Wheeze* *pant* *huff* A little?!?!? I thought we were gonna *gasp* have heart attacks! *Puff* *Wheeze* Why'd you make us go two hours?!?\" Laura moaned from beside her friend. <br>\r\n<br>\r\n\"'Cause I really thought we'd make it more.\" Kitty confessed with a burp as she tossed her empty water bottle into the trashcan. She then grabbed her towel. \"I'm gonna take a shower. You can go next.\" She added as she went into the bathroom.<br>\r\n<br>\r\nLaura didn't answer. She just kept getting her breath back and drinking her bottle of grease. She had secretly smuggled some of her supply of grease from the previous night into her steel water bottle without Kitty noticing. <br>\r\n<br>\r\nKitty wrapped up her shower in fifteen minutes and came out in fresh clothes. \"That's much better!\" She smiled as Laura looked up. \"After your shower, wanna go check out the buffet before we go to the bar since we didn't get breakfast?\" <br>\r\n<br>\r\nLaura's eyes widened in delight. \"Oh hell yeah!\" she whooped, nearly dropping her towel and exposing her fat naked body to Kitty, causing both to blush as she quickly grabbed it again and darted into the bathroom, causing Kitty to giggle.</span></div></div>",
            "created":1582779600,
            "id":2793985,
            "title":"Go to the gym"
        },
        "1113322":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Yeah, let's do Kitty",
                "Try again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How 'bout Shadowcat?<br>\r\n<br>\r\nYeah, let's do Kitty<br>\r\n<br>\r\nTry again</span></div></span></div>",
            "created":1582606800,
            "id":2792624,
            "title":"Nah, somebody else"
        },
        "11133222":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Yeah",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Jubilee?<br>\r\n<br>\r\nYeah<br>\r\n<br>\r\nor<br>\r\n<br>\r\nNope</span></div></span></div>",
            "created":1582606800,
            "id":2792625,
            "title":"Try again"
        },
        "12":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "X-Men the Animated Series",
                "X-Men Evolution"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which shall it be?<br>\r\n<br>\r\nX-Men the Animated Series (1992)<br>\r\n<br>\r\nor<br>\r\n<br>\r\nX-Men Evolution (2000)<br>\r\n<br>\r\nWhich will you choose?</span></div></span></div>",
            "created":1582520400,
            "id":2792335,
            "title":"TV shows"
        },
        "121":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Jubilee",
                "Rogue",
                "Storm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall it be?<br>\r\n<br>\r\nJubilee<br>\r\n<br>\r\nRogue<br>\r\n<br>\r\nor<br>\r\n<br>\r\nStorm<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1582606800,
            "id":2792709,
            "title":"X-Men the Animated Series"
        },
        "122":{
            "author_id":"blackbeltii",
            "author_name":"pirate king",
            "choices":[
                "Kitty Pryde",
                "Rogue",
                "More X-Girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's gonna become a slob?<br>\r\n<br>\r\nKitty Pryde<br>\r\n<br>\r\nRogue<br>\r\n<br>\r\nor<br>\r\n<br>\r\nMore X-Girls</span></div></span></div>",
            "created":1582606800,
            "id":2792712,
            "title":"X-Men Evolution"
        }
    },
    "info":{
        "author_id":"blackbeltii",
        "author_name":"pirate king",
        "brief_description":"X-Girls become fat, dumb, gassy and lazy",
        "created":1582560720,
        "description":"<td align=\"left\" class=\"norm\">Guidelines<br>\r\n<br>\r\nYou may use the comics (Uncanny X-Men, Excalibur, Wolverine First Class, Etc.) as well as X-Men TAS and/or X-Men Evolution.<br>\r\n<br>\r\nPooping and Peeing is allowed as long as they do it in their pants, underwear and/or diapers.<br>\r\n<br>\r\nNo racial slurs or major swearing please.<br>\r\n<br>\r\nNo immobility either<br>\r\n<br>\r\nHave fun!</td>",
        "id":2213870,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1582841640,
        "pretty_title":"X-Girl Slobs"
    }
}