{
    "chapters":{
        "1":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "It was a school day",
                "It was the start to the weekend",
                "Lucas had a class field trip to attend",
                "It was take-your-child-to-work day at Payton's office, and she invited Lucas",
                "Brianna decided that Lucas could take a sick day and takes him to college w/ her"
            ],
            "content":"<div class=\"\"><div> <span>   It was nearing 11:30 at night and Lucas was getting ready to head off to bed. Now in the bathroom brushing his teeth with a special prescribed powder for his special stature, Lucas was already getting groggy. That's when his massive older and slightly oblivious sister Lily came tumbling in. Lucas turned around, but went back to brushing. In just a few short instances, though, Lily, in her blissfully unaware state, turned on the faucet and leaned on the counter. Texting away with a few of her friends, Lily didn't even feel the sensation of her little brother under her expansive chest. Pressed flat to the counter, Lucas could do nothing, not even squirm, as his clumsy sister remained oblivious to the scenario. After a good five or so minutes of inhaling what was left of Lily's perfume, Lucas felt a relief as the immense weight of Lily's mammaries lifted off of him, allowing him to regain proper form and finish his nightly routine.<br>\r\n<br>\r\nWhen Lucas finished brushing, he looked back to Lily who had just grabbed her toothbrush, about to begin what Lucas had just finished. Focused on her own reflection, Lily remained unaware of Lucas's presence and Lucas chuckled. He loved Lily but sometimes she could just be a little bit hollow. Lucas moved toward the makeshift staircase the family had built for him to get on and off of the counter to descend and head back to bed, but didn't quite make it before he caught the attention of the brushing Lily.<br>\r\n<br>\r\n\"O-ohpd!\" she exclaimed, still with the toothbrush in her mouth. Lily quickly spit then looked back to Lucas. \"Lucas! Where ya going? Need a ride back to bed?\". Lucas chuckled and replied \"Yeah, that would be nice. Especially after your enormous rack drained a lot of my energy after pressing me flat against the counter\". Lucas looked up at Lily, who was now gushing bright red. \"I, uh, I didn't even feel you. I'm sorry!\". Lucas laughed again. \"It's no big deal, no harm, no foul\". Lily grinned, then hoisted Lucas up to her shoulder and gave him a ride back to his room. <br>\r\n<br>\r\nWhen they arrived at Lucas's room, which was just the computer room with a tissue box creatively designed into a bed, Lily placed him next to the box, wished him goodnight, then left for her room. Lucas settled in, and within ten minutes was out cold.<br>\r\n<br>\r\nWaking up the next morning, what was the day going to be like for Lucas?</span></div></div>",
            "created":1599454800,
            "id":2898782,
            "title":"Tissue Box Tim"
        },
        "11":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Ride on the armrest between the driver and passenger seats",
                "Ride on Lily's shoulder",
                "Hop in Lily's purse ",
                "Take a seat on the passenger's side"
            ],
            "content":"<div class=\"\"><div> <span>    Waking up to the sound of his alarm, Lucas groaned and rubbed his eyes, coming to and realizing that it was a school day. Begrudgingly getting out of his tissue box bed, Lucas descended the window sill his box bed resided on and walked across the computer desk to his makeshift closet. Grabbing his desired outfit for the day, Lucas then waited on the desk for his mom to come in and pick him up to take him to clean up. And in a few more moments of patience, the door opened and in walked Payton. <br>\r\n<br>\r\n\"Good morning!\" Payton bellowed as she picked Lucas up. \"Are you ready to begin the week off right?\". Lucas groggily shook his head. \"Absolutely not, there's nothing I would want more right now than to head back to bed\". Payton chuckled as she took him to the bathroom. When they arrived, Payton grabbed a plastic cup from under the sink and filled it up, then added some soap. Once she set him down on the sink, Lucas stripped and climbed into the cup to clean up. The whole process took no longer than ten minutes, and Lucas was already out drying off, then repping his chosen attire. Payton dumped the water in the sink then once again picked Lucas up and this time took him to the kitchen where Brianna and Lily were waiting for breakfast.<br>\r\n<br>\r\n\"Morning mom, morning Lucas\" Brianna yawned. \"Good morning you guys!\" Lily joyfully chirped. They each responded with a 'good morning' of their own then the family sat down and began having breakfast. <br>\r\n<br>\r\n\"Ugh, I honestly wish I was back at the high school,\" Brianna mentioned, \"College courses kinda suck and it's so much less interesting without having friends in my classes\". \"Oh come on, it can't be that bad\" Lucas retorted. Brianna shook her head. \"Oh, it is. It absolutely is. I ought to bring you with me one day and show you exactly how lame it is\" she exclaimed. Lucas shrugged his shoulders and got back to his meal.<br>\r\n<br>\r\n\"Lily, hon, I hope you can take Lucas to school with you today. I have to go to work a little earlier than normal and I wouldn't be able to get there on time if I had to take him myself\" Payton explained. \"Yeah, no problemo, mom. You down with that, Lucas?\" Lily asked. Lucas nodded. \"Sure, that works. Although you normally go to school early to hang out with friends, right?\". Lily nodded and responded \"Yeah, but I can keep you in my purse or something until it's time for you to get around\". That worked for Lucas. \"Okay, cool, that'll work\" he replied. <br>\r\n<br>\r\nWith all four finishing up breakfast, they all then went there separate ways, about to leave the house to prepare for their individual days. Lucas grabbed his stuff and hopped on Lily's hand, which then hoisted him up onto her shoulder as she began walking to her car. <br>\r\n<br>\r\nWhen Lily got in the car and buckled up, she asked Lucas \"Where would you feel most comfortable riding?\".<br>\r\n<br>\r\nWhat does Lucas think is best?</span></div></div>",
            "created":1599454800,
            "id":2899278,
            "title":"It was a school day"
        },
        "111":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Needing something from her purse, Lily reaches in and accidentally grabs Lucas",
                "Deciding to be sneaky, Lucas escapes from a slight gap in the zipper",
                "Lily forgets about Lucas and goes about her business"
            ],
            "content":"<div class=\"\"><div> <span>   \"Just set me down on the armrest, I think I'll be okay there\" Lucas said. Lily did as she was told and placed him on the armrest. When Lily started the car and pulled out of the driveway, though, he started having some balance issues. Lucas soon found that the armrest wasn't the most stable platform in the car and he tumbled a few times, fortunately still remaining on it. Despite her little brother having troubles stablizing on the beam, Lily drove pretty recklessly. It's not that she wasn't driving safe, just a little too fast over bumps and other inconsistencies in the road. <br>\r\n<br>\r\nAfter ten or fifteen minutes of rolling all across the armrest, Lucas finally fell off after Lily hit a speed bump. He leaned left and the bump tossed him in the air, sending him onto Lily's seat, just in between her legs. Looking up, Lucas saw his massive sister focused intently on the road of ahead of her, unaware that her brother was now in a more precarious position. To make sure that he would be a little safer, Lucas grabbed on to the fabric of Lily's shorts and held on for dear life. Funny enough, this seemed to be a safer place than on the armrest. That soon changed, though, when Lily hit another speed bump, this time with a little more velocity. <br>\r\n<br>\r\nThe unexpecting bump sent Lucas bouncing on the chair and rolling near Lily's crotch. Lucas managed to stop himself before he hit it but unfortunately that didn't matter as another bump sent Lily up a couple inches which gave enough room to send Lucas into the gap between Lily's butt and the seat. It didn't take long thereafter for gravity to take effect, and Lucas had barely enough time to gasp as the monumental derriere of Lily dropped on top of him.<br>\r\n<br>\r\nWhen Lily hit the seat, she thought she had landed strange because she felt something under her butt. She rubbed the seat a little, then clenched her cheeks, and the odd sensation quelled. These movements made Lucas fall completely limp as his body now became indented on the middle of Lily's shorts. After a few more agonizing moments later, Lily finally arrived at the school and parked.<br>\r\n<br>\r\n\"Alrighty, Lucas, you ready to start the day?\" Lily askes as she looked to the armrest. But he wasn't there. \"Lucas? Did you fall?\" Lucas tried to make as much noise as possible, but whatever came out was suppressed by the material obstructing his view. \"Weird, maybe he fell in the gap\". Lily leaned over to take a look in between the armrest and seat, but saw nothing. This temporaru shift let light to hit Lucas and some fresh air as well, which Lucas appreciated, but he was unable to peel off as Lily fell back to the seat. Once again; however, Lily felt something beneath her butt and this time decided to look under to see if she was sitting on something, and sure enough she was.<br>\r\n<br>\r\n\"Lucas! Oh my god, what happened? How did you get there?\" Lily burst out in surprise. Lucas tried to answer, but all Lily could hear was mumbles as he was still pressed against her butt. As he was peeled off, Lucas gasped a breath of fresh air and relaxed. \"Apparently, the armrest wasn't such a good place because it caused me to take a tumble and... well yeah\" Lucas explained. \"I am so sorry! Here, hop in my purse, you'll be much safer in there\" Lily offered. Lucas did as he was told, then Lily exited the car and went to hang out with her friends. <br>\r\n<br>\r\nWhat happens when Lily gets to her friends?</span></div></div>",
            "created":1599620580,
            "id":2899765,
            "title":"Ride on the armrest between the driver and pass..."
        },
        "113":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Someone trips and stumbles into Lily's things, sending Lucas flying",
                "Nothing happens, Lucas makes it to the chair leg and swiftly climbs it",
                "Rembering Lucas, Lily grabs her purse and knocks Lucas over into the aisle"
            ],
            "content":"<div class=\"\"><div> <span>Without thinking of the possibility that his clumsy sister might forget about him, Lucas chose Lily's purse since he considered it the safest mode of transportation. Lily obliged and zipped open her purse and placed Lucas on top of some spare tissues she had in there to make sure he was comfortable. Once everything was squared away and both parties were comfortable, Lily buckled up and drove away.<br>\r\n<br>\r\nThere were a few bumps here and there that knocked Lucas off his balance and his soft perch, but it was nothing more than an inconvenice and he quickly repositioned himself. The entire ride was more a less just these actions repeating themselves over and over, but it wasn't such a long ride that Lucas grew tired. Although Lucas escaped the drive unhurt and remained energetic, Lily carrying her purse into the school was a different story. The intial tossing of the strap over Lily's shoulder first sent Lucas flying up against the wall of the purse with good impact. Then, the swaying and bumping of the purse into Lily's side continued to toss Lucas about, bruising him here and there. The most unfortunate part of this, though, was the fact that Lily had forgotten about her little brother. <br>\r\n<br>\r\n\"Lily!\" Lucas yelled, \"Lily! Are we near my class? It should be starting soon!\". There was no response, only further movement. Lucas sighed and shook his head. He knew his sister wasn't the most attentive person in the world, but sometimes it could just be a little annoying. He kept bellowing for his sister, hoping she would hear him. But nothing would come of it as the bell rang and Lily set her things beside her desk in her first period. Noticing a slight opening in the purse, Lucas decided to take a chance and exit to try and get his sister's attention back to him and his dilemma. <br>\r\n<br>\r\nSqueezing his way through the gap, Lucas caught a glimpse of the classroom he was in, and it was not much different than the ones he attended. Looking around, the class was nearly full, with only two or three vacant seats. But that wasn't necessarily significant for Lucas, since he was driven on climbing Lily. With no further delay, Lucas leapt out of the purse and made his way to Lily's chairleg. <br>\r\n<br>\r\nDoes anything happen while Lucas is making the short trip or does all go smoothly?</span></div></div>",
            "created":1602395040,
            "id":2918876,
            "title":"Hop in Lily's purse "
        },
        "1131":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "To Lucas's dismay, Quinn",
                "A confused Stella",
                "One of the other two girls"
            ],
            "content":"<div class=\"\"><div> <span>While Lucas was making his move to Lily's chair, a guy around Lucas's age was coming in a little late and not paying attention to where he was walking, tripped over Lily's purse and backpack and sent Lucas airborne. Screaming as he flew through the air, Lucas looked around trying to find a viable landing spot which wouldn't hurt him too much. But before being able to alter his flight, Lucas hit with a thud on a table shared by four students who were oblivious to the mini man's descent. Getting up with a grunt, Lucas took a peek at who the students were to see if he recognized any of them. To his misfortune, one of them was Quinn Daniels, the stuck-up athlete. The only other person Lucas recognized was Stella Burbank, a freshman who Lucas wasn't really acquainted with, but knew she was very impressionable and wanting nothing more than to be popular. To do this, she often went along as a part of either Brittany Shoa's posse or Quinn's. The other two were girls who Lucas was unfamiliar with. <br>\r\n<br>\r\nWhile Lucas was recovering from his fall, one of the girls noticed him. Who was it?</span></div></div>",
            "created":1602395940,
            "id":2918886,
            "title":"Someone trips and stumbles into Lily's thin..."
        },
        "1132":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Go out the door and try and find his class on his own",
                "Get the attention of the neighboring girl",
                "Take time to get to Lily"
            ],
            "content":"<div class=\"\"><div> <span>Fortunately, nothing impeded Lucas on his way to the chair and he quickly made his ascent up to Lily's thigh. Considering Lily was slightly hunched over her desk, Lucas thought that it might be easier to climb her from the back and went around to the back of her shorts. Looking up, Lucas was a little bit initmidated by the distance he had to climb, but shook it off after remembering all of the times he had done this before. Grabbing hold of the fabric of Lily's shorts, Lucas hoisted himself up and from there, it was a breeze. About halfway up Lily's back, though, there was an issue. Lily shifted back to an upright position and the angle of her back drastically changed, causing Lucas to grab as tight as he could and delay his climb. Thankully, Lucas adjusted well and he continued the climb after a few moments. From there, it only took him a few minutes to climb the rest of the way up to Lily's shoulder where he would try and get her attention. <br>\r\n<br>\r\nOnce at the top, Lucas contemplated how he was going to get Lily's attention. The simplest way would to climb her neck and reach her ear, although the contour of the side of her neck would provide an awkward climb. Lucas could also climb the back of her neck and get Lily's attention from the top of her head, although that might not be as effective. The last thought that popped into Lucas's mind was getting as close to the front edge of Lily's shoulder and trying to visually get her attention, but that might also be risky. Lucas took too much time to mull over these options, however, and Lily got up out of her seat to go do something, causing Lucas to stumble backwards, unable to regain his balance and falling down the back of his sister, now in line with the back left pocket of the shorts. Without any manuvering, Lucas was fortunate enough to fall into his sister's pocket and was safely stowed for the time being.<br>\r\n<br>\r\nDanger was still very much present, though. Since Lily was only up temporarily, she might sit on Lucas and keep him firmly trapped if Lucas didn't make a move to get out. Understanding the dilemma, Lucas quickly made his move and lifted himself up to the edge of the pocket and looked for a viable escape route. The only one that he could find was down Lily's leg. Without any further hesitation, Lucas hopped out of the pocket and slid down the back of the shorts, maintaining his grip despite the shaking coming from Lily's movements. Before Lily got back to her seat, Lucas dropped to the ground and immediately regretted his decision. Now that he was a good distance away from his sister, there was no way he could get her attention and figure out the situation at hand. Instead, Lucas had a few choices: a.) the classroom door was nearby, Lucas could slip out and risk traveling through the hallway on his own to get to his next class  b.) get the attention of the nearest student, which was a girl Lucas was unafamiliar with or c.) risk taking a long time getting over to Lily.<br>\r\n<br>\r\nWhat does Lucas decide to do?</span></div></div>",
            "created":1602465360,
            "id":2919341,
            "title":"Nothing happens, Lucas makes it to the chair le..."
        },
        "12":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "\"No, I'm just gonna hang out at the house today\"",
                "\"Lily, if you don't mind, could I come along with you?\"",
                "\"Is it all right if I come to the workplace event?\"",
                "\"Yeah, I was planning on going over to Sydney's house for a little while\""
            ],
            "content":"<div class=\"\"><div> <span>   Groggily waking up and stretching, Lucas yawned and looked to the nearest alarm clock which read 9:13. It was Saturday, and the beginning of a hopefully nice and relaxing weekend after the busy and somewhat stressful week. Lucas got out of bed, then grabbed some comfortable clothes out from his makeshift closet and descended the window sill holding his bed to head his way to the bathroom. After five or so minutes, Jack made the full descent from the window sill to the floor and made his way to the bathroom. Noticing there was already a plastic cup full of water and soap ready for him, Lucas wasted no time in getting in and cleaning up.<br>\r\n<br>\r\nWhen he was finished in the bathroom, Lucas got dressed and went down to the kitchen to grab some breakfast, when Lily came approaching him quickly. <br>\r\n<br>\r\n\"Hey, good morning, Lily\" Lucas greeted. But Lily didn't notice him, her focus elsewhere as she kept walking. Lucas quickly realized what was about to happen in Lily's oblivious state and made a desperate jump to the side in hopes of avoiding Lily's sole. But it was no use. Lily's right foot came down on Lucas, plastering his body to her sole and her head in between her toes. Admittedly, her foot actually smelled quite nice because she just got out of the shower, but when Lucas got a whiff of the toe next to him, he gagged. The gunk Lily had accumulated had obviously been there for some time and the smell it exuded was something fierce. Lucas turned away from her toe as quickly as he could, then hoped that Lily would eventually feel him, as her walk felt seemingly endless.<br>\r\n<br>\r\nFortunately, Lucas didn't have to wait too much longer, as Lily stopped and shifted her weight, temporarily pressing Lucas further into her foot and intensifying the odor coming from her toe, but this caused her to feel him and take a look.<br>\r\n<br>\r\n\"Oh no! Lucas! I'm so sorry!\" Lily profusely apologized as she peeled Lucas off of her foot. A little doozy after the nauseating movements and smell, Lucas forgave her. \"It's okay, but just try to be more aware when you're walking in the morning\". Lily nodded and gave Lucas a kiss, slobbering over him in the process. \"Lily, you goober, knock it off\" Lucas said. She giggled. \"I'm sorry, I'm sorry. Come on, let's go get breakfast\". Lily carried Lucas to the table and Brianna and their mom arrived soon after, then the four sat and began eating and conversing.<br>\r\n<br>\r\n\"Hey mom, Juli and Elia were thinking about coming over for the night, is that okay?\" Brianna asked. Lucas grimaced. Those two always gave him nothing but trouble whenever they were around him, making him their temporary toy. And escaping just made them all the more ecstatic about playing with Lucas, they seemed to enjoy cat and mouse quite a bit.<br>\r\n<br>\r\n\"Sure. I'll be leaving at five to go to a workplace event, but I should be back by eight or nine to fix you guys dinner\" Payton permissed. Brianna smiled and thanked her. \"With that in mind, could I go to the mall with Laura, Jade and Tierra?\" Lily questioned. Payton shrugged and conceded. \"I don't see why not. If you're going to be out for awhile, just make sure to be back by five or six\". Lily grinned her cute grin  and joyously said \"Okay!\".<br>\r\n<br>\r\n\"What about you, Lucas? Do you have any plans?\"<br>\r\n<br>\r\nWhat does Lucas say?</span></div></div>",
            "created":1599544080,
            "id":2899296,
            "title":"It was the start to the weekend"
        },
        "121":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Still within the colossal ass of Elia",
                "Laying down on a bed, surrounded by the three girls",
                "On the palm of Elia"
            ],
            "content":"<div class=\"\"><div> <span>   \"No, nothing other than hanging out is on my agenda for this weekend\" Lucas replied. \"Okay, that's cool\" Payton said. \"Although I forgot, I should probably go out shopping this afternoon because we're running low on a few supplies\". The three kids nodded in understanding. With that, the rest of breakfast was pretty uneventful with the four of them making idle conversation, nothing all that interesting. <br>\r\n<br>\r\nAfter breakfast, Lucas went out to the living room to watch some television in the mean time as Lily went up to her room to get ready to go out shopping and Brianna was texting her friends. The morning was the same as breakfast: pretty uninteresting. But that didn't last once Juli and Elia arrived. Lucas had thought they would have come later in the afternoon, but apparently they just couldn't wait. They went to the kitchen and greeted Brianna as Lucas grew a little skiddish watching T.V. <br>\r\n<br>\r\nLooking back over to the kitchen for a moment, Lucas noticed the two girls, Juli and Elia, taking a peek at him while they were talking with Brianna. He shuddered. Lucas had a feeling they had some bad intentions for some point today. He moved over behind a nearby pillow to escape their looks and braced.<br>\r\n<br>\r\nListening intently, he heard one of the girls mention about moving out to the living room and then heard footsteps. Lucas, although panicking, froze. He didn't know what to do or think. WIthin a few moments, the girls had reached the living room and began taking their places. Brianna took a seat on the couch, at the end furthest away from Lucas. But apparently, Juli and Elia had no intentions on sitting next to her because their footsteps were very near Lucas. When Juli sat down, Lucas felt the cushon next to him indent with her sitting down, and could only hope that Elia would either sit right next to her or go a little further down. But that wouldn't be the case as the pillow was picked up and tossed aside.<br>\r\n<br>\r\nWhen the pillow left Lucas's side, he looked up to find a grinning Elia. Lucas quickly got up to run, but he didn't get far before Elia scooped him up and sat down. As Brianna was distracted by her phone, Elia nudged Juli and motioned to her new little captor, to which Juli gave a smirk. Struggling to slip out of Elia's grip, Lucas got continuously nervous with failed attempt after failed attempt. But Elia gave her full attention to him and whispered \"We're going to have an extra special day today, my little pal\". WIthout waiting for Lucas to retort, Elia pulled out the back of her leggings and panties, then tossed Lucas in. He bounced around a few times before settling at the top of her crack. Trying to use this to his advantage, Lucas scrambled to climb out, but Elia once again grabbed him and this time shoved him down and in deep into her crack, to her delight. <br>\r\n<br>\r\nHeld tightly by the overwhelmingly large and sweaty cheeks of Elia, Lucas could do no further good and yelled. But no one could hear him, as the large, white hills silenced him. Elia giggled, enjoying the sensation Lucas gave her and squeezed her cheeks a bit, taking a little bit out of Lucas. Now coated in sweat, Lucas moaned in discomfort. But it wasn't over yet, as Elia continued to dish out punishment with a silent (to Brianna and Juli) but very much deadly fart, engulfing Lucas. Choking on the noxious fumes, Lucas passed out.<br>\r\n<br>\r\nComing to, where did Lucas find himself?</span></div></div>",
            "created":1599629700,
            "id":2899831,
            "title":"\"No, I'm just gonna hang out at the hou..."
        },
        "1211":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Payton is home with family friends",
                "Lily is back looking for Lucas",
                "Bri, Juli and Elia come downstairs to prank Lucas"
            ],
            "content":"<div class=\"\"><div> <span>Groggily coming to, Lucas realized that he had not changed locations while he was out. Still tightly held by Elia's firm cheeks, he could do no more than scream and squirm. This came to Elia's delight, however, and she grew playful now that her little buddy was awake again. She scrunched her cheeks together, sucking much of Lucas's newly regained energy away. Elia moved back and forth on the couch, forcing Lucas further into her crack and closer to her hole. Lucas did what he could to at least slow down the process, but to little effect. Fortunately, Elia quit moving around before Lucas got too close, as her and the other two girls decided to move up to Brianna's room. Once there, Elia grabbed Lucas and took him out of her ass, then placed him on the bed.<br>\r\n<br>\r\n\"Lucas? What are you doing here?\" Brianna asked, puzzled. Elia and Juli giggled. \"It was Elia's fault! She--\" before Lucas could finish, Elia picked him up and gave him a kiss. \"What he meant to say, was that he and I were having a lot of fun and we thought that he should join us\" Elia chirped. Lucas shook his head. \"That's not true at all, she f-ing--\" again, Lucas was cut off, this time by Juli. \"I saw what happened, Lucas is just being dramatic\". Brianna laughed and shrugged. \"Well, it's not a big deal, he can stay up here\". <br>\r\n<br>\r\n\"No, I'm going to head back downstairs, I don't want to be up here\" Lucas informed. As he slid down the covers on Brianna's bed, though, a hand grabbed him. \"Aww, why? We aren't THAT bad\" Elia pouted. \"Yeah, Lucas, come on. We can have lots of fun\" Juli giggled. Lucas slipped out of Elia's grip and continued his descent off of the bed. \"No thank you, I'm perfectly content with the choices I'm making\" he reiterated. Brianna rolled her eyes and convinced the girls to let him go.<br>\r\n<br>\r\nNow out of the room, Lucas went back downstairs to the living room. His mom had left to go get groceries and Lily had gone out with her friends, so he was alone to do pretty much whatever he wanted. Although, with nothing to do other than watch television or text his friends, Lucas went out to the living room. He jumped up onto the couch and watched whatever was already on. <br>\r\n<br>\r\nFor the next half an hour or so, everything went smoothly, nothing really happening. After the half-hour, though, what disturbs the peace?</span></div></div>",
            "created":1602546960,
            "id":2920081,
            "title":"Still within the colossal ass of Elia"
        },
        "13":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "It was Serena, an entitled rich girl who took what she wanted",
                "It was Brittany, one of the popular girls who wanted to play a prank on Lucas",
                "It was Emma, a punk girl who didn't believe Lucas was as small as he was",
                "It was Maria, a Mexican exchange student who was unaware of Lucas's deal"
            ],
            "content":"<div class=\"\"><div> <span>   As his alarm went off waking him up, Lucas slowly came to, realizing that today was the field trip for his science class. He didn't really want to go, but it was better than a day of normal school, so Lucas started his morning routine and prepared for the day. Lucas finished his morning shower and getting dressed in no longer than ten minutes and quickly ate up his breakfast, ready to get the show on the road. After breakfast, his mom carried Lucas out to her car and drove him to the school. There, she dropped him off at the front entrance of the school where there was a school bus waiting for the class. Wishing him a good day, Payton then turned the car around and left. <br>\r\n<br>\r\nLucas approached the bus, but to his surprise, no other students had arrived yet. That was fortunate for him, though, because his diminutive stature often left him getting trampled when boarding a vehicle. Lucas made a small leap over the gap between the sidewalk and door, then climbed up the stairs and made his way to his designated spot for specifically him. Although it was the same size as any other seat on the bus, this one was reserved for Lucas, so he wouldn't have any trouble in mingling with the much larger students. <br>\r\n<br>\r\nAfter waiting a few more moments, Lucas could finally hear the voices of his fellow classmates and the teacher. First boarding were a couple of boys who Lucas didn't really know or recognize. Following them was the teacher, Mrs. Beck and after her followed the rest of the class. As many of the students boarded, Lucas noticed a few of his friends coming along and he waved and greeted them, to which they warmly responded. <br>\r\n<br>\r\nWhen the final few students finally boarded, though, a shadow loomed over Lucas's head and he looked up to find the massive backside of a student descending his way. <br>\r\n<br>\r\nWho was it and did they realize that they were in Lucas's reserved seat?</span></div></div>",
            "created":1599549780,
            "id":2899326,
            "title":"Lucas had a class field trip to attend"
        },
        "131":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "At the mall with a couple of her friends",
                "At home by herself",
                "On the bus heading back to school"
            ],
            "content":"<div class=\"\"><div> <span>   Lucas tried to dive out of the way of the massive behind of whoever this was, and nearly succeeded, but he wasn't quick enough as his body was squashed under the left cheek of the legging-covered butt. Although Lucas wasn't able to squirm out any, his head was free, so he could call out to whoever this was and get their attention. <br>\r\n<br>\r\n\"Hey! Hello! You're sitting on me!\" Lucas yelled. The girl looked down down and noticed Lucas's head popping out from the side of her butt. Catching a look of the girl's face, Lucas recognized it as belonging to Serena, a notorious rich brat who didn't really care for anyone else other than herself. He continued to protest and try to get her off of him, but Serena just huffed and adjusted herself. This temporarily let Lucas free, but her adjustment was too quick for Lucas to get out of the way, and now he was buried under her all the way, pressed firmly into her not so large but still firm butt. <br>\r\n<br>\r\nAs a reward for slightly irritating her, Serena began to rub her ass on the seat, rubbing Lucas into the fabric of her leggings and hurting him. She didn't stop there, though, and next began hopping up and down a little bit, taking more and more energy out of Lucas each time she slammed into him. Finally, when Serena had had her fun with Lucas and he fell limp, she lifted her seemingly massive ass off of him and picked him up. Barely conscious, Lucas could barely register Serena tossing him into the front of her pants as a trophy.<br>\r\n<br>\r\nFortunately, Serena had placed Lucas outside of her panties, but that didn't matter so much as the humidity and smell quickly finished off what was remaining of Lucas's consciousness. <br>\r\n<br>\r\nWhen he awoke, Lucas noticed the still humid but now slightly damper environment and very little light. He was kept held tightly to whatever it was in front of him, which was soft and squishy. Lucas tried to budge out of wherever he was and escape, but when he did so, he heard a moan from above and something push him into the object in front of him. The odd odor intensified as the environment grew warmer and damper. Lucas then came to his senses and gagged. He knew where exactly he was and was absolutely disgusted. The fact that it was Serena who had him in her possession made everything all the worse. <br>\r\n<br>\r\nTo avoid further pleasing her and being pressed into her pussy, Lucas stopped moving and awaited Serena to calm down and focus on whatever it was she was doing. Doing so caused Serena to grumble, but she didn't retaliate. Instead, she continued on what she was doing, leaving Lucas to suffer aside her monstrous privates. <br>\r\n<br>\r\nIt was another agonizing hour or so before Serena finally took Lucas out of the horrendous confinement he was kept in. Lucas breathed a heavy breath of fresh air and glared at Serena who was merely smirking at him. <br>\r\n<br>\r\n\"I wish you had given me a better time a little while ago, I wouldn't have to do what I'm about to do. But, you decided to be a little brat, so in you go\" Serena giggled. Lucas looked below him and noticed an open purse. Serena let go of Lucas and he fell a ways before hitting a packet of tissues and settling down. Lucas made a quick dash for the top of the purse, but once again wasn't quick enough as Serena zipped it up and tossed it over her shoulder. Now with no hopes of escape, Lucas had to wait out and see where Serena was going.<br>\r\n<br>\r\nWhen Serena opened her purse again, where was she?</span></div></div>",
            "created":1599693720,
            "id":2900196,
            "title":"It was Serena, an entitled rich girl who took w..."
        },
        "132":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Yes and he runs to the nearest other group of students",
                "Yes, but it was Brittany taking him off",
                "No, he remains stuck"
            ],
            "content":"<div class=\"\"><div> <span>Lucas tried to dive out of the way of whoever was about to sit on him, but it was too late. The massive derriere plastered Lucas between the left butt cheek and the seat, rendering him hopeless. The owner was none other than Brittany Shoa, one of the more popular girls in Lucas's grade. She bounced up and down and rubbed her butt across the seat, all the while laughing. Lucas, on the other hand, was not having as good of a time. The more and more Brittany rubbed and bounced, the more energy Lucas was drained of. But Brittany eventually grew bored, satisified with what she had accomplished. Although the bus was moving, she got up, peeled Lucas off of her butt and walked away laughing. <br>\r\n<br>\r\nFinally, the pain and energy-draining was over and Lucas could relax. Now he got an idea of who Brittany was. It would be for the best if he stayed away from her. The rest of the ride went much smoother, with no one impeding on Lucas's spot and him distracted by texting his friends. Once the bus stopped, though, the story would change. <br>\r\n<br>\r\nGiven the front spot of the bus and the fact that he was so small, Lucas was given honors in getting off the bus. He hopped off his seat and began to get to the stairs when a sudden pounding from behind him took Lucas by surprise. He turned around and there, once again, was Brittany Shoa who appeared to be exiting the bus, despite Lucas's requirement of going first. Lucas stood there for a moment, unsure of what to think about it, but soon ennough he couldn't think any because Brittany had stepped on him and Lucas was stuck to the bottom of her shoe. <br>\r\n<br>\r\nOnce off the bus, Brittany moved over to the nearest available bench and sat down, waiting for her clique. She felt something on the bottom of her shoe and took a peek at what it was. When Brittany saw that it was Lucas, she chuckled then put her foot down with force to maintain his adhesion. This was very painful for Lucas, but he couldn't do anything. In addition to the pain and adhesion to the shoe, Lucas was picking up dirt and other debris from the ground. He tried to move and get out of this predicament but it was no use. <br>\r\n<br>\r\nA few minutes later, Brittany stood up and walked with her group as the class finally began their field trip. Along the way, she would sometimes put extra force in her steps or step in something a little dirty to annoy Lucas. After about an hour, although what seemed like many hours for Lucas, Brittany and her gang stopped with the rest of the class for lunch.<br>\r\n<br>\r\nWhen the group found a table and Brittany sat down, is Lucas able to peel off her shoe?</span></div></div>",
            "created":1602568320,
            "id":2920277,
            "title":"It was Brittany, one of the popular girls who w..."
        },
        "134":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Take a chance and go for an exit",
                "Stay put and wait for Vessa to get him"
            ],
            "content":"<div class=\"\"><div> <span>Right before being pressed into the fabric of the jean-shorts the person was wearing, Lucas made out the tan skin and medium black hair of the girl. \"This must be the new exchange student\" Lucas thought. He was barely able to register this as he was soon pushed into the back of the shorts, just barely above the cutoff between the shorts and the girl's bare skin. Apparently, the girl became uncomfortable and shifted, dragging Lucas along the seat. Unfortunately, his screams were muffled by the girl's ass and he remained undiscovered.<br>\r\n<br>\r\nLucas would continue to be rubbed and pushed around by the enormous butt which he was covered by until the bus came to a complete stop, as the class arrived at their destination. The girl lifted her butt slightly off the seat, but instead of moving to the aisle to get off the bus, turned around to check what she was sitting on. The girl gasped as she noticed Lucas's outline on the seat. She picked him up and took him off the bus.<br>\r\n<br>\r\nGetting away from the crowd for a moment, the girl began speaking. \"Are you real?\". Lucas, although sore, nodded his head and verbally confirmed his existence. \"Well, I'm Maria. Sorry for what happened\" she genuinely apologized. \"No worries, you didn't know\" he reassured. Their conversation was interrupted when the teacher called for Maria to join the rest of the group. Maria looked down at Lucas. \"I got to go, you should come with\". Lucas didn't argue, and Maria placed him in her back left pocket. <br>\r\n<br>\r\nA good ways into the trip, Maria took Lucas back out and checked in on him. \"Little man okay?\" she asked. Lucas gave her a thumbs up. \"Yeah, everything's good. How's the field trip?\". Maria smiled. \"It's good, thanks for asking. I hope you're not uncomfortable in there?\". Lucas shook his head. \"Okay, good. You want to stay out for a little while?\". Lucas agreed and Maria put him on her shoulder.<br>\r\n<br>\r\nThey continued to chat with each other for a little while, until one of the other exchange students noticed something on Maria's shoulder and strolled up. \"Maria!\" the girl piped. Maria jumped and cast Lucas off balance. \"Ugh, Vessa, don't do that\" Maria annoyingly expressed. Vessa giggled. Lucas looked at her, not familiar with her. Vessa looked to be Hispanic, like Maria. She was about the same height, but wore more open clothing and sported bigger assets than Maria. Lucas peered into her cleavage and gulped. If he managed to wind up in there, there was no telling how far down he could slip. <br>\r\n<br>\r\n\"So, what's that on your shoulder, Maria?\" Vessa said as she bit her tongue. Maria quickly grabbed Lucas and hid him in her hand. \"Nothing, it's no big deal\". Vessa raised her eyebrow. \"Are you sure? Cause it seems like you're hiding something from me\". Maria nervously responded \"N-no, it's just something personal\". In one smooth motion, Vessa uncoiled Maria's hand and took what was in her hand. Pulling back the waistband of her leggings and said \"I don't think you'll mind if I do this?\" before dropping Lucas down her leggings and panties, settling him between her right cheek and the panties. Vessa laughed and snapped her leggings back. \"Vessa!\" Maria protested. \"I'll give it back to you once I know what it is, don't worry, Maria\" Vessa giggled. Without knowing what to do, Maria worriedly looked at her but decided to do nothing. The two then walked their way back to the group and continued the field trip.<br>\r\n<br>\r\nMeanwhile, Lucas was loosely secured in Vessa's pants. Although he had moving room, Lucas didn't know whether he should escape or stay put. If he moved, he could unintentionally fall into Vessa's crack or settle deeper between her cheek and her panties which would make mobility very limited. On the other hand, staying put meant that Vessa would inevitably find him and who knows what she would do.<br>\r\n<br>\r\nIn the end, what does Lucas choose to do?</span></div></div>",
            "created":1603494360,
            "id":2927698,
            "title":"It was Maria, a Mexican exchange student who wa..."
        },
        "14":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Yes, and they make it to the offices without any issues",
                "No, and he falls onto the passenger seat",
                "No, and he falls onto the driver's seat"
            ],
            "content":"<div class=\"\"><div> <span>   Lucas woke up to a knock at the door. Slowly lifting himself up, he saw the door open and in walk his mom.<br>\r\n<br>\r\n\"Good morning, Lucas!\" she cheerfully greeted. \"I have some news. Today is take-your-child-to-work day at the offices, would you like to come?\". Lucas thought for a moment. It would make more sense for her to bring either Lily or Brianna because they are normally sized, but he couldn't really question why she wanted to bring him, it would be a day off of school. <br>\r\n<br>\r\n\"Sure, sounds good. When do you want me ready?\". <br>\r\n<br>\r\n\"We'll be leaving the house in about an hour, so you should probably get up and clean up now so you have enough time for breakfast\" Payton replied. Lucas nodded and dragged himself out of bed, then descending to the desk to hitch a ride on his mom's shoulder to the bathroom. Payton dropped Lucas off on the sink, prepped his cup of water, then went to make breakfast. Lucas wasted no time in cleaning up, taking only about fifteen or so minutes to get in, wash up, then get out and dry off. Now dressed and ready to go, Lucas left the bathroom and went to the kitchen.<br>\r\n<br>\r\nWhen he arrived, the girls weren't there. <br>\r\n<br>\r\n\"Hey mom, where are Lily and Brianna?\" Lucas asked. \"They went to school, dear. Remember? They like to go earlier than you\" Payton informed. Lucas nodded. It was a little awkward through breakfast, but it didn't take real long for the two to finish their food and prepare to leave. <br>\r\n<br>\r\n\"Okay, Lucas, are you ready to go?\" Payton asked. \"Yup, whenever you're ready\" he confirmed. Payton grabbed a few things and flung them in her purse, then grabbed Lucas and left the house. Getting into her car, she placed Lucas on the dashboard then buckled up. \"Where would you be the most comfortable riding, Lucas?\". Lucas motioned to the armrest between the two front seats. Setting him down there, Payton then started the car and began to pull out of the driveway. Lucas faltered a little and fell over after the initial jolt of the car, which Payton noticed.<br>\r\n<br>\r\n\"Are you sure you want to ride there?\" she implored. \"Yeah, I'm fine, it's no big deal\" Lucas assured. Payton shrugged, then one again focused on driving.<br>\r\n<br>\r\nAlong the way, is Lucas able to maintain his balance?</span></div></div>",
            "created":1599595740,
            "id":2899609,
            "title":"It was take-your-child-to-work day at Payton..."
        },
        "143":{
            "author_id":"froakie",
            "author_name":"Froakie",
            "choices":[
                "Payton is indeed going to her work and it seems she has just arrived.",
                "Payton had taken a day off, she is at her alternative medicine's friend's house.",
                "There was still quite a bit more time left for the drive!!  Will Lucas make it?"
            ],
            "content":"<div class=\"\"><div> <span>Lucas positioned himself after his earlier fall on the armrest as his mother drove to work.  Grasping carefully, he had a good firm grip this time as he sat down with his legs forward.  He watched as his mother turned on the radio, pausing at the intersection to look down to make sure that he was alright too.<br>\r\n<br>\r\n\"I think you are going to enjoy coming to work with me.  I happen to have a coworker who has done a lot of intensive research into your condition.\" Payton said as she paid attention to the road now.<br>\r\n<br>\r\nLucas didn't answer, his eyes rolling.  He realized now why his mother wanted him to come over one of his sister's.  His mother had constantly taken him to various places for people who could 'help' him.  People peddling special oils, massages, reflexology, garlic beads, and she had even taken him to a 'specialist' who recommended that he be placed in his mother's shoe for a whole week.<br>\r\n<br>\r\nThat was not a good week.<br>\r\n<br>\r\n\"I think there is some good stuff though that could come from this.  I know you probably don't think so, but I have read some amazing testimonials.\" Payton adding, still paying close attention to her driving.<br>\r\n<br>\r\n\"Testimonials? Mom, I thought this was a coworker.\" Lucas asked, suddenly thinking that maybe this trip wasn't going to her work at all.<br>\r\n<br>\r\n\"It is! I worked with her. . err. . once.  I mean, we were working at a department store when we were teenagers but. . \" Payton said, realizing she had been caught.<br>\r\n<br>\r\nLucas was a bit annoyed with his mother and he still wasn't even sure if he was actually going to his mother's work or if he was going to some alternative medicine person's place instead.  Still, he knew her heart was in the right place.  Lucas knew that his mother loved and accepted him, but she just wanted him to be normal sized.  To have a 'normal' life.  He had given up on that idea though, he knew this was just how things would be.<br>\r\n<br>\r\nLucas was distracted from his thoughts though and felt himself slipping from a turn!  He desperately grabbed the sides of armrest but it was too late!!  He was slipping into the driver's seat where his mother was driving!! <br>\r\n<br>\r\n\"Mom, loo-Hmmmph!!!\" was all that was heard in the car before Payton's gargantuan ass silenced her son.  <br>\r\n<br>\r\n\"Now, now, Lucas.  I know you don't think these things could help, but you have to keep an open mind.  Yes, some of the methods we've tried to help restore your size haven't quite. . worked out but at least we are trying.\" she said annoyed that her son was against her on this.<br>\r\n<br>\r\nShe didn't realize that he was against her in a different way.<br>\r\n<br>\r\nLucas struggled and moved the best he could as his mother's ass mashed him into the seat below.  It was a good thing the seat was cushioned, or he'd be crushed completely.  He fought against the weight though as he struggled to breathe.  He might not get crushed but there was the real possibility that he could suffocate.  He once got stuck in Brianna's underwear and had passed out there.  That was an awkward conversation afterwards.<br>\r\n<br>\r\nThe drive to wherever Payton was taking her son was about fifteen agonizing minutes at least according to her GPS though he couldn't quite see it now from where he as at. Lucas realized he might spend the entire trip stuck under his mom's huge, heavy, and hot ass. He could feel himself getting very warm and bothered by the immense weight and pressure he was on. Sweat poured down Lucas' face as he struggled below.  She wasn't feeling him though.  Or maybe she did?<br>\r\n<br>\r\nLucas felt movement from above.  It seemed that Payton was repositioning herself.  She lifted her monolithic ass into the air!  Taking a big breath, Lucas prepped himself to re-reach the armchair.  He got himself ready to leap and. .  . .<br>\r\n<br>\r\nWHAM!!!<br>\r\n<br>\r\nHis mother's ass once again silenced him.  <br>\r\n<br>\r\nPayton’s huge, curvy ass was bearing down on Lucas' whole body, squashing the very life out of him. He had to do something or he'd really be in for it.  <br>\r\n<br>\r\n\"I don't like your silence on this, sweetie.  You know I'm not the bad guy.  I love you and I just. . \" Payton stopped, feeling quite sad for her son.  She fought back tears as emotion filled inside of her.<br>\r\n<br>\r\n\"I want you to be happy.\"<br>\r\n<br>\r\nEvidently, Payton was somewhat uncomfortable and she shifted herself back and forth, unknowingly grinding her ass over Lucas as he still struggled to make his way out from under her.  Ironically, if Lucas could have talked he would have reassured his mother that it was okay though he definitely wasn't happy at the moment.  He was still trapped though.</span></div></div>",
            "created":1599835020,
            "id":2901135,
            "title":"Driven by Payton's Ass!"
        },
        "15":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "No, he stays secure in Brianna's rack",
                "Yes, he sinks low enough in her bra to come loose and fall down her shirt",
                "Yes, Brianna takes him out of his confinement"
            ],
            "content":"<div class=\"\"><div> <span>   The door to the computer room jolted open and woke Lucas. Quickly leaning up, Lucas noticed Brianna, who was already showered and dressed, entering. <br>\r\n<br>\r\n\"W-what the heck?\" Lucas groggily asked. \"Good morning!\" Brianna gleefully responded. \"You excited to come with me to college, little bro?\". Lucas was confused. \"Uh, no? I have school today too, you know\". Brianna laughed. \"Oh, nonsense, you can take a sick day. Tell you what, hurry up and get dressed and I'll tell mom that I'll be taking you to school\". Shaking his head, Lucas responded \"No thanks. To be honest, I'd rather go to school today\". \"Oh for crying out loud,\" Brianna rolled her eyes, \"just get dressed pipsqueak\". Lucas groaned, but did as she said. <br>\r\n<br>\r\nOnce Lucas had gotten out of bed and changed, Brianna approached him. Letting out nothing but a giggle, she grabbed Lucas and pulled back the front of her shirt. Lucas tried to protest but was unable to as Brianna threw him in. <br>\r\n<br>\r\n\"What t-\" Lucas again tried to argue, but Brianna pushed him further down into her cleavage, smothering him between her mountains and hiding him from plain sight. \"We can't have mom seeing you, now can we?\" Brianna chuckled. Pressing her boobs together to make sure Lucas was nice and safe, Brianna then left the computer room and headed to the kitchen, where Payton was the first to meet her.<br>\r\n<br>\r\n\"Good morning, Bri, is Lucas up?\" she questioned. Brianna nodded and replied \"Yeah, he's cleaning up right now. But you don't have to worry about him this morning, I'll take him to school\". \"Are you sure?\" Payton asked. Brianna nodded and Payton thanked her. Finishing up her breakfast in just a few minutes, Brianna then went upstairs to pretend like she was getting Lucas, then went into her room to check on him.<br>\r\n<br>\r\nPulling Lucas out of his tight but soft prison, Brianna giggled as he started to argue. \"Bri! What were you thinking? I could have suffocated in there!\". Brianna just smiled. \"But you didn't, did you? You seem completely fine to me, Lucas. I think you ought to spend some more time in there and get accustomed because that's the safest place I can keep you. Unless you want to change locations?\" she motioned to her leggings. Lucas rapidly shook his head. \"No, no. That's okay, I'll stay up here\". Brianna huffed, \"That's what I thought. Now get comfortable and be quiet, it'll be a pretty long ride\" Brianna ordered. Before Lucas could put in another word, Brianna once again dropped Lucas into her bosom and this time, pushed him further down her chest to where not even his hair was visible. <br>\r\n<br>\r\nWith no further necessities in the house, Brianna went to her car and buckled in. She gave her chest one little shake to mess with Lucas. Bouncing off the walls of the jiggling flesh, Lucas hopped up for a seocnd before coming to a rest in the same, tight spot he was before. Settling in without any possible mobility, Lucas fell limp as he gave up and waited for this whole experience to end. But it had just begun as Brianna finally started her car and pulled out of the driveway.<br>\r\n<br>\r\nOn the drive to the college, does anything happen to Lucas?</span></div></div>",
            "created":1599597840,
            "id":2899636,
            "title":"Brianna decided that Lucas could take a sick da..."
        },
        "151":{
            "author_id":"bradysoul",
            "author_name":"Tisch",
            "choices":[
                "Lucas decides to play along",
                "Lucas ventures elsewhere",
                "Lucas isn't able to make a choice, a hand grabs him"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately, Lucas was unable to get out and remained firmly held in between Brianna's boobs for the remainder of the ride. Once Brianna pulled into the parking lot for her college, she unbuckled then parted her breasts and plucked out Lucas. <br>\r\n<br>\r\n\"Ready to go, little man?\" she laughed. Lucas struggled in her grip trying to escape but it was no use. \"I don't think that's such a good idea, Lucas. Where would you go? Who would help you?\". Those were good points. Lucas sighed and let Brianna do her thing. She smiled and stepped out of the car, placing Lucas on her shoulder in the meantime. It was an especially shaky ride for Lucas, but he managed to stay on as Brianna made her walk to her first class. Once there, Lucas noticed how large it was, the student capacity was probably 100 or even more. This could be an easy place to get lost or, worse yet, killed if Lucas wasn't careful.<br>\r\n<br>\r\nBrianna set her stuff down beside her chair, which was pretty much in the middle of the class, with students on all sides of her, and put Lucas on her desk. She looked down at him and smiled. \"You'll get to be my entertainment for the class, buddy. We should only be doing a handout or something for today so it should be all good\" Brianna stated. Lucas looked a pleading look to her, but with no effect. He sat down and waited. In a few minutes, the papers came around and instead of getting started on it, Brianna looked to Lucas for some fun.<br>\r\n<br>\r\n\"All right, Lucas, I'm going to set you down on the ground and if you can get up to my head in five minutes, you win, but if you fail, I win. Sound good?\". WIth no other choice, Lucas agreed. Brianna placed Lucas on the ground, then began her worksheet. <br>\r\n<br>\r\nBut does Lucas go with the activity or does he venture around the desks surrounding him?</span></div></div>",
            "created":1603491780,
            "id":2927671,
            "title":"No, he stays secure in Brianna's rack"
        }
    },
    "info":{
        "author_id":"bradysoul",
        "author_name":"Tisch",
        "brief_description":"Following the adventures of a medical miracle!",
        "created":1599453540,
        "description":"<td align=\"left\" class=\"norm\">Characters:<br>\r\n<br>\r\nLucas Marose (main character): Born at just three inches tall, Lucas is a medical mystery and continues to baffle doctors as he continues to live on. No doctor ever thought that he would survive this long, let alone survive birth. Now sixteen, five inches tall and attending Ridgeway High School, Lucas has not only proved doctors wrong, but exceeded the physical endurance many of his peers have. He has a tight group of friends who occasionally make fun of his situation, but are nonetheless caring for him and help him whenever necessary. Lucas also has a tight relationship with his two older sisters, Lily and Brianna, who are seventeen and nineteen respectively. And as a given, his mother, Payton, is very protective of him, although admittedly sometimes a klutz.<br>\r\n<br>\r\nPayton Marose: Now forty-six years old, Payton has managed to balance parenting, maintaining her curvaceous body and work perfectly, even without a husband. Given Lucas’s special condition, she takes extra care in looking after him. When she’s at work, Payton counts on the girls to make sure Lucas is safe and secure. Despite her age, Payton attracts men of all ages with her smooth, tan skin, flowing brown hair and knockout body. This is sometimes a danger for Lucas when his mom is distracted with something, as she has accidentally squashed him a few times, trapping him in places he’s too embarrassed to admit.<br>\r\n<br>\r\nBrianna Marose: The oldest sibling of the three at nineteen, Brianna is attending a local four-year university but lives off campus at the house. Ever such the cheeky prankster, Brianna likes to use Lucas’s height disadvantage for easy pranks, often putting him in sticky, awkward positions and having a good time while he suffers. It makes it all the better for her knowing that Lucas is adept under immense pressure, even more so than the average sized people. Regardless of her cheeky nature, Brianna loves her little brother and would do anything to see him succeed in anything and everything. <br>\r\n<br>\r\nLily Marose: The middle sibling of the Marose children, Lily is a senior at Ridgeway High School. Although sometimes having some fun with Lucas and his situation, Lily tries to take more precaution than Brianna when it comes to handling Lucas. Despite this, Lily is the klutziest of the bunch and accidentally messes with Lucas more so than she would like. Even though this is the case, Lucas understands and the two of them have an extremely tight bond. Since they still go to the same school, Lily is always there to help Lucas if he gets in a pickle at school, which happens a lot since there are so many chances for problems to happen at the large school.<br>\r\n<br>\r\nSydney Bloomquist: Lucas’s closest ally aside from his siblings, Sydney is the same age as he and is just as protective of him as his family. Although on the shorter side of the spectrum at only 4’10, she’s still massive compared to Lucas and uses this for good, using her size to protect Lucas whenever necessary.<br>\r\n<br>\r\nAimi Ito: A petite and quiet girl, Aimi is a fourteen year old Japanese transfer who recently arrived from the crosstown high school, Dragford. Although mostly unacquainted with most of the students at the school, Aimi has taken a special interest in Lucas and tries to snag him to hang out with her whenever possible. Lucas, being the friendly guy he is, goes along with it and hangs out with her, but sometimes he feels she can get a little possessive and is fortunate when either Lily or Sydney shows up to retrieve him.<br>\r\n<br>\r\nQuinn Daniels: A gifted athlete with even more gifted assets, Quinn is somewhat of a bully to Lucas, constantly showing her superiority over him whenever she feels like it, whether it be throwing him in her sweaty and smelly gym clothing or tossing him in her shoe, or whatever it may be. Lucas tries to avoid running into Quinn whenever possible, but inevitably he will, given they share three classes.<br>\r\n<br>\r\nBrittany Shoa: The traditional popular girl, Brittany often has a clique of girls around her at all times. Even though her and Lucas share nearly all of the same classes, along with the same lunch, Brittany remains indifferent about him. Or she’s unaware of his presence. Either or. Even though this is the case, Lucas often finds himself gawking at her flawless looks, forgetting that it’s the personality that counts the most.<br>\r\n<br>\r\nPlus others!<br>\r\n</td>",
        "id":2231578,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603494360,
        "modified":1603494360,
        "pretty_title":"Laterally Disadvantaged"
    }
}