{
    "chapters":{
        "1":{
            "author_id":"musstika",
            "author_name":"Jester",
            "choices":[
                "A Classmate  of Andy going to pee",
                "A other Child going to pee",
                "A Classmate from Andy need´s a fast Dump",
                "A other Child going to get a Dump...",
                "Andy decides to flee though the Floor"
            ],
            "content":"<div class=\"\"><div> <span>For Andy it´s an normal Day until he was on Toilet.He suddenly see firring Lights and when he see normal again,he see something very big in front of him.It´s look like wood and is beginning for Andy 10 feet about the ground.Under this he can easy walk trough.he turns around and see a white very big thing that about 30 times big than himself.\"Wow\",Andy is astonished.\"Never i have see a so big Toilet Bowl.\"<br>\r\n<br>\r\nHe hear the Gong for the 2.nd Lesson hums.<br>\r\n\"What i can do now.I´m so small that ,when i go now out,get Squished,by the Kids who coming from outside\".<br>\r\n<br>\r\nAndy think about what to do.Maybe flee to the Floor when the Kids are in the class ? Or stay and think what to do now.Suddenly the Door to the Toilet room opens and...</span></div></div>",
            "created":1149483600,
            "id":322723,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"musstika",
            "author_name":"Jester",
            "choices":[
                "Climb outside further",
                "Getting inside between T-shirt and Marcs waist."
            ],
            "content":"<div class=\"\"><div> <span>It´s Marc, his best friend and  neighbor in the Class.Andy try´s to call him,but he is so small that Marc never could hear him.Andy running from the Toilet stall to his friend just when he is ready.Marc turns around and going to wash his hands.Andy nearly get squished under Marc´s Shoe as Andy crosses his way.Andy can grab the tying lacing of Marc´s shoe so that he hopes to on this way back into his Class and the Attention of his friend.<br>\r\nMarc hurry back into his Class.A very Bumpy ride for Andy but he can hold until he is back in Class.<br>\r\n<br>\r\nThe Teacher open the Classroom door.\"Goood morning Kids\".<br>\r\n\"Good morning Mrs. Simmard.Mrs. Simmard is a \"little\" corpulent Woman,who weights about 250 pounds.But she is always very nice to to kids in her Class.<br>\r\n<br>\r\nShe ask the presence list down....this Time from Z to A nest Time again from A to Z<br>\r\n<br>\r\n<br>\r\n\"Toby\".....\"Yes.Ma´m\"<br>\r\n\"Tina\"\"Toby\".....\"Yes.Ma´m\"<br>\r\n\"steve\" ....\"Yes.Ma´m\"<br>\r\n\"Marc\" ....\"Yes.Ma´m\"<br>\r\n\"Maria\".....\"Yes.Ma´m\"<br>\r\nand so then is Andy called out...<br>\r\n<br>\r\n\"Andy...\" -----\"Andy...\" Mrs. Simmard looks up...<br>\r\nHey do anybody know´s what with Andy is ?<br>\r\n<br>\r\nMarc answers:\"He was in the First Lesson here,he don´t came back after the Break.\"<br>\r\n\"Hmm maybe he feels Ill and going home\",she answers and  Close the Classbook.<br>\r\n<br>\r\nO.k let´s start with Mathematics.Do you know.....<br>\r\n<br>\r\nAndy now try to climb up the outside of his friend Jeans.After 10 Min he reach his friends lab.then he think about what to do next.....</span></div></div>",
            "created":1149483600,
            "id":322722,
            "title":"In the Class"
        },
        "112":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "...fell into the undies.",
                "...managed to stay on."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andy began to crawl up Marc's chest, admiring how muscular his friend was. Suddenly, Marc shifted and opened up his pants and underwear. The shifting sook Marc's chest and Andy...</span></div></span></div>",
            "created":1190955600,
            "id":448336,
            "title":"Marcquake"
        },
        "1121":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Andy escapes.",
                "Andy gets trapped in his friend's urethra (tunnel for fluids in dick)."
            ],
            "content":"<div class=\"\"><div> <span>Unable to maintain a firm grip on the flesh, Andi fell, screaming, landing in his friend's privates, just as he closed his pants and undies. Marc's 12-foot softie seemed to shift under the new weight, and Andi went tumbling forward, barely catching onto the head  and maintaining a firm grip. As he climed his friend's massive dickhead, his feet became entrapped in the peehole. He squirmed and sunk in up to his knees. Andi was slowly becoming entrapped inside his friend's dick.</span></div></div>",
            "created":1190955600,
            "id":448482,
            "title":"Trapped in his Friend?!?"
        },
        "11212":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Marc feels all this and checks in on his privates.",
                "Marc goes home."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As he sunk deeper into his friend's peehole, he felt miserable at the circumstances. Suddenly, he jammed up at the shoulders. His head was all that stuck out from the dickhead. Struggle as he might, he could not escape.</span></div></span></div>",
            "created":1191042000,
            "id":448627,
            "title":"Trapped"
        },
        "112121":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Marc plays around with him some more.",
                "Marc sticks Andi back in his crotch."
            ],
            "content":"<div class=\"\"><div> <span>Marc felt an odd sensation, as if someone were feeling his weiner. He looked around, everyone was focused on the teacher. He pulled open his pants, looking down, first in confusion, then in shock, then in glee. He grinned down at his tiny friend, trapped within his pecker. He grabbed his friend, releasing him from his fleshy prison, and set him down on the desk, using his books to shield Andi from anyone else's view. He looked down at his two-inch tall buddy, who was fully nude, and smirked. Taking his mere pinky, Marc lifted Andi's dick, knocking him back onto his butt in the process.<br>\r\n<br>\r\n\"Ooh, you're hardening, did you enjoy your time with my package?\" He giggled as he fingered his tiny friend.</span></div></div>",
            "created":1194238800,
            "id":461080,
            "title":"Big Buddy"
        },
        "1121211":{
            "author_id":"dbzfangoku",
            "author_name":"DBZFanGoten",
            "choices":[
                "Rescess: Marc shows Andy to his mates, they took turns touching Andy's privates ",
                "Fast Forward to the Final Bell: Marc takes Andy home with him "
            ],
            "content":"<div class=\"\"><div> <span>\"N-n-no, I-I was t-trying to get your attention!\" Andy stuttered out of nerves. \"It's not so easy being small!\"<br>\r\n<br>\r\n\"Don't worry, Little Andy\" Marc said with a rather wicked grin, stroking Andy's back and butt with a finger, which calms him down a bit and he let out a relaxed sigh. \"I'll take good care of you. Boy, I like the feel of your naked body.\" he added, now stroking your front up and down. <br>\r\n<br>\r\nNot wanting to be discovered having a \"toy\" and then having that \"toy\" confiscated, he picked Andy up between his index finger and thumb and dropped the tiny little boy into his shirt pocket<br>\r\n<br>\r\nWhen the bell ringed for.....  <br>\r\n</span></div></div>",
            "created":1292302800,
            "id":1014900,
            "title":"Marc's New Little Pet"
        },
        "11212111":{
            "author_id":"dbzfangoku",
            "author_name":"DBZFanGoten",
            "choices":[
                "After School, Marc took Andy home with him and did whatever he pleased with him",
                "After school, Marc, Noah, John and Luke took Andy to their clubhouse."
            ],
            "content":"<div class=\"\"><div> <span>When the bell rang for recess, Marc  quickly cleared his desk and was the first out the door. As he went outside looking for his friends, he fished Andy out of his shirt pocket.<br>\r\n<br>\r\n\"Marc, you did a bad thing.\" Andy said at once as he sat in Marc's palm. \"You touched my pee-pee! No one's s'pose to touch me there!\"<br>\r\n<br>\r\n\"Andy, you're mine, you belong to me,\" Marc said, and he rubs Andy's tiny boyhood with a pinky. \"So I can touch you there, I can do whatever I want to you and you can't stop me!\"<br>\r\n<br>\r\nThese words crushed Andy's little heart and spirit and he laid on his side on Marc's palm, sobbing <br>\r\n<br>\r\n\"Aw, I'm sorry Andy, shh, don't cry...\" Marc cooed soothingly, stroking Andy's back and butt with a finger. \"But I can't just let you go, other people might be even badder than I can ever be to you...\"<br>\r\n<br>\r\nMarc then lower his face to Andy and kissed his whole curled body. At once, Andy begin to glow in bright yellow light, Marc let out a loud exclamation, and when the light faded away, Andy was slightly bigger - he has gone from two inches to six inches. <br>\r\n<br>\r\nMarc examined Andy when he stopped glowing and growing. \"Wow, Andy! This is neat! Now I can see your pee-pee better!\" <br>\r\n<br>\r\nHe closed his fist around Andy's upper body, so that his legs and privates stuck out of the side of Marc's fist. Marc paid close attention to his tiny friend's hairless little boy penis, taking it and rolling it between his index finger and thumb while Andy's muffled yell sounded and his naked legs kicked in all direction or wrapping themselves around Marc's finger.<br>\r\n<br>\r\n\"Hey Marc, whatcha got there?\" said a voice from behind Marc. <br>\r\n<br>\r\nMarc turned and faced the three boys standing there, they are his and Andy's friends: Noah, John and Luke<br>\r\n<br>\r\nNoah saw the thing in Marc's hand - a pair of legs and an erected little hairless penis between them. He reached out without invitations and took the little penis his fingers and rolled it  between them. He was so surprised that it felt like real human flesh that he let out a startled gasp and drew his hand away.<br>\r\n<br>\r\n\"MARC! WHO IS THAT?!\" Noah screeched, much too loudly for Marc's liking, who quickly put Andy out of sight and hissed \"Shut up!\"<br>\r\n<br>\r\nNoah gasped and covered his mouth upon realizing his mistake. \"Sorry, but who is that?\" he asked again, prodding Andy's penis while making it look like he was merely pointing at his exposed legs and privates.<br>\r\n<br>\r\n\"It''s Andy, he shrunk -- don't ask me how -- I found him like this, well actually he was smaller, but he grew a little just now.\" <br>\r\n<br>\r\n\"Wow, can I hold him?\" asked Noah breathlessly<br>\r\n<br>\r\n\"Sure....\" Marc said in a resigned voice, holding Andy out to Noah.<br>\r\n<br>\r\nNoah took Andy in his hand very carefully. He had Andy to sit up in his palm while he rubs the curve of Andy's back with the other hand. His touch was so gentle and soothing that Andy felt so relaxed and fell face-down on Noah's palm.<br>\r\n<br>\r\n\"Aw, look at his little butt!\" Noah cooed, rubbing  Andy's exposed butt cheeks lightly with a finger.<br>\r\n<br>\r\n\"C'mon, Noah, let us have a turn!\" whined Luke <br>\r\n<br>\r\n\"Okay,\" Noah sighed, holding Andy out to Luke.<br>\r\n<br>\r\nThe rest of recess past with Andy being pasted between the four boys as they each took their turn to hold him and touch or rub his privates. John actually licked Andy's penis once with his tongue!<br>\r\n<br>\r\nThe bell ranged and class resumed, Andy was in the shirt pocket of Marc     <br>\r\n</span></div></div>",
            "created":1292302800,
            "id":1014945,
            "title":"Andy grows a few inches while being played with"
        },
        "112121111":{
            "author_id":"dbzfangoku",
            "author_name":"DBZFanGoten",
            "choices":[
                "Derek, Marc's 15-year-old brother spots Andy and strips him naked & touches him ",
                "Derek enters, but Marc managed to hide Andy from him "
            ],
            "content":"<div class=\"\"><div> <span>Andy, a six-year-old first grader lay naked and curled up inside his best friend, Marc's shirt pocket.<br>\r\n<br>\r\nHow did this came about, you ask? A very strange and mysterious event took place earlier that morning, when Andy shrunk without any explanation of this odd phenomenon. Fortunately, he was found by his friend, Marc, a friend who would protect Andy and take care of him, even if he called Andy a pet, but only intended it to be a joke. Unfortunately, Marc is at a curious stage, where he is curious about the human body and Andy has become the victim of this curiosity as Marc touches his private parts and rub his bare skin whenever Marc was alone or with three other boys, Noah, Luke and John          <br>\r\n<br>\r\nAndy got through lunch with Marc putting tiny bits of fries, a tiny piece of hamburger meat and a couple of crumbs of a cookie into his pocket for Andy to eat. He got through the rest of the day without any problems, except that he got a little hot inside the pocket, but as he was naked, he remained where he was--he didn't want to risk exposing his nakedness to any girls that might be nearby...  <br>\r\n<br>\r\nFinally, the final bell rang and Marc took the bus home. When he was home, he went straight to his bedroom and locked the door behind him. He took off his backpack and threw it aside. He then sat down at his desk where he does his homework and fished a sweaty Andy out of his pocket.<br>\r\n<br>\r\nAndy was looking pale as he has had no sunlight and he was very thirsty. Marc noticed this. <br>\r\n<br>\r\n\"Andy, are you okay?\" he asked with sincere concern, sliding his index finger up and down Andy's back, then his finger paused at Andy's butt, where he rubs it in circles    <br>\r\n <br>\r\nAndy was growing used to Marc touching him and took his massages or invasions to his privates without complaints or protests. Marc was a boy too, and he wasn't going to stop touching him, no matter what Andy said or did. Though he still wished Marc wouldn't touch his private parts.<br>\r\n<br>\r\n\"I'm thirsty,\" Andy said hoarsely as his mouth and throat was bone-dry by this time.<br>\r\n<br>\r\n\"Okay, I'll take you to get a drink.\" Marc said, and he got up, crossed his room and unlocked his door. He carried Andy to the bathroom where he got Andy a paper cup of water from the bathroom sink. \"Here you go, drink it slowly now.\" he told Andy as he shifted his tiny friend so he could easily and carefully sip the cup to Andy's tiny lips<br>\r\n<br>\r\nAndy drank like a little bird, dying of thirst. When his thirst was satisfied, Marc filled the sink with a small amount of water for Andy's bath. <br>\r\n<br>\r\nHe dipped Andy's body into the sink. wetting him up from the neck down. Then he lifted Andy up out of the water and rubbed some hand soap all over Andy's body. He rubs Andy's dick and butt for a full sixty seconds before putting him gently back down into the sink, letting Andy play in the water for a while. As Andy plays in his bath water, Marc thinks of what to do with Andy.<br>\r\n<br>\r\nA growing sense of guilt and shame was coursing through Marc as he watches Andy play in the water. Andy was right, he did a bad thing in touching his best friend's private parts and that was a big no-no. But he had a hard time resisting the urge to touch his friend's private parts, most of the time he didn't even fight the urge, for he was aroused by his own curiosity. And it did not help that Andy was naked....<br>\r\n<br>\r\nIf this whole thing was flipped over, so that Marc was the small one and Andy the big one, would he want Andy to do to him as he has done to him? No, of course not! <br>\r\n<br>\r\n<i>Then treat him as you'd like to be treated if you were in his shoes!</i> a voice growled in the back of Marc's head, which sounds uncannily like his father's<br>\r\n    <br>\r\n\"Marc? I'm done.' Andy said, raising his arms up to Marc.<br>\r\n<br>\r\nMarc shook his head like a dog trying to rid itself of water and reached for a dry washcloth. He picked Andy up out of the sink and laid him face-down onto the washcloth in his other hand. He only looked at Andy when he was properly wrapped in the washcloth like a large towel, for he had decided to respect his best friend's privacy.<br>\r\n<br>\r\nHe carried Andy wrapped in the washcloth back to his room and closed and locked the door. Then he went over to his desk and set Andy gently down on top of it.<br>\r\n<br>\r\n\"Andy, I'm sorry.\" Marc said. \"I've been bad; you're right, I shouldn't have touched you there.\" he pointed down at the place between Andy's little legs, but did not touch him there. \"Can you forgive me.\"<br>\r\n<br>\r\nAndy looked surprised at Marc's apology and said \"Sure, I forgive you.\"<br>\r\n<br>\r\nMarc smiled. \"Thanks Andy.\" and he bent over and kissed the top of Andy's head.   <br>\r\n<br>\r\nAt once, Andy glowed as he had done at recess and grew up from six inches to eight inches<br>\r\n<br>\r\n\"Whoa,\" Marc exclaimed when the transformation ended. \"Does kisses make you bigger?\"<br>\r\n     <br>\r\n\"I guess.\" Andy said who was a bit dazed after the sudden growth spurt<br>\r\n<br>\r\n\"You know, I kissed you at recess and you grew a little bigger and then I thought you shrunk a little when John....\" he turned red with embarrassed and muttered: \"...you know, licked your pee-pee...\"   <br>\r\n<br>\r\nMarc tested his theory by licking Andy's little face and then, Andy shrunk back down to six inches.<br>\r\n<br>\r\n\"Whoa!\" Andy gasped, looking down on himself. \"Kisses DOES make me bigger, and licking me makes me smaller! D'you think you can kiss me till I'm back to normal?\"  <br>\r\n<br>\r\nMarc inwardly sighed, he wanted to play with Andy as an action figure for a bit, but he owes it to his best friend to do the right thing. So he kissed Andy's bowed head and he grew back up to eight inches. Marc kept kissing him till he was twelve inches but no matter how much more he kissed Andy, he would not grow past twelve inches.<br>\r\n<br>\r\n\"No! You mean I'm stuck like this?!\" cried Andy, looking thoroughly put out.<br>\r\n<br>\r\n\"Looks that way.\" Marc said, looking sorry for him. \"But don't worry, I'll take care of you.\"<br>\r\n<br>\r\nMarc went over to his toy box and withdrew from it, a ken doll. He stripped it of its clothes and tossed it carelessly back into the box.<br>\r\n<br>\r\nHe unwrapped the washcloth from around Andy's naked little body and begin dressing him in the ken doll's clothes, stealing glances at Andy's penis and butt as he dressed Andy before looking away out of guilt.<br>\r\n<br>\r\n\"There you go.\" Marc said, picking Andy up. <br>\r\n<br>\r\nJust then, the door banged open!<br>\r\n<br>\r\n\"BRAT, HOW MANY TIMES DID I TELL YOU NOT TO LOCK THE DOOR!\" <br>\r\n  <br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020022,
            "title":"Marc's Change of Heart"
        },
        "1121211111":{
            "author_id":"dbzfangoku",
            "author_name":"DBZFanGoten",
            "choices":[
                "It is Marc, sneaking in to rescue Andy ",
                "It is Noah, on a rescue mission, assigned to him by  Marc"
            ],
            "content":"<div class=\"\"><div> <span>Just then, the door banged open!<br>\r\n<br>\r\n\"BRAT, HOW MANY TIMES DID I TELL YOU NOT TO LOCK THE DOOR!\"<br>\r\n<br>\r\nDerek, Marc's fifteen-old-year brother burst into Marc's room in a towering tempter.<br>\r\n<br>\r\n\"Uh-oh,\" Marc muttered, more to Andy than anyone else. \"He's really ticked off right now...better hide you.\"<br>\r\n<br>\r\n\"WHO THE HECK ARE YOU TO, MORON?\" bellowed Derek as Marc attempted to conceal Andy from him by putting him back into his shirt pocket, but at twelve inches, Andy could not be concealed by the shirt pocket anymore and Derek saw him...\"WHAT--WHO IS THAT?!\" Derek seems to like to yell a tad too much. <br>\r\n<br>\r\n\"Just my new toy.\" Marc lied, holding Andy protectively to his chest.<br>\r\n<br>\r\n\"LET ME SEE IT, BRAT!<br>\r\n<br>\r\n\"NO! It's mine and you can't have it!<br>\r\n<br>\r\nDerek lunged at Marc, tackling him down to the bed and grabs Andy when Marc's grip loosened on landing. Having captured Andy, Derek jumped off of his little brother and ran out of the room. Upon reaching his bedroom, he slammed the door and locked it.<br>\r\n<br>\r\nA moment later, a body slammed against the door and then came the sounds of Marc hammering on the door from the outside with his fists, sobbing and calling out Andy's name and demanding that Derek return Andy to him.<br>\r\n<br>\r\n\"STOP BANGING ON MY DOOR, YOU LITTLE IDIOT!\" Derek screamed through the door, momentarily squeezing Andy. \"AND NOT A WORD OF THIS TO ANYBODY, ESPECIALLY MOM AND DAD! OR ELSE, I'LL FEED HIM TO NAGINI!\"<br>\r\n<br>\r\nSilence fell on the other side of the door as Marc stopped banging on it and he stopped yelling <br>\r\n<br>\r\n\"THAT'S BETTER, I'M GOING TO PLAY WITH HIM NOW AND IF YOU KEEP YOUR  MOUTH SHUT, I MIGHT GIVE HIM BACK TO YOU WHEN I'VE HAD MY FUN!\"<br>\r\n  <br>\r\n<i>Nagini</i>? Andy wondered, he looked around, there in a corner was a huge tank. Andy's stomach turned over, for inside the tank was a huge snake, a green viper to be exact. Derek appears to be a huge Lord Voldemort fan, for there were posters of Voldemort from the Harry Potter movies and Death Eaters' Halloween masks all over the walls. And on his desk, lays the Lord Voldemort Illuminating Wand from Noble Collection.<br>\r\n<br>\r\nBut it was the snake in the tank that Andy's eyes were glued to out of pure terror. He was not even aware of wetting himself until Lord Derekemort laughed cruelly.<br>\r\n<br>\r\n\"Look at this!\" Derek laughed, holding And up a little higher. \"The tiny little baby wets himself! Oh well, I was going to strip you anyway.\"<br>\r\n<br>\r\nAnd with that, he pulled Andy's wet ken doll-size jean off and then he pulled Andy's shirt up over his head and off.<br>\r\n<br>\r\nNow Andy was naked again and in the hands of Marc's evil, Voldemort-obsessed older brother      <br>\r\n<br>\r\nDerek gazed down at Andy's little hairless crotch, he then pressed a thumb to it and begin to rub it back and forth, while his thumb was busy with Andy's crotch, his index finger rubs Andy's little butt cheeks. This went on for ages, with Derek touching different parts of Andy's body. The more time Derek spent with Andy, the more Andy hated him and wanted to get back to Marc!<br>\r\n<br>\r\nIt was dinner time by the time Derek stopped playing with Andy's little nude body. He stood up, holding Andy in his fist. <br>\r\n<br>\r\n\"Okay, Little Tiny Boy,\" he said, calling Andy by the name he has given him, which wasn't very creative in Andy's opinion. \"I'm going to eat. You, meanwhile will stay in this jar.\"  <br>\r\n<br>\r\nAnd he put Andy's twelve-inch body in a big pickle jar. Making sure the lid had some air holes in it, Derek screwed it on and left him in the jar on the desk...<br>\r\n<br>\r\nA couple of minutes later, the door creaked  opened.... <br>\r\n      <br>\r\n   <br>\r\n<br>\r\n    </span></div></div>",
            "created":1294635600,
            "id":1032613,
            "title":"Derek the Big Bully"
        },
        "11212111112":{
            "author_id":"dbzfangoku",
            "author_name":"DBZFanGoten",
            "choices":[
                "Plays with Andy's naked body, starting with the little pee-pee",
                "Decides to dress Andy in a new set of ken doll clothes, at Marc's request   "
            ],
            "content":"<div class=\"\"><div> <span>The door creaked opened and a shadow of a boy ducked into hiding within the darkened room.<br>\r\n<br>\r\n\"Andy?\" a voice whispered, but Andy couldn't tell who it was from within the pickle jar. \"Andy?\"<br>\r\n<br>\r\nA small light flicked on and it shined on the junks in the room, to the snake tank, to the bed, to the desk and finally to the shelf where Andy's glass prison perched.<br>\r\n<br>\r\n\"There you are.\" said a cheerful voice and the light started bobbing in Andy's direction. When the light was upon Andy, he saw that it was Noah, holding Derek's lit Lord Voldemort wand. \"Don't worry, I'll get ya outta' there.\" he cooed soothingly, as if talking to a frightened little mouse. \"It's okay, I got you now, Andy.\"<br>\r\n<br>\r\nNoah set the lit wand on the desk and picked up the jar. He unscrewed the lid and took out Andy's small naked form. Setting the jar down, he comforted his shrunken friend by cupping Andy's butt in his palm,  setting him in a sitting position in his hand. Andy sat there as Noah brought up a gentle finger and petted him on the head, and then he slid that finger up and down, calming Andy and forcing him into a relaxed state as he continues stroking Andy's bare back   <br>\r\n<br>\r\nAndy felt dazed and relaxed, even feeling a little drowsy as he swayed a little on Noah's palm.<br>\r\n<br>\r\n\"Marc called me,\" Noah whispered as he put Andy into an inside jacket pocket. \"He told me that Derek got you and then he asked me to play secret agent and sneak into the house and take you away. I'm taking you to my house. Marc wants you to stay with me, away from Lord Meanie-Face Derek.\"<br>\r\n<br>\r\nAndy was impressed, he can see the logic of it all. If Marc comes to rescue him himself, his absence from the dinner table might make Derek suspicious and he would intercept Marc before he could even get Andy out of the room!     <br>\r\n<br>\r\nSo, by going to the dinner table as usual, Marc has thrown off all suspicions from Derek, while his friend, playing the role of a secret agent, rescues Andy without being intercepted or spotted.<br>\r\n<br>\r\nIt was a few seconds before Andy, with his face poking out through the gap in Noah's lightweight, windbreaker jacket, that he realized that Noah was all dressed in black. Andy looked up in time to see Noah putting on a black Grim Reaper hood with black screen to hide his face. Noah blended well with the dark, too well. Andy thought for a moment that he was flying through the air by invisible support.<br>\r\n<br>\r\nNoah took Andy to his house, about five houses from Marc's.  Upon reaching the house, Noah ran around back and begin to climb a tree up to his open bedroom window.<br>\r\n<br>\r\nHe just squeezed through the window when Andy thought he heard the unmistakable sound of Derek yelling in the distance, his words were unintelligible from here.<br>\r\n<br>\r\nNoah closed the window, cutting out Derek's yelling completely, and taking off his hood.<br>\r\n<br>\r\n\"The best thing is,\" Noah said gleefully as he took Andy out from inside his jacket, holding Andy in his fist, his hand enclosed around Andy's waist, \"He can't tell his Mom and Dad about you, they'll think he's just making stuff up just to get Marc in trouble and he can't accuse Marc of stealing either, not unless he wants people to think he's crazy.<br>\r\n<br>\r\nHe sets Andy down on the desk and begin stripping off and putting on his PJ's. Andy respectfully turned his back on Noah while he was changing, now knowing what it was like to have your privacy violated <br>\r\n<br>\r\n\"Now,\" Noah said, now fully dressed in PJ's and picking a naked Andy up. Andy noticed Noah's eyes lingering on his little pee-pee. Noah paused, apparently thinking over something in his head.<br>\r\n<br>\r\nAnd then he....         </span></div></div>",
            "created":1294808400,
            "id":1034017,
            "title":"SAVED!"
        },
        "12":{
            "choices":[
                "Try to climb Timmy's pants to reach a safer place",
                "Wedge himself inside Timmy's shoe",
                "Just then Timmy Trips",
                "Jump off and try to find someone else"
            ],
            "content":"<div class=\"\"><div> <span>He looks and sees that the person that had just entered the bathroom was a preschooler that was there on a visit to the school.  Not only that but it was a kid who was always following Andy around.  It was his next door neighbor a boy by the name of Timmy.  Knowing that if he could get Timmy's attention Timmy could at least get him home to his family where his mom might be able to help him.  Timmy runs right at the place where Andy is standing and using a little quick stepping Andy was able to avoided being crushed by Timmy's giant feet.  Andy sees Timmy walk right up to the urinal and start to use it.  Knowing this might be the chance he needed Andy runs over to the peeing giant and starts to climb up his shoelace.  Just in time for when he got up on top the shoe Timmy had finished and went to wash his hands.  Knowing if he stayed on Timmy's foot he might fall off Andy decided to...</span></div></div>",
            "created":1168059600,
            "id":371531,
            "title":"Preschooler"
        },
        "121":{
            "choices":[
                "Mrs. Talsion, the preschool teacher ( next stop preschool)",
                "Mrs. Smater, Timmy's Mom (next stop Timm's house)"
            ],
            "content":"<div class=\"\"><div> <span>Knowing that being a a preschool's shoe is not the safest or the cleanest place to be Andy decides to climb up Timmy's pant leg after noticing a pant pocket that was, to Andy, twenty feet up and Andy is positive he could do it for he was always the best when it cam to climbing the rope in gym class.  As Andy starts to climb Timmy finishes peeing and runs over to the sink to wash up causing Andy to be shaken a bit.  When Timmy was washing his hands it gave Andy the rest of the time to get into Timmy's pocket.  Which was lucking for after he was done washing his hands Timmy wiped them on his pants.  Andy stuck out his head to watch where Timmy was going after they left the bathroom.  When Timmy left the bathroom the person that meets them was...</span></div></div>",
            "created":1168146000,
            "id":371780,
            "title":"To the Giant's pocket"
        },
        "1211":{
            "author_id":"abadthing",
            "author_name":"A Bad Thing",
            "choices":[
                "You crawl out of his pocket",
                "He goes to the classroom",
                "He goes to the lunchroom"
            ],
            "content":"<div class=\"\"><div> <span>Timmy whined briefly but noisily as he was gradually led out of the school, hoarded along with his peers along the walkways back into the bus. You groaned, assuming it was headed towards the preschool. You didn't exactly want to go, but with all the huge feet scrambling down the pathways, leaving his perch would be a death wish. As those feet finally settled in the bus, it was already too late.<br>\r\n<br>\r\nHe let himself drift down into the bottom of the boy's pocket, holding his ears to block out the chatter echoing through the bus. A squeal made it's way into your ears as the bus came to a halt, and you peeled briefly out of the pocket as your host sprinted from the bus, hoarded along with his classmates back to the preschool. You weren't familiar with the building, and definetly not with the chambers within, so you would have to be cautious.</span></div></div>",
            "created":1342933200,
            "id":1386275,
            "title":"Mrs. Talsion, the preschool teacher ( next stop..."
        },
        "12112":{
            "author_id":"thearchaic7",
            "author_name":"Castle Kriegen",
            "choices":[
                "Stay still and possibly be found",
                "Crawl through the hole (End up in his undies)",
                "Crawl through the hole (Escape through his pant leg)"
            ],
            "content":"<div class=\"\"><div> <span>A bit of time had passed and Timmy's class was having their roll-call; their voices were loud as they shouted \"Here!\" when they were called, you covered your ears for a moment while you waited for the noise to stop. During this brief period of not being able to hear much, you didn't notice Timmy's hand drifting into his pocket! Had he felt you?<br>\r\n<br>\r\n\"There's no way...\" you thought as the giant, pudgy fingers of the 4 year old slipped into the pouch you hid in! You backed away from them in a panic until you were against the deepest wall of his pocket! As you pressed your back against this cloth wall, you felt a small hole in it, just barely big enough for you to fit through if you crawled through it! Your choices were to either be found by a huge preschooler, or dive through the hole!<br>\r\n<br>\r\nWhich did you choose?</span></div></div>",
            "created":1503637200,
            "id":2374385,
            "title":"He goes to the classroom"
        },
        "121122":{
            "author_id":"thearchaic7",
            "author_name":"Castle Kriegen",
            "choices":[
                "At the tip of Timmy's dick",
                "Between his cock and balls",
                "Elsewhere?"
            ],
            "content":"<div class=\"\"><div> <span>In your panic, you kicked and crawled away from the preschooler's fingers as fast as you could, climbing through the hole in his pocket without a second thought! This turned out to be bad choice, as you ended up climbing through the opening of the front of his underwear as well! As soon as there was no cloth under you, you tumbled down a bit, before landing with a \"plop\" against something big, squishy, and warm! You look around you and realize that you're on top of Timmy's gargantuan penis! Your heart sinks a bit, before you think, \"If he's in underwear and not diapers, at least he's potty trained... hopefully...\"<br>\r\n<br>\r\nThe class goes along as it normally does, Timmy was fully unaware of the boy trapped in his undies, though he did feel a weird itching on his privates, and waited for a moment to make sure no one would see him scratch himself until the itch went away. Unfortunately for you, the itch in question was caused by your movements from on top of his cock, and the sudden pressing and scratching from his (from your perspective) giant fingers had pushed you somewhere else in his undies!<br>\r\n<br>\r\nWhere did you end up?</span></div></div>",
            "created":1503637200,
            "id":2374390,
            "title":"Crawl through the hole (End up in his undies)"
        },
        "1211223":{
            "choices":[
                "right under Timmy's hairless balls",
                "into one of the leg holes"
            ],
            "content":"<div class=\"\"><div> <span>As Timmy's giant fingers scratch his penis trying to get rid of the source of his itch, which unfortunately was you, it causes you to begin to fall off his gargantuan penis.  In hopes of keeping your current location thinking you would be at least seen next time Tummy had yo use the bathroom you drop flat onto your stomach and doing something you would have never dreamed of until this moment wrapped your arms around the giant preschooler's dick.  <br>\r\n<br>\r\nHowever, even this is not enough to keep you in place as Timmy's fingers push you off.  With no hair or anything to grab onto to halt your fall you land on the fabric of Timmy's underwear.  No longer feeling the itch in his pants Timmy goes back to what ever he was doing, but you could not focus on that as his movements send you sliding down the fabric of his underwear to land in the center of his two red wood sized legs.  You gulp at the end of the wild ride as you begin to pick yourself up only for Timmy to plop himself down to sit somewhere which causes his body to shift and land you....</span></div></div>",
            "created":1511326800,
            "id":2418989,
            "title":"Off the dick and deeper into Timmy's undies"
        },
        "1212":{
            "choices":[
                "Timmy needs to take a bath.",
                "Timmy puts Andy into a diaper.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>At his current size, Andy fit snugly in Timmy's pocket. Through a tear in the soft fabric, Andy could feel the preschooler's warm flesh, and nuzzled it contently. Poking his head through, he looked down at Timmy's feet and the floor below. To his right was the massive groin, over double Andy's size. He glanced at it, first nervously, then in awe. A tingling sensation came over him, and he looked down.<br>\r\n<br>\r\nToday was pajama day in Andy's class. He had worn his typical pajamas, a pair of undies and one of his dad's shirts, which was down to his knees. Upon glancing down, he was surprised to see a bulge in the fabric. Sheepishly he realized the bulge's source and blushed. Suddenly, everything shifted. Andy fell against the warm skin, barely managing to stay in the pocket.<br>\r\n<br>\r\nFar above, outside, Timmy was sitting down on his bus, oblivious to the first grader in his pants pocket. At long last, they arrived at Timmy's house. Timmy ran through the yard and up the stairs to his room, after saying hi to his parents. Andy sighed as the rocking ceased after a brief tumble. Suddenly, massive digits reached in and pulled the tiny first grader out, lifting him up a few stories to Timmy's massive beaming face.</span></div></div>",
            "created":1196571600,
            "id":471102,
            "title":"A Ride Home"
        },
        "12121":{
            "choices":[
                "He's running right towards Timmy's bath toys!",
                "He's running towards the edge of the counter!"
            ],
            "content":"<div class=\"\"><div> <span>Luckily for Andy, the boy doesn't even see him, his mother just made him empty out his pockets because he's about to jump in the bath.<br>\r\n<br>\r\nThere is one problem though, this means Timmy is about to have his clothes stripped, which means he's in the bathroom. Before Andy knows whats going on, Timmy sets him and the junk that was in his pocket down onto the bathroom counter and begins to get ready for his bath. His mother helps him with his shirt because it's a button up, Timmy isn't old enough to get the top buttons yet, next comes the pants which leaves Timmy in his underwear. Then those come off and Andy is horrified and oddly awe stricken at the same time.<br>\r\n<br>\r\nTimmy's mother begins to run the water for Timmy's bath, she fills the tub up half way and turns the water off, she then brings the toys out from under the counter and sets them on top of the same counter, about fifty feet away from Andy.<br>\r\n<br>\r\nTo Andy, this was truly a terrifying moment, he was not just small, he was smaller than this boy's groin! Andy, being too young to know what being in love and being gay was, didn't know what to think, all he could think about was how small he was compared to this young boy. <br>\r\n<br>\r\nSuddenly, fear struck him, what if he's stuck like this forever? He begins to panic and runs blindly. What he doesn't know is ...</span></div></div>",
            "created":1255928400,
            "id":778001,
            "title":"Timmy needs to take a bath."
        },
        "121211":{
            "choices":[
                "knee",
                "groin"
            ],
            "content":"<div class=\"\"><div> <span>Struck with fear Andy runs off in the direction he is facing which means he is running right to where Timmy's bath toys are arranged.  As he relies his mistake Andy slips on a bit of wet counter top, from Timmy's mom hands from pacing the toys on the counter, and falls right into one of the toy boats on the counter just as Timmy's mom picks it up and gives it to Timmy.  After Timmy's mom gives him the last of his bath toys she leaves Timmy alone reminding him to wash behind his ears before he gets out and that a new pair of clothes will being hanging on the other side of the door when he is finished.  Timmy said ok and goes on to playing with his toys.  Andy is thankful when it appears that Timmy does not see him only to have the toy boat he is one \"crash\" into another one sending him flying.  Andy lands thankfully not in the water where he would have drown by on a soft fleshy object that he relies after looking around is Timmy's...</span></div></div>",
            "created":1294117200,
            "id":1028931,
            "title":"Toy-boat, Toy-Boat, Toy-Boat"
        },
        "1212112":{
            "choices":[
                "He calls his mom thinking Andy's a bug",
                "He plays with him in the tub"
            ],
            "content":"<div class=\"\"><div> <span>You notice you landed on a surface that was squishy and assumed you were walking on one of Timmy's rubber toys but soon found out you were a 6 year old boy who was on a 5 year old's penis that was twice the size of his forearm.<br>\r\n<br>\r\nYou found out because when you took a step forward, you accidentally slipped into his piss slit. Timmy didn't look down but felt some tingling in/ on his penis and started to giggle.<br>\r\n<br>\r\nYou tried to pull your foot out but it was partially stuck. The more you pulled, the more Timmy giggled. He assumed that one of his toys just was floating over his groin rubbing it like what normally happened but eventually he looked down because it was becoming ticklish there. He notices you and pulls you out of his piss slit, but he didn't laugh that time.</span></div></div>",
            "created":1306299600,
            "id":1112936,
            "title":"The Preschool's Groin"
        },
        "12121122":{
            "choices":[
                "Timmy finished and takes him to his room",
                "He stays in the tub with Andy for a bit"
            ],
            "content":"<div class=\"\"><div> <span>Andy was in shock as a giant preschooler looked down on him. Andy was trapped in Timmy's hand, but before he did anything, Timmy had an urge to pee. He was told to always aim at the drain when in a tub. He placed both hands on his penis, forgetting Andy was in his left one, and shot his gold rain into the water. <br>\r\n<br>\r\nAndy was being pushed against Timmy's giant cock, but Andy's head was right above the piss slit and when Timmy let go of his fluid, it hit Andy straight in  the face with a hot liquid which smelled appalling.<br>\r\n<br>\r\nAs Timmy was relieved from emptying his bladder, Andy was crying of being shot with hundreds of gallons (to him) of hot, fresh piss from a giant 5 year old boy's enormous penis.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1306386000,
            "id":1113521,
            "title":"He plays with him in the tub"
        },
        "121211221":{
            "choices":[
                "He plays with him and his manhood",
                "He plays with him on his feet"
            ],
            "content":"<div class=\"\"><div> <span>Timmy didn't have a hiding place for Andy so he said, \"Hold onto me pwivate.\" Andy was confused but held on to the underside and Timmy cupped his hands around it. He then shouted, \"Mommy! I finished!\"<br>\r\n<br>\r\nThen Timmy's mother walks in and takes Timmy out of the tub and dried him. She said \"Let go of your 'private' so I can dry you.\" Timmy cautiously lifted his hands away but Andy was hidden well underneath Timmy's groin. Andy was scared that his mother might see their neighbor's boy hanging onto her son's penis, but she didn't see him but rubbed the towel around his manhood and started to push the towel and rubbing it.<br>\r\n<br>\r\nThis made Timmy giggle but Andy was being rubbed all around Timmy's penis and he ended up kissing or licking it a couple times. Andy woke up on a bed and saw Timmy above him.<br>\r\n<br>\r\nTimmy was still naked and picked Andy up and measured him. He took him to his penis and said, \"My pwivate is bigga than you. See?\" He then pushed Andy straight into his groin that was twice the size of him. He then said, \"Let's have some fun,\" with a grin.</span></div></div>",
            "created":1306472400,
            "id":1113820,
            "title":"Timmy finished and takes him to his room"
        },
        "1212112211":{
            "choices":[
                "Inside a potty seat",
                "Inside a toilet"
            ],
            "content":"<div class=\"\"><div> <span>Timmy giggled and brought Andy to his tiny manhood.<br>\r\n<br>\r\n\"I like you there when I took a bath\". Timmy let go of Andy while he was laying on bed. Andy was standing in front of Timmy's private and he couldn't escape after Timmy pressed his feet together to form a prison. Andy hesitated a lot so Timmy pushed him towards his penis, making Andy's hand to get stuck inside his penis. <br>\r\n<br>\r\nAndy struggled to free himself from the slit and all Timmy did was laugh at it. \"See, thats what I say\" said Timmy before grabbing little Andy and bringing him closer to his tiny penis. \"More tickles\" was heard before Timmy pushed Andy directly into his penis hole and Andy's head got stuck inside of it. Timmy just giggled harder than before, because of the sensation and the funny way Andy tried to break free from his predicament.<br>\r\n<br>\r\nAndy's POV<br>\r\n<br>\r\nAndy saw only flesh inside of the penis and was afraid of getting sucked completely. After a couple minutes Andy felt how Timmy stood up and walked somewhere. Then the pee flooded in and Andy was pushed outside Timmy's penis.<br>\r\n<br>\r\nWhere does he fall?<br>\r\n<br>\r\n</span></div></div>",
            "created":1428210000,
            "id":1959340,
            "title":"He plays with him and his manhood"
        },
        "12121122111":{
            "author_id":"xenophage17",
            "author_name":"Zeromus",
            "choices":[
                "“Okay” he takes you out",
                "His stomach rumbles, he has to do more than pee"
            ],
            "content":"<div class=\"\"><div> <span>Andy was launched from what he could only describe as a stick smelly water slide, propelled in the stream of urine as Timmy sighed in relief. With a splat Andy landed in the bottom of a potty which was rapidly filling. He looked up to see Timmy holding his penis with both hands and directing the stream into the plastic potty a big smile on his face. He aimed his stream knocking you face first into the pool of Timmy’s pee.<br>\r\n<br>\r\nFinally he finished up and gave himself a few shakes, sending the last drops far off target. “You felt good in my pee” Timmy said proudly, his pants still around his ankles. Surfacing you can only yell “Get me out of here!”<br>\r\n</span></div></div>",
            "created":1463374800,
            "id":2148747,
            "title":"Inside a potty seat"
        },
        "1212112212":{
            "choices":[
                "Put him inside his pull up",
                "Slept with him being pressed to his chest"
            ],
            "content":"<div class=\"\"><div> <span>Timmy brought Andy to his mouth and he began opening his mouth. Andy could see how Timmy's wet tongue got closer and closer until Andy was right in front of it. Timmy closed his mouth and Andy got stuck inside of it, getting wet by Timmy's saliva and feeling some pressure when Timmy began sucking on Andy. <br>\r\n<br>\r\nAndy POV<br>\r\n<br>\r\nAndy was getting massaged by Timmy's tongue for what seemed like hours. When suddenly Andy's whole body was inside Timmy's mouth, Andy was being thrown around Timmy's mouth from cheek to cheek and under Timmy's mouth. Timmy's mouth was very humid and had a bad smell, like Timmy hadn't brushed his teeth well. Andy was terrified of being swallowed, thankfully it didn't happen<br>\r\n<br>\r\nTimmy POV<br>\r\n<br>\r\nTimmy was sucking on Andy for a while, soon enough Timmy sucked all of Andy and began playing with him inside his mouth. After some minutes of sucking on Andy Timmy decided to sit down on the floor and put his feet together. Timmy spat Andy in between his feet.<br>\r\n<br>\r\nAndy just got new sight of his position and Timmy just giggle at him \"You tasted yummy\" said Timmy. After that Timmy began rubbing his feet together with Andy between them. Andy got all dizzy after 2 minutes of rubbing and all the dirt of Timmy's feet was being put on Andy's body. \"You tickle me\" said Timmy.<br>\r\n<br>\r\nTimmy separated his feet and Andy fell, exhausted after all the rubbing. Timmy grabbed Andy and brought him to his nose, Timmy inhaled deeply and Andy felt like he was going to get inside Timmy's nose. \"You stink Andy\" said Timmy. After that Timmy spat all over your body and rubbed Andy with his finger. <br>\r\n<br>\r\nAndy felt an invasion of his privacy and tried to cover his manhood, Timmy noticed this and tried harder to clean Andy's penis. When Andy couldn't protect anymore Timmy took full swing and played with his penis in his hand. Andy began feeling aroused and soon his penis got hardened, Timmy started rubbing harder, but not enough to make it feel uncomfortable. Soon Andy peed all over Timmy's hand and Timmy let go of him. \"EEEWWWWW\" yelled Timmy. Andy rolled all over Timmy's stomach and fell on Timmy's left leg. <br>\r\n<br>\r\nTimmy stood up and ran to wash his hands in the bathroom. Andy just fell from Timmy's body and began pulling himself together when Timmy got back and brought Andy to his face. \"You peed on me\" said angrily. Andy couldn't say anything before Timmy brought him to his penis \"Now I pee on you\". Andy could only see how Timmy's penis got tighter with his pee accumulating and SPLASH!!! Andy got wet for what seemed like hours and only a few seconds for Timmy. When the stream died Andy began coughing and was brought to Timmy's face. \"Now you are all wet and stinky\". Andy was ashamed of what just happened, but what could he do against a giant little kid?<br>\r\n<br>\r\nTimmy left Andy over his bed so he could go and search for a pair of pull ups for the night. He put them on and they were a blue colored pair of pull ups, with some buzz lightyear drawings on it. \"Ready to go to sleep\" said Timmy. He grabbed Andy and...</span></div></div>",
            "created":1422421200,
            "id":1924351,
            "title":"He plays with him on his feet"
        },
        "12121122121":{
            "choices":[
                "Stay where he is (Something happens)",
                "Try and escape "
            ],
            "content":"<div class=\"\"><div> <span>Shoved him to the front side of his pull up. <br>\r\n<br>\r\nAndy fell for quite a few seconds and landed on a soft piece of plastic, and behind him was the penis of his big pal.<br>\r\n<br>\r\nTimmy saw the whole thing while keeping his pull up open. \"Have a good night toy\", and with that Timmy let go of the band leaving Andy in total darkness. <br>\r\n<br>\r\nTimmy rolled  a few times before accommodating himself good enough to feel comfortable facing to the ceiling. Andy was pushed to Timmy's penis a couple of times in that process and landed over Timmy's tiny sack. Timmy pressed his hand to the front side of the pull up and pushed Andy harder to his sack. After a couple of minutes the force diminished and Andy slipped to the lower part of the pull up, right in front Timmy's butt cheeks.<br>\r\n<br>\r\nAndy had to decide, stay where he was or try and escape his big pal pull up?</span></div></div>",
            "created":1428210000,
            "id":1959330,
            "title":"Put him inside his pull up"
        },
        "121211221212":{
            "choices":[
                "Shoved inside his mouth like a pacifier",
                "Timmy put you in his belly bottom"
            ],
            "content":"<div class=\"\"><div> <span>Andy was not having it with staying inside a 5 year old boy diaper, even in the loneliness of darkness Andy was determined to escape his plastic prison. <br>\r\n<br>\r\nSeeing how he was trapped in the back part of Timmy's pull up he tried to climb the fabric to get outside through the upper part of the pull up, he slid a couple of times until he fell on Timmy's balls and started moving recklessly to escape the situation. Seconds later Andy felt some movement outside and began being pressed against Timmy from outside. Just as fast as that happened the pull up opened and through the dark a hand snatched him from there. <br>\r\n<br>\r\nTimmy's POV:<br>\r\n<br>\r\nTimmy groggily woke up and felt a weird feeling inside his pull up, something ticklish and with a swift hand movement he tried to discover what was that by pressing his hand in front his pull up. Timmy remembered he had a toy inside his pull up and with his other hand he opened his pull up while picking his little toy out. Lifting him to the front of his face Timmy said:<br>\r\n<br>\r\n\"Don't do that toy, I'm trying to sleep... I need to put you somwhere, not my pull up... I know\"<br>\r\n<br>\r\nAnd in a quick motion Timmy...</span></div></div>",
            "created":1442120400,
            "id":2033941,
            "title":"Try and escape "
        },
        "121211222":{
            "choices":[
                "Groin",
                "Feet"
            ],
            "content":"<div class=\"\"><div> <span>Timmy lift Andy up to his face. \"Why are you crying?\" Little big Timmy wondered.<br>\r\n<br>\r\n\"You just peed all over me\" sobbed tiny Andy.<br>\r\n<br>\r\n\"Don't worry I'll clean you\" said Timmy and before you could say something Timmy took a bit of soap and started rubbing his hand together with you between them, you got covered by soap and before you knew it you were lowered and lifted up from the water. Timmy brought you under his nose and almost sucked you inside his nose. \"You are clean now\" said Timmy happilly.<br>\r\n<br>\r\nAndy stayed quiet for a bit and thought better of what to say next...<br>\r\n<br>\r\nTimmy didn 't wait long and said \"I cleaned you, now you must clean me\" with that Timmy began lowering you to his....</span></div></div>",
            "created":1422334800,
            "id":1923884,
            "title":"He stays in the tub with Andy for a bit"
        },
        "1212112221":{
            "choices":[
                "Timmy grabs you",
                "Timmy stood up and you fell to the water"
            ],
            "content":"<div class=\"\"><div> <span>Andy was lowered to Timmy's penis and got a hold of it. For Andy's luck Timmy's penis was all slippery and Andy felt to Timmy's scrotum, just over his left testicle. Timmy felt a funny sensation and wondered what it was. Andy tried to get out of the area and before he could do it Timmy's hand floated over his groind and pressed you against his scrotum. \"What are you doing?\" Said Andy.<br>\r\n<br>\r\n\"I like you in there\" said Timmy. Andy began struggling to get free to no avail. While Timmy just felt a funnier sensation, once Andy stopped Timmy began rubbing Andy against his balls and peed in the process.<br>\r\n<br>\r\n\"That felt good\" said Timmy, while Andy was still clinging to Timmy's balls and being ashamed of how easily he was overpowered by a 5 year old penis. Suddenly...</span></div></div>",
            "created":1422334800,
            "id":1923885,
            "title":"Groin"
        },
        "12121122211":{
            "author_id":"chettotaser",
            "author_name":"Chetto",
            "choices":[
                "Back in the school bathrom with teen and preteens",
                "Tied in the bedroom, about to be sexually tortured by Timmy and his friends"
            ],
            "content":"<div class=\"\"><div> <span>\"I got an idea\" said Timmy with a rather excited face<br>\r\n\"But first, let's get out of here, we are done with the bath\"<br>\r\n\"W-w-what could it be?\" asked Andy<br>\r\n\"You will soon see\" Timmy replied <br>\r\n<br>\r\nAnd with that, he, with Andy in his hand, get off the bath to his bedroom, both still naked and not totally dry.<br>\r\n<br>\r\nTimmy slowly but confident said \"When my 17 year old cousin called Tommy came to visit us, he told me about a little something called \"sex\", he explained to me a little but he also told me he wouldn't show me, and i don't have acess to Internet to search it, but looking You closer, You are Timmy. Erik, your 16 year old cousin is friend of Tommy, Tommy told me he did show \"sex\" to Erik, and Erik show it to You\"<br>\r\n<br>\r\nHe was rigth, Erik indeed showed and explained sex to Andy<br>\r\n\"So....\" continued with shame \"i want you to demostrate me\"<br>\r\n<br>\r\nAndy was nervous but quickly responded \"Even if i wanted to, my size is a problem\" <br>\r\n\"Oww...don't worry, i have my toy\" and with this, Timmy runs towards the closet and with a quick move, Timmy obtains a 'gun\" of some sort, but instead of bullets, he shots at Andy a laser beam. Andy starts to get dizzy, after a moment Andy realise that he grew, he is now 1/2 the size of Timmy.<br>\r\n<br>\r\n\"Ok\" replies Andy \"sex is.......\"<br>\r\nAndy's explanation was long, very long but Aldo extremely descriptive<br>\r\n\"...and that is all, understood?\"<br>\r\n With a bored face, all Timmy said was \"bla bla bla, i don't care for details i want you to demostrate it\"<br>\r\nAndy saw at Timmy's wee wee, it was kinda hard, Timmy did care for the details after all.<br>\r\n<br>\r\n\"I won't do it\" angry Andy said<br>\r\n\"You won't? I am glad you said that\"<br>\r\nAnd with a hit to the head, little Timmy made Andy fall uncouncicious.<br>\r\n<br>\r\nWhen Andy woke Up he was...<br>\r\n<br>\r\n(note to the creator: i don't know if You made a chapter or what, but the story is fantastic, if you liked my addition, and you can and you want inform me, please let me know so i can add more chapters, if you disliked it you can freely delete it)<br>\r\n(Note: english is not my native language so sorry for the mistakes, this is my first work so it took me 3 hours then i would be grateful if someone continues this path)<br>\r\n(delete all notes if you want, i don' know what i am doing with these)</span></div></div>",
            "created":1529557200,
            "id":2510534,
            "title":"Timmy grabs you"
        },
        "121212":{
            "author_id":"rockyhorror",
            "author_name":"RockyHorror",
            "choices":[
                "In a pair of clean undies for Timmy",
                "Between his mother's breasts"
            ],
            "content":"<div class=\"\"><div> <span>Andy's mind was rather preoccupied with his current predicament. So much that he wasn't watching where he was going. He walked around the sink, past the bath toys, and right to the edge of the bathroom counter. He suddenly hears Timmy splashing and laughing at how much fun his bath was. At that moment he looked up and noticed where he was. But, it was too late. As much as he tried to catch himself, he couldn't keep his balance and began to fall. His tiny screams were too quiet to reach the ears of Timmy or his mother. Luckily, his fall was broken by something soft. Andy opened his eyes and saw that he had landed... </span></div></div>",
            "created":1342328400,
            "id":1378987,
            "title":"He's running towards the edge of the counter!"
        },
        "1212121":{
            "author_id":"thearchaic7",
            "author_name":"Castle Kriegen",
            "choices":[
                "In the Front!",
                "In the Back!"
            ],
            "content":"<div class=\"\"><div> <span>Though Andy's fall was broken by the fresh undies' soft fabric, he was still made thoroughly dizzy and disoriented from falling such a big height! He stumbled and fell into the center of the underwear, being concealed just barely by a fold in the fabric, and struggled to hold his eyes open as time seemed to fly around him!<br>\r\n<br>\r\nA few minutes pass, Andy was still dazed in the 4 year old's underwear when he felt something shifting! The cloth beneath him flexed and held him like a hammock, and he felt a rush of wind before a shadow blocked his view! He realized what was happening, he was being pulled up Timmy's legs until the pair of undies firmly fit the little boy! \"Thank you, Mommy!\" the preschooler said as he hurried back to his room to play with his toys before sleep!<br>\r\n<br>\r\nWhere did Andy end up in Timmy's underwear?</span></div></div>",
            "created":1493355600,
            "id":2311911,
            "title":"In a pair of clean undies for Timmy"
        },
        "12121211":{
            "author_id":"thearchaic7",
            "author_name":"Castle Kriegen",
            "choices":[
                "Into the slit!",
                "Out through the front of Timmy's undies, he knew how to take care of this!"
            ],
            "content":"<div class=\"\"><div> <span>Andy was lifted up in the little boy's undies until he was firmly pressed up against Timmy's young, flaccid boyhood! He struggled and pushed against the thing, but it was more than twice his size! He squirmed and wiggled, trying to break free, but only managed to get himself wedged between the tip of Timmy's foreskin and the underwear that was his prison! Andy groaned, wanting to be free from this hell hole, but luck was not on his side as the boy started to walk around, mashing him into the tip of his dick as he ran to his room and began playing with his toys, unaware of the boy trapped on his thingy!<br>\r\n<br>\r\nAndy kept up his struggles as he felt the boy moving around, but all the movement seemed to have gotten Timmy's blood flowing, causing a certain part of him to get hard, making Andy's time in his undies even more stressful! Where did the slowly rising erection manage to push Andy?</span></div></div>",
            "created":1493355600,
            "id":2311925,
            "title":"In the Front!"
        },
        "121212111":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "Andy tries to force climb his way out",
                "Andy is shaken around by something outside"
            ],
            "content":"<div class=\"\"><div> <span>Andy silently complained as Timmy's growing cock started to press against the already tight space that was his underwear, restricting him even more. The young boy tried his best to wriggle out before the phallus has the chance to crush him completely. He could feel his stamina almost wear out until he felt something in his foot. <i>A way out?</i> Andy wondered, as he started to shift his positioning towards where his foot was trapped in. The constant movement seems to agitate the giant dick, much to Andy's confusion, until his new positioning caused him to realize his mistake. Andy unknowingly trapped himself inside Timmy's hole!<br>\r\n<br>\r\nAndy tried to struggle out but it was already too late, he was sliding more and more into the 3\" penis, eventually becoming enveloped into his musky urethra. He slid down the pathway, his screams muffled by the body part, before he ended up sliding into one of the tubes on the side. After being forcibly sucked into the side tubes, Andy found himself slipping into an area unknown to him. His body crashed down on the floor, causing a muffled groan out of Timmy, as he looked around him. The area was small and tight, and filled with a white liquid up to his ankles. He was inside Timmy's balls!<br>\r\n<br>\r\nAndy needed a way out, but how?</span></div></div>",
            "created":1591765500,
            "id":2848919,
            "title":"Balls Deep into Deep Balls"
        },
        "1212122":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "Mrs. Smater notices Andy",
                "Andy slips and falls down Mrs. Smater's clothes"
            ],
            "content":"<div class=\"\"><div> <span>Andy couldn't help but moan and snuggle up against whatever it was that broke his fall. After gaining a bit of composure, he opened his eyes, and soft flesh filled his vision. He looked around, until he saw a v-shaped window to the outside world. He could easily see Timmy splashing about in the tub without a care in the world. Timmy took another look at his surroundings. <i>Wait a minute...</i> Andy wondered. <i>This is Timmy's mom's b... boob...</i><br>\r\n<br>\r\nThe realization that he was in between the tits of a smoking hot mom was too much for his young mind to process. Not helping was the revelation that Mrs. Smater wore no bra at all, meaning that Andy could fully see her nipples if she wanted to.<br>\r\n<br>\r\nSuddenly, everything around Andy began to shake, as Mrs. Smater began to take Timmy out of the bath to dry and clothe him. Andy tried his best to hang on by grabbing onto the soft breasts. However...</span></div></div>",
            "created":1589859000,
            "id":2837842,
            "title":"Into Mrs. Smater's Boobs"
        },
        "12121222":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "Squirm deep into Mrs. Smater's slit",
                "Do nothing and risk getting caught"
            ],
            "content":"<div class=\"\"><div> <span>Try as Andy might, he was still no more than a 6 year old boy with average strength and stamina. He tried to grip on as much as he could, but soon started to slip between Mrs. Smater's breasts and started to fall deeper into her shirt. Andy screamed, yet no one heard him from his size and underneath all that fabric. After what felt like an eternity, Andy eventually saw himself face to face with another crevice, this time into Mrs. Smater's panties.<br>\r\n<br>\r\nAndy slipped into the front of the mom's private area, being smothered down by feminine parts unknown. <i>This is a girl's...?</i> Andy once again mentally stuttered. It was warm, and Mrs. Smater's private slit was soft and moist, with the skin surrounding it appearing to be clean shaven. Andy tried to stand up, but was knocked unbalanced thanks to the mom getting up.<br>\r\n<br>\r\n***<br>\r\n<b>[Mrs. Smater's bedroom]</b><br>\r\n<br>\r\nMrs. Smater was confused as to why she suddenly started feeling a bit sensitive down in her privates. In spite of the title, Mrs. Smater was single, and it has been ages since she last felt the intimate touch of a man. Her son Timmy was resting in his room, so Mrs. Smater took the time to lie down, and hopefully scratch the itch that appeared.<br>\r\n<br>\r\n***<br>\r\n<b>[Mrs. Smater's panties]</b><br>\r\nAndy could see the fabric above him starting to move. It was the mom! He had to act fast, otherwise he could be in big trouble!</span></div></div>",
            "created":1589860260,
            "id":2837850,
            "title":"Deeper into Mrs. Smater"
        },
        "121212221":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "Andy slipped into Mrs. Smater's cervix, trapping himself in her womb",
                "Andy was flushed out with Mrs. Smater's orgasm"
            ],
            "content":"<div class=\"\"><div> <span>Andy was stunned as light began to shine through the opening that Mrs. Smater forced open with her own hands, panic seeping into his overworked mind. If she were to discover him in this place, then who knows what she might do to him. He started to crawl back, his leg getting stuck in the wet opening that the single mother was aiming for. Andy looked at the opening and took a deep breath. If he wanted to survive a bit longer, he had to do this, so without a moment to lose, Andy dove straight into Mrs. Smater's open pussy.<br>\r\n<br>\r\n***<br>\r\n<b>[Meanwhile...]</b><br>\r\n<br>\r\nMrs. Smater gasped in surprise and bliss as she felt something fill her pussy. Had it been any other situation, Mrs. Smater would be alarmed and confused, but right now, she didn't care at all. Her itch was being scratched as her moans started to grow louder and more sexual.<br>\r\n<br>\r\n***<br>\r\n<b>[Mrs. Smater's vagina]</b><br>\r\n<br>\r\nAndy felt hot as he crawled through his very first pussy. And not just hot in temperature, but mentally too. The longer he crawled deeper into Mrs. Smater, the more shallow Andy's breath has become, the faster his heart beat, and the tighter his pants grew. He didn't know what all this meant, but he didn't want it to stop. Andy shuffled as he got closer to the cervix, deciding to squirm out of his clothes into a more comfortable nothingness. He looked around him, mesmerized by the pulsating caves secreting lubricant liquids, the fastening sounds of Mrs. Smater's heart, and the muffled moans of Mrs. Smater herself. Andy also looked down on himself, beyond his fast breathing was his boyhood standing tall at a good 3 and a half inches, impressive for his age. Suddenly, everything began to shift all around him. The tunnel started pointing upwards, the liquids was rushing in rapidly, and the cervix Andy was now standing on was gasping open. Mrs. Smater was about to cum, and in that moment...</span></div></div>",
            "created":1591582740,
            "id":2847797,
            "title":"Deep Investigation"
        },
        "1212122211":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "Andy's sperm began to react, Mrs. Smater's fresh egg is fertilized",
                "Nothing happens and Andy begins to look for a way out"
            ],
            "content":"<div class=\"\"><div> <span>Andy could only yelp in response to being pulled into the opening hole at the end of Mrs. Smater's tunnel. Good news is that he's no longer at risk of discovery. Bad news, he's stuck even deeper into Mrs. Smater, yet for some reason, he doesn't find himself complaining...<br>\r\n<br>\r\n***<br>\r\n<b>[Mrs. Smater's bedroom]</b><br>\r\n<br>\r\nMrs. Smater pant heavily as he orgasm started to fade, feeling relieved from her pent-up tension. Though she could swear she felt something enter her deeper, the mom ultimately brushed it off. Her energy was drained, so she decided to sleep the rest of the afternoon.<br>\r\n<br>\r\n***<br>\r\n<b>[Mrs. Smater's Womb]</b><br>\r\n<br>\r\nAndy stood up to see the gigantic place he was residing in, still naked and erect. Though a part of him is telling him to panic, Andy is ultimately too wound up in his discovered lust to seek a way out. The heat from Mrs. Smater carried over from her vagina, and while the aphrodisiac-like effects weren't as potent as before, it was still enough to cause conflict in Andy's young and eager mind. He started to travel downwards to one of the tubes entrances before ultimately sitting down in one spot. Andy was curious with his erection to start rubbing and touching his throbbing penis, his hands and member lubricated from all of the liquids from before. Andy gasped and moan as his boyhood reacted to his touch, and soon he found himself masturbating for the first time. Andy's moans grew louder and louder before an overwhelming wave of pleasure began to rush over him. His tiny little balls tensed as his penis started to twitch furiously. Normally, nothing would've shot out of his penis, but whatever caused Andy to shrink also caused his sperm factories to start running at full capacity. Andy yelled in pleasure as his youthful penis began to shot out white hot streams of cum, filled with trillions of potent spermatozoa in a 30 Milliliter load. Andy didn't think much of it until the pleasure wore off, where he noticed in confusion what the sticky white stuff was. But that's not all that happened, some of Andy's load got onto a ball that was slowly rolling into Mrs. Smater's womb. Andy screamed as he got out of the ball's way, the surface of it rolling over the rest of Andy's freshly squeezed cum. The ball stood still in where Andy once stood. Andy watched the ball as...</span></div></div>",
            "created":1591584180,
            "id":2847810,
            "title":"Mrs. Smater's Chamber of Love"
        },
        "12121222111":{
            "author_id":"cyoamall",
            "author_name":"CYOAMall",
            "choices":[
                "[Present] Andy tries to look for a way down",
                "[Time Skip] Mrs. Smater becomes pregnant with Andy's child"
            ],
            "content":"<div class=\"\"><div> <span>Andy stopped to see if the ball coated in his first ever load did anything to it, waiting patently in his nude form still. Suddenly, the ball started to shake, with soft tremors radiating throughout the walls of Mrs. Smater's womb. The ball suddenly shifted, almost like it was trying to dig underneath the floor Andy was standing on. Andy couldn't tell if what was happening was a good thing, but that didn't matter to him at the moment. If the process went on, then there's a chance Andy could be trapped in here with the ball indefinitely.<br>\r\n<br>\r\nHe turned to see the cervix he entered from, still open for who knows how long. With the tremors getting bigger from the ball thing sinking in deeper into the womb, Andy had no choice but to run as fast as his youthful legs could take him. He got to the hole eventually, and leapt through it, just barely escaping as the cervix hole closed. Andy sighed as he rested in Mrs. Smater's vagina once more, thinking back to the ball coated in his white stuff. \"What did I shoot out?\" Andy wondered to himself. \"And why did that ball started moving like that?\"<br>\r\n<br>\r\nAndy shook the questions out of his head when he couldn't think of an answer to them. He grabbed his clothes, heavily soaked from the juices, as he made his way out of the mother's hole, slipping through her panties and out into the open world again. Hopefully whatever he did in there wouldn't have any consequences.</span></div></div>",
            "created":1591680540,
            "id":2848408,
            "title":"Unknown Reaction"
        },
        "12122":{
            "author_id":"s_p_r",
            "author_name":"S_P_R",
            "choices":[
                "His",
                "His little sisters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it his, or his little sister's?</span></div></span></div>",
            "created":1327986000,
            "id":1269015,
            "title":"Timmy puts Andy into a diaper."
        },
        "121221":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "he pees his diaper in the night after placing you in the pull up instead",
                "he places you in his older sisters pink pull, and she pees and poops on you."
            ],
            "content":"<div class=\"\"><div> <span>Timmy smiled as you rose towards his face, he didn't say a word, he walked over to the dresser with you in hand.<br>\r\n<br>\r\nTimmy  bent down and yank his pants down, he awkwardly flung them off with his feet.<br>\r\nHe knelt down and opened the dresser, inside where underwear, next to them where diapers and pull ups.<br>\r\n<br>\r\nTimmy quickly got out the diaper and a pull up, and called his mother, he heard her coming and had to hide you, he flung you into his mouth hiding you under his tongue.<br>\r\n\"Ok let's get you into your diaper\" his mother said as she entered the room, soon she had him diapered and said \"now you put your pull up over that to stop leaks , you know how bad you wet\" , he nodded.<br>\r\n<br>\r\nTimmy put on his pull up, and remove you from his mouth, he looked at you and plunged you down into the diapers inner chamber, you where pressed up against his balls by the diaper and pull up combined, timmy got into bed, even though the sun was still up, his older sister was place in with him, and they dosed off to sleep.</span></div></div>",
            "created":1374037200,
            "id":1629594,
            "title":"His diaper"
        },
        "121222":{
            "choices":[
                "front",
                "back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he put u in his little sister's diaper but he put u in the.......</span></div></span></div>",
            "created":1374037200,
            "id":1629799,
            "title":"His little sisters"
        },
        "1212222":{
            "choices":[
                "in the little girl's diaper",
                "in the boy diaper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he put u in the back of her diaper and she just started to poop and he put u in there just in time then she sat down mushed up the poop on u then her mom cleaned her up and saw u there put she decided to put u where?</span></div></span></div>",
            "created":1375246800,
            "id":1637319,
            "title":"back"
        },
        "122":{
            "choices":[
                "ingnores it. It's probably nothing!",
                "takes off his shoe and finds you",
                "trips, his shoe flies off, and you go flying"
            ],
            "content":"<div class=\"\"><div> <span>Andy makes a quick decision and wedges himself in the shoe along-side Timmy's socked foot. Andy is right next to the bony ankle and can fell Timmy walking. Suddenly, Timmy starts to sweat and Andy begins to slide into the shoe. Andy slides along the edge of the shoe until he is stuck underneath Timmy's toes. Timmy keeps walking, oblivious to his friend underfoot. Andy continues to get mashed into the insole, but miraculously survives. Timmy starts to feel a tingling sensation beneath his toes. He...</span></div></div>",
            "created":1288933200,
            "id":987548,
            "title":"Wedge himself inside Timmy's shoe"
        },
        "1221":{
            "choices":[
                "Timmy finds Andy in his shoe and takes him to his room",
                "Timmy finds Andy in his shoe and takes him to the bathroom",
                "Timmy wears his shoes indoors too"
            ],
            "content":"<div class=\"\"><div> <span>Andy breathes heavily and find the inside of the shoe smelly. He feels Timmy's big toe but didn't feel a sock. He then realized he wasn't wearing one that day. What he felt was a white band-aid on his ankle. He licks the darkness above in curiosity and your tongue tastes something smooth and sweaty. Andy just licked one of Timmy's toes.<br>\r\n<br>\r\nYou thought being trapped in his shoe without a sock on wasn't bad enough, but you found out he had PE next. For that class, the exercise was to see how fast they can run a mile, if they can. Timmy was a decent runner for his age but he sweats a lot. <br>\r\n<br>\r\nHe began to run and Andy was soon covered in foot sweat. Andy was bumping up and down from all the movement of Timmy running. Andy ended up with one of Timmy's enormous toes in his mouth. He then wedged himself through the big toe and his other toes to stay under the small arch that his toes make. Andy curled up in there until Timmy got home. Andy was barely able to breathe and what he was able to breathe was the foot odor that Timmy was giving off.<br>\r\n<br>\r\nAndy knew when Timmy got home and started banging on Timmy's big toe and tried licking it to see if he would feel it.</span></div></div>",
            "created":1306472400,
            "id":1113684,
            "title":"ingnores it. It's probably nothing!"
        },
        "124":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "a kid your own age (your class)",
                "somone older (jr. high/highschool section)",
                "an adult (teachers lounge)"
            ],
            "content":"<div class=\"\"><div> <span>deciding that Timmy might not be your safest bet, you decide to get help elsewhere and quickly slip out of the bathroom as to not be seen.<br>\r\n<br>\r\nyour school was large to begin with,which is one would expect in a k-12th grade building..but now that you were a mere few inches in height the hallways were massive.<br>\r\nyou think to yourself where or whome you whould seek help from,and better yet,how you were going to get there,given your current stature everything seems big and off looking from your point of view...it was almost making you dizzy.<br>\r\n<br>\r\nyou finally make up your mind,that your best bet of getting help is from</span></div></div>",
            "created":1537688160,
            "id":2552034,
            "title":"looking for help"
        },
        "1242":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "the highschool girl's locker room",
                "a classroom",
                "a teenage student a few feet away from you"
            ],
            "content":"<div class=\"\"><div> <span>after giving it much thought,you decide to seek help from one of the \"big kids\"...you make a dash down the hall and around a couple of corners and up a short flight up steps,which take a while for you given your size,after climbing over the last step you are exhausted \"i never want to see a flight of stairs again\" you mutter in annoyance.catching your breath you continue down the hall until you stop in front of...</span></div></div>",
            "created":1537688940,
            "id":2552039,
            "title":"somone older (jr. high/highschool section)"
        },
        "12421":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "she sees you",
                "you try to get her attention/quietly leave"
            ],
            "content":"<div class=\"\"><div> <span>you clance up at a large door you are pretty sure is a bathroom or locker room,not wanting to run down the halls any more you decide to look for somone in here...there was a good sized doorcrack that you were easily able to slip under. as you wander in your assumption is correct that you are infact in a locker room..a rather large one that seemed to extend and wrap around a corner your eyes get wide as you you hear talking coming from around that corner...two female voices. you walk down the short and glance around the corner to confirm what you heard. as you see too teenage girls talking,sophomore at least. one of them in a green tanktop and shorts with short red hear,large boobs and green eyes....the other girl with a pretty face,blue eyes and long black hair small sized boob..more noticeably was the fact that she was wearing nothing but her white bra and maching panties with a little blue rose on the front...seeing this made you turn bright red.<br>\r\n<br>\r\n\"oh crud im in the girls room\" you gulp...\"maybe one of them will help me?\" you say to yourself...\"or they might just kill me for being in here\" wou wait for a moment,eventually listening into the girls conversation and find out the black haired girl's name is Nicole and the red haired girl's name was Ashley.<br>\r\n<br>\r\n\"i can't believe my mom is making me stay home tonight,instead of going out  with my boyfriend\" Ashley huffed in annoyance leaning up against her locker. \"oh im sure its not that bad\" Nicole replied with a smile. \"easy for you to say...you dont even have a boyfriend\" Ashley retorted and soon shrugged \"not that boys haven't tried to throw them selves at you before\" to this Nicole sighs \"well they weren't my type\" \"oh,why not?\" Ashley rolls her eyes ...Nicole then gives a slight giggle \"oh you know why\". you arent quite sure what she means by that. \"oh like that will ever happen\" Ashley raises her brow. \"your lucky THOSE urges havent gotten you in trouble\" she continues \"especially the way you always walk by the 1st and 2nd grade boys,\"accidently\" leaning over them in that skirt.\"<br>\r\nyour jaw drops a littlle after hearing that.<br>\r\nNicole lets out another gigle \"its not my fault if they look\" she leans up aganst the wall and lets out a sigh,running her finger town her stomach \"i cant help,but be atracted to such cute little boys with those adorably playfull little faces\" she blushes slightly \"you wont tell anyone will you?\" Ashley nods \"no,were good...just,dont set off any amber alerts\" she face palms \"oh haw haw\" Nicole hufs.<br>\r\n\"oh crap i gotta get going before i get another detention...id hurry up and get dressed if i were you or youl get a slip too\" Ashly sais before grabing her back and running quickly out the door,almost trampling you in the process. as Nicole starts walking toward her locker...</span></div></div>",
            "created":1539602160,
            "id":2563946,
            "title":"the highschool girl's locker room"
        },
        "12423":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "14 yr old Travis (total jock,and school bully)",
                "16 yr old Sally (cheerleader,and and your super cute babysitter) "
            ],
            "content":"<div class=\"\"><div> <span>as you wander down the halls you eventually stop to catch your breath.you were beginning to think wandering off might have been a stupid idea.thankfully classes seem to be in session so you dont need to worry about being trampled by large crowds.you snap out of it when you see the shadow of someone walking in your direction.you then look up to see.</span></div></div>",
            "created":1537766640,
            "id":2552596,
            "title":"a teenage student a few feet away from you"
        },
        "124232":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span> you turn and see the figure of somone you instantly recodniz as sally...shes sophmore in the highschool attached to elementery building she had blue eyes and long black hair,put up in a ponytail and was dressed in her cheerleader outfit consisisting of a small top that only came down  part way,leaving her bellybutton exposed and a short plated skirt.<br>\r\nshe lived down the street from you and your parents,being busy all the time often payed her to babysit you.<br>\r\n<br>\r\nyou brighten up at the idea,as the two of you always got along great and she was always super nice to you...if anyone will help  you,its her.<br>\r\n<br>\r\nshe stops at her locker (not noticing you) just less then a foot away as you run over to her and try to shout to get her attention<br>\r\n<br>\r\ndoes she notice you?</span></div></div>",
            "created":1550716560,
            "id":2620617,
            "title":"16 yr old Sally (cheerleader,and and your super..."
        },
        "1242321":{
            "author_id":"vexxus",
            "author_name":"Vex",
            "choices":[
                "\"i just want to baby you\"",
                "*blush* because i have a crush on you"
            ],
            "content":"<div class=\"\"><div> <span>sally looks down and sees you...<br>\r\n<br>\r\n\"what the hell is...\" she takes a closer look,realising its you \"Andy!?\" she gasps as she kneels down to the ground to get closer to your level.<br>\r\n\"how did you end up like this...what happend to you?\" to this you only sob \"I don't know...it just happend\" to this ally only looks down at you and smiles. she sits down next to you. \"well its a good thing you found me...i guess im going to have to take care of you till we find out how to undo this\" to this you breath a sigh of relief...thank god,this was a much better idea than trying to go back to your own class,no telling what one of the other kids would do..or worse yet,if you were grabbed by one of the preschool or kindergarten kids. \"you smile,thanks sally your the best\"<br>\r\n<br>\r\n\"aww don't mention it sweetie...besides...you are just too CUTE\" she giggles. \"very funny\" you groaned. \"so any ideas on what were going to do?\"<br>\r\n<br>\r\nshe eyed  you up and down and just sighed...a look of serenity in her eyes....this made you feel a bit put off. \"hello,are you even listening to me?\"<br>\r\n<br>\r\n\"why rush things?\" she aid smiling conently...\"i want to keep you little for a while\"<br>\r\n<br>\r\n\"what...why?\" you snap back in disbelief<br>\r\n<br>\r\n\"Because... \"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1577462880,
            "id":2765330,
            "title":"found"
        },
        "13":{
            "choices":[
                "He let's him watch.",
                "He drops him in the toilet.",
                "He will be the toilet paper.",
                "He is put safely in Jacob's shorts pocket.",
                "Jacob sets him back on the floor."
            ],
            "content":"<div class=\"\"><div> <span>As Andy stared up in awe at the mammoth toilet bowl the door suddenly shot open. In ran another boy his own age, whom he recognized as a classmate. The boy, Jacob, hurriedly shut the door and pulled his shorts down in one quick motion. He seemed to be in quite a hurry, but froze in place as he leaned down to lower his underware. His eyes locked upon Andy, and a huge smile seemed to connect his ears. For a tense moment he feared that Jacob believed him to be a bug, which he was known for eating, but fortunatly he suddenly spoke. \"Oh, hi Andy!\" There was no indication wether he was at all aware of what was happening, or cared as such, but he was eagier for his new plaything. The boy's huge hand swung down and scooped up Andy, his original reason for entering the restroom apparently all but forgotten. However it suddenly hit him like a bolt of lightening as he stared at Andy, or more specifically he felt a strong tremor within his bowels. \"Oh, I guess I had better finish this up first. Pulling his briefs down Andy was forced to see his classmate as he sat down on the toilet. \"And as for you...\"</span></div></div>",
            "created":1169528400,
            "id":376167,
            "title":"Help captive"
        },
        "131":{
            "choices":[
                "The front side",
                "The back side"
            ],
            "content":"<div class=\"\"><div> <span>\"I will let you watch, and I know the best place,\" Jacob said grabbing you and then placing you on his cock.  Looking down at you he smiles as he starts to go the bathroom.  You would run away but you feel that if you do you will surely fall off Jacob's cock and land in the toilet bowl.  You don’t have to wait long before Jacob is done and stands up making fall into his underwear.  Jacob planed on doing this so he leaves you there and pulls up his pants.<br>\r\nWhen the pants are up are you on the front side or the back side?<br>\r\n</span></div></div>",
            "created":1169701200,
            "id":376627,
            "title":"Watching from onto of a cock"
        },
        "1311":{
            "author_id":"bigsteve",
            "author_name":"Bees Rock",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You are on the front side. You turn on your back and loom up at Jacob's massive dick. You try to climb up to get out. But the sensation causes him to get a boner. He starts to jack off and some pre-cum gets on your head. You finally slide out of his underwear and land on the floor. You get up and look around. You're on the floor of the classroom. You get up and run to one of the girl's shoes. [you have a foot fetish] You notice that Lisa doesn't have on any socks. You go over to her sneaker and climb in. Then she gets up to go to the bathroom.  Does she notice you?</span></div></div>",
            "created":1290920400,
            "id":1003177,
            "title":"Jacob's Massive Cock"
        },
        "13111":{
            "author_id":"bigsteve",
            "author_name":"Bees Rock",
            "choices":[
                "Reader's Choice",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Once she gets to the bathroom, she feels you squirming into her shoe. She takes it off and you land on the floor. She looks at you.<br>\r\n<br>\r\n\"Hi!\" She says cheerfully. \"Do you wanna smell my feet?\" She looms her foot over you. Drops of sweat come down. She lowers it and the cheesy odor gets stronger. You take deep sniffs of her stinky toes.<br>\r\n<br>\r\nNow what?</span></div></div>",
            "created":1290920400,
            "id":1003184,
            "title":"Yes"
        },
        "131111":{
            "author_id":"sean9321",
            "author_name":"seanboi",
            "choices":[
                "next 9 girls (all nine in one long post.)",
                "next three (all three in one long post)"
            ],
            "content":"<div class=\"\"><div> <span>she picks you up very gently, and cups you in the palm of her hand.<br>\r\n<br>\r\nshe has a very heart warming smile on her face, and you feel as though everything will be all right .<br>\r\nThe bathroom is very small just a single room no stalls so it is completely private.<br>\r\nThe girl locks the door and slowly lowers herself onto the toilet seat as she bends she whispers gently \"heeeyyyy, little guy don't be afraid\" she giggles a little.<br>\r\n<br>\r\n\"your a cute little fella' aren't you\" she says as she removes her right hand from cupping you, and it moves out of sight.<br>\r\n<br>\r\nyou hear a slight fabric scratching noise but take no notice of it, she smiles at you and then you look down and notice her pants are down and you can see her bare pussy and the cold waters of the toilet bowl bellow, you fear for your life as she tips her hand very suddenly and almost sincerely says \"OOPS\".<br>\r\nYou splash into the toilet bowl and look up at the girls flexing asshole, you can see her prairy dogging a turd.<br>\r\n<br>\r\nyou hear a running sound as she start peeing into the bowl and the water around you turns yellow as a lemon, then turns to a dark goldy brown, then you hear it, thunk , thunk , two medium turds splashed into the bowl splashing you a few inches above the surface.<br>\r\n<br>\r\nStunned you look up and see the largest log of shit you will ever see hanging 90% out of her ass, it slips out as her anus lips gently squeeze around it as it slips giving it a goodbye kiss , it lands on you pushing you under and after a few seconds of struggling you climb up onto the turd.<br>\r\nyou look up and the girl is wiping, she throws the toilet paper away , from there you can see she is about 8 to 10 years old, you can still see her butt as she bends town to grab her pants first she grabs her under wear and you are shocked to see her pull up a pair of dry-nites pull ups diapers, she shakes her butt in you face one last time ,before she leaves she tapes a note to the toilet it says \"Do not flush as the plumbing is broken in this girls bathroom, do not use the boys use this one but don't flush\" she tapes it there and leaves you there.<br>\r\n<br>\r\nyou have to go through the next nine girls using this bathroom before your found.</span></div></div>",
            "created":1369112400,
            "id":1594432,
            "title":"Reader's Choice"
        },
        "133":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Lunch time! Beans and Boiled eggs!",
                "Classtime!",
                "Recess!"
            ],
            "content":"<div class=\"\"><div> <span>\"You'll be my toilet paper!\" Jacob said excitedly.<br>\r\nJacob had planned this. Jacob was tired of being bullied by Andy.<br>\r\nAndy always told Jacob that he smelled like poop and farts.<br>\r\nNow it was time for Jacobs's revenge.<br>\r\n<br>\r\n\"You are always a meanie to me.\" Jacob told Andy.<br>\r\n\"You say I always smell like poopie. Now he's your turn to smell like it!\" Jacob chuckled.<br>\r\n<br>\r\nBefore Andy could beg for Mercy; Jacob grabbed him and let out diarrhea into the toilet. Jacobs's Anus was full of the sticky and smelly liquid.<br>\r\nJacob laughed and shoved Andy into his arsecrack and wiped it clean. Jacob shoved Andy into the toilet water and shook him around to get some of the scat off of him. Jacob then took Andy and shoved him in and out into his anus before shoving Andy completely into his dirty anus and letting out a large rotten fart. Jacob shoved up his pants happy his plan had worked and his meanie pants problem had been solved.</span></div></div>",
            "created":1533526740,
            "id":2529636,
            "title":"Jacob's Revenge."
        },
        "134":{
            "choices":[
                "back into his pocket",
                "down his pants"
            ],
            "content":"<div class=\"\"><div> <span>\"As for you Andy you will be safe in my short's pocket\" Jacob said as he places Andy inside a pocket crammed full of junk like rubber bands.  After Jacob finishes he pulls up his shorts and walks over to the sink as start to wash his hands when he is done he pulls you out and takes a closer look at you.<br>\r\n\"How did this happen,\" he asked.<br>\r\n\"I don't know,\" is the only answer that you have.  Jacob just shrugs and lifts you up to his eye level when you are even with his face he opens his mouth and you are afraid that he is going to eat you put he just sticks out his tongue and starts to lick you.  You giggle as he licks your feet but his fun is cut short when he hears the warning bell so he hurriedly decides to put you...<br>\r\n</span></div></div>",
            "created":1169701200,
            "id":376626,
            "title":"Jacob likes to lick"
        },
        "1342":{
            "choices":[
                "Laying on Jacob's head",
                "Stuck in Jacob's buttcrack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jacob looked around for a place to put you and then saw his shorts and decided to put you there. He dropped you in and closed the pants up and proceeded to class. Meanwhile you were...</span></div></span></div>",
            "created":1180760400,
            "id":412759,
            "title":"Into Jacob's Undies"
        },
        "13421":{
            "choices":[
                "Jacob was asleep!",
                "Jacob was playing with his friend, who just so happened to be a girl!"
            ],
            "content":"<div class=\"\"><div> <span>Andy laid down on Jacob's penis and simply sat there listening to the lesson. When he felt the oddest pressure on his butt, he thought nothing of it and began to drift of to sleep. Then all of a sudden he felt his butt slipping into Jacob's cock!<br>\r\n<br>\r\n\"Jacob! Help!\" but his cries and motions of his fist went unheard and unfelt as he was to small. Soon Jacob's cock had swallowed him up to his neck, and with one last cry Andy descended down into Jacob's shaft. He woke up inside a sac brimming with urine and outside...</span></div></div>",
            "created":1180760400,
            "id":412761,
            "title":"Slippery when small!"
        },
        "134211":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Jacob wakes up to his friend's predicament.",
                "Jacob remains asleep."
            ],
            "content":"<div class=\"\"><div> <span>Jacob was sleeping at home after lunch. Little did he realize his young friend was trapped in his bladder. Suddenly, he began to pee in his sleep. Andy was pulled back through the shaft and he jammed up just before the exit, his head all that poked out. Struggle as he might, Andy could not escape his friend's dick.</span></div></div>",
            "created":1190955600,
            "id":448564,
            "title":"Jammed Up"
        },
        "1342112":{
            "author_id":"fredmaydie",
            "author_name":"monkey",
            "choices":[
                "he wakes up and wonders where you are",
                "fells you in is balls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you try to escape but it u only makes yoiu get pulled further down and you soon fall in to hi sac</span></div></span></div>",
            "created":1249102800,
            "id":736713,
            "title":"Jacob remains asleep."
        },
        "13422":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "It's time to go home.",
                "It's time for lunch!"
            ],
            "content":"<div class=\"\"><div> <span>Andy was stuck in Jacobs's stinky butt crack.<br>\r\nJacob was happy to have a friend who would never be able to leave him and would be his friend for forever and ever!<br>\r\nJacob did have a problem with his gas and would usually go on a farting rampage.<br>\r\nJacob heard his stomach gurgle and let out a foul and rotten smelling fart onto Andy.<br>\r\nJacob kept letting out rotten farts smelling of rotten meat and other disgusting smells. Much to Andy's dismay.<br>\r\nJacob laughed as he kept farting on Andy.<br>\r\nAndy could barely breathe at the end of the farting abuse and his eyes were watering.</span></div></div>",
            "created":1533530700,
            "id":2529659,
            "title":"Stuck in Jacob's buttcrack"
        },
        "14":{
            "author_id":"musstika",
            "author_name":"Jester",
            "choices":[
                "Frontside",
                "Backside"
            ],
            "content":"<div class=\"\"><div> <span>Andy hear a Door open a little bit hurry and then the Stall where Andy is.It´s a Boy about 8 or 9 years old.He rush inside the Stall and close the Door.Andy had get to the Side of the Toilet Bowl and wait.The Boy sit down and doing his Business.Andy decides to jump into the Fly of the Boy.That seems better to stay trapped in the toilet room,because the Door too heavy to move for Andy with his 2 inch.He Jumps in and suddenly he feel lifted up very fast.<br>\r\n<br>\r\nHe look up and see the Boys little Cock and his ass.The Fly is a little to small for the boy so Andy get pressed tight against the boys...<br>\r\n</span></div></div>",
            "created":1149483600,
            "id":322725,
            "title":"Stay and Wait"
        },
        "142":{
            "author_id":"oohbbycaks",
            "author_name":"asdf",
            "choices":[
                "crack",
                "cheeks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andy screams as he is brought closer and closer to the boys butt. <br>\r\nThe boy doesn't notice him and leaves the bathroom, but is Andy up against his</span></div></span></div>",
            "created":1243227600,
            "id":696959,
            "title":"Backside"
        },
        "1421":{
            "choices":[
                "To class of course.",
                "The boy is going on a field trip!"
            ],
            "content":"<div class=\"\"><div> <span>The boy pulls up his underwear in a rush, he'll be late for class or wherever the boy is going, if he doesn't hurry. <br>\r\n<br>\r\nUnfortunately for Andy, that spells certain doom because the next thing he knows, the boy doesn't even glance down, he just lifts him and his underwear up at the speed of sound, pinning Andy, luckily, below the boys hole but not so lucky that the boy pretty much gave himself a wedgie. <br>\r\n<br>\r\nAs the boy runs to his destination, Andy is shaken back and forth, If he wasn't so wedged in he might be able to jostle around to the front, but that's not the case here, he's in there good but that still doesn't keep him from trying because he knows what could or even worse *will* happen when the boy sits down.<br>\r\n<br>\r\nThat leaves the only question, where is the boy going?</span></div></div>",
            "created":1255928400,
            "id":777998,
            "title":"crack"
        },
        "14211":{
            "choices":[
                "The boy lets one rip.",
                "The teacher asks him if he has anything for show and tell."
            ],
            "content":"<div class=\"\"><div> <span>The boy rushes right into class and throws himself into his seat right before the bell rang.<br>\r\n<br>\r\nAndy however, suddenly felt the swaying motions stop before SLAM, the boys ass makes contact with the seat, pushing Andy up and right next to the boys butt hole. The boy didn't really wipe all that well since he was in such a hurry and left over residue was left and stuck to Andy like well, flies to crap really. The smell was awful, but since Andy couldn't see a thing, he had no idea where he was until he reached a hand out and felt some puckered up skin, that is when it hit him. <br>\r\n<br>\r\nAndy began wiggling like his life depended on it because really, it did. The boy doesn't feel this however because Andy is way too small and sits there as the teacher begins roll call.<br>\r\n<br>\r\n\"You know the drill, stand up when you hear your name called children\", said the teacher.. \"Mike...? good take your seat. Rebbecca? Good. Rachel? Very good. Philip...?\" Just then the boy whose butt you're stuck in lifts up out of his seat smashing you between his butt cheeks as he stands up and the comes crashing down again. \"Good\"..<br>\r\n<br>\r\nThis time however, he doesn't sit up straight, he slouches with his legs moved forward and his upper back where his lower back should be, this giving the same effect as if he was standing up, removing any chance for Andy to free himself.<br>\r\n<br>\r\nSuddenly ..</span></div></div>",
            "created":1255928400,
            "id":778008,
            "title":"To class of course."
        },
        "142111":{
            "author_id":"realgirl",
            "author_name":"WritingGirl",
            "choices":[
                "Releases more gas",
                "Asks to go to the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Andy fought as hard as he could, but he could barely move his legs under all that weight. It didn't help that Phillip had given himself a wedgie from his quick movements. It didn't seem to bother him, but the fabric only helped crush Andy against his asshole. He felt the boy shift to get comfortable in his seat, smothering him in the leftovers of the bathroom incident. The giant over him grind his butt into the seat, itchy no doubt from his lack of wiping and his new visitor. Although suddenly the boy stopped, smashing Andy into his anus before it opened wide and released a rush of smelly air. He couldn't even prepare himself for the scent, gagging and squirming harder against the giant.<br>\r\n____________________<br>\r\n<br>\r\nPhillip didn't seem to pay the thought any mind, he was a young boy and didn't think much about what might be wriggling against his butthole, but he was aware of his gurgling stomach and that got all his attention. He groaned, placing a hand over his stomach in pain. In his rush to get out of the bathroom he hadn't finished, and by the way his stomach felt it'd be a long class. Although, he had a feeling he could fart, so he sits back a bit more so it wouldn't make so much noise and waits for the right moment before letting it free. He knew it'd make his stomach feel better and he didn't have and shame when he finally let one rip. He sighed, unaware that the tingling wasn't from his release of gas, but from his prisoner.</span></div></div>",
            "created":1344142800,
            "id":1398148,
            "title":"The boy lets one rip."
        },
        "15":{
            "author_id":"musstika",
            "author_name":"Jester",
            "choices":[
                "Steven the Class Bully Picks him up",
                "Marc his best Friend picks him up"
            ],
            "content":"<div class=\"\"><div> <span>Andy thing it´s better  to leave the Toilet room soon.He runs along the Wall like a Bug.As he try to open the Door he see that a 2 inch boy have not much Power.but he have luck a boy open the Door from outside and Andy can running to floor before the Door again close.he must look all time to all side not to get Squished by the other Kids,who are running to their Classrooms.<br>\r\n<br>\r\nFirst,Second,third Dorr....Ahhja Andy´s Classroom.<br>\r\nHe enter unseen to the open door and running to his Seat as suddenly----</span></div></div>",
            "created":1149483600,
            "id":322729,
            "title":"Running Back"
        },
        "151":{
            "author_id":"musstika",
            "author_name":"Jester",
            "choices":[
                "..his Underwear",
                "..his Trousers Pocket"
            ],
            "content":"<div class=\"\"><div> <span>Andy feels,that he get lifted very fast.Steven the Class Bully !!! He all time Pick on Andy when he can.The strongest Boy at his Class and over 7 1/2 Year´s old, and that´s the worst,he have ADHS (Hyperactive).That´s not good......<br>\r\n<br>\r\n\"Ahhh,what we have here !!! ...A new little Toy.\"Steven smiles.Let me see what I can do with you.The School-bell rings and the next Lesson begins.Mathematics on of Andy´s  favorite lessons.The Teacher Mr. Stone ask \"Do anybody know where Andy is ?\"<br>\r\nSteven must hide Andy fast...<br>\r\nHe answer fast before a other Child can :\"Yes Sir,he said,that he feels sick and got home\"<br>\r\n<br>\r\nAt this Point Steven hold Andy still in his Fist,he must hide him somewhere .He put´s him into his...<br>\r\n<br>\r\n</span></div></div>",
            "created":1169528400,
            "id":376124,
            "title":"Stevens Time"
        },
        "1511":{
            "choices":[
                "Look for someone you know",
                "Run out of the room",
                "They notice you!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your not going in there.  You bite his hand hard and he accidentally drops you.  Immediately you run as fast as possible.  Quickly you land on the floor and your feet take you far.  However you don't know where to go?</span></div></span></div>",
            "created":1196917200,
            "id":472624,
            "title":"..his Underwear, ha like hell you are!"
        },
        "15112":{
            "choices":[
                "Girl",
                "Boy"
            ],
            "content":"<div class=\"\"><div> <span>You quickly run past everyones feet and desks.  You head for the door and make it hastily.  Scared and fearing for your life you look down the hall.  You see a bunch of 3rd graders sitting in the hall.  They are waiting to go outside.  You quickly run as fast as you can to on of them and hide between there legs.  You pound on them and they look down at you and you look up in shock when you notice its a?</span></div></div>",
            "created":1196917200,
            "id":472625,
            "title":"Run out of the room"
        },
        "151121":{
            "choices":[
                "I will protect you (She is nice)",
                "You were better off with him (She does not like boys)"
            ],
            "content":"<div class=\"\"><div> <span>A brown haired girl with pigtails looks down at you as your in between here legs.  She has beautiful blue eyes and eyelashes.  She looks like she is about to scream.  \"PLEASE HIDE ME!\" you say loud enough for her to hear you.  She looks down at you then sees the school bully come out of a room and says, \"Now where did he run off to.\"<br>\r\n<br>\r\nShe looks down and sees the fear in your eyes.  She smiles at you then picks you up and bends down close you... and then whispers in your ear.</span></div></div>",
            "created":1196917200,
            "id":472627,
            "title":"She is a Girl"
        },
        "1511211":{
            "choices":[
                "Does what she said she was going to do... goes to the bathroom.",
                "She wants to talk to you..."
            ],
            "content":"<div class=\"\"><div> <span>You look up at her with a big grin.  She then puts you in her bib jean pants belly pocket.  She giggles as you get comfortable.  You lay there as she stands up.  They must be going outside now.  You wonder if she is going to help you.  Girls are annoying but you needed to rely on her help... you just hope you don't get koodies from her.<br>\r\n<br>\r\nShe walks for awhile and you can hear her talking to her friends.  The she runs around and your world is shaken.  You freak out and grab hold of her tightly.  Then she stops and asks a teacher if she can go to the bathroom.  The teacher takes her to the bathroom and she goes inside.<br>\r\n<br>\r\nOnce inside she...</span></div></div>",
            "created":1196917200,
            "id":472628,
            "title":"I will protect you (She is nice)"
        },
        "15112112":{
            "choices":[
                "Your being lifted out of the pouch",
                "Your still inside"
            ],
            "content":"<div class=\"\"><div> <span>As soon as she is in there she yanks you out.  You freak out because she is not gentle at all.  \"Your a naughty little boy.  Why did you run in between my legs?\" she said a little upset with you.<br>\r\n<br>\r\nYou turn pale as a ghost.  \"I am sorry... I was scared and I wanted to hide.\" you said to her.<br>\r\n<br>\r\nShe smiles down at you then says.  \"Oh, I forgive you.  Even though you are an icky boy.\" she says with a giggle.<br>\r\n<br>\r\n\"Thank you for saving me from that bully.\" you told her.<br>\r\n<br>\r\nShe pets your head.  \"Um... how did you get so small.\" she asks you.<br>\r\n<br>\r\n\"I don't know how... but its really scary.\" you say to her.<br>\r\n<br>\r\nShe giggles, \"I could gobble you up. Your so small.\" she says.<br>\r\n<br>\r\nYou jump back and bump into the sink mirror.  \"Please don't!!!\" you scream.<br>\r\n<br>\r\n\"I don't want to eat you.\" she then laughs really hard. \"Your a funny boy.  Um, I think I am going to keep you for myself.\" she giggles some after.<br>\r\n<br>\r\nYou look scared now.  She might keep you as her pet.  She then lays down her hand.  \"Common get on my hand.\" she smiles down at you.<br>\r\n<br>\r\nYou walk over to her hand and she lifts you back to the belly pouch on her bip pants.  You get comfortable again and she takes a tissue paper and stuffs it in there for you to cover up in.  You get so comfortable by the motion of her body and you can hear her heart beat and... your eyes get heavy... then you fall to sleep.<br>\r\n<br>\r\nWhen you wake up your...</span></div></div>",
            "created":1196917200,
            "id":472631,
            "title":"Talking with a Giant little Girl"
        },
        "151121122":{
            "choices":[
                "Be Brave",
                "You cant hide your fear"
            ],
            "content":"<div class=\"\"><div> <span>You sleep very well inside the pouch.  When you wake up its quite and you dont think the girl is wearing the bib pants any longer.  No longer vertical but horizontal.  You slowly crawl out of the pants.  You stand up and look around after leaving your Jean blue prison.  You look around at the outside and there was a vast plain of fuzzy white carpet.  You see a pink doll house and then you see a huge bed and everything is gigantic.<br>\r\n<br>\r\nYou keep looking around... you are awed by everything.  You never really liked dolls but the doll house could be fun to play in.  So you run up to it in a hurry.  You go inside and look at all the rooms.  Its full of plastic furniture.  Your starting to have allot of fun.  When you look out the side to see a giant.  You freak out and scream jumping behind the bed.  You see a massive hand reach over the beds.  It plucks you up from your shirt.<br>\r\n<br>\r\n\"Your scared.\" the titanic girl says.  Wait its the girl from earlier.<br>\r\n<br>\r\nYou let out a sigh of release. You close your eyes and take a deep breath.  Then you look up at her.  She pokes you onto your back.  \"It's only you.\" you say to her.<br>\r\n<br>\r\n\"Who else would it be.\" she says then starts rubbing your belly.<br>\r\n<br>\r\nShe lets out a burp in your face.  You frown and she giggles at you.<br>\r\n<br>\r\nIt smells like cookies.  But it also has that barf smell to it.  \"Your breath smells.\" you tell her.<br>\r\n<br>\r\n\"Yours does too.\" she says.  She giggles and puts you down on the floor between her legs.  \"I brought snacks.\" and she sure did.  There was a plate with Doritos and cookies and a glass of milk.  You slowly walk over to the plate.<br>\r\n<br>\r\n\"Can I have some?\" you ask her timidly.<br>\r\n<br>\r\nShe giggles again.  \"YEAH! Thats why I made the crumb pile for you.\" You crawl on top of the plate timidly.<br>\r\n<br>\r\nShe reaches for something and the hand is above you.  \"Im sorry ill get off!  Don't eat me!\" you scream.  She gets a Dorito and pops it into her big mouth.  She then picks you up and gives you a hug.  She swallows the chip and looks down at you.  \"You don't have to be afraid of me.\" she says.<br>\r\n<br>\r\nBe brave and lie or admit your fearful?<br>\r\n</span></div></div>",
            "created":1197176400,
            "id":473439,
            "title":"Big Room"
        },
        "1511211221":{
            "choices":[
                "Inform Molly?",
                "Stay silent and risk getting chewed up?"
            ],
            "content":"<div class=\"\"><div> <span>\"I-I'm not afraid!\" you yell up at her, \"A-and to prove it... I-I'll eat off your plate!\"<br>\r\n<br>\r\nYou climb up onto it as she giggles and nods her head. You watch her eat her chips as you nibble on the crumbs that fall down. You cannot help but stare at molly each time she eats a chip and gulps it down. You're morbidly intrigued as to what it'd be like... you try to rationalize it, making your  curiousity peak more and more.  You notice she's moved onto the cookies and decide to lay out on one. Noticing that she doesn't look at what she's eating you soon realize that she won't know you're ther and might chew you up. Do you...</span></div></div>",
            "created":1352178000,
            "id":1462470,
            "title":"Be Brave"
        },
        "15112112211":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "Yes, since you really want me to.",
                "No, it's too risky."
            ],
            "content":"<div class=\"\"><div> <span>You walk over to a cookie and prepare to lay upon it when Molly reaches and grabs for one. She misses you and grabs one nearby and raises it up to her awaiting mouth. You watch as bites down, her sharp teeth tearing the cookie to pieces before her tongue carries it into her mouth. You watch as she chews it up and tilts her head back and swallows. A small lump travels down her throat and into her chest cavity. Though you are bewildered by why you are having such thoughts, you feel the urge to travel down her throat too, and nestle within her warm, inviting body. You had never thought to wonder what it was like inside someone's belly, but you wanted to find out, and Molly has been so nice and friendly, that you know her tummy must be the same way. However, you have to inform her and convince her to swallow you, because in order for you to get to her throat and eventually into her cute little tummy, you need to avoid her sharp pearly whites. You call out to her.<br>\r\n<br>\r\n\"Molly! I'm over here near this cookie, I want to ask you something!\"<br>\r\n<br>\r\nShe looks down at you and gasps!<br>\r\n<br>\r\n\"Silly, I already know you are brave, but you should still be careful. I could have accidently gobbled you up with those cookies! I like you and don't want to hurt you.\" She smiles at you, but has a look of concern, she really is worried about hurting you. However, your mind has already been made up. You need to know what it will feel like sliding down into her.<br>\r\n<br>\r\n\"Well Molly, that's kind of what I want to ask you...I really want to know...what it would be like...inside you...in your belly. I want you to gobble me up, just don't chew me, and I can go inside your tummy and you can keep me safe and warm.\"<br>\r\n<br>\r\nMolly looks perplexed, \"I don't know if that is a good idea. How would you get out? And my tummy is for food...I don't know if you'll be ok in it.\"<br>\r\n<br>\r\n\"I'm sure it will be fine, Molly!\" You reply. \"You are a nice little girl so I'm sure your tummy is a nice, safe place too. And when I want to get out you just lay down and open your mouth and I will walk out! It will be fun.\"<br>\r\n<br>\r\nMolly put a finger to her lips and seems to be deep in thought. Perhaps she is considering saying yes?</span></div></div>",
            "created":1469163600,
            "id":2184389,
            "title":"Curiosity"
        },
        "151121122111":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "She hears you and tries to get you out.",
                "She does not hear you and you find out what happens to food..."
            ],
            "content":"<div class=\"\"><div> <span>Molly smiles at you. \"Ok, I will eat you, since that is what you want, and I do think it will be fun! I wonder what it will be like to have a tiny person living in my tummy!\" She giggles excitedly. \"First though, you have to take off your clothes, I bet they won't taste very good.\"<br>\r\n<br>\r\nYou quickly strip out of your clothing, and toss them off the side of the plate. You walk over to the cookies and lie down on top of one. You cannot believe this is going to happen. Soon you will be inside your new little friend!<br>\r\n<br>\r\n\"Ok Molly, it's snack time! There is a tasty snack here for you to try!\"<br>\r\n<br>\r\nMolly claps her hands excitedly, she enjoys you are making a game out of it. \"Hmm, I wonder which snack I should try. There are lots of yummy cookies here. I think I will try.....this one!\"<br>\r\n<br>\r\nAs she says that, she picks you up in her hand and brings you up towards her face. You are quivering with excitement. She licks her lips. \"Mmm...this one looks extra yummy...\" She opens her mouth and you gaze into it. Her sharp teeth guard the entrance to the pink, fleshy cavern, and behind them rests her soft, pillowy tongue upon the bottom of her mouth. Saliva is dripping from the roof of her mouth, and is bubbling up from beneath her tongue. She obviously is looking forward to tasting you. Beyond that you can see the entrance to her throat, the uvula hanging down is if beckoning you further into the abyss. Her hand opens up suddenly and pushes you forward towards her glistening maw, and you are propelled past her teeth and land directly on her tongue. You feel a sudden rush as her jaw slams shut, her teeth now blocking you from any chance at turning back. This was going to happen now whether you wanted to continue or not. Fortunately, you could not be happier. Your body is coated in saliva, and you can feel her warm breath on you, her tongue feels like a spongy matress beneath your rump. It slowly curls up and envelops you, caressing your body and savoring your taste. The cavern rumbles around you as Molly moans happily at your flavor. You laugh happily as her tongue dances around you, tickling every inch of your skin. This lasts but a few seconds, as Molly is ready to grant you your wish. The tongue lifts up, and you begin to slide toward the back of her mouth. Ahead you see her uvula rise up and the entrance to her throat widen to welcome you to your new home. You slide into her throat and the muscles of her esophagus quickly squeeze you and you begin your journey towards Molly's stomach. You think about what it must look like to Molly right now, you are nothing more than a small lump travelling down her throat, just another chip or cookie that she has consumed. The muscles push you down, and you can hear the sounds of her breathing and her heartbeat. Her heart is racing at the moment, caught up in the excitement of having a tiny person residing within her body. After another moment the muscles open up beneath you and you fall into a fleshy sack filled with the mushy remains of chips and cookies. You are inside Molly's stomach. Molly is a nice and friendly little girl, but as you are just finding out, her stomach does not seem so nice and friendly. It smells bad, there is mushy stuff everywhere, and you get a very bad feeling that maybe, in all of your excitement, you may have made a big mistake. You now know what it is like to be inside a tummy, and while being swallowed was fun, you don't think this is going to be fun. Perhaps you should have listened to Molly. Her tummy is for food, and now, you are just food.<br>\r\n<br>\r\n\"I WANT OUT!\" You yell as loudly as you can. You are not sure Molly can hear you or not though.</span></div></div>",
            "created":1469163600,
            "id":2184398,
            "title":"Yes, since you really want me to."
        },
        "1511211221112":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "You wake up, it was just a dream!",
                "Continue the story as Molly, who shrinks when she goes back to school."
            ],
            "content":"<div class=\"\"><div> <span>(Molly's POV)<br>\r\n<i>Gulp!</i><br>\r\n<br>\r\nMolly tilts her head back and swallows, feeling the lump that is her tiny friend slide down her throat and disappear into her body. He tasted magnificent. The best snack she had ever had in her short life! Her heart was racing with excitement, she had a tiny person living inside her. She dashed to her bed, stripping off her shirt as she ran, and laid down on her back, rubbing her cute, flat little tummy happily. She wondered what it was like inside her belly right now? Was it warm and cozy and soft? She was sure her friend was happy and safe within her gut. He wasn't even calling out to be let out, so perhaps he wanted to stay, and maybe he even was so cozy he fell asleep. She continued to absent mindedly rub her tummy as her mind raced with wonderment of what her friend was going to tell her when he came out of her tummy. She closed her eyes, and drifted off to sleep, dreaming about being inside her tummy with you, cuddled up and giggling and sharing a plate of cookies.<br>\r\n<br>\r\n(Your POV)<br>\r\n<br>\r\nMolly's stomach was the place of nightmares. You try wading through the thick, viscous mush of her previous snacks to bang on her stomach walls, trying anything you can to let her know that you are not happy. Suddenly you feel a shift as the area you are standing moves, your center of gravity is thrown off and you tumble around. When you catch your bearings, you realize Molly has laid down! She must be letting you escape! You trudge towards where you entered her stomach, but the opening is sealed shut. You try to pry open the sphincter to get back into her throat, but the muscles are too strong. You hear some gurgling around you, and some liquid begins to slowly drip into her stomach, and the walls begin to contract. You have no idea what Molly is doing, but her are frightened out of your mind, why is this benevolent little girl's tummy treating you like this? Some of the liquid splashes upon you, and you feel a tingling burn on your bare skin. You yell out again in pain, tears welling up in your eyes as you begin to realize that you will not be making out of cute little Molly's tummy. Her tummy is for food, you are nothing more than a small morsel for her body. The liquid begins pouring in faster, and the walls begin moving more rapidly, and you are tossed about, slamming into the fleshy walls, liquid begining to coat your entire body. The mush you were in is being broken apart and is melted into a liquid, and you know that thus is what is going to happen to you. You burn all over, you are being squeezed by the contracting walls of her stomach, and soon the pain is too much and you black out. <br>\r\n<br>\r\nMolly sleeps peacefully as her stomach digests all the snacks she ate earlier, including you. Her tummy doesn't know the difference, food is food. Her body happily absorbs the nutrients from you and she wakes up fully refreshed. After a little while of not being able to contact you, she asks her mother about what happens to food inside her tummy. When her mom explains it to her, she runs into her room and cries, realizing she had killed her new little friend. </span></div></div>",
            "created":1469163600,
            "id":2184607,
            "title":"The fate of food."
        },
        "1511211222":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "bath time",
                "watching a movie"
            ],
            "content":"<div class=\"\"><div> <span>You can't hide it and lower your head as she was hugging you. \"I am sorry, but everything is so big now and scary.\" You said as your eyes start to water up as the tears stroll down your face. \"I don't mean to be, or want to be.\" You say as she stares at you and nods her head lightly, trying to understand. A hard thing to do for she never had to worry about everything being a threat to end her life before. \"I'll calm down.\" You say as you sigh deeply and take a deep breath.<br>\r\n<br>\r\n\"I promise to never hurt you or do anything to scare you.\" She told you making you look up at her and smile softly, for those words meant a lot to you now. \"I'll protect you and all ways make sure your safe.\" She smiled and lowered you back down between her legs. You look up at her then at the plate and climb back up on it so that you can get to the food that she got for you. You sat there eating with her looking up at her and smiling, though you was scared she seemed to make you feel safe and that was very important to you at this moment. To be able to feel safe.<br>\r\n<br>\r\n\"Can I always stay with you? I mean like on the bed when you sleep, or somewhere with you if you are going out?\" You ask timidly as you are looking up at her. \"I don't want to be left alone sorry.\" You tell her your reason for the questions and she only giggled and nodded her head.<br>\r\n<br>\r\n\"Of course you can, I promised to protect you and I will. You are my secret baby now.\" She playfully giggled making you blush and start laughing as well with her.</span></div></div>",
            "created":1328245200,
            "id":1270336,
            "title":"You cant hide your fear"
        },
        "15112112221":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "She then lies down on her bed still nude & shows you where she's ticklish",
                "She lies down nude on her bed and asks you to message her stomach "
            ],
            "content":"<div class=\"\"><div> <span>As the two of you are enjoying each others company a voice rings out \"Molly, Your bath's ready!\" She giggles before saying \"Okay Mom!\" She then looks down at you brings her palm toward you and says, \"C'mon little guy time for us to get clean.\"<br>\r\n<br>\r\nAfter you &amp; Molly got in the tub she cleaned you up first as she's just soaking in the tub with you and a few of her toys you decide to ask her something \"Hey, Molly?\" \"What is it?\" \"Are you ticklish?\" you ask curious, \"Yes I am I can show you where when we get out of the tub, okay?\" A few minutes later Molly's mom comes and drains the tub, after that Molly wraps up in a towel and goes back to her room.      </span></div></div>",
            "created":1405227600,
            "id":1826755,
            "title":"bath time"
        },
        "151121122211":{
            "author_id":"flamelord",
            "author_name":"Flame",
            "choices":[
                "Privates ",
                "Chest/other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Once you were back in her room she walked over to her bed and laid down. She let you out of the town and you saw she was still nude. \"Here, I'll show you where I'm ticklish.\" She said laying down. She brought her hand toward her…</span></div></span></div>",
            "created":1493442000,
            "id":2312691,
            "title":"She then lies down on her bed still nude & show..."
        },
        "1511211222111":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "Up her vagina",
                "In her mouth"
            ],
            "content":"<div class=\"\"><div> <span>Molly lowers you down between her legs and places you right next to her young girlhood. \"This is where I am most ticklish. Mommy says its my special area and I'm not supposed to show it to anyone, but you are my tiny friend, so it will be ok.\"<br>\r\n<br>\r\nBefore you is a massive slit between little Molly's legs. You have never seen anything like it before. You move in closer to explore her and maybe tickle her a little bit, but there is a sudden noise at the door to Molly's room.<br>\r\n<br>\r\n\"Molly, it's time for bed sweetie!\" Her mom calls out as she turns the doorknob and prepares to enter the room. Molly, who is lying on her bed naked, panics. She grabs you and tries to hide you by shoving you...</span></div></div>",
            "created":1493701200,
            "id":2313876,
            "title":"Privates "
        },
        "15112112221111":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "You are pulled completely in",
                "You are expelled out and risk discovery"
            ],
            "content":"<div class=\"\"><div> <span>Before you can react you are shoved from behind and pushed towards Molly's vaginal lips. You are pressed against them and then pushed between them. Your head slides into a small, warm and moist fleshy tunnel and the rest of your body soon follows. Your body is squeezed by her vaginal muscles and you are pulled completely inside her.<br>\r\n<br>\r\nMeanwhile, Molly's mom has entered the room and sees her 5 year old daughter naked on the bed with her hand up her crotch. Molly is trying to maintain an innocent look on her face, but she has never experienced a feeling like she is right now. Your body is stimulating nerves in her and giving her sensations she has never experienced before. <br>\r\n<br>\r\nInside her you too are experiencing new sensations. Fleshy muscles are constricting upon your body and you are being coated in Molly's bodily fluids. Her muscles continue to pull you in, deeper and deeper into Molly. You are completely at the mercy of Molly's vagina. What happens?</span></div></div>",
            "created":1493701200,
            "id":2313887,
            "title":"Up her vagina"
        },
        "151121122211111":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Decide to explore one of the tunnels at the far end.",
                "Decide to try and open the tunnel that led you into her womb.",
                "Decide to take a nap on her flesh. You were tuckered out.",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You thought that the pulling would stop as soon as you hit what seemed to be a blockade in the warm fleshy tunnel. But then it open up, and you are pushed through, and land with a plop into a much roomier space. Everything was pink. and you could see two other tunnels in this space farther down, but they looked very far, and after what you just went through, you weren't sure you had the stamina to trek further. And you did wonder if you should crawl back out soon. It was Molly's special area, and you just invaded.<br>\r\n<br>\r\nMeanwhile, outside the chamber you were in, Molly's mom just chuckled, thinking her daughter was trying to hide her girlhood from a stranger, which was normal, but her mom had seen her naked before, so she said, \"Molly, It's not like I haven't seen you naked before honey, now come on, let's get you in your jammies.<br>\r\n<br>\r\nMolly takes her hand out of her girlhood, and wips whatever fluids got on it on the far side of the bed. There wasn't much, since she was really young, but she still made sure her mom didn't see while she was getting Molly's pajamas.<br>\r\n<br>\r\nShe could feel you moving around in her lower tummy as she walked to her mother to get ready.<br>\r\n<br>\r\nMeanwhile, in her womb, you.........</span></div></div>",
            "created":1529871000,
            "id":2511475,
            "title":"You are pulled completely in"
        },
        "15112112221112":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "Spits you into her mother's hand and risks getting in trouble",
                "Swallows you to keep from getting in trouble"
            ],
            "content":"<div class=\"\"><div> <span>Before you even get a chance to react Molly's hand closes around you and with a rush she pulls you towards her face. You nust catch your bearings as you see her open maw growing closer before you. <br>\r\n\"Molly, wait!\" You yell, but you are quickly plunged into a warm, humid and dark prison, she has tossed you into her mouth and shut it. You are resting on her tongue as you try to gather yourself.<br>\r\n<br>\r\nMeanwhile, Molly's mother has entered the room and Molly sits straight up and smiles are her mom. Her mom sees her naked daughter sitting on the bed and chuckles. \"Molly, you silly girl, what arr you doing sitting here naked? Put your bed clothes on and get ready for bed!\" <br>\r\n<br>\r\nMolly nods in response, and goes to turn away, but her mom notices that something up. <br>\r\n<br>\r\n\"Do you have something in your mouth, sweetie?\"<br>\r\n<br>\r\nMolly shakes her head vigorously. Inside her mouth you are thrown side to side, bouncing off of her cheeks and eventually you slide down underneath her tongue. Saliva covers your entire body, making you feel very uncomfortable. The heavy muscle of her tongue rests above you, and you are terrified of what is going to happen next. Molly said she would protect you...but how exactly does she plan on doing that?<br>\r\n<br>\r\n\"Molly, don't lie to your mother!\" Her mother walks over to her and holds out her hand. \"Open your mouth and spit it out. Let me see what you've gotten into young lady!\"<br>\r\n<br>\r\nWhat does Molly do?</span></div></div>",
            "created":1493701200,
            "id":2313877,
            "title":"In her mouth"
        },
        "151121122211122":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "Molly falls asleep and you digest",
                "Molly pretends to sleep until her mom leaves and tries to save you."
            ],
            "content":"<div class=\"\"><div> <span>Molly looks at her mother defiantly and tilts her head back and swallows. She then opens her mouth widely for her mother to see that it is empty. \"See momma, my mouth is empty.\"<br>\r\n<br>\r\nHer mother shakes her head, \"Well, whatever it was is now in your tummy, theres no getting it back now. Put your bed clothes on and ill read you a story and you can get some sleep.\"<br>\r\n<br>\r\n(Your POV)<br>\r\nMolly's tongue curls up from above you and slides down underneath you and lifts you up to the roof of her mouth. Your eyes have adjusted to the darkness and can see somewhat, and you look ahead as you begin sliding down her tongue. You see her uvula and throat before you, and you are moving toward them, Molly was going to eat you, even though she said she would not earlier. Apparently she would rather break her promise than get in trouble.<br>\r\n<br>\r\n\"Please, don't eat me!\" You protest as you throw your arms out and attempt to slow your progress, but your efforts are futile. She tilts her head back and her tongue raises up completely and you slide into her throat. You attempt to grab her uvula but her esophagus muscles grab onto you and pull you downwards. You are completely surrounded by squeezing muscles as you begin your descent into Molly. You can here sound and Molly talking, her voice resonating from all around you. After a few seconds you are released from the muscles and slide into a large chamber filled with vile smelling liquid and mashed up cookies and chips. It is very hot inside Molly's stomach, and you sit and begin crying, how could she betray you this way? She was your friend and she ate you...and now you were stuck in her tummy, just like a piece of food.<br>\r\n<br>\r\nWhat is your fate?</span></div></div>",
            "created":1493701200,
            "id":2313883,
            "title":"Swallows you to keep from getting in trouble"
        },
        "1511211222111221":{
            "choices":[
                "Molly hears your screaming. Can she save you?",
                "Molly falls asleep as you truly become food for her"
            ],
            "content":"<div class=\"\"><div> <span>Molly's mother finishes up the bedtime story and kisses her daughter goodnight. The little girl stretches out laying on her back, her eyes shut, falling asleep. As Molly's mother leaves the bedroom, Molly's stomach makes a loud gurgling noise, preparing to melt down those snacks currently filling up her belly. That includes you!<br>\r\n<br>\r\nThe loud gurgle shakes up as you try to wade through the bubbly chewed-up sludge, but your tiny body just isn't strong enough. You sit down again and cry even harder. Is this where you'll be forever? Stuck in a girl's stomach? You can't even make it to the walls to get her attention. How are you going to live in here? It's hot and smelly and terrifyingly loud! How could such a sweet girl hide this nightmarish cave inside of her body?<br>\r\n<br>\r\nIn the darkness of her bedroom, Molly put a hand on her noisy tummy and started giggling. She forgot all about that little incident from before, just picturing the chips and cookies she had eaten before sitting happily in her stomach. Likewise, she also had no clue where you had gone, but she figured you wouldn't just leave her, and would be around in the morning.<br>\r\n<br>\r\nYour worries about being able to handle a humid gas chamber as a permanent living space were quickly replaced with a much greater fear. At school you haven't really been taught the inner workings of a stomach yet, and so when Molly's starts emitting several deep rumblings, and you are curious enough about this strange new liquid secreting in to join you that you reach out and touch some, culminating in excruciating pain to your hand and a piercing shriek, you discover something new, looking out over a relative sea of bubbling mush...food doesn't just magically turn into nutrients by choice...it's melted into nothing.<br>\r\n<br>\r\nAnyone who might have chosen Molly's belly as a pillow right now would have some interesting questions for her. \"Why is your food screaming?\" perhaps.<br>\r\n<br>\r\nMolly is finding the whole soundscape pretty relaxing though, happily drifting off to the strange noises emanating from her soft flat tum-tum. As if your situation couldn't get any worse, all this active digestion made Molly burp, quite loudly for a little girl, causing her stomach to rapidly contract, mingling your body way too closely with the pools of acid.</span></div></div>",
            "created":1502686800,
            "id":2369305,
            "title":"Sleepytime Digestion"
        },
        "15112112221112211":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Molly's mom knows she's faking and grounds her.",
                "Molly's mom falls for it and has Molly stay home for a few days."
            ],
            "content":"<div class=\"\"><div> <span>Molly woke with a start as the sound of your screaming reaches her ears, \"Don't worry little friend I'll get you out of my stomach!\" \"Wait how are you going to do that?\" You ask not that Molly can hear you at this point, however you get your answer very quickly as all the food in Molly's stomach along with you is suddenly shot upward and out of Molly's body into a trash can. <br>\r\n<br>\r\nMolly grabs a rag to get you out of the trash and clean you up, afterwards you and her are sitting on her bed together talking to each other. \"I'm so sorry that I ate you like that!\" You smile at her saying \"Don't worry about it Molly! You had to do it otherwise you would have been in trouble with your mom. I understand.\" Molly smiled and picked you up rubbing you against her cheek as she does so. <br>\r\n<br>\r\nMolly then says \"Thank you little guy! I'd love to keep playing with you but I should probably get to bed now. I do have school tomorrow after all.\" At this you get an idea \"I know how we can spend more time together!\" <br>\r\n<br>\r\nMolly raises an eyebrow at that \"Really how?\" \"Well we could fool your mom into thinking that you are sick so you can stay home. What do you think Molly?\" Molly nods her head at the idea saying \"I think that might work especially sense I already puked in the trash.\"<br>\r\n<br>\r\nYou nod at this saying \"okay then. Good night Molly.\" With that you get comfortable with Molly in her bed and fall asleep.<br>\r\n<br>\r\nThe next morning Molly's mom comes into the room and sees the trash can. Does the plan work?</span></div></div>",
            "created":1502773200,
            "id":2369631,
            "title":"Saved by your friend "
        },
        "15112112221112212":{
            "author_id":"db297",
            "author_name":"dragonboy",
            "choices":[
                "It was a nightmare, you had fallen asleep after the bath!"
            ],
            "content":"<div class=\"\"><div> <span>Molly is completely asleep, giggling and dreaming about the fun games she could play with you, her new friend. Unfortunately, you would no longer be around to play any more games. Her stomach gurgles as she sleeps, fully digesting all of its contents. Inside her stomach, acid engulfs your body and you cry out for anything that might save you, but there is no saving you from the fate this cute little girl's tummy has in store for you. Your body is broken down into a pool of nutrients, which is flushed into Molly's intestines and absorbed to fuel her growing body. Molly continues to sleep peacefully with a cute smile upon her face as she gently rubs her flat little belly, happy to be getting energy from you and her delicious snacks as she sleeps.</span></div></div>",
            "created":1504155600,
            "id":2377688,
            "title":"Molly falls asleep as you truly become food for..."
        },
        "1511211222112":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Her chest  ",
                "Her belly/ belly button ",
                "Her feet/other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Molly put her hand?</span></div></span></div>",
            "created":1493442000,
            "id":2312698,
            "title":"Chest/other "
        },
        "15112112221122":{
            "author_id":"tailziscool123",
            "author_name":"foxhound",
            "choices":[
                "Molly's mom came in to investigate all the noise!",
                "While you were tickling her Molly ended up wetting the bed!"
            ],
            "content":"<div class=\"\"><div> <span>Molly lets out a giggle as she puts you on her belly, right before her deep innie belly button. \"This is where I'm ticklish.\" She says as she points to the area your standing on, \"Okay then. What do you want me to do? Just get right to it and start tickling your belly button?\" You ask as Molly nods her head excitedly, \"Yes please!!\" She said a wide grin on her face. With that you get right to work and start tickling her, this turns her into a giggling mess. \"HAHAHAYESS! KEEP GOING HAHAHA!\" You keep the tickling going for about ten minutes before deciding to give her a break.<br>\r\n<br>\r\n\"Thank you that was very fun!\" Molly gasps out as you and her share a smile, \"Your welcome Molly.\" You say back to her in all your enjoyment however you fail to notice that..     </span></div></div>",
            "created":1502773200,
            "id":2369683,
            "title":"Her belly/ belly button "
        },
        "15112112222":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "wake up while she is sleeping",
                "wake up when she wakes up"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom is going to be putting a movie on for me then it nap time. So let me get changed for bed and we go watch it together okay my secret baby.\" She giggled and placed you in her hand before standing up and walking towards her bed and placed you down on the night stand next to her bed that had hello kitty bed spreads on it with a few dolls of hello kitty. \"Be have baby and mommy be ready quick.\" She teased and giggled. She started to pull her clothes off until she was wearing  only her underwear and started to walk around in just that. You watched her before looking down at your clothes and wonder what you was going to do for these where all you had. And they where dirty from being in that other boy's underwear as well as running in from him.<br>\r\n<br>\r\n\"Um, my clothes all dirty. Do you have anything I can wear or only girl clothes? So do I need to share them with mommy?\" You asked and thought that you didn't want to be in icky girly clothes but you did have nothing else. She walked over and stared down at you while holding her nightie. It was just long enough to cover her underwear and some of her thighs when she is stood but not when she sits.<br>\r\n<br>\r\n\"I have no boy clothes and nothing in your size unless you want barbie clothes?\" She stated as you stared at her underwear that was a soft baby blue with hello kitty on it and a cute little pink bow. \"So if you want clean clothes you have to share with me. But you no give mommy boy koodies okay.\" She stated and watched you look up at her as she smiled and then back down at her underwear before taking your dirty clothes off. In your mind you was hoping not to get girl koodies of her but you was guessing being in the clothes of a nice girl would be better then in the clothes of that mean boy. Once she saw that all your clothes where off she bent her knees so that the waist band of her underwear was at the height of the end table. \"Be a good baby.\" She teased as she pulled her underwear open and watched you jump in before closing them again and felt you slide along her skin tickling her making her giggle until you came to a stop at the bump in the front of her underwear under her young body. She then went about putting her nighty on. It was a soft pink with a sleeping hello kitty on it and the words night night.<br>\r\n<br>\r\nShe went to the living room and sat down on the couch and watched her mom put the movie Wreck it Ralph on and leave her daughter to watch it.  When she sat down you where still and waited until you heard her mom leave before wigging out of one of the leg holes in her underwear. Climbing up the outside of her underwear you sat on the face of the kitty on them and stared at the screen. \"can you see okay?\" She whispered and you called back sawing you could. When inside her underwear you notice she didn't have a hanging body part like you did but something else and you didn't understand why. Putting that thought aside you watched the movie with her and was getting tired yourself. Wiggling back in her underwear before the movie even ended you fell asleep there.<br>\r\n<br>\r\nHer mother came into the room and found her daughter had fell asleep watching the movie and picked her up and placed her in her bed and tucked her in not knowing there was a tiny boy in her little six year old girl's underwear.</span></div></div>",
            "created":1389675600,
            "id":1727325,
            "title":"watching a movie"
        },
        "151121122221":{
            "author_id":"rosedragon",
            "author_name":"dragon",
            "choices":[
                "she wakes up from what he has done and trys to get him out",
                "she sleeps through it and wakes up later feeling him resting in her."
            ],
            "content":"<div class=\"\"><div> <span>Waking up while she is sleeping you yawned and opened your eyes to only be staring down at the part of her that you notice before. The part that was different to yours. You was very curious about it and wanted to see more and explore it. Noticing that there was no movement and the gentle sound of her breathing meant she was still asleep and not wishing to wake her up you moved closer towards her young body. \"I am tiny and this is what a girl has. I want to explore it.\" You told yourself as you now was up against it with your whole body and started to touch it with your hands moving it and sliding your arms and legs into it. \"It is like a tunnel, and it gets wet if I rub it, wonder where it goes.\" You mumble to yourself before trying to wiggle your body fully inside her making her pant and blush as you was crawling and wiggling deeper and deeper into her until you had to squeeze into a small chamber. \"It so dark and warm.\" You stated as you used so much energy getting there and fell asleep again now inside her.</span></div></div>",
            "created":1394341200,
            "id":1757790,
            "title":"wake up while she is sleeping"
        },
        "1512":{
            "author_id":"derpatron",
            "author_name":"Derpus",
            "choices":[
                "He takes him out to play during recess.",
                "He shows Andy to his friends during lunch.",
                "Steven forgets about him until he gets home."
            ],
            "content":"<div class=\"\"><div> <span>Andy panicked as he saw himself be moved closer to the giant bully's pocket. He opened his mouth to scream, but his mouth was immediately covered by Steven's grubby fingers. All Andy could do was watch as Steven shoved him into his pocket. The bully's pants were a little tight on him, so Andy was pressed on both sides by the thick denim. This was bad.<br>\r\n<br>\r\nSteven was the biggest bully in the first grade, and Andy was his favorite victim. More than once he was sent to the nurses office as a result of Steven beating him up. He was smart, too, making sure to get Andy where no one could see him get pounded until he cried. And figured that it wasn't by chance that Steven found him. He knew that as soon as he got the chance, the bully would do all kinds of horrible things to poor little Andy.<br>\r\n<br>\r\nKnowing what awaited him, Andy struggled with all his might to get out of his captor's pocket. Alas, his small size made him extremely weak, and the tight denim fabric held him in place. He wasn't even able to get Steven to notice him. Andy started to cry. He knew that there was no way out of here unless Steven picked him out, and he wasn't sure that he wanted that.<br>\r\n<br>\r\nSo when will Andy be taken out?</span></div></div>",
            "created":1382850000,
            "id":1684719,
            "title":"Captured by the bully."
        }
    },
    "info":{
        "author_id":"musstika",
        "author_name":"Jester",
        "brief_description":"A Firstgrader suddenly shink during the break between the 1st. and 2.nd lesson.",
        "created":1149537900,
        "description":"<td align=\"left\" class=\"norm\">Andy is a normal Firstgrader who is 6 Year old.All is normal, untill the break between the First and Second Lesson.During he going to the Toilet he suddenly Shink down to 2 inch.<br>\r\n<br>\r\nALL IS ALLOWED ! <br>\r\n<br>\r\nONLY RULZ ARE....<br>\r\n<br>\r\n-NO GIGANTS IN ANY FROM <br>\r\n <br>\r\n-LET THE MAIN PERSON STAY ALIVE !!!<br>\r\n<br>\r\nYou are free to add Persons but please try not do continue the Story too far from the Main place.(Means School or Home of one of the schoolmate or Andy´s home).<br>\r\n<br>\r\nSo welcome and please add....!!<br>\r\n<br>\r\nLittle Update: 29/09/07<br>\r\n<br>\r\nNice to see that the Story is still alive.A little Wish by me: Please try to add more than 3 Sentence per Chapter.It´s not a Rule at moment but it´s parting the Story so much that some loose the interestes.<br>\r\n<br>\r\nTHANKS !!<br>\r\n<br>\r\nOnly 1350 Views,who look please add some stuff to keep the Story alive.<br>\r\n<br>\r\nGreez Jester</td>",
        "id":1115361,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591765500,
        "modified":1591765500,
        "pretty_title":"Elementary Shrink"
    }
}