{
    "chapters":{
        "1":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "She droped you some place in tokyo (Mall, Girls high school, or a womans home)",
                "Your in a Anime ",
                "Your in a video game",
                "Your in a world full of antro girls",
                "Other (readers choice)"
            ],
            "content":"<div class=\"\"><div> <span>You wake after the kiss and you feel wrong the frist thing you notice is she truned you in to a girl. You had long blond hair and blue eyes to begain with but now you had a gorges female body sporting a pair of large DD cup breasts. <br>\r\n<br>\r\nYour also shrunk but where are you at?</span></div></div>",
            "created":1290056400,
            "id":996022,
            "title":"Hungover and unhung."
        },
        "11":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Mall",
                "Woman House",
                "Girls School",
                "Womens Bath House",
                "Shrine"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in Tokyo?</span></div></span></div>",
            "created":1290087240,
            "id":996039,
            "title":"She droped you some place in tokyo (Mall, Girls..."
        },
        "112":{
            "author_id":"waterwitch778",
            "author_name":"waterwitch778",
            "choices":[
                "let her",
                "shove her away"
            ],
            "content":"<div class=\"\"><div> <span>you realising you are lying on a bed in the middle of a womans bedroonm.<br>\r\n\"Your finally awake!\"<br>\r\nyou look over to where the voice came from and there is the woman you tried to pick up.<br>\r\n\"Now that your in this form, you are so much motre my type!\" she purred settling down on the bed. She runs her finger down your bare thigh. She pushes you down on the bed.</span></div></div>",
            "created":1317155640,
            "id":1196179,
            "title":"Woman House"
        },
        "1121":{
            "author_id":"rrobbie37",
            "author_name":"Lord Robbie - We got this!",
            "choices":[
                "strip dance for her",
                "attack her",
                "try to negotiate"
            ],
            "content":"<div class=\"\"><div> <span>All you can think about is how beautiful she is. She begins to remove your clothes. She teases you as she removes your blouse. \"My, my, aren't we endowed?\" she observes, staring at your very large chest. You aren't sure what to reply. She peels off your bra, exposing your new, firm melons. She grins at you, taking one in her mouth. You stiffened before moaning wildly, feeling yourself begin to drip considerably. She uses her free hand to explore first inside your skirt, then your thong. \"OH! YEAH!\" you moan, the feelings are overwhelming.<br>\r\n<br>\r\nHer fingers gently caress your button, making you buck as she explores you. As you feel yourself getting closer, she stops. \"Wh-What? Why are you stopping?\" you cry. \"Strip for me!\" she commands. \"Wh-What?\" you stammer, confused again. She sighs. “My name is Helen! Helen Dominique O’Reilly! And I want you to strip for me!” she orders you (<a rel=\"nofollow\" href=\"http://gameofthrones.wikia.com/wiki/Roxanne_McKee?file=Roxanne-McKee-200.jpg\" target=\"_blank\">http://gameofthrones.wikia.com/wiki/Roxa...</a>). <br>\r\n<br>\r\nYou stare at her, stunned. But the little brown haired girl demands it. “I…I’m nervous!” you stutter. “Do it, you little cow! I made you look like Georgia King and that’s not a good thing to be in Tokyo with no ID (<a rel=\"nofollow\" href=\"http://merlin.wikia.com/wiki/Elena\" target=\"_blank\">http://merlin.wikia.com/wiki/Elena</a>). In fact your transformation was based on a girl I was crushing on. Now I have you! Now get on with it or enjoying a far more salacious career, you loser!” she roars, threateningly. <br>\r\n<br>\r\n“Why are you doing this?” you squeal. “Because you look like a girl I like or weren’t you listening, you drunken pity case? Now let’s see your bottom lip and those hot cheeks! Or else, enjoy your new life in Tokyo!” she warns you. You notice that your blouse and bra are gone. A topless blonde bombshell alone in Tokyo is in real trouble. You know you have to do something, but you’re not sure. You rise to your feet, your hands on the sides of your skirt. You decide to…<br>\r\n</span></div></div>",
            "created":1403356560,
            "id":1815400,
            "title":"let her"
        },
        "12":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Outlaw Star",
                "Cowboy Bebop",
                "Gundam (catch all for any gundam show)",
                "Sailor Moon",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Witch one?</span></div></span></div>",
            "created":1290086160,
            "id":996029,
            "title":"Your in a Anime "
        },
        "123":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Gundam (origle time line U.C.)",
                "Gundam Seed ",
                "Other Gundam"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Witch gundam show?</span></div></span></div>",
            "created":1290088800,
            "id":996045,
            "title":"Gundam (catch all for any gundam show)"
        },
        "124":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Sailor Moon (Sarena)",
                "Sailor Jupiter (Lita)",
                "Other scout"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You find your self on the night stand next to the bed of one of Sailor Scouts.<br>\r\n<br>\r\nWitch one?</span></div></span></div>",
            "created":1290088380,
            "id":996043,
            "title":"Sailor Moon"
        },
        "125":{
            "author_id":"solky",
            "author_name":"Sol the Iceedge",
            "choices":[
                "Digimon",
                "Pokemon",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these...?</span></div></span></div>",
            "created":1316471280,
            "id":1190416,
            "title":"Other ?"
        },
        "1253":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Madoka Magika",
                "Negima",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More Anime!!!</span></div></span></div>",
            "created":1331507520,
            "id":1292926,
            "title":"More"
        },
        "13":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "DoAX2",
                "Soul Calibur 4",
                "Final Fantasy (Any)",
                "Warriors Orochi 2",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Witch game?</span></div></span></div>",
            "created":1290086820,
            "id":996033,
            "title":"Your in a video game"
        },
        "14":{
            "author_id":"dragonjaj",
            "author_name":"Ace",
            "choices":[
                "Woods",
                "Mountains",
                "Desert",
                "Beach",
                "Pokemorph World"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in the Antro world?</span></div></span></div>",
            "created":1290087000,
            "id":996036,
            "title":"Your in a world full of antro girls"
        },
        "145":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Op1.",
                "Op2.",
                "Op3."
            ],
            "content":"<div class=\"\"><div> <span> You woke up in what looked like a forest.The grass was taller than you and the trees reached the sky.You walked for a little while untill you came to a road.You had no idea where you where but then you heard a noice and looked down the path.You saw a sexy girl with purple hair and a tail like a Arbok.She was beautiful.It was then that you realized you must have been in a strange pokemon anthro world.<br>\r\n<br>\r\nThe girl was coming closer and you had to decided wheather you would talk to her or not.Finally you decided to.....<br>\r\n<br>\r\nOp1:You talked to the Arbok girl and she thinks you're cute as a bug.She decided to take you home and make you her slave and pet.<br>\r\n<br>\r\nOp2:You run into a bush and meet a nice young weedle girl,with the upper body of a humen and the lower body of a weedle.<br>\r\n<br>\r\nOp3:Without warning a Muk/Slime girl attacks you and absorbs you.She takes you home to her home in the city and made you a gift to her sexy grimmer daughter.</span></div></div>",
            "created":1323740880,
            "id":1238836,
            "title":"Pokemorph World"
        },
        "1451":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "choices":[
                "I accept the Test!",
                "I've actually got a meeting so. . ."
            ],
            "content":"<div class=\"\"><div> <span>As you couldn't help but stare at the sexy giantess Arbok would already be at your feet, or rather you at hers. She bent over forward, that large purple shaded lovely face loomed above you with a curious face yet a hint of deviousness still present. Her head tilted a tad as those big green eyes looked over your tiny body, °Looksss like your a bit lost~?°<br>\r\n<br>\r\nNot only did her voice sound seductive, but the look on her face did as well. \"Y-Yeah, actually. Maybe y-you could help me?\" That long tongue slithered out of her mouth to taste the air before quickly returning. °Maybe. . . Though I'll need to test you, of course~.°<br>\r\n<br>\r\n\"Test?\" You asked blatantly, though who wouldn't. Jesse didn't really know what to think. But of course, your confusion only added to her lustul intentions. °Yes, but you'll need to come with me firsssst~.\" A soft, and slick purple hand lowered itself before you now was your chance to escape, or stay. . .</span></div></div>",
            "created":1447817940,
            "id":2063638,
            "title":"Op1."
        },
        "14511":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "choices":[
                "I guess?",
                "I think I'm alright. . ."
            ],
            "content":"<div class=\"\"><div> <span>You showed a bright smile up to her, essentially displaying your innocence before climbing to the center of her soft purple palm. The Arbok giggled in a devious little way before she rose you right up to her face, that forked tongue snaked its way out before giving a niiiiice long lick right over you entire tiny body. You cringe at the feeling before she licked her lips at the quite sweet taste your body held.<br>\r\n<br>\r\n°I'm sorry to delay your trip, but I wondered if you. . . Wanted to explore? All your choice of course~.° You look up to her, the tone in her voice and facial expression quickly set you off, maybe this wasn't the best idea. . .</span></div></div>",
            "created":1447886160,
            "id":2063855,
            "title":"I accept the Test!"
        },
        "145111":{
            "author_id":"cerfew",
            "author_name":"cxrf3w",
            "content":"<div class=\"\"><div> <span>°Try not to go too deep~.° Were the last words you heard before she made quick movements, her hand closed into a fist with your top half still exposed, and nude. You felt movement as you were slowly brought lower and lower until you came face to face with a gorgeous, yet humongous purple slit. °And have fun~!°<br>\r\n<br>\r\nWith quite a bit of force your top half was shoved into her nether lips; the moist heat hit you instantly, as well as the musty liquids that resigned in there. She let go of you the moment you were lodged in only to push at your feet with a single finger, slipping you completely inside. You plopped down inside a shallow bed of juices, crashing against her soft vaginal walls. With a face full of blush you slowly stand to your feet, \"What the he--!\" And in that moment everything around you suddenly contracted tight, like her pussy hugged you from the inside as those walls pressed hard against your body. You felt your body being drawn in, just as a throat would her insides slowly pulled your tiny form in deeper and deeper. By now, you were coated with the musty juices inside.<br>\r\n<br>\r\nWhat felt like hours going by you'd eventually find yourself at an end, or so you thought. . . It seemed as if the beautiful woman had brought you to some small space within her, like a little pot that awaited its next meal eagerly. °You went a little too far~,° from the outside you heard her muffled voice. . . You instantly banged against one of those fleshy walls and screamed in attempt for her attention. \"H-Hey, let me out, please!\" It wasn't evident if she could hear you, though after one or two bangs against her insides everything compressed. Tightly squeezing your body in a way you'd never imagination, just then, those musty juices returned, with ease they flooded in from the purple walls. Everything about these juices seemed more intense than before, heat and smell wise. °Now you're all mine~.°<br>\r\n<br>\r\nWith those last words, the odd liquids poured in enough to fill the entire thing. You and your body quickly felt a tingle, and a sting here and there. The walls released their tension and you simply floated there, without air or any clear hope in sight you begin to lose conciseness, drifting off into sleep. Moments after you did those juices started working on your body, and in no time you were turned into nothing more than added fem-cum to her already plentiful supply. What a shame.</span></div></div>",
            "created":1447887120,
            "id":2063858,
            "title":"I guess?"
        },
        "15":{
            "author_id":"topbeehler",
            "author_name":"TopBeehler",
            "choices":[
                "Felarya",
                "In Vegas",
                "In a kitchen",
                "All girl school",
                "I don't know...But it's soft and warm."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices...</span></div></span></div>",
            "created":1331507160,
            "id":1292920,
            "title":"Others"
        }
    },
    "info":{
        "author_id":"dragonjaj",
        "author_name":"Ace",
        "brief_description":"Your a average guy named Jesse till one day you cross a witch and she hexes you.",
        "created":1290084960,
        "description":"<td align=\"left\" class=\"norm\">Your Jesse (no changing the name) your a average guy in your 20s and you life hit rock bottom unemployed, single and cant catch a brake. This put you in a bad mod so you try to pick up a girl at a bar. She turns you done but keep trying then she kiss you and you pass out hearing her voice say. \"That will teach him!\" <br>\r\n<br>\r\nrules<br>\r\n<br>\r\n1 No guys!!!! Repet no guys Gaintess only!!!!!!!!!<br>\r\n2 No hard vore.<br>\r\n3 if using game or anime girls keep them true to themselves<br>\r\n4 No caleb's (course i don't know any one other then madonna and marilyn monrow)<br>\r\n5 No putting in random people for no reason.<br>\r\n<br>\r\nChapters that brake the rules will be edited or removed.</td>",
        "id":1725478,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1447887120,
        "modified":1447887120,
        "pretty_title":"Witch hexed"
    }
}