{
    "chapters":{
        "1":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "Episode 1: The First Years."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Episode?</span></div></span></div>",
            "created":1578200400,
            "id":2769702,
            "title":"Menu"
        },
        "11":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The soul book sat there on your desk, it looked old, its pages brown and grey, as if it had been dabbed by a used teabag, fresh out of a brewed cup. The leather itself was worn and hard to the touch, brushed your hand softly against it, the boo not returning your kind handling. The rough exterior mirroring the contents. <br>\r\n<br>\r\nYou picked it up, noticing its weight immediately. Using your spared hand to turn the cover, revealing a blank page, discolored like the rest. rubbing the pages against one another you turned them, finding the same on each flicker. <br>\r\n<br>\r\n'What is up with it today' you whispered to yourself, aggravated. The book seemed to have a mind of its own. On some days it would greet you warmly, allowing you to peruse its pages and encountering no issue, yet on sometimes it would shy away, on rare occasions refusing to open to your command and lying dormant on your desk. <br>\r\n<br>\r\nAs you continued to plow through the deserted manuscript, you began to notice a few words begin to appear and noted that at the manuscripts conclusion most of the words were now there. <br>\r\n<br>\r\n'Finally' you breathed, reverting to the start of the Book, the pages now filled with odd curvaceous characters are written in queer colors and expanding from top to bottom. This was not the first time you'd read these words nor would it be your last. The colors now changed as you spoke them, from worrisome blue to passionate reds to tedious grays and wealthy violets, and even visiting colors that you hadn't seen before, that you couldn't describe with your mortal tongue.<br>\r\n</span></div></div>",
            "created":1578718800,
            "id":2772440,
            "title":"Episode 1: The First Years."
        }
    },
    "info":{
        "author_id":"the_watchers",
        "author_name":"The_watcher",
        "brief_description":"The Soul Book is a transcript that allows one to manipulate souls.",
        "created":1578247440,
        "description":"<td align=\"left\" class=\"norm\">The Soul Book came into exitance as a locked door between life and death, it was never supposed to be let loose on Humanity, yet one day it happened upon an 18-year-old boy, Kit. Now he has the book does he have the restraint, the power, or the maturity to keep the Soul Book from falling into the wrong hands, or are his hands the right ones, to begin with. <br>\r\n<br>\r\nThis story will be written in an episodic format.<br>\r\n<br>\r\nKit (19)- Kit is a young dark-haired teen. <br>\r\n<br>\r\nEl (18)- El, short for Ellie, is Kit's sister, she is quirky and fun to be around, but her relationship with Kit is not without arguments.<br>\r\n<br>\r\nAra (22)- Ara is Kit's step-sister from his step-father's side, she doesn't have much to do with her siblings and does her own thing. Her father is mostly on business and is close to her step-mother. <br>\r\n<br>\r\nHeather (39)- Kit and El's mother, she runs an online business. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2209473,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1578787920,
        "modified":1578787920,
        "pretty_title":"The Soul Book "
    }
}