{
    "chapters":{
        "1":{
            "author_id":"boyerh09",
            "author_name":"boyer",
            "choices":[
                "Go to present, and see father fixing machine",
                "Explain the past some more"
            ],
            "content":"<div class=\"\"><div> <span>To tell you the truth, it's grown on me, being my mother. You see she only had me when she was fifteen, and was knocked up again by my dad a year later and had my sister. So when I became her, at the age of 8, she was only 23 years old. She had just barely gotten the right to drink alcohol. I've had my mother's body for six years now, her full breasts (well, mine), her long, beautiful red hair, her periods, her tight, toned stomach and rather ample butt. It's weird to think I may have been living life without bras and panties and my adult friends.<br>\r\n<br>\r\nMy sister had a harder time with the swap. That's probably because she was seven years old and couldn't handle suddenly having a 10\" penis. She became my father when the swap happened, a man of 6'2\" height with brawny shoulders, huge hands, and lots of hair. It took her some time to adjust, and she stayed in her room for so long. That's another thing that's funny about our family, we all stayed in our own rooms. I had to help my dad, who was in a seven year old's body, move my mom's clothes and underwear from their room to mine. Then I took all of my clothes to my mother's closet, and hung them up for her. She couldn't reach anymore.<br>\r\n<br>\r\nBasically, we kept the same roles privately, inside of our family home, that we had before the swap. When we were in the home, I was still the son. My mom and dad made that very clear to me and my sister that we still had a long way to go in terms of learning about life, so we couldn't be the parents - even if we looked like them and acted like them outside of the home.<br>\r\n<br>\r\nBut I'm digressing. I'm grateful for the experience to be my mom, because it's made me grow up really fast. I had to cope with a lot of different things that many fourteen year olds don't really mess around with too much. Like taking orders from a little girl that was half my height, or playing video games with two enormous breasts getting in the way constantly. That, and my first period. God, that was terrible. But when I masturbated for the first time, well, I guess you could I say I REALLY grew up.  <br>\r\n<br>\r\nAnyways, my Dad's been trying to fix the darn machine that did this to us for years now....</span></div></div>",
            "created":1259927280,
            "id":800918,
            "title":"An Explanation"
        },
        "11":{
            "choices":[
                "Flashback to early days of change",
                "Explaination on why Jimmy started to think this way",
                "Continue on with Lunch",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Sighing, Jimmy looked at the young girl who use to be his father.  It has been six years since that fateful day in which he switch bodies with his mother; when he father switched bodies with his own sister.  But she still continued to try to figure out exactly how the machine broke.  <br>\r\n<br>\r\n\"Honey, it's time for lunch,\" Jimmy says to the young girl.  <br>\r\n<br>\r\n\"Ok, mother,\" came the natural response from the young girl.  <br>\r\n<br>\r\nJimmy walked up the stairs from the basement and thought about the time he wasn't a mother, a wife, and an adult.  \"It's been such a long time since then that I have nearly stopped thinking of myself as 'Jimmy' and started thinking of myself as 'Rebecca', my own mother,\" Jimmy said to himself.    <br>\r\n<br>\r\nEntering the kitchen Rebecca(Jimmy) saw her husband and son sitting at the table, waiting for the 13 year old girl who was tring to fix the body swap machine.  <br>\r\n<br>\r\n<br>\r\nSuddenly, Elizabeth, Jimmy's sister's 13 year old body, came bounding into the kitchen as if she had always been a female child.  \"I'm here.  Sorry for the wait, it has been difficult trying to figure out exactly what went wrong with the machine,\" state Elizabeth.<br>\r\n<br>\r\nSmiling, Jimmy found it amusing that such a young girl knew so much about the subject.  At times, Jimmy forgot that she wasn't the 13 year old she appeared to be, but in actuality his own father.  <br>\r\n<br>\r\n\"Ok, lets eat everyone,\" Rebecca(Jimmy) said.<br>\r\n<br>\r\nEveryone started to dig into the family meal.  Since it was a Saturday and the kids did not have school and Jimmy and the 'real' Elizabeth did not have work, they feel into the pattern of having lunch together every Saturday.  <br>\r\n<br>\r\nTaking a moment to look at her(his) family, Rebecca(Jimmy) realized just then that he feel into the pattern of thinking them as who they appeared to be.  To him Elizabeth seemed to be the 'real' elizabeth.  While, his mother, the real Rebecca, had started to be seen as Jimmy.  Looking over to his former sister, Rebecca(Jimmy) had now realized that he saw him/her as her husband, Robert, for nearly 2 years now.</span></div></div>",
            "created":1303857360,
            "id":1094901,
            "title":"Go to present, and see father fixing machine"
        },
        "114":{
            "author_id":"maxamps",
            "author_name":"Maxamps",
            "choices":[
                "After lunch ",
                "Someone has an announcement ",
                "Something unexpected happens "
            ],
            "content":"<div class=\"\"><div> <span>Although it's been six years , neither of us has given up on returning back to our bodies. Even though our bodies had switched we still had the same mindsets as before we switched. We only acted as the body we were in when we were outside and when people was around. <br>\r\nIn actual fact I still had the mind of a 20 year old boy though my body would disagree. I did the normal things a boy would do my age , I spent my time playing video games, watching anime, and even looking at porn. I started to gym, my mom's body became really fit , she complained a few times about it getting muscular but she was glad it was in perfect shape. To me training was a way to get in touch with my manly self. I did all the usual stuff a twenty year old Male would do. An occasional fondle of my mom's boobs was always great. I sometimes found it much more comfortable being in her body especially with having a flat crotch at times cause watching my mom having a random hard-on in my body was pretty funny.<br>\r\nThe others acted as they normally would before we switched aswell. <br>\r\n<br>\r\n</span></div></div>",
            "created":1584513360,
            "id":2803124,
            "title":"Other"
        },
        "12":{
            "choices":[
                "still more background",
                "A different background",
                "A third different background",
                "Move on to present"
            ],
            "content":"<div class=\"\"><div> <span>The first couple of months were really hard as my sister and I had to learn how to behave as our parents. I don’t know if it was planned or a coincident that the swapped happened during the summer school break, but it was helpful.  <br>\r\n<br>\r\nAs I had mentioned Sis had the harder time dealing with it, I mean think about it, a seven year old having to learn to become the bread winner, the man of the house.  She had to pretend to be dad in public; driving his car, learning his mannerisms, habits and his knowledge of work.   Mom and Dad did as much as they could to prep us for changes, but it was still rough.  I thought my sister was going to be found out or worse yet, fired.   But Dad, being the genius he is, came up with a plan pretty quick of using a wireless mic and an ear jack to ‘monitor and coach’ her when she was out and having to be him.   It seemed to work fine most of the time and surprisingly within a couple of weeks my sister started getting the ‘hang’ of her new job and by the end of the second month she and Dad had stopped using the setup.   I was really amazed watching her come into her new life.  In the beginning she would come home and spent an hour or two talking with Dad about her job and work and what she had to do, but slowly she started to stop talking work with him as her job and work moved away from what Dad had been familiar with.  <br>\r\n<br>\r\nWhile my sister had it harder, because of her job, it wasn’t exactly a cake walk for me.  I had to learn how take care of a woman’s body, run a household, make meals, shop for groceries and take my own turn at learning to drive.  Sure that’s kind of the condensed version of it, but you get the idea and I would take forever to give you the complete details.  Just as Dad had helped Sis, Mom helped me out as much as she could.  I was taught everything she could think of within a week.  It’s not easy being a woman, having to dress properly, doing makeup and hair and the worse part, maintaining proper hygiene.  A week into it though I felt I had the makeup and hair thing down, the clothing was still hit and miss, but it was improving.   I remember when my first period, as my mom, arrived, I was nervous, anxious and irritable, all the things she had warned me could and probably would happen.   Still I wasn’t really prepared for the messiness of the whole situation.    <br>\r\n<br>\r\nManaging the house wasn’t really as hard as I thought it would be.  Okay, at first it was confusing and hard, learning to do laundry and cook, but I picked up on that fairly quickly.  Having to learn to balance the checkbook, pay bills and purchase things needed for home took a little longer.  The first couple of times of going out to shop were disconcerting to say the least, but Mom tagged along and helped me stay focused.  By the time school was to start up again, both my sister and I had both become fairly comfortable with our new roles.<br>\r\n<br>\r\nMom and Dad seemed to enjoy their new found youth, sure in the beginning they wanted to continue doing things they had done as adults; Dad wanted his beer and cigars and cigarettes and Mom wanted her occasional alcoholic drink, but this was more of a mental desire than a physical one.  Unfortunately, where they only had the mental yearnings, Sis and I had the physical ones.  It was a couple of weeks before either of us acted on them.   We had been invited to one of Dad’s co-worker’s home for a party and although it was uncomfortable we attended.  After that night, Sis would come home after work and have a couple of beers and she started smoking, just as Dad would or had.    Mom and Dad used the entire school break to help us out as much as possible and become comfortable with their own new bodies.  When school started up that fall both were having fun and quickly began to excel in their studies, so much so that they had to really try and ‘dumb’ themselves down.    It wouldn’t do to have two average students come back from summer break and suddenly appear to be geniuses.  Within a week they had managed to come down to a more ‘normal’ grade average.<br>\r\n</span></div></div>",
            "created":1260058380,
            "id":801787,
            "title":"Explain the past some more"
        },
        "121":{
            "choices":[
                "More in the background",
                "More explaining on the mistakes "
            ],
            "content":"<div class=\"\"><div> <span> Mom and Dad used the entire school break to help us out as much as possible and become comfortable with their own new bodies.  When school started up that fall both were having fun and quickly began to excel in their studies, so much so that they had to really try and ‘dumb’ themselves down.    It wouldn’t do to have two average students come back from summer break and suddenly appear to be geniuses.  Within a week they had managed to come down to a more ‘normal’ grade average.<br>\r\n<br>\r\n <br>\r\nNow I don’t want it to seem as if everything was perfect in our swapped up world, because it wasn’t.   As I had mentioned there was several times that I thought Sis was going to be fired.<br>\r\nOh I didn’t mention that the business Dad worked for was owned by my grandma, so really I don’t think anything would have truly happened, but she did make mistakes.  Really it was bound to happen, she was only seven at the time, her math and verbal skills were not that great.  Grandma was able to pull a few strings and pass it off as stress related, which helped.   Then Sis crashed the car, nobody got hurt except the car, but she did get a ticket for careless driving.  Dad wasn’t happy about that, he had a perfect driving record until then, but what are you going to do.   I had my share of mistakes at first also, errors in recording monies in the checking account, missing payments on some things.   But like always Grandma was there to help.   <br>\r\n<br>\r\nYou’re probably wondering how come Grandma knew about this and was helping.  Well it was her husband, my grandpa, or now father-in-law’s machine that caused this.   Dad, now stuck as a pre-pubescent girl, was doing what he could, when he could to try and decipher the machine to get us back to normal.   Now six years later and we are all still in the same bodies and trying to live our lives. <br>\r\n</span></div></div>",
            "created":1260060900,
            "id":801800,
            "title":"still more background"
        },
        "1211":{
            "author_id":"boyerh09",
            "author_name":"boyer",
            "choices":[
                "More backstory",
                "Let's get to the present already"
            ],
            "content":"<div class=\"\"><div> <span>An interesting thing about our lives was when I was about 11 I decided I wanted to get back in touch with being a man.  I rose from my room, where I had been playing some video games.  I remember that day was when I had bought a new bra to go along with my parent's agreement: no going around the house with support.  My mom said it was bad for my body.  Her body.  Well, anyways, by now it's pretty much mine.  <br>\r\n<br>\r\nI walked into my parents' room, where I saw my old self and my little sister's now blossoming body trying to figure out the next step in preparing the machine.  I looked from my Dad's growing breasts, which were well on their way to becoming almost as large as mine, to my mother, her boyish face beaming at me.  \"Yes Jim?\"<br>\r\n<br>\r\n\"Mom, I need to talk to you about something in private.\"  Your dad glanced at her and then ran off, his pigtails bouncing.  You sat next to your mom, and bit your lip for a second.  \"Mom, I want to go to the gym.\"  You didn't expect the look of surprise and pleasure on your mom's face.<br>\r\n<br>\r\n\"That's great honey!  I'm so happy you're deciding to keep your body fit!\"<br>\r\n<br>\r\n\"No Mom, I mean.  Look at all the other kids my age.  They're starting to go to the gym with their dad and stuff.  I want to do that too, but, I mean, well...I want to have muscles.\"  You shied away from her eyes, glancing awkwardly to your thumbs.<br>\r\n<br>\r\nYour mother was shocked to say the least.  \"Well, Jim...I'm not sure what to say to that.\"<br>\r\n<br>\r\n\"I just wanted to ask your permission before I put any muscle on, cuz it was your body and everything.\"  <br>\r\n<br>\r\nYour mom, grateful for your thoughtfulness, reaches up and kisses you.  \"Honey, you do whatever you want.  It's your body now, not mine.  If I ever get it back, well, we'll see if your father can't invent something to tone things down.  But you need to do something masculine, I understand.  You and your father can go start a membership tomorrow!\"<br>\r\n<br>\r\nAnd that's how my journey through a wild masculinity started. It was weird though, because my mom had amazing genetics.  Her full breasts weren't gone they actually kinda grew.  That's probably because I made my pecs pretty big.  But I only ever wanted to work on the biceps.  And boy did my mom's body change.  My arms were massive.  I could crush soda cans with them.  I never felt more masculine than the day I woke up, looked over, and saw a peak in my arm.<br>\r\n<br>\r\nOr feminine for that matter.</span></div></div>",
            "created":1260781440,
            "id":805457,
            "title":"More in the background"
        },
        "12111":{
            "author_id":"lesliebelle",
            "author_name":"leslie",
            "choices":[
                "Masculinity",
                "Femininity"
            ],
            "content":"<div class=\"\"><div> <span>I was really happy with my body so one day I decided to challenge my husband, that was my sister, arm wrestling. First I teased her, saying that his body had become flabby and that I would never beat though now it was a great man. So we sat at the kitchen table and put our elbows tightened.<br>\r\nFor me it was proof of masculinity and I gave it my all and so I was able to beat her. I was elated as she looked at me wrong Finally she said: \"It is useless for you to scream so much, I remain the man of the house\" I was hurt so the next day I decided to continue on the path of the ...</span></div></div>",
            "created":1261090920,
            "id":807003,
            "title":"More backstory: the arm wrestling"
        },
        "121111":{
            "author_id":"boyerh09",
            "author_name":"boyer",
            "choices":[
                "Relent and switch with your mother",
                "Manipulate reality so that you always had this body"
            ],
            "content":"<div class=\"\"><div> <span>I began to train harder, and now I'm massive.  I've got 204 pounds on me, my mother's small frame bulking up to an insane amount.  My 21' biceps are large to the point where I can barely scratch my head.  And my breasts have grown in proportion to my pecs.  All in all, no one can call me just the woman of the house.<br>\r\n<br>\r\nBut the strangest thing happened one day.  I came back from my daily workouts, and my dad comes running up to me thoroughly excited.  \"Jim!\" he shouts out in his little girl voice, \"I fixed the machine!  We can all go back now!\" He seemed to be ridiculously excited about, so you let him drag your massive figure towards the basement.  \"And guess what?\"<br>\r\n<br>\r\n\"What?\" you asked nonchalantly, folding your arms underneath your bosom.  You had gotten used to this body, you didn't want it to go away just yet.  In fact, you never wanted it to go away.<br>\r\n<br>\r\n\"I used your grandfather's notes to learn a little about quantum physics.  Or at least enough to know how to manipulate reality with this thing!  That means we can erase all of this from ever happening!\"<br>\r\n<br>\r\nYou glance at him in shock.  You didn't want to lose these muscles, or your mother's body.  What were you going to do?</span></div></div>",
            "created":1269263580,
            "id":855009,
            "title":"Masculinity"
        },
        "1212":{
            "choices":[
                "What happened that night",
                "More on day to day problems",
                "Go to the present"
            ],
            "content":"<div class=\"\"><div> <span>As it was mentioned earlier, all of us chose to stay in our old rooms after the switch as no one wanted to face it.   Now Grandma didn’t say anything for quite some time, longer than I would have even expected, but after a year of living this way she had had enough.   Even though she knew what had happened and all of us had been adjusting to the swap, she had decided that we were dragging our feet and she was going to take a stand.    Dad had been working as much as possible to repair the machine but was no where near figuring out why it had happened or how to fix it.    So Grandma brought us all together one evening and made a request, though it was really more of a demand.  <br>\r\n<br>\r\nFrom this time forward, Grandma said that she was going to start treating my sister and me as her son and daughter-in-law and mom and dad as ‘our kids’.   Of course she would still allow Dad to work on the machine, but other than that everyone had to start behaving within their new roles.  In addition to her new directive she added that everyone would be moving into their correct bedrooms.   Mom and Dad began to argue with her, not happy about this rule.  Now, neither of them had done anything inappropriate sexually or intimately since switching, but it didn’t matter to Grandma, ‘kids’ their age should not be sleeping in the same room together.    Grandma stated this was a non-arguable issue to her and it would be rectified.  <br>\r\n<br>\r\nGrandma’s decision that she was going to start treating us as the people that we looked like and not who we really were upset Mom and Dad and they tried to argue with her, but she was insistent, telling them both that it had been a year since the swap and it didn’t appear that any resolution to the problem was presenting itself so there was no reason to continue pretending that everyone was normal.  It was confusing to her and becoming burdensome trying to keep it covered up, pretending in public and not in private.  The quicker we all learned to accept our situation the quicker we would get on with our lives.  She stated that she wanted, no expected, us to behave as our new selves and would admonish anyone of us she caught speaking out of character.     <br>\r\n<br>\r\nSo what did this mean for me and my family?   <br>\r\n<br>\r\nIf you remember I had said how we had all moved clothing and personal belongings around to the room we were staying in, but by the end of the afternoon Mom and Sis had moved everyone’s belongings back to rooms where they had originally belonged.  I remember thinking tonight would be very uncomfortable.<br>\r\n</span></div></div>",
            "created":1260824700,
            "id":805609,
            "title":"More explaining "
        },
        "12122":{
            "author_id":"lesliebelle",
            "author_name":"leslie",
            "choices":[
                "To waiting him in the bedroom",
                "To talk with my new mother in law (ex-grandma)"
            ],
            "content":"<div class=\"\"><div> <span>After that first night in our new room, I saw my sister, or rather my husband. looked at me in a strange way. <br>\r\nThe next morning I decided to investigate and found in his old room, some porn magazines. So when our \"children\" were out I decided to start the debate. He explained that after the exchange his sexual desire begins to awaken. <br>\r\nAt first it was a small thing but then begins to masturbate. I asked him if he were attracted to me and he said a lot. I was shocked. You should know that since I am in this body I was like an asexual being, feeling no particular desire for men or women. Of course I remembered being a teenager who liked girls, but try to understand me it's hard for me to see Keira Knightley and remain aroused  when just you look down and see a more prosperous cleavage than hers. I decided to break off the conversation immediately and start my chores.<br>\r\nThe following days I thought no more of that thing but one day I came by accident in the bathroom when my \"husband\" was having a shower and when I saw his naked body I started to feel a bit excited so I decided...</span></div></div>",
            "created":1274554920,
            "id":887282,
            "title":"More on day to day problems"
        }
    },
    "info":{
        "author_id":"boyerh09",
        "author_name":"boyer",
        "brief_description":"A family that's been swapped lives their lives and tries to return to normal.",
        "created":1259925900,
        "description":"<td align=\"left\" class=\"norm\">You are Jimmy, a mature fourteen year old boy.  But that's because for the past six years you've been living as your mother.  And your sister, a young thirteen year old has been living as your father.  Both of your parents are stuck in your original bodies, growing slowly but surely.  Thankfully, your wealthy grandmother (on your father's side) was able to take care of you all while your father tried to slowly learn what he could about his father's body swap machine that did this to you all.<br>\r\n<br>\r\nThis is the story of how you and your family try to live normal lives as you go out and do routine tasks.  It's also about how your family tries to fix things, and may end up screwing everything up even more.<br>\r\n<br>\r\nJust as a note: Please no explicit sex.  Sex can happen, but nothing explicit please.<br>\r\nDon't kill off characters, and don't change their names midway through.  Keep the plot simple, clean, and generally connected to the beginning info I've posted here.  Also, make sure to write something clear, and more than just two sentences or a word long.  THANKS!  Most of all, have fun!</td>",
        "id":1623760,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584513360,
        "modified":1584513360,
        "pretty_title":"How to Fix a Swapped Family"
    }
}