{
    "chapters":{
        "1":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "A strong wind blows you away from the city",
                "You get lost and end up in a bad part of the city",
                "You get interrupted in the air",
                "You crash into someones house/aprartment",
                "You make it to main Street"
            ],
            "content":"<div class=\"\"><div> <span>     You look out the window of your new house overlooking Yorktropolis. Your house is hidden, carved within a mountain overlooking the city which glows brightly in the night. You were a business man who amassed an insane amount of wealth and even used your powers to steal information/materials to beat out the competition. You reached the top and became so bored that you decided to \"retire\" and move to this new city which was always on the news, for better or worse, to live a life of adventure and maybe even cause some mischief. You are the only man in the universe with super powers! You can survive just about anything, Though you feel every bit of it and it will force you to shrink until you recover. You can even choose to shrink yourself down to a couple inches and with your wealth you have plenty of gadgets to help you get around. As of now nobody knows you have super powers and no heroes or villains have heard of you. <br>\r\n<br>\r\n     \"This is perfect\" You think to yourself \"This is the place to be, a city with action!\" you walk to your hidden chamber and grab a suit called \"Black Gecko.\"<br>\r\n It's basically a black spider-man suit that changes size with you and has textured gloves and boots that let you cling to walls and sides that stretch out to help you glide but only while shrunken. You put on the suit and step out onto your balcony. \"Time to check out my new city!\" You say excitedly and with a bit of arrogance as you shrink down and leap off the edge of your cliff-side home making your way down to Yorktropolis! You are planing to make your way to the main center which is supposed to be a great area with tons of things to see.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1354597200,
            "id":1481805,
            "title":"A New Beggining"
        },
        "13":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She notices something smashed on her tit",
                "She sees you move",
                "You peel off but fall in her cleavage!",
                "You peel off and escape",
                "She gets a call on her earpiace and you are stuck along for the ride"
            ],
            "content":"<div class=\"\"><div> <span>     As you are gliding down, nearly about to reach the tallest skyscraper of Mid-Town you notice something moving incredibly fast through the air and suddenly zip right towards you!!! <br>\r\n<br>\r\nBAM!<br>\r\n<br>\r\nYou felt like you got hit by a fright train as Power Girl plowed into you leaving you stuck to her massive right breast like a bug splattered on a windshield. The Kryptonian beauty didn't even feel you as she continues to fly around patrolling the city at breakneck speed. The wind is extremely violent and cold against your back and you try desperately to peel yourself off of her when suddenly she stops on a nearby skyscraper. <br>\r\n<br>\r\n\"What a fantastic night!\" She says as she stretches out making her breasts jiggle along with your plastered body. She scans the city streets and checks her earpiece for chatter but as of now it is peaceful.<br>\r\n<br>\r\nMeanwhile you try to peel yourself off her breast without being noticed. Not the smoothest start to the adventure but you don't feel deterred... yet. </span></div></div>",
            "created":1479186000,
            "id":2237575,
            "title":"Mid air Collision"
        },
        "131":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You get shot through a window!",
                "You get shot into the street",
                "You collide with someone/something else mid air! "
            ],
            "content":"<div class=\"\"><div> <span>As her tits jiggle with every move she makes a small black shape catches her attention. Because your glider was stretched out you looked like a flat splatter on her breast as she pinched your head between her fingers with blindingly painful strength and ripped you off her tit. Her fingers felt like two meteors pressing on either side of your head. You have never felt such massive strength before and this woman was simply holding you up with a small (to her) pinch.<br>\r\n<br>\r\n\"Oh man that must have hurt. Poor thing.. Ugh bugs are so gross though\" she says as she starts grinding her fingers together rolling Your entire body between them and crushing you into a tiny flat mess. She then flicks you away with her super strength shooting you like a bullet across the city!!!</span></div></div>",
            "created":1479186000,
            "id":2237577,
            "title":"Tossed Away"
        },
        "1311":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "On the floor, in front of Gwen Stacy",
                "On Supergirl's chair",
                "In a pair of panties in Spidergirl's closet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you land?</span></div></span></div>",
            "created":1491541200,
            "id":2301490,
            "title":"You get shot through a window!"
        },
        "13112":{
            "author_id":"zinyzang",
            "author_name":"Zinyzang ",
            "choices":[
                "in the morning still in her ass as she goes about her day unaware",
                "you get farted out and escape when she changes clothes"
            ],
            "content":"<div class=\"\"><div> <span>as you fly through the air you see an open window and a red chair, with a lot of force you are slammed into the chair and your body squished and expanded on top of the middle of the seat, a few minutes later you hear a door open and presume the home-owner is back, suddenly the room you are in is lit up by the lights being flicked on, then the chair starts rotating and you see the crimson skirt of Supergirl standing in front of you, without warning the skirt moves backwards towards you then quickly descends only having time for the skirt to flip up and Supergir's bare ass to make an appearance with a thin piece of cloth also know as a thong, the last thought you had before you were squished was she has a pink thong, under Supergirl you couldn't hear anything especially as you are now between her ass cheeks.<br>\r\n<br>\r\nSupergirl was flying around the city looking for danger when she found no crime so she headed home exhausted from a long day at work, once she got close to home she made it home without anyone seeing her and went inside, once inside she saw her comfy red chair and without a second thought she turned it around and fell onto the chair letting gravity do the work, after about 30 mins she stood up and felt something odd in her ass, so after removing her costume and standing in her bra and thong she reached her hand towards her ass as the discomfort was there \"stupid thong\" she said as she pulled it back then release it, suddenly the weird feeling was gone and quickly giving herself a even bigger wedgie than before, so she got into bed and went to sleep.<br>\r\n<br>\r\nAfter what felt like an eternity in Supergirl's ass you feel movement as your prison rises from the seat with you tucked deep into her ass you feel her moving around supposedly removing clothes, then the two giant globes of flesh open up to reveal her hand, suddenly you hear her say \"stupid thong\" as you see her hand grab the thin cloth and pull it back, however as her hand passed you it caught you making you fall off her cheek and land on the cloth surface, without warning her hand released the thong and trapping you right against her anus you tried to move but as you did that you head was pushed inside her anus, then you feel her moving for a few moments and then nothing except for pain as you assumed that she has gone too sleep. </span></div></div>",
            "created":1592824380,
            "id":2854921,
            "title":"On Supergirl's chair"
        },
        "1312":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You stay stuck to harley's motorcyle",
                "You get unstuck but Batgirl runs you over",
                "Batgirl Manages to fight harley off the bike"
            ],
            "content":"<div class=\"\"><div> <span>      With agonizing force you get splattered onto the cold wet pavement of a dark street! You feel like every bit of you is shattered like glass as you lay helplessly on the ground. \"Fuuuuck\" You moan in pain \"This was not how it was supposed to go\" You are on your back and luckily can at least see your surroundings. The road is empty at the moment but the buildings look a bit run down and there is graffiti along many of the buildings. \"Shit this must be a bad area\" You think to yourself as you slowly sit up. You bite your lip to silence a scream as any movement is agonizing at the moment. Then your heart drops as you hear loud engines and sirens!! \"Oh no please not now! No! No! No!\" <br>\r\n<br>\r\n<br>\r\n    Off in the distance appears none other than Harley Quinn on a supped up motorcycle ripping through the quiet street and heading your way with tons of police cars chasing behind her! Your body is still completely broken and unable to move as you stare in horror! \"Please turn! please turn please turn!\" You pray to yourself but she passes every intersection and blazes towards you! Your eyes widen as her headlight shines right on you and her engine ROARS!!!<br>\r\n<br>\r\nIn the blink of an eye her front tire Crushes you paper thin and you get ripped off the street and flung into her back tire which crushes you further and plasters you into its treads keeping you stuck to it like glue as it runs you over again and again at an insane speed. You are in constant torture as Harley turns up the speed and even pops a wheelie putting more weight on you and she even jumps the bike up and down sometimes landing at the exact time you were at the bottom end of the tire spin adding so much more blinding pain!<br>\r\n<br>\r\nThe only consolation you had was that you were looking sideways when she ran you over so half your face was squished to the rubber but the other half was flat but able to see what was happening. It was hard to tell but in the quick flashes you were able to see between getting run over you think you saw Batgirl on her motorcycle trailing right behind Harley!<br>\r\n<br>\r\n</span></div></div>",
            "created":1479186000,
            "id":2237585,
            "title":"Roadkill"
        },
        "13121":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You decide to explore on your own.",
                "You climb into a motorcycle pouch and wait for Harley to drive outside again."
            ],
            "content":"<div class=\"\"><div> <span>      Harley Races through the streets laughing like a maniac and tossing grenades behind her to try and lose her unwanted fans. Batgirl barely manages to dodge and yells \"Try working on your aim clown!\" to which Harley flips her off and jokes \"I think the boys in blue think my aim is just fine\" Batgirl is horrified and looks behind her to see one of the police cars flipped and on fire. \"Damn\" she curses under her breath and spins her bike around to help the police escape the wreckage. Harley lets out another loud laugh to rub it in and zooms deeper into the heart of the crime ridden section.  <br>\r\n<br>\r\n    You are freaking out still completely plastered to this crazy woman's motorcycle as she drags your sorry body deep into the streets of the criminal underworld. She gets to a dark overgrown park with what looks like an old metal shed buried in the undergrowth. She opens it up and drives in quickly shutting and locking the door behind her and she drives through and underground tunnel before finally parking her bike! <br>\r\n<br>\r\nLuckily your body was at the top of the tire when she parked but you were going to be stuck recovering for a while after this. Your broken body slowly recovers over the course of an hour or so just to be able to move again. The back of your suit has been ripped off and ground to dust as it was dragged against the pavement for miles and miles leaving your back a crispy burnt red from no longer being protected. Luckily your suit also had a trick up its literal sleeves as it's fibers stretched as would if you grew back to normal in order to repair itself. You tried to keep your mind off the pain and looked around from your perch. It looked like an underground maze filled with the roots from the massive trees you saw outside. There were even tons of plants growing along the walls with flowers glowing in the dark. It was quite beautiful and scary at the same time and there was no way in hell you were going to be able to find your way out alone. But then again you came for adventure right? </span></div></div>",
            "created":1479186000,
            "id":2237597,
            "title":"Escaping with Harley"
        },
        "131211":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You go in for a closer look",
                "You hear a voice behind you"
            ],
            "content":"<div class=\"\"><div> <span>     \"Okay definitely a rough night but the whole point of tonight was to explore MY new city\" you build up your courage and slowly climb down the tire treads and make it to the floor. the pavement beneath you is cold and damp but there is almost no dirt or plants in the middle of the tunnels. There is no tire trail for you to follow. There were no footprints left by Harley either as not a single blade of grass near the walls has been flattened. <br>\r\n<br>\r\n     You decide to wander away from the motorcycle keeping close to the wall. You tried to keep cover under the small plants growing along the passages and started to feel like you were being watched. You looked behind you but nobody was there. It did seem as if the flowers glowing in the dark were somehow shining there light towards you eerily. You shrugged it off as paranoia and kept creeping along until your heard running water and a familiar voice.... Harley. She was singing \"Jingle bells Jingle bells Batwoman smells, Etc.\"<br>\r\n<br>\r\n     You followed the sound of her voice and coincidentally the running water, finally reached a corner You peaked out to see a fully naked Harley standing in thigh deep crystal clear water as she showered under a small underground waterfall surrounded by enormous flowers and leafy vines along the floor and walls. You were drooling as she kept singing and dancing in place jiggling her breasts against the falling water before spinning around and shaking her ass against the surface of the pond with a splash.<br>\r\n<br>\r\nWhile you would love to get a better view you know its not the smart thing to do. Then again it could make up for the crappy night you've been having so far.</span></div></div>",
            "created":1479186000,
            "id":2237605,
            "title":"Exploring the Maze"
        },
        "1312112":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She continues to mess with you (reserved)",
                "Harley comes in"
            ],
            "content":"<div class=\"\"><div> <span>     \"Enjoying the view?\" you hear a sultry female voice behind you. Your eyes widen and you slowly turn around to see Poison Ivy laying on her stomach with her face just inches away from you! \"How did she sneak up on me!?\" you think to yourself in terror as you try to stammer a response. She gently presses her finger onto your lips \"Shhhh, it's not often my poor Harley gets to relax like this lets not ruin it for her\"  Vines suddenly wrap around you and gag your mouth with a thick flower bud as Ivy stands to her full height towering over you. She turns around and starts walking away as the vine that is holding you flings you towards her. The vine she wears as a thong then snatches you up from the air and coils back around her hips keeping you dangling behind her right ass cheek which bashes into your face with each step she takes. A massive flower retreats from the wall revealing a dark room when she daintily steps into before the flower seals the doorway again.<br>\r\n<br>\r\n     She smiles as she lets the gag fall from your mouth and her thong releases you. She quickly gives you a hip check squishing you flat against the stone wall with her ass cheek and then kneeling down to speak to you eye to eye.<br>\r\n<br>\r\n     It was a sight to behold to see her mostly bare perfect ass before you. That is until her pale green cheek crushed your already sore body painfully flat yet agian reminding you of your dangerous predicament.<br>\r\n<br>\r\n    \"I'm sure you must be so tired after your ride with Harley\" She said slyly. \"The flowers told me you've had a string of bad luck tonight. And all to catch a peek of her naked.\" Your body started to slide off the wall as you inflated a bit \"Wait that's not what happ- woah\" you fell to floor rolling a couple inches past Ivy. \"Are you calling my plants liars? I even caught you in the act! Next you'll tell me you didn't step on the poor grass\" You stammer up at her \"I didn't mean to! honestly I had no idea it was your grass\" She slowly walks forwards towards you as you desperately drag your still healing body back wards away from her. \"That doesn't matter ALL grass feels and they ALL don't like to be STEPPED ON!\" She says angrily as she SLAMS her barefoot down on you crushing you painfully beneath her. \"Surely you can relate to that right?\" She leans her weight down further on your and twists you beneath her unforgiving heel and onto the stone floor. You have never felt so insignificant in your life before this point. You were so used to always getting your way and leaving an easy carefree life and yet here you are getting ground to mush by an angry green redhead with just a simple step. <br>\r\n<br>\r\nShe finally lifts her foot off of you and peels you off the floor with her nails. As if getting stepped on wasn't painful enough now her nails are clawing you off the floor scraping against your delicate body before tossing you onto her bed. The mattress is green with tiny plants growling along the sides and rich dirt along some of the edges which must be feeding the plants in the room. \"I think you can sympathize with the grass now right?\"  You immediately groan out \"Yes!! I'm very sorry!\" She smiles \"I know you will be.\" </span></div></div>",
            "created":1479186000,
            "id":2237614,
            "title":"Enjoying the View?"
        },
        "13121121":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Rest up you need to heal (reserved)",
                "You muster enough strength to at least leave her room"
            ],
            "content":"<div class=\"\"><div> <span>      Ivy licks her lips and crawls onto the bed crushing you with her hand and then again under her knee as she tramples over you and finally lays onto her stomach with her face hovering over you. You twitch in pain and fear as this woman bulldozes over you effortlessly. She motions for some thorny vines to snag at you whipping you painfully and tearing your suit and mask to shreds leaving you naked. Her eyes widen in surprise \"A man? Impossible no man has powers what are you?\" she demands as she presses her finger down on your crotch poking it firmly to see if its real. <br>\r\n<br>\r\n     \"Owwwww STOP! I was born normal but during puberty I started being able to shrink I SWEAR.\" She grins \"Wow so you are the first male mutant ever discovered. And obviously you can take a beating\" Ivy then pinches your balls and dick so they are paper thin. You scream in agony but she quickly silences you by kissing your face with her massive thick lips. \"I can use a henchman with your powers\" she says as she sucks you into her mouth covering you in her poisonous saliva. You are panic stricken as her tongue molests you and slides all over your body tasting every inch of you and forcing the tip into your mouth. Her tongue stretches your head as it shoves into your gaping maw and she wiggles it playfully while also forcing you to swallow her poison. She swishes you around in her mouth for another minute or so and then plucks you out with her fingers and places you on the bed. While scary she was at least gentle with you while you were in her mouth so you were able to recover somewhat.<br>\r\n<br>\r\n     \"Stand up\" Mentally you're thinking there's no way you'll be able to but your body stands up enduring immense pain! You try to scream but your mouth is closed tight. On top of that you found Ivy completely irresistible. You already thought she was gorgeous but this was something else entirely you NEEDED to touch her and feel her yet your body would not move. \"I usually don't get to use this power as there aren't many men around here. Kiss my ass\" She says as she sits up and leans on her side exposing her ass cheeks to you. Immediately warning bells go off in your brain to run away from her but your body walks to her like a zombie and part of you gets excited and needs to do this. It is a strange mix of terror and lust as her poison commands your every move but your mind is mostly intact. You caress her ass cheek and start kissing it over and over again as Ivy laughs at you from above. Your member soon recovers too and soon you have a hard on as you make out with her ass. She then sits up suddenly rolling her ass onto you and enjoying the feeling of you getting flattened against her massive cheek. If she concentrates hard enough she can still feel the tickle of your lips kissing her ass even under all her weight. <br>\r\n<br>\r\n     You however are in agony as your body is broken down again beneath this woman and all you can think about is to keep kissing her ass. \"That's enough\" She says as she rolls back off of you and lays on her stomach spreading her legs. Her vine thong unravels and leaves her butt naked exposing her huge pussy and leaving her ass crack empty. \"Come closer\" she says. Despite being crushed flat your body struggles to drag your sorry ass over to her pussy. It doesn't smell like a normal vagina though it smells like a light sweet nectar or honey. The smell is intoxicating and you get more and more excited as you get near it. Just as tour tiny face is about to make contact she says \"Stop\" You freeze up but are so desperate to touch her now that your're so close. You can feel the warmth from her pussy radiating onto your face. She waits for you to heal and makes your stand. Your throbbing cock is pointed straight at her and just barely a centimeter away from touching her pussy, it is driving you insane. Ivy wiggles a bit in front of you jiggling her meaty ass before you and wafting more sweet scent from her pussy. You're so turned on that you feel like you could cum at any second without even having touched her. <br>\r\n<br>\r\n    \"Are you ready?\" She asks you and immediately you yell \"YES!!!\" She smiles and lifts herself onto her knees and is on all fours her pussy now hanging far above you and you stare up hoping for even a drop to splash on your face. Instead she crawls forward a but bends her leg so her knee is under her chest and KICKS you with all her might! The bottom of her foot RAMS you like a freight train and shoots you hard off the bed and straight into the wall. \"You were not ready for that\" she laughs as your body peels off the wall and falls to the floor. \"You are the lowest ranking underling right now. Hell you're a slave at this point. You gotta work tour way from the bottom up. and I don't meant this bottom\" She says as she slaps her ass \"I'm talking all the way down.\" she says as she sits at the edge of the bed and taps her feet on the floor. \"You are like dirt\" she says as she drags some soil with her feet into a nice pile. \"Dirty and beaten by the elements but a steady foundation to plant roots\" She then sinks her feet onto the dirt pile flattening it. \"Come here\" inside you're thinking hell no!!!! but your body excitedly hobbles over to her. She moves her feet \"Lay down on the dirt so my point can really sink in.\" You lay down face up on the dirt in complete terror but she has total control over you even your boner is raging hard despite getting donkey kicked earlier and knowing whats about to come. \"Good boy\" she says as her feet hover over you. Specks of dirt fall from her sole to your face and she slowly swings her foot back and forth over you getting lower and lower. Suddenly the tip of your boner comes into contact with the bottom of her big toe and she drags the length of her right foot across it driving you crazy with sexual frustration. Its feels rough but good at the same time and finally her heel swings back and repeats the process in reverse dragging all the way back up again. She does this several more times leaving you frothing at the mouth desperate for release but instead she suddenly presses her foot down squashing you into the dirt with a swift STOMP as she hops out of bed and onto you. She tramples you cruelly with both her feet squashing you endlessly and kneading you with the soil. She drags you beneath her soles then roughly steps forward to get on the tips of her toes only to SLAM her weight back down hammering you with her heels. Your poor boner never stood a chance as it painfully flattened and twisted along with the rest of your body as she made you one with the dirt.<br>\r\n<br>\r\n     Once she was satisfied with trampling you she sat back on the bed and looked down at you. You were covered in black dirt and flattened completely thin nearly impossible to see but she knew exactly where you were she plucked you from the dirt and started to stretch your battered body like a tiny rag and began using you to clean the dirt off the bottom of her feet roughly scrubbing you against her skin in quick painful motions and flossing you between her toes which tightened happily crushing you further. Soon her feet were spotless and you were pitch black with dirt even jammed into your nose and throat as she discarded you off the bed an back onto the dirt pile. You coughed and gagged sputtering the soil from your mouth as Ivy wiggled her ass and pussy over the edge of the bed taunting you. Even after all that you wanted desperately to plunge into that vagina as she teased you from above. \"Alright dirt I think that will be all for now, the poison should be wearing off soon anyways\" She says as she lays back into bed and sighs happily and drifts off to sleep without a care in the world. You however lay plastered in the dirt for several hours desperately trying to heal. You feel so tired after such a brutal day and you just want to pass out but you know it is dangerous here.</span></div></div>",
            "created":1479272400,
            "id":2237734,
            "title":"Learning your Place"
        },
        "131211211":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You sneak back into the tunnels.",
                "Somebody is approaching the pond."
            ],
            "content":"<div class=\"\"><div> <span>     This has been by far the most painful grueling night of your life. You lay in the dirt beaten and battered both physically and mentally but finally it seems to be over. You can;t muster the will to move even though you know you should. \"Screw it I'll rest for a few minutes and make my escape\" You think to yourself but before you know it exhaustion takes its toll on you and you fall asleep for the rest of the night. <br>\r\n<br>\r\n     Hours later you wake up. You groan as your body is pretty stiff from the beating you took and having to heal for the entire night straight. You then realize you are still in Poison Ivy's room laying on a pile of dirt and quickly panic. You look up and see her hand and some of her red hair resting over the edge of the mattress. You sigh in relief that she is still asleep and try to think of a plan. Sadly the only way out is through that huge flower that blocks the entrance way. \"She did say I could leave...\" Reluctantly you walk up to the plant expecting nothing to happen but miraculously it silently moves just enough to let you squeeze through. You whisper \"Thank you\" almost dropping to your knees with gratitude and head through the opening careful not to even touch a blade of grass much less step on it.<br>\r\n<br>\r\n    You are still naked and covered in dirt but at least you were on your way to freedom. You hear the running water again and quickly follow the gushing sounds. Finally you reach where Harley was bathing last night and dive right into the water. It feels incredible and refreshing especially on the road rash you had from being a skid mark. The water tingled and felt like it was further healing your entire body. Sure enough your back was fully healed and your muscles and bones no longer ached. You washed off all the dirt and felt like a new man, hell you felt like you can regrow for sure now. You swam back to the edge to get out of the water hoping to plan your next move.</span></div></div>",
            "created":1479272400,
            "id":2238085,
            "title":"Rest for the Weary"
        },
        "1312112111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Head for the motorcycle ",
                "Try to ask Ivy for help"
            ],
            "content":"<div class=\"\"><div> <span>     It looks like your luck has turned for the better as you get back into sneaking mode and continue your journey. \"Maybe I can find the bike again and borrow it?\" You shutter at the thought of basically stealing from Ivy and Harley but what choice do you have? It would be noisy as hell too. You soon cross by the giant flower for Ivy's room. Maybe you should ask her to help you leave? Then again the woman literally treats you like dirt....</span></div></div>",
            "created":1479272400,
            "id":2238088,
            "title":"Poor Choice of Options"
        },
        "13121121111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Don't take the bike",
                "Take the Bike"
            ],
            "content":"<div class=\"\"><div> <span>     You definitely don't want to deal with Ivy today and decide you should be able to retrace your steps to find the motorcycle. You hope it is still there... you wander for what seems like forever but sure enough the bike is right where Harley left it! You even see the key is still in the ignition! You nearly jump for joy feeling good about how this morning is turning out. There are large storage pouches that may even contain some clothes. You worry about what you are about to do but you NEED to get the hell out of here. You check around the corners to make sure the coast is clear and then walk up to a nearby flower. \"Please uhhh plant? Flower? Just please when Ivy wakes up let her know I am just borrowing some stuff from her and I will definitely give it back I just need to get home.\" The plant doesn't react at all. \"Hopefully that worked...\" You think to yourself as you grow back to normal size. <br>\r\n<br>\r\n<br>\r\n    You quickly check the pouches and sure enough you find a leather jacket and pants. Both are a little tight on you but fuck it at least you wont be naked. You look at the bike and see it has a GPS on it! \"Oh fuck this might show me the way out!\" You gently turn the key to turn on the electronics but not the engine. It does a quick beep that nearly gives you a heart attack but wasn't really all that loud. You look around but the coast is still clear. Sure enough the gps loads a map with a red dot at the end of a tunnel that seems like it would be an exit. \"I don't even need to take the bike! just gotta memorize the map!\" You say excitedly under your breath. Then again it would be so much easier if you could actually escape with the bike.. You did tell the flower after all right?</span></div></div>",
            "created":1479272400,
            "id":2238097,
            "title":"To Borrow or not to Borrow?"
        },
        "131211211111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She says the plant confirms your story",
                "She says you are lying"
            ],
            "content":"<div class=\"\"><div> <span>      You decide not to temp fate as your morning has been lucky so far. You turn off the electronics and dismount the bike and whisper to another flower \"Just gonna borrow the clothes and used the GPS for a second, please don't kill me Ivy\"<br>\r\n<br>\r\nJust then a mess of vines behind you shifts to the side and Harley steps out yawning and wearing a tube top and panties not to mention armed with her trusty mallet. Her eyes suddenly widen \"What the FUCK!?\" You turn just in time to see Harley bash your face in with a swing of her hammer instantly dropping you to the floor and forced to shrink in an instant. \"Where the hell did you go!?\" she yells as to her it looks like she smacked you out of existence leaving only a jacket and pants on the floor. <br>\r\n<br>\r\n     Your head is pounding as you lay in darkness beneath the Jacket as Harley stomps around angrily looking for you. \"Red! I think we've got bad company\" She yells and within seconds a still half asleep Ivy arrives at the scene. \"What's going on Harley?\" she says mid yawn. \"I just hammered some guy in the face and he disappeared or something\" Ivy finally wakes up fully \"Oh that's right the shrinking guy\"<br>\r\n<br>\r\n     \"Shrinking guy!?\" Harley suddenly kicks the pants and jacket away revealing your tiny naked body on the floor. WHAM WHAM WHAM!!!! She hammers the daylights out of you with her mallet again and again. The hammer brutally mashes you into the stone with no sign of stopping making you one with the floor which even starts to crack under the relentless assault. <br>\r\n<br>\r\n     \"Harley stop! I actually met him last night\" Harley looks concerned but finally rests her hammer back on her shoulders \"Oh... but red he was gonna steal my motorcycle\" Ivy eyes you suspiciously and you manage to stammer out \"Pppplease ask the flower I swear I wasn't gonna steal it\" <br>\r\n<br>\r\n     \"You better not be lying dirt\" she says as she walks over to the flowers. Meanwhile Harley steps down on you marching in place to trample you beneath her feet behind Ivy's back. Your poor body mashes against her bare soles as she steps and grinds you beneath all her weight like shes squashing grapes.<br>\r\n<br>\r\n     Ivy already knew the truth long before she got out of bed as she was able to instantly communicate with every plant for miles but wanted to draw this out and be dramatic.<br>\r\n<br>\r\n</span></div></div>",
            "created":1479272400,
            "id":2238110,
            "title":"Better to be the Hammer than the Nail"
        },
        "1312112111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Harley pulls over to have her way with you",
                "Someone interrupts Harley"
            ],
            "content":"<div class=\"\"><div> <span>     Ivy starts to turn around and Harley quickly hops backwards to get off of you. She was unaware however that you were stuck to her foot like a sticker and SQUASHED even harder when she landed again. \"The plants never lie and they confirm his story. He apparently told them he was just going to borrow the clothes and use the GPS. How sweet.\" She says with a wry smile at the end. \"They also said you made quite an impression on him just now.\"<br>\r\n<br>\r\n    Harley quickly responded \"Sorry Red just wanted to make sure ya know?\" She laughs nervously and then looks at where you were \"Hey he's gone!\" Ivy giggles \"Peel him off your foot Hun\" Harley quickly checks under her right foot and sure enough you are plastered flat to it. She bites her lip to hold in a laugh and peels you off like a band-aid. She hands you over to Ivy who can't help but laugh at your comically paper thin body. \"Oh Dirt you poor thing\" Harley explodes into laughter \"DIRT!? HAHAHA that is perfect. I guess there's no point dragging your name through the mud huh?\" She nearly tears up laughing at her own joke.<br>\r\n<br>\r\n     \"Now listen Dirt I'm feeling generous today so you'll be escorted out soon but I could definitely use someone like you soon. I always get what I want so when the time comes you can either make it easy or I can make it hard understood?\" You nod your flat little head frightened to death. \"Good\" Ivy then crushes you in her grip  and slaps you onto the seat of the motorcycle. You are left splattered, face up spread eagle as Harley puts on her clothes and Ivy saunters away saying \"Harley take our little speck of Dirt out of here. Make sure you leave him far away and don't let him see anything. We need to keep our place a secret.\" <br>\r\n<br>\r\n   \"You got it Red\" Harley says as she finished putting on her boots. She approaches the bike wearing a white tee- shirt that shows off her flat belly and an open black and red jacket with matching short shorts that ride quite high up her ass, along with fingerless gloves and fishnet stockings that ride all the way up under her shorts. She is chewing pink bubble gum loudly with her mouth open as she places the mallet in a holster and eyes you happily on the seat while blowing a big pink bubble. She smiles as she slowly mounts the bike hovering her tight round ass over your helpless body. You stare in awe at the underside of her ass as she shakes a jiggles it above you making your member give her a salute. Just as you really start to enjoy the view she RAMS her ass down on the seat while popping her bubble gum right as you go splat, boner and all. She grinds her ass hard across the seat smearing you under each meaty ass cheek as she turns the bike on and it roars to life violently vibrating. She settles her ass on you enjoying the vibrations which shake her entire body up and down repeatedly pummeling you beneath her jiggling ass.<br>\r\n<br>\r\n     It is early in the morning and already you are annihilated again. You are in constant escalating pain as Harley smears you with her powerful ass cheeks like a piece gum on her seat. The constant friction and vibrations start to burn you as well, especially with the fabric of the fishnet stockings covering her ass cheeks. She Bursts through the tunnels at blinding speed further digging her ass into the seat to keep stable as she races out of the hideout.<br>\r\n<br>\r\n      When she dismounts to open the door she gets an idea. She walks the bike out and locks the hideout shut and then brings her attention to your body that is currently smeared across the right side of the seat. You gasp for breath feeling nearly suffocated by her ass but she ignores your distress and simply rips your body off the seat and starts to stretch you a bit. Just enough to press you back onto the seat face up with your head where her pussy would land and your crotch would lay at the center of the crater her right ass cheek left behind. You feel like you will rip in two and scream as she carelessly toys with your body for her own amusement. \"Oh yeah scream just like that!!!\" she says excitedly. She gently rubs your flattened cock with her fingers and smiles as it comes back to life and pops back up again. She was so excited to smash it again as she mounted the bike and once again MASHED her ass into the seat crushing your sensitive body to mush and feeling the added vibrations of your screams echoing into her crotch. \"Just. Like. That\" She says bouncing roughly on you with each word before racing off again. <br>\r\n<br>\r\n     Harley makes sure to ride the bumpiest, most pot hole filled streets she can find which violently bounces her body onto you ramming her pussy into your face and torso while the lower half of your body repeatedly got hammered under her massive ass with your crotch taking the full brunt of the impact. This turned her on so much that she was getting her shorts wet and some of it even leaked onto your face adding a sense of drowning to your predicament. You chocked on her juices as she got wetter and wetter even swallowing some of it down to try and breath between each agonizing bounce. She even popped a wheelie like last night and jumped the bike further ramming your body into hers. Every impact feels like your body is being shattered again and again and your screams are drowned out in her excitement and sweat and you feel like you are going to die but your body keeps trucking. Your boner even tries to lift itself up as her ass rises only to be mashed back down into submission... Meanwhile she is getting hornier and feeling more violent urges.<br>\r\n<br>\r\n</span></div></div>",
            "created":1479272400,
            "id":2238121,
            "title":"Ridden like a Harley"
        },
        "13121121111112":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You manage to get stuck with Batgirl (reserved)",
                "She wipes you off her mask and onto the ground"
            ],
            "content":"<div class=\"\"><div> <span>     Just as things are really starting to heat up for Harley another engine starts to roar behind her. She looks back and her eyes widen \"Really!? again bat brain?\" she yells as Batgirl pulls up on Harley. <br>\r\n<br>\r\n\"Give it up Quinn you aren't getting away this time!\" Harley speeds up and goes winding through the city trying to lose the persistent vigilante. \"Crap this isn't working\" she says as she hears Batgirl gaining on her. \"Alright Dirt I guess we will have to finish this another time.\" She reluctantly reaches under her crotch pinching your soaked face and carelessly rips you out from under her dragging your body beneath her wet crotch further slathering you up. She aims carefully and flings you at Batgirl like a booger and you hit her eye brow with a wet splat! splashing sweat and vaginal fluid into her eyes which sting like crazy.<br>\r\n<br>\r\n\"Bulls eye!!!\" Harley yells and laughs like a maniac as Batgir pulls over wiping her face and eyes in pain. \"Dammit!!\" She yells trying to get her eyes to stop stinging as your poor body gets mashed between her hand and her face.</span></div></div>",
            "created":1479272400,
            "id":2238125,
            "title":"Batgirl Returns"
        },
        "131211211111121":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "The bat signal! She has to leave right away",
                "She discovers you"
            ],
            "content":"<div class=\"\"><div> <span>     Batgirl curses her luck but feels you mashed up against her mask. She peels you off and tries to get a decent look at you but her eyes are still stinging. \"What the hell is this. Owww! Man this stings?\" She rubs her eyes again and reaches for an empty capsule from her utility belt and squishes you into with her finger so that she can study you later. Your poor body gets shoved in roughly and compressed into the tight pill shaped capsule as she keeps mashing you in with her finger and shuts it tight unknowingly crushing your fingers between the casing and cap as she seals you in. You completely fill up the capsule and are still trapped with Harley's sweat and lubrication. It is horrible and you suck for air desperately where the cap edges are able to get a clean breath thanks to your fingers providing the tiniest gap from being crushed between them. There is no way you will be able to get any recovery in this condition!<br>\r\n<br>\r\n     Batgirl puts the capsule back on her belt and uses a different one to spray some fresh water on her eyes and finally revs her motorcycle and hits the road again. Not much happens other than massive vibrations from the motorcycle further mixing in your prison and you can't see at all where you are being taken. After what feels like ages she finally arrives at her destination, Titan Tower. It is a huge T shaped building set on the outskirts of the city and is the Head Quarters for the Queen Titans, a band of young super heroes in their early to mid twenties (although some alien members are much older) With the current major members being Batgirl, Raven, Starfire, and Wondergirl though plenty of others join in from time to time.<br>\r\n<br>\r\n    Frustrated and tired she goes up the elevator to the common area. \"Hey Star how's it going?\" Starfire is sitting on the couch in her skimpy purple leotard and boots and responds happily \"Batgirl you are back!! I am good but Raven is still...\" A scary ROAR echoes from a nearby closed room which shakes the entire floor, Your eardrums feel like they are going to burst as Raven's scream rattles your head like a maraca. \"Well she is still in her... month time?\" Batgirl holds back a chuckle \"Not her time of the month but she sure does get scary when she needs to vent some emotions. Thanks for keeping an eye on her and the tower.\" Starfire nods \"And Wondergirl should be done training with her sister by tomorrow!\" Batgirl smiles\"That's a relief, the whole team should be back in action soon! I'll be out in a minute Star just gotta check on something in the lab.\" Starfire nods and then hides on the couch as another roar escapes Raven's room.<br>\r\n<br>\r\n Batgirl reaches the small lab room and picks up the capsule you're stuffed in and places it on the table ready to examine you.<br>\r\n</span></div></div>",
            "created":1479358800,
            "id":2238405,
            "title":"Queen Titans Tower"
        },
        "1312112111111211":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You get Starfire's attention",
                "You panic and run under the couch still unnoticed"
            ],
            "content":"<div class=\"\"><div> <span>     Just as she is about to open your capsule her bat alarm goes off signaling an emergency! \"Oh no what's happening now?\" she says as she rushes out to respond! \"Emergency! I've gotta head out again Star!\" She yells as she gets coordinates to the call and rushes to get her bike. \"Be careful Batgirl! Do not chew on more than you can bite!!\" Starfire yells back concerned.<br>\r\n<br>\r\n    Meanwhile you desperately try to take advantage of the situation to free yourself and try to wiggle your crushed fingers. Luckily one of them was mashed into the locking mechanism and with just a little more force you were able to pop the capsule open and spill out on the table. You gasp the fresh air and try to get moving. Your body isn't in great shape but was able to at least un-flatten mostly even while cramped up in the tube. Thankfully you are with heroes this time and should be able to get help! Excited at the thought of being able to get home and get proper rest you shimmy down the table leg and onto the floor. You are tiny soaked and freezing cold and dying to get out of the lab! You run right out the open door thanking the stars Batgirl was in a hurry! You are shivering as you reach the living room where Starfire is and quickly dash over to get her attention. Once you are about halfway there she gets up from the couch and walks over to ravens door knocking softly \"Raven are you feeling a little better, do you need anything?\" You keep racing towards Starfire nearly a foot away from her when Raven replies \"Leaaaave meeee ALOOOONE!!!\"  once again shaking the whole house and knocking you on your ass with terror! \"o..okay then sorry to be the bother!\" Starfire stammers as she backs away from the door. You get back on your feet intending to back away from it as well as you are so close you can see shadows flailing around beneath the door! <br>\r\n<br>\r\n</span></div></div>",
            "created":1479358800,
            "id":2238419,
            "title":"Roommate Drama"
        },
        "13121121111112111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You get left on the floor! (reserved)",
                "You are stuck to Starfire's ass"
            ],
            "content":"<div class=\"\"><div> <span>     You are about to run from the door when you hear \"EEEEEP a BUG!\" and you look up to see Starfire floating up and glowing green. You are no longer cold as the Tamaranian beauty fries you with burning green lasers from her palms burning you in a constant beam of energy. You are literally set on fire and drop and roll screaming as Starfire stares at the tiny green fireball writhing in pain. You are in agony desperate to roll the fire out as it burns your skin red like a cartoon. \"Oh no! How was the best way to stop a fire? Sit out the fire? Yes that's it!\" She floats in the air 'sitting' like she is going to meditate and hovers over you with her huge, mostly bare, orange ass. She simply stops floating and lets herself drop down on you with a loud THWOMP!!<br>\r\n<br>\r\n     All you can see is green fire as your poor body boils red in pain when suddenly you feel yourself CRUSH under immense weight as Star drops herself onto you. The fire is suffocated immediately but her squashing you and your now super sensitive charred skin feels a thousand times more pain being sat on. Starfire sits proudly seeing smoke coming out from under her meaning she snuffed out the flame but you still feel very hot under her ass cheek. \"Wait a second... I think the phrase is stomp out a fire? No sit it out makes more sense... but it's still hot down there. Oh I know\" she says confidently \"Its like this\" She then levitates about a foot off the ground leaving you charred and squashed on the floor for a second before she drops down again! THWOMP!!! THWOMP!! THWOMP!!! she hammers you again and again with her thick solid ass mashing every last cell of your body thinner than paper. If it was possible then even your soul was painfully crushed to pulp under her gorgeous orange ass cheeks. She finally drops down one more time and stays sitting on you with a huge smile on her face. \"Crisis averted!\" she cheers lifting her arms up happily.<br>\r\n<br>\r\n     Just then Raven yells \"ENOUGH!!!!!! SHUT UP!!!!\" as shadowy claws crawl out from under her door. Starfire's ass is only a few feet away from the door and she quickly screams with fright and flies away dodging the shadows as they rake the floor! </span></div></div>",
            "created":1479358800,
            "id":2238436,
            "title":"Pressure Cooking!"
        },
        "131211211111121111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Raven gets even more violent (reserved)",
                "Starfire Barges in thinking Raven is in trouble"
            ],
            "content":"<div class=\"\"><div> <span>      As Starfire flies away she leaves you smashed flat on the floor as a shadowy clawed hand rakes the floor scraping you into its grip as it slides back into Raven's room!!! You are beyond scared as you get pulled into a horrifying room filled with black flames and creepy shadows and Raven herself floating in the center of the room. She is is incredibly hot yet scary as she floats with glowing red eyes and a dark purple hooded cape flowing in the air. Other than the cape she was completely naked showing off her pale goddess like body. \"What is this!?\" she says through sharp smiling teeth. You are caught in a dark bubble and pulled to Raven's face. \"You are no bug!\" She shoves shadows down your mouth and forces your body to regain its shape, which does not feel good by any means. Even so you can't help but oogle her naked body. You feel something in your mind, hearing questions and almost as if the answers are being pulled out of them as Raven uses her telepathic powers. \"Oh you are going to do the job just fine\" She says with an evil smile as she pumps another shadow down your throat. You want to barf but instead you feel it head straight for your dick and it starts to force it to expand. You try to scream but Raven gags you with another shadow as your dick painfully swells into a boner but the size it would be if you grew back to normal!!!<br>\r\n<br>\r\n     \"Oh yessss!\" She says as she uses her powers to shoot you face up onto her bed and she floats over you with her legs spread wide open. You are horrified as shadows spread her ass cheeks wide open along with her pussy lips and she flies ass first down hard ramming onto you like a meteor!! Your dick gets swallowed whole into her extremely tight and wet pussy which clamps onto you with an insane grip while her asshole swallows your face and crushes your head when she clenches her ass cheeks together. The rest of your upper half is squashed beneath her ass cheeks and your legs are smashed under her pussy lips as like Starfire she starts to float up and SLAM down except this time your were getting the most violent fucking of your life. On top of the crushing pain your burns were still amplifying your sensitivity making it all the worse for you making you unable to even enjoy the sensation of the sex as she battered you again and again against her bed. <br>\r\n<br>\r\n    \"Ugghhhh too soft!! I need something HARDERRR!!!\" she yells as she floats off of you, your head and dick ripping out of her ass and pussy with an audible POP! She then levitates your body off her bed and smashes you into the hard ceiling. She floats upside down and lines up again ramming back onto you but this time there was no soft mattress to cushion her heaving pounds. Her pussy then grew sharp little shadow teeth to bite into your dick as she clenched it making you scream in pain, the only problem was you were still gagged from a shadow that grew into a dildo up her ass and kept growing the longer you screamed. \"OHHHHHH FUCK YESSSS\" She screamed as she pounded harder on you breaking your poor body even further if it was possible as the shadow grew and shrank in her ass with every scream you made!!</span></div></div>",
            "created":1479358800,
            "id":2238448,
            "title":"Sticking your Dick in Crazy"
        },
        "1312112111111211111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You wake up and soon have a visitor.",
                "You wake up on your own ready for a new day."
            ],
            "content":"<div class=\"\"><div> <span>      She continues battering you against the metal so hard that it starts getting dented in with each impact. Meanwhile Raven seems to be growing more and more insatiable as her pussy bites your dick harder further embedding the shadow teeth which pulled at you to go in deeper which started to stretch your torso and tug at your head which was still crushed tightly in her anus. You were in pure torture and agony and definitely unable to feel a single ounce of pleasure from this violent sex yet somehow Raven needed to make it worse for you. The more you were tortured the more sexual pleasure she got and she needed MORE.<br>\r\n<br>\r\n     She lets out another scream that shakes the room and flies back onto her, landing on her hands and knees like shes going to go doggy stile. You of course are still lodged deep in her ass and pussy which continue to play tug of war with your body and a massive gagging shadow keeps pulsing up her ass and back into your mouth. Then to your horror you feel her messing with your mind again. She temporarily forces your pain and pleasure sensors to scramble up making you insanely horny because of the horrible pain you were in and the hornier you got the more sensitive to pain you became. She licks her lips and gasps as she gets even more turned on from your sudden boost in torture.<br>\r\n<br>\r\n     Your sensitivity to EVERYTHING just escalated exponentially as Raven literally mind fucked you and your boner pulsed uncontrollably throbbing with ecstasy yet twitching in pain making you moan and scream at the same time sending a raging shadow from your mouth deep into her ass which she happily clenched in protest shoving it back down into you temporarily making your boner larger before clenching her pussy like a thorn filled vice sending the shadow right back out of your mouth again. She was moaning and even drooling a little as her pussy oozed and burned just right and her ass hurt the right amount when you filled it to spike some kinky pleasure for her. At this point everything was so overwhelming that you were about to cum like a waterfall but just as it was starting to leave your balls and travel up your dick Raven plugs your urethra with a shadow that doesn't let even a microscopic drop of cum escape. The sudden denial of release was unbearable and frustrating and painful yet it also did not let you loose your hornyness subjecting you to a whole new level of torture. This is what Raven was looking for. \"YES YES YEEEEESSSS!!!\" She screamed as she created a shadow hand to pull at your torso as she arched her back in doggy style which caused your dick to get dragged almost all the way out of her pussy against all those horrible sharp fangs only for the hand to shove you back in violently again and again. Meanwhile she summoned little shadow fangs in her anus to bite into your crushed head and pull you deeper up her ass to prevent you from getting pulled out as she used your lower half as a battering ram for her pussy. She timed your dick getting shoved in perfectly with her anus biting down on your head, shoving the scream shadow back down your throat and back into boosting your already swollen dick as it bursted into the tight fang filled vagina.<br>\r\n<br>\r\n     You felt like this was how it was all going to end, fucked to death by a sexy half demon girl super hero but mercy is not that kind to you. Instead Raven uses her powers to painfully twist your dick into a spiral to make it harder for her pussy to crush and also force the shadow up her ass constantly which she pulled deeper in with her muscles further sucking your face up her ass as she floated herself so that she can use her bedpost to ram her ass and pussy against and to further crush your poor spine. She needed just a little bit more but what else could she possibly do to you? She gasped as she figured it out. She created a portal to suck in your balls and created the exit portal in her mouth just between her molars which were sharper than normal in her current state. She bit down and started chewing like a ravenous wolf instantly mashing your poor balls like chewing gum making you scream the loudest you ever have before. So loud in even made the shadow vibrate insanely hard in her ass finally forcing her to climax. She screamed as she came so hard soaking your beaten body again and again as she had a chain reaction of orgasms which triggered her anus and pussy to chew on your more violently than ever as they quaked out of her. Only after she was completely done she turned the plug in your dick into a portal which teleported your cum into the nearby bathrooms toilet, she even flushed it with her powers.<br>\r\n<br>\r\n     Her muscles finally relaxed and she pulled the shadows out of you letting your poor dick wither back to its tiny size like a deflated ballon and shadows forced you out of her ass and pussy and dropped into the warm puddle left on her bed by her orgasm... Followed by her thick pale ass as she carelessly plopped down sitting on you and gasping for air as she was glistening with sweat and high off her ecstasy. She paid no mind as you were still being crushed under her ass cheek and drowning in her cum and sweat. In fact she even starting grinding her ass into the mattress to feel how soaked her orgasms made it. She sat like this for several minutes as her room became less dark and the shadow flames and claws slowly dissipated. She was more or less feeling back to normal again and so relieved and at peace.<br>\r\n<br>\r\n     Every gasp for air you maid only forced you to gulp down her fluids and imprisoned under the unrelenting weight beneath her ass as it simply grinded you back and forth as if you weren't smashed enough already. after what sees like forever she finally rolls her ass off of you and you are left gurgling in the puddle as she stares down at you looking like all the stress just melted away from her forever. \"That was the EXACT thing I needed... with all these super women around I'd be able to get that whenever I wanted if I was a damn lesbian...  if only it was that easy. Who knew a man like you actually existed.\" She plucks you out of the puddle and uses your smashed body as a rag to further wipe her pussy clean roughly stuffing you in and swirling you around. \"I know what I did was very un-hero like but I guess were even since you were sneaking around our hide-out naked like a little pervert\" You gurgle in her pussy in protest but she simply laughs \"I can read your mind remember? Just screwing with you\" she says as she flings you back out and onto the puddle. \"Anyways I am very grateful for your services but if you ever tell anyone what I just did to you...\" Her eyes glow red again \"I will shove you so far up my ASS you'll end up in another DIMENSION... understood?\" She reads your mind as you agree in terror, \"Good\" She then forces your address out of your mind \"I think it's best you go home now\" as she opens a portal that sucks you up and spits you out on the floor of your living room along with the sticky puddle she left behind further drenching you again. <br>\r\n<br>\r\n     You were finally safe... finally home. What an absolutely BRUTAL first outing. But you refuse to let it break your adventurers spirit even as you lie broken on the floor after being splattered, run over, treated like dirt, burned and smashed and out right torture fucked by a half demonic woman. It can only get better from here right? At least that is what you think. And at least the Villains you met don't know your address! One plus for today you think to yourself as you stare out the massive window that is your wall, still completely crushed in the puddle of course but the city lights shine brightly and then... other lights in the forest that grows up the foot of your mountain. You see Ivy's flowers glowing eerily in the darkness facing right at your window.... \"Oh no\" you groan in misery. You lay broken that night trying to rest. After many painful hours you are finally able to fall asleep and pass out healing for two straight days.</span></div></div>",
            "created":1479445200,
            "id":2238834,
            "title":"How to Please Raven"
        },
        "13121121111112111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Harley and Ivy",
                "Raven/Someone New/UPS/Anything Really"
            ],
            "content":"<div class=\"\"><div> <span>      After two days straight of being passed out you wake up still tiny and very sticky in a dried up \"puddle\" you groan in disgust as everything smells extra musky and you grow back to normal. Your legs are very shaky like jello but you manage to stumble into your bathroom and take a shower. You come out refreshed feeling a bit better and put on some comfortable clothes and immediately attack the kitchen. You were starving and ate nearly half the food in your house as your body was desperate for nutrients after the horrors you suffered. Finally satisfied you collapsed onto your couch into a three hour food coma. You didn't even dream at all it was just pure black bliss when suddenly there was loud knocking at your door. Your eyes widen \"Oh fuck oh fuck oh fuck\" you mutter under your breath as you approach the door and look at the peep hole to see...</span></div></div>",
            "created":1479445200,
            "id":2238838,
            "title":"Unexpected Visitor"
        },
        "131211211111121111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They want you to come back with them to discuss some arrangements (reserved)",
                "They want to check out your house/bother the hell out of you"
            ],
            "content":"<div class=\"\"><div> <span>      Your heart sinks as you see Harley Quinn and Poison Ivy standing at your front door. \"I know you're in there Dirt boy let us iiiiiin\" Harley sings loudly at the door \"You wouldn't keep us waiting would you?\" Ivy says as she kisses the peep hole leaving a streak of her red lipstick like poison. You of course don't want to anger these two and slowly unlock and open the door. Harley quickly bursts in hugging you tightly and kissing you all over your face \"Awwww he did miss us\" says singing/yelling in your ear before pushing you aside knocking you to the floor. \"How touching you really did learn from the lesson I gave you\" Ivy says with a smile as she steps on your crotch squishing your balls and dick under her barefoot as she wipes her right foot on them like a welcome mat that continues stepping onto your stomach and then smushing your face under her left foot as she wipes all up and down and across your poor face painfully and getting it dirty again after you just showered. Satisfied she steps down on your face again and finally walks off of you giving you a killer view of her pussy and ass barely contained by a thin vine 'thong' and the sweet nectary smell of her pussy gives you a hate filled boner even after being walked all over. \"So easy\" Ivy says as she wiggles her ass and Harley laughs loudly walking back over and crushing your boner under her boot twisting left and right as you scream in pain. \"Easy Harley we don't want to rough him too badly\" Harley steps off  and cheerfully says \"yet!\" with a bright smile.</span></div></div>",
            "created":1479445200,
            "id":2238843,
            "title":"Harley and Ivy's Friendly Visit"
        },
        "1312112111111211111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They make it back to the hideout",
                "They get interrupted by someone/something"
            ],
            "content":"<div class=\"\"><div> <span>     \"Now don't be so dramatic. get up\" Ivy says sternly. Not wanting to piss her off you quickly get to your feet and face her. Meanwhile Harley is wandering around your house opening whatever she wants and snooping around happily \"Nice place you got here\" She says as she opens the door to your room and walks in. <br>\r\n<br>\r\n     \"I noticed the other night you are pretty helpless. I mean Harley doesn't even have super powers and she was more than enough to take you down. Your little suit looked like it may have given you some gimmick but I was able to rip it to shreds pretty easily... pretty pathetic if you ask me.\" You are about to reply when she shushes you with her finger. \"Why don't you come back with us I think I have something that might interest you.\" You stammer out \"I don't know if that is such a good idea and I just got here you know? not sure if I'm cut out to be a villain.\"  Ivy rolls her eyes and then aggressively starts making out with you shoving her tongue into your mouth and pressing her body against yours instantly filling you with poison and turning you on. \"At least come see what we have to offer.\" Your mind says no but your mouth utters \"yes\" as her poison takes control. Inside you are filled with dread and fear. \"That's what I thought. Now shrink.\" You gulp nervously but instantly your powers trigger and you are back to being tiny right in front of her. On top of that you weren't wearing one of your suits so you were naked again. Harley comes back quickly and chants \"Oh now can I step on him?\" Ivy laughs \"There's no need for that Harley he listened to every word I said.\" Harley sighs \"Oh alriiiight.\" You notice she was also holding one of your stealth costumes messily rolled up and stuffed under her arm. <br>\r\n<br>\r\n     Ivy gently picks you up and holds you softly in her hand as the three of you head outside. You sadly give the command for your house to lock up and your automated system closes and arms the locks on all your doors and windows. \"Alright lets get this show on the road\" Harley says as she stuffs your costume into one of her motorcycle bags and mounts the bike. Ivy mounts herself on the back seat pressed up against Harley and says \"Only two seats Dirt but I'm sure we can make you fit on one of them\" She then grinds her ass on the seat slowly \"You'll be under my care\" She then lifts her ass a few inches and slams it back down loudly. \"No! that's ok I like it in your hand better!\" you reply. She laughs and says \"I thought as much but I've got a better idea.\" She then tosses you into her mouth and starts sucking on your like a lollipop as Harley revs the engine and speeds off.<br>\r\n<br>\r\n     The whole ride you are stuck in Ivy's mouth as she playfully bullies you with her tongue nearly drowning you in spit only to suck you down hard and repeating the process which also feels amazing on your boner. While she does mess with you by bringing you right onto her teeth and almost chewing you into gum she always stops as she feels her teeth gently press against you and then uses her tongue to pull you to safety. She is being oddly careful about not crushing you...<br>\r\n </span></div></div>",
            "created":1479704400,
            "id":2240081,
            "title":"Smooth Kidnapping"
        },
        "13121121111112111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They have a job for you now",
                "They let you leave but you will owe them one eventually"
            ],
            "content":"<div class=\"\"><div> <span>     As Ivy sucks you like a juicy candy you get more and more turned on and she clearly notices as her tongue starts focusing on your boner flicking it roughly and focusing on it as she sucks harder and harder. This is actually pretty nice, you think to yourself as this beautiful woman dominates you in her mouth without actually hurting you. Ivy then moans as she presses her tongue against you vibrating your entire body so perfectly. You feel like you are about to cum when suddenly Ivy's giant fingers plunge in and pluck you out of her hot sexy mouth. You now feel very cold as you are out in the open and drenched in her spit as she carries you deeper into their underground base. \"See Dirt I can be very sweet.\" She whispers to you making your dick twitch in excitement \"Just do as we say and we will be great friends\" You nod nervously and she smiles down at you seductively. She then holds you under a round plant shaped like a vase which sprays water down on you cleaning you of all the poisonous saliva on your body before she tosses you at Harley. \"Yeah we're not so bad Dirt\" Harley says as she catches you in her hands and starts blowing air at you roughly. You nearly get blown off her hand but at least you get dried up in the process.<br>\r\n<br>\r\n    Soon the women take you into a sort of lab deeper down in the tunnels. Harley sets you gently down on a couch as Ivy says \"Un-shrink\" You quickly listen and grow back to normal as Ivy was already plopping her ass down on you. \"That was close huh?\" Harley laughs as she roughly sat on your crotch just as you reached full size. She happily grinds your dick under her ass as Ivy pulls a large glass tube with metal caps at each end with a black goo floating inside. As she walks up to you Harley quickly gets off and out of the way as Ivy explains. \"We stole this prototype super suit from a terrible corporation that was polluting our poor forests before re razed it to the ground. Apparently they were able to bond dead cells of an alien symbiote to a Synthetic material. They were trying to see if they could make an artificial symbiote that would give the wearer Spider-Gwen's powers but they could never get it to copy her fully nor permanently bond to anyone. But I have a feeling your powers make you a perfect match. Your are rubbery and self regenerating like this thing is. I'd like to give it to you.\" <br>\r\n<br>\r\n     \"That's uh very kind but I don't think I want...\" She interrupts \"Take it\" the poison is still coursing through you and you reply \"Yes!\" making her smile. \"That's what I thought you'd say.\" You stare in horror as she gets right up to your face and opens the tube facing the blob right at you. You cringe expecting it to leap at you as you've heard of what true symbiotes can do. \"It's not alive Dirt you're going to have to pick it up. It won't even work properly unless your body absorbs it. Or at least that's what the file says.\" Reluctantly you reach in and grab it. It feels like a soft squishy sphere as it sits in your hand motionless as you ask Ivy \"Now what?\" She backs away slowly \"Eat it\" <br>\r\n<br>\r\n    You really don't want to but of course your hands force it right into your open mouth and the orb quickly turns into a thick liquid as soon as it makes contact with your tongue easily going down your throat. Ivy and Harley stare intently at you for several moments with nothing happening other than you staring back nervously. Then without warning you feel something spreading through you slowly feeling it across every inch of your body. The girls could see it was coursing through your veins \"Think of putting on your costume\" Ivy says excitedly. As soon as you do black ooze quickly and effortlessly seeps from your pores and forms a black suit with solid white eyes  and and spider symbol on your chest and back. It actually felt pretty incredible. You didn't feel any stronger but definitely a bit more flexible and agile. \"Try to climb a wall\" Harley says excitedly. You get up genuinely excited your self and sure enough you can climb up the wall with ease and even crawl along the ceiling!  \"Try to shoot webbing\" Ivy says and you quickly do the motion with your hand and while it isn't web a black stream of the suit itself shoots out and sticks to the wall. It refuses to separate from your wrist however but you are able to retract it back. \"Interesting. Not as versatile as her webbing but still useful for getting around or snatching things. Now come here and lift me up.\" You quickly drop down and happily scoop her up, excited because hey she is smoking hot but also because you may have super strength! You pick her up but she feels as heavy as you would expect but before you answer Harley leaps up onto Ivy knocking you onto the floor under the two women. <br>\r\n<br>\r\n    \"I guess no super strength\" Ivy says as she sits up rolling her ass onto your crotch while Harley is laying across her lap and face to face with you. Harley grabs onto your face feeling your mask and smiling \"I guess not but hey at least he got an upgrade.\" Ivy responds \"Yeah from dirt boy to bug man!\" The two women laugh obnoxiously with Harley being super loud right against your ear until finally they stand up off of you. <br>\r\n<br>\r\n     As you stand up Ivy says \"Well then we did something nice for you and so you are in our debt\"  </span></div></div>",
            "created":1479704400,
            "id":2240120,
            "title":"Synthetic Symbiote"
        },
        "131211211111121111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "the package is not powerful just something valuable",
                "the package is a powerful artifact/staff/weapon"
            ],
            "content":"<div class=\"\"><div> <span>     \"And have I got just the job for you!\" Harley says happily \"Don't worry though bug it's real easy\". You roll your eyes under the cover of your suit and sigh silently knowing it is never easy with these two. \"She's right and you'll be making one of our friends very happy. Well as happy as she gets I guess, she is a bit of a hot head.\" The three of you walk back out into the tunnels with you and Ivy heading to the motorcycle while Harley goes to her room to grab something.<br>\r\n<br>\r\n     Ivy sits on the back seat as she waits and you stand awkwardly beside her as she eyes you up and down. \"Can you still shrink?\" she asks and you curiously try. Without any problems you shrink down to a couple inches tall still wearing the suit perfectly fine. She stares down at you with a smile \"perfect!\" Just then Harley stomps in making you panic as she gets closer when suddenly you remember your upgrade!. You shoot a string of the suit onto the motorcycle seat and shoot yourself up to safety behind Ivy. \"Very nice\" Ivy says as she looks back at you. You then notice Ivy is holding a long metal spike with a huge diamond on top. \"I've been holding this for our friend for uhhh safe keeping you know? But seeing as were planning another job with her I'm sure she's gonna need this back\" Harley says as she looks around. \"Where did he go?\" <br>\r\n<br>\r\n      \"He's right here\" Ivy says as she reaches back and gently slaps you against her ass a few times, not enough to squish you but enough to beat you up a bit. \"I guess the new suit means he ain't afraid of your ass anymore\" she snickers. \"Oh no I still am!\" You reply nervously as you pull off from Ivy's ass. They both laugh and continue. \"Anyways we want you to give this back to her. She will be in a better mood and you two can start off on the right foot\" Ivy says. \"Or the left\" Replies Harley as they both crack up again. <br>\r\n<br>\r\nHarley straps the spiked diamond onto the bike before hopping on and starting the engine. You nervously grab on to Ivy's ass for support using your new powers to cling to it desperate to not fall off. Ivy notices but simply wiggles her hips to jiggle you around playfully. \"Maybe this won't be so bad\" you whisper to yourself as you get jiggled against her sexy green ass and the three of you ride on out back into the streets.</span></div></div>",
            "created":1479704400,
            "id":2240129,
            "title":"Your Turn"
        },
        "1312112111111211111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Harley and Ivy come after you to help",
                "You are left to figure out your own escape"
            ],
            "content":"<div class=\"\"><div> <span>     Now that you are all riding through the open streets Ivy reaches back and says \"Alright Bug use your powers now and follow us\" as she plucks you off her ass and tosses you into the air. You quickly grow back to normal and shoot out your inky 'webs' to swing across the city and follow the Girls down below. Ivy even points down at the package so you test your aim and fwiiip! you shoot a tether and grab the metal shaft then pull it back up to you. Your suit forms straps on your back to hold onto it for you as you continue to swing along happily<br>\r\n<br>\r\n    \"This is amazing!\" You yell out to nobody in particular as you happily dash and zip around the skyscrapers feeling more powerful than ever in your life! It also seemed like maybe Harley and Ivy were warming up to you! Your luck could be changing for the better after all. Soon you arrive to the outskirts of the city were it is almost as if all man-made structures have stopped and there is simply empty plains with a large round metallic structure looming ominously over the grass. \"Alright here we are\" Ivy says as they turn off the bike at the side of a dirt road by a small patch of forest. You have nowhere to swing from to get to the building so you have to go on foot from here on out. Harley instructs you \"Just press the button at the door and let her know that you've been keeping this safe for her. It'll be great she's gonna love you for it!\" She says warmly. \"Harley and I have some poor trees to mend here so we may as well kill two birds with one stone\" Ivy says as she gently press her hand to a tree that has seen better days and Harley starts taking jugs of water out from the motorcycle pouches. \"No problem I've got this!\" you say confidently and start a brisk job towards the building.<br>\r\n<br>\r\n     You feel more and more uneasy as you get closer to the building as you realize how massive it is. You thought you might have shrunk without knowing due to the scale of it but no it was just that big. You finally reached what you assumed was the front door and pressed the button. You waited for a few minutes when suddenly the metal door slid up revealing a very intimidating woman. She was gorgeous with a body like an amazon warrior and she must have been at least seven feet tall! She had long red hair and cold blue eyes and thick red lips. On top of that she was only wearing what appeared to be a skimpy leopard skin cloth that barely covered her massive tits and a leopard skin loin cloth that also poorly covered her pussy and for sure did not cover her gigantic ass. She wore gold jewelry on her wrists and ankles along with two golden earrings. She eyed the package angrily \"Give me that right now!\" she growled as she stepped forward. Afraid she might run you over you back up slowly and pull the package from the straps on your back. \"Here I've been keeping it safe for you!\" you say nervously. She snatches it from you and grabs you by the neck lifting you into the air effortlessly. \"Is that what you call stealing you  worthless piece of scum!\" She walks back to the door and gently places the package inside the building and shuts the door as she steps back outside. \"How dare you steal my favorite earring!!\" in your mind you yell \"Earring!? how the fuck is that an earring?\" but she is currently crushing your throat in her grip!<br>\r\n<br>\r\n     \"Let me show you just how grateful I am!!!\" She says as she drops you on the floor and she starts to look a whole lot bigger!! \"Was that enough to shrink me!? no way!\" you think to yourself in horror. It hurt but it wasn't that bad to have forced you to shrink! Then you suddenly wish that was what had happened. You realize this woman is now almost as tall the the building she came out of. You just pissed off a now 200 foot tall Giganta! You are horrified as she lifts her massive bare foot over you blocking out the sun and casting you in the most ominous shadow ever. You have nowhere to shoot your tethers and even if you had super speed you would not be able to outrun the sheer size and speed of her foot as she uses her super strength to STOMP down on you at breakneck speed!<br>\r\n<br>\r\n<br>\r\nBOOOOOOOOOOOOM!!!!!! The Earth quakes as she brings her foot down on you with full force breaking your body harder than anything ever has in your life and of course instantly triggering you to shrink! As if matters weren't horrible enough already you were now two inches tall being STOMPED on by a two hundred foot woman! Your new suit instantly exploded into a million pieces and you were also now completely naked yet again.<br>\r\n<br>\r\n<br>\r\nBOOOOOOOOOOOOOOM!!! another Earth shattering STOMP further annihilates you deeper into the crater left by her last STOMP.<br>\r\n<br>\r\nBOOOOOOOM BOOOOOOOOM BOOOOOOOM BOOOOOOOOM!!! She never relents as your body mashes like silly putty splattering beneath her heel then sole as she grinds you further into mush before STOMPING her heel down again.<br>\r\n<br>\r\nMeanwhile Harley and Ivy casually stroll through the forest giggling at the earthquakes as they heal and water the plants which shake precariously with every earthquake.<br>\r\n<br>\r\nGiganta does not stop for over fifteen agonizing minutes which feel like an eternity to you as your broken body keeps getting more and more plastered into a rubbery puddle. At this point you are practically meshed with the bottom of her heel, embedded into her skin along with tons of dirt and pulverized rocks mixed with her sweat. Also the more she broke you the more sensitive your body became to pain so your torture was escalated dramatically with each STOMP.<br>\r\n<br>\r\nGiganta finally felt satisfied and decided to go about her day unaware that you were now a teeny tiny speck of dirt she would continue to trample with each Earth crushing step.</span></div></div>",
            "created":1479704400,
            "id":2240136,
            "title":"Meet Giganta"
        },
        "13121121111112111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They take you back to your house (reserved)",
                "They take you back to their base/leave you here"
            ],
            "content":"<div class=\"\"><div> <span>     Giganta strolls casually through the plains seemingly having somewhere to go unaware and uncaring of your fate. You of course were stuck plastered to the bottom of her dirty heel as she trampled you endlessly for miles trudging through plains, pavement, even a swamp for a dozen or so steps unlocking previously unknown levels of agony for your fragile little body that took the full force and weight of this massive woman every time she stepped down on her right foot. You were so desperate to escape or pass out or ANYTHING to make this stop but there was no way you were going to be freed without help.<br>\r\n<br>\r\n     Speaking of help your 'partners' simply kept helping every last plant in the forest while Giganta strolled casually for miles and miles without a care in the world. Hours must have passed before they were finally content and got back on the motorcycle and followed the giant footprints left behind by the giant beauty. <br>\r\n<br>\r\n     As the girls finally started to catch up Giganta had reached a desolate mountainous region were she began to blow off some steam. The ground was now solid stone adding further torture as she STOMPED around smashing boulders under her feet or punching mountains causing huge shards of rocks to spill down causing massive destruction. She would stomp you onto the boulders until they were smashed to fine powder from her insane strength and weight! At this point you wish she could just end you like she does with the stones and just fade away into nothing but instead your body is painfully compressed thinner than the thinnest molecule and your seemingly endless pain sensors take on more and more without even a sign of you blacking out. Giganta is working up a huge sweat now too which drips down her body and makes huge puddles (to you) on the floor which she soon STOMPS you into drenching salty sweat into your already dirt and swamp encrusted body. She leaves massive craters and dirty black footprints in her wake but you still stay stuck to her like a poor tortured tattoo. She then starts dancing happily proud of her destruction and power feeling great after her workout. <br>\r\n<br>\r\n     By now Harley and Ivy have been caught up for a while but they do not dare approach Giganta as she dances. Ivy is more concerned of the poor grass and plants that Giganta has trampled as well but she will not dare get close and suffer the same fate. Harley of course wont approach either but is feeling relieved that you are taking the heat for the earring she stole. <br>\r\n<br>\r\n     After another agonizing eternity Giganta stops dancing and the girls get her attention by revving the motorcycle and honking the horn. Giganta smiles and walks over to them still remaining huge. \"Hello! it's been a while since we've talked. Afraid to do another job with me?\" She says half joking. \"Actually we were so impressed that want to team up with you again soon. Just working out the tiny details\" Ivy says with a smirk. \"Hey there big red! I love your earrings!\" Harley says pointing up to the massive gold studs in Gigantas ears. \"I have these Diamond ones that are even more incredible\" Giganta brags. \"Anyways\" interrupts Ivy \"I hear from the plants that something that belongs to me is stuck to your right foot. I need it back please.\" Giganta laughs \"Whatever it is it's been crushed to dust I promise you.\" Ivy smiles \"Not exactly he is more resilient than even I thought.\" Giganta laughs even harder \"You mean that pathetic thief in the black suit!? Should have kept a better eye on him he must be a puddle of bloody paste back at the Legion of Doom HQ.\" Harley quickly adds \"Red's plants are never wrong Big Red! We recruited the sneaky bastard but made sure he returned your earring first!\" She then laughs nervously.<br>\r\n<br>\r\n     \"Whatever you say ladies but I doubt he's here or alive\" Giganta says as she lifts her dirty right foot over Ivy and Harley! Harley quickly bolts away but Ivy stands her ground though even she is sweating nervously as she is now face to foot with a giantess! \"Your feet are very dirty I can't see much of anything\" She says while holding her nose from the musky sweaty stench. \"Really? This isn't a joke?\" she laughs \"Ok then.\" She walks over to a weak creek that runs through the arid mountains and Roughly STOMPS her foot into it Scrubbing her foot roughly along the jagged rocks at the bottom of the creek which went from crystal clear water to pure black dirty mud and grime that slowly oozed along downstream. You were nearly washed away in the gunk but you were the first thing that she trampled and were gonna be the last thing to get scraped off. Ivy and Harley winced at the sight and smell of the swampy mess Giganta made of the creek and decided if you were in there you were on your own.  But then Giganta stepped on a huge dry flat boulder and dragged her foot roughly across it massaging her foot and drying it off. \"Ooooh that feels good!\" she coos as she digs her heel onto the boulder twisting and mashing you so horribly against it but finally ripping you off violently from the bottom of her foot. \"Well if that didn't do it nothing will\" Giganta says as she shrugs her shoulders and walks away.<br>\r\n<br>\r\n      They of course check the wet boulder first not wanting to go anywhere near the nasty mess she made of the poor creek and soon find you! Your poor naked body is smashed like paste and smeared along the rock as a tiny flat streak with every single cell in your body screaming in horrible agony and you still smell like dirty smelly feet which is all you can breath and her sweat is seeped into every bit of your pathetic body like a sponge. \"Wow he might actually be dead this time\" Ivy says sounding disappointed while Harley looks almost teary eyed \"Awww I didn't even get to play with the little dirt bug\" But Ivy summons some roots to check your vitals and sure enough you are alive!!!! and on top of that they inform Ivy that synthetic cells are also multiplying in your body meaning your suit is healing!!!</span></div></div>",
            "created":1479704400,
            "id":2240148,
            "title":"Tiny man vs Giant Woman"
        },
        "131211211111121111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They are going to stay with you until you fully recover",
                "They are just about to leave back to their HQ"
            ],
            "content":"<div class=\"\"><div> <span>     \"Incredible\" Ivy gasps happily \"He's alive! Didn't even lose consciousness, the poor thing. The experiment was a success too his body is even regenerating the suit this is perfect!\" Harley Smiles and says \"Dirt Bug I'm so happy you made it! You smell god awful though\"  You wish you could give her a piece of your mind but given your current shape of a splat embedded into a boulder you can only stare back in agony. \"He is going to need much more time to recover fully from this\" Says Ivy. <br>\r\n<br>\r\n     \"You fucking think!?\" you scream in your head. You have never been broken down into such agonizingly horrible shape. \"Let's get going\" Ivy says as her roots start to pull on you gently at first but soon have to use force due to how badly Giganta plastered you into the rock. The roots dig in painfully and rip you off slowly and steadily adding to your torture. Ivy then gently picks you up once you are fully dislodged and places you in one of the pouches of the motorcycle. \"Just rest now Dirt Bug we will take good care of you\" she says as she blows you a kiss and Ivy gives you the happiest smile and wink before they mount the bike and ride on back to your house.<br>\r\n<br>\r\n     The ride is pretty uneventful though it does hurt when they ride over a bump causing you to jostle around in the bag though it is nothing compared to what you have suffered through. It feels like a couple hours have passed when finally they reach your house. Ivy gently pulls you out and holds you in her open palm as she reaches towards your door. Your security system scans your poor body and disarms the house unlocking the front door letting your two sexy keepers just walk right in. Ivy places you on your glass table in front of your couch which feels so soothing as the cold glass makes contact with your back. You stare up helplessly as Ivy plops her ass on the couch and says \"Oh man I'm beat what a long day!\" You roll your eyes and glare furiously. She slips off her boots tossing them to the side as Ivy goes through your kitchen. Harley then kicks up her feet which are now only covered in fishnet stockings as she rests on down on each side of you nearly crushing you under her heel!!! You are in a panic as you can feel the heat off her sweaty feet and the familiar smell overcomes your senses making you NEED to move! Harley then turns on the TV and starts flipping through channels STOMPING her feet on the table getting closer and closer to you as she laughs hysterically at some cheesy joke in a commercial. Her fishnet clad foot presses down on the edge just under your location and you can see her toe nails painted one black the next red then black and so on. If she moves again you fear she is going to land on you next!</span></div></div>",
            "created":1480050000,
            "id":2241681,
            "title":"Escorted Home"
        },
        "1312112111111211111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They let you heal... for the most part",
                "Ivy wants to test you further"
            ],
            "content":"<div class=\"\"><div> <span>     While you are currently in fear of the blissfully unaware Harley Ivy is in your kitchen happily pulling out an apple from the fridge and biting into it. \"Mmmm Perfect\" she says as she munches down on it happily. Eventually opening your window when she gets to the core and she flings the seeds into the yard and uses her powers to make them root into the ground and form a tiny sprout. She smiles as she picks another apple out and starts walking back to the living room.<br>\r\n<br>\r\n     By now your body is in such a panic and full of adrenaline with the fear of being stomped on that the suit reacts! It oozed from your pores and wraps around you tightly actually scooping your flattened puddle of a body and forcing it back into shape. It is extremely painful as your bones are forced hard back into place and your body is molded back into its correct shape but it allows you to move! If the suit were to weaken though you are sure you will fall right back into a putty like mess as it hasn't actually healed yet. Regardless you can now struggle enough to stand and hobble away just as Harley moves her foot again, her heel landing right were you were laying. You take a few more agonizing steps away from her foot and then collapse back onto your back only to see Ivy's huge thong clad ass coming down as she sits on the table happily and completely unaware that she just squished you painfully under her right ass cheek.<br>\r\n<br>\r\n     \"Here you go Harley\" she says as she tosses her the apple. \"Thanks red!\" she replies as she happily chomps down on it. Ivy seems to be in a good mood shifting left and right and grinding her ass on the glass painfully smearing you beneath her as she dances in place to a music video on the TV. After the song is over she asks \"So how is our little pancake doing?\" Harley shrugs her shoulders \"I thought you had him.\" Ivy looks down at the table. \"I set him down right here, maybe he's under your feet or got kicked off the table?\" Harley quickly lifts her feet and checks the table finding no sign of you. She then gets down on all fours and checks beneath the table. \"You don't think he could have moved already do ya red?\" Harley asks as she can't find you and then looks up at Ivy while still crouched under the table. \"I highly doubt that you saw how badly Giganta smashed him\" Ivy replies now grinding her hips to a different song that is playing while Harley tries so hard not to laugh as she watches your poor body completely squished and getting smeared painfully left and right as Ivy's huge ass cheek bulldozes over you effortlessly mushing your body further. Harley soon can't take it anymore and starts laughing. Ivy stares down at her through the table confused but smiling.<br>\r\n<br>\r\n     \"What's so funny?\" But Harley just laughs harder as Ivy gets frustrated and bounces her ass on the table splattering you loudly beneath her. Harley is in tears hearing the pathetic squish sound your body made and seeing it splattered back into the shape Giganta had put you in as your still weakened suit gives up and retreats back into your body. Ivy also heard the pathetic squeltch beneath her ass and laughed to herself before standing up with you plastered to her right ass cheek like a sticker. \"Now how are you supposed to heal down..?\" She is surprised as she looks at the empty table only seeing Harley laughing under it and pointing at Ivy's hip. Ivy cranes her neck but can't see you stuck to the underside of her huge round ass cheek so she roughly feels along with her finger nails and painfully scrapes you off with a few scratches. <br>\r\n<br>\r\n    Still laughing lightly Ivy asks \"Now how the hell did you manage to move? I remember placing you towards the middle.\" You are unable to reply but between fits of giggles Harley says \"Ha ha ha I saw him squished under your ass HA HA with the black suit on. I guess he was able to move with it a little or something. He was like normal shape but flat too until you wiggled and bounced on him. Boy you got off on the wrong foot with Giganta and under the wrong end of Red huh?\" She laughs even harder now ringing your ears painfully. \"Incredible!\" says Ivy, the scientist side of her absolutely fascinated by what is happening with you and the synthetic symbiote. </span></div></div>",
            "created":1480050000,
            "id":2241692,
            "title":"New Room Mates"
        },
        "13121121111112111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "With Harley and Ivy at the house",
                "Alone at the moment"
            ],
            "content":"<div class=\"\"><div> <span>     \"We will be staying with you Dirt Bug. I know Harley is very concerned about you and I need to make sure you heal up safely so try not wind up under my ass ok?\" she says with a chuckle. \"Now lets get you washed up you smell like feet and mud\" You lay in her hand as she walks to the sink and starts washing you gently in her hands massaging your putty like form with her fingers and getting you soapy and clean. It hurts a lot but actually feels good at the same time like a rough deep tissue massage. She then dries you off with a paper towel and tries to get you to eat. She bites into a soft sweet pear and then brings it down to your face with the soft white insides exposed. You of course can't do anything yet but you are so hungry... Your are able to concentrate hard and force the suit to emerge and squeeze you back into shape leaving an opening for your mouth and painfully you bite a tiny piece of pear. Ivy lights up happily \"There we go perfect!\" She seemed amazed her experiment worked but also genuinely happy to be helping you heal. By now Harley is watching you eat and says \"Awww how cute, the poor little guy.\" You can painfully sit up and attack the pear like a starving man as Ivy sets you on the counter next to it and the two women leave you in peace. Given your tiny size you manage to gobble down a surprising chunk of the fruit before finally passing out. <br>\r\n<br>\r\n    You are out for a solid two days which Ivy and Harley take surprisingly good care of you. They squish bits of fruit between their fingers and over your mouth letting the juices drip down as you gulp in your sleep. They leave you in safe places whenever they go out for fun or villainous activities and your body is able to make some progress. When you finally wake up your body is no longer a puddle but it is still extremely tender and squishy. You still can't move yet on your own but you will the suit to come out and cover your naked body. You can now move with its help though it still hurts a bit. You notice you are on your pillow with Harley laying on your bed in skimpy underwear. \"Well hello there!\" She says excited to see you awake and standing. \"You looked so cute passed out I just wanted to eat you up!\" she says playfully biting the air right before you flashing her pearly white teeth. You flinch and fall on your ass in surprise as she giggles. \"Don't worry I'm not gonna eat you sweet heart.\" She then gives you a fully body kiss with her juicy lips lightly pressing you into the pillow. \"I'm gonna take good care of you!\" to your surprise she scoots your feet with her tongue ans starts sucking you into her mouth until your lower half is fully inside being molested by her tongue with your upper half sticking out precariously from her lips. You didn't think she meant that kind of care too! Not surprisingly you soon have a raging boner and allow the suit to mostly recede into your body so you can feel her hot slimy tongue gently lick and press against your balls and dick. You gasp in bliss feeling extra good right now considering how much you have suffered lately.<br>\r\n<br>\r\n   You feel Harley smile when you gasp and moan and she starts sucking harder and harder nearly pulling you all the way in then pushing you out by mashing her tongue against your crotch just right before sucking you in again. You are so turned on right now with your raging boner pulsing and twitching as it gets dominated by Harley's tongue and sucked on like a giant vacuum. You almost feel like you will pass out with pleasure when suddenly Ivy walks in through the door. \"He's awake?\" she asks happily and Harley says \"Mmmm Hmmm\" with you tightly gripped by her lips sending fantastic vibrations down your dick and spine. \"Perfect\" Ivy says as she spots you and eagerly gets into bed mounting Ivy. \"Release is also part of a healthy recovery\" Ivy says before opening her mouth and locking lips with Harley, sucking your upper body into her poison filled maw. Ivy happily sucks on your head and chest nearly gagging you with her tongue but her poisonous saliva makes everything she does just turn you on more. They moan and fight over your body with powerful sucks playing tug of war on you with their sexy mouths desperate to please you. You felt like you were in a warm wet heaven as Harley sucked you so hard nearly pulling you fully into her mouth and ripping every drop of semen from your dick only to have Ivy do the same and pull you nearly entirely into her poisonous sexy cave. At this point your boner popped out from Harley's mouth and stuck straight up between their lips. It got squished between the soft sexy lips of these two gorgeous women so perfectly as the made out even harder. Harley vigorously started mashing your balls with her tongue  frustrated that your dick escaped while Ivy desperately tried to get in in her mouth squishing your boner against the front of your waist under her upper lip only to have it flick back up when her mouth opens slamming into the front of Harley's upper lip and then getting squished between both of them as their mouth collided violently sucking at you. This went on for about an hour when finally your body couldn't take it anymore and the two women felt a tiny squirt which they hungrily lapped up with their tongues to clean their lips as you passed out in pure pleasure.<br>\r\n<br>\r\n   Another few days pass and you wake up..</span></div></div>",
            "created":1480050000,
            "id":2241704,
            "title":"Painfully Slow Recovery"
        },
        "131211211111121111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "They finally let you recover fully",
                "They want to keep messing with you"
            ],
            "content":"<div class=\"\"><div> <span>     You woke up feeling so good after your last experience but another few days have passed! You are able to move without the suit but it is far from perfect. Your muscles still feel shaky making you very unstable when you try to stand. You are in much better shape and feel like you will be fully healed in no time at this point! You then realize you are wet with a warm familiar substance. \"I thought I felt you stirring, so glad you are awake!\" You realize you are on your bed standing up and staring right at Poison Ivy's pussy as she lays on her stomach with her legs wide open. \"On your knees\" She commands and you now know that warm liquid you are soaked in is her saliva because you instantly bow down with your face nearly touching her sweet nectar scented pussy. You are instantly turned on and desperate to crawl right up her vagina as her scent intoxicates you with venomous lust. \"Ah ah ah. You are still Dirt Bug. Just barely above your last rank but still only fit to be ground into the earth beneath me. I want you to lick as if you have earned it though. All. Night. Long\" You instantly start licking the air, your tongue insanely close to her juicy pussy you can almost taste it with how strong her scent wafts before you.<br>\r\n<br>\r\n  Your tongue never makes contact though. You  are stuck on your hands and knees, freezing as her saliva cools on you  and licking just before while having a raging boner as she blissfully falls asleep content with your current torture. You are trapped like this for several hours even cumming a few times into the mattress from how insanely turned on you are only to have your boner reset almost instantly. It was mental and physical sexual torture for you as your tongue felt so dry exposed to the air and so desperate for a drop from her nectar filled pussy while your boner ached in exhaustion yet kept getting hard.<br>\r\n<br>\r\n   After about halfway through the night Harley walks into the room after having passed out on the couch watching TV and sees your current position! \"You have definitely not earned that you little shit!\" she whispers angrily at you. Your body is still bound by her poison to continue your torture but to Harley it looks like you are ignoring her. \"You are going to ignore ME!? I don't fucking think so!\" She whispers again as she carefully crawls into bed behind you not wanting to wake Ivy. She lowers her face right behind you and opens her mouth wide. You nearly tear up with fear as you feel her hot angry breath behind you and her wet tongue scoops under you and pulls you into her mouth! She angrily starts chewing your poor body between her teeth mashing you into her molars like a piece of gum painfully crushing and gnashing your body and annihilating your cursed boner which quickly pops back into shape between chews only to get smashed again! Finally after an agonizing minute or so of this she reaches in and pries you from her teeth squishing you with her fingers and slowly bringing you down to Ivy's massive ass! She gently spreads her cheeks and pokes you against Ivy's tight ass hole. You try to plea for mercy and explain but only tiny mumbles escape as Harley's finger squishes you into Ivy's anus which happily springs to life and starts chewing and pulling you in. Ivy moans in her sleep and clenches her ass just as Harley pulls her finger away. Her anal muscles CRUSH your gum like body at the center of her ring crushing every bit of you against her puckered muscular skin which tastes bitter with a hint of sweetness, like cranberry juice. Your body is so awkwardly mushed and crammed in there that each clench completely crushes your body perfectly flat that it nearly disappears when her anus squeezes. Only the tip of your regenerating boner can be seen when it chews down on your body. <br>\r\n<br>\r\n    Meanwhile Harley starts eating Ivy out happily moaning and sucking in her nectar like fluid driving her wild with pleasure. This makes Ivy excited and slowly she starts to wake up gushing more juice into Harley's mouth and squeezing her ass far tighter than before as she feels a wonderful sensation up her ass. This mighty clench crushes a climax out of you with your poor boner sending a weak squirt of cum out from Ivy's ass and it splashes right onto Harley's nectar filled tongue which eagerly sucks it all in and she swallows happily. Your body is still infected by the poison however so you are perpetually licking her anal muscles tasting that tart cranberry flavor while your dick regenerates another tortured boner as her ass violently mashed your body to pulp, which ironically your entire body only wishes to please her at the moment despite the horrible pain. Ivy seems to have forgotten about you as she fully awakens and flips over further crushing you with her compressed ass cheeks and anus as she gets Harley to turn around and they 69 each other. This adds more agonizing pressure on your poor body and it is so much that you can no longer cum adding that to your list of torture as your dick desperately trying to unload! The only silver lining your toxin filled brain can see is that now Ivy's nectar is trickling down from her pussy and will soon be trailing into her ass crack right to you. You can smell the sweet nectar about to reach you when Harley's tongue suddenly squeezes in and licks it all up leaving only salty sweat to accumulate in the rising heat which your poisoned tongue licks up without a choice.<br>\r\n<br>\r\n     After an agonizing three hours the girls have had several climaxes which Harley made sure to lick every last drop of leaving you to drown in sweat and crushed in your bitter tasting prison for what feels like eternity. Finally they lay in bed sweaty and exhausted when Ivy says \"That was incredible!\" she gasps with pleasure \"what did you do with the bug?\" she finally remembers you. Harley proudly responds \"I found the little fuck trying to eat you out! I knew he hadn't earned that yet so I chewed the sucker up like gum and shoved him up your ass so he can learn his place.\" Ivy giggled as she clenched her ass HARD several times in a row. \"So that's what I've been feeling down there. I actually made him do that Harley his tongue was just out of reach from my pussy. Just wanted to mess with the poor thing\" Harley Blushes with embarrassment \"Oh! Shit... I didn't know that..\" Ivy smiles \"That's alright he felt good down there besides it's not like he hasn't been through worse. We should cut him some slack though\" she says as she fingers her anus trying to feel you but your body is so smashed and lodged into her skin all she does is claw at your boner with her finger nail which hurts horribly and still won't let it cum. She then gets an idea and gets on her hands and knees aiming her ass at the wall. She smirks as her stomach rumbles and she lets out a quick but loud fart shooting you out like a cannon ball and splattering you onto the wall!! You are flattened and stuck to the wall from a mixture of sweat and anal 'cranberry juice' but luckily her fart literally smelled like flowers and sweet fresh fruits. You were splattered upside down with your back against the wall and your boner being the only thing inflated and pointing at Ivy as she gets out of bed. You are about crotch level with her staring at her pussy as she slowly fingers herself right in front of her face and brings her wet finger right up to your mouth just out of reach of your licking tongue. She laughs quietly then turns around waving her gigantic ass and pussy at your body and twerks before you sending her heaving ass cheeks clapping together and revealing her anus when they separate for a split second while her pussy splashes drops seemingly everywhere but on you. You stare in torture at this incredibly sexy and scary sight as your penis begs for release nearly exploding when one ass cheek brushes against it violently. It is enough to trigger your orgasm as she lines up one meaty ass cheek with your body and RAMS it back hard SMASHING you against the wall just as a squirt of cum shoots up narrowly escaping the impact of her ass against the wall leaving you to take the full force and splatter violently against her. She sighs happily and leaves you flattened and practically glued to the wall as she happily gets back into bed with Harley fooling around a bit before they pass out peacefully.  </span></div></div>",
            "created":1480050000,
            "id":2241730,
            "title":"Plugged into a 69 Session"
        },
        "1312112111111211111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You get to explore again after a few days",
                "Someone interrupts your peace"
            ],
            "content":"<div class=\"\"><div> <span>     You spend the next four days stuck to that wall. Sometimes you are passed out, sometimes you are being fed by one of the girls and sometimes you are getting a giant blowjob from either one of them when they feel bored and want to mess with you. Meanwhile you are trapped and forced to watch them eat your food, fool around on your bed and they steal whatever they want taking it right in front of you and packing it into their motorcycle. Harley will even perk her ass up against you sometimes forcing you to eat her out while she squishes your dick between her ass cheeks to get some action. You are basically a sex slave that is decoration on the wall for them to use at their leisure until finally you feel fully healed!. You trigger your power to grow and sure enough you break free from the wall and flip awkwardly landing on the floor on all fours. The girls hear the sudden commotion and rush in excitedly \"Finally!\" they both chant happily as Harley helps you up and shoves you onto your bed. Ivy lifts her foot up and slams it onto your genitals crushing them painfully as she twists them beneath her sole. \"Alright Dirt Bug now that you are fully healed up you will be expected to work when we need you got it!?\" Ivy says stomping down again for emphasis making you scream. \"Yes! I understand!!\" you scream out as Ivy smiles \"Good!\" she cheerfully takes her foot off your poor crotch and signals for Harley. \"Enjoy some time off for now but you better come crawling when we come calling\" Harley sings  as she follows Ivy. They finally leave and you are left alone in your house in peace...</span></div></div>",
            "created":1480050000,
            "id":2241735,
            "title":"Home Alone at Last"
        },
        "13121121111112111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Storm's school for gifted individuals, X-Women HQ (reserved)",
                "Queen Titans Tower / Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>     You relax and recoup for about two days. You clean up and try to wrap your head around your new situation and wonder what you should do... Go to the police? Maybe seek a hero? Then again you are afraid of what might happen to you if Ivy and Harley find out.. You decide to suit up and explore again to see where the city takes you and you can decide then. You trigger your bio suit to emerge and cover you up early in the morning just wishing for a normal peaceful day. Your suit reacts and changes to look like normal clothes! Amazed you jump up and look at yourself in the mirror morphing the suit into whatever you want! \"Awesome!\" you exclaim out loud and quickly head out onto the balcony. You morph it to look like its sleek black super look and swing down the mountain through the forests and into the city finding an empty alley to land in and morph into normal looking clothes. You stroll along the busy city surrounded by normal people and feel like you are safe and 'invisible' for the moment. Unfortunately for you it was not going to be a normal day. A familiar black portal spawned by Raven opened up beneath you and sucked you in Teleporting you to...<br>\r\n<br>\r\n     </span></div></div>",
            "created":1480050000,
            "id":2241744,
            "title":"A Normal Day?"
        },
        "131211211111121111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "The X-Women are attacked! (reserved)",
                "You are given a tour and meet more X-women"
            ],
            "content":"<div class=\"\"><div> <span>     Raven's portal spat you out in front of an enormous mansion, the headquarters of the famous X-Women! You are in awe at the massive building and also in shock at how you got there as you hear Raven behind you. \"Hello again! Allen right?\" You turned around to see her cloaked and floating before you. \"Y-yes nice to umm see you again\" She smiles and whispers \"Sorry again about before. Thanks for not telling anyone\" you can feel her scanning your mind as she said this. \"Ouch rough couple of days huh?\" You were terrified as you realized what just happened. \"Yeah it was but I've got it under control please don't tell anyone I need to figure out what to do you know?\" She laughs \"You DEFINITELY need some help with that but hey you kept my secret so I'll keep yours. I actually wanted to bring you here before because these women are fellow mutants like yourself. I know they would love to meet you. Now that I also know what you've been through I think you should ask them for help but again it is your call.\"<br>\r\n<br>\r\n     \"I definitely want to meet them but please don't mention the other stuff\" you reply. She nods and smiles \"Ok stubborn man but you are playing with fire.\" She telepathically talks to someone in the mansion and soon the massive doors open and Storm herself steps out. <br>\r\n<br>\r\n     \"Is it true? A male super? And a mutant no less?\" She asks and Raven nods \"I found him under some pressing circumstances and he really helped me out. I thought it would be great for him to meet you.\" Storm floats over to you and grabs your face gently examining you. \"Thank you Raven! This is incredible!\" Storm says in excitement. Suddenly Raven's Titan Alarm starts beeping \"Well I've got a call from the Titans, see you around!\" she says as she portals herself away.<br>\r\n<br>\r\n    \"What is your name young man?\" Storm asks as she flies around examining you. \"Allen\" You say somewhat worried \"And your powers?\" You hesitate but decide it is OK to tell her... \"From what I've learned so far I am indestructible and can shrink...\" Storm is increasingly excited \"Can you demonstrate please?\" You shake your head \"I'd really rather not as you can imagine it leaves me pretty vulnerable.\" Storm nods \"I understand, I do have someone who could demonstrate for you though, would that be OK?\" You are somewhat intrigued by this and say \"Sure that should be fine.\"<br>\r\n<br>\r\n    Soon enough Rogue is called down by storm and is given the good news \"This is awesome!\" she says as she hugs you tightly and nearly sings with her southern accent \"I had no idea we would ever find a guy mutant this is so cool! You sure you don't mind if I copy your powers for a second it might sting for moment?\" You nod as she still has you in a tight hug with surprising strength. She takes off her glove and gently touches your face. <br>\r\n<br>\r\n    Sting was an understatement, It burnt and sent a jolt to your brain instantly forcing you to shrink. Rogue also triggered your power from the sudden jolt and was forced to shrink too. Due to the reaction she didn't absorb any memories just your power and the jolt of pain as you both lay shrunken on the floor. You instantly panic and try to regrow but it seems Rogues touch temporarily damaged you enough to prevent you from growing for some time!</span></div></div>",
            "created":1480050000,
            "id":2241755,
            "title":"The X-Women Mansion"
        },
        "1312112111111211111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You stay stuck to her foot!",
                "You get left in the dirt"
            ],
            "content":"<div class=\"\"><div> <span>     You shake off the pain and morph your suit into its costume mode and flip onto your feet not wanting to end up under anyone else's! You see Rogue sitting up rubbing her head and completely naked from the ordeal! Her suit is not made with your powers in mind! You try not to stare too long at the smoking hot southern bell but reach out trying to help her. <br>\r\n<br>\r\n     \"Oh my! Are you both alright?\" says a concerned storm as she squats down to look at the two of you. \"I'm fine\" says Rogue as she takes your hand and pulls herself up. Even though you are wearing the suit it is bonded to your cells so it is almost as if she touched your bare skin sending a shockwave of paralyzingpain through you as your hands touched though she didn't seem to notice. <br>\r\n<br>\r\n     Just before storm can pick you two up something jets out of the sky heading straight for the mansion! \"A sentinel!?\" yells storm as she quickly bursts into the air and starts summoning a thunderstorm while an alarm wails throughout the mansion! Dozens of beautiful women evacuate from the building with a few donning their super hero costumes and joining Storm in defending the mansion.<br>\r\n <br>\r\n     \"Come on sugar!\" Rogue yells as she grabs your hand surging pain through you again accidentally as she uses her permanently absorbed super strength and flight to scoop you up as if you were lighter than air and soaring out of the way of the stampede of frightened mutants. \"How long until I can get back to normal hun?\" she asks eagerly as she lands with you in some bushes. \"As soon as you are fully recovered you should be able to grow but don't take any strong hi-\" You get cut off as she quickly grows to normal height nearly crushing you by mistake and yells \"No worries sugar I'll come back for you!\" before the naked beauty flies high into the air punching the massive Sentinel Robot, denting it's face while Storm hurls a lightning strike into its back sending it crashing to the floor. You watch in awe as a young woman with long black hair unsheathes metal claws between her knuckles and feet before running in and slashing huge cuts into the ankles of the Sentinel as it tries to stand. Another woman with pink sunglasses and a yellow trench coat shoots sparks at it's  knees which explode like fireworks! <br>\r\n<br>\r\n   Unfortunately in the messy fight Rogue gets hit by the massive robot sending her flying and shrinking back towards you! She crashes roughly into the grass and you quickly jump off the bushes and run as fast as possible towards her wanting to help! Before you can make it to her you realize there is a hooded woman sprinting out of the trees heading straight for the open mansion! \"Oh crap oh crap!\" you yell as you try to get out of her way but she quickly runs you over flattening you under her boot and leaving you squished in the grass as she dashes into the building. Aside from the horrible pain of being stepped on yet again you wonder why she looked just like Storm you only caught a glimpse of her face under the hood but you were certain of it. That was impossible you thought as you looked up still seeing storm in the air dealing the final deathblow of surging thunderbolts into the annihilated Sentinel. \"Everyone get back inside!\" yells storm as she circles the perimeter looking for more possible threats from the air. <br>\r\n<br>\r\n     You were just able to start moving again and desperate to get to rogue to tell her what you saw but you are right near the entrance of the mansion! You are in the way of dozens of frightened young super women who frantically stampede towards you! You feel the earth shaking as they get closer and closer and all you can do is hobble clumsily! The last thing you see before they approach is Rogue shooting into the air to safety and then the bottom of a shoe! then another and another as the mob of women TRAMPLE over you squashing you over and over again into the dirt painfully reminding you of the title Ivy gave you. When they finally pass and leave you mashed in a mess of flattened grass and footprints you groan pitifully but still want to warn someone of what happened! Then you see Rogue high above you! she looks like she will land right by you and she will be sure to notice you! That was exactly what would have happened except as she floated down she was finally able to grow again and popped to her full size before landing roughly right on your poor body that quietly squished under her sole!<br>\r\n<br>\r\n     \"Damn! who could have done this\" she said as she STOMPED down in frustration of course using the foot you were under. The ground quaked under the force of her super strength as you splattered under her might in agony. \"Alright nobody panic just get into the common area!\" she said as she quickly ran into action into the Mansion to help keep everyone safe!</span></div></div>",
            "created":1480309200,
            "id":2243295,
            "title":"Busy First Day"
        },
        "13121121111112111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "The intruder finds Rogue",
                "Storm finds the intruder or the intruder escaped"
            ],
            "content":"<div class=\"\"><div> <span>     The super STOMP left you plastered to Rogues sole as she quickly ran into the building further squishing you against her foot with every step! She was still fully naked as she corralled all the women into a secure area and commanded \"Any of you with combat experience will be coming with me to search the mansion! The rest of you will stay here while the room goes into lockdown. The worst should be over but stay alert and y'all try to keep calm ok!?\" Rogue, Jubilee and X-23 leave together and start searching the perimeter of the Mansion with you stuck painfully along for the ride.<br>\r\n<br>\r\n     \"There has to be\" STEP \"Something I can\" STEP \"Do?\" STEP!! you try to think between each pulverizing step. You run everything that happened through your head desperate to try to explain it to someone. Storm has now joined Rogue and the others confirming nothing is left outside and there doesn't seem to be any signs of forced entry. They are about to deem the situation over as they start walking back to the mansion. By now however your suit has receded back into your body after all the trampling you have been through, especially the super strength STOMP, leaving you naked. Without the suit interfering slightly your most recent memories started getting sucked into Rogue giving her glimpses of what happened!<br>\r\n<br>\r\n    \"Wait!!\" Rogue yells \"Put everything on full lock down there is an impostor in the mansion!\" Storm quickly puts in the code forcing Adamantium barricades to cover every window and door sealing the mansion shut! \"I saw a vision of someone that looked like you storm! Then darkness with only glimpses of light but I'm almost certain she made it inside!\" STOMP! she pounds her foot HARD in frustration denting the floor and splattering you even harder \"I wish I could remember more!!\" STOMP she pounds again suddenly getting more memory of what happened! She sees your memory of the real Storm still in the air and then sees herself coming back down and then darkness again. \"Calm down Rogue this is no time to lose your temper\" Storm says sternly. \"Every time I stomp I get a flood of more memories\" Rogue replies and Storm eagerly nods \"Oh! we need everything we can get just try not to destroy the mansion!\" Rogue quickly runs to a spot she knows is Adamantium flooring and keeps STOMPING down on it with all her might!<br>\r\n<br>\r\n    You are Pulverized into mashed mutant as she just keeps stomping you like a grape with such insane strength! On top of that you being SMASHED into the strongest metal known to exist in this universe which is unyielding to her mighty foot and provides no form of cushion for you at all. Unfortunately you were stuck face first to her foot so by now the continuing memories are just darkness and the sounds of her own footsteps along with your thoughts. This didn't help though as the current sound of her stomps drowned out the sound in her memory and she was already naturally thinking the same thoughts she was currently stealing from you. She STOMPED a few more times then realized that everything went dark when she saw herself landing. \"Oh no\" She mutters to herself as she stops stomping. \"What is it?\" Storm asked anxiously. \"Well I'm either seeing the memories of a bug I landed on or..... \" Storm's eyes Widen \"Our new little friend... Oh no!\" <br>\r\n<br>\r\n    Rogue finally lifts her foot and sure enough the women see your poor body plastered like a tattoo on her sole. \"I'm so sorry!\" Rogue yells as she tries to peel you off her foot. \"He said he was indestructible... I hope he was right, we will try to find the impostor. I'm almost certain it's Mystique!\" Storm says and she and the others take off searching the mansion. </span></div></div>",
            "created":1480309200,
            "id":2243300,
            "title":"Unintentional Interrogation"
        },
        "131211211111121111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You are stuck to Mystique's Boot",
                "You are left on the floor beside Rogue"
            ],
            "content":"<div class=\"\"><div> <span>     After a few minutes Rogue still can't peel you off and is afraid she is hurting you even more. You plead with her mentally to sit down and just let you heal naturally and luckily her powers absorb your current thoughts. \"You are alive!\" She says excitedly as she sits down indian style to keep off of you and watch your progress while apologizing again and again.<br>\r\n<br>\r\n     A puzzled looking Storm approaches the naked Rogue as she appears to be talking to her foot and she says \"Everything alright Rogue?\" Rogue looks up happily and lifts her foot up towards Storm \"Yeah! He's alive and says hes gonna be right as rain soon!\" Storm winces as she sees what looks like a tiny  flat man smeared brutally across Rogue's dirty sole. \"That's... good to hear, It looks like the intruder got away though.\" Rogue sighs and says \"I'm glad nobody was hurt at least... Oh my! I mean aside from you little guy! So sorry again!\" She stammers as she brings her foot back down to look at you. <br>\r\n<br>\r\n     Storm is now walking to the security panel quietly. \"Hold on Storm, we've gotta wait for the others to give the all clear too I haven't heard back from them.\" Storm stops without turning around \"I spoke with them on the way back trust me it's all clear\" As if a switch was set off in Rogue She quickly hops into action unfortunately squishing you again as she springs to her feet and lunges at Storm! To no surprise for Rogue 'Storm's' skin turns blue and her eyes glow yellow as her hair turns a dark shade of red revealing the impostor as Mystique!! She nimbly dodges Rogues attacks and lands a few good hits of her own! Rogue angrily tries for a kick with her right foot but Mystique rolls under it leaving Rogue to STOMP against an Adamantium wall further splattering your poor body! This continues several more times leaving you to fully take the force of Rogue's attacks until Mystique nails Rogue in the stomach with a small but powerful shocking device!<br>\r\n<br>\r\n     Rogue is unfortunately still absorbing your powers through touch and the jolt of electricity forces her to shrink! She soon becomes too small for you to stick to so your body gets forced off onto the floor with a flat splat only to get stepped on by a surprised Mystique who has no idea what just happened! She quickly takes advantage and shocks the security system, burning out her electric gadget in the process but she is able to force the mansion out of lock down and escape!   </span></div></div>",
            "created":1480309200,
            "id":2243311,
            "title":"Mystique is Revealed!"
        },
        "1312112111111211111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You fall off of Rogue's ass (reserved)",
                "You stay stuck to Rogue"
            ],
            "content":"<div class=\"\"><div> <span>     While Mystique Sprinted through the field and into the nearby woods she was completely unaware of a tiny unwanted passenger. Your poor annihilated body was squashed and stuck to the bottom of her thick high heeled white boot. The thick tall heel portion was like the head of a hammer that just Pounded you endlessly against the ground. You were like a piece of gum stuck to her high heel just mashed further into a flat mess. She eventually reaches a cliff and hastily grows wings with her shape shifting abilities and glides off over a forest and towards the city! <br>\r\n<br>\r\n    She is not off the hook yet though as Rogue is also still shrunk but is grabbing onto the back of Mystique's boot! To make matters worse an angry Storm is also shooting across the sky shooting gusts of wind at her! Mystique looses her balance and spirals down towards the forest grabbing onto a tree branch at the last minute! Meanwhile Rogue grows back to normal still grabbing onto Mystique's ankle. The added weight snaps the branch and the the three of you tumble down among the branches with her heel scraping across the bark of a tree finally ripping you off her boot! <br>\r\n<br>\r\n     As the two women fight among the branches the winds spiral your flattened body around like a helpless leaf until you gently flutter onto the forest floor. You watch in agony as the beautiful women fight in the trees the only perk being the nice view. Mystique's Hood has long since blown away and her skimpy tight white dress and tattered to shreds while the sexy Rogue is still completely naked and dirty and sweaty after her ordeal. Their flawless bodies glisten in the sudden flashes caused by Storm's thunderbolts as they shatter across the sky. You look in awe as Storm is now high up above you surrounded by surges of electricity. <br>\r\n<br>\r\n    Storm is pissed as she slowly descends down with angry bolts of lighting spreading from her limbs. She gets lower and lower now under the canopy and the surges of lightning coming from her feet creep closer to the ground! You scream as one bolt seems particularly fond of you and strikes your body shocking every cell in your body with horrible power! The bolt surges again and again striking you to a crisp as Storm descents. After about fifteen seconds the bolt finally stops just as Storm lands on you CRUNCHING your body beneath her boot like a dry leaf as she takes aim and blasts bolts at Mystique!<br>\r\n<br>\r\n     The bolt hits it's mark and a stunned Mystique falls out of the tree right towards Storm. The mighty Weather master steps out of the way revealing your crispy smashed body for a moment before it gets smashed again under the impostor's big blue ass cheek with another loud CRUNCH. Your poor body is pounded once again under a brutal impact plastered to an ass that just fell from several stories high! Rogue then jumps down and rolls Mystique onto her stomach revealing you stuck to her right ass cheeks. Rogue of course does not see you as she slams her naked ass down on Mystique's butt CRUSHING you with a meaty SLAP as her pale ass cheeks smack down hard on a pair of firm blue butt cheeks with you smashed brutally between them. Rogue keeps her pinned this way as she uses her powers to further knock out Mystique and find out what she stole! Rogue's eyes widen \"We need to take her in and find her robe now! I saw her ditch it when she needed to grow her wings on the cliff!\" Rogue gets off of Mystique and your poor body is now stuck to Rogue's ass cheek as she shoots up into the air while Storm traps Mystique in a small tornado and flies off with her prisoner!<br>\r\n<br>\r\n     You feel all sorts of fucked up after such a shocking and pounding beating and you desperately just want to escape this horrible day that started out so normal and ended with you plastered to a super powered ass cheek after being electrocuted by a storm goddess and brutally trampled several times before that...<br>\r\n<br>\r\n</span></div></div>",
            "created":1480309200,
            "id":2243334,
            "title":"It's Raining Women!"
        },
        "13121121111112111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "The woods claim you",
                "You swing through the forest trying to get home"
            ],
            "content":"<div class=\"\"><div> <span>      As Rogue shot through the air amidst the raging winds of Storm your body gets peeled off her ass and blown away through the sky like a leaf! You are blown every which way and taken for miles. Eventually you recognize the familiar sight of the mountain your housw rests on in the distance! It looks like you may be headed towards it when your body suddenly unflattens and you fall fast into the woods!<br>\r\n<br>\r\n      Your inner suit reacts and envelops you and you land safely by shooting a strand of 'web' and flipping into a branch like a bad ass. Of couras you collapse in pain onto it still greatly injured but the point is you did something cool for a second!</span></div></div>",
            "created":1481173200,
            "id":2247530,
            "title":"Riding the Winds"
        },
        "131211211111121111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Your \"team\" is there to greet you",
                "You are alone"
            ],
            "content":"<div class=\"\"><div> <span>     You soon gain enough strength to start swinging through the trees like spiderman but soon notice many glowing flowers. You get shivers down your spine knowing that Ivy has her legion of plants spying everywhere. <br>\r\n<br>\r\n     As you travel deeper into the woods it becomes more and more full of these flowers which spew a pink sweet mist. Soon all you can see is there glow as you swing for hours and hours not realizing youve been going down hill and towards the bad part of the city. In fact you dont fully come back to your wits until you feel someone pick you up and shake you suddenly.<br>\r\n<br>\r\n     Your vision returns and you realize you are in Ivy's fist and deep in her hideout. \"My oh my you've had quite an unfortunate adventure without us! Normally I wouldn't mind but were going to have a job in a few days and I need you in perfect condition!\" Ivy says with a smile. You gulp and stare up nervously \"what kind of job?\" Ivy shakes her head \"dont you worry that little bug brain of yours dirt I'll brief you on that later. In the meantime rest in your room!\"<br>\r\n<br>\r\n     With that she tosses you into an cave like room and you ploop into a pool of tingly, refreshing green water. Vines secure your arms and legs and keep you restrained in the pool which feels immensly soothing and you pass right out.<br>\r\n<br>\r\n     The plants feed you honey and juice as you sleep for days growing back to normal and feeling fully healed as you awaken. </span></div></div>",
            "created":1481173200,
            "id":2247537,
            "title":"Prepping for a Big Day"
        },
        "1312112111111211111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Its a bank robbery",
                "Its an attack on a hero/hero team "
            ],
            "content":"<div class=\"\"><div> <span>     As you wake up you arw horrified to find a seven foot tall Giganta in the pool with you grabbing you by the shoulders and stuffing your face against her massive breasts in a bear hug! \"Well how about that the little thief did survive! I'm so happy\" she says satcastically as she nearly crushes your spine and suffocates you against her tits. This is without using any of her strength at all and already you felt punished enough to nearly shrink!<br>\r\n<br>\r\n     Luckily she let you go before that could happen and you splashed back into the pool. \"Lets go its time to work\" she says as she lifts her foot and pushes it onto your back sinking you to the bottom of the pool and she tramples you underwater on her way out. Even without being shrunk she feels immensely heavy  as your back cracks in protest beneath her feet until she finally steps off and you pop out of the water gasping for air.<br>\r\n<br>\r\n     Looking up you see Giganta, Ivy and Harley smiling down at you. \" lets get you caught up shall we?\" Ivy says as Giganta grabs you out of the water and slings you over your shoulder and you are taken to the briefing room where your new job is explained...</span></div></div>",
            "created":1481173200,
            "id":2247543,
            "title":"Triple Trouble"
        },
        "13121121111112111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "A Hero interrupts",
                "Not interrupted but maybe not a smooth hiest "
            ],
            "content":"<div class=\"\"><div> <span>     The thorough plans are revealed to be a bank robbery! Specifically on a certain vault owned by a corporation that Ivy hates due to their harmful  environmental impact. On top of that some of the wealthiest citizens have accounts there and it is in the outskirts of the main city. A perfect target.<br>\r\n<br>\r\n    The plan seems pretty solid. You are actually pretty impressed with it and it was certainly exciting. You were somewhat of a professional thief before and this time you have super powered babes on your side or rather you were forced to be on their side. \"Ok I'm in\" you agree enthusiastically. <br>\r\n<br>\r\n    \"As if you had a choice\" Harley cackles. \"I knew you would be\" Ivy smiles, \"just stay out of my way and away from my cut of the haul\" snarls Giganta. Harley stands on the table and yells \"tomorrow the Frightful Four attack!\" <br>\r\n<br>\r\n     That night you are actually left alone on a comfy bed in a somewhat nornal room as you run the plan through your head again and again. After a good nights sleep the Frightful Four pack into a huge black box truck and it Revs loudly heading for the massive bank. Harley is driving, Ivy is in the passenger seat and you are squeezed between them with Giganta sitting carelessly on top of you! Her massive ass cheeks shift uncomfortably squishing you crotch as her back is nearly flattening you against the seat. \"I feel like a sardine stuffed in a can\" Giganta says annoyed as you groan in pain behind her.<br>\r\n<br>\r\n     Finally the truck arrives and everyone but Harley quickly gets out of the truck leaving you gasping on the seat after Giganta finally gets off of you. Harley keeps the truck runnning in the woods as Giganta puts on a trench coat and Ivy wears a fancy dress and sunglasses. You are covered fully in your sybiote looking menacing before you shrink and get picked up by Ivy and then hidden in her red hair. Ivy enters the bank impersonating a customer while Giganta keeps guard outside. You are pumped with adrenaline and anxious to start!</span></div></div>",
            "created":1481173200,
            "id":2247551,
            "title":"The Frightful Four"
        },
        "131211211111121111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She-Hulk Rages!",
                "Giganta stuns She-Hulk for now"
            ],
            "content":"<div class=\"\"><div> <span>     Ivy walks around the bank dropping tiny seeds that start spewing a colorless gass that soon fills the building and knocks everyone but you and Ivy unconcious. Even though your symbiote can filter toxins you still try to hold your breath just in case! You hop out of her hair and web swing onto the wall of the vault crawling into a tiny space meant for ventilation should anyone accidentally get locked inside. You make it inside and start using your sybiote to ooze into the locking mechanism to try and figure out the right way to shapeshift into the correct form to force the locks open.<br>\r\n<br>\r\n     Meanwhile non other than the famous lawyer Jennifer Walters (She-Hulk) is approaching the bank to make a deposit.<br>\r\nGiganta blocks her way and says \"The Bank is closed princess\" before shoving her roughly away. Jennifer smirks and says \"I had a feeling I'd need my costume today... should have listned to my gut\" She kicks off her heels then starts turning green and grows to seven feet tall ripping her suit and skirt with a very stretchy bra and thong just barely holding together over her massive breasts and thick muscular ass and hips! \"You're out of your league jusy give up!\" She says in a cocky tone.<br>\r\n<br>\r\n     Giganta just chuckles softly and starts to grow! Her trenchcoat rips to shreds revealing her classic skimpy leapardskin loincloth and bra that magivally grows with her now 200 foot tall body!! <br>\r\n<br>\r\n\"Awww crap!\" She-Hulk mutters as Giganta prepares to stomp down on her! She barely dodges the gigantic foot and the massive quake alerts you and ivy to the trouble! <br>\r\n<br>\r\n    \"Shit! I guess were not doing this the subtle way!\" Ivy yells as she forces massive vines from the forest to burst into the bank and yank out the still sealed vault with you still in it!!! You panic and crawl back into the vent and leap out growing to normal size and labding outside dramatically! You feel incredibly stupid though as you see the vault stuffed safely into the truck that speeds away while you are caught on the battlefield of She-Hulk and the towering Giganta!<br>\r\n<br>\r\n     \"Holy fuck\" you yell as you scramble to get out of the way. Giganta STOMPS down on She-Hulk who manages to hold the massive foot up but she is brought down to her knees. Ivy shoots vines to tangle Jen's legs as she pushes with all her might nearly knocking Giganta off balance. She delfected the stomp but is now caught by Ivy. You shoot strands of your suit as well to restrain Jen's arms as giganta leaps high into the air and rockets down feet first aiming her heel at her opponent!<br>\r\n</span></div></div>",
            "created":1481173200,
            "id":2247563,
            "title":"She-Hulk vs Giganta"
        },
        "1312112111111211111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She-Hulk wins (reserved)",
                "Giganta wins"
            ],
            "content":"<div class=\"\"><div> <span>     At that moment She-Hulk yells out a firce warrior's Roar!!! She grows thicker and taller to eight feet tall completely shredding her bra and thong along with Ivy's vines, before she pulls at your tethers and sends you flying into the air smashing you face first into the bottom of Giganta's heel!!!<br>\r\n<br>\r\n    \"Fuuuuck No No No No!!!\" SMACK!! You crash into her foot  with massive force making you shrink instanly and stick to her right heel as Giganta plummets to the earth splattering you into the ground with an earthshattering BOOOOOM!!! <br>\r\n   <br>\r\n     She-Hulk was able to evade just in time and the now naked green amazon rages towards Giganta!! You are left smashed in a giant footprint as giganta continues trying to stomp on She-Hulk! You get trampled under a green powerful foot that further grinds you into the dirt as She-Hulk runs you over for a moment as she dashes around. The green wall of foot finally lifts off you only to be replaced by a power STOMP!!! Under Giganta's sole as she accidentally tramples you instead of her opponent. This haopens several more times and you soon end up plastered to the bottom of Gigantas heel like a tatoo.<br>\r\n<br>\r\n    Finally Giganta lands a powerful stomp and grinds you and She-Hulk under her massive weight! Giganta quickly grabs Ivy and sprints before doing a super jump high into the air and leaping for a solid mile! You of course were stuck for the excruciating ride as she hanmered you to mush as she sprinted and annihilated you into a flat puddle when she finally landed from her super jump causing a massive earthquake!! You have no idea how you are not dead as every fiber of your being is just beyond crushed and smashed in agonizing blindinh pain! The only relief is she squats down and super jumps again for anothet mile leaving you smashed in the crater of her first landing.<br>\r\n<br>\r\n     You stare as the giantess dissapears from view leaving only the clear blue sky..\"well it can't get any worse\" you think as you lay in comolete agony. Then to your horror you see a green dot in the sky! She-Hulk was not crushed but jammed into the ground under Giganta. She had recovered quickly and super jumped as well! The green amazon landed with a powerful BOOM and SPLAT as her foot landed right onto your splattered body. She dug her foot into the ground smearing you beneath her heel and stretched across her sole as she braced for another super jump taking you along with her!<br>\r\n<br>\r\n      Your poor body is unknowingly taken for anothet trip and agonizing landing as she hulk hurls back onto the ground further splattering you even more if that was even possible.<br>\r\n<br>\r\nGiganta is surprised to see her naked oponent catch up so quickly and is caught of guard as She-Hulk roars and STOMPS in frustration mashing you back into the dirt before she leaps up and punched giganta in the face! <br>\r\n<br>\r\n     Despite your predicament you were impressed by the solid attack but Giganta then headbutts She-Hulk sending her back down like a bullet! Your eyes widened as she shot down ass first mashing you under her solid round left ass cheek adding more pain for your poor broken body. Then things got much  worse. Ivy grew vines to keep she hulk seated as Giganta hopped up and landed ass first on She-Hulk! You were splattered spread eagled under She-Hulk's left ass cheek while She was pressed spread eagled under Giganta's collosal left ass cheek as she sat smugly and powerfully grinded her ass deeper into the ground creating an ass shaped crater.<br>\r\n<br>\r\n      She even bounced in place hammering you and she hulk under her unrelenting weight and power!</span></div></div>",
            "created":1481173200,
            "id":2247569,
            "title":"Under a Clash of Titans!"
        },
        "13121121111112111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She notices you",
                "She doesn't notice you "
            ],
            "content":"<div class=\"\"><div> <span>      Your body is so beyond flattened and beaten as you get further ground into mush as giganta keeps bouncing and grinding She-Hulk harder into the ground. Meanwhile the green amazon is in a world of pain and escalating fury herself. She flexes and spreads her legs ripping the constricting vines apart and squeezes her hands as tight as possible as she grabs Giganta's ass cheek!<br>\r\n<br>\r\n    The sudden pinch of pain makes Giganta jolt up yelling \"Ouch!!! What the!?\" Giving She-Hulk the split second she needed to roll out of the way before the collosal woman slammed her ass back down only landing on you this time, further splattering your poor helpless self. Giganta then quickly sorings to her feet realizing She-Hulk escaped the pin leaving you smushed in the massive ass shaped crater. She-Hulk manages another super jump hitting Giganta's stomach making her buckle over in pain. <br>\r\n<br>\r\n     Meanwhile Ivy grows two strange vines with sticky spores  to try and get She-Hulk immobilized. Unfortunately for you the vines sprouted beneath you!! One accidentally stickied your hands while the other stickied your feet. Your body was ripped off the ground as the vines shot up into the air. Feeling you tangled between them the vines try to move away from each other ans start stretching you slightly like a rubber band! You feel like you will be ripped in half even with the lightest tug when suddenly Giganta kicks She-Hulk right towards you!! <br>\r\n<br>\r\n     Her bare green ass launches against you ripping you off the vines and your stretched limbs whip atound her hips!! Your right arm and leg form a loop around her right hip with your hands and feet ,still spored, get glued together while your left limbs do the same around her left hip essentially turning you into She-Hulk's personal thong!!!! Your upper half is wedged far up in her ass while your lower half wedges itself in her pussy before she lands ass first on the ground squashing your face into her ass hole as it clenches your face into squishy putty.<br>\r\n<br>\r\n     By now Giganta is about to stomp on She-Hulk but Jen manages to stand and hold the massive foot up with all her might tightening her glutes harder enough to crush diamonds making your body feel like it will be poulverized into powder as it gets clenched and sucked deeper in her ass while her pussy does the same nearly liquifying your dick and balls with burning hot pressure. <br>\r\n<br>\r\n    Giganta is thrown off balance by a mighty shove from She-Hulk and she nearly falls on Ivy. Giganta feels things have gotten drastic so she grabs Ivy and lauches her into the sky towards the area Harley drove off to. Ivy grows massive leaves on her back and glides away to safety while giganta battles down below. She manages to smash She-Hulk onto her stomach and stomps down on her back with her massive heal landing on her green ass further cramming you into her anus. She grinds and twirls on her heel spiralling your little thong body into a tight coil, even ripping your lower half out of She-Hulk's pussy to get shoved into her asshole instead which had no choice but to swallow you whole leaving only your limbs as tight straps on She-Hulk's hips. <br>\r\n<br>\r\n     Giganta then breaks into a sprint hoping to super jump away but She-Hulk is at her power limit with rage. Her anus tightens and crushes you into a rubbery puddle as she roars and sprints like a madwoman after giganta! Each step further grinds and blends you up in her tight ass before squeezing you harder then even imaginable as she super jumps and kicks Giganta in the back of the head knocking her out cold!!<br>\r\n<br>\r\n     She-Hulk gets to her knees and gasps as she is now exhausted and sweaty but still keeping her She-Hulk form just in case. Her sweat and relaxed muscles allow your crushed lower half to get dragged out of her ass by your stretched legs which try to tug you back into shape. Your crotch is once again tugged tightly wedged into her pussy making She-Hulk gasp! </span></div></div>",
            "created":1482987600,
            "id":2256176,
            "title":"Becoming a Hero Wedgie!"
        },
        "131211211111121111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She imprisons you too. (Reserved)",
                "She keeps you for herself"
            ],
            "content":"<div class=\"\"><div> <span>     By now Giganta has slowly started to shrink and She-Hulk catches her breath and runs her fingers along your limbs. \"No way my underwear survived!? Pretty sure it was all regular clothes today..\" she tugs as the straps wedging you up her ass and pussy tighter. She then tugs the front and then the back dragging your body roughly along her pussy only to get dragged back across her anus and then clenched by her muscles as she tests your elasticity by tugging hard on your limbs! The spores are now dried up and crack releasing your hands and feet!<br>\r\n<br>\r\n    SNAP! Your limbs are free and retract back to your proportions leaving you entirely between her butt cheeks. \"Oops! Damn\" she says as she relaxes again but feels your splattered bodly slip from her ass and you drop to the floor in a flattened heap. She gets on her knees and stares down closely at you. \"What the hell!? A man!? What the fuck where you doing there!?\" She angrily stands up and to your horror starts STOMPING full force on you! \"Probably one of these idiots too aren't you she says as she motions towards giganta. \"Well now you'll be feeling the weight of the law!\" She smiles as she checks under her foot seeing you stuck like glue to it before she picks up the normal sized Giganta and super jumps to the city!! <br>\r\n<br>\r\n     After an explosive landing she makes sure her little prisoner is still with her and stomps happily into the super powered jail center. After some awkward conversations about She-Hulk's nakedness some female officers and heroes haul Giganta off to a cell made for size changing superhumans. Meanwhile She-Hulk hasn't revealed you to anyone yet.</span></div></div>",
            "created":1482987600,
            "id":2256185,
            "title":"Taken into Custody "
        },
        "1312112111111211111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "A prison cell",
                "An interrogation room"
            ],
            "content":"<div class=\"\"><div> <span>     She-Hulk smiles proudly as the cops lock up her latest catch. \"Oh right!\" She says to herself as she remembers you. She lifts her foot up and roughly rips your splattered body off of her green skin before slapping you onto a metal table with a SPLAT! <br>\r\n<br>\r\n     \"I didn't kill you did I?\" She smiles as she sees you twitch in pain. \"You should be nothing but a bloody spec... an indestructible man!\" She bites her lip thinking about it and then smirks \"Shame about the size though... and it looks like you're just a lowly criminal on top of that. So are you going to tell me what the hell is going on with you and your big ass friend?\"<br>\r\n<br>\r\n    Your Symbiotic suit seems fully merged with your DNA at this point and manages to accelerate the healing for your face so you can desperately speak and defend yourself. \"It's complicated but I swear I'm not really a criminal!\" <br>\r\n<br>\r\nShe-Hulk rolls her eyes \"I've never heard that one before\"<br>\r\n <br>\r\n\"No really, I was forced into this by..\"\" You quickly shut up realizing that snitching on your villainous 'Team mates' might not be the best option. \"Actually I want a lawyer.\"<br>\r\n<br>\r\nJen smiles \"Actually I am a lawyer, who exactly is pulling your strings? If you aren't lying scumbag I'd be more than happy to defend you.\"<br>\r\n<br>\r\nA superhero lawyer who is one of the strongest women in the world defending you doesn't sound like too bad of an idea... \"Actually please I can pay anything I really am innocent... would you really help me out?\"<br>\r\n<br>\r\nJust then the two police women come back into the room. \"Well ladies I found this little guy on the battlefield with Giganta. Wasn't sure if he was involved but he has admitted to being involved in some way, make sure to lock him up!\"<br>\r\n<br>\r\nOne of the officers roughly grabs you and as she is walking away Jen says \"I'll set up a meeting with you soon little guy and we will see if I'll take you as a client.\"<br>\r\n<br>\r\nYou curse yourself for being so stupid as the two ladies in blue take you away to...<br>\r\n<br>\r\n</span></div></div>",
            "created":1491541200,
            "id":2301402,
            "title":"Speaking to a Lawyer"
        },
        "13121121111112111111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Giganta is Relentless all night",
                "Giganta tires out and lets you recover"
            ],
            "content":"<div class=\"\"><div> <span>     \"Wow a super powered guy! This is the first I've ever heard of!\" says your current captor excitedly. Her brunette partner snickers \"Yeah but kind of a shitty power don't you think? I wish they were all this easy to handle.\" You lay helplessly in her fist humiliated as they laugh all the way down the winding halls. The sweet blonde one holds you up to her face \"Awww don't be too sad little guy at least you know your cell mate!\"<br>\r\n<br>\r\n    Your eyes widen in horror as they turn the corner entering a massive room pulsing with electricity and an enormous transparent cube floating several feet off the ground and within it sits a fully giant sized angry Giganta! <br>\r\n<br>\r\n     You immediately plead with desperation \"Wait a second there has to be another cell! We are not friends and besides we have like complete opposite powers isn't this against the rules or something!?\"<br>\r\n<br>\r\n   \"Well sorry little guy we only have one cell designed to keep in size changing supers\" her snarky co-worker adds \"If you can't do the time don't do the crime shrimp!\" and she presses a few buttons on her security pad. An electric bubble shoots out of the cube and swallows you up before slowly returning to the massive block. The zero gravity allows your symbiotic cells to boost your healing and pop you back into shape for the most part. The bubble enters the cube and pops leaving you standing inside the cube and staring up at Giganta! Luckily she just gives you a glare and scoffs before staring angrily at the wall again.<br>\r\n<br>\r\n   You sigh in relief but the trouble making officer yells out \"Giganta you should really learn a lesson from your little friend here, he was VERY informative!\" <br>\r\n<br>\r\n    Giganta slowly brings her gaze down on you menacingly... You can feel the weight of her stare as if it is physically crushing you... \"You little worthless SNITCH!!!\" She can't really move around too much but she lifts her titanic sized ass up and shifts it over the little spec you have for a body! The blonde cop watches in horror from under the clear floor of the cube getting a horrifying view of your fate! Meanwhile her friend looks up and is all smiles!<br>\r\n<br>\r\n    You have nowhere to go as your cell mate literally takes up the rest of the room and accept your pitiful fate as her right ass cheek SLAMS down with as much force as Giganta can muster splattering you beneath her unimaginable weight. She lifts up and POUNDS down again and gain!<br>\r\n<br>\r\n   BOOOM BOOOOM BOOOOM BOOOOM!!! The horrible quakes from her ass impacts vibrate the cube violently but it keeps levitating defiantly much to the officers relief. Giganta bounces on you again this time pushing the ceiling with her arms so her ass presses even harder down on you! You see nothing but stars due to the blinding pain and even the bottom of the cube starts to bend and bulge downward in the shape of her ass. She twists and grinds you smearing you under tons of ass cheek and rage! <br>\r\n<br>\r\n\"Ten bucks says he's dead by tomorrow!\" says the brunette as the blond just stares up in horror watching your body mash, smear, splatter, and completely flatten again and again under such an enormous ass! </span></div></div>",
            "created":1491541200,
            "id":2301422,
            "title":"A Giantess for a Cell-mate"
        },
        "131211211111121111111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You are somehow able to escape!",
                "Gigznta continues to have her way with you."
            ],
            "content":"<div class=\"\"><div> <span>The guards eventually head out as night falls leaving you with Gigznta as she bulldozes you beneath her ass for what feels like the millionth time. She finally shifts her titanic rear off you letting you gasp for air for just a moment before she STOMPS her heel down on you and just twists and grinds you into the floor like a bug and she takes out her boundless frustration and energy out on you.<br>\r\n<br>\r\nShe eventually sighs deeply and examines the bottom of her foot. She smiles smugly seeing your tiny spec of a body smeared to her skin like a tattoo.  She scraped you off with her finger tip and tugs her skimpy loin cloth down a bet revealing her gigantic steaming hot pussy. \"If you're gonna act like a pussy and spill your guts to the cops then you might as well live in here\" she says as she starts fingering herself mashing you into her soaked clit! <br>\r\n<br>\r\nFor you it's like being plunged into a musky deep lake as you are drowned in her fluids and plunged deeper onto her womanhood. She squashes and smears you across her walls and moans in pleasure. She can't feel you at all but is turned on by how much torture she can put you through with no effort. Her juices wash you off her finger leaving you trapped in the hot endless swamp that is suffocating you and crushing you as her walls tighten and squeeze with pressure and her gigantic finger returns to mash you into the depths of her pussy again and again until finally the massive Amazon climaxes and her juices slowly ooze out along with you. <br>\r\n<br>\r\nShe gasps and moans with pleasure and smiles at the sticky puddle she formed down below knowing you are more than likely trapped in the swampy mess. She lifts her ass and roughly sits down on the puddle with a wet and satisfying SQUELTCH knowing she made your situation that much worse.<br>\r\n<br>\r\nYou had finally dripped out of her pussy and your battered body was nearly at the surface for you to finally get a breath of air when suddenly everything went black again and you were mercilessly annihilated under her mountainous right ass cheek with her climax squashed down your throat and nose as you are being drowned and utterly crushed at the same time!</span></div></div>",
            "created":1492232400,
            "id":2305492,
            "title":"Giganta's microscopic Sex Toy"
        },
        "1312112111111211111111111111111111111111111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You manage to heal up and sneak away.",
                "You do not go unnoticed "
            ],
            "content":"<div class=\"\"><div> <span>By some stroke of luck a small bubble formed under the cube and opened a microscopic hole in the cube under Giganta's ass! It began sucking the vaginal fluids to remove the liquid waste from the cell! Your body was so mashed and practically liquefied that it easily got sucked through the hole, it was your lucky break! The bubble then floated down and squeezed the fluid down a drain with you splattering off the grate and onto the floor.<br>\r\n<br>\r\n\"Free!? I'm free!?\" You thought to yourself as you laid in agony on the floor. You thanked your lucky stars, if you had any as you had never been so happy to be a flattened puddly mess, but a free one! Giganta didn't even seem to notice as she blissfully fell asleep feeling amazing after playing with herself.<br>\r\n<br>\r\nThere's not much you can do though as it will take all night to fix this kind of damage to your body...</span></div></div>",
            "created":1492232400,
            "id":2305496,
            "title":"Slippery Escape?"
        },
        "13121121111112111111111111111111111111111111111112":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You help her out ",
                "You leave without her "
            ],
            "content":"<div class=\"\"><div> <span>The night goes on without a problem as you sleep and heal up, awakening just before the morning. You are still sore but are able to form a symbiote suit. You cannot grow to normal but that would be risky anyways. <br>\r\n<br>\r\nMeanwhile giganta has woken up and eagerly starts looking for your plastered body beneath her. Her wry smile turns into anger as she realized how dry and clean everything was! She scanned the entire cube with her eyes right above the surface but there was no sign of you. \"How in the hell!? Where are you!?\" <br>\r\n<br>\r\nAngered by her commotion you web sling to the cube and crawl right in front of her eye and shush her. Her eyes are furious but she keeps her cool knowing you hold the upper hand now and she presses her ear to where you are clinging. <br>\r\n<br>\r\n\"You gigantic hot headed idiot!!!! You fucking turned me to goo over nothing!!! I didn't snitch on the cops I just incriminated myself like an idiot... some fucking teammate you are!!\" <br>\r\n<br>\r\nJust as you are about to web sling away Giganta says \"prove it then. It's easy to talk the talk now that you're free but if you really haven't betrayed us then help me get out too!\" <br>\r\n<br>\r\nYou glare through your symbiote and grit your teeth and decide..</span></div></div>",
            "created":1492232400,
            "id":2305498,
            "title":"Tables Turned "
        },
        "131211211111121111111111111111111111111111111111121":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You are left squashed in the prison",
                "You are stuck to her foot"
            ],
            "content":"<div class=\"\"><div> <span>Against all your instincts and better judgment you reply \"...Fine I'll help you out.. Just cover for me, keep the guards occupied when they show up.\"<br>\r\n<br>\r\nGiganta nods and smiles. Eventually The two guards show up again to check on you two. \"So is he dead?\" Asks the snarky cop. Giganta replies \"Yeah I ate the little traitor for dinner. Serves the bastard right\" the blonde cop looks sad and the brunette laughs \"yikes that's cold! I guess I win the bet though hahaha\" <br>\r\n<br>\r\nMeanwhile you extended a strand of the suit like a rope and hung upside down lowering yourself towards the blonde holding the security tablet. Just as you are about to reach the screen she sneezes and drops the tablet sending you both flying to the center of the room under the cube! Luckily the tablet landed face up with you a few feet away, although wet from her sneeze... You quickly scramble to get up and run towards the pad! <br>\r\n<br>\r\nMeanwhile the cops are arguing over who should have to walk under the cube to retrieve the pad. \"You dropped it you clutz so you should go get it!\"<br>\r\n<br>\r\n\"N-no way I'm not going under that cube what if something happens\"<br>\r\n<br>\r\nThe brunette replies \"nothing is going to happen you freaking coward!\"<br>\r\n<br>\r\nJust then you finally reached the pad a pressed the release button! \"Ha! I did-\"BOOOOOOOM!!! You once again get splattered beneath Giganta's enormous butt cheek as she lands ass first after the cube disappeared!<br>\r\n<br>\r\nThe cops run and scream for their lives as giganta begins to get up leaving you annihilated in her ass shaped crater. You only get a split second of relief when her butt lifts off of you only to be replaced by her foot as she stands to her full height. She squats down unaware she is stepping on you and super jumps plowing through the ceiling and launching high into the air and away from the prison!</span></div></div>",
            "created":1492232400,
            "id":2305506,
            "title":"Bad things happen to good people "
        },
        "1312112111111211111111111111111111111111111111111211":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Dare to lie",
                "Tell the truth"
            ],
            "content":"<div class=\"\"><div> <span>     The first hero to arrive on the scene is She-Hulk. By now Giganta has made her escape but the green Amazon carefully examines the crime scene when she spots you plastered in the giant ass dent on the floor. \"Well well well, if it isn't my new little client. I'm surprised you didn't run out with your big friend. Or maybe you had more pressing matters\" she said with a chuckle. She spots what's left of the nearly disintegrated security tablet right beside you. \"You wouldn't have anything to do with this do you?\"</span></div></div>",
            "created":1494478800,
            "id":2317872,
            "title":"Truth or Dare?"
        },
        "13121121111112111111111111111111111111111111111112111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "The Cameras were not at the right angle to see what you did",
                "The cameras caught you"
            ],
            "content":"<div class=\"\"><div> <span>     Afraid of admitting to breaking yet another law you lie to She-Hulk as she peels you off the floor and brings you to her smirking face. \"No! Giganta was crushing me into pulp the whole time I was in there ask the cops! Next thing I know were falling and I get smashed to the floor and Giganta leaps out of here like a bat out of hell!\" <br>\r\n<br>\r\n    One of the guards comments weakly behind She-Hulk \"Yeah its true the poor little guy was taking quite a beating! Hell we thought he was dead this morning, I guess he was so smashed we couldn't see him. I sneezed and dropped the tablet and I guess that turned off the cube...\"<br>\r\n<br>\r\n    She-Hulk simply clenches you in her hand with an audible -squish- and says \"Lets just check the cameras and make sure our tiny friend isn't lying.\" Once in the security room you get placed on the table, still flattened as they review the security footage. Your eyes are glued to the screen dreading to see yourself caught in the act!</span></div></div>",
            "created":1494478800,
            "id":2317878,
            "title":"Fact Checking"
        },
        "131211211111121111111111111111111111111111111111121111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Her Private Home",
                "Avengers Tower"
            ],
            "content":"<div class=\"\"><div> <span>     To your amazement luck was on your side! None of the cameras were placed at the right angle to catch you pressing on the tablet under the cube! Your heart nearly skips a beat and you sigh quietly in relief. She-Hulk smiles down at you \"Well then I guess I actually can take you as my official client then since you seem to possibly be innocent... for this crime at least.\" <br>\r\n     <br>\r\n     \"What can we do with him now? That was our only cell for his power type?\" The cops ask concerned with their predicament. \"Well as an avenger the chief of police can temporarily give me responsibility of him, though I am also his lawyer now... I can definitely keep him safely contained though and get more details on what happened. Who knows we may even have a potential new hero in our hands\" Jen says as she peels you off the desk and this time holds you gently in her palm. <br>\r\n<br>\r\n     After much deliberation the chief of police decides to leave you in She-Hulk's care under the condition that she constantly keeps you restrained at all times. By know you are mostly inflated and able to stand on her hand as she walks out of the police station. \"Alright lets get down to business!\" She says as she holds you a little tighter and breaks into a jog before super jumping across the city!! You feel like your neck is going to snap as she leaps again through the air and skyscrapers blur past you in a dizzying swift motion before she finally comes to a stop at...</span></div></div>",
            "created":1494478800,
            "id":2317881,
            "title":"Change of Custody"
        },
        "1312112111111211111111111111111111111111111111111211111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You double down on your lie",
                "You tell the truth"
            ],
            "content":"<div class=\"\"><div> <span>    She-Hulk finally stops at her Private home which lies just outside the city. The house is pretty big and made of some crazy high tech material! Probably to withstand possible mood swings while she is in hulk mode... Once finally inside she places you on a soft leather couch and rummages through a drawer. \"Alright! This is gonna be fun don't you worry.. ummm?\" You shake off your motion sickness and respond \"Allen, my name is Allen Flash.\" She-Hulk smiles and responds \"Great nice to formally meet you my name is Jennifer Walters. Now then Allen, I'm more than happy to represent you in court but I'm also now responsible for you so...\" She holds out two pairs of tiny adamantium handcuffs \"Never thought I'd use these\" She giggles then motions for you to stand.<br>\r\n<br>\r\n     You quickly comply and stand and put your arms out in front of you so she can cuff you. \"Alright Allen this is just a precaution and they've got pretty long chains but these suckers are pure adamantium. Should stop you from growing unless you want your hands and feet to get sliced off. Actually can you even grow?\" You stare as her massive fingers clumsily try to manipulate the locks around your right wrist and respond \"Yeah if I'm fully healed I can grow to a normal human size, I can shrink at will but getting hurt will force me to be tiny\" She finally clicks one part to your wrist but then clicks the other end to your right ankle so your right limbs are chained together. She then does the same to your left side and the chains are just barely long enough for you to walk and move your arms normally.<br>\r\n<br>\r\n     \"That's good to know. Not the most useful set of powers but hey it is something. Now everyone knows my powers but there is one little secret power I feel I have. I just get this gut feeling when I'm around a liar.\" You try to act cool but you are sweating nervously and stammer \"Well that's pretty cool, must be really useful as a lawyer.\" She smiles and says \"It really is, so is there anything else you want to tell me about Giganta escaping? You sure you didn't have anything to do with it?\" You gulp and respond \"Positive! I told you the truth at the police station.\"<br>\r\n<br>\r\n    She-Hulk touches her stomach and makes a sly playful face at you \"Oh my see there is that gut feeling again. Just like the last time you told that fun little tale. I was actually hoping you would lie to me again!\" She then kicks off her shoes and starts peeling off her skin tight leotard making you aroused at the massive green amazon towering naked before you yet also very confused. She then grabs your right chain in her left hand and your left chain in her right hand and holds you up so you are face to face with her. You now realize your limbs are chained together the same way they got stuck last time and you ended up as a thong for She-Hulk. Your eyes widen in horror and she immediately smiles seeing your reaction \"Ah! you finally got it huh? Well let's see how your story goes a week from now ok?\" She says as she lowers you down towards her feet.<br>\r\n<br>\r\n   \"No wait please I'm... I'm..\" </span></div></div>",
            "created":1494478800,
            "id":2317885,
            "title":"Last Chance?"
        },
        "13121121111112111111111111111111111111111111111112111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "Super Hero Work",
                "Lawyer Work"
            ],
            "content":"<div class=\"\"><div> <span>    \"I'm telling the truth I didn't help her escape!!\" you shout out at her. She simply sighs as you are placed on the ground \"Still got that feeling, sorry little guy!\" She pulls at your chains stretching you painfully wide before she STOMPS her foot down on you and then pulls at your chains upwards stretching your limbs as far as they can go. It is absolute agony as bears her weight down on you and nearly rips your arms and legs off before she finally steps off and slides her feet into the 'straps' that are your limbs. You stare in horror as she slowly slides you up her legs with your upper half heading for her ass and your lower half heading for her pussy. No matter how hard she tugs though she cant pull you past her thick muscular thighs. <br>\r\n<br>\r\n     She yanks and yanks making your feel like you will rip in half before she simply allows herself to turn into her normal form. While she is still curvy in this form she can now easily pull you up and have you fit like a snug thong! Your head is swallowed up by her white creamy ass cheeks and your crotch gives her a serious camel toe as it squishes against her pussy. She clenches her ass cheeks a few times painfully slapping your upper half between them, battering you effortlessly but it is about to get so much worse. To your horror She starts growing back into She-Hulk! Your prison starts turning green again and expands getting thicker and more muscular crushing you flat without even clenching. Her hips grow and violently tug at your limbs further wedging you up her nether regions as your face gets stretched across her anus and her pussy lips swallow and close around your lower half  leaving only your thin strap like legs to escape and get stretched back up and around the front of her hips. She then clenches her ass cheeks with a force strong enough to turn coal into diamonds annihilating your poor body in the awful pressure and further squishing your face against her anus which chews against you violently and threatens to swallow you whole.<br>\r\n<br>\r\n    \"A little tight but pretty comfy\" She says as she tugs the  back part of you up her ass more. Your entire head gets lurched into her anus which clenches down mushing your head like its chewing gum. \"Opps! too far\" she chuckles before tugging at the front part stretching your body back down but her anus fiercely bites down on your head not letting it pop out. She then takes a deep breath and relaxes her body so she can slowly feel the subtle drag of your face barely slithering out her butt hole. You gasp for air finally free of the hell hole before you but you choke on her musky ass scent. On top of that her skin in hulk form is hotter than normal making you sweat in your already humid prison. <br>\r\n<br>\r\n     \"Well time for work!\" She says cheerfully as she starts to put her tight leotard back on! \"Work!? She is going to fight crime while wearing me!??!\" You scream in your head powerless to do anything else. She hums a playful tune as she finally squeezes into her costume, with the bottom part also wedging deep into her ass further pressing you against her hot skin and ramming your face just deep enough to get chewed on by her tight anus again. She bites her lip loving the feeling and even presses a finger to her crotch swirling tour lower half around in her pussy before she bends down to put on her shoes. As she bends you get squished and stretched agonizingly more than before and her anus swallows up a little bit more of your head and her cheeks start clenching mashing your body between what feels like to meteors crashing into each other. She then heads out the door ready for anything!</span></div></div>",
            "created":1494478800,
            "id":2317889,
            "title":"Wedgie Justice"
        },
        "131211211111121111111111111111111111111111111111121111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She is going to shower (Reserved)",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>     Almost immediately an emergency call comes in and She-Hulk squats down ready to super jump into action!! As she squats low her cheeks relax but the arch of her stance pulls hard on your straps. Then her cheeks suddenly squeeze together as she flexes them to propel her up and leap into the sky. The force of them practically liquefies you into paste only being held together by your freakishly high durability but that does not help dull the blinding pain! It gets even worse when she arrives at the battlefield!!!<br>\r\n<br>\r\n     She is faced with large group of rogue amazons wreaking havoc! Currently Wonder Woman is fighting them along with Spider-Gwen and Scarlet Witch. \"Please be careful they are being mind controlled, they are my people\" Wonder Woman pleas. \"Don't worry I won't hurt them too bad\" She-Hulk says but just then one amazon sidelines her to the floor knocking her onto her stomach. The amazon mounts She-Hulk by sitting on her big green ass and punching her back! The amazons ass cheeks bounce and press into She-Hulks ass crack, spreading her cheeks and further squishing you into her anus! She-Hulk manages to buck her off with a mighty thrust of her ass and knock the amazon onto her back. She-Hulk finally stands up but another amazon kicks her in the stomach and she falls backwards now sitting on the first amazons face! <br>\r\n<br>\r\n    Desperate to free herself the amazon tries to bite the massive green ass that is smothering her but She-Hulk keeps shifting around as she blocks the second amazon who is giving her a flurry of kicks. Even so her teeth manage to grip She-Hulks leotard and your poor body! Feeling something in her jaws she clenches her jaws and chews violently and tugs back and forth with her head. Your back gets crushed in the powerful molars of the enraged beauty and a mighty tug rips your head painfully out of She-Hulks anus only to get sucked into the jaws of the amazon!! She chews on your poor body like her life depends on it mashing you like gum and covering you in spit until finally She-Hulk fends off her attacker and then Rams her ass down hard on the amazon beneath her knocking her out. Once she is out cold your limbs and the leotard pull at you ripping you painfully from between the Amazon's teeth and back up She-Hulks mighty ass, now covered in spit and sweat further adding to your hell...<br>\r\n<br>\r\n    Just then another attacker violently hooks her fingers onto your limbs, Thinking it was She-Hulks leotard, and lifts She-Hulk to give her a devastating suplex! The horrible action forces your body to fully support She-Hulk as she gets lifted up and slammed into the ground! The action rammed most of your body against her anus and then to make it worse the Amazon started STOMPING down on Jen's big green ass, Hammering you beneath her amazonian heel and squishing you into the tight green hole! Enraged Jen Grew a little bigger and glowed a little greener. She clenched her ass and anus so hard that you were compacted to the size of a dust spec while she got up and slammed the poor amazon around like a rag-doll just barely stopping before she did any permanent damage to her. Jen relaxed a little and the tension on the chains ripped you back out of her anus and stretched you back into her thong shape. You felt like you had been violently shoved into a black hole only to be nearly ripped back apart into the real world. The pain was unimaginable to you before...<br>\r\n<br>\r\n    The horrible battle dragged on all day and you were repeatedly battered like this over and over again with no shred of luck in sight. Eventually it was finally over and the amazons were brought back to their senses, though the villain who started this all remained unknown. By the time She-Hulk got home She was a beat up, sweaty and sore mess. There were no words to accurately describe your condition but here is an attempt: Mashed beyond recognition and soaked to the bone with sweat of proud warrior women and coated with the funky smell of She-Hulk ass...<br>\r\n<br>\r\n     Jen started removing what was left of her leotard and kicked off her shoes groaning in pain... but She remained in hulk form and clenched her ass cheeks with a wet, sweaty squish, letting you know you are not forgotten.</span></div></div>",
            "created":1494478800,
            "id":2317902,
            "title":"Doing Time as a Wedgie"
        },
        "1312112111111211111111111111111111111111111111111211111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "You are stuck until morning!",
                "You somehow get out of her ass that night."
            ],
            "content":"<div class=\"\"><div> <span>          \"What an absolutely brutal day\" Jen complains loudly as she tromps over to the bathroom. You fume angrily up her ass hearing her complain after what you have just been through and then get smeared left and right as she begins to walk grinding you between her steaming sweaty ass cheeks. Once she is in the bathroom she pulls roughly at your chains wondering if she is going to have to turn back to her human form to get you off. Your body is so broken and battered though that she is able shimmy you off with considerable effort and giggles at the loud and wet POP your body makes when it is finally plucked free from her mountainous ass. As she slides you down her powerful legs you try to speak but only manage to spit out sweat and cough weakly. She smiles as she lets you slide down to the floor and and steps out of the stretched out loops made from your limbs.<br>\r\n<br>\r\n          She picks you up and brings you close to her face before gagging \"Ugh that is raaaaank. You smell like swamp ass.\" By now you are able to yell out at her \"You think!?!? I've been shoved up your ass all day and-\" She simply rolled her eyes and let go of you letting you fall to the floor in a flattened mess. \"Well that's what happens when you break the law and LIE to me.\" You gasp to gain your breath from the fall and weakly begin to confess \"... Alright.. you were right I actually did help-\" STOMP!!! you are cut off yet again as she brought down her big green foot like a hammer squashing you beneath her heel and twisting you beneath her monstrous weight and strength. \"Oh no no no, you had your chance to confess and I said you've got to be punished for a week. Until then I don't want any spoilers.\" She finally lifts her foot off your now plastered form splattered on her titanium tile floor.<br>\r\n<br>\r\n          You think to yourself horrified and in agony \"A WEEK!?!? She's really going to torture me for a week!?!?\" You then see her bring her foot back as she slips her toe into your chains and swiftly kicks. This simple motion for her hooks onto your chains and the force of her movements rips you painfully off the floor like a sticker and you get launched onto her shower floor. You stare at the massive stone walls and huge flat, smooth stones that make up the floor and then see the gorgeous green amazon coming in and carelessly trampling you again beneath her feet. She turns on the hot water and it soon becomes a steamy humid cavern. She happily clenches your mushy body between her toes as she drags you beneath the water with her. She runs her hands through her soaked hair as the steaming water cascades down her smoking hot body before eventually seeping down under her feet finally easing the stinging salty sweat from your body. You get trampled over and over as she turns around in the shower getting all the right angles as the hot water soothes her aching muscles. <br>\r\n<br>\r\n          Finally she decides she has use for you and steps off to hook her finger through your chain and bring your flattened, battered body up to her face. \"AH much better you don't smell too bad now\" She then grabs the soap with her other hand smashed it into you lathering you up against it roughly. The poor soap squishes and practically liquefies in her fists as she mushes you and it together. She then grabs one chain with her left hand and the other with her right and streeeetches your poor body with ease but you are so beat up you can't even whimper in pain. She then starts to use you like a stretched out wash cloth sliding your writhing body across her huge green tits roughly. It almost looks like when a cloth is dragged quickly across a shoe back and forth to polish it. Her heaving tits bounce heavily against your poor body, rapidly pounding against every inch of you before moving on the the next tit. Once they are squeaky clean she starts you drag you violently against her rock hard abs using you like an old fashioned wash board to clean laundry! she laughs at the loud wet -bump bump bump- as your body dislodges and then smashes into the next ab again and again. She then grabs only one side of your chains with her right hand and starts whipping you over her shoulder so your soapy body gets smashed and slammed against her strong back! She catches your other side with her left hand and starts to drag you up and down her spine dragging you across every bit of her back. Your poor body feels like it will be ripped in half when she then lowers you down her huge bubble butt. Even the adamantium chains creek with protest as they struggle to accommodate the strain of her ass cheeks stretching them and you to the limit! She happily pulls you back and forth while also dragging her ass left and right squashing you across her unforgiving ass cheeks. She even bashes her ass against the stone wall just to fuck with you, further adding annihilating pressure to your squashed self.<br>\r\n<br>\r\n          After what feels like forever she lets go and brings you back to her front. You can barely even see at this point from the blinding pain and soap and ass sweat in your eye but you can tell she is starting to straddle you!!! Your red stinging eyes finally focus on the bottom of her ass crack and pussy as she yanks the chains up and wedges your stretched body up both at the same time dragging you brutally back and forth through her cavernous nether regions. She feels every bump of the chain links as they bump bump bump across her pussy and anus  making her pant with each impact followed by the smooth but constant stimulation of your pathetic body dragging against  them like a long shaft. You are soon slathered in the thick ooze of her pussy lubing you down to your core! The chains get slippery too and soon she actually looses her grip with one of her hands and quickly tries to catch it again with her fingers. She lets out a loud moan as she accidentally rammed her finger against your mushy body and stuffed it up her anus leaving only your chains sticking out! Her body instantly makes her anus clench with the same force she used to overpower the amazons one against compressing your body down to the size of a spec! The force was so hard it wrung out every drop of lube from your body with a tiny squirt that escaped her ass. She bites her lip and begins to pull on your chains while still clenching. Your poor body doesn't even budge a microcentimeter but you feel the agonizing force of her pull even among the soul crushing pain of her anus. She growls and uses all her force to drag your minuscule form out of her. It was like two black holes fighting over you! Finally she rips you out and her ass relaxes, your body unraveling back to its tiny form from being compressed to a speck in an instant! You don't ever want to experience that again EVER, but She-Hulk absolutely loved it and hungrily shoves you right back up her ass for another universe crushing anus clench! She just keeps on shoving you in and ripping you out only getting faster and stronger!!! <br>\r\n<br>\r\n          Finally after an our she orgasms but in her ecstasy her fingers slip from your chains while your are still up her ass! Your relentless prison goes beyond over drive as it clenches you with ever increasing force and relaxes before clenching again with the speed of a machine gun!! it must have rapidly chewed you well over 500 times throughout her orgasm alone completely annihilating your body into every crevice of her inner ass. She moans and stumbles out of the shower in a daze barely even toweling herself off before making her way to bed. She falls face first onto her mattress and happily passes out paying no mind to the poor soul that is still trapped and splattered inside every little bit of her ass...</span></div></div>",
            "created":1508994000,
            "id":2406981,
            "title":"She-Hulk Shower"
        },
        "13121121111112111111111111111111111111111111111112111111111":{
            "author_id":"ello",
            "author_name":"someone",
            "choices":[
                "She gets a distress call from wonder woman! (reserved)",
                "What happens today? (reader's choice)"
            ],
            "content":"<div class=\"\"><div> <span>          You are in for a night of suffering as She-Hulk sleeps blissfully. In fact she must having some amazing dreams as sporadically through the night her body would start reacting like it did through her orgasm in the shower violently chewing you in endless torment! You were so desperate for this torture to end that you even wished for a fart to come and blow you out from her hellish asshole. You would have no such luck though and were subjected to a ceaseless barrage of soul smashing clenches through the seemingly endless night.<br>\r\n<br>\r\n          Finally the morning came and She-Hulk sat up happily in bed. \"Wow that was the best nights sleep I've ever had. I feel like a whole new woman!\" She hops out of bed and feels the familiar jingling of your chains getting ground between her cheeks as she walks. Her eyes widen \"Oh fuck you're still in there!?\" She quickly yanks on your chains and a loud POP!!!! fires off as your body is catapulted out of hell. She can barely even tell the flattened blob that emerged from her ass was even human. \"Oh man please tell me I didn't kill you...\" She then sees to tiny bloodshot eyes spinning dizzily and a tiny mouth gasping for air. \"Oh thank God!\" She sighs relieved \"Wow that's pretty incredible, that was a whole lot of horror you just endured and you're still just fine!\" Your body fumes red with anger and inside you are screaming \"JUST FINE!?!?!?!?!? I'M NOT FUCKING JUST FINE!\" even thinking hurt at this point.<br>\r\n<br>\r\n          Then to your horror she simply says \"Day two my little prisoner!\" before she lowers you down to her feet and tugs at your chains stretching you back into 'thong form'. She hums happily as she steps into your loops and starts shimmying you up her legs as you silently scream in horror. She tugs hard as you get stuck at her hips but your broken body relents after considerable force from her part as your body is wedged back up her ass crack and pussy slit. She casually puts on a new leotard and shoes and brushes her teeth before getting a bite of breakfast to start her day!  </span></div></div>",
            "created":1508994000,
            "id":2406986,
            "title":"Day Two of Thong Duty"
        },
        "133":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "You become stuck in her cleavage.",
                "You slide through, further into her suit.",
                "Power Girl feels something in her cleavage."
            ],
            "content":"<div class=\"\"><div> <span><i>Not my finest moment</i>. you mentally berate yourself as you slowly peel your limbs from the deceptively soft-looking surface of the Kryptonian beauty's breast.<br>\r\n<br>\r\n <i>Now, if I could just</i>- with a fierce tug, your left arm comes free, but the momentum of your pull, combined with your unaware tormentor turning to survey the city before her, sends you rolling across the top of the boob.<br>\r\n<br>\r\nYou try desperately to catch yourself, to grab hold of something, ANYTHING to stop yourself, but the sheer fleshy surface yields no handholds, and your roll turns into an accelerating slide.<br>\r\n<br>\r\nDesperately, you glance above you, hoping that the heroine might have felt your movement, but massive head remains fixed forward at the bright lights of the city. And so, longing for something, anything to save you, you slide, feet-first, into the narrow valley of Power Girl's cleavage.</span></div></div>",
            "created":1589842020,
            "id":2837707,
            "title":"New Breast Friend!"
        },
        "1331":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "She gets a call, and heads off to investigate.",
                "She's surprised attacked by a Supervillan!",
                "She calls it a night, and heads home."
            ],
            "content":"<div class=\"\"><div> <span>As you quickly slid out of sight, you could see the seemingly endless wall of flesh of Power Girl's left breast rapidly coming closer the further you slid into the narrow gap of her cleavage.<br>\r\n<br>\r\nAs your space ran out, you felt your body begin to flatten, your facial features being pressed inwards, and you slid roughly to a stop.<br>\r\n <br>\r\nYou barely had time to catch your breath, and see the futility of your situation, before your unaware hostess inhaled, further mashing her breasts together, and the unyielding Kryptonian flesh brutally compressed you. <br>\r\n<br>\r\nAs they separated again, you were briefly stretched between the two, before snapping back to the right breast. As your body began to reinflate, the massive heroine inhaled again, undoing your progress, and further mashing your body against her breast.<br>\r\n<br>\r\nAs Power Girl continued to unknowingly torture you, suddenly...</span></div></div>",
            "created":1589865780,
            "id":2837874,
            "title":"Your Main Squeeze"
        },
        "13313":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "Success! You escape from Power Girl!",
                "Partial Success! You are sent flying further back into Power Girl's chest!",
                "Failure! You're stuck tight!"
            ],
            "content":"<div class=\"\"><div> <span>Kara Zor-El, the Last Daughter of Krypton, was tired. It had been a long and frankly, busy day, followed by a quiet, peaceful night. <br>\r\n<br>\r\nAfter mulling it over, she decided that unless anything of a Kryptonian-level of importance came up, the other heroes could manage with her heading home early. With one last glance at the cityscape, she took off for her apartment, where sleep beckoned.<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- --------<br>\r\n<br>\r\nAs the Woman of Steel pondered her course of action, you were beginning to lose your mind. The rhythmic cycle of crushing with no time to even attempt to extract yourself from your current predicament was maddening. At the very least, your body had stopped trying to re-inflate.<br>\r\n<br>\r\nUnfortunately, the trade-off was that now, you were steadily being adhered to the side of Power Girl's breast. with every breath, you could feel yourself sticking more and more, the combination of your suit's leathery texture mixed with the sheen of sweat coating her body, was slowly tattooing you to her flesh. <br>\r\n<br>\r\nSuddenly, you felt your erstwhile prison shift, tilting forwards, before a rush of wind swept through the opening of the suit above you, that had previously shown only the face of your tormentor, and the night sky, now you saw the tops of buildings rushing past at breakneck speed. As the wind blasted past you, you saw the 'landscape' around you begin to shift, as the narrow canyon of cleavage was forced into a wind tunnel. <br>\r\n<br>\r\nDesperately, you tensed every muscle you could, trying to utilize this temporary reprieve to pull away from your fleshy prison. </span></div></div>",
            "created":1589880900,
            "id":2837929,
            "title":"Wind Tunnel of Love"
        },
        "133132":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "Shower, then bed",
                "Sleep first, shower in the morning",
                "Food before anything else"
            ],
            "content":"<div class=\"\"><div> <span>Slowly, far to slowly for your liking, you felt your body beginning to peel away from the mighty mammary that was holding you captive. once you no longer felt any pressure on your back, you began to jerk your limbs, growing more and more anxious to free yourself and depart your confinement before Power Girl reached her destination.<br>\r\n<br>\r\n'<i>Come on, almost</i>'... You mentally shouted at yourself, your right side only held down by your hand and foot. With one last herculean effort, you managed to rip your limbs free! You felt a rush of elation course through you. Your first night as a hero may have had a crappy start, but now you could finally start your evening of crime-fighting, and nothing would-<br>\r\n<br>\r\nUnfortunately for you, the laws of physics and aerodynamics cared not a whit for your hopes and dreams. As soon as you had freed a side of your body, the wind rushing past you had caught your flattened form like a sail, whipping you back and forth like a flag on a car antenna, slapping you repeatedly, forward and backward, into the tit you naively thought you had just escaped.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------<br>\r\n<br>\r\nAs Power Girl streaked across the skies of Yorktropolis, she decided that there were few joys greater than the thrill of flying. Unfortunately, this particular thrill came with several downsides. The biggest being the birds, she decided, as her super-hearing picked a flock of geese ahead. Deciding to avoid any more hazards, and take the more direct route home, she started to dive downwards. towards the lights of the city.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------<br>\r\n<br>\r\nJust as you had surrendered yourself to this fresh new hell of your own making, the wind suddenly escalated in intensity, briefly redoubling your whipping motions, before an almighty gust ripped your left limbs from the surface of the breast, and you had a brief feeling of flight, before what felt like a freight train slammed into from behind, forcing you flat against it. blinking away the black spots that danced across your vision, you forced your eyes to focus, and as the wind died down, and you felt your unwitting transport began to slow, you observed from your new vantage point. <br>\r\n<br>\r\nYou saw the place of your imprisonment, and the outline of your form in her sweat. In fact, you could see the whole of Power Girl's cleavage laid out before you, the narrow canyon stretching onwards, to where it terminated in a wall of white. Beneath you, you could see only the beginning of a vast plane of skin, before it too merged with the white fabric of the suit. All the while, overhead, the opening of her costume displayed the outside world like an IMAX screen.<br>\r\n<br>\r\nAnd with your grand efforts at escape, all you had managed to do was merely transfer yourself from being flattened by Power Girl's boobs, to being flattened against her sternum. Now, thoroughly exhausted by the whole ordeal, and your consecutive failures, you decided that now, the best option would be to wait. And so, you did the only thing you could: you watched, and you waited.<br>\r\n<br>\r\nWatched as Power Girl finally stopped in front of a window, opening it and entering what you could only assume was her apartment, watched as the cavernous walls of your prison sprang to jiggling life with every footstep she took, watched as your 'sweat-angel', the only barely visible evidence of your plight,  was smeared away into nothingness by the mashing motions of her cleavage(and fleetingly felt relieved that you were, at the very least, no longer in immediate danger of that particular fate). All you could do now was watch, as your foreseeable future was decided for you.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ----- <br>\r\n<br>\r\nKara was glad she'd decided to head home when she did. She had barely entered her apartment, and already she felt the gentle pull of sleep. \"Well,\" she muttered to herself, \"What'll it be tonight?\"</span></div></div>",
            "created":1590231360,
            "id":2839898,
            "title":"Upgraded to a window seat"
        },
        "1331322":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "Shoot for it! (Risky)",
                "Climb for it! (Safer)",
                "Something interrupts your plans!"
            ],
            "content":"<div class=\"\"><div> <span>Power Girl yawned as she made her way to her bed. \"Not like I'm expecting company.\" She muttered sleepily, unclasping her cape, and kicking off her boots, before collapsing into her bed, and within a few minutes, sleep claimed her.<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ----------------------------------<br>\r\nAs your host drifted off to sleep, you breathed a quiet sigh of relief. Now that she had stopped moving, you decided that this was your best chance to try and escape your current predicament. You began slowly, afraid that any sudden motions might wake your captress. Tensing the muscles in your neck, you strained and pulled, stopping to regain your strength, and tried again. Slowly, you began to feel the back of your head coming free, slowly peeling like a stubborn price sticker. <br>\r\n<br>\r\nAfter several minutes had passed, with one last mighty tug, you felt your head finally rip free from Power Girl's sternum. \"This is going to be a long night.\" You quietly groused, as your set to work on freeing the rest of your body. As you struggled, you felt your prison begin to shift. Glancing above you, you could see that the massive heroine was shifting onto her side, giving you the momentum to rip your left arm free, before she finished rolling over, and your little opening was now completely compacted by her breasts. <br>\r\n<br>\r\n\"Oh, come <i>on</i>.\" You wheezed, desperately pushing at the suffocating wall of tit-flesh with your one free arm, while now frantically tugging at the rest of your body. You could already feel the temperature beginning to rise, and your body was being coated in a disgusting mixture of old and new sweat, and you could already feel the pores behind you tugging at your mask again. In a last ditch effort, you yank your head forwards, with your mask being ripped from your head, and claimed by the massive sternum in your head's place. <br>\r\n<br>\r\nYou then lowered your head, and seized your other arm in your teeth, frenziedly trying to free it. below you, you felt, one of your legs finally tear free, though the tearing sound that followed suggested that the leg of your costume had been left behind. You then braced your knee against the your knee against the encroaching boob, planting your foot against the sternum, and pushed with all your might. <br>\r\n<br>\r\nWith a muffled cry of animalistic fury, you ripped your right arm free. While shaking it in the hope it would reinflate faster, you pushed off with your leg once more, and felt the rest of your body come free. With a glance around you, you saw that your salvation had come at the near-total sacrifice of your super-suit, which had come between you and your captor's body. <br>\r\n<br>\r\nGiving your body a moment to resume it's three-dimensional shape, you planned your escape. Thinking quickly, you came up with two options. If you timed and angled it right, you might be able to shoot yourself out of your cleavage trap like soap under a foot. Or you could try and climb up towards her collarbone, and escape that way.</span></div></div>",
            "created":1590979020,
            "id":2843849,
            "title":"Between a Rib and a Soft Place"
        },
        "13313222":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "She heard you, and wakes up",
                "She didn't hear you, and stays asleep",
                "She heard you, and rolls over in her sleep"
            ],
            "content":"<div class=\"\"><div> <span>While you briefly considered your first plan, you decided that too much could go wrong. The last thing you wanted was to risk undoing all your progress on a 'maybe.' So you resigned yourself to the rough climb ahead of you, turned so that your back was pressed firmly into the boob above you, planted your feet on the boob below you, and began to slowly crabwalk to the right, and towards freedom. <br>\r\n<br>\r\nIt was painfully slow going, making sure you always had firm footing, in complete darkness, moving between breaths, as a combination of your sweat, and your captors, streamed over your body, all the while your ears assaulted by a combination of bassy heartbeats behind you, the quiet, sticky <i>squelch</i> of your hands and feet impacting sweaty flesh, and the horrendously wet snoring coming from above you, loud as thunder.<br>\r\n<br>\r\nEvery few steps, as you inched along the narrow path, one of your hands or feet would fail to find purchase, and you would have to pause, carefully trying to maneuver yourself past the spot in the narrow window of time you had available between breaths.<br>\r\n<br>\r\nFinally, after what felt like an eternity, you could feel the narrow gap of cleavage beginning to widen. You were nearly there! And not a moment too soon either, as you could feel the 'landscape' beginning to shift again. Wild-eyed, panting like a racehorse, and abandoning all sense of caution, you desperately leapt what you hoped was the remaining distance, praying that you would impact upon the bed, and not more of the seemingly endless plateau of flesh. With your heart in your throat, you sailed through the air, before-<br>\r\n<br>\r\n<i>THUMP</i>!<br>\r\n<br>\r\nYou hit the soft, spongy surface of the bed, your slicked-up body sliding briefly along the sheet, before coming to a stop. You hauled yourself to to your feet, slicked back your sweat soaked, grungy hair,  and in the dim light of the alarm clock, saw Power Girl laid out on the bed like an enormous beached leviathan. You felt such a wondrous relief flood every inch of your body, and before you could stop yourself, you cried out in joy, \"YES!\"<br>\r\n<br>\r\nRealizing your mistake, you froze , hands clamped over your mouth, staring at the sleeping heroine like a deer frozen in headlights. Praying that her super hearing didn't pick up your cry.</span></div></div>",
            "created":1590990480,
            "id":2843923,
            "title":"Spelunking"
        },
        "133132222":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "PG's friend Atlee, crashing on the couch for the night",
                "Catwoman OR Black Cat turning the palce over",
                "Power Girl!?"
            ],
            "content":"<div class=\"\"><div> <span>After a few moments, it was clear that Power Girl would not be waking up anytime soon, '<i>Small wonder she can't hear me over all that snoring.</i>' you winced. Even without being enhanced by the echo chamber of her cleavage, the noise was still near-deafening. '<i>Must be a side effect of having such powerful lungs.</i>' you pondered as you made your way to the edge of the bed. <br>\r\n<br>\r\nKnowing she was still sound asleep, you allowed yourself to jump the full distance from the bed to the floor, knowing you'd have ample time to reform. With a quiet splat, you crumpled flat all the way to your waist, and used the time you spent reforming to peel the remnants of your shredded costume from your body. \"Well,\" you muttered, \"That's unfortunate.\"<br>\r\n<br>\r\nAfter your legs had re-inflated, you began to make your way towards the dim outline of the bedroom door, and the apartment beyond. You briefly wished you could return to your normal height, but you would need to fully recover, first. Although you may have had your full range of movement, you were still tired and sore, and decided that it would be best to simply find a quiet spot somewhere to rest and heal. You would sneak out in the morning, after Power Girl left.<br>\r\n<br>\r\nOn your way out the door, you stopped at the discarded cape laying in the middle of the floor, looking to you like a deflated circus tent. grabbing a corner of it, you managed to wipe of the worst of the layers of sweat coating you, though the smell remained.<br>\r\n<br>\r\nAfter setting off down the darkened hall, you found yourself in a small living room. After a moment's deliberation, you headed for the couch. It was the closest hiding place to the door. You had reached the middle of the room when you noticed the cat. A fat ginger tabby curled up on a small bed next to the couch. It seemed to be asleep, but you weren't willing to take any chances. Thinking quickly, you crept to the opposite end of the couch, and clambered up onto its cushions. If you tucked yourself in between the cushions, you thought you would be able to evade detection from the cat, or it's owner. At the very worst, if you were sat on, you would be stuck to the couch, and could reform at your leisure.<br>\r\n<br>\r\n So absorbed in thought were you, that you failed to notice the massive dark shadow moving behind you. As you crept along the couch, you heard none of the silent footfalls as the figure padded across the floor. When you reached the gap between the cushions, you took one last look over your shoulder, checking that the cat wasn't sneaking up on you, only for your eyes to widen as you saw...</span></div></div>",
            "created":1590995820,
            "id":2843950,
            "title":"She didn't hear you, and stays asleep"
        },
        "1331322221":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "The night passes without incident",
                "Something occurs"
            ],
            "content":"<div class=\"\"><div> <span>In the soft glow of the city lights bleeding in through the window, you saw the enormous form of the superheroine Terra sleepily stumbling towards the couch. Hurrying, you shoved the cushions apart, and tried to shove your way between them. <br>\r\n<br>\r\nYou managed to fit your body into the narrow opening, only for your arm to become tangled in a loose thread. You popped your upper body up, feverishly trying to free your arm, only for a massive shadow to loom over you. Looking up, saw the spandex-clad rear of the heroine plummeting towards you.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ----<br>\r\n<br>\r\n'<i>Stupid surface world needing money for lodgings.</i>' Terra idly thought as let herself into the darkened apartment. '<i>I'll apologize to Kara for crashing here in the morning. She'll understand.</i>' Drowsily making her way to the couch, she quickly plopped herself down before she could change her mind, grinding her body into the gap between the cushions, before laying her head back, and returning to sleep.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------<br>\r\n<br>\r\nYou were beginning to wish you had simply stayed home. Your evening had gone from bad to worse, you had failed to make your grand heroic debut, and now here you were, crushed once again. Only this time, you saw no way out. This time, you were smeared face-first to an ass, and the heroine who it belonged to once again had no idea you were there. <br>\r\n<br>\r\nwith your face flattened against this prodigious posterior, you had no way of gauging the situation. And with your back pressed up against the couch cushions, you had no space to try and remove yourself. All you could do now was to try and sleep, and wait for morning.</span></div></div>",
            "created":1591139460,
            "id":2844935,
            "title":"Buried by a Rockslide"
        },
        "13313222211":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "\"Found them!\" (She sees you)",
                "\"Nothing.\" (You evade detection)",
                "\"No sense hiding anymore.\" (You show yourself)"
            ],
            "content":"<div class=\"\"><div> <span>Sleep, if you could even call it that, came in fits and starts. Your dreams were haunted by the night's events, and you would often jolt awake, hoping it had all been a bad dream, only to find yourself still unable to see, unable to move, unable to do anything.<br>\r\nAfter it seemed as if an eternity had passed, you finally felt your surroundings begin to shift, and rise. '<i>Must finally be morning.</i>' you thought. <br>\r\n<br>\r\nThen you felt the flesh around you begin to shake, and you with it, as powerful footfalls propelled your captor to her destination.<br>\r\n<br>\r\nSuddenly, you felt the harsh grating of fingernails against your back, as one of them managed to scoop your head into it's groove, peeling your body back with it's motion. As the fingers receded, light flooded your vision, your eyes adjusted after so long in complete darkness, and you were granted a shaky upside down view of the living room growing further away, as your body had been ripped halfway free!<br>\r\n <br>\r\nHowever, this time you did not begin to re-inflate, no doubt due to the fact that you had been trapped for hours. Still, you took a small amount of comfort in having your senses restored, as you were carried along into the kitchen.<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -------<br>\r\nOnly half-awake, Terra blearily made her way to the kitchen, idly scratching an itch on her backside, before plucking the spandex of her costume out of it's current wedge. while comfortable in combat, super-suits were never designed for casual wear. Scanning the contents of the fridge, she decided that omelets would serve as a suitable apology.<br>\r\n<br>\r\nAs she whisked the eggs, Terra felt the itch return. Lacking a free hand to deal with it, she backed up against the countertop, before slowly scraping her butt down it. This seemed to do the trick, and she refocused on her work.<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -------<br>\r\nAs your body continued to sway along nauseatingly, you began to feel yourself regaining some small amount of three - dimensionality, and as your upper body re-inflated while flopping about, those motions began to pull at your still flattened legs, and started to pull them loose. Determined not to fall to the floor, you quickly managed to grab onto the hem of Terra's uniform, so that instead of falling, your recovering form was slapped against the heroine's backside with every step she took.<br>\r\n<br>\r\nShe must have felt you, as you could feel her begin to back up. Glancing behind you, you could see the countertop rapidly approaching. As soon as your feet were safely hanging over the counter, you released your hold, and dropped to the surface of the counter-<br>\r\nJust in time for the rear you had just escaped from to slam down directly in front of you so close that it skinned your nose, landing on your feet and holding you in place, before it was dragged downwards. You felt every inch of the cheek, down to the last pore, as it's length was dragged over you, the friction parting your lips, tugging at your jaw, and flowing into your mouth, forcing you to unwillingly kiss what felt like endless yards of booty. <br>\r\n<br>\r\nFinally, as if seemingly satisfied with the last dance of the last fourteen hours' humiliation conga line, the meteoric abdomen receded, and the massive figure of Terra stepping away from the counter. quickly, you ripped your feet up from the smooth granite of the countertop, and made your way to cover behind the nearby spice-rack, your squashed and stretched feet flopping like scuba flippers. <br>\r\n<br>\r\nOnce you were safely in cover, you grabbed your tongue, stretching it slightly out of your mouth, and frantically tried to wipe the cloying taste of stale B.O from your mouth. As your fruitless efforts continued, you suddenly heard the boom of voices coming from behind you. Peering around the spice-rack, you saw Power Girl, clearly not a morning person, shamble into the kitchen.<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -----------------------------------------------------<br>\r\nKara liked to think that see was a patient woman. No matter if she was dealing with her company's Board of Directors, or the latest rampaging supervillain, she always tried to keep a level head. (Not that she always succeeded, of course.) But when faced with the scene in her kitchen, even in her half-awake morning form, she could already tell that today would be taxing.<br>\r\n<br>\r\n\"Good morning, Kara!\" Her quasi-sidekick called, with a chipperness did not belong anywhere <i>near</i> her morning.<br>\r\n<br>\r\n\"What is it this time, Atlee?\" she grumbled. Due to being from the subterranean world, Atlee often ran afoul of the customs and rules of the surface, which usually led to her camping out in her living room. And sure enough:<br>\r\n<br>\r\n\"I... I might have forgotten that rent is a thing you people do up here\" This explanation was followed up by a 'Please-don't-be-angry-with-me' look.<br>\r\n<br>\r\nKara's hand pinched the bridge of her nose. \"We'll find you a new place to live. After breakfast.\"<br>\r\n<br>\r\nAtlee grinned. \"Thanks, Kara! You're such a good friend!\"<br>\r\n<br>\r\nKara sighed, already picturing the hours - if not days - it would take to find her somewhere suitable. \"I sure am.\"<br>\r\n<br>\r\nAtlee suddenly looked contemplative. \"What's that?\" She asked pointing at Kara's chest. Looking down, Kara could see the top of <i>something</i> sticking out of the top of her cleavage. Reaching down, she gently tugged at, hoping that it wasn't another bird. With her super-strength, she rarely noticed any impacts when flying, which could lead to various airborne objects and animals becoming wedged in there. Whatever it was, it seemed to be pasted to her skin, but with a quick tug, she managed to rip the mystery object loose, before holding it up for inspection with her supervision.<br>\r\n\"It's a... mask?\"<br>\r\n<br>\r\nAtlee gasped. \"Did you hit the Wasp again?\"<br>\r\n<br>\r\nKara grimaced at the reminder. \"No, Janet makes it a point to never come near my patrol routes these days.\" She squinted at the mask again. \"I don't recognize the design...\"<br>\r\n<br>\r\nAtlee set the mixing bowl on the counter, before pulling at the window of Kara's suit. \"Maybe whoever it is is still trapped in there! Hello!\"<br>\r\n<br>\r\nKara pulled Atlee's head out of her chest. \"Hey, personal boundaries! We talked about this.\" she reached down into her cleavage, feeling around for anything else. \"I'm perfectly capable of searching my own body, thank you very much.\" feeling something in her grip, she pulled her hand back up. But instead of a traumatized heroine, she instead pulled out the torn remnants of the rest of the costume.<br>\r\n<br>\r\nAfter they both stared at it for a moment, Atlee seemed to have an idea. \"They must have escaped! But then she must still be here somewhere, right?\"<br>\r\n<br>\r\nKara nodded. \"I'll find her.\" Activating her X-ray vision, she started to sweep the apartment.</span></div></div>",
            "created":1595916960,
            "id":2876728,
            "title":"Early to bed, Early to rise"
        },
        "133132222111":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "You tell your story, and she believes you.",
                "You tell your story, and she doesn't believe you.",
                "You lie, and...?"
            ],
            "content":"<div class=\"\"><div> <span>After you saw the titanic figure of Power Girl enter the kitchen, you knew it was only a matter of time until she found you. Her 'X-Ray Vision' would make it impossible to hide, even at your reduced size. <br>\r\n<br>\r\nFrantically, you searched your hiding place for anything that might allow you to face your discovery with some small scrap of dignity. Hearing raised voices, and footsteps approaching you, you quickly tore a small price-sticker off the back of a jar, wrapping it around your waist like a kilt.<br>\r\n<br>\r\nNot a moment too soon either. right as you finished affixing your impromptu garment, a massive hand reached over your hiding spot, before firmly, but gently grabbing you, and bringing you out into the open, as your world dizzying blurred, your body swung through the air pinched between two fingers, as one might carry a suspicious sock. <br>\r\n<br>\r\nWhen your eyes stopped spinning in their sockets, you could see two faces, both bearing shocked expressions. As you waited for whatever was to come next, you heard the black-haired one-<i>Terra</i>, you reminded yourself- say, \"That... doesn't look like a woman to me.\"<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -------<br>\r\n<br>\r\n\"There! On the counter!\" Moving quickly, Kara stepped over to the counter and, keeping one eye on the small outline her enhanced vision showed her, reached a hand over the spice-rack, lightly pinching the figure between her thumb and forefinger, before drawing them out. <br>\r\n<br>\r\nAlmost immediately, Terra was crowding around her, leaning in so close her eyes were practically crossed, to observe their uninvited guest. Sighing at her friends excitability, Kara nudged her back with her free hand. \"They're already scared enough, don't crowd them.\" <br>\r\n<br>\r\nAtlee grimaced sheepishly. \"...Sorry.\" she muttered, before bouncing back into excited mode. \"Well? Who is it?\" <br>\r\n<br>\r\nThe two turned their attention to the figure for a moment, before their gazes turned to those of confusion, then shock.<br>\r\n<br>\r\n\"Um...\" Kara managed, before Atlee blurted out, \"That doesn't look like a woman to me.\"<br>\r\n<br>\r\nDespite the enormity of what she held in her hand, Kara couldn't help a slight eye roll. \"Very observant, Atlee.\"<br>\r\n <br>\r\nAs her mind began to fill with explanations for how this could be possible, she observed the little man in her grasp. As she searched his face for any familiar features, she noticed the all-too-familiar look of a man who'd been caught staring at her breasts. <br>\r\n<br>\r\nHer mind then began to point out that this...this...miniscule MAN had, at one point been firmly wedged in her cleavage. The fingers that held him quickly became a fist. Walking over to the kitchen table, she unceremoniously dumped the man onto the table, before taking a seat in front of him. \"I think you had better start talking,<i> pal</i>.\"<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -------<br>\r\n<br>\r\nAs you hung suspended in the air between the two arguing Titanesses, you thought now would be as good a time as any to prepare your story. '<i>After all,</i>' you thought '<i>This whole thing was all just one big accident.</i>' You remembered how you dealt with unwanted questions from reporters; only give as much information as the question requires, and volunteer <i>nothing</i>.<br>\r\n<br>\r\nAs you thought back on the events that led you here, your gaze tipped downwards towards the start of your journey, and the twin reasons why you were now stuck in this predicament. While you had been trapped within them for hours, you hadn't really had the chance or inclination to truly appreciate them. As Power Girl's attention was now on Terra as she talked, her hand had lowered slightly, bringing you down to eye-level with her boobs.<br>\r\n<br>\r\nAnd there they hung before you, the siren's call of her cleavage beckoning from within the suit window that had been your doom. The narrow canyon continuously compressed by massive tits, each large enough to comfortably cover a house, from your current perspective. <br>\r\n<br>\r\nAs you watched, enraptured, you saw the last few miniscule torn shreds of your costume, pasted to her flesh. you idly wondered if she would ever even notice them, much less be able to remove them. Thinking back to the events that caused them to be stuck there, you idly wondered if you'd ever be able to get the rank odor of her titsweat off of you, when you felt <br>\r\nthe sensation of being watched. <br>\r\n<br>\r\nRaising you gaze, you saw Power Girl staring at you, her expression rapidly becoming angry. Suddenly, the fingers holding you began to squeeze you tighter, slightly crushing your chest, before the rest of her hand closed around you, clenching you in her fist. <br>\r\n<br>\r\nA moment later, you were roughly deposited onto the kitchen table, before, Power Girl slammed herself down into the chair in front of you, the forceful movement once again drawing your eyes to her chest as it lightly bounced from the act. <br>\r\n<br>\r\nHer frosty tone, however, wiped any remaining lecherous thoughts from your head. \"I think you had better start talking,<i> pal</i>.\"<br>\r\n</span></div></div>",
            "created":1599637740,
            "id":2899873,
            "title":"Is it really a first impression?"
        },
        "1331322221111":{
            "author_id":"venividivici45",
            "author_name":"matthias",
            "choices":[
                "Would you be interested in working together?",
                "I can't let you leave!",
                "Did you...Enjoy it?"
            ],
            "content":"<div class=\"\"><div> <span>Being glared at by a woman who can bench-press a skyscraper wasn't exactly how you'd hoped this would go, and was an excellent way to lose your nerve. Wincing under her gaze, you managed, \"This is all a big misunderstanding, I promise.\"<br>\r\n<br>\r\nThe glare gained a few more degrees of intensity. \"That really how you want to start this out?\" She spat angrily. \"When I said <i>start talking</i>, I meant I wanted an explanation.\"<br>\r\n<br>\r\nYou opened your mouth to start again, only to be interrupted by Terra, who had taken a seat to Power Girl's left. \"Wait, you can hear him?\"<br>\r\n<br>\r\nKara transferred her glare to the girl. \"Enhanced hearing. Now don't interrupt, I want to hear how our 'guest' intends to lie his way out of this.\"<br>\r\n<br>\r\nYou suppressed the urge to yell that you weren't lying, But it really wouldn't serve any purpose to do so. Steeling yourself, you launched into your tale. \"Well, last night, I had decided to make my heroic debut, maybe stop a few crimes, get my hero name out there, that sort of thing. I was getting ready to start my night when I was... interrupted.\" You paused for a moment, picking your next words carefully. \"You sort of...ran into me.\"<br>\r\n<br>\r\nPower Girl snorted derisively. \"Yeah, right. and I suppose that your little 'Fantastic Voyage' was somehow my fault, too.\"<br>\r\n<br>\r\nYou nodded. \"Technically, yes.\"<br>\r\n<br>\r\nHer glare turned slightly more murderous. \"I'll give you a chance to re-phrase that.\"<br>\r\n<br>\r\n\"I... That is to say my suit has- or rather, it <i>had</i> a built in glider.\"<br>\r\n<br>\r\nShe huffed. \"I think I would have remembered seeing someone else flying around last night.\"<br>\r\n<br>\r\n\"It only works when I'm shrunk down.\" You really didn't want to come right out and say it, if only because you had no idea how the proud Heroine might react. Better to lead her the truth.<br>\r\n<br>\r\n\"And so what, you wanted a closer look?\" She leaned down towards you, her chest almost laying on the table in front of you. \"I'm sure that at your size they must really be something else.\"<br>\r\n<br>\r\nWell, so much for that idea. Valiantly maintaining eye contact, you pushed on. \"No. I mean, yes, they are, but no, no I did not - I mean-\" Yes. Very valiantly indeed. \"Look, I was gliding over the city, I tried to land, and then YOU slammed into ME Tits-first going Mach 5!\" And possibly slightly annoyed at this latest turn of events.<br>\r\n<br>\r\nFor a moment, you thought Power Girl was going to crush you like a bug, but after a few moments, her face changed from angry to shocked. \"You...You're telling the truth...\" she breathed, her expression evolving into embarrassment. \"I- I'm so sorry! I'm just so used to hitting things like birds, and newspapers, and-\" She brought her hands up to her face. \"Oh, God, it's the Wasp all over again!\"<br>\r\n<br>\r\nThis was not the reaction you'd been expecting. \"How did you know that I was-\"<br>\r\n<br>\r\n\"Enhanced hearing, remember?\" Terra had lowered her head, practically laying it on the table, no doubt so she could hear you. \"She was listening to your heart rate, to find out if you were telling the truth! She does it all the time when we're out on patrol.\"<br>\r\n<br>\r\n\"Ah.\" You glanced back at her, now shaking her head and moaning about careless mistakes, before looking back to Terra. \"Is she gonna be alright?\"<br>\r\n<br>\r\nTerra nodded, narrowly avoiding bashing her chin into the table. \"Give her a second to process the whole thing. This isn't the first time this has happened, you know.\"<br>\r\n<br>\r\nYou nodded. \"She keeps saying something about the Wasp...?\"<br>\r\n<br>\r\nTerra grimaced. \"Yeah.\" She lowered her voice to a whisper. \"A few years ago, all heroes had intersecting patrol routes, to ensure that there was always backup close by. Well, one day, PeeGee was crossing through her shared segment with Wasp, and there was a... collision, kinda like with what happened to you.\"<br>\r\n<br>\r\n\"And how did Wasp escape?\" You briefly wondered if she'd found a better solution.<br>\r\n<br>\r\nTerra grimaced. \"She didn't. Poor woman almost died in there. Kara's super strength applies to every part of her. Though I'm sure you're aware of that by now. She was in there until Kara's shower the next morning, and almost got washed down the drain. Costume shredded, wings crumpled, and a LOT of broken bones. Come to think of it, why don't you have any?\"<br>\r\n<br>\r\nYou were not prepared to reveal your other power just yet, so you quickly deflected. \"So, her name's Kara?\" You asked slyly, causing Terra to quietly 'eep' and cover her mouth. You chuckled, masking your relief before turning your attention back to Kara as she managed to calm herself.<br>\r\n<br>\r\n\"So,' she managed, before grimacing. \"What happened next?\"<br>\r\n<br>\r\n\"After you finally stopped flying around, I managed to peel myself off of your chest. Unfortunately, then...\"<br>\r\n<br>\r\nAnd so it went for some time, as you recounted events of the last ten hours or so, explaining everything, including, reluctantly, your squishy properties. By the end of it, Power Girl's face was bright red, and Terra was tearfully apologizing. \"-I swear, I never meant to-\"<br>\r\n<br>\r\nYou laughed and waved her off. \"Terra, I already told you I forgive you. I was an accident, just like everything else.\"<br>\r\n<br>\r\nPower Girl cleared her throat. \"I suppose I should return these to you. I, uh, found them in my...well, you know.\" reaching out her other hand, she held the remnants of your costume.<br>\r\n<br>\r\n\"Thank you.\" You picked up the only intact piece, the mask, and inspected it. Both of the eyepieces were shattered, it stank, and it was absolutely drenched. Wringing it out, both you and Power Girl winced at the <i>river</i> of sweat pooling onto the table.<br>\r\n<br>\r\n\"Well...I think I'm going to head home, and get some sleep.\" Stepping to the edge of the table, you willed your self to grow back to your normal size. Stepping off the table, your growth slowed, before stopping back at your usual height. You noted with some embarrassment that you were in front of two very beautiful women, your body reeking of sweat, wearing only a now giant-sized price sticker, and that Power Girl was several inches taller than you. \"Thank you for your hospitality, ladies.\"<br>\r\n<br>\r\nAs you reached the front door, your hand was just about to grab the doorknob when Power Girl called out, \"Wait!\"<br>\r\nYou turned back to face her as she followed you out of the kitchen.</span></div></div>",
            "created":1599720060,
            "id":2900377,
            "title":"A Series of Unfortunate Events (For You)."
        },
        "15":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "It's Hero Time",
                "I'm a Smooth Criminal",
                "Go to another part of town",
                "Get some sleep",
                "Take advantage of this once in a life time opportunity \"wink\" \"wink\""
            ],
            "content":"<div class=\"\"><div> <span>You arrive safely on Main Street there you just barely dodge the gigantic feet of the citizens, \"better be careful' you thought to yourself.  You shrunk to the size of an inch to avoid getting spotted, you wanted to know the city before the city knows you, you've heard a lot about Yorktopolis it's been called the \"Metahuman Capital of The World\" due to the ridiculously high amount of people with superpowers, apparently superpowers only affect people with the x chromosome so you're really something special.<br>\r\n<br>\r\nEventually you see a fight it seems that Wonder Woman, Black Canary, Zatanna, She Hulk, Black Widow, and Spider-Gwen the current lineup for The Avengers League were fighting Harley Quinn, Giganta, Enchantress, and Mystique<br>\r\n<br>\r\n\"Give it up ladies we outnumber you\" said She Hulk, \"Ah Shut up Greenie\" said Harley as she fired missiles at the heroes, \"reappasid selissim\" Zatanna said causing the missiles to disappear.<br>\r\n<br>\r\nThe heroes and baddies soon fought each other Giganta became a 100 foot tall monster targeting the weaker heroes while Zatanna and Enchantress got into a magic duel.<br>\r\n<br>\r\nYou figured you should do something but which side should you take.<br>\r\n<br>\r\nShould you be a hero, the heroines were hot and the city would love you.<br>\r\n<br>\r\nShould you be a villain, the villaneses were also quite sexy and you feel that you should still keep a low profile.<br>\r\n<br>\r\nShould you turn a blind eye and leave, maybe there's another adventure in a different side of the city.<br>\r\n<br>\r\nShould you just go home and wait till tomorrow to make your first moves.<br>\r\n<br>\r\nShould you sneak up on the battle and secretly do some perverted stuff on both teams.<br>\r\n<br>\r\nSo many options to choose from, so what's it gonna be?</span></div></div>",
            "created":1492405200,
            "id":2306419,
            "title":"You make it to main Street"
        },
        "151":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "Training ",
                "Swimming",
                "Scouting"
            ],
            "content":"<div class=\"\"><div> <span>You've decide to hero up and headed towards the battlefield.<br>\r\n<br>\r\nYou grew back to normal size and saved Black Canary from one of Giganta's pummels, \"Oh my God thanks you' Canary said.<br>\r\n<br>\r\n\"What's up citizens, heroines, and baddies of Yorktopolis, my name is The Black Gecko and i am the first Male Metahuman and my power is to shrink and become more durable the tinier i become, i hope to be a service to this great city and i'll start by getting rid of our supervillain problem\" you announced.<br>\r\n<br>\r\n\"Well Gecko lets see how well you do\" Wonder Woman said, \"NOW LETS BEAT THESE BADDIES\" she roared.<br>\r\n<br>\r\nYou and Black Canary headed towards Harley together, \"It's nice knowing you've got my back\" she said, \"thanks you're um cool too\" you stuttered, Harley shot some rockets but you shrank and dodged them while Canary outmanuvered the rockets, \"aw poop' Harley said as Canary blasted her with her sonic scream, \"Nice teamwork new guy\" she said.<br>\r\n<br>\r\nMeanwhile Giganta was keeping the team at bay, you asked Canary to throw you up and she did, you landed on Giganta's hair and swandived into her body, \"Hey what the hell\" she growled, this distraction proved to be useful as Wonder Woman and Spider-Gwen knocked her out.<br>\r\n<br>\r\n\"You hopped away from her body and landed next to mystique's giant boot, 'Game Over' she said but She Hulk lifted her up with ease, \"Why don't you pick on someone your own size, or bigger\" she said as she knocked Mystique out cold, \"Nice Job little man\" she said, you gave her a thumbs up as you and She Hulk headed for the final baddie Enchantress.<br>\r\n                                                                                                                                                                                                                                   \"YOU WILL NOT DEFEAT...\" Enchantress was cut off by Wonder Woman who caught her with her lasso.<br>\r\n<br>\r\nThe city cheered for it's heroes including you, you've never felt so happy in your life, \"And our new hero The Black Gecko\" Wonder Woman said as the cheers and applause doubled.<br>\r\n<br>\r\nAn Hour Later<br>\r\n<br>\r\nYou were in the Hall of Avenging as the heroines were giving you a tour, \"You did well rookie\" Wonder Woman said.<br>\r\n<br>\r\n'Actually he did great\" Black Canary corrected.<br>\r\n<br>\r\n\"Yeah, for a guy with such useless sounding powers you were great pipsqueak\" she hulk said.<br>\r\n<br>\r\n\"It's great to have you here Gecko, you can stay here as long as you like but if you want to go back to your civilian life you could use this signal transmitter\" Black Widow said.<br>\r\n<br>\r\n\"But you could reveal your identity to the public or us\" Spider-Gwen said.<br>\r\n<br>\r\n\"Or not whatever you want its all in your hands\" Zatanna said.<br>\r\n<br>\r\nYou headed to the main computer in the hall and you were all over the news, Headlines reading \"BLACK GECKO, OUR NEW HERO\", \"BLACK GECKO WORLD'S FIRST MALE METAHUMAN\", \"LOOK OUT HERE COMES BLACK GECKO\", \"<br>\r\nLE BLACK GECKO DÉBUT À YORKTOPOLIS\".<br>\r\n<br>\r\n\"Hey look guys we're all getting shipped with Gecko\" Zatanna said.<br>\r\n<br>\r\nYou couldn't believe it but all over social media people were already speculating who you were gonna end up with here are the results.<br>\r\n<br>\r\nBlack gecko x Black Canary=12 Mil followers<br>\r\nBlack Gecko x She Hulk= 10 Mil followers<br>\r\nBlack Gecko x Wonder Woman= 9 Mil followers<br>\r\nBlack Gecko x Zatanna = 7 Mil Followers<br>\r\nBlack Gecko x Spider-Gwen=6,5 Mil followers<br>\r\nBlack Gecko x Black Widow= 6 Mil followers<br>\r\n<br>\r\n\"Well this is awkward\" you said, the girls just smirked and giggled.<br>\r\n<br>\r\n\"Well anyway Wondie and i are gonna go training you wanna come\" Widow said.<br>\r\n<br>\r\n\"Well Shulkie and i were gonna go swimming at the pool, so if your interested\" Canary said.<br>\r\n<br>\r\n\"Well Zatanna and I are gonna go scouting the city so if you want some more street cred\" Spider-Gwen said.<br>\r\n<br>\r\nSo many possibilities but which to choose?<br>\r\n</span></div></div>",
            "created":1492405200,
            "id":2306440,
            "title":"It's Hero Time"
        },
        "1511":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Wonder Woman",
                "Black Widow",
                "2 vs. 1"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to train with Black Widow and Wonder Woman.\" You said. \" I want to make sure I'm strong enough to fight on my own.\" <br>\r\n<br>\r\n\"Well, you better get a move on cause I think there leaving now.\" Spider- Gwen says as she points behind you. You saw both Wonder Woman and Black Widow get on a ship labeled: <b>S.H.I.E.L.D.</b> .You quickly got onto the ship before the door closed. You were able to get in but you tripped and fell face first on the floor.<br>\r\n<br>\r\n\"I thought you were going with the others.\" Black Widow said as she offered you a hand.<br>\r\n<br>\r\n\"Well, I wanted to play it safe. So I decided to train with you two.\" You said.<br>\r\n<br>\r\n\"That reminds me, Your the only human male with a superpower. How did you get the ability to shrink in size?\" Wonder Woman asked.<br>\r\n<br>\r\n\"Oh, well it's in the suit.\" You began. You then briefly explain your other life as a billionaire and that the fact that you were bored with you life. Which led you to create the suit with the power to shrink.<br>\r\n<br>\r\n\"So, you do this for fun?\" Wonder Woman asked. <br>\r\n<br>\r\n\"Well, kinda, but really it feels more like a pain than anything.\" You answered with a hint of regret in your voice.<br>\r\n<br>\r\n\"What, Does anything bad happen to you?\" Black Widow asked.<br>\r\n<br>\r\n\"It's mostly with the suit. It ain't perfect. Sure it makes me invincible when I'm shrunk, but if I'm injured or anything, I'm stuck to being small until I heal, which is more of a pain than a gift.\" You answered. \"I think it's a bug.\"<br>\r\n<br>\r\n<br>\r\nEventually, the ship landed on a Carrier platform. You looked around to see that it 4 turbines on each corner of the ship. You were led by Wonder Woman and Black Widow into what appeared to be a training room. It was large enough to be considered two football fields.<br>\r\n<br>\r\n\"Ok Gecko. How about we do some training with your size ability?\" Wonder Woman said.  \"We want you to try and get a small nano chip in our bodies without one of us knowing. Think of it as a stealth mission.<br>\r\n<br>\r\n\"Or....\"Black Widow intervened. \"If your feeling a bit cocky, you can try and take us both on.\" It was tempting, you either had to pick with one of the girl's to go grab a chip that's somewhere on their bodies, or fight them both at the same time.<br>\r\n<br>\r\nWhat activity do you decide to do?<br>\r\n<br>\r\nA Get the nano chip from Wonder Woman's body.<br>\r\n<br>\r\nB: Get the nano chip from Black Widow's body.<br>\r\n<br>\r\nC: Fight them both.</span></div></div>",
            "created":1592771880,
            "id":2854619,
            "title":"Training Montage!"
        },
        "15111":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Her Face",
                "Her Breast",
                "Her Pelvis"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll go with Wonder Woman.\" You said confidently. <br>\r\n<br>\r\n\"Alright then. I'll be in my quarters. Good luck!\" Wonder Woman said. She then gives you a tablet and walked out of the training room and disappeared.<br>\r\n<br>\r\n\"If I were you, I would go threw the ventilation ducts.\" Black Widow suggested. \"You'd definitely catch Diana off-guard.\" <br>\r\n<br>\r\n\"Thanks for the tip!\" You said. You shrank down and flew into an air duct above you. You kept flying around for a while as you were trying not to make a lot of noise. You checked the tablet to see where she was. Following the schematics of the Carrier's vent system, you arrived in a room of sorts. Before you could scope out the room, you heard a door open, revealing to be Wonder Woman!<br>\r\n<br>\r\n\"Alright then, he's going to be here any minute now.\" Wonder Woman said as she locked the door behind her. \"Dang, it's hot in here! I bet he won't mind if I go naked for a few minutes.\" Wonder Woman then started to strip down, unknowingly in front of you. Your face turned red as she revealed more of her beautiful body. She was beautiful! No wonder why everyone like her, she's hot as hell!<br>\r\n<br>\r\nYou shook you head and snapped out of it. You had a training mission remember! You saw Wonder Woman climb into a bed and laid down. You took this as your chance to fly out of the vent and get closer to the vent. You flew low to the ground until you made it to the back of the bed. You flew up until you could see her. She hadn't notice you, in fact, it looked like she was watching a soap opera.<br>\r\n<br>\r\nYou checked you tablet to see where this chip was. You saw different pings on her body. There was pings in her breasts, her stomach, they were everywhere. You would have to guess where this was located! You guessed that she wouldn't mind if you did go to her privates, she did mention it was inside her somewhere.<br>\r\n<br>\r\nWhere do you go?<br>\r\n<br>\r\nA: You go to Wonder Woman's Face (Unaware vore, Nasal, and ear endo)<br>\r\n<br>\r\nB: You go to Wonder Woman's Breast (Nipple Vore)<br>\r\n<br>\r\nC: You go to Wonder Woman's Pelvis (Unbirth, Urethra, and Anal)<br>\r\n<br>\r\n*Note: No matter which one you choose, you'll be able to find the chip. So ye!)</span></div></div>",
            "created":1601352240,
            "id":2911999,
            "title":"A Wonderous Body!"
        },
        "1512":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "Have fun with She Hulk",
                "Have fun with Black Canary",
                "Go Swimming"
            ],
            "content":"<div class=\"\"><div> <span>\"Well i feel like fueling the shipping wars so lets go swimming\" you said, the others left for their activities while you Canary and Shulkie left for the pool.<br>\r\n<br>\r\n\"Wanna come in\" Shulkie teased, \"Um i don't think that i should\" you said before getting cut, \"Look its ok little guy we don't mind having little admirers\" Canary said.<br>\r\n<br>\r\nYou figured what the heck so you followed them and shrunk to a quarter inch in size, \"Impressive pipsqueak\" Shulkie said, \"You wanna have a closer look\" she teased, \"So what do ya like the chest area or somewhere lower or maybe my feet you like that?\" she teased, \"Ah knock it off Jen\" Canary said.<br>\r\n<br>\r\nBut you felt tempted here you were surrounded by two beautiful women and one was fine with you exploring her body, \"She Hulk\" you called, \"Just call me jennifer or Jen ok\" she said, \"allright Jennifer would it be allright if i like explored you're body\" you asked, \"REALLY?, well ok then which part pipsqueak\" she said, \"Well all of it your feet, your breasts, your um posterior it just looks so nice\" you said embarrasedly, \"Well that would be interesting but i guess i'd have to sunbathe instead of swimming, eh what the hell\" she replied.<br>\r\n<br>\r\n\"Hold on there, last time i checked 12 Million people shipped me with Gecko that's 2 million more than you, so Gecko you wanna get a good look at me, you can check out my mouth too if that'd your thing\" Canary said.<br>\r\n<br>\r\n\"Well let him decide so you wanna tangle with the Girl in Green or Ms.Tweety Bird\" Shulkie asked.<br>\r\n<br>\r\n\"Well we could just stick to the original plan and go swimming, i can still latch on to your bodies but i can't explore them\" you said, \"Well that is a possibility\" Canary said.<br>\r\n<br>\r\nYou examined your three options very carefully.<br>\r\n<br>\r\nShe Hulk or Shulkie had a muscular and large body she had enormous everything feet, tits, ass, the whole package.<br>\r\n<br>\r\nCanary had a more curvy body but she still had those legs and her ass and tits are pretty large.<br>\r\n<br>\r\nBut there was also the swimming option which allowed you to have fun with both and yes it is quite pathetic that you're fantasizing about the body parts of superheroines.<br>\r\n<br>\r\nSo your decision is to?</span></div></div>",
            "created":1492405200,
            "id":2306466,
            "title":"Swimming"
        },
        "15121":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Upper body (Breasts and/or Face)",
                "Lower body ( Vagina/Butt or Feet)"
            ],
            "content":"<div class=\"\"><div> <span>You thought for a while, and eventually had your answer. \"I want to explore Jennifer.......i-i-if its alright with you.\", you said as you blushed bright red. Black Canary was a bit disappointed, but got over it and said, \"Your call. I'm going to take a swim.\" As she was walking towards the pool, she looked back with a smile and said, \"Have fun you two.\" and dove in the water. You looked back at She-Hulk, who was giving you a satisfactory smile and said, \"Alright pipsqueak, it's your decision. Where would you like to explore?\" <br>\r\n<br>\r\nYou scanned her green body from head to toe.  After carefully thinking,(and by that, I mean staring at her body for 2 minutes.) You decided to explore her......</span></div></div>",
            "created":1573102800,
            "id":2743685,
            "title":"The Jolly Green Giantess"
        },
        "152":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "Lunch with Enchantress",
                "Training with Mystique and Harley",
                "Spa Dip with Giganta"
            ],
            "content":"<div class=\"\"><div> <span>You've decided to make your criminal debut, you headed towards the battle and grew back to normal size.<br>\r\n<br>\r\n\"What are you doing stop\" Wonder Woman said, you pushed Harley Quinn from a devastating sound attack courtesy of Black Canary, the battle stopped as a new challenger approached the fight.<br>\r\n<br>\r\n\"Um..hi everyone my name is The Black Gecko and yes i know it sounds dumb but so does Wonder Woman to be honest, anyway in case you were wondering yes i am male, i'm the first male metahuman and i'm here to make my criminal debut\" you announced,  \"So what can i do, well it's not too useful but lets allow our friends here to judge\" you said as you shrunk to the size of an inch.<br>\r\n<br>\r\nSuddenly Enchantress said \"Well Black Gecko you have proven yourself worthy of joining the criminal community and may i say that we are honored to have the first male metahuman on our team\", \"Welcome to the club cutie, oh and thanks for earlier\" Harley Quinn added, \"Another sizeshifter, well can you grow\" Giganta asked, \"well no but the smaller i am the more durable i become\" you answered.<br>\r\n<br>\r\n\"Well sorry pal but your debut is gonna get cut short\" She Hulk said, luckily however Giganta caught She Hulk and flung her far away.  <br>\r\n<br>\r\n\"Now we're even\" Mystique said, you and the villains attacked the heroes you weren't sure what to do after all you are only an inch tall but you figured you could be a distraction.<br>\r\n<br>\r\nEnchantress was fighting Zatanna while giganta fought Wonder Woman, Black Canary, and Spider-Gwen and Harley kept Black Widow at bay.<br>\r\n<br>\r\nYou saw Mystique and signaled to her, she picked you up and you told her \"we should both be a distraction\", Mystique nodded and shapeshifted into She Hulk, you decided to help Harley.<br>\r\n<br>\r\nYou grew back to normal size and shrunk back but you entered Black Widow's costume and explored her body then you saw her womanhood and pleasured her, meanwhile Black Widow felt a weird sensation which distracted her long enough for Harley to knock her cold, \"You saved me again thanks cutsie pie\" she thanked.<br>\r\n<br>\r\nMeanwhile Mystique covered Zatanna's mouth preventing her from casting a spell, Enchantress created a portal to Jotunheim and threw Zatanna there, meanwhile Giganta had knocked Black Widow and Canary out leaving Wonder Woman to fend for herself.<br>\r\n<br>\r\n\"Well well well if it isn't everyone's favorite Amazonian, looks like the tables have been turned\" Enchantress said as you and the others surrounded her, Enchantress cast a spell to send her to Hela ruler of Hel, Wonder Woman let out a big NO as Giganta flung her to the portal which promptly disappeared.<br>\r\n<br>\r\n\"SCORE ONE FOR THE BAD GIRLS\" Giaganta yelled, \"Oh and guy\" she added, \"well Gecko looks like we owe you our victory\" Enchantress said, \"well thanks but why are you fighting anyways\" you asked, Enchantress revealed a Motherbox a key to the anti life equation, \"Now lets take our prize and the new recruit bak to our base\" Enchantress said.<br>\r\n<br>\r\nEnchantress opened a portal which everyone crossed into and then you went inside their lair a beautiful mansion on top of clouds this looked a lot like heaven.<br>\r\n<br>\r\n\"Welcome to my realm\" Enchantress added, \"Well until i locate the next MotherBox i say we should get some rest, and i think you should spend some time with us\" Enchantress said.<br>\r\n<br>\r\n\"Well you could spend time with me, having lunch\" Enchantress said seductively, 'Like a date?' you thought.<br>\r\n<br>\r\n\"Or you could practice training with me and Harley\" Mystique said, \"C'mon it'll be fun\" harley flirted.<br>\r\n<br>\r\n\"Or you and i could take a dip in the spa enjoying our little size difference\" Giganta said.<br>\r\n<br>\r\nSo many options but in the end you chose...</span></div></div>",
            "created":1492405200,
            "id":2306429,
            "title":"I'm a Smooth Criminal"
        },
        "1521":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "You saw her bathing",
                "The Alarm went off (Intruders)",
                "The Alarm went off (Motherbox Located) *reserved "
            ],
            "content":"<div class=\"\"><div> <span>\"Will milady have lunch with me\" you asked, \"Oh Chivalrous little man i like it\" she said as she picked you up and carried you to the dining room.<br>\r\n<br>\r\nWhen you got there all you saw were empty plates and cups, \"So are we ordering the beverage?\" you said awkwardly, \"No, not exactly\" she replied as she snapped her fingers and suddenly food of all kind landed on the plates while the cups were now full with the finest wine from the nine realms.<br>\r\n<br>\r\n\"WOW\" you said cheerfully you felt really lucky being with this hot sexy giantess, you saw Enchantress in all her beauty her normal height is pretty tall at 6'0 meaning that she's taller than you normally (you're 5'9), she had flowing blonde hair which looked like gold, her trademark green costume and lipstick and the world's sexiest smirk.<br>\r\n<br>\r\n\"So you're not hungry?\" she asked, you snapped back to reality, \"Admiring the meal or something else?\" she said in a seductive tone, \"I'm sorry Miss Amora' you said, \"No no it's fine i've had many admirers but none quite like you\" she said as she came close.<br>\r\n<br>\r\n\"What are you doing?\" you asked, \"Something you'll thank me for\" she said as she kissed your inch tall body covering it with her big wet lips, at first you were shocked then afraid then you started loving it and embraced it, \"Y'know we just met right\" you said, \"My name is The Enchantress\" she whispered lovingly.<br>\r\n<br>\r\nAfter that she decided to feed you herself, she used her fork to pick up some bread crumbs and lowered them to your level, \"You know i can just grow right\" you said, \"Say Ahhh\" she said, you opened your mask and chewed on the crumbs, after a while you and Enchantress were full, \"Thanks for that, for everything\" you said.<br>\r\n<br>\r\n\"Well im off to my room, come join me if you want\" she said, you were pondering what to do, you just got kissed by a supervillain and a superhot one and one that is a literal goddess this was turning out to be the best day of your existence, you went to her room it was very large and was completely gold you opened the door and...</span></div></div>",
            "created":1492405200,
            "id":2306471,
            "title":"Lunch with Enchantress"
        },
        "1522":{
            "author_id":"randommanslam",
            "author_name":"RMS",
            "choices":[
                "Threesome *reserved",
                "One on One with Harley",
                "One on One with Ivy/Mystique"
            ],
            "content":"<div class=\"\"><div> <span>\"Well im kinda new to this whole supervillain thing so why don't we go training\" you said, you headed to a gym alongside Mystique and Harley it was incredibly large and you shrank to the size of a cm tall, \"Ok lil cutie lesson no.1 expect the unexpected\" Harley said, then she slammed her massive ass on your little body, you screamed in agony buy Harley just kept squeezing harder, \"What the hell is this for\" you asked, \"Well did you expect it\" she answered, \"Ok i understand\" you said, eventually she raised her ass and it seemed like you were finally free but all of a sudden mystique's boot crushed you, \"unexpected little one don't forget that\" she smirked, eventually she raised her boot and you rolled over as Harley slammed her foot, \"Finally yer learnin\" she said.<br>\r\n<br>\r\n\"Allright grow back now because right now you're not tall enough to ride this rollercoaster\" Harley joked, \"cant....grow....if....hurt\" you said, \"Shame, guess we'll just have to improvise\" Mystique said, \"Wait wha..\" you got picked up by Mystique, \"So tell me who do you have a well hard on for\" she asked, \"I can change into anyone childhood crushes, celebrities, superheroes, other supervillains even family members so who will it be\" she asked, \"why...don't...you....two....decide\" you said weakfully, \"How about red or Poison ivy as you know her\" Harley said.<br>\r\n<br>\r\nIn a flash Mystique turned into Poison ivy, \"Well Harley i know i'm not the original but lets have some fun, the three of us\" she teased, \"awww, you shouldnt have but ok\" Harley said, you could see where this was going but you were worried sure you'd get into a supervillain threesome(that sounded creepy and awkward) but you were afraid of getting crushed and even though you wouldn't be killed you'd still feel pain.<br>\r\n<br>\r\n\"Maybe he'd like a one on one or should we go for that threesome Gecko\" she teased.<br>\r\n<br>\r\nWell one on one sounded ok but on the other hand you could do a threesome with two hot supervillains so what's it gonna be...</span></div></div>",
            "created":1492405200,
            "id":2306475,
            "title":"Training with Mystique and Harley"
        },
        "155":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Heroes",
                "Villians",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>When will you get an chance at this again? You looked back at the battle. Both sides look like they are doing fine, none of them are losing so far and are entirely focused on each other. However, they might notice something on or in them that will shift the battle to favor the other team. (Ex: Chose to do perverted stuff on Villains side, they'll focus more on you than the heroes.) Between the heroes and villains, you couldn't decide who to go for, THEY'RE BOTH HOT! <br>\r\n<br>\r\nWhich side do you go for?<br>\r\n<br>\r\nA: Chose the Heroes<br>\r\n<br>\r\nB:Chose the Villains<br>\r\n<br>\r\nC: Reader's choice ( I ran out of scenarios for this one. Why don't one of you guys try it.)</span></div></div>",
            "created":1580850120,
            "id":2782466,
            "title":"An Opportunity of a Life Time "
        }
    },
    "info":{
        "author_id":"ello",
        "author_name":"someone",
        "brief_description":"You have the super power to shrink  in a world full of super powered women. ",
        "created":1354648680,
        "description":"<td align=\"left\" class=\"norm\">You are Allen, a rich and bored man who happens to live in a universe where he is the only male with super powers! They aren't exactly the most useful powers but they do provide some excitement and adventure. You can shrink down to a couple of inches tall and your body is almost like rubber. You can be flattened and beaten and stretched without dying or getting ripped apart. It hurts like all hell though and worst of all you can't black out from the pain. You can grow back to normal but only when you are fully 100% healed, which can take a long time and in no pain. Also getting hit with significant force will force you to shrink!<br>\r\n<br>\r\nYou move to Yorktropolis which is filled with all kinds of super heroines and female villains. These can be women from Marvel/DC/Games/Anime, pretty much anything from the superhero genre. You can even make up your own characters if you'd like.<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\nNo interaction with men<br>\r\n<br>\r\nNo scat<br>\r\n<br>\r\nNo killing Allen</td>",
        "id":1906876,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601352240,
        "modified":1601352240,
        "pretty_title":"Tiny Powers and Super Powered Women"
    }
}