{
    "chapters":{
        "1":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Male ",
                "Female",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now its time for you to choose the gender of the the character you want to be tickled.</span></div></span></div>",
            "created":1209531600,
            "id":525958,
            "title":"Choose your gender"
        },
        "11":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Aang",
                "Sokka",
                "Zuko",
                "Other",
                "Multiple People"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you chose for the guys to be tickled. Now all you need is to pick which one.</span></div></span></div>",
            "created":1209531600,
            "id":525959,
            "title":"The Guys"
        },
        "111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Katara",
                "Sokka",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You've chosen for the Avatar to be tickled. So pick who will tickle him and let's get started.</span></div></span></div>",
            "created":1209531600,
            "id":525960,
            "title":"Aang the Avatar"
        },
        "1111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "tickles Aangs feet",
                "Is about to walk over to his feet, when he decides to train with her"
            ],
            "content":"<div class=\"\"><div> <span>After being defeated at the Eclipse Invasion, Aang was really down.<br>\r\n\"Hey, Aang, come here and let's do some more training,\" Katara said, standing by the airbending temple's water fountain.<br>\r\n\"I dunno, I don't really feel like training right now and besides, Zuko is laying in the fountain,\" Aang replied, gloomily.<br>\r\n\"No, go ahead,\" Zuko, said, \"I was just leaving, to go fishing with the group.\"<br>\r\n\"See, now come here,\" Katara insisted.<br>\r\n\"Fine,\" Aang replied. He slipped of his robes and jumped into the fountain in his trunks.<br>\r\nHe got in and decided in stead of getting in his usual fighting stance, he just floated to the  bottom.<br>\r\n\"Hey, get up!\" Katara yelled.<br>\r\n\"I'm to upset to train right now,\" Aang said, his face sinking below the surface.<br>\r\n\"If you don't cheer up, right now, I'll make you!\" Katara shouted.<br>\r\n\"Ugh,\" Aang groaned, sinking deeper.<br>\r\n\"That's it, I've had it,\" she yelled. Katara moved her arms gracefully, waterbending Aang into an ice block that went all the way from his face, from his ankles.<br>\r\n<br>\r\nShe then...</span></div></div>",
            "created":1209531600,
            "id":525980,
            "title":"Waterbending training with Katara"
        },
        "11111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "\"I'm sorry, but I just don't see any other way to cheer you up,\"",
                "\"Oh, alright if you really don't want me, too.\""
            ],
            "content":"<div class=\"\"><div> <span>Katara walks over to the end of the floating ice block and bends down at Aangs feet.<br>\r\n\"Hey, wh-what are you doing?\" Aang asked, nervously.<br>\r\n\"Just cheering you up that's all,\" Katara said, sweetly.<br>\r\n\"Um, that's okay, I think I'll just go lay down,\" Aang replied.<br>\r\n\"No, no, no, I need to cheer you up right now,\" Katara said, \"Aang, are you, by any chance, ticklish.\"<br>\r\n\"What! Wh-Why would you ask that,\" Aang asked, frightened.<br>\r\n\"Because, that's how I'll cheer you up,\" Katara replied as she drew one finger up his left sole, \"And judging by the way you tried to pull away and the grin you had, I'd say you are!\"<br>\r\n\"N-NO! I'm not t-ticklish at a-all,\" Aang stuttered, he remembered how the other airbenders use to hold him down and tickle him until he passed out. They usually, left his feet alone, though, because once they had tickled him there and he went into the avatar state and destroyed a whole floor of a building.<br>\r\n\"Oh, but I think you are, and I just have to cheer you up,\" she replied calmly.<br>\r\n\"NO, Please, don't I'll train with you, just please don't tickle my feet!\" Aang yelled.<br>\r\n<br>\r\nKatara then said,...</span></div></div>",
            "created":1209531600,
            "id":526382,
            "title":"The Avatar is Ticklish"
        },
        "111111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "let him go, he's had enough.",
                "keep tickling, and kick it up a notch."
            ],
            "content":"<div class=\"\"><div> <span>Just as Aang was about to make another plea, Katara reached down and with her long nails, poked all around Aang's foot, trying to find a ticklish spot. Much to her delight though, all of it was! Aang tried to break free, but he couldn't even wiggle his fingers. Katara, had gathered enough information, so she started to, just tickle and tease, all around Aangs foot. <br>\r\n\"Kootchie, Kootchie Koo, is the wittle avatar ticklish,\" She said, as she scratched his arches really well.<br>\r\n\"NOOOAHAHAA HAHAPLEASEHAHA STOHAHAP!\" He, screamed in between his laughter. \"KATARAHAHA PLEASE DON'T AIIII,\" shreaked Aang as she dug right into the  area under his toes.<br>\r\n\"Ya know Aang, I always knew, you were ticklish, but I had no idea!\" She yelled delightedly.<br>\r\n<br>\r\nAfter that she decided to, ...</span></div></div>",
            "created":1209531600,
            "id":527918,
            "title":"Aangs Feet, Finally Tickled"
        },
        "1111112":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "goes to get the others.",
                "pulls out a big fluffy feather and a long stiff feather."
            ],
            "content":"<div class=\"\"><div> <span>She kept tickling and tickling and he was howling with laughter, \"HAHAHAHA NOOHAMOREHA PLEASEEEEE!\" She decided he was a little short on air, so she stopped to give him a little break.<br>\r\n\"Aang, you have got to have the most ticklish feet in all of the universe, although, it probably doesn't help that you keep off your feet a lot, with flying and stuff.\" Katara stated.<br>\r\n\"Your, right, now will you please let me go,\" Aang pleaded.<br>\r\n\"Not, just yet, I still have a couple tricks up my sleeve,\" She replied mischevously.<br>\r\n\"NO PLEEASEHAHAHA NOHAHA MERCYHAHA!\" He shouted just as she started to tickle again. Just when he though it was the worst thing that could ever happen, she...<br>\r\n</span></div></div>",
            "created":1209531600,
            "id":525977,
            "title":"The Avatar's Torture"
        },
        "11111122":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "content":"<div class=\"\"><div> <span>She pulls out the two feathers and looks at him  evilly.<br>\r\n\"NO, PLEASE DON'T DO IT!\" He shouted.<br>\r\n\"Too, late,\" Katara says, as he pulls the big one threw his toes, back and forth and tickles his arches with the other.<br>\r\n\"NOHOHAAHA NOT THAT HAHAAHA PLEAASEHAHA\" he screams. He shouts and yells and laughs hysterically, but all she does is keep on. Just then he turns the the long, stiff feather around and starts to scribble quickly on the side on his right arch, ball and heel. \"HAHAHA I CAN'THAHA TAKE IT ANY MORE! HAHAHAHA PLEAAAHAHA!\" Aang screams, \"AHAHAHA PLEASE PLEASE AHAHAA! AAIII, PLEASE I'M HAHA TOO TICKLISH HAHAHAAAHA!\"<br>\r\nJust then she stopped. \"I think you've learned your lesson,\" Katara says,\"just don't put yourself down so much on failing, it was all our faults.\" <br>\r\n\"Okay, now can you please let me out, it really freezing in here,\" Aang asks.<br>\r\n\"Yeah, sure,\" she replies releasing the ice and freeing him, but not before giving his sole one more tickle, getting a yelp.<br>\r\n\"Please, don't tell anyone else that I'm ticklish,\" Aang, says, \"And I'd rather you didn't tickle me anymore either.\"<br>\r\n\"Well, in respond to the first question, sure, but the second,\" she said, \"I don't know.\"<br>\r\n\"Fair enough, well, let's do some training!\" he says enthusiastically.   <br>\r\n<br>\r\n'I wonder where else he's ticklish,' she thinks to herself.</span></div></div>",
            "created":1209531600,
            "id":526394,
            "title":"The Dreaded Feathers!"
        },
        "1113":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Zuko",
                "Toph",
                "Azula"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these:</span></div></span></div>",
            "created":1209531600,
            "id":525961,
            "title":"Other Charaters"
        },
        "112":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Zuko",
                "An assassin",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall tickle Sokka?</span></div></span></div>",
            "created":1216702800,
            "id":558871,
            "title":"Sokka's Ticklers"
        },
        "1121":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Zuko continues the horrible torture",
                "Zuko intensifies the torture",
                "Zuko stops the torture"
            ],
            "content":"<div class=\"\"><div> <span>Everyone was resting at Zuko's father's house and Zuko was teaching Aang firebending. They all decided that they needed firewood so they all voted Sokka to go get it, Zuko volunteered to help carry. So Sokka and Zuko took off, Sokka taking the lead and Zuko following. Zuko wanted to get back at Sokka for making fun of him the previous day so very silently Zuko ran and tackled Sokka to the ground. Sokka yelled at Zuko so Zuko pulled out some metal fire nation rope and tied Sokka in the shape of an L with his hands tied above his head and ripped off his own belt and gagged Sokka with it. Sokka was screaming underneath his sweaty belt gag. Zuko knew Sokka's feet were ticklish cause he tested it out by touching his foot the previous night, getting giggles out of him. Zuko removes one of Sokka's boots exposing one of his sweaty stinky bare foot. Zuko takes a big wiff of Sokka's boot *mmmmmmmm* he said, \"sooo smelly\". He then removed the other doing the same. He shoved the boot in Sokka's face forcing him to inhale his own stench. Sokka's jerks trying to avoid the smelly boot but fails. Zuko sets both boots down and removes his own boots repeating the group smelling, forcing Sokka too smell his sweaty boot and sets them back down next to Sokka's. Zuko then sits Japanese style in front of Sokka's smelly, sweaty, exposed tan feet. Zuko then lift's up the feet and runs five finger's down both feet, Sokka giggles and screams from under his gag. Zuko smiled and didn't hesitate to start scraping down on his toes, arches, and soles, Sokka starts screaming, tears and sweat running down his face. Zuko starts evilly chuckling. Zuko then changes position to lying stomach down on sokka with his smelly firebending feet in Sokka's face and wraps his hands around Sokka's feet and starts crazily scrapping his nails on the young warriors feet leaving no spot untouched. Sokka was screaming from his gag, this was pure torture being tickled so hard and forcibly smelling Zuko's sweaty stinky dogs. Zuko changed his position again pushing his feet deeply into Sokka's muffled face to move up. Zuko then sit's in front of Sokka pushing his feet into Sokka's playing footsie. Sokka was relieved this was all, but his celebration was too soon he realized when Zuko started scraping his toenails into Sokka's feet, Sokka then sat back drooling, sweating, crying, and screaming realizing that it wasn't over yet.</span></div></div>",
            "created":1294203600,
            "id":1029821,
            "title":"Zuko"
        },
        "11211":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "content":"<div class=\"\"><div> <span>Zuko decides to continue the horrible torture. Zuko continued to tease Sokka and his feet by tickling them with his toe nails, this was genius he thought to himself. Next time Sokka would think twice before making fun of the great fire prince Zuko. The scent eminating from Sokka's smelly feet intrigued Zuko. Zuko then lay down on his stomach with Sokka's feet in his face and his own feet folded above his back. He started lightly tickling the warrior's feet with his eyelashes, his nose indented between the warriors feet during the torture. He then starts picking up the pace shaking his long brown beautiful hair on the boy's feet, each strand teasing the boy's foot. he finally decides to finalize the pace by running his warm tongue up and down the warriors feet causing the warrior too cry desperately, for he didn't even mean the comment he made the previous day but he certainly learned his lesson. Zuko smiles and starts shoving his tongue cruelly in between the toes transporting toe jam into his mouth with each lash. Sokka was livid screaming like death was awaiting him yet laughing and blushing greatly like it was some kind of sick joke. Zuko's tongue reminded him that it wasn't a joke and this was honestly cruel torture. Zuko started winding through Sokka's smelly toes like a snake with his tongue when the teenage waterbender passed out unluckily. Zuko took one last wiff of Sokka's boots and slipped them back on, following with his. Now he just needed to get his story straight for when Sokka cam back too his senses.</span></div></div>",
            "created":1294203600,
            "id":1029829,
            "title":"Zuko continues the horrible torture"
        },
        "11212":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "content":"<div class=\"\"><div> <span>Zuko decides too intensify the torture even further. Zuko situates himself laying down on sokka with his back first and his feet in Sokka's face and Sokka's feet on his face. He then removes Sokka's gag and state's, \"Okay Sokka now you are too worship my feet\", shoving them closer to Sokka's sweaty face. Sokka exclaimed, \" NO! Are you disgusting your feet smell like road kill there's no way I would ever do that\". \"Okay\", Zuko said. I'll just have to convince you, smirking. He then take's another wiff of the warrior's feet and ignites one of his finger's with fire. He then places his finger on the sole of the boy's foot. \"OUCH!\", Sokka exclaimed. Zuko then ignite's both index finger's and places them on both sole's leaving them for 3 seconds. \"OUCH OUCH OUCH!\" , Sokka exclaimed again. By now Sokka is crying from the extreme pain. \"If you want me to stop, you know what you have to do.\", Zuko said. \"Okay! Fine!\", Sokka said. \"Just Stop!\". Zuko smiled pressing his sweaty smelly feet in Sokka's face. Sokka then stuck out his dried out tongue from the gag and ran it along Zuko's foot *cringing*. \"Good\", Zuko Said. \"Continue\". \"Whyyyy!?\", Sokka said angrily. Zuko left no time but too ignite all five finger's and start wiggling his finger's on Sokka's smelly feet. \"AHAHAHAHA OUCH!\" ,Sokka said. \"Okay Okay Okay\". Sokka then stuck his tongue in between Zuko's right pinky toe collecting toe jam *cringing* and gulping unreadily. \"Stop cringing!\", Zuko said angrily. Tear's started running down Sokka's face and Zuko muffled them, pushing his big toes into Sokka's eye lids. \"Continue!\" Zuko said. Zuko holds off and first places the drooly sweaty belt on Zuko's eyes and then putting his feet back in the boy's face \"Continue!\", he said again. Sokka, still crying started massaging Zuko's smelly sweaty feet with his tongue still crying. Zuko returns the favor Massaging and tickling Sokka's feet with his tongue aswell, only making Sokka more uncomfortable successfully. \"Ahhh this is truely the best trip to get firewood I've ever been on wouldn't you say so too Sokka!?\", Zuko said smirking. \"mhm\", Sokka muffled sarcastically from under the fire prince's feet. \"Okay that's it I'm done with your Sarcasm!\" Zuko said kicking Sokka's head with his sweaty, smelly, wet foot and burning Sokka's toes until he passed out. Zuko ripped up the metal rope burned his gag slipped both their boots back on and cooked up a story for when Sokka arose.</span></div></div>",
            "created":1294203600,
            "id":1029848,
            "title":"Zuko intensifies the torture"
        },
        "11213":{
            "author_id":"googooplexxxi",
            "author_name":"Googooplexxxi",
            "choices":[
                "Sokkka make's fun of Zuko again ",
                "Sokka never make's fun of Zuko agian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zuko decides too stop the torture for now untieing Sokka and telling him if he ever ever made fun of him again he would torture him again but 10x worse chuckling. Sokka agreed, for now.</span></div></span></div>",
            "created":1294275900,
            "id":1029850,
            "title":"Zuko stops the torture"
        },
        "1122":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Meanwhile, Sokka's Torture!"
            ],
            "content":"<div class=\"\"><div> <span>This particular story takes place in the third season, before the Invasion, more specifically, in between the 6th and 7th episode. (I say in between because obviously they don't put every day into an episode so, yeah).<br>\r\n<br>\r\n\"Hey, what's a matter Momo?\" Aang asked, waking up. \"Hey where's Sokka?\" Aang asked Katara as she woke up.<br>\r\n\"What do you mean, wait, he's not here!\" she yelled. \"Last night he went to get more wood, but he should have gotten back last night!\"<br>\r\n\"Toph! Get up!\" Aang yelled.<br>\r\n\"Wh-What!?\" Toph replied, waking up.<br>\r\n\"Sokka's been captured! We have to go save him!\" Katara explained.<br>\r\nThe gang got on Appa and flew into the sky, looking for Sokka.</span></div></div>",
            "created":1216702800,
            "id":558962,
            "title":"Sokka is Captured?"
        },
        "11221":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "His ribs",
                "His feet"
            ],
            "content":"<div class=\"\"><div> <span>\"H-huh!? Where, where am I?\" Sokka asked, waking up. \"Why am I tied up!? Who's there?\" He asked, hearing someone enter the room.<br>\r\n\"Hello Sokka, my name does not matter, all that matters is that you tell me where the Avatar is,\" the assassin replied.<br>\r\n\"Wait, your that guy who shoots beams from his head!\" Sokka said.<br>\r\n\"Yes, but I'm not who you should be worried about, she is!\" said, the assassin, motioning to the door a women entered the room, holding a bag.<br>\r\nShe was tall, thin and had long brown hair, but her face was covered by a mask, she also had really long finger nails.<br>\r\n\"So Sokka are you going to tell this man where the Avatar is, or do I have to torture you to get it out?\" The woman asked.<br>\r\n\"NO! I'll never tell!\" Sokka said.<br>\r\n\"Okay then,\" she replied, moving down to his foot and and drew her nail up the sole, from the heel to the toes, making Sokka giggle.<br>\r\n\"Hahaha Stahap, Wh-what are you doing?\" Sokka asked, giggling.<br>\r\n\"Convincing you, why, are you ticklish?\" she asked.<br>\r\n\"N-no not at all,\" Sokka stuttered.<br>\r\n\"Okay then I'll just start, where to start though?\" she said.<br>\r\n</span></div></div>",
            "created":1216702800,
            "id":559166,
            "title":"Sokka's Interrogater"
        },
        "112212":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Sokka's most ticklish spot are his arm pits",
                "Sokka's most ticklish spot is his stomach"
            ],
            "content":"<div class=\"\"><div> <span>\"So how ticklish are these feet of yours?\" the woman asked.<br>\r\n\"Please don't tickle me!\" Sokka begged.<br>\r\n\"Sure, if you tell us where the avatar is,\" she replied.<br>\r\n\"Never!\" Sokka insisted.<br>\r\n\"Fine, have it your way,\" she said, gliding her fingers all over Sokka's soles, making him start giggling.<br>\r\n\"Hahaha Pleeease stahahap aaaaahahaHAhahaHAha hahaHAHA HAHAAHAHAHAHAHA PLEASE STAHAHAP!\" Sokka laughted, his giggling turning into laughter, as she tickled his toes.<br>\r\nSokka's feet were rough, from walking so much, making the balls and heels, slightly less ticklish, but when the lady tickled his arches and toes, he burst out with laughter.<br>\r\n\"AAAAHAHAHAHAH PLEEEEASE PLEEEEASE STAHAHAHAP HAHAHAHAHAHAHA PLEEEASE STAHAHAHAP!\" Sokka screamed.<br>\r\n\"Are you ready to talk?\" she asked.<br>\r\n\"NO!\" Sokka yelled, with persistence.<br>\r\n\"Okay, I'll have to use this brush, made especially for tickling.\" she said.<br>\r\nThe brush was long and skinny, with a mixture or soft and stiff feathers and thick bristles, which vibrated when turned on. She did so and scrubbed Sokka's arches and toes, causing him to erupt in laughter.<br>\r\n\"AAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHA HAHAHAHAHAHAHA PLEEEEEASE STAHAHAHAHAP HAHAHAHAHAHAHAHA AHAHAHAHAHAHAHA STAHAHAHAP STAHAHAHAHAP!\" Sokka screamed.<br>\r\n\"Well, are you ready to tell where he is?\" she asked again.<br>\r\n\"Never!\" Sokka yelled.<br>\r\n\"Okay, well lets move some where else,\" she said.<br>\r\n\"OH NO! If she tickles me on my most ticklish spot, I don't know if I'll be able to hold out!\" Sokka thought to himself.<br>\r\n</span></div></div>",
            "created":1216702800,
            "id":559275,
            "title":"Sokka's Feet"
        },
        "1122122":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Aang's Capture"
            ],
            "content":"<div class=\"\"><div> <span>With out a word, the lady moved up to his arm pits and started spidering her fingers in them, every so often tickle his ribs, he was pretty ticklish there so he burst out in laughter with every scratch.<br>\r\n\"AAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEASE STAHAHAHAP I CAN'T TAKE IT HAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHA STAHAHAHAHAP IT PLEEEEEEEEASE!\" Sokka shouted.<br>\r\n\"Ready to talk?\" she asked again.<br>\r\n\"No-hohoho AAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEASE AHAHAHAHAHAAAHAHAHAHAHAHAHAHAHAHAHAHA!\" Sokka said, as the women immediately started tickling.<br>\r\n\"Well, I've tickled your feet, arm pits and ribs, the only place left is your stoma...\" she started.<br>\r\n\"NO, PLEASE ANYWHERE, ANYTHING BUT THAT PLEEEASE!\" Sokka pleaded.<br>\r\n\"Aww, is your wittle tummy ticklwish? Well I'm going to!\" she said.<br>\r\n<br>\r\nMeanwhile, Aang, Katara and Toph had landed at there camp site after searching for Sokka for an hour.<br>\r\n\"What should we do!?\" Katara said, panicking.<br>\r\n\"Well, lets split up, Toph, you go that way, I'll go this way and Katara you fly on Appa and go that way. Let's me up here in about 15 minutes, okay?\" Aang suggested.<br>\r\n\"Okay,\" Katara and Toph said simultaneously.<br>\r\n<br>\r\nWhile this was happening, Sokka was just about to get tickled on his most ticklish spot, his stomach. The lady turned on the vibrator and started to scrub the brush up and down Sokka's smooth stomach and she even dipped the end side of it, which was a cone-shaped vibrator, that was covered in feathers, into his belly-button.<br>\r\n\"AAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOOOOOOO PLEEEEEEASE NOT MY BELLY AHAHAHAAHAHAHHAHA I CAN'T TAKE IT AAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA AAAAAAAAAAAAAAAAAAAAAAA NOOOOOOOO NOT MY BELLY-BUTTON PLEEEEEASE HAVE MERCY AAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHA STAAHAHAHAP I'M GONNA DIE! JUST STAHAHAHAHAP! OKAY OKAY I'LL TELL I'LL TELL, JUST STAHAHAHAHAHP!\" Sokka caved.<br>\r\n\"Aww, I was having fun,\" she said, as the assassin walked in.<br>\r\nSokka told the assassin and he went to find Aang, while the lady through Sokka in a cage.</span></div></div>",
            "created":1216702800,
            "id":559521,
            "title":"Sokka's Ticklish Tummy"
        },
        "11221221":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "she tickles him",
                "Katara and Toph save him and Sokka"
            ],
            "content":"<div class=\"\"><div> <span>Aang got back first and decided to wait for the others, unfortunately for him, during his wait, he fell asleep. A few minutes after he did, the assassin, sparky-sparky-boom-man or combustion man got to the camp and quickly captured Aang, before he could get up. Aang was knock out while in the bag, he woke up tied up like a mummy and tied to a metal table, only his head and feet were loose. He looked to the right and managed to see Sokka in a cell.<br>\r\n\"Sokka, There you are!\" Aang yelled.<br>\r\n\"Yeah, sorry for you getting captured, I told them where we camped,\" Sokka replied.<br>\r\n\"What did they do to you?\" Aang asked.<br>\r\n\"Well they, they umm...\" Sokka started.<br>\r\n\"What, what did they do?\" Aang demanded.<br>\r\n\"They, They tickled me, okay,\" Sokka said.<br>\r\n\"They did, I didn't even know you were ticklish,\" Aang said.<br>\r\n\"Well I am, but don't...\" Sokka started.<br>\r\n\"WAIT, you don't think there going to tickle me do you!?\" Aang asked, slightly frightened.<br>\r\n\"I wouldn't thinks so, but maybe, why are you ticklish?\" Sokka asked.<br>\r\n\"Umm, yeah, insanely,\" Aang admitted, blushing.<br>\r\nJust then the assassin walked in and said, \"Although, the fire nation paid for your life, someone else paid for you to be tortured for a while so here she is,\" he said as the interrogation lady walked in.<br>\r\n\"Ah, the avatar, of all the guys I've tickled, I've never tickled the avatar,\" she said.<br>\r\n\"Well you don't have to, PLEASE DON'T!\" Aang begged.<br>\r\n\"Sorry, tell me are these tootsies your most ticklish spot?\" she asked.<br>\r\n\"Yes, yes, but please don't tickle me, pleeease,\" Aang pleaded.<br>\r\nThen...</span></div></div>",
            "created":1216702800,
            "id":559329,
            "title":"Aang's Capture"
        },
        "112212211":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Katara and Toph broke in",
                "The women left and came back much later"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for Aang, she didn't listen to him and started tickling. Aang's feet were soft and smooth and extremely ticklish, mostly because he flew around so much amd stepped very lightly when he was on the ground. At first she just drew her nails up and down his soles, making him squirm and giggle, then she moved on to scribbling all over his soles.<br>\r\n\"AAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEASE STAHAHAHAHAP I CAN'T TAKE IT! AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEEASE I'M TOOOO TICKLISH! AHAHAHAHAHAHAHAHAHAHAHAHA!\" Aang screamed.<br>\r\n\"Wow, I've never met anyone as ticklish as you and I've tickled a lot of guys!\" she exclaimed.<br>\r\nAfter saying that and giving Aang a break, she pulled up his toes and tickled under them, which she followed up by tickling his feet with the brush and using the back-side under his toes, causing him to explode with laughter.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOO NOT THE TOES! PLEEEEASE I'M GONNA DIE AHAHAHAHAHAHAHA PLEEEEEASE STAHAHAHAP! WAIT, NO NO NOOOOOOOOOOO! AAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOT THE BRUSH! NOOOOOOOO! AAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEEASE NOT THE TOES PLEEEEEEASE, I'LL DO ANYTHING! AAAAAAA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEE....eee...e..\" Aang said, fainting.<br>\r\nJust then...</span></div></div>",
            "created":1216789200,
            "id":559356,
            "title":"The Insanely Ticklish Avatar"
        },
        "1122122111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "content":"<div class=\"\"><div> <span>\"Hey! Stop!\" Katara and Toph said together.<br>\r\nThey was a huge battle and Katara and Toph managed to escape with Sokka and bare-footed, unconciouss Aang. <br>\r\nLater that day, when Aang awoke, he ran to Sokka and said, \"Sokka, can you please not tell any one that I'm ticklish, PLEASE!\"<br>\r\n\"Sure, if you don't tell anyone about me, deal,\" Sokka said.<br>\r\n\"Yeah, of course,\" Aang said.<br>\r\n\"Good,\" Sokka said.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n                                                      THE END</span></div></div>",
            "created":1216789200,
            "id":559365,
            "title":"Katara and Toph to the rescue"
        },
        "113":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Aang",
                "Sokka",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shall tickle Zuko? </span></div></span></div>",
            "created":1209531600,
            "id":526031,
            "title":"Who's the Tickler?"
        },
        "1131":{
            "choices":[
                "Continued poking Zuko",
                "Started tickling his sides",
                "Teased Zuko's nose with a feather"
            ],
            "content":"<div class=\"\"><div> <span>It was morning and Aang woke up and yawned. He saw a note next to his sleeping bag stating that Sokka, Toph and Katara all went out to get breakfast and to keep an eye on Zuko. Aang snorted then looked up. He saw Zuko, still asleep. He was bored and wanted to play. Aang scrambled up and airscootered to Zuko, \"HI ZUKO!!!!!!!!!!!!!!!!!!!!\" He yelled. Zuko responded with a snore. Aang pouted, \"Aww, Monkey Feathers! ... Why do i keep saying that?\" he stared at Zuko, hoping he would feel eyes staring at him, but it didn't work, \"C'mon wake up!\" he said and poked Zuko in the ribs. Zuko's body stiffened and jerked away from the poke then relaxed. Aang's eyes widened, \"Is Zuko... nah... he's the Fire Prince.\" Aang looked around then poked Zuko again, harder. Zuko whined, pushed Aang's hand away then rolled on his other side. Aang stared with his mouth open, \"Zuko is... He;s ticklish!\" Aang whispered loudly to himself. His face lit up as he smirked with an idea. Aang then...</span></div></div>",
            "created":1216357200,
            "id":557319,
            "title":"Aang"
        },
        "11312":{
            "choices":[
                "Decided to tickle Zuko's feet",
                "Tickle Zuko's stomach"
            ],
            "content":"<div class=\"\"><div> <span>Aang cracked his fingers and began to tickle Zuko's ribs. Zuko immidietly bursted into laughter. Aang smiled as he continued. Zuko shot up and stared at Aang. Aang smiled and waved at Zuko.<br>\r\n\"Goodmorining Hotman!\" Aang smiled. Zuko glared at him.<br>\r\n\"Why were you tickling me?\" he asked.<br>\r\n\"'Cause I was trying to wake you up. I poked you, then you jumped and I figured you were ticklish.\"<br>\r\n\"I'm not ok? So leave me alone!\" Zuko stated, angrily, pulled the cover over his head. Aang pouted then smirked.<br>\r\n\"If you're not ticklish then why did you jump?\" Aang asked cleverly. Zuko remained quiet. Aang smirked and poked him in the ribs. Zuko jumped and grumbled. Aang giggled playfully and poked him rapidly. Zuko squirmed and giggled, \"'not ticklish' huh?\" Aang teased. Zuko pushed the covers from his head and grabbed Aang's hands. He poked Zuko in the rib's with his foot, which made Zuko squeal, then pined him down, \"Where should I tickle you first?\" he asked himself. Aang then...</span></div></div>",
            "created":1216357200,
            "id":557333,
            "title":"Started tickling his sides"
        },
        "113121":{
            "choices":[
                "Zuko turns the tables on Aang"
            ],
            "content":"<div class=\"\"><div> <span>Aang turned around with his back facing Zuko and pulled off the firebender's boots off along with his socks.<br>\r\n<br>\r\n\"This will get a better reaction out of you.\" Aang giggled and ran all ten fingers up and down Zuko's bare feet.<br>\r\n<br>\r\nZuko yelped and bit down on his lower lip, he tried valiantly to keep his laughter in while Aang's long fingers moved through the firebender's sensitive toes and down his smooth soles.<br>\r\n<br>\r\n\"Just a little bit more Zuko, and you'll break.\" Aang teased and moved his fingers faster.<br>\r\n<br>\r\n\"No fair! No hahahahahahah fair HAHHAAHHAHAHAH!\" He screamed with laughter covered his face with his hands. \"HHAHAHA PLEASE AHAHAHAH STOP AHAHAHHHAHA!\"<br>\r\n<br>\r\nWith his last remaining strength...</span></div></div>",
            "created":1230094800,
            "id":624420,
            "title":"Decided to tickle Zuko's feet"
        },
        "1131211":{
            "choices":[
                "stomach",
                "feet"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly without warning zuko pushed aang off him and pinned aang down!<br>\r\nAang:Hey,no fair!<br>\r\nZuko:*huffing and puffing*Now how do you like it!<br>\r\nThen zuko starts tickling aangs stomach rapidly!<br>\r\nAang:HAHAHAHAHAHAHAHHAASTOHAAHAHAHAHAHHAHHAHHANOHOHOHAHAHAHAHAAAAHAHAHAHAHHA HAHAHHA!!<br>\r\nAang:Oh yeah well take this!He blew into zuko's face and froze it a bit making him jump off and aang used earth bending he trapped zuk's hands and feet from moving.<br>\r\nZuko:Stop or I'll...<br>\r\nJust then aang he tickled his ribbs and armpits and zuko wiggled and laughed hard.<br>\r\nZuko:HAHAHAHAHAHAHAHAHAHAAAAAAHAHAHAHAHAHAHAHAHSTOOOOHOHOHHHAHAHAAHAHAHAHAHA HAHAHAHAANOWHOWHOHOAAAAAHAHAHAHAHAHAHAHAHAHAHAHHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHHHHAHHAHAHAHAHAHAHAHAA1<br>\r\nAang gave him a break and decided to tickle his..........<br>\r\n</span></div></div>",
            "created":1230354000,
            "id":625482,
            "title":"Zuko turns the tables on Aang"
        },
        "113122":{
            "choices":[
                "tickle his bellybutton"
            ],
            "content":"<div class=\"\"><div> <span>Aang then decided to tickle Zuko stomach. Aang used earth bending to bind Zuko hands and ankles.Aang then stared for a moment to admire his handy work \" Well Zuko lets see how ticklish the belly of yours is\" Aang teased \"No please don't tickle my stomach please I'll die please don't do it\" Zuko pleaded but before he could get done Aang had already rolled up Zuko shirt and started to tickle his flanks&amp; sides \"HAHAHAHAHAHAHAHAHAHAHAHAHPLEASE COME ON NOT THE STOMACH PKEASE THAT ONE OF MY MOST TICKLEHEEHEHEHEHEHE SPOTS HAHAHAHAHAHAHAHAHAHAHAHHEHEHEHEHEHEOHOHOHOHOHOHCOME ON HAVE MERCY PLEASE I'M BEGGING YOU YOU JUST STOP IT ALREADY PLEASEHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHI CAN'T TAKE IT NOMRE OKOKOK I ADMIT I'M TICKLISH K I TOOOOOOLD YYYOOOOU COUUUULD YOU STOP TICKLING ME NOW EHEHEHEHEHEHEHEHE\"Zuko sreamed in hysterical laughter while laughing his head off. \" Not quite yet there somthing I always wanted to to do \" Aang tauted. Right then Aang picked up a feather and  started to stroke his his stomach with the feather he found lieing in the air temple \" please not a feather   </span></div></div>",
            "created":1251176400,
            "id":750279,
            "title":"Tickle Zuko's stomach"
        },
        "1131221":{
            "choices":[
                "tickle Zuko's nipples",
                "tickle his feet"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes the feather lets go time for some real laugh hahaha\"Aang teased while he started to circle the feather around Zuko's navel \"HAAHAHAHAAAAAAAHAHAHAAHAHAHAHNOT THE BELLY BUTTON\"Zuko screamed in laughter  then when Ang dipped the feather the feather inside his belly button Zuko Just went wild and started bucking around in his bonds \"HAHAHAHAHAHAHAHAHAHAAAAHAHAHAHAHHHHAHAHAHAHAHAHPLEASE NOT THE BELLY BUTTON PLEASE I CAN'T TAKE COME ON JUST STOP HAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAH PLEASE TICKLE ME ANY WHERE HEHEHEHEHEHEHEEHEHHE JUST NOT MY BELLY BUTTONAHHAHAHAH\" Zuko shouted in ticklish agony \" well well it looks like I hit a  soft spot a Zuko then I guest it time that did this\" right then  Aang took a deep breath bend over and blew a long large rashberry into Zuko's belly button \"AAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHH AHAHAHAHAHAAAAAAHAHHAHHOHOHOHOHOHOHOHOHOHOHOHOHOHOHHEEHHEHEHEHEHEHEHEHPLEASE ANYTHING BUT THAT IT'S TO MUCH COME QUIT IT HAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAAHAHAHAHAHASTOPPLEASE IT JUST TOMUCH HEHEHEHEHEHEHEHEEHEHE JUST STOP I'M TO TICKLISH HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA I'LL GET YOU FOR THIS AANG TRUST ME I GET BACK FOR THISHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH\" Zuko in hystric laughter after then Aang stuck his tounge out and started circling his tounge around the rim of Zuko's belly button. As soon as Aang tounge made contact with Zuko wiggling senstive belly he was lost in uncontrollable laughter \"ohhhohhohohohohohohohoho don't lick my belly button come on just stop it please not that hahahahahahHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHEHEHEHEHEHEHEHEHEHEHEHAHAHAH AAHAHAHAHAHA STOP COME ON PLEASE NOMORE HAHAHAHAHAHAHAHAHAHAAHAHACOME ON DON'T LICK ME PLEASE I CAN'T TAKE PLEASEHAHAHAHAHAHAHAHAHAHAAHAHAH\" Zoku lost in uncontrollble laughter \" Now where shold I tickle you now\" Aang ask himself</span></div></div>",
            "created":1251262800,
            "id":750492,
            "title":"tickle his bellybutton"
        },
        "11312211":{
            "choices":[
                "His neck",
                "His feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aang moves up and starts to tickle Zuko's nipples with the pointed end of the feather, making him squeal with laughter. \"HAHAHAHAHA! NOHOHOT THAT!\" He said. Aanh tickled him there a minute of so before moving on too....</span></div></span></div>",
            "created":1396493940,
            "id":1772680,
            "title":"tickle Zuko's nipples"
        },
        "1133":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Toph",
                "Katara"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about:</span></div></span></div>",
            "created":1209531600,
            "id":526032,
            "title":"Other"
        },
        "11331":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "She, doesn't know what to do so she goes to get Katara",
                "She decides on TICKLE TORTURE"
            ],
            "content":"<div class=\"\"><div> <span>One night, when Toph was walking back to the main hall of the Airbending temple, she noticed a small whole in the wall. When, she looked at it more closely, it gave her a great idea. The night Zuko, pleaded to join the group, he burned her feet, and she was REALLY blinded for a whole day.<br>\r\n<br>\r\nLater that night, she went to Zuko and asked, \"Hey, Zuko, do you think you could help me with something.\"<br>\r\n\"Sure,\" Zuko replied. <br>\r\n<br>\r\nAfter dinner Toph led Zuko to the hole and said,\"I was playing with my bracelet and I threw far into that hole and for some reason, I can't bend it out or see anything in there.\"<br>\r\n\"Well, that's strange, but I 'll get it,\" he said, crawling into the hole.<br>\r\nHe kept crawling until all that was only his feet were sticking out.\"Hey Toph, I think I'm at the end of the tunnel and I don't think its here,\" Zuko said.<br>\r\n\"Right,\" Toph said, smiling mischievously, \"This is for burning my feet.\"<br>\r\n\"What is, Ah!\" Zuko yelled as Toph earthbended the hole shut around his body, restricting his movements so much, that all he could do was move his feet, a little.<br>\r\n<br>\r\n\"Now, what to do,\" Toph said, grinning evilly.</span></div></div>",
            "created":1209531600,
            "id":526379,
            "title":"Toph's Idea"
        },
        "113312":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Toph decides to go get something",
                "Toph, goes for his upper body"
            ],
            "content":"<div class=\"\"><div> <span>\"Zuko, now that you're a part of our team, I can't hurt you, but that doesn't mean I can't get revenge!\" Toph said.<br>\r\n\"What do you mean?\" Zuko asked.<br>\r\n\"I mean, I'm going to take off these little boots and see if these wittle footsies are ticklish,\" Toph, said, maniacally.<br>\r\n\"NOOO! Please don't tickle me,\" Zuko yelled.<br>\r\n\"Why, is the Fire Price ticklish?\" Toph asked in a babying tone.<br>\r\n\"Yes, its my biggest weakness, Azula used to tickle me all the time,\" Zuko stated.<br>\r\n\"Sorry, Zuko, but I can't resist,\" Toph said, as she slipped of his boots, revealing his soft pale soles. She started to drag her fingers lightly all over his feet, causing him to gasp and giggle. She kept on, until she reached a spot at the top, middle of his arches, right under the ball of his feet. <br>\r\nWhen she reached there Zuko shrieked with laughter, \"AHAHAHAHAHAHAHAHA NOOOOOO HEHEHEHAHAHIHI DON'T HAHAHA STOP!\" <br>\r\n\"Oh, don't stop okay, if you say so,\" Toph teased. \"Looks like I found a sweet spot,\" She said, tickling that spot again. <br>\r\n\"PLEEASE DON'T TICKLE ME ANY MORE AHAHAHA PLEASE I CAN'T TAKE IT HAHAHA,\" Zuko screamed. \"NOOO DON'T TICKLE THERE EITHER HAHAHAHA AHAHAHHA NOOHOHOHAHA HIHIHIHA!\" he screamed, as she tickled under and between his toes.<br>\r\n<br>\r\n\"I think its time to try something different,\" Toph said.</span></div></div>",
            "created":1209618000,
            "id":526459,
            "title":"Toph's Revenge"
        },
        "1133121":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "try something different on his feet",
                "find his other ticklish spots"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait just a minute, I'll be right back,\" Toph said as she walked way.<br>\r\nMeanwhile, Zuko was desperately trying to escape, unfortunately for him, he was completely unsucsessful. \"I've got to get free, she's only tickling my feet now, and I'm already becoming hysterical, and they're only my 2nd most ticklish spot. What if she decides to move spots,\" Zuko thought to himself.<br>\r\n\"I'm back,\" Toph said. As soon as she had finished, she started smearing some kind of stuff all over Zuko's feet.<br>\r\n\"Wha-haha-t are you-hoho dooing?\" Zuko asked through his giggles.<br>\r\n\"Oh, just feeding Momo,\" Toph said.<br>\r\n\"What do you me-HEHEHAHAHA NOOOOOHOHOH PLEASE DON'T HAHAHAHA WHAT ARE HAHA YOUHOOHOOO DOOING AHAHAHA!\" Zuko asked, laughing hysterically as Momo lapped the food off his feet, all over the arches, in between his toes and right on his sweet spot.<br>\r\n\"Like I said, I'm feeding Momo some berries, I made into jam,\" Toph said, laughing herself.<br>\r\n\"PLEEEASE DON'T HAHAHA FEED HIM HEHEHAHA SOMETHING ELSE HAHAHAHA!\" Zuko pleaded. Zuko was really laughing hysterically, so Toph let him have a little break. Afterwards she decided to...</span></div></div>",
            "created":1209618000,
            "id":526462,
            "title":"The Fire Prince's Torture"
        },
        "11331212":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "his worst spot, his armpits",
                "his worst spot being his stomach"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Zuko, let's move to somewhere else\" Toph said.<br>\r\n\"NO!\" Zuko yelled.<br>\r\n\"Oh, is there somewhere else on you that's even more ticklish than your tootsies?\" Toph, probed, inquisitively.<br>\r\n\"No, no not at all, I just don't want any more tickling,\" he said.<br>\r\n\"Sure, I'll just stop now,\" Toph said, her voice dripping with sarcasm. Toph pushed Zuko into the rock all the way, and by also using her earthbending, turned him vertically, pulled him into an X formation and then bought his body out of the rock except for his arms, from his elbows to his hands and his legs, from his knees to his toes. She then decided to tickle his...</span></div></div>",
            "created":1209618000,
            "id":526464,
            "title":"Zuko's Tickle Spot"
        },
        "113312121":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "tickles his feet again",
                "decides he's had enough."
            ],
            "content":"<div class=\"\"><div> <span>Toph started to untie his robe while he was pleading profusely for her to just let him go, once she had untied it, she cut it off with a knife and started to tickle his arm pits, Zuko exploded, \"NOOOOOHOHOHO HAHAHAHAHAHA PLEEEHEHEASE STOHAHAP DOHOHON'T DOHOOHOO THIS! HAHAHAHAHA HIHIHIHI NOOOOOO HAHAHAHAHAHAAHAHAHA AHAAHAHAAAH PLEHEHEASE JUHAHAST STOHAHAP! I CAN'T TAKE IT HAHAHAHA PLEASE DON'T TICKLE HAHAHA MY PITS HAHAHAHA! THEY'RE MY MOHOHOST TICKLISH SPOHAHAHAT,\" Zuko cried as he laughed his head off.<br>\r\n\"Wow, Zuko your pits are insanely ticklish!\" Toph exclaimed, giving Zuko a small break.<br>\r\n\"YA THINK!\" Zuko yelled.<br>\r\n\"Hey don't yell at me, at least I didn't hurt you,\" she stated, \"Just for that I'm going to have to tickle you some more.\"<br>\r\n\"NO PLEASE DOHOHOHON'T HAHAHA,\" yelled Zuko as Toph tickled his ribs and stomach. \"I REALLY CAN'T HAHAHA TAKE ANY MOHOHOHORE! Please,\" he screamed again, as Toph started to slow down. Just then Toph leaned in close and blew a huge raspberry into Zuko's belly-button, causing him to convulse into hysterical laughter all over again. \"NOOOOHOHOHO HAHAHAHAHAHA!\" he shrieked as she blew more raspberries. She then...</span></div></div>",
            "created":1209618000,
            "id":526472,
            "title":"Zuko's Arm Pits (his most ticklish spot)"
        },
        "1133121211":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "content":"<div class=\"\"><div> <span>\"I think, you've almost had enough\" Toph said, \" I'll just tickle your feet a little more and then, I'll let you out.\"<br>\r\n\"Well, Ha then, my feet are trapped in rock and if you take either one out I'll be able to break free!\" Zuko pointed out.<br>\r\n\"Who, says I'll need to take them out of the rock to tickle them,\" she said.<br>\r\n\"Then how will you...\" Zuko started, just then, Toph started to make the earth aroungd Zuko's feet, have little ridges, and then made it vibrate causing him to laugh out loud, all over again,\" HAHAHAHA HOOW ARE YOUHOOHOO DOOING THAHAHAT! STOOHAHAP I'M REALLY HAHAREALLY SORRY ABOUHAHAT BUNING YOURHEHEHE FEEHEHEHET!\"<br>\r\n<br>\r\n\"Oh, alright, I guess you've had enough,\" Toph said, releasing him from the rock.<br>\r\n\"Thanks, please don't do that ever again,\" Zuko begged.<br>\r\n\"Well, I'm not making any promises, but, I'll try,\" Toph replied.<br>\r\n\"Come on, we're even now, let's go back and join the others,\" Zuko said.<br>\r\n\"Yeah, your right, let's go,\" Toph agreed giving him one last poke before they walked off towards base camp.</span></div></div>",
            "created":1209618000,
            "id":526476,
            "title":"Zuko's Tickle Finale"
        },
        "113312122":{
            "choices":[
                "Toph went to get Katara to help her",
                "Toph pulls out feathers"
            ],
            "content":"<div class=\"\"><div> <span>Toph looked up and down Zuko's body then eyed his stomach. <br>\r\nShe smirked, \"Let's try your tum-tum.\" she teased and rolled up his shirt. <br>\r\n\"NO! Please!\" Zuko begged, trying to squirm. Toph began to wiggle her finger playfully towards Zuko's stomach. He whined in terror as she got closer and closer. Toph started circling her finger on Zuko's stomach, causing him to giggled uncontrollably.<br>\r\n\"Is the wittle Fire Pwince tickwish?\" Toph teased and tickled him faster.<br>\r\n\"NOOOHAHAHAHAAAA! STAHAHAHAAAP! PLEASE!!!!!!!!!!!!!\" He begged and started thrashing around as much as he could. Toph giggled.<br>\r\n\"Wow zuko. You're really ticklish on your tummy...\" she said in a sqeaky voice. \"Now what?\" she thought.</span></div></div>",
            "created":1216357200,
            "id":557316,
            "title":"his worst spot being his stomach"
        },
        "1133121221":{
            "choices":[
                "Toph and Katara see Azula who says all she is there to do is tickle Zuko",
                "They stop tickling Zuko"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Katara! You wont beleive what I discovered!!\"<br>\r\n<br>\r\n\"NO!\" Zuko said knowing how many things Katara would want revenge for<br>\r\n<br>\r\n\" To late here she come!\" Toph said<br>\r\n<br>\r\n\" What do we have here?!\" Katara said<br>\r\n<br>\r\n\" Zuko... Is Ticklish!\"<br>\r\n<br>\r\n\" No way! You know Zuko I have a bone to pick with you\"<br>\r\n<br>\r\nShe bent down close to his ear.<br>\r\n<br>\r\n\"You're not getting off easy.\"<br>\r\n<br>\r\n\" He's in good? Can't move?\" <br>\r\n<br>\r\nToph grins \" You bet.\"<br>\r\n<br>\r\n\"Great work.\" <br>\r\n<br>\r\n\"Where to start?\" Katara said.<br>\r\n<br>\r\nToph leaned over and whisper into her ear.<br>\r\n<br>\r\nZuko tried to hear them but couldnt.<br>\r\n<br>\r\nKatara giggled.<br>\r\n<br>\r\nShe look Zuko in the eye<br>\r\n<br>\r\n\" Five minutes for every one thing you've done wrong to us.<br>\r\n<br>\r\n\" You attacked my village!\"<br>\r\n<br>\r\nShe dug her fingers into his ribcage. She wiggled them around and into each rib. <br>\r\n<br>\r\n\" NOOOO AHAHAHAH HAHAHA STAHHHAAAP PLEEHAHAZE\"<br>\r\n<br>\r\nKatara waterbended octopus hands eight watery finger. She sent one hand to Zukos feet and the other to his chest. <br>\r\n<br>\r\nToph bent down and spider tickled his armpits<br>\r\n<br>\r\n\" NOO HAHAHA STAHAHAP DOOONT! HAHAHA! STAHAHAP!\"<br>\r\n<br>\r\n\" Dont stop? If you insist!\" Katara said<br>\r\n<br>\r\n\" THAAHATS NOOAHAT WHAAAHAHAT I MEEEAANT!\"<br>\r\n<br>\r\n\" To bad... Let's see you burned Toph's feet.<br>\r\n<br>\r\nKatara flung her hair onto his chest.<br>\r\n<br>\r\n\" TOPH ALRAHAHAEADY PUNIIIIISHED MEEHEHEHE!\"<br>\r\n<br>\r\n\" But it offended me to!\" Katara said running her hair up and down Zuko's chest<br>\r\n<br>\r\nHours past while Katara and Toph named every bad thing Zuko had done. <br>\r\n<br>\r\nWhat happens next<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1434672120,
            "id":1994641,
            "title":"Toph went to get Katara to help her"
        },
        "11332":{
            "choices":[
                "ribs+armpits",
                "stomach"
            ],
            "content":"<div class=\"\"><div> <span>It was a rainy day and Katara noticed that Zuko was gone.She then got Hinnabi up(my character)but she said she had to practice her fire bending technique so,she went to the cliff over the sea and she found zuko but something was wrong.Zuko was just standing there staring out to nowhere and his head sulked.She walked up to him...<br>\r\nKatara:...zuko...are you alright?<br>\r\nZuko:*no response*<br>\r\nKatara:Come on!<br>\r\nZuko:...<br>\r\nKatara(is he being controlled...no he's ignoring me grrrrr!)Okay stop ignoring me!*pokes him in the ribs*.<br>\r\nZuko jerked and stood still again.Katara poked him harder and he yelped abit.<br>\r\nHe turned his head...<br>\r\nZuko:stop it!go away<br>\r\nKatara:evil smirk*Well zuko I didnt know you were ticklish.<br>\r\nZuko:*surprised face*I am not so just g...<br>\r\nKatara:Oh really well then you wont laugh if I do this!<br>\r\nSuddenly she uses water bending and pins him down.<br>\r\nZuko:what are you doing?!LET ME GO!!!!!<br>\r\nThen she tickles his............</span></div></div>",
            "created":1230440400,
            "id":625754,
            "title":"Prince's little seceret"
        },
        "12":{
            "choices":[
                "good",
                "bad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which kind of avatar girl do you want to tickle good or bad.</span></div></span></div>",
            "created":1210222800,
            "id":529459,
            "title":"Female"
        },
        "121":{
            "choices":[
                "Katara",
                "Toph",
                "Suki"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one of the good girls do you want to tickle</span></div></span></div>",
            "created":1210222800,
            "id":529460,
            "title":"good"
        },
        "1211":{
            "author_id":"rotc",
            "author_name":"E",
            "choices":[
                "tickling toph to",
                "let toph tickle katera",
                "let toph talk"
            ],
            "content":"<div class=\"\"><div> <span>So Katera and Aang were working on some water bending when Aang said,\"Katera are you ticklish and Katera said,\"no why, Aang said,\"Because you look ticklish. So Aang stoped bending asked Katera if she wanted a break and Katera said,\" yes. So Aang and Katera took a break on the shore. Then when Katera said,\" I am going to take a nap. Aang and some help from his friends grabbed katera and tied her to a tree. Katera awoke to see her hands tied above her head and her feet spread little bit and tied. Aang said,\" you are awake Katera, Katera said,\" what are doing untie me. Aang look at Katera's body and said,\" are you ticklish Katera we will find out. Katera said,\" do not tickle me.then Aang grabbed some feathers and some brushs and when to starting tickling when Katera said,\" I will not let you tickle me , \" what can you do katera  you are restained to a tree Aang said\". Aang starting with Katera feet with a bursh, WOW Katera are you have some ticklish feet,Katera yell stop please. But Aang said,'' now lets move to the thighs. \"No Aang please said katera\". Aang starting grabbing her thighs and tickling them. Now Aang said let go to the belly and belly button, katera said,\" no please. Katera's body started to wiggle and katera said I have a very ticklish belly button please do not tickle it. I am sorry Katera but it as got to be done. So Aang starting tickling with the brush in thr belly button and useing a feather around the belly button.then toph was walking and saw what's was going katera and she said Katera ticklish a girl. Aang  thought of  </span></div></div>",
            "created":1213160400,
            "id":542894,
            "title":"Katara"
        },
        "12111":{
            "author_id":"angelinac",
            "author_name":"Angelina",
            "choices":[
                "They keep tickling them for 3 more hours.",
                "Or they had enough."
            ],
            "content":"<div class=\"\"><div> <span>So Aang asked Toph if she was ticklish. she said no in a sneaky way. So Aang pounced on Toph and started to tickle her while Sokka was taking care of Katara. Both the girls were laughing so hard it felt like theycouldent breath. A few hours later the boys thought they had enough. Or had they?</span></div></div>",
            "created":1280379600,
            "id":926827,
            "title":"tickling toph to"
        },
        "121111":{
            "choices":[
                "Katara",
                "Aang"
            ],
            "content":"<div class=\"\"><div> <span>Sokka laughs and laughs (evilly) tickling his sister while Aang has toph bound by the rocks and is tickling her beautiful soles.  Suddenly sokka suprises Aang and binds him and just when Sokkka is about tickle them all, and explosion of fire comes for a fire nation ship and Azula and her friends capture the gang and ake them to her personal dungeon of torture. <br>\r\n<br>\r\nTheyre tied on tables with only their underwear on.  And then Azula comes in the room and announces that theyre all gonna be tickle tortured till she turns them into the fire lord. then she leaves the room.<br>\r\n<br>\r\nThe Azula comes back and goes toward.....</span></div></div>",
            "created":1304700060,
            "id":1100954,
            "title":"They keep tickling them for 3 more hours."
        },
        "1211111":{
            "author_id":"dinopimp",
            "author_name":"DONKEY TEETH",
            "choices":[
                "Continue with Katara's belly button.",
                "Get more people to help tickle Katara."
            ],
            "content":"<div class=\"\"><div> <span>When Azula goes towards Katara, she is terrified of the tickle torture to come. \"Look at this vulnerable, helpless, weak belly of yours. I wounded how long you'll be able to stand the tickling at that spot.\" Azula says teasingly, knowing that it would only scare Katara even more. She had made her nails extra sharp for this, so that their tickle torture would be too extreme for them to escape. \"Let us go!!!\" Yelled Katara. <br>\r\nAzula ignored her and started the tickling. She spider tickled all over Katara's helpless belly and would occasionally dig her fingers into Katara's sides as well. This drove her nuts. \"Ahahahahahahahahahaha Ahahahahahahahahahahahahahahaha ahaha!!! Ahahahahahahaha stahahahahap that, pleeeeeaaase! Ahaha cut it out! Ahahahahahahahahahaha Ahahahahahahahahahaha ahaha come on, Ahahahahahahahahahaha stahahahap!!!\" She laughed hysterically. Azula continued and started to speed up, \"Why would I ever stop now, I'm just getting started. Plus I don't think I'm quite ready to hand you over to the Fire Lord, just yet\". <br>\r\nNow Azula let one of her fingers slip into Karara's belly button, her extra sharp nails made this unbearable for poor Katara. Her finger would twist, turn, and spin inside Katara's belly button, pushing her over the edge. \"Nahahahahat my belly..... Ahahahahahahahahahaha button!!! Ahahahahahahahahahaha Ahahahahahahahahahaha Ahahahahahahahahahahahahahahaha Ahahahahahahahahahaha pleeeeeeeaaase, stahahahahahahahahap! Nohohohohohohoho no more!!!\" </span></div></div>",
            "created":1363919040,
            "id":1555441,
            "title":"Katara's Belly."
        },
        "12111111":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Escape",
                "Another victim"
            ],
            "content":"<div class=\"\"><div> <span>          <font class=\"size35\" style=\"\"><span style=\"line-height:1.8;\"> She leant over and swirled her tongue around. Katara  screeched in helpless laughter. ''HAHAHAHAHAHAAH. NO, NO, NO,HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA. PLEEHEHESSSAHAHAHAHAHAHAHAHA! I'm beg ahahahahahahaha I heheheeh nng hahahaha you.'' I'm sure you are.'' Azula replied before reaching for another implement. Katara strained against her bondage was held fast. ''I wonder what my dear friend Mister Feather would think of you.'' She tipped the feather inside her belly button and swirled it around. This set off another spout of hysteria. <br>\r\n<br>\r\n          She moved down to where she could reach her thighs. She momentarily set aside the feather to dig at her thighs. Katara was helpless as she dug her nails into sensitive flesh. Then moved down to her feet. Using her tongue and Mister feather, she brought Katara to another realm of helpless laughter. Nibbling on her toes and getting between her toes with the feather, Azula finally glanced down at her exhausted captive. ''My you do look exhausted. Good thing I have other play things to amuse myself with.'' So saying, she left Katara in helpless fear for her friends. They had to escape. she thought frantically. They'd never survive otherwise.</span></font></span></div></div>",
            "created":1437076620,
            "id":2008889,
            "title":"Continue with Katara's belly button."
        },
        "1212":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Aang comes back",
                "she's tormented further",
                "Katara to the rescue"
            ],
            "content":"<div class=\"\"><div> <span>           Toph found herself in an Earthen binds. Her feet in stocks of Earth and her hands held down on her rock seating arrangement with Earth bended shackles. She was currently plotting revenge. As a certain air bender had gotten the best of her. Honey covered her soles and Oppa was licking her soles. She'd been this way for over an hour now and still no hope of rescue had presented itself. Oh yeah, Aang, your dead. She thought as she pondered how to get out of this sticky situation. </span></div></div>",
            "created":1437078180,
            "id":2008905,
            "title":"Toph"
        },
        "1213":{
            "choices":[
                "the evil girls",
                "Sokka",
                "Katara"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will tickle Suki</span></div></span></div>",
            "created":1210222800,
            "id":529529,
            "title":"Suki"
        },
        "12131":{
            "choices":[
                "Ty Lee",
                "Azula"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will interrogate Suki</span></div></span></div>",
            "created":1210222800,
            "id":529531,
            "title":"the evil girls"
        },
        "121311":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "content":"<div class=\"\"><div> <span>           <span style=\"line-height:1.8;\"><font class=\"size4\" style=\"\">Ty Li was visiting one of her favorite captives at ''The Boling Rock''. A top fire nation prison run by her friend Mai's uncle. Sitting in front of her was ex-Kyoshi warrior Suki. Hands bound behind her back she glared at the girl. ''Come back to gloat?', she questioned angrily. Ty Li smiled down at her. She lifted a foot into her lap. ''I've missed you since last we met.'' She lightly ran her finger down the girl's sole. Suki's foot trembled slightly. Suki tried to rein herself. Ty LI just kept smiling and stroking her foot. ''You've always struck me as a laugher.'' She ran her fingers a little harder on the wiggling sole in her grasp. ''Now I aim to prove that.'' She set a full attack on Suki's helpless foot. Suki laughed controllably which only encouraged Ty Li further. ''See, I knew it.'' She grasped Suki's other foot and tickled them relentlessly to the background music of laughter. <br>\r\n<br>\r\n          A good half an hour later she stopped. Suki struggled to catch her breath. Setting her feet down, Ty Li approached her captive. ''I think a new angle is needed here.'' She dug into Suki's ribs, setting her off again. Poor Suki's helpless laughter could be heard throughout the hallways. Being a prison, no one bothered to investigate the noise. Prison life was rough and sometimes, being a prisoner was a struggle, to make it out alive again. </font></span></span></div></div>",
            "created":1437077880,
            "id":2008903,
            "title":"Ty Lee"
        },
        "12132":{
            "choices":[
                "Footrub",
                "Tackle and tickle"
            ],
            "content":"<div class=\"\"><div> <span>Suki and sokka were hanging around on the beach just enjoying the sunlight and sea breeze but sokka had something on his mind and he had a devious plan instore for suki. She was barefoot at this time so his plan would definitely work he just had to get to her feet without getting killed since she's a kioshi warrior and a master martial artist. \"So since he she's always on her feet they must be sensitive\" thought sokka. \"Now all I need to do is find a way to get to them\".....</span></div></div>",
            "created":1361331420,
            "id":1535807,
            "title":"Sokka"
        },
        "122":{
            "choices":[
                "Azula",
                "Ty Lee",
                "Mai"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one of the evil girls do you want to tickle</span></div></span></div>",
            "created":1210222800,
            "id":529463,
            "title":"bad"
        },
        "1221":{
            "author_id":"jacob1289",
            "author_name":"Jacob12890",
            "choices":[
                "tickle her soft soles",
                "tickle her sides",
                "tickle her armpits"
            ],
            "content":"<div class=\"\"><div> <span>Azula awoke in a dark dungeon,<br>\r\n\"what, were am i\"<br>\r\nthen she heards a voice and demands they come in to the light. it was Ty Lee.<br>\r\n\"Ty Lee what do you think you are doing, untie me right now\"<br>\r\n\"sorry Azula but i would rather not, infact there is something i hav wanted to do for sometime to you no.\"<br>\r\n\"what\"<br>\r\n\"tickle you\"<br>\r\nthis made Azula struggle just slightly.\" Well i dont care what you want just untie me now!!!\"<br>\r\nNow then, were to start...</span></div></div>",
            "created":1215579600,
            "id":554035,
            "title":"Azula"
        },
        "12211":{
            "author_id":"funnyguy69",
            "author_name":"C-dawg!",
            "choices":[
                "Ty lee tickles both her feet at once",
                "Mai comes to help ty lee"
            ],
            "content":"<div class=\"\"><div> <span>Ty lee slipped off azulas royal shoes and knee length white socks and said \"wow you have really nice feet azula!\" Azula quickly said back \"ty lee if you touch my feet I will burn you!!\" Ty lee then took two steps back.... Then got close to her again and gently slid her index finger across one of her feet which had her very close to laughing but azula was desperate to not show that she was ticklish but then...</span></div></div>",
            "created":1418853180,
            "id":1904057,
            "title":"tickle her soft soles"
        },
        "12212":{
            "choices":[
                "stomach"
            ],
            "content":"<div class=\"\"><div> <span>\"now, how about we go to your sides and see how loud you'll laugh<br>\r\n\"no don't please don't<br>\r\nbut he didn't listen to her. he dug his fingers into her sides<br>\r\n\"stop it pleeeeeeeeease<br>\r\n\"no i don't think i will <br>\r\n\"i'll have you kow that i have actually had a slight crush on you<br>\r\nnext he goes to her</span></div></div>",
            "created":1242536400,
            "id":692498,
            "title":"tickle her sides"
        },
        "12213":{
            "author_id":"dbzfan12",
            "author_name":"Terry",
            "choices":[
                "Belly and belly button",
                "Continue with armpits"
            ],
            "content":"<div class=\"\"><div> <span>I know the armpits. Ty lee said<br>\r\n<br>\r\nYou wouldn't dare. Azula snapped<br>\r\n<br>\r\nWhat's wrong? You aren't ticklish are you. Ty lee replied<br>\r\n<br>\r\nNo!! Who ever heardof a princess of the fire nation be ticklish<br>\r\n<br>\r\nI think your lying. Ty lee said <br>\r\n<br>\r\nShe walked over to her and started poking her armpits.<br>\r\n<br>\r\nAzula fought to hold it in. It was almost impossible. Soon she felt<br>\r\nherself smiling. <br>\r\n<br>\r\nWhats wrong azula? Does this maybe tickle. Ty lee taunted<br>\r\n<br>\r\nAzula was fighting with every fiber in her body not to laugh.<br>\r\nShe could barely hold it in. She finally cracked when Ty lee went to<br>\r\nHer ear and whispered cutchi cutchi coo<br>\r\n<br>\r\nHahahahahahahahahahahehehehehehehehehehehehehehehehehahahahahahahahahahahaha hahahahahahahahahahahahahahahahahahahahhahaha<br>\r\nHahahahahahahahahahhahahahahhahaahahahahahahahahajahahahaaaahhhhhhaaaaaaaaah ahahahahahhaaahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahh ahahahahahahahahahstahahahahahahahahahahahahhap pleehehehehehehehehehehehehehse it tiickklllleeeeesss tooooo muchhahahahahajahahahahaha I can't tahahahake ittt.<br>\r\n<br>\r\nWhat happened to princesses not being ticklish?Ty lee said<br>\r\n<br>\r\nNext I'll tickle your.......</span></div></div>",
            "created":1309759140,
            "id":1139920,
            "title":"tickle her armpits"
        },
        "122131":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "thighs",
                "feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> One hand tickling her belly and the other feathering her belly button, the princess was in helpless laughter. She remained that way for a while before Ty Li settled on a different of action.</span></div></span></div>",
            "created":1437078480,
            "id":2008908,
            "title":"Belly and belly button"
        },
        "1222":{
            "choices":[
                "A badger-sloth to lick her feet",
                "A feather to tickle her belly button",
                "Another dy lee agent to tickle her upper body"
            ],
            "content":"<div class=\"\"><div> <span>Ty lee was relaxing comfortably by the turtle-duck pond in azula and zuko's palace home where they grew up she's laying back with her feet in the cool water snoozing soundly to the quiet and peaceful sounds of both the turtle-ducks quacking and water trickling. Now if you were near her you would hear her giggles and quiet squeals as she was dreaming. (inside Ty lees dream). Ty lee had been kidnapped by the dy lee Ba sing se's special guards and was currently being interrogated by them in there \"special\" manner. \"Hahahaha stohohop hehehe I'm ticklish eeeeeeeehehe\". Ty lee giggled but the dy lee agent tickling dy lees feet simply shook his head and said \"Only if your ready to talk Mrs. Fire nation spy.\" But Ty lee was less scared of this man and more sacred of her fire nation princess azula she knew all to well from what happened at the circus how capable azula was of causing pain and she also knew how ticklish Ty lee was so she shut her mouth tight and prepared for more tickling. But it didn't come so she looked at the dy lee agent and saw him smiling which scared her alot \"he's planning something\" she thought. She didn't have to wonder what he was planning for long because he saw the question in her eyes and answered. \"Don't worry I'm bringing in a nice ticklish surprise for you little feet here.\" Then he rose from his chair leaving Ty lee to wonder what he had in store for her......</span></div></div>",
            "created":1361330100,
            "id":1535791,
            "title":"Ty Lee"
        },
        "12221":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Ty Li is saved",
                "Azula torments further"
            ],
            "content":"<div class=\"\"><div> <span>          Ty Li struggled to move away to no avail. The creature was brought in and left to it's devices. But not before something cold, gross and slimy was applied to her bare vulnerable feet. The badger sloth sniffed her feet before taking tentative licks. Ty Li wiggled her feet trying to evade the animal's tongue. But using it's sharp clawed paws, it managed to hold her foot down to lick off the mystery substance. Unintentionally raking it's claws down her feet as well. Ty Li was helpless with laughter when something jolted her awake. <br>\r\n<br>\r\n          She found herself gagged and hogtied. She couldn't budge free. There was Azula, smirking at her bedside. ''My Ty Li, what an interesting dream you were having. Shall we make it come to pass. That said, she took the girl's braid and brushed it down her exposed armpits. ''I think we''ll  have a bit of fun, you and I.'' She continued to torment a bound and gagged Ty Li to her friend's distress.</span></div></div>",
            "created":1437079080,
            "id":2008910,
            "title":"A badger-sloth to lick her feet"
        },
        "1223":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Zuko has fun",
                "other",
                "Azula joins in"
            ],
            "content":"<div class=\"\"><div> <span>          <font class=\"size3\" style=\"\">It was a disgruntled Zuko that slammed the door to his inner chambers. A mischievous Azula  had told him there was a surprise waiting in his room. Thinking she'd done something to his terrible, he hastened there just to find... He had to step back to take in what his eyes were telling him. At first he was troubled, then he started to smile. On his bed, was a barefoot Mai with a gag in her mouth, lying on her stomach spread eagle. And looking absolutely furious too. He closed the door and moved to the bed. On the side table was a note. <i>Thought you'd like to work off some steam. A.</i><br>\r\n<br>\r\n          Zuko smiled again and looked around to see tickle implements spread around the room. Mai was definitely trying to get something through to him. He took off the gag and she exploded. ''What are you waiting for, untie me! When I see that sister of yours I'm gonna...' Her rant died off as she took in the look on his face. ''Zuko, what's wrong?, she asked trembling just a mite. He smoothed her hair back. ''Nothing at all.'' She sighed in relief and said ''hurry up and untie me then, come on.'' Zuko picked up one of Mai's daggers and slowly led it's side down one sole and between her toes. Her foot jerked slightly in his grip. ''I don't think that's happening anytime soon. My captive princess.'' Mai shuddered slightly at what would unfold.</font></span></div></div>",
            "created":1437079980,
            "id":2008918,
            "title":"Mai"
        }
    },
    "info":{
        "author_id":"tklwizard",
        "author_name":"wizkid",
        "brief_description":"This is a story about the characters from Avatar and how they get tickled. Enjoy!",
        "created":1209538200,
        "description":"<td align=\"left\" class=\"norm\">This FanFic is about the characters of avatar in season 3 and and the situations in which they get tickled.<br>\r\n<br>\r\nAvatar: The Last Airbender was not created by me but by Michael Dante DiMartino and Bryan Konietzko and is on Nickelodeon.<br>\r\n<br>\r\n-Please keep it PG<br>\r\n -No nudity<br>\r\n -No Sex<br>\r\n -No cursing<br>\r\n<br>\r\nOther than that, please add on as much as you like.</td>",
        "id":1420292,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1437079980,
        "modified":1437079980,
        "pretty_title":"Avatar Tickling FanFic"
    }
}