{
    "chapters":{
        "1":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "Are you a boy",
                "Are you a girl"
            ],
            "content":"<div class=\"\"><div> <span>You are a busy 18 year old getting ready for college. you are packing all your books, pens, laptop, and o-ya your iPod in your parents truck to go to the doorm room on campus, when you find a toy your pet dragon has been look for for ages. Your dragon is just sun bathing on the shelf for the window. You also remember that it's been a while sence you sat down and cared for your dragon.</span></div></div>",
            "created":1278301200,
            "id":911771,
            "title":"Starting"
        },
        "11":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what is your dragon?</span></div></span></div>",
            "created":1278301320,
            "id":911772,
            "title":"Are you a boy"
        },
        "111":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "A nice air ride",
                "He is going to take you to his homeland",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You are lying on your bed when you see something in front of you.<br>\r\nYou realize it is your old dragon but he is bigger than you.<br>\r\nSuddenly he grips you close to him using his claws.<br>\r\nWhen you look at him you notice loneliness in his eyes.<br>\r\nYou then ask what he wants to do.<br>\r\nHe then makes a gesture showing him holding, playing, and cuddling with you.<br>\r\n\"I get it, you want me to spend time with you.\" you say.<br>\r\nHe nods, then goes outside.<br>\r\nHe then spreads his wings and puts you on his back.</span></div></div>",
            "created":1303490640,
            "id":1092511,
            "title":"Boy"
        },
        "1112":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "The next morning",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>You hold on to his horns as he lifts off.<br>\r\nYou look down and see houses where forests once stood.<br>\r\nYou look at you dragon and he gives you a look of worry.<br>\r\n\"What's wrong?\" you ask.<br>\r\nSuddenly, it speaks and it has the voice of a male.<br>\r\n\"This used to be part of my grounds, until your race destroyed it and built your homes on it.\" he says.<br>\r\n\"I-I never knew.\" you said.<br>\r\n\"Come on, I'll take you to my cave.\" he said.<br>\r\nSoon you reach a cave in a mountain.<br>\r\n\"This is my home.\" he said.<br>\r\nHe lets you off and nudges you.<br>\r\n\"Take off your clothes.\" he says.<br>\r\n\"This is a bit sudden, but ok.\" you say.<br>\r\nYou take off all your clothes including your underwear.<br>\r\n\"Ok, now what.\" you say.<br>\r\nYour dragon sets you facedown on his lap, then all of a sudden....SMACK, you feel a stinging sensation on your butt and then you realize he is spanking you.<br>\r\n\"Ow, Ow, Ow.\" you cry in pain.<br>\r\n\"You neglected me for years, now you are getting your punishment.\" your dragon says.<br>\r\n\"I'm sorry.\" you say in tears, \"I didn't mean to neglect you, I sort of just forgot about you.\" you say.<br>\r\n\"Hmmph.\" your dragon says not believing you.<br>\r\nSuddenly, you smell smoke and see something burning upon closer inspection, you see your dragon has burned your clothes to cinders.<br>\r\n\"What did you do that for?\" you yell angrily.<br>\r\nHe flips you upright, so your bare butt is now on his lap.<br>\r\n\"Listen to me, you now belong to me, and you are never going to see your race again until I say, AM I CLEAR?\" he responds.<br>\r\n\"yes.\" you say.<br>\r\n\"Good, now be a good human and give me a hug.\" he says.<br>\r\nYou hug your dragon's red scaley chest.<br>\r\n\"Now I need to mark you.\" he says.<br>\r\n\"Your not gonna mark me with you piss or poop, are you?\" you ask frightfully.<br>\r\n\"No, I have a different idea in mind.\" he says.<br>\r\nYou see he has an unknown mineral in his hand.<br>\r\n\"This here is Dragnamium, a special mineral only us dragons know about.\" he says.<br>\r\nHe then makes a fire mark near your eyes, then for your chest, he makes the sign of a dragon, then for your legs, he makes the same tribal markings as he has on his forehead. He then marks your back, arms, and shoulders with the Dragnamium.<br>\r\n\"There, you're all marked.\" he says.<br>\r\n\"What did you do?\" you ask.<br>\r\nI marked you with my clan's markings, though all clan members have different markings.\" he says.<br>\r\n\"Wow, that's incredible.\" he says.<br>\r\nHe then blows fire to make a campfire.<br>\r\n\"That should keep you warm.\" he says.<br>\r\n\"Eat what you like now, because next week, you'll start having cravings for human flesh.\" he says.<br>\r\n\"Human flesh, Isn't that cannibalism?\" you ask.<br>\r\n\"You could say that.\" he replies.<br>\r\nHe shares his killed bear with you.<br>\r\n\"Here, you need your strength.\" he says.<br>\r\n\"Thanks.\" you say.<br>\r\nYou take a bite out of the meat and realize it tasted just like chicken.<br>\r\n\"Hey, this is not half bad.\" you say.<br>\r\nYour dragon just chuckles at your remark.<br>\r\nYou look outside and see the sun setting.<br>\r\nYour dragon sits with you and watches.<br>\r\n\"Oh, and I forgot to tell you, those marks are permanent.\" he says.<br>\r\n\"That's ok.\" you say.<br>\r\nHe wraps his claw around your back.<br>\r\n\"This is one of the most beautiful sunsets ever.\" you say.<br>\r\n\"Yeah.\" he says.<br>\r\nYou look into his red eyes, and he looks into your brown eyes.<br>\r\nThe two of you realize this may be the new start of the bond between you two.<br>\r\nWhen the sun finally disappears, the two of you go back into the cave.<br>\r\nYour dragon blows a small patch of fire to warm you up.<br>\r\n\"Thanks.\" you say.<br>\r\n\"Alright, time for bed.\" he says.<br>\r\nHe places you near his stomach and curls up, guarding you as the both of you fall asleep.</span></div></div>",
            "created":1317165780,
            "id":1196313,
            "title":"He is going to take you to his homeland"
        },
        "11122":{
            "author_id":"phoenixgod1995",
            "author_name":"phoenix",
            "choices":[
                "Your parents try to get you back.",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens?</span></div></span></div>",
            "created":1317247680,
            "id":1196877,
            "title":"something happens"
        },
        "112":{
            "author_id":"tyranos",
            "author_name":"Katakuna",
            "choices":[
                "fire breathing dragon",
                "elemental dragon",
                "really tiny dragon that you could hold in your hand"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so its a girl what type of dragon is she</span></div></span></div>",
            "created":1283524380,
            "id":949292,
            "title":"Girl"
        },
        "1121":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Large dog",
                "Horse",
                "Rhino or bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well she was a dragoness... about (size)</span></div></span></div>",
            "created":1475462280,
            "id":2218104,
            "title":"fire breathing dragon"
        },
        "11212":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Red",
                "Blue",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She was about the size of a horse... and well you had ignored her because things had to be done.... but you would pay attention to her after you gave her this back... As you think about her color...</span></div></span></div>",
            "created":1475462400,
            "id":2218105,
            "title":"Horse"
        },
        "112122":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Shrunk (main event)",
                "Interspeices sex",
                "getting deeper with her. (vore)"
            ],
            "content":"<div class=\"\"><div> <span>She was a beautiful blue color, one that would make many jealous... it made you hate yourself for neglecting her.... well you knew how to make her happy, and you would do your best. You smile and walk to her side and gently pet her... she woke up and looked at you she snorted showing her anger with you,<br>\r\n<br>\r\nYou smile and give her more pettings before showing her her toy. She purred at its appearance. She seemed to be placated for the moment with that... you didn't want her to be mad again so you stayed with her, petting her, even rubbing her in her favorite spots. she purred and curled around you  letting you love on her...<br>\r\n<br>\r\nSoon you felt tired and you let yourself sleep... nap with your dragoness.</span></div></div>",
            "created":1475463060,
            "id":2218110,
            "title":"Blue"
        },
        "1123":{
            "choices":[
                "Starts to speak.",
                "Motions for you to follow it.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the dragon turns around and looks at you, your eyes lock with hers and suddenly everything goes white.<br>\r\n<br>\r\nYou wake up and find yourself staring into bright blue eyes. Surprised, you get up and look at the creature staring at you. It's a large, white dragon, with two horns on its head and a long tail with one spike on the end. Wait.. it couldn't be... Your dragon was only a bit bigger than a hamster, this one is twice your size!<br>\r\n<br>\r\nYou look around you and realize that everything in the room around you is huge - you must have shrunk! You look in front of you again and realize that the dragon is gone. A loud squeak causes you to turn around and see that your dragon is gnawing on the rubber toy that you just found. It notices you watching it and drops the toy. It then...</span></div></div>",
            "created":1295738760,
            "id":1040209,
            "title":"A small dragon."
        },
        "11233":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "She goes after it leaving you behind",
                "She grabs you and goes after it"
            ],
            "content":"<div class=\"\"><div> <span>Your dragon picks up the toy and flies back where you are standing on the shelf. She soon drops the toy right infront of you. <br>\r\n<br>\r\nOoooo, you want to play with me befor I move away for a while right<br>\r\n<br>\r\nShe nods and you try to push the toy over the edge until it finally tilts over the edge of the table and bounces off the box of books and bounces down the floor into the hallway.</span></div></div>",
            "created":1296102060,
            "id":1042868,
            "title":"Other."
        },
        "12":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what is your dragon?</span></div></span></div>",
            "created":1278301500,
            "id":911774,
            "title":"Are you a girl"
        },
        "121":{
            "author_id":"dragonopower",
            "author_name":"DragonRider",
            "choices":[
                "A dark slimy place",
                "Your room with your dragon",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>As you sit down with your dragon you notice the lonleness in it's eyes and wonder what you can do to help. And just like it reads your mind you start to see the world around you grow to 100 times there size with the light blinding you off your dragons green scales. Causing you to faint and wake up in</span></div></div>",
            "created":1282896540,
            "id":945026,
            "title":"Boy"
        },
        "1212":{
            "choices":[
                "He wants you to be his pet.",
                "He's going to eat you.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You pick yourself up off the ground and recall what happened. A flash of reflected sunlight, everything was spinning.... then black. You shake your head and look upwards, you almost fell backwards in surprise. Large reptilian eyes peered into yours with an amused look. You step backwards, a bit startled, and realize that it was your dragon - but huge! The head of the reptile was at least twice your size!<br>\r\n<br>\r\nHe is grinning a bit maliciously, which unnerves you a bit. You stagger back a bit more and put your hands up, \"Nice dragon.. please don't hurt me,\" you mutter a bit awkwardly. The dragon grunts a few times, it almost seems like he's laughing. What does he want with you?</span></div></div>",
            "created":1296183900,
            "id":1043418,
            "title":"Your room with your dragon."
        }
    },
    "info":{
        "author_id":"dragonopower",
        "author_name":"DragonRider",
        "brief_description":"Your pet dragon whants your attention more then you know.",
        "created":1278255420,
        "description":"<td align=\"left\" class=\"norm\">You have neglected your dragon and it wants revenge<br>\r\nrules<br>\r\nno killing<br>\r\nno ending the story<br>\r\nno gay stuff (to some extent)<br>\r\n<br>\r\nif you have added and whant to chang something just email me</td>",
        "id":1687771,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1475463060,
        "modified":1475463060,
        "pretty_title":"Shrunk by your dragon"
    }
}