{
    "chapters":{
        "1":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ayame (Tenchu)",
                "Ibuki",
                "Taki",
                "Kasumi (DOA)",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of, whose smelly feet do you want to focus in?</span></div></span></div>",
            "created":1310187600,
            "id":1144353,
            "title":"Who to choose"
        },
        "11":{
            "author_id":"suga227",
            "author_name":"Kalvin Camus",
            "choices":[
                "Rikimaru",
                "Tatsumaru",
                "Rin",
                "Princess Kiki",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you want to see Ayame torture with her feet?</span></div></span></div>",
            "created":1396242000,
            "id":1771491,
            "title":"Steath Assassin"
        },
        "114":{
            "author_id":"suga227",
            "author_name":"Kalvin Camus",
            "choices":[
                "Kiku likes it. (Asks her for more)",
                "Kiku hates it. (Begs her to stop)"
            ],
            "content":"<div class=\"\"><div> <span>Princess Kiku's eyes start to flutter as she begins to wake up. When she comes to, she looks around and funds herself in a small cabin. She tries to get up, but she is unable to. She has her hands tied behind her back. As she squirms around, he captor appears.<br>\r\n<br>\r\n\"I see you're awake.\" Ayame said coming out of the shadows. \"I was starting to get bored.\"<br>\r\n<br>\r\n\"Ayame, what's going on here?\" Princess Kiku asked. \"Did you kidnap me?\"<br>\r\n<br>\r\nPrincess Kiku couldn't believe her eyes. Her sister kidnapped her. Why would she do this?<br>\r\n<br>\r\n\"What are you going to do with me?\" Princess Kiku asked.<br>\r\n<br>\r\nAyame brushed some of the loose hair behind Kiku's head.<br>\r\n<br>\r\n\"Shhh, I'm not going to hurt you.\" Ayame said starting to take off her sandals. \"We're going to have some fun. You know, I've been on missions for awhile now. Mission, after mission, I haven't had a lot of time to myself. My feet have been hurting for a while now.\"<br>\r\n<br>\r\nAn odor quickly filled the room. <br>\r\n<br>\r\n\"Kiku, would you do your dear sister a favor?\" Ayame asked. \"My feet are so hot. I could use a cool sensation on them. Could you help me out? It would mean a lot.\"<br>\r\n<br>\r\n\"Um…\" Kiku managed to say before Ayame started rubbing her feet on her face.<br>\r\n<br>\r\nAyame's feet are very sweaty and smelly. Her small pudgy toes are rubbing her hair. Kiku with the lack of oxygen, couldn't help but take sniffs of her feet. <br>\r\n<br>\r\n\"How you doing down there?\" Ayame said removing her feet.<br>\r\n<br>\r\n\"Um….\" Kiku said.<br>\r\n<br>\r\nAyame wiggled her toes at Kiku.</span></div></div>",
            "created":1396242000,
            "id":1771511,
            "title":"Princess Kiki"
        },
        "12":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Chun-Li",
                "Sakura",
                "Juri",
                "Makoto",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you want to see her torture with her feet?</span></div></span></div>",
            "created":1310187600,
            "id":1144363,
            "title":"Ibuki, on the scene!"
        },
        "122":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ibuki teases Sakura with her feet",
                "Ibuki make her smell her feet",
                "Ibuki uses her foot bandages first to tease Sakura"
            ],
            "content":"<div class=\"\"><div> <span>A young girl in a seifuku was seen waking up after a long while, in an unconscious state to be more specific.<br>\r\n<br>\r\n\"Ugh... Huh? Where am I?\" The young athletic girl is sneakers asked as she noticed that she's in a dojo or sorts, where it seems to be too quiet for comfort.<br>\r\n<br>\r\n\"Oh! I see you're awake now!\" said a mysterious yet cheerful voice.<br>\r\n<br>\r\n\"Wait, who's there!\" Sakura shouted as she suddenly found out that her hands and feet are bound.<br>\r\n<br>\r\n\"Silly you, it's me, Ibuki! Don't you remember what happened after we fought?\" The ninja, oddly wearing her school shoes, asked the tied-up Sakura.<br>\r\n<br>\r\n\"Oh wait... oh no....\" Sakura said immediately as her memory started coming back to her.<br>\r\n<br>\r\n\"Yes, I think we made a bet that whoever loses the fight is going to be tortured within an hour, since we didn't seem to agree on each other the last time we fought. And look at this, I won!\" Ibuki reminded her in a happy tone.<br>\r\n<br>\r\n\"Wait... what are you going to do to me...?\" Sakura worriedly asked.<br>\r\n<br>\r\n\"Well, I was really thinking about what to do to you for a while, and then I remembered, 'I'm a ninja!', so...\" Ibuki said as she proceeded to remove her school shoes, showing her bandaged feet immediately. They fought each other in their trademark outfit, so at the time they fought in the same dojo, she was barefooted.<br>\r\n<br>\r\nAnd then, suddenly, Sakura noticed the bad smell lingering in the air. She tried to hold her nose knowing where it came from.<br>\r\n<br>\r\n\"Huh? Are you saying that my feet smell? Hey, I just work as hard as you, little Miss Converse!\" Ibuki pouted as she placed her shoe next to Sakura's head, knowing she won't be able to get away. Suddenly...</span></div></div>",
            "created":1310187600,
            "id":1144370,
            "title":"Sakura and the smell of High School"
        },
        "1222":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Ibuki stuffs her sweaty feet bandages into Sakura's mouth.  ",
                "Ibuki just tapes her mouth shut.  ",
                "Ibuki finds a dirty sock to use instead.  "
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Ibuki places here feet directly on Sakura's face!  <br>\r\n<br>\r\nSakura was disgusted, they smelled absolutely horrible!  She tried to get out of her bonds but it was useless.  \"Ugh what are you doing get those things away from me!\"  <br>\r\n<br>\r\nIbuki just laughed, \"A bet was a bet little Sakura and now you get suffer!\"  <br>\r\n<br>\r\nSakura twisted and turned trying to keep those feet away from her nose.  She had a little bit of success by breathing through her mouth but still the air permeated her face and the air around it.  <br>\r\n<br>\r\nIbuki shook her head, \"Now we can't have that, I want you to sniff with your nose.\"  <br>\r\n<br>\r\nIbuki could use her feet bandages to gag Sakura or she could just tape her mouth shut.  What should she do?  </span></div></div>",
            "created":1310274000,
            "id":1144699,
            "title":"Ibuki make her smell her feet"
        },
        "12221":{
            "choices":[
                "Ibuki continues to smother her with her stinky feet",
                "Ibuki makes sure that Sakura doesn't pass out with her stinky socks"
            ],
            "content":"<div class=\"\"><div> <span>  \"I just got a great idea!\" Ibuki exclaimed as she pulled her sweaty, stinky foot bandages off of her feet and put them in Sakura's mouth.<br>\r\n  \"They're nasty!\" Sakura thought to herself as she tasted the sweaty foot bandages while she smelled Ibuki's stinky barefeet.<br>\r\n  \"They taste good, don't they?\" Ibuki said as she continued to rub her stinky barefeet all over Sakura's face. As Sakura tasted Ibuki's sweaty foot bandages and continued to smell Ibuki's feet, her vision begins to fade.<br>\r\n<br>\r\n  What will happen to poor Sakura now?</span></div></div>",
            "created":1399093200,
            "id":1790922,
            "title":"Ibuki stuffs her sweaty feet bandages into Saku..."
        },
        "122211":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Yes she suffers the next 50 minutes horribly though.",
                "Nope she passes out... "
            ],
            "content":"<div class=\"\"><div> <span>Ibuki raises her feet for just a moment.  <br>\r\n<br>\r\n\"Ohh little girl I really hope you don't pass out because if you do I'm just going to keep my feet right on your face to smother you.\"<br>\r\n<br>\r\nSakura made gagging sounds.<br>\r\n<br>\r\n\"And you know its only been about ten minutes.  That means you'll probably die or maybe if I'm merciful just leave you with brain damage.  Hmm brain damage I bet I could damage you so much that I could make you a moronic foot slave for the rest of your life.  How does that sound pinky?\"  <br>\r\n<br>\r\nSakura moaned and writhed trying to escape the horrible smelly foot.  She tried to avoid passing out with all of her strength.  She didn't want to die!  She didn't want to become brain damaged.  Tears welled in her eyes both from fear and the hideously toxic smell coming from Ibuki's feet.  Can she avoid passing out?<br>\r\n<br>\r\n</span></div></div>",
            "created":1401944400,
            "id":1807592,
            "title":"Ibuki continues to smother her with her stinky ..."
        },
        "1222112":{
            "choices":[
                "Sakura has experienced some brain damage.",
                "Sakura isn't brain damaged, but she is acting...strangely."
            ],
            "content":"<div class=\"\"><div> <span>The cruel kunoichi giggled and kept up her sweaty assault. She was pondering on all the ways she could experiment with her foul peds. Her feet were still firmly stuck onto the school girl's face, they hugged and squeezed onto her cheeks, oozing sweat as they did. As Ibuki thought to herself she her slimy toes played on her forehead. Tapping a quick rhythm that fitted the tune she was humming contently. Every little tap splashed some sweat across the rest of Sakura's face. Then Ibuki frowned.<br>\r\n<br>\r\nSakura, distraught and afraid, was tussling her head from side to side, trying the dodge the wide, cheesy soles. Sakura was still forced to breathe with her nose, absorbing the sharp odors that were slowly bringing her to unconsciousness. But the meager display of resistance was still annoying Ibuki and she did her best to clamp down and squash her face into stinky submission. Having sweaty feet worked to the ninja's disadvantage, and her dripping arches kept slipping away as Sakura tossed and turned. Sakura was beginning to find miniscule pockets of slightly fresher air due to her dodging, but Ibuki put an end to this. <br>\r\n<br>\r\nShe simply kept her feet in place above Sakura's head. The teenager mindlessly kept tossing and turning, and ended up wiping her nose against the huge smelly soles over and over. The vinegary stench got the better of her, and to her dismay, she passed out. Ibuki laughed out loud and began squishing Sakura's soft face, keeping her dirty toes wiggling on her nose. Sakura kept sniffing, unaware of the damage the smell was doing to her. This was exactly what Ibuki wanted, she couldn't wait to see the results, and if the teenager would lose her IQ and allow her to be trained into \"a moronic foot slave\".<br>\r\n<br>\r\nForty minutes of unadulterated inhaling left Sakura pale, and she woke up. The kunoichi lifted her feet, and rested them back in a pair of worn out flip-flops. \"So my little toe-rag?\" She began with a chirp in her voice. \"How are we feeling?\"</span></div></div>",
            "created":1437886800,
            "id":2012809,
            "title":"Nope she passes out... "
        },
        "12221122":{
            "author_id":"koty1432",
            "author_name":"hazlejungle0",
            "choices":[
                "Keep licking",
                "Lets go train someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I... I love your feetttt\" Sakura states, sniffing the soles.  Kunoichi wiggles her toes and Sakura begins licking them. \"How may i serve you? \"</span></div></span></div>",
            "created":1495673580,
            "id":2324840,
            "title":"Sakura isn't brain damaged, but she is acti..."
        },
        "12223":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Put the socks inside the mouth, and cover her mouth with her foot bandages",
                "Put the socks and the foot bandages inside her mouth at the same time"
            ],
            "content":"<div class=\"\"><div> <span>Ibuki decided to making things worse for the vulnerable Street Fighter, who is trying her best not to breathe in any more of her potent ninja foot stink.<br>\r\n<br>\r\n\"You know, I'm not only a busy ninja, but I'm also a very busy student, so...\" Ibuki exclaimed as she proceeded to pick up a pair of her very stinky socks from inside her shoe.<br>\r\n<br>\r\n\"I forgot to wash my feet for a very long time, but moreso with my socks! Do you wanna know how it tastes like?\" Ibuki said to a very worried Sakura.<br>\r\n<br>\r\n\"LET ME GO!\" Sakura said as she accidentally got a whiff of her foot once again, causing her to almost lose consciousness.<br>\r\n<br>\r\n\"That's gotta mean a yes! But wait, how do I go about it...?\" Ibuki wondered as she thought....</span></div></div>",
            "created":1310274000,
            "id":1145005,
            "title":"How to use a pair of socks and foot bandages"
        },
        "122231":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Ibuki smothers her with her toes so she takes big wiffs when she inhales.",
                "Ibuki stands on her face making her sniff while being hurt by her feet!  "
            ],
            "content":"<div class=\"\"><div> <span>Ibuki stuffed her dirty sweaty socks into poor Sakura's mouth.  Sakura tasted the cheesy vinegar tasting socks and nearly threw up in her mouth.  She gave out a muffled moan of despair.  They tasted just purely awful, nothing so horrible had ever been put in her mouth.  <br>\r\n<br>\r\nIbuki quickly took her foot bandages off and used it to to tie the socks in place.  She took care to wrap some parts of it on her victim's upper lip right under her nose.  That way she would be inhaling the potent foot bandage stench too!  Of course that was nothing compared to the main course that was about to come up.  <br>\r\n<br>\r\nSakura was absolutely miserable and now when Ibuki brought her feet down on her face she was absolutely helpless.  She had to breathe through her nose and that meant inhaling the sweaty feet smell direction from the source!   She screamed out a muffled 'please' but that just caused Ibuki to laugh.  <br>\r\n<br>\r\n\"What's that?  Can't here you!\"  <br>\r\n<br>\r\nSakura thought she was going to die when she took her first sniff of those sweat drenched feet.  Each breath she took made her more light headed and nauseous.  And then Ibuki decided to make things even worse!  </span></div></div>",
            "created":1310360400,
            "id":1145812,
            "title":"Put the socks inside the mouth, and cover her m..."
        },
        "1222311":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Sakura takes a deep breath, and struggles",
                "Sakura takes a deep breath, struggles, and passes out from the stench"
            ],
            "content":"<div class=\"\"><div> <span>Ibuki felt like making Sakura's life worse than it already is, and decided to use her toes to clamp her nose, not allowing the high schooler to breathe.<br>\r\n<br>\r\nDeprived, Sakura was now desperately struggling and was finding a way to keep herself stable in this situation, but to no avail. She had to find a way to keep up.<br>\r\n<br>\r\n\"You want to breathe, Sakura? Here we go!\" Ibuki said as she immediately let go of the toes, with Sakura now fully realizing why she wanted to do that in the first place...</span></div></div>",
            "created":1310446800,
            "id":1146317,
            "title":"Toe-Trapped"
        },
        "12223112":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Ibuki waits for her to wake up and then makes her sniff again!  Heartless!  ",
                "Ibuki is sorry for what she did and asks Sakura to forgive her.  "
            ],
            "content":"<div class=\"\"><div> <span>Sakura was on the verge of passing out so when the toes squeezing her nostrils shut unclenched she immediately drew in a massive breath.  The potent foot stench immediately suffused her entire body.  The toxicity ran through Sakura like a stampede.  She began to twitch and her body went into convulsions.  Her body contorted and then went into a full Grand Mal seizure.  <br>\r\n<br>\r\nIbuki could only stare in disbelief as Sakura passed out and went into a massive seizure.  She couldn't believe her smelly feet were that powerful!  The only good thing for Sakura is that she had passed out while her brain went through the seizure.  <br>\r\n<br>\r\nIbuki watched for several minutes as Sakura's body went through its involuntary convulsions.  She could really do some permanent damage to Sakura if she wasn't careful.  Of course that could be fun...<br>\r\n<br>\r\n</span></div></div>",
            "created":1310446800,
            "id":1146554,
            "title":"Sakura takes a deep breath, struggles, and pass..."
        },
        "122231121":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "The smell wakes up Sakura, and...",
                "Ibuki calmly waited for Sakura to wake up"
            ],
            "content":"<div class=\"\"><div> <span>As Ibuki watched Sakura in her passed out state, she was in a state of disbelief and amazement.<br>\r\n<br>\r\nThe kunoichi realized after torturing Sakura with her powerful foot odor that it was definitely more powerful than her usual abilities, including her Hashinsho! Not even that move could make anyone knocked out in such a satisfying and dominating manner. Sakura was in a mess, still having the sweaty sock in her mouth and her awful smelling foot wraps covering the mouth, but still having the smell of it reach the nose. The only fortunate thing in all of this is that Sakura had a reprieve of a few moments before she can get back to her senses.<br>\r\n<br>\r\nIbuki felt she should apologize, but knew that it was a part of a deal. But for the sake of curiosity, she decided to take Sakura's shoes and socks off, and sniffed her shoe a bit. Ibuki immediately recoiled, realizing that her feet also smells as bad, thanks to her hyperactive nature and her shoes.<br>\r\n<br>\r\nBut still, Ibuki's feet can do that to Sakura?<br>\r\n<br>\r\n\"That's it! It's official: foot odor is a true skill!\"<br>\r\n<br>\r\nAnd with that point made by Ibuki, she planted her feet on Sakura, waiting for her to wake up, but not before pulling a joke on Sakura. Ibuki equipped her own stinky shoes on Sakura's feet, and will wait for how she'll react to it.</span></div></div>",
            "created":1310533200,
            "id":1147048,
            "title":"Ninja Feet: The Ultimate Weapon"
        },
        "1222311211":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Hears why she made her wear Ibuki's shoes",
                "Tries her best to get away, but Ibuki punishes her for that"
            ],
            "content":"<div class=\"\"><div> <span>Ibuki noticed that Sakura was beginning to bring her senses back after being assaulted by her foot odor, ironically, being woken up by the very same smell that knocked her out. Immediately, Sakura realizes that she was unable to survive being conscious after being exposed to so much foot stink, that she had unconsciously given up and passed out right then and there.<br>\r\n<br>\r\nThe kunoichi began to notice that Sakura was slowly opening her eyes, and once she did, all she could do is attempt to run away from her stinky fate. But to no avail, Ibuki realizes that her feet are more than just looks, and even more than just kicks. She increased her pressure on poor Sakura's face, keeping her head in place as the schoolgirl noticed that her feet are encased in a pair of shoes for some reason. But they were not the Chucks she always got used to. In fact, it was way different...<br>\r\n<br>\r\n\"Those are my shoes Sakura. How'd you like it? Cute?\" Ibuki asked cutely.<br>\r\n<br>\r\nSakura...</span></div></div>",
            "created":1312606800,
            "id":1162394,
            "title":"The smell wakes up Sakura, and..."
        },
        "12223112111":{
            "author_id":"lilipoot",
            "author_name":"lilipoot",
            "choices":[
                "no. Sakura becomes the cute pink shoes",
                "Just barely. It backfires and Ibuki,  shoes!"
            ],
            "content":"<div class=\"\"><div> <span>\"I realized if my foot stink is powerful enough to defeat you so easily, there may be some powerful techniques that aren't discovered yet. While you were napping, I did some brainstorming,and I bet you are going to love it as much as I am,\" Ibuki said with a giggle. Sakura felt a sinking feeling deep inside her, and tried to struggle free again. Unfortunately her earlier convulsions and the lack of clean air had worn her out. Her limbs felt like lead. Ibuki watched her attempts with a giggle, then pinched her nose shut with her rancid toes for a second, \"Aww, don't try that. You'll offend my feet, and then you'll have to make it up to them? Maybe with a tongue bath? Or maybe I should have you give one regardless for insulting my beautiful toes?\"<br>\r\n<br>\r\nIbuki let out her evil giggle again, and the sinking feeling worsened. Sakura had to get away from these feet. Even if just for a moment. She'd rather be anywhere than here... and that's when she noticed she actually felt like she was sinking. ibuki looked towards her legs for a moment, then giggled again, \"That's right, you'd do anything for a clean breath, wouldn't you? Deep down you can't help it. Your spirit will keep trying to get away. And where you spirit goes, you mind will follow, and where it goes your body will follow. And I've only left one escape for it. Can't you feel it in your soul? Or should I say <i>soles</i>?\"<br>\r\n<br>\r\nSakura realized what she was saying, and managed to lift her head a little in protest, but Ibuki pushed her back down. She pinched her nose between her toes again, but this time letting just enough stink polluted \"Don't be like that. They're new shoes. Why just think, yours are the only feet that have ever been in them. They're probably the ONLY place in here that doesn't smell like my feet. Doesn't that sound like a paradise?\" She watched Sakura's eyes start to roll again and gave her a little more air, \"Uh uh, no more naps for you. I just need you conscious and focused on getting away from my feet for another 30 seconds. After that you'll be merged with those shoes. Don't worry, I designed the jutsu so you'll last just as long as you would have as a human. You'll even be cute! There's a nice image of your happy face on the outside of each. Of course all your senses will be on the insoles and not the faces, but who cares! Everyone will be jealous of you until I have to dye you for missions. And of course, my feet aren't in the shoes. They're on your helpless human face. Just think, 30 seconds and my feet wont be on you, isn't that great?\"<br>\r\n<br>\r\nThe obviously terrible argument is swaying Sakura's oxygen starved, stink addled brain \"Oh man that sounds so good, a nice deep breath of air away from feet. Lemme go I need that so b-NO, I can't, then ill be stuck with the stink forever, but I'll have a minute of clear thought I can use that to escape or just enjoy oh MAN I want that fresh air...\"<br>\r\n<br>\r\nDoes Sakura's will hold out?</span></div></div>",
            "created":1324270800,
            "id":1242393,
            "title":"Hears why she made her wear Ibuki's shoes"
        },
        "122231121111":{
            "choices":[
                "Make her feet even stinkier so as to torture Sakura even more",
                "Show some mercy and only wear Sakura on special occasions"
            ],
            "content":"<div class=\"\"><div> <span>  At the last minute, Sakura's will breaks and she begins to merge with Ibuki's shoes. \"This is great! I'll be able to wear you everyday!\" Ibuki said happily.<br>\r\n  \"I lost... I'm going to be under Ibuki's stinky ninja feet for the rest of my life...,\" Sakura thought to herself as she finished merging with Ibuki's pink shoes.<br>\r\n  \"I guess I should put you on now,\" Ibuki said as she put her stinky barefeet into the shoes that Sakura merged with and her foot stink filled Sakura's nose in the insoles.<br>\r\n  \"Ugh... They stink so much...,\" Sakura thought to herself as she was inside Ibuki's pink shoes, under her stinky feet. As Sakura remained under Ibuki's stinky barefeet inside her shoes, she continued to constantly inhale the foot stink.<br>\r\n  \"I know you like the smell of my feet,\" Ibuki teased as her sweat covered Sakura's face inside the insoles, forcing her to swallow it. As Sakura knew that she would be stuck like this for as long as she lived, she did not try to resist Ibuki's big, stinky feet.<br>\r\n<br>\r\n  Now that Sakura has merged with Ibuki's shoes, Ibuki decides to...<br>\r\n  </span></div></div>",
            "created":1399006800,
            "id":1790552,
            "title":"no. Sakura becomes the cute pink shoes"
        },
        "12223112112":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "a locker full of socks, stockings, and footwear of various Street Fighter",
                "a locker full of footwear from Ibuki and the ninja village inhabitants"
            ],
            "content":"<div class=\"\"><div> <span>Sakura began to realize that not only did Ibuki guarantee her permanent foot odor, but she also tried to struggle away from the torture befallen upon her, a decision the schoolgirl would soon regret.<br>\r\n<br>\r\n\"I see you don't want to give up, eh? Well then...\" Ibuki said as she began to cross Sakura's neck with her legs, with a foot covering her face. Sakura realized that she might be experiencing a much more distressing torture, so she tried to fight back and prevent herself from being knocked out again, but to no avail. But unfortunately, her senses were not that strong as the pressure Ibuki had on her neck and the smell of her foot was too much, and proceeded to pass out, again.<br>\r\n<br>\r\nLater...<br>\r\n<br>\r\nSakura woke up once again, also realizing that she was tied up once again inside an undisclosed establishment, and standing in front of her are Ibuki (back in full kunoichi garb) and, for some reason, a locker.<br>\r\n<br>\r\n\"My my, little Sakura-chan, I see you're back awake. I realized that maybe you needed something else to prove a point to you, so instead of dealing with my feet for a while, I brought this locker. Do you know what's inside?\"<br>\r\n<br>\r\nSakura got worried hearing the answer based on the torture she just went through, as she would realize it is...</span></div></div>",
            "created":1317531600,
            "id":1199098,
            "title":"Prelude to a worse punishment"
        },
        "122231121121":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "To make her smell Chun-Li's boots first",
                "To make her smell Cammy's boots first"
            ],
            "content":"<div class=\"\"><div> <span>Ibuki opened the locker, shocking Sakura with not only the sight, but more importantly, the plethora of smells that came out of the locker, and immediately hit her like a brick!<br>\r\n<br>\r\n\"Sakura-chan, over the years of fighting, I've managed to collect a lot of footwear from the most powerful of street fighters. I always knew some day, being a ninja, that this is going to work as an effective torture device. And you, Sakura-chan, will be the first to try this out!\"<br>\r\n<br>\r\nSakura began to try and escape her perdicament, but she is still tied up and could not do anything. Ibuki remedied that by placing her toes once again on her nose, causing Sakura to experience what she now considers as the worst foot odor she has ever encountered. And this is considering Sakura wears Chucks everyday!<br>\r\n<br>\r\n\"Wait wait wait, don't you go anywhere! Unless you want to smell my feet even further and make you drink my foot sweat, would you?\" Ibuki said as Sakura thought twice now and instead tried to calm down like a good girl.<br>\r\n<br>\r\n\"Good Sakura-chan. Now, where do we begin...?\" Ibuki asked as she began to rummage through the tons of street fighter footwear inside the locker. There were so many known articles there, from Chun-Li and Cammy's boots to Rose's pumps. And they certainly did not smell like roses. Even Ibuki's school shoes and Sakura's extra pair of Chucks were there!<br>\r\n<br>\r\nIbuki decided...</span></div></div>",
            "created":1352437200,
            "id":1464675,
            "title":"A locker full of socks, stockings, and footwear..."
        },
        "1222311211211":{
            "author_id":"saicrit",
            "author_name":"saicrit",
            "choices":[
                "Sakura doesn't want, and Ibuki quickly finds a way to punish her",
                "Sakura surprisingly behaves and starts smelling on her own"
            ],
            "content":"<div class=\"\"><div> <span>Ibuki suddenly stopped her search as her gaze fell on one particularly smelly pair of footwear: Chun-Li's high, white boots! Ibuki grinned widely and took them out of the locker immediatly, simply moving them a bit closer to her head made the powerful, cheesy aroma of unwashed feet quite noticeable. <br>\r\n<br>\r\n\"Ahhhh, yes... Chun-Li's boots... I'm sure you know her, Sakura! The self-proclaimed \"strongest woman in the world\"... Well, I showed her! But to be honest, I've had my eyes on her boots for a while. Every time I saw her fighting, she was wearing them! It took me quite some time to finally get my hands on them! Hehe, thinking about it, you're really lucky because I've just claimed them yesterday! They are pretty much as fresh as they can get! Lemme try them for you...\"<br>\r\n<br>\r\nIbuki carefully moved her face a bit closer to the opening of one of the white, threatening boots. It looked as dangerous and repulsive as the entrance to hell itself, and the air that steadily streamed out of it wasn't different: Hot, humid and sharp. Ibuki took a small whiff and was instantly overwhelmed, the stench hadn't worn off in the slightest!<br>\r\n<br>\r\nIt was so bad, a sharp and cheesy smell, that Ibuki instinctively turned her head to the side and away from the stinky boot. She giggled a little as she thought how Sakura wouldn't get the chance to do escape them, no matter how hard she would try, Ibuki wouldn't let her.<br>\r\n<br>\r\nTurning to her victim again, Ibuki said \"Whew, they actually smell just as bad as when I pulled them off! That actually caught me off-guard... You know, I've heard rumors about Chun-Li having incredibly sweaty and smelly feet, even for someone who spends most of her time fighting... And yeah, yesterday, I got to see that for myself! Also, to smell it, hehe! But I should probably shut up now and finally let you experience this fine smell for yourself!\"<br>\r\n<br>\r\nIbuki couldn't help but laugh as she saw the horrified look on Sakura's face! She moved the opening of the boot slowly towards Sakura's face, enjoying every moment of terror she was inflicting on her unfortunate victim before she suddenly slammed it quickly against Sakura's face, trapping her nose and mouth completely in the dark, reeking dephs of Chun-Li's well-worn boot!<br>\r\n<br>\r\nSakura was surprised and couldn't help but take a sniff... One that she instantly regretted! Her nose only gathered tainted air, rich with the thick, heavy stench of unwashed, sweaty feet! Even though Sakura didn't take another breath right away, the smell was so strong that tears were streaming from her eyes and she started to cough violently!<br>\r\n<br>\r\nIbuki grinned sadistically, but suddenly, Sakura thrashed around wildly and her mouth came free, which she quickly used to breath in as much relatively clean air as she could. <br>\r\n<br>\r\n\"Hey! Stop that, you're trying to escape the smell again! I will make you smell those boots, if you want to, or not!\" </span></div></div>",
            "created":1352696400,
            "id":1466520,
            "title":"Chun-Li's boots"
        },
        "12223112112111":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Sakura complies and tries to bear with the boot",
                "A night in Ibuki's Locker of Justice!"
            ],
            "content":"<div class=\"\"><div> <span>Sakura clearly wants nothing to do with any form of foot odor for the rest of her life after having to go through all the torture Ibuki has put her through, and Chun Li's boots were the last thing on her mind right now.<br>\r\n<br>\r\n\"Please Ibuki... stop... it... *cough cough*\" Sakura could only cough as her senses continue to be depleted thanks to the torture.<br>\r\n<br>\r\n\"Sakura-chan, don't you like foot odor? Well.. in that case... I have some ways to convince you otherwise.\" Ibuki slyly said, seeing Sakura gaze her eyes in terror even further.<br>\r\n<br>\r\nIbuki began to open the locker full of the stinky, discarded footwear and gave Sakura an ultimatum that would otherwise put her in her place.<br>\r\n<br>\r\n\"It's like this, if you smell her boots and follow what I say, then everything will be fine for you. If you don't want to listen to me, then I have no choice than to put you in 'Ibuki's Locker of Justice!'. And what happens inside, and to your willpower, is all under your responsibility. What do you say, sniff the boots, or a night inside the locker?\"<br>\r\n<br>\r\nSakura shivered in terror even more. It was either willingly smell Chun Li's boots, or a night in the foot odor locker?</span></div></div>",
            "created":1353042000,
            "id":1469462,
            "title":"Ibuki's Ultimatum"
        },
        "122231121121112":{
            "choices":[
                "...Ibuki opens the locker after hours of training.",
                "...Ibuki forgets about Sakura and she spends another 24 hours in the locker."
            ],
            "content":"<div class=\"\"><div> <span>The stink from Chun Li's boots made Sakura buck and twitch slightly, even though her strength was dwindling. She summoned some control \"No...*cough*...I won't.\" Sakura said, she couldn't take anymore foot smell. Ibuki raised an eyebrow with a smirk, she always wanted to put someone in her locker, but no one had ever taken up on her offer. She tossed the boot back into the locker.<br>\r\n<br>\r\n\"We'll see what attitude you have after this I warned you! but I guess I have nooo choice but to sentence you to a night in my Locker of Justice!\" Ibuki ordered gleefully. Sakura cringed in fear as Ibuki pushed her further into the locker, the sharp smell made her eyes water and her nose hurt. Ibuki then stopped and pulled her out. Sakura didn't understand. Ibuki slapped her forehead \"Silly me!\" she exclaimed \" I almost forgot!\" She then stuffed Sakura's mouth with sweaty socks, and bound them to her face with foot wraps that pressed against her upper lip, forcing her to breathe in the stink wafting from them. She then got shoved into the locker. \"Have a good night!\" Ibuki wished, blowing a kiss. Ibuki closed the door and left Sakura to her fate.<br>\r\n<br>\r\nSakura could barely see, but unfortunately her sense of smell was working just fine that night. At first she just sat, limbs bound on top of the pile, she could feel the warmth the footwear emanated, and the cheesy fumes rose up and filled her lungs. Her body became limp and she took noseful after noseful of mind destroying funk for the first hour of the night. After that, she felt an anger burn inside her, she defied her aching body and began to thrash violently, so focused on her pitiful escape Sakura didn't realize she was only making her sink further into the pile until she  sank to the bottom. Only the top of her head could be seen. Socks and hose pressed against every inch of her skin, coating her in slimy sweat. Her face was in a particularly unfortunate place, Decapre's, Cammy's and Chun Li's boots surrounded her face. The opening of six boots constantly venting stench into Sakura's nose, at one point one of Rose's pumps fell and dangled on her nose.<br>\r\n<br>\r\nThis crippled any resistance she could muster, she spent the rest of the night sniffing and sniffing, unable to fall asleep. The next day... </span></div></div>",
            "created":1422680400,
            "id":1925989,
            "title":"A night in Ibuki's Locker of Justice!"
        },
        "1222311211211122":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ibuki came back, and has a new smelling puniishment for Sakura",
                "Ibuki came back with a friend"
            ],
            "content":"<div class=\"\"><div> <span>Sakura woke up the next day, thinking she would finally have the chance to breathe in some amount of fresh air. Hopeful that things are going to be different from before, Sakura screamed, \"Ibuki! It's already morning! Get me out of here!\"<br>\r\n<br>\r\nBut alas, Sakura's screams were not heard. Nothing was happening, no opening of the lockers, no cheerful voice from the stinky footed kunoichi, nothing. Instead, all she was reminded of is the fact that she can still smell all of the bad odors coming from the footwears of other Street Fighters. Sakura tried to get out forcefully, but ended up having one of Juri's foot supporters on her nose, still stinking like before. A partciularly red shoe also ended up on his face, one that seemed to be more than familiar to her...<br>\r\n<br>\r\n\"Ugh, Karin's shoe. So stinky!\"<br>\r\n<br>\r\nShe knew Karin to be her eternal rival, but for a girl like her, she never knew to be the kind to have stinky feet. But here she was, smelling the stinky shoe of Karin while all the other sources of foot odor mixed in, creating a symphony of suffering for the high schooler with spunk. Sakura was groaning, hungry, and suffering all at the same time, with only foot odor being cosumed by Sakura's poor nose.<br>\r\n<br>\r\nThe next day...</span></div></div>",
            "created":1437714000,
            "id":2012088,
            "title":"24 Hours of Suffering"
        },
        "12223112112111222":{
            "choices":[
                "\"Let's go! It's feeding time!\"",
                "\"Get out here, I need a footrub!\""
            ],
            "content":"<div class=\"\"><div> <span>Sakura sat on the pile, slowly squirming. Her stomach ached painfully now and the toxic foot fumes were making it difficult for her to even think. She had managed to shake Karin's funky shoe from her face, along with brushing Juri's sweat soaked wraps off too. However, the taste of Ibuki's dirty socks were still imprinted on her tongue. She had been sniffing the same vile foot wraps gagging her for almost two days now! At the very least she was warm. Ibuki had kept the central heating in this room up to make sure the locker was humid and stuffy at all times. Just as the once optimistic schoolgirl felt as if she was going crazy she heard something from another room. A loud conversation filled with laughter.<br>\r\n<br>\r\nOne of the voices was Ibuki, the other was harder to tell in Sakura's state, delirious from inhaling vinegary stench pervading through every garment stuck to her. The other voice was high pitched and often laughing. Sakura didn't care who it was or what they were doing there. Ibuki was finally going to let her out! The conversation became audible as Ibuki entered with the guest that sounded like a young girl. <br>\r\n\"Ew...what is the smell in here?\"<br>\r\n\"That? It's the locker I've been telling you about! She's still in there! I bet the locker's made her pretty weak too.\"<br>\r\n\"Good...I can't wait to get started. I've been sockless and working out for a week now.\"<br>\r\n\"I thought I was the only one who recognized the power of feet. I didn't take you for the type...\"<br>\r\n\"Oh yes. And to get Sakura as a footslave...it's too good...\"<br>\r\n\"Just remember our bet! If you can't break her then you'll have to...\" <br>\r\n<br>\r\nIbuki whispered something and the girl gasped, agreeing to the terms. Sakura heard two sets of footsteps coming towards the locker, she could hear an audible \"squelch\" with each step, they were clearly extremely sweaty! Sakura cringed in fear as the door opened to reveal Ibuki and her rival Karin! She smirked with a raised eyebrow and laughed long and hard at the pathetic Sakura before demanding...</span></div></div>",
            "created":1437800400,
            "id":2012402,
            "title":"Ibuki came back with a friend"
        },
        "122231121121112222":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "...rubs Karin's feet, also forced to smell them",
                "...rubs both Karin and Ibuki's feet and see who can break Sakura first"
            ],
            "content":"<div class=\"\"><div> <span>Karin was very satisfied at what she's seeing, her eternal rival being destroyed by foot odor. Sakura was on all fours, trying to recover from the multitudes of foot odor that assaulted her entire system. Suddenly, Karin kicked her in the stomach.<br>\r\n<br>\r\n\"Hey, Sakura! I see you're trying to recover, but I need something from you right now!\"<br>\r\n<br>\r\nKarin then took off her other pair of funky shoes, taking note that she is not wearing any socks. Suddenly, her foot odor hit Sakura very hard, stunned from the smell coming out of both her feet and footwear. Sakura tried to run away but Karin trapped her with a neck lock using her legs.<br>\r\n<br>\r\n\"Sakura, your feet always stunk from wearing your Chucks, and it's always pissed me off when you took off your shoes. A girl like you making me smell your feet afar was an insult, and now you're going to find out what happens when you smell my feet. But first, give me a foot rub!\"<br>\r\n<br>\r\nSakura was hesitant in giving her a foot rub, but Ibuki, looking at both Sakura and Karin, was here looking, and Sakura certainly did not want to go through the kunoichi's foot odor any longer. Sakura grabbed Karin's foot and...</span></div></div>",
            "created":1437973200,
            "id":2013289,
            "title":"Time for a Rub!"
        },
        "1222311211211122221":{
            "choices":[
                "...go for a run in Cammy's boots!\"",
                "...show you how to make her obey!\""
            ],
            "content":"<div class=\"\"><div> <span>As Sakura reluctantly held one of Karin's slippery soles the rival removed her legs from around Sakura's neck. She sat proudly in front of her whilst Sakura held the hot, stinking foot. She shuddered as the sharp smell wavered into her nostrils. Karin laughed at this reaction. \"Don't you pass out! You've got a job to do!\" Sakura cringed and sighed, and began to circle her thumbs around Karin's thick sole that oozed sweat. Her fingers were doing their best to press and squeeze, but Sakura's was weak from her time in Ibuki's funky prison, and Karin's cheesy odor was sapping the last remnants of her strength, meaning her massage was feeble and became nothing more than brushing her fingers across the greasy arches.<br>\r\n<br>\r\nKarin rolled her eyes at this pathetic display and sneered. \"What is that? Are you trying to massage me or not? Maybe this will perk you up!\" The snickering rival then poked her slimy toes into her cheeks, before clamping them around her nose. Sakura mindlessly sniffed, sucking the intense stink into her nose. A cheesy funk pouring through her system. The smell of her ripe feet didn't \"perk her up\", quite the opposite. Sakura wobbled and her hands fell to her sides. Karin grunted in disgust, but at the same time watching her crumble beneath her stinky toes. <br>\r\n<br>\r\nSakura collapsed on her back, and Karin rested her feet on her face, dragging her heels across Sakura's helpless face. She turned to Ibuki and beamed with pride. \"See? Breaking her is easy! Looks like I win. She's all mine!\" Ibuki shook her head. \"No, she's just weak from my locker, once all she can think of is smelly feet, that's when she'll be broken. Now I'm going to...</span></div></div>",
            "created":1438059600,
            "id":2013681,
            "title":"The worst foot rub ever."
        },
        "12223112112111222211":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Sakura is forced to smell the empowered boots",
                "Sakura smells the overwhelming feet of Ibuki"
            ],
            "content":"<div class=\"\"><div> <span>Sakura remained knocked out after her not-so-enjoyable experience rubbing the stinky feet of her entitled rival, which Karin feels was more than enough for her to win the bet against Ibuki.<br>\r\n<br>\r\n\"See Karin, I'll show you what happens when you deal with the mistress of foot odor, and believe me, Sakura's going to want to pass out after what I'll do to her next\", Ibuki said, while grabbing a pair of boots coming from a military specialist.<br>\r\n<br>\r\n\"Are those... Cammy's?\", Karin asked.<br>\r\n<br>\r\n\"Yes! And I'm going to run and jump on trees for an hour wearing them... sockless.\" Ibuki replied as she began to put on her already-stinky feet inside a well dampened pair of boots belonging to the British combatant.<br>\r\n<br>\r\nAn hour after she went through her run with her boots on...</span></div></div>",
            "created":1460178000,
            "id":2129921,
            "title":"...go for a run in Cammy's boots!\""
        },
        "125":{
            "author_id":"lombardi",
            "author_name":"herrrr",
            "choices":[
                "Ken",
                "Sean",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Ibuki making the guys of Street Fighter smell her feet?</span></div></span></div>",
            "created":1310274000,
            "id":1144656,
            "title":"Other"
        },
        "1252":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Individually",
                "Tandem (with Makoto, Elena, etc)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you want Sean to be tortured?</span></div></span></div>",
            "created":1310360400,
            "id":1145213,
            "title":"Sean's Torture?"
        },
        "12522":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Yes!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Want to see Ibuki team with Makoto to torture Sean?</span></div></span></div>",
            "created":1311051600,
            "id":1150543,
            "title":"Makoto?"
        },
        "1253":{
            "author_id":"joman3000",
            "author_name":"Joman",
            "choices":[
                "Karin ",
                "C.Viper",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More girl characters</span></div></span></div>",
            "created":1484576640,
            "id":2264488,
            "title":"Other"
        },
        "13":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Mitsurugi",
                "Yun Seong",
                "Cassandra",
                "Talim",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will the Soul Caliber ninja torture with her stinky feet and footwear?</span></div></span></div>",
            "created":1310274000,
            "id":1145013,
            "title":"Taki's Torturee"
        },
        "132":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Taki made him smell her feet",
                "Taki made him smell her tabi socks",
                "Taki made him smell her sandals"
            ],
            "content":"<div class=\"\"><div> <span>A familiar sight, Taki and Yun Seong competing against each other, fighting for the sake of winning. It was a battle to find out who will win and, most of all, survive. It was a battle next to a pirate ship, with no one in sight.<br>\r\n<br>\r\nIn the midst of the battle between the two competitive weapon masters, Taki was able to capitalize by kicking Yun Seong surprisingly to the face, her sandal-clad feet meeting the cheek. But as the kick took effect, he suddenly got tripped into a pile of ropes and Yun Seong got tangled. And unfortunately for Yun Seong, he cannot do anything about it and could not let himself go.<br>\r\n<br>\r\n\"So, that means I win?\" Taki asked.<br>\r\n<br>\r\n\"Wait, let me go! This is not how I want the fight to end!\" Yun Seong replied.<br>\r\n<br>\r\n\"But it's done, you cannot let yourself go, and I can do whatever I want to you!\" Taki suggested as she noticed her feet have been quite busy for a long time now. It was perfect for this occasion as...</span></div></div>",
            "created":1311051600,
            "id":1150553,
            "title":"Yun Seong's Loss"
        },
        "135":{
            "choices":[
                "Sophitia uses this opportunity to break free and return the favor",
                "Ivy attacks Taki, frees Sophitia and they torture Taki with their smelly feet to"
            ],
            "content":"<div class=\"\"><div> <span>  \"Gotcha!\" Taki exclaimed as she cornered Sophitia in a dark alley.<br>\r\n  \"What do you want with me?!\" Sophitia exclaimed.<br>\r\n  \"You're going to smell my stinky feet and you're going to like it,\" Taki said as she took out her ropes and tied Sophitia to the ground. After that, she taped Sophitia's mouth shut so that she was forced to inhale her foot odor. Taki then took her stinky ninja shoes off and pt them right up to Sophitia's nose.<br>\r\n  \"They stink!\" Sophitia thought to herself as she was forced to inhale the putrid odor of Taki's ninja shoes.<br>\r\n  \"If you think these stink, wait until you smell my feet!\" Taki exclaimed as she took her shoes away from Sophitia's nose slowly so that she would breathe through her nose, thinking that she was getting fresh air when in reality, she was still inhaling the odor of Taki's ninja shoes.<br>\r\n  \"Mmmppphhh!!!\" Sophitia screamed, but shewas muffled by the tape gags.<br>\r\n  \"Now for the real fun to begin,\" Taki said as she put her ninja shoes to the side and planted her stinky barefeet on Sophitia's face, forcing her to inhale an even more putrid stench than the ninja shoes.<br>\r\n  \"No... I'm beginning to lose consciousness...,\" Sophitia thought to herself as her vision began to blur.<br>\r\n  \"Oh dear, I can't allow my little footslave to lose consciousness,\" Taki said as she noticed what was happening. Knowing that she didn't want Sophitia to lose consciousness, Taki allows Sophitia to breathe a little bit of fresh air. However, something happens...</span></div></div>",
            "created":1399266000,
            "id":1792298,
            "title":"Other"
        },
        "15":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ayane (DOA)",
                "Misao Makimachi (Rurouni Kenshin)",
                "Kunoichi (Samurai Warriors)",
                "Rin (Tenchu)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else would you want to see?</span></div></span></div>",
            "created":1310187600,
            "id":1144357,
            "title":"More?"
        },
        "152":{
            "author_id":"kingscastle1",
            "author_name":"KingsSideCastle",
            "choices":[
                "Yahiko",
                "Aoshi",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Misao? Ok...who does the energetic Oniwabanshū Ninja torture with her feet?</span></div></span></div>",
            "created":1310187600,
            "id":1144451,
            "title":"Misao Makimachi (Rurouni Kenshin)"
        },
        "1521":{
            "author_id":"kingscastle1",
            "author_name":"KingsSideCastle",
            "choices":[
                "She makes him smell her footwear!",
                "She makes him smell her feet!",
                "He tries to make a break for it! "
            ],
            "content":"<div class=\"\"><div> <span>“Ah that was a great workout.” Misao said to herself. She had just finished her ninja training for the day and was ready to take a nice cool bath when she ran into Yahiko who was looking for her.<br>\r\n<br>\r\n“Hey pipsqueak what’s up?” She asked him.<br>\r\n<br>\r\n“I want a rematch!” He demanded.<br>\r\n<br>\r\nMisao laughed. When he had first come to visit her in Kyoto, the two of them had sparred and she had beaten him. Ever since then the young swordsman had been after her for a rematch. Probably the easiest thing to do would have been to give him one but it was so much more fun to tease him.<br>\r\n<br>\r\nActing like fighting him was the most boring thing in the world, the ninja girl feigned a yawn. “Not interested.”<br>\r\n<br>\r\n“C’mon Misao. You got lucky last time.” He complained<br>\r\n<br>\r\n“Forget it shorty! I have better things to do than waste my time playfighting with kids.”<br>\r\n<br>\r\nThat annoyed him even more because he had taken their match seriously. Truth be told so had she but she wasn’t about to let him know that. “You’re not that much older then me.” He argued upset.<br>\r\n<br>\r\n“But I am infinitely more skilled and way cooler,” She said. “Now run along and go find someone your own age to play with runt.”<br>\r\n<br>\r\n“Flat-chested weasel girl” he grumbled.<br>\r\n<br>\r\n“What was that?” Misao snapped.<br>\r\n<br>\r\nYahiko wiped his brow under her smoldering stare. “Nothing.”<br>\r\n<br>\r\nThe ninja girl glared at Yahiko but suddenly she thought of all the training she had been doing and thought of a good way to get back at him. Lightening up she flashed the boy a smile. “Fine, I’ll fight you but I want you to suffer a penalty if you lose.” Misao told him.<br>\r\n<br>\r\n“What do you have in mind?”<br>\r\n<br>\r\n“Loser has to do whatever the winner wants for the day!” She said.<br>\r\n<br>\r\n“Oh it is so on!” Yahiko agreed.<br>\r\n<br>\r\nThe two of them walked into the woods for their battle. When they were both ready Yahiko charged Misao with his wooden sword. Moving like lightning, the ninja girl dodged spinning to the right and extended her foot tripping the boy and causing him to stumble. As Yahiko recovered pushing himself off the ground, Misao jumped on his back wrapping her sexy legs around his neck. Twisting her body, she threw him to the side banging him on the ground and keeping him locked in a scissor hold. Smiling, she asked Yahiko if he gave up. Yahiko refused and continued to struggle but he couldn’t break free. The ninja girls legs were just too strong. Giggling Misao tightened her hold literally putting pressure on him to concede defeat. Eventually the pressure proved too much and the swordsman tapped out.<br>\r\n<br>\r\n“I-I give.” The boy wheezed.<br>\r\n<br>\r\nMisao smirked and loosened her legs on his neck. “I’m sorry. I didn’t get that” She laughed. She gives him a playful squeeze with her legs causing him to gasp before she allows him to answer.<br>\r\n<br>\r\n“I give up.”<br>\r\n<br>\r\nThe Kunoichi grinned. “Thought so,” she releases Yahiko and begins to take off her footwear exposing her cute bare feet as the boy catches her breath. She wiggled her toes slightly as the cool air touched her feet. It felt good to have her footwear off. The combination of tabi socks, ninja sandals and foot wraps really made her feet hot and sweaty which was perfect for what she had in mind. Looking at Yahiko, she grinned. <i>Flat chested weasel girl  huh? It’s really going to be very fun humiliating him</i> she thought to herself. Picking up her footwear, she walks in front of the swordsman and tilts his chin up. “Ready to pay up pipsqueak?” She asked.<br>\r\n<br>\r\nWhat happen now?<br>\r\n</span></div></div>",
            "created":1310274000,
            "id":1144559,
            "title":"Misao's Revenge"
        },
        "15211":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "My sandals, socks, or foot wraps",
                "All three at the same time!"
            ],
            "content":"<div class=\"\"><div> <span>\"So, Yahiko, you just proved to me of how weak you are. So it's time for me to face an opponent that's more fitting to your fighting skill!\" Misao exclaimed, holding with her the three components of what makes up her footwear.<br>\r\n<br>\r\n\"Please... Misao...\" Yahiko said, but before he knew it, Misao's foot was next to his nose, and he got a surprising whiff of it.<br>\r\n<br>\r\n\"Ugh! Misao! You're not only flat chested, but your feet stink too!\" Yahiko responded.<br>\r\n<br>\r\n\"What! That's it! No more Ms. Nice Ninja!\" Misao told the already insulting little kid.<br>\r\n<br>\r\n\"You see, I'm going to give you a choice. I can let you smell my sandals, my socks, or my stinking foot wraps before I give you the main course! So, what do you say, scared little punk?\" Misao said.<br>\r\n<br>\r\nYahiko attempted to run away, but Misao immediately jumped onto his body, causing him to be unable to move.<br>\r\n<br>\r\nMisao said, \"Fine, I'll make the choice you little brat. I'll choose...\"</span></div></div>",
            "created":1310274000,
            "id":1145002,
            "title":"Appetizers Before the Main Course"
        },
        "152112":{
            "author_id":"kingscastle1",
            "author_name":"KingsSideCastle",
            "choices":[
                "Misao keeps him trapped like that until he becomes submissive to her.",
                "She teases him as she tortures him with her foot odor,"
            ],
            "content":"<div class=\"\"><div> <span>“Yeah right! Like that would ever happen!” Yahiko said pushing her footwear away from his face. <br>\r\n<br>\r\n“Oh yes it will!” Misao said and before he realized what was happening the kunoichi had tackled him and was pressing her smelly socks into his face. <br>\r\n<br>\r\nYahiko immediately tried to push her off of him but he was still weak from being beaten by Misao earlier. The girl was able to straddle him and pin him under her body holding the sock firmly against his nose.<br>\r\n<br>\r\nYahiko groaned frustrated. “C’mon Misao…let me up!”<br>\r\n<br>\r\nMisao smiled “Uh uh…not until I make you appreciate the scent of my feet” she teased rubbing her sweaty sock against him.<br>\r\n<br>\r\nYahiko wrinkled his nose from the cheesy odor and wriggled around twisting his head back and forth trying to get away  from her socks. He bounced around trying to buck the Oniwabanshu ninja off of him. Unfortunately he was unable to do it. Like a trained rider, the kunoichi was able to stay on him following his face around with her socks and forcing him to breathe in her foot smell.<br>\r\n<br>\r\nPretty soon Misao’s foot odor was making the boy really dizzy and it became even harder for him to fight back. Sensing the boy was weakening, Misao was quickly able to reach over and grab one of her sandals while keeping Yahiko pinned. Pushing it into his face on top of the sock, she quickly began tying it there with one of her foot bandages. When she was finished, Yahiko had a dirty sock and ninja sandal tied firmly to his nose. <br>\r\n<br>\r\nThe boy immediately felt the smell he was breathing in intensify and began to wriggle around even harder. “Mmmphh!!!!”<br>\r\n<br>\r\nKeeping his arms pinned under her knees so he couldn’t remove her footwear from his face, the female ninja giggled as she patted Yahiko’s cheek playfully “Hee hee…Aren’t you lucky Yahiko?…you get to play the role of my foot today all dressed up in my sock, sandal and bandages”<br>\r\n<br>\r\nWhat happens now?<br>\r\n</span></div></div>",
            "created":1311051600,
            "id":1150568,
            "title":"All Three At Once!"
        },
        "1521122":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Yahiko's suffering, but won't become Misao's foot",
                "Yahiko officially becomes Misao's foot"
            ],
            "content":"<div class=\"\"><div> <span>Yahiko cannot believe where he's at: beneath a kunoichi, whose various foot odors from her sandals, footwraps, and socks were toying around with the boy's willpower, destroying any sense of pride he had just by virtue of stench.<br>\r\n<br>\r\n\"Okay Yahiko, I want you to know your place, and from now on, I want you to take the role of my third foot! You understand?\" Misao playfully asked Yahiko.<br>\r\n<br>\r\n\"MMMMPPPPHHHHHHHH!!!\" Yahiko replied, wanting to get away from this torture.<br>\r\n<br>\r\n\"Okay, since you're still not used to this, I will make sure you're exposed to my foot odor constantly until you surrender to my feet and accept your fate as my foot!\" Misao claimed as she began to cover the already suffering Yahiko's face with both her feet. As if the articles of footwear covering his face was not enough, her feet became his face's new neighbors wanting to crash the stink-filled party going on in Yahiko's nose. And almost immediately, the smell became much worse for the son of a samurai, wanting to give up as soon as possible. But he knew he cannot afford to give up now, lest he loses all sense of honor he has as a man.<br>\r\n<br>\r\n30 minutes have passed...</span></div></div>",
            "created":1317531600,
            "id":1199101,
            "title":"Fully Footed"
        },
        "15211222":{
            "author_id":"kingscastle1",
            "author_name":"KingsSideCastle",
            "choices":[
                "Massage her feet",
                "Worship her feet"
            ],
            "content":"<div class=\"\"><div> <span>Yahiko struggled for as long as he could but eventually the smell of her Misao’s feet overwhelmed him. Every breath he took felt like a kicked in the stomach as he was forced to breathe in the smell of her dirty socks and sandals. His lungs felt like they were on fire. It felt like he was drowning in foot odor. Tears were streaming down his cheeks. He couldn’t even think clearly anymore. All he knew was that he wanted it to stop.<br>\r\n<br>\r\n“Please…No more,” he begged.<br>\r\n<br>\r\nMisao smiled. Just looking at the young swordsman she could tell that her feet had broken him. He was too weak to even struggle anymore. Still the kunoichi couldn’t  resist twisting the knife just a little further. “I want to hear you accept your role in life,” She told him rubbing her soles against his cheeks teasing. “Tell me you’re my foot!”<br>\r\n<br>\r\nYahiko blushed. His rival really took humiliation to another level but he just couldn’t smell her footwear anymore. “I’m your foot Misao.” He groaned.<br>\r\n<br>\r\n“Louder!” She ordered slapping him playfully with her foot.<br>\r\n<br>\r\n“I’M YOUR FOOT MISAO!!”<br>\r\n<br>\r\nMisao burst into laughter. She couldn’t believe she actually got him to say that.  It took her awhile to compose herself before giving him the next order. Taking a mock serious tone she addressed him by his new position.  “Ok foot. If you want to get out of my sandals and socks, you’ll have to behave yourself. No more running and you have to exactly what I say.”<br>\r\n<br>\r\nYahiko nodded his head vigorously eager for this to stop.<br>\r\n<br>\r\nGiggling, Misao reached over and untied the sandals from the swordsman’s face ending the boy’s torture.<br>\r\n<br>\r\nYahiko wasted no time taking in the fresh air he had been deprived of gulping it down again and again.<br>\r\n<br>\r\nThe kunoichi chuckled as she watched the boy gasp for air on the floor panting heavily.<br>\r\n<br>\r\nIt was obvious the kid didn’t have any fight left in him. She could probably get him to do anything she wanted now.  Thinking to herself she decided to test that out wondering how far she would be able to take it.<br>\r\n<br>\r\nWhat does she make the boy do first?<br>\r\n</span></div></div>",
            "created":1368162000,
            "id":1587526,
            "title":"Yahiko officially becomes Misao's foot"
        },
        "155":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ninjas from Naruto",
                "Ninjas from other anime",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else do you want to see besides the previous ones?</span></div></span></div>",
            "created":1310187600,
            "id":1144360,
            "title":"Even more!"
        },
        "1551":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Sakura Haruno",
                "Tsunade",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Naruto ninja do you want to go with?</span></div></span></div>",
            "created":1312952400,
            "id":1165769,
            "title":"Ninjas from Naruto"
        },
        "15513":{
            "author_id":"destinydueler",
            "author_name":"destinydueler",
            "choices":[
                "Yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it Konan?</span></div></span></div>",
            "created":1376197200,
            "id":1644067,
            "title":"someone else"
        },
        "155131":{
            "author_id":"tonicco",
            "author_name":"tonicco",
            "choices":[
                "She makes him lick her foot",
                "She tramples him"
            ],
            "content":"<div class=\"\"><div> <span>When Pain entered the room, Konan had already been waiting, seated gracefully with her coat off. <br>\r\n\"Remove your clothes and then my shoes.\" She ordered at once, and the leader of Akatsuki obeyed his lover´s command, undressing himself and kneeling at Konan´s feet. He slowly removes her sandals, followed by her socks. Before he could notice, the female flipped him onto his back with her foot, arising from her seat and pressing her sole against his chest. </span></div></div>",
            "created":1499121540,
            "id":2346653,
            "title":"Yes"
        },
        "1551312":{
            "author_id":"bloo2",
            "author_name":"RJ",
            "choices":[
                "She Tramples you",
                "She rewards you"
            ],
            "content":"<div class=\"\"><div> <span>Konan trampled up and down pains body<br>\r\nslamming her foot on his face<br>\r\ninhale. <br>\r\nexcuse me my lady. Konans head turned<br>\r\nwhen she seen seen who it was her expression changed  to one of relief <br>\r\nhello there my handsome slaveboy what news do you have. The boy in question bowed. <br>\r\nI wish to speak of some serious matters but I would also like to please you my lady you can trample my body while I deliver my report. konan smiled<br>\r\nvery well slave boy. Konan indicated for pain to go and for the boy in question to complete me over. <br>\r\nBefore I deliver my reoort my lady. he kneeled on the ground and started kissing konans feet the tops of her feet and toes. <br>\r\nshe smiled. and looked down at you. <br>\r\n</span></div></div>",
            "created":1544792460,
            "id":2589009,
            "title":"She tramples him"
        },
        "155132":{
            "author_id":"destinydueler",
            "author_name":"destinydueler",
            "choices":[
                "Yup I'll take her",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kurenai</span></div></span></div>",
            "created":1376197200,
            "id":1644069,
            "title":"no"
        },
        "1551322":{
            "author_id":"destinydueler",
            "author_name":"destinydueler",
            "choices":[
                "Howd you know",
                "no your wrong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I know it was definitley Tayuya</span></div></span></div>",
            "created":1376197200,
            "id":1644070,
            "title":"no"
        },
        "15513222":{
            "author_id":"destinydueler",
            "author_name":"destinydueler",
            "choices":[
                "Bingo",
                "wrong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Duh my bad it was definitley TenTen</span></div></span></div>",
            "created":1376197200,
            "id":1644072,
            "title":"no your wrong"
        },
        "155132222":{
            "author_id":"pepewowa1",
            "author_name":"Gabbe",
            "choices":[
                "Yes it sure was!",
                "...No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was Hinata right?</span></div></span></div>",
            "created":1385528400,
            "id":1699647,
            "title":"wrong"
        },
        "1551322221":{
            "author_id":"jpmc09",
            "author_name":"Jpmc09",
            "choices":[
                "me",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now that you've chosen one kunoichi, chose too slave</span></div></span></div>",
            "created":1499922600,
            "id":2352340,
            "title":"Yes it sure was!"
        },
        "15513222211":{
            "author_id":"jpmc09",
            "author_name":"Jpmc09",
            "choices":[
                "let's start!!",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you are training in forest as usual, you were make exercicies, play shurikens, traning your jutsu anymore. When you down the tree and you get hurt, and shout.<br>\r\nHinata was close by you, and listen your shout, and started follow the where is the shout.<br>\r\nWhen she arrived in local, she looks you rubing your leg because you down the tree.<br>\r\nYou look for her and say '' Plz, do you help me, I was training in the tree and I smash in the floor and hurt my leg''. She say '' Yes, but you have to do one thing to me after, ok ?'' You said '' ok ''.<br>\r\nHer starterd make Symbols with your hands and talk '' health justu'' You suffer the hot in your leg, and the hurt was going away, and more hotter more good you felt, when the effect the jutsu passed, she said '' Now you make the thing that promise, neh ?'' you said '' Yes, now I be very good, I make everything for you''. She listen it and smile scary and said '' Everything ?'' you \" Yes''.<br>\r\nwhen her say: \" What you maybe to shrunken ?''<br>\r\nYou: \" I shrunken ? hm,don't stay scary to me,But I stayed to much happy, I have the fanatasy sexual or I dream to one women shrunken me, and make me to your foot slave to my life. I so very embarrassed after to talk it''.<br>\r\nShe smile and say: \" Really? \"<br>\r\nYou: \" Yes, sorry for that, well I return to my training''<br>\r\nShe :'' No, stay, I want have certainty, because I thinking in make you my little foot slave\"<br>\r\nYou look the white eyes the Hinata and talk\" Let's do this now, come on shrunken me!!\".<br>\r\nshe look for you for smile and say \" finally, someone to worship my smelly, feet ''.<br>\r\nShe starter to make symbols again to your hand and say \" Shrunken jutsu\". <br>\r\nYou start a shrunken very fast, in seconds ever is huge, you look for <br>\r\nhinata, and she look for you very happy, and you so very happy too, she said:'' come to my house''. And pick you, and put you in between your boobs.<br>\r\nArriving to house the Hinata she retire you to your boobs and question:</span></div></div>",
            "created":1499926320,
            "id":2352362,
            "title":"me"
        },
        "15513222212":{
            "author_id":"bloo2",
            "author_name":"RJ",
            "choices":[
                "Kushina",
                "Tsunade "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is kushina and Tsunade</span></div></span></div>",
            "created":1544777220,
            "id":2588985,
            "title":"more"
        },
        "1552":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Kagero",
                "Zakuro",
                "More Ninjascroll characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about some Kunoichis from the classic Ninja anime, Ninja Scroll?</span></div></span></div>",
            "created":1310187600,
            "id":1144413,
            "title":"What about these Kunoichis?"
        },
        "15521":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Choice A (Male)",
                "Choice B (Female)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she decide to torture?</span></div></span></div>",
            "created":1310274000,
            "id":1144993,
            "title":"Kagero's Choices"
        },
        "15523":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Teenage Mutant Ninja Turtles",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about this instead?</span></div></span></div>",
            "created":1432270800,
            "id":1981533,
            "title":"More Ninjascroll characters"
        },
        "1553":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Male or Female Ninja Feet Torture",
                "Both Female / Male Ninja Feet Tandem",
                "Female and Male Ninja Feet Torture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to see a ninja torture scene with the choices below?</span></div></span></div>",
            "created":1310360400,
            "id":1145214,
            "title":"Gender Specific"
        },
        "15531":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Male or Female Ninja?</span></div></span></div>",
            "created":1310360400,
            "id":1145215,
            "title":"Male or Female Ninja Feet Torture"
        },
        "155311":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to see Naruto torture anyone?</span></div></span></div>",
            "created":1310446800,
            "id":1146315,
            "title":"Naruto?"
        },
        "1553111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "It's Kiba",
                "It's a different Ninja"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Kiba?</span></div></span></div>",
            "created":1311051600,
            "id":1150588,
            "title":"Who does Naruto Dominate?"
        },
        "15531112":{
            "author_id":"narutofan",
            "author_name":"Naruto",
            "choices":[
                "Sasuke",
                "Another guy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Naruto torture Sasuke?</span></div></span></div>",
            "created":1312347600,
            "id":1160843,
            "title":"Sasuke?"
        },
        "155311121":{
            "author_id":"narutofan",
            "author_name":"Naruto",
            "choices":[
                "Naruto Imprisons Sasuke Inside His Smelly Sandal and Uses Him As An Insole     ",
                "Naruto Forces The Little Sasuke To Sniff His Giant Barefeet"
            ],
            "content":"<div class=\"\"><div> <span>It wasn't long before Sasuke awakened and found his legs and arms binded to a chair. He was someone's house. But who's? Last thing he remembered was training alone in a room in one of Orochimaru's hideout. After that he blacked out.<br>\r\n<br>\r\n\"Sasuke, you're awake!\" Naruto showed up. \"You! How did you find me? Where am I?!\" Sasuke asked as he struggled on the chair. \"We had intel about Orochimaru's hideout. We found you, and Sakura-chan managed to hit you from behind. After that, they left you to me, so I can interrogate you.\" Naruto explained.<br>\r\n<br>\r\n\"About what?\" the binded Sasuke asked. \"Well, we have to know where Orochimaru and Kabuto are. So, yeah. That's what I want to know, Sasuke.\" Naruto explained, as he sat on a bed, facing Sasuke. \"And how will you make me tell you? Threaten to kill me? You wouldn't dare.\" Sasuke said. \"No, I won't kill you. I'll torture you.\" Naruto grinned evilly. \"Nothing will make me say anything to you.\" Sasuke firmly stated.<br>\r\n<br>\r\n\"We'll see about that.\" Naruto said as he began to take off his black sandles. \"What are you doing?\" Sasuke asked in confusion. As Naruto took off his sandles, the room was filled with a disgusting odor of foot sweat. Naruto wiggled his toes, as he put one foot near Sasuke's face. \"Doesn't it smell bad Sasuke?\" Naruto asked as he pinched Sasuke's nose using his toes, and began to wiggle them. Without any warning, Naruto suddenly began to press his foot on Sasuke's face, pressing harder and harder.<br>\r\n<br>\r\n\"I haven't washed my feet in a loooong time. I always train, and I'm sure it smells really bad. Just tell me where Orochimaru is, and I'll stop.\" Naruto said calmly. When Sasuke didn't say anything, Naruto began to press even harder. Naruto's toes were at Sasuke's forehead, while his arch was all over Sasuke's nose and mouth. Sasuke could taste the disgusting sweat as Naruto pressed his foot on his face. After a few minutes, Naruto finally removed his foot. He had pressed so far, he laughed as he saw a footprint covering Sasuke's whole face.<br>\r\n<br>\r\n\"Still not talking, huh? Well in that case, I'll use a special jutsu on you.\" Naruto threatened. \"I still won't talk.\" Sasuke said, still coughing from the smell of Naruto's foot sweat. Naruto performed a few handsigns, then casted the jutsu. \"Shrinking Jutsu!\" Naruto said as he pointed the handsign at Sasuke.<br>\r\n<br>\r\nWithin seconds, Sasuke shrank to mere 2 inches tall in height, which freed him from his bounded state. Naruto giggled as he saw Sasuke's tiny form on the chair. \"You sure you won't talk?\" Naruto asked, as he quickly grabbed the tiny Uchiha in his fist. \"I won't tell you anything!\" the tiny Sasuke said in a squeaky voice.</span></div></div>",
            "created":1312347600,
            "id":1160850,
            "title":"Interrogation"
        },
        "1553112":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Yep",
                "Nope, it's another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Hinata?</span></div></span></div>",
            "created":1310446800,
            "id":1146432,
            "title":"Who's the (Un)lucky Lady?"
        },
        "15531121":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"....Keep smelling my bare feet!\"",
                "\"...Prepare to smell the insole of my sandals!\""
            ],
            "content":"<div class=\"\"><div> <span>Hinata landed on her feet, after hitting a wooden dummy with her kunai in mid air. She then attacked another wooden dummy with her trademark Eight Trigrams Sixty-Four Palms strike, completely obliterating it. Hinata then kneeled to the ground, tired. She had been training for the past few hours in order to get stronger. Hinata had hoped that if she got stronger Naruto would notice her and pay attention to her. Hinata daydreamed about a date with Naruto for a few seconds, when suddenly, a pair of legs came down on her shoulders and threw her to the ground. The legs then formed into a figure-four headscissor choking the Hyuuga.  Hinata coughed and gasped, as she looked up at her assailant. Her eyes widen in surprise when she saw who her attacker was. “Na-Naruto?”Hinata gasped, squirming and trying to get out of the grip of Naruto’s powerful legs.<br>\r\n<br>\r\nNaruto gave her his signature smile that turned her face red everytime she saw it. Though this time, her face as red from the headscissor hold he had her in. “Yep, Hinata it’s me. Don’t worry Hinata, I’m not going to hurt you, all you need to do is go to sleep and everything will be fine,” the blonde ninja said nonchanlantly, as though he saw nothing wrong with choking out one of his friends.<br>\r\n<br>\r\nHinata looked at Naruto in sheer awe. She couldn’t belevie he was choking her out like this and was acting like he was just saying hello to her. Hinata withstood the hold for many minutes, blacking in and out at times but still barely conscious.<br>\r\n<br>\r\n“Wow Hinata, you have more endurance then I thought. I’m impressed!” Naruto complimented, still smiling at the Hyuuga heir. Hinata would normally melt when she got a compliment from Naruto but she couldn’t  even smile at him from the pain and lack of her thanks to Naruto’s powerful legs.<br>\r\n <br>\r\n“Naruto…” Hinata whispered, before finally blacking out from the hold. <br>\r\n<br>\r\nWhen the poor girl came too, her head was still in pain and her vision blurry. Hinata decided to go back home and forget about the incident, but when she tried to move, she realized that her hands and feet were tied. When her vision returned, she saw she was in a room that only had a chair. She then saw someone come into the room, and identified him as Naruto. She saw him carrying his sandals and noticed that he himself was barefoot.<br>\r\n<br>\r\nNaruto walked towards Hinata, frowning. “I’m sorry I had to knock you out like that Hinata, but it was the only way,” Naruto said, genuine sincerity in his voice. Hinata looked at him confused and Naruto noticed her confusion by then saying. “I know you had a crush on me and I was wondering…I wanted to know how much you love me and I remember reading one of Jiraiya’s novels where the boy wanted to prove how much a girl liked my by making her smell his feet. I wanted see if it worked.”<br>\r\n<br>\r\nHinata can only look at Naruto in shock. She knew Naruto was a bit eccentric but she couldn’t believe he could do something like this. The<br>\r\n<br>\r\nNaruto then smiled and put his bare feet on Hinata’s face. The scent hit Hinata like a freight train. His feet smelled sweaty and cheesy and was perhaps the strongest thing Hianta smelled in her life. The smell actually made the young Hyuuga cough.<br>\r\n<br>\r\nNaruto laughed and said, “Well, Hinata let’s begin!  This is only a sample of what you’re going to go through. Now, I want you to….”<br>\r\n</span></div></div>",
            "created":1311051600,
            "id":1150198,
            "title":"The Smell of Love!"
        },
        "155311211":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Ordered Hinata to smell the inside of his sandals",
                "Pinched Hinata's nose with his toes, then releases"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was shocked as to what is happening to her right now: her crush, Naruto, covering her entire face with his awful-smelling feet. As Hinata continued to inhale most of the bad stench coming out of the pair, Naruto could not help but be amazed as to what is happening. It's as if Hinata was fighting her first battle: Hinata's nose versus Naruto's feet. And it was a battle that Hinata was already losing right now. Who knew that the Hyuga heiress would end up in this position?<br>\r\n<br>\r\n\"Okay Hinata, smell my feet!\" Naruto said as Hinata cannot help but comply because of the position she's in.<br>\r\n<br>\r\nShe was becoming more and more dizzy the more she inhaled most of the stench, it's like she was being slowly beaten up by the stench of his foot odor, something she'd never see coming. But still, Hinata tried very hard not to pass out.<br>\r\n<br>\r\nAfter 15 minutes have passed, Naruto then...</span></div></div>",
            "created":1311051600,
            "id":1150541,
            "title":"Hinata's First Battle"
        },
        "1553112111":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Tried not to breathe, but to no avail thanks to what Naruto will do",
                "Sniffs!"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was trying her hardest not to pass out, but Naruto's foot odor was just too much for the kunoichi to handle. Eventually, she was beginning to lose consciousness and was about to get knocked out, but Naruto immediately let go of his foot before that can happen. Naruto knows now that his feet is very powerful indeed, but...<br>\r\n<br>\r\n\"Hey Hinata, how'd you like to smell my sandals instead?\" Naruto asked.<br>\r\n<br>\r\nHinata widened her eyes at the thought as she began to attempt to run away, but Naruto stopped her from her tracks and immediately put the opening of his black sandal on her nose. Hinata...</span></div></div>",
            "created":1312606800,
            "id":1162397,
            "title":"Ordered Hinata to smell the inside of his sandals"
        },
        "15531121111":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Naruto merely waits until Hinata sniffs",
                "Naruto wipes her hair and face with his foot while the sandals are on her nose"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was never in a position like this before, where a sandal coming from his lifelong crush, the stinkiest sandals she ever encountered at that, is covering her mouth and nose, waiting for her to sniff it voluntarily as proof that she loves Naruto.<br>\r\n<br>\r\nBut as a ninja, she does not want to smell something this overwhelming for his satisfaction.<br>\r\n<br>\r\n\"Naruto.... please...\" she pleaded for mercy from the stench training.<br>\r\n<br>\r\n\"No Hinata, I want you to smell them for me, but if you won't, I think I have a way to make you smell them...\" Naruto warned Hinata as he had something in mind for the kunoichi...</span></div></div>",
            "created":1317531600,
            "id":1199102,
            "title":"Delaying the Inevitable"
        },
        "1553112112":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Continue to make Hinata smell his feet",
                "See if she would kiss/lick his feet"
            ],
            "content":"<div class=\"\"><div> <span>Naruto smirked as he watched Hinata sniff at his feet. Although he was doing this to see if Hinata liked him, he had to admit that he was enjoying some of the power that he held over Hinata. He playfully wiggled her toes on her face as she twisted her face into disgusted reactions. Naruto then rubbed his feet on her face a few more minutes before deciding to tease the poor Hyuuga girl a little more.  “Well, Hinata I can tell you don’t like the smell. So I think I’ll take it easy on your nose and plug it for ya,” the blonde ninja teased and then using his dexterous toes, he grabbed the blue haired ninja’s nose before the poor girl could react to it<br>\r\n<br>\r\nHinata, surprised at the sudden loss of air, started to cough a bit. She then started to breathe out of her mouth, but heavily since Naruto was still smothering her with his nasty smelling feet. Hinata still couldn’t believe this was actually happening. Yet here she was, on the ground and smelling Naruto’s bare feet and at his mercy. A few minutes passed of heavy breathing and absorbing the sweat of Naruto’s worked feet. A few minutes later, Naruto let go of her nose. Instinctively, Hinata  took a huge breath of air through her nose, forgetting about her situation for the moment and was greeted with a horrid smell that hit Hinata like a brick. “Ugghhh…so smelly…” The Hyuuga heir moaned.<br>\r\n<br>\r\nNaruto couldn’t help but giggle at Hinata’s misery and took the time to repeat the process a few more times. Eventually, Naruto started to wonder if it was enough that Hinata smelled his feet to prove she loved him or if he wanted more “proof” After all, he was enjoying his dominance of Hinata and was interested in taking it further.<br>\r\n<br>\r\nIn the end, Naruto decided to…<br>\r\n</span></div></div>",
            "created":1317531600,
            "id":1199737,
            "title":"Narutoes to Hinata's nose!"
        },
        "15531121121":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "In a locker full of his stinky sandals",
                "In a gym, with Naruto wearing special shoes to enhance foot odor"
            ],
            "content":"<div class=\"\"><div> <span>Having been convinced that Hinata will do anything for Naruto, the nine-tailed fox decided to take it a step further and see how Hinata will hold out. The Hyuuga female was slowly getting drained as her nose is becoming more and more accustomed to the smell emanating from Naruto's overworked feet, as tears were showing. But the young ninja is trying and not falter, as proof that she would do anything for her crush.<br>\r\n<br>\r\n\"Hinata, you can do this. His feet stinks, but your will is stronger!\" the kunoichi thought.<br>\r\n<br>\r\nNaruto, having gotten used to her face as a footstool, decided to take the stench punishment further.<br>\r\n<br>\r\n\"Hinata-chan, I'm glad you are getting used to my feet, but it's time to take it even further!\" he exclaimed as he knocked out Hinata by clamping both of his feet to her face, depriving her of clean air and making her immediately pass out to his feet. Hinata could not do anything as her strength was diminished by the stink for the past few minutes, and Naruto was smiling all the way, knowing of what Hinata will have to go through next.<br>\r\n<br>\r\nHinata later wakes up...</span></div></div>",
            "created":1352437200,
            "id":1464672,
            "title":"Hinata's will, tested further"
        },
        "155312":{
            "author_id":"melroser76",
            "author_name":"melroser76",
            "choices":[
                "Yes!",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to see Sakura torture anyone?</span></div></span></div>",
            "created":1310619600,
            "id":1147949,
            "title":"Sakura?"
        },
        "1553121":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Sasuke",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the title says, who do you want Sakura to torture?</span></div></span></div>",
            "created":1317531600,
            "id":1199649,
            "title":"So...who do you want to be tortured"
        },
        "15531212":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "Naruto?",
                "Someone else?  "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else?  </span></div></span></div>",
            "created":1401944400,
            "id":1807605,
            "title":"Someone Else"
        },
        "155312121":{
            "author_id":"sauurman",
            "author_name":"Carl",
            "choices":[
                "They are 18+",
                "Start of the Naruto show (12)  "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Naruto should definitely be under Sakura's sexy feet!  Now the question is how old are they?  </span></div></span></div>",
            "created":1422421200,
            "id":1924830,
            "title":"Naruto?"
        },
        "1553121212":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "sakura forces Naruto to date her feet ",
                "sakura uses her feet to publicly humiliate Naruto "
            ],
            "content":"<div class=\"\"><div> <span>team 7 had just finished practice for the day, sasuke had left with out saying a word so sakura decided to head home. Naruto was shouting after. he was all ways doing this, following her around like a lost puppy, and begging for dates, he was soo fucking pathetic!<br>\r\n <br>\r\nNaruto caute up to her and asked<br>\r\nhay Sakura will you please go on a date with me?\"<br>\r\n<br>\r\nsakura punched him in the face knocking him to the ground. <br>\r\n\"never your the most pathetic loser in the whole village!\"<br>\r\n<br>\r\nNaruto then crawled over to her and started begging<br>\r\nplease sakura, please ill do any thing!\"<br>\r\n<br>\r\nshe then kicked him it the face and said---<br>\r\n<br>\r\n(A) your so fucking pathetic, you don't deserve to date me! hell you barely deserve to date my feet!<br>\r\n<br>\r\nor<br>\r\n<br>\r\n(B) you need to learn your place, you pathetic worm!<br>\r\n</span></div></div>",
            "created":1460178000,
            "id":2130279,
            "title":"Naruto's downfall  "
        },
        "15531212121":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Naruto asked out sakura's feet  ",
                "even Naruto has enough self respect not to sink that low! "
            ],
            "content":"<div class=\"\"><div> <span>sakura scrawled at Naruto's pathetic form ling on the ground as blood dripped from his face <br>\r\n  \"your so fucking pathetic, you don't deserve to date me! hell you barely deserve to date my feet!\" <br>\r\n<br>\r\nNaruto just groaned in pain as she said this. sakura then smirked  <br>\r\n\"in fact that that gives me an idea, Naruto i have reconsidered.\"<br>\r\n<br>\r\nNaruto jumped up in excitement his face still covered in blood<br>\r\n\"really sakura, you really mean it!?\"<br>\r\n<br>\r\nshe smirked at him again<br>\r\n\"not so fast Naruto, as said earlier you barely deserve to date my feet, but you  barely passing is still passing; so i will permit you to date my feet.\"<br>\r\n <br>\r\na confused look came over Naruto's face as he asked<br>\r\n\"what do you mean sakura?\"<br>\r\n<br>\r\nsakura giggled<br>\r\n\"what i mean Naruto, is that you will not be dating me, just my feet, you see Naruto you barely qualifie as boyfriend materiel for my feet let alone me. you have to ask them out by saying sakura feet i know that your too good for a pathetic loser like me, but would you pleas go on a date with me?/ in front of all these pepole \" <br>\r\ngesturing to crowed of on lookers that was gathering around the two of them<br>\r\n\"also if any one ask if your on a date with me, you have to correct them, telling them that your too pathetic to actually date me, only my feet!\"<br>\r\n<br>\r\nNaruto blushed<br>\r\n\"i don't know sakura that's really emberisng.\"<br>\r\n<br>\r\nsakura crossed her arms<br>\r\n\"this is the closest that a pathetic loser like your self could ever hope to get close to one of your betters like my self.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1469941200,
            "id":2189389,
            "title":"sakura forces Naruto to date her feet "
        },
        "155312121211":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "skip to his date with sakura's feet.",
                "get a new outfit, dress to impress sakura's feet"
            ],
            "content":"<div class=\"\"><div> <span>Naruto knew that sakura was right, this was the only way that anyone would ever be willing to be in a relationship with such a pathetic loser such as him self;<br>\r\nand so he stood in full view of the gathering crowd of on lookers, who flocked from all parts of the village to see his humiliation unfold before there very eyes Naruto then got down on his hands and knees, bowing at sakura's feet<br>\r\n\"sakura's feet i know that your far too good for a pathetic loser like me, but would you pleas go on a date with me?\"<br>\r\n<br>\r\nas the words left Naruto's mouth the crowd of on lookers began to all point and laugh at how much of a pathetic loser he was being, <br>\r\nsakura looked down at Naruto's prostrated form, and smirked at him<br>\r\n\"all right Naruto meet my feet at 7 o'clock tonight in front of my house\"<br>\r\n<br>\r\nshe then used a summoning scroll to retrieve a white collar with a large pink bell, and tossed it to him. <br>\r\n\"and from now on you are to where this at all times, am clear\"   <br>\r\n<br>\r\nwhile Naruto was still prostrated on the dirty street, he took the collar that sakura had tossed to him, and with tears of pure joy he put it around his neck. all the while thinking to him self<br>\r\n\"<i>i cant believe it, sakura actually gave me a gift, ill cherish it always!</i>\"<br>\r\n<br>\r\nshe watched as Naruto put on his new collar with a smirk<br>\r\n\"good!\"<br>\r\n<br>\r\nand with that sakura turned and walked away.<br>\r\njust as Naruto was about to get up, a set of twin little girls smiling happily ran up, and kicked him in his face one after the other.<br>\r\n\"haha, your a funny foot boy\"  \"your that girls pet\"<br>\r\n<br>\r\nthen the twin girls skipped back to there smiling mother who hugged the two of them <br>\r\n\"oh girls, i'm so incredibly proud you right now, helping teach that vile dirty demon his place in life!\"<br>\r\n<br>\r\nthe two little girls beamed up at there mothers strong praise. <br>\r\ncrowd of on lookers watched the show of dominance the girls had just preformed in front of them, this made the the lot of them bake out into yet another fit of uncontrollable laughter at poor Naruto's expense; but after 10 minutes or  the crowd eventually dispersed. this left Naruto finally free to drag him self up off the dirty street before heading back to his apartment so he could get reedy for his date with sakura's feet.</span></div></div>",
            "created":1499132040,
            "id":2346761,
            "title":"Naruto asked out sakura's feet  "
        },
        "1553121212112":{
            "author_id":"theinsult",
            "author_name":"Pig",
            "choices":[
                "likes he's made an effort for her feet",
                "she is angry he spent money on himself not her feet",
                "makes him lie down in the mud ruining the tux he just bought"
            ],
            "content":"<div class=\"\"><div> <span>Naruto knew he was a little bitch with a limp dick and the only way he had a chance with his stinky goddesses was to impress them with this date. <br>\r\n<br>\r\nNaruto took all his food money want went to the most expensive clothing store.<br>\r\n<br>\r\n\"I need a tux for my date\" Naruto said<br>\r\n<br>\r\n\"A loser like you\" the woman said no one had any respect for Naruto that no one bothered using customer service on the little cunt.<br>\r\n<br>\r\n\"..yeah I finally found someone\" Naruto said he had to be respectful because all these people let him breath there air when he's an unworthy little bitch boy<br>\r\n<br>\r\n\"Who!? If she's new I'll warn her you're the village bitch who even Konohamaru wedgies everyday\"<br>\r\n<br>\r\n\"It's Sakura's.....feet.\" You admit you didn't want to but...she might remind Konohamaru you haven't had a wedgie in a while.<br>\r\n<br>\r\nshe laughed her ass off \"Your such a loser but I think her feet are too good for a cunt like you\"<br>\r\n<br>\r\n\"Y-yeah I know\" you admit \"but I gotta try\"<br>\r\n<br>\r\n\"Fine this one cost 200 but you have to pay 400 because of the cunt tax\" she said everything was double the price for you cos of cunt tax loser tax small penis tax etc <br>\r\n<br>\r\n\"oh..ok whatever it takes\" Naruto hands over all his food money<br>\r\n<br>\r\n\"I'm keeping the change\" she shoves it in your hands \"you can't use the changing room I don't want you naked in my shop now get out!<br>\r\n<br>\r\n\"t-thank you\" naruto says and leaves before she beats him up<br>\r\n<br>\r\n***<br>\r\n<br>\r\nNaruto is in his new expensive tux and knocks on Sakura's door for his date with her angelic feet. The first date in his life. <br>\r\n<br>\r\nSakura opens her door and see's Naruto and..</span></div></div>",
            "created":1566388980,
            "id":2705587,
            "title":"get a new outfit, dress to impress sakura's..."
        },
        "155312122":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Shinobi males",
                "Kunoichi females "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is sakura going to be Torturing Shinobi males or Kunoichi females <br>\r\n</span></div></span></div>",
            "created":1470020220,
            "id":2189391,
            "title":"Someone else?  "
        },
        "1553121221":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Kiba Inuzuka",
                "next Shinobi male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>but who is sakura going to be Torturing with her feet?</span></div></span></div>",
            "created":1495676940,
            "id":2324869,
            "title":"Shinobi males"
        },
        "15531212212":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Kakashi Hatake",
                "next Shinobi male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about her own sensei Kakashi Hatake?<br>\r\n</span></div></span></div>",
            "created":1495677180,
            "id":2324871,
            "title":"next Shinobi male"
        },
        "1553121222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "ino",
                "next Kunoichi female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>but who is it going to be?</span></div></span></div>",
            "created":1495676760,
            "id":2324866,
            "title":"Kunoichi females "
        },
        "15531212222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "tsunade ",
                "next Kunoichi female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about lady tsunade </span></div></span></div>",
            "created":1495677300,
            "id":2324874,
            "title":"next Kunoichi female"
        },
        "1553122":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "the little firecracker known as hanabi hyuga",
                "no next girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about the little firecracker known as hanabi hyuga?</span></div></span></div>",
            "created":1460178000,
            "id":2130285,
            "title":"More"
        },
        "15531222":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Kin Tsuchi",
                "no next girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> how about Kin Tsuchi </span></div></span></div>",
            "created":1460523600,
            "id":2132544,
            "title":"no next girl"
        },
        "155312221":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "naruto",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kin Tsuchi, a kunoichi from Otogakure and a member of Team Dosu, her story is going to take place during  the Chūnin Exams.<br>\r\n<br>\r\nnow who is going to be her victim</span></div></span></div>",
            "created":1460523600,
            "id":2132547,
            "title":"Kin Tsuchi"
        },
        "155312222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Tayuya",
                "somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Tayuya?</span></div></span></div>",
            "created":1508968200,
            "id":2406453,
            "title":"no next girl"
        }
    },
    "info":{
        "author_id":"melroser76",
        "author_name":"melroser76",
        "brief_description":"Smelly feet from ninjas in video games, manga, and anime are all here!",
        "created":1310258640,
        "description":"<td align=\"left\" class=\"norm\">This interactive is open to everyone and is focused on ninjas and smelly feet from anime, video games, manga, and others. Please watch how you contribute as it will be quality-controlled. Otherwise, please have fun in contributing and reading!<br>\r\n<br>\r\nPS - Thanks to KingsSideCastle for the inspiration to come back!</td>",
        "id":1792156,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1566388980,
        "modified":1566388980,
        "pretty_title":"Smelly Ninja / Kunoichi Feet"
    }
}