{
    "chapters":{
        "1":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Play Darts",
                "Play Pool",
                "Play Poker",
                "Play Beer Pong",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Hi, I'm Walt, this is my ongoing story of how by buddies set me up for all the pranks I pulled on them over the years. What they say is true, paybacks are a bitch. <br>\r\n<br>\r\nMy buddies Mike, Jimmy, Butch and Steve all decided to plan a weekend away and of course I was all ready for a guys weekend. <br>\r\n<br>\r\nI was the last to be picked up, and we headed to to Mikes cabin in the mountains. There were plans of playing cards, fishing, Hiking and lots and lots of beer drinking. These guys sure could pound them down. <br>\r\n<br>\r\nI looked over my shoulder into the cargo area of the SUV and saw quite a few cases of beer. <br>\r\n<br>\r\nIt took a few hours to get to the cabin. <br>\r\n<br>\r\nOnce there as all carried all out stuff inside and dropped our belongings onto the floor. None of us, besides Mike was ever to the Cabin. It was left to him by his rich uncle in his will. Mike commented there were 2 bedrooms, each with two beds so we could pick out who wanted to stay with who. <br>\r\n<br>\r\nI'm no math wiz but there were 5 of us and 4 beds. I guessed someone was sleeping on the couch. Oh well I guess we'll figure that out later. <br>\r\n<br>\r\nInside the cabin was a huge fireplace, pool table, dart board, poker table among other things too various to mention. We were all in awe. <br>\r\n<br>\r\n\"Snap\" came the sound of the first beer being opened. \"Cheers\" Mike announced as he chugged his first one down. <br>\r\n<br>\r\n\"So lets get this party started, what shall we do first?\" Jimmy asked</span></div></div>",
            "created":1202446800,
            "id":495814,
            "title":"Plans for the weekend"
        },
        "11":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "1 Foot tall",
                "6 inches Tall",
                "3 inches tall",
                "1 inch tall",
                "you decide"
            ],
            "content":"<div class=\"\"><div> <span>The guys decide to play Darts<br>\r\n<br>\r\nWith 5 guys Mike, Steve, Jimmy and Butch play first. <br>\r\n<br>\r\nYou say you'll get in on the second game and take the lowest scoring guys spot. Then you head to the bar at the back of the room and check out all the stuff there. There are bottles of whisky everyhere. Every kind of drink imaginable.<br>\r\n<br>\r\nIn the freezer you spy a bottle you think is vodka. There is no lable so you open it and take a whiff. \"MMMMM\" you think. Smells like Cherries and you decide to have a shot. <br>\r\n<br>\r\nWith the other guys attention on their dart game, you do not one, but two shots. It tastes just like Sweet Cherry Vodka. But then as it hits your stomach you feel a warm sensation running thru your veins. <br>\r\n<br>\r\nYou dont feel so well. The room starts spinning. You can't even concentrate long enough to yell to the guys for help before you black out. <br>\r\n<br>\r\nWhen you awaken you find everything is HUGE. Well not really because you have actually Shrunk. <br>\r\n<br>\r\nYou are now only.......<br>\r\n<br>\r\n</span></div></div>",
            "created":1202619600,
            "id":524009,
            "title":"Play Darts"
        },
        "113":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Steve",
                "Mike & Butch",
                "Jimmy"
            ],
            "content":"<div class=\"\"><div> <span>When you finally come too you can hear the muffled and distorted voices of your buddies on the other side of the bar. No one has noticed that you were no longer standing behind the bar. When you look up you see the ceiling above you. But why is it sooooo far above you. You then look over to your left and see the shelf behind the bar. It too rises high above. <br>\r\n<br>\r\nYou have shrunk to 3 inches tall.<br>\r\n<br>\r\nGetting to your feet you walk out from behind the bar area. There before you the whole room spreads long and wide. You can see your buddies at the far end by the dartboard. You have to get help. As you run across the floor to the guys. They have turned on the radio and they are talking amongst one another. <br>\r\n<br>\r\nBeing careful not to get stepped on your try to jump up and down to get the attention of one of them. <br>\r\n<br>\r\nRunning back and forth below them you are finally seen by….<br>\r\n</span></div></div>",
            "created":1209099600,
            "id":524018,
            "title":"3 inches tall"
        },
        "1132":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Keeping you a secret from the other two guys",
                "Tying you up and putting you somewhere",
                "Something far worse"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! IT worked!\" Butch booms as he locks eyes on you. Mike throws his last dart before turning around. Butch gets on his knees to have a look at you, whilst mike bends down on his haunches, accentuating his package through his shorts. The two men tower over you, both holding beers which stink right through your nostrils.<br>\r\n<br>\r\n\"Hey, I got an idea\" Butch says he wraps he hand around you. He decides to torture you by</span></div></div>",
            "created":1209963600,
            "id":528560,
            "title":"Mike & Butch"
        },
        "11322":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Between Butch's pecs as a necklace",
                "On the back of Mike's shorts, as a fart is building"
            ],
            "content":"<div class=\"\"><div> <span>\"Mike, go get my fishing gear\" butch says with a smile. Mike pounds off, way up above, the other two guys continue chatting and playing darts, unaware of your predicament.<br>\r\n<br>\r\nAs Mike returns, Butch pulls out a fishing line from his toolbox. You try to struggle as the wire is looped around you, but it is no use. A length of string is cut as butch holds you up, dangling before his face. The world becomes a blur as you are swung around. You feel the string being tied around something, but your eyes and head are still spinning. As you gain your vision, you feel yourself resting on a firm platform, between two huge mounds. Looking around, you realise that you are dangling</span></div></div>",
            "created":1209963600,
            "id":528564,
            "title":"Tying you up and putting you somewhere"
        },
        "113221":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Glue my mouth shut with something",
                "keep me on the necklace but put me in a small glass vial"
            ],
            "content":"<div class=\"\"><div> <span>The fishing line was looped and wound around me. My body was folded down, my hands brought down to my feet. They were bound together and looped in a knot. Struggling only made them tighter. The other lengths of line were out to either side of me. The then took a tiny clamp and fastened the two ends together. <br>\r\n<br>\r\nButch then lifted the line and me and put me over his head. When he let go I fell with a jolt, stopping as I pounded against his chest. He turned to Mike. <br>\r\n<br>\r\n“So does he make a good necklace? “ he asked. <br>\r\n<br>\r\nMike looked, then said with a sideways smile. “Not really, but he was never very good at much else anyway.” <br>\r\n<br>\r\nI could smell the strong scent of Butch’s body. That manly testosterone driven scent. <br>\r\n<br>\r\n“Lets see how long it takes for the other guys to notice.” He says as he buttons up his shirt to just below my dangling body. <br>\r\n<br>\r\nI began to yell. “GET ME OFF OF HERE !”<br>\r\n<br>\r\n“Damn” Mike said. “If he keeps yelling hes gonna blow it.”<br>\r\n<br>\r\nThey decide to…..<br>\r\n</span></div></div>",
            "created":1210050000,
            "id":528835,
            "title":"Between Butch's pecs as a necklace"
        },
        "1132211":{
            "choices":[
                "Butch and Mike further belittle Walt",
                "Butch not wanting to wear the necklace anymore puts Walt in his BOoty"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:2.0;\">       Mike tells Butch \"go get the glue from the junk drawer\" Butch gets it and excessively forces a big gob of it in Walt's mouth,\"good\" Mike says. At first you choke and try flailing your limbs but then you try to keep cool and breathe through your nose. \"Thaaats a goood little tooy\" sings Butch. Butch has BIG pecs, almost like Boobs. He's also very Beefy and Puerto Rican. He also wanted to take his bIG beefy ass dancing to the club nearby. \"Hey lets go clubbing with him as my bling\" Mike agrees and they go after getting ready. Butch and Mike spray themselves with scented deoderant and dont care that it gets in Walt's eyes. Walt cant rub his eyes so the pain stays longer as he yelps and bounces. They throw on some shirts that reveal their chests and they roll to the club.When they get there they begin to dance with some females. Butch gets realy close to one female as he dances with her and Walt is helplessly and embarassingly squeezed between Butch's Pecs and Her Big Boobs. Butch is such a player and Walt is such a joke</span></span></div></div>",
            "created":1322456400,
            "id":1231215,
            "title":"Glue my mouth shut with something"
        },
        "11322111":{
            "author_id":"grangerdanger",
            "author_name":"Nibby",
            "choices":[
                "Butch takes Walt off and puts him in his beer"
            ],
            "content":"<div class=\"\"><div> <span>After Butch finishes dancing with the girl he gives her a cheeky spank on the ass and walks over to Mike as Walt pounds against his pecs. \"Mmmppphhhhh\" groans Walt trying desperately to talk but the super glue had his mouth sealed shut tight.<br>\r\n<br>\r\n\"Nice going man!\" Mike yelled against the pulsing music of the club as he high fived Butch. \"Don't thank me, thank my new bling!\" Butch replied, looking down at Walt and bounced his pecs and squeezed Walt in between the grove of his sculpted chest.<br>\r\n<br>\r\n\"Mmmmmpphh!\" Moaned Walt. \"Shut it runt!\" Yelled Butch down to his chest, as he buttoned up his shirt to drown Walt out and patted the lump that was Walt.<br>\r\n'Thump! Thump!' <br>\r\n<br>\r\nWalt really couldn't believe this, it was starting to get hot and sweaty now that he had buttoned his shirt, he must have started dancing again as Walt swayed from side to side and pounded against Butch's pecs. Eventually it stopped and Butch was all hot and sweaty, leaving Walt to forcefully swallow mouthfuls of his salty sweat. \"Some friends they are\" He thought.</span></div></div>",
            "created":1404882000,
            "id":1825070,
            "title":"Butch and Mike further belittle Walt"
        },
        "113221111":{
            "author_id":"grangerdanger",
            "author_name":"Nibby",
            "choices":[
                "Walt wakes up, hung on a nail in the house",
                "The others are still up, waiting to torture Wt"
            ],
            "content":"<div class=\"\"><div> <span>Butch took a deep breath and sighed which caused Walt to slowly rise and fall against his God-like pecs underneath his tight shirt. \"This is the life eh Mike?\" He said burping after taking a swig from his beer bottle, slouched down on one of the club's sofas. \"Be much better if we torture the runt a bit more, wouldn't you say Butch?\" \"I agree\", Butch replied, showing his pearly whites as he grinned. <br>\r\n<br>\r\nMeanwhile, the heat underneath the shirt and being pressed against Butch's pecs was getting unbearable until Butch unbuttoned it, took the chain off his neck and yanked Walt off. \"What shall we do with the runt?\" Butch asked Mike while tossing him from hand to hand. Walt wanted to scream but the glue still kept his lips locked in place. <br>\r\n<br>\r\n\"Hmmmmm, I dare you to put him in your beer!\" yelled Mike as the pumps of the music in the club became louder. Walt became very frightened, why would his friends want to kill him? There was a bit of a pause before Butch replied, \"Okay but I'm not going to swallow him, the other guys will be pissed if they don't get turns with the runt\" \"Oh, fine.\", Mike replied, looking a little disappointed. \"Doesn't mean I can't chew him,  he's set to pliable remember?\" Butch replied, and winked.<br>\r\n<br>\r\nBefore Walt could do anything he was tossed into Butch beer bottle, he would have screamed if his lips had not have been sealed shut with the glue. He landed in the acidic beer with a splash and bobbed up and down, the bubbles slightly tingled and burned his skin but it was not too painful, on the brighter side the beer dissolved the glue and his mouth was free. But this cheerful thought soon vanished as the bottle was turned downwards, the opening leading right into Butch's gaping mouth. <br>\r\n<br>\r\n\"Chug, chug, chug!\" Shouted Mike as Butch downed his beer like a real man does. Walt tried to fight against the current but he fell into his mouth and was swished around with the beer until it was swallowed and he was left to slosh about on Butch's warm tongue. \"Mmmmm\" Butch groaned, teasing Walt with his tongue.<br>\r\n<br>\r\n\"Shit, it's 3am, we better head back before the guys realise the runt is gone!\", Yelled Mike. \"Let's go then\", said Butch as he rubbed his hands together, and they walked down the street to the house as Walt was rocked to sleep by Butch's rough yet carressing tongue</span></div></div>",
            "created":1404882000,
            "id":1825079,
            "title":"Butch takes Walt off and puts him in his beer"
        },
        "11322112":{
            "choices":[
                "Butch has to shit",
                "He continues to dance grinding you between his massive cheeks"
            ],
            "content":"<div class=\"\"><div> <span>As mike and butch are dancing, Butches massive flabby muscle ass starts to sweat.  Through the pounding of the music and the lights mike looks over and comments to butch \"Man dude you reek, lol throw some deodoant on or something!\" Butch hears Mikes comment and smirks with an idea. His massive hand rips his chain off as he bends towards mike and begins to shake his ass. \"SMELL THAT SHIT WOOO!\" he yells to Mike Mockingly shaking his ass to the douchey frat song. \"Dude you fucking reek seriously\" Butches hand moves you to the back of his ass and his other hand slips the waistband open waving your chain over the smelly opening. Your pleads are drown out by the music and Mikes chuckle as he sees his friend dangle you over his raunchy sweaty ass. \"I DARE YOU BRO!! FIVE BUCKS SAYS YOU DON\"T! Mike yells through the music as you fly above the reeking ass. \"PLEASE NOO NOT IN THERE NO BUTCH! C\"MON MAN!\" The two jocks chuckle as butch drops you in his sweaty ass and lets the waist band snap shut. Butch shakes his ass tauntingly at Mike. \"FIVE BUCKS BRO!\" Mike just slapps butches ass with a grin. \"We got the little shit good this time!\" As you begin to reform from being slapped by mikes hand, Butch stops shaking his ass long enough to let out a raunchy 5 second long fart.</span></div></div>",
            "created":1403067600,
            "id":1814211,
            "title":"Butch's ass gets dirty, Make walt take care of it"
        },
        "1133":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Make me smaller and put me in a slipper",
                "Turn me into another object",
                "stick me in a hamster ball. "
            ],
            "content":"<div class=\"\"><div> <span>In your attempts to dodge the feet of the guys you end up getting kicked by Jimmy’s loafer. He looks down having felt something hit his shoe. <br>\r\n<br>\r\n“Well well well, what have we here?” he says and leans down and plucks you up of the floor. He then deposits you into his empty beer cup. <br>\r\n<br>\r\n“Jimmy you have to help me ! I don’t know what happened.” <br>\r\n<br>\r\nMy pleas were ignored. <br>\r\n<br>\r\n“Hey guys look what I found” he says carrying me over to the table and dumping me out. “Looks like he found our special drink earlier than expected.” <br>\r\n<br>\r\n“Wait, you guys did this to me??” Why ?”<br>\r\n<br>\r\n“Ya know all those jokes you love to play on us? Well it’s time for some payback.” Mike said. That Vodka you drank will let us control everything about you with this” he held up a remote. <br>\r\n<br>\r\nI looked at him puzzled. “This is insane !” <br>\r\n<br>\r\n“Maybe it is insane but its also gonna be fun! Well, for us anyway. You may not like what some of us do to you but that not our problem.” They all laughed. <br>\r\n<br>\r\n“Let me show you” he said and started punching some commands in the remote. <br>\r\n<br>\r\nWithin seconds I felt my body transforming. He then help me up to a mirror. There in the reflection was what looked like an insole for a shoe. But with my face on it. IT WAS ME!<br>\r\n<br>\r\n“This is one form you may take over the next few days. One of us may need some extra cushioning for our feet while he take that 10 mile hit tomorrow. He then punched in more commands returning me to my former 3 inch humanoid form. <br>\r\n<br>\r\nBut for tonight we have to decide what to do with you. <br>\r\n<br>\r\nThey all start offering suggestion. <br>\r\n</span></div></div>",
            "created":1343797200,
            "id":1395275,
            "title":"Jimmy"
        },
        "114":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Foot Stool",
                "Football",
                "Make him bigger to massage our feet?"
            ],
            "content":"<div class=\"\"><div> <span>Just as you look around at your giant surrounds, you hear someone coming around the corner. You see a pair of huge socked feet. It’s Steve. He spied the open freezer door and bottle on the floor. Then he spies you. You see a big smile draw across his face.  He reaches down grabbing the bottle in one hand and you in the other.  He carries you both over to the other guys still playing darts. <br>\r\n<br>\r\n“Well guys, it didn’t take as long as we thought to get this party started” he says holding me up. <br>\r\n<br>\r\n“Guys ! What the hell happened to me?” <br>\r\n<br>\r\nMike steps forward. “We were gonna wait until tomorrow for this but since you found our little surprise yourself looks like e get to start early.” <br>\r\n<br>\r\n“What are you talking about ??!?!?!” I ask<br>\r\n<br>\r\nMike continues “ that vodka was lased with genetic altering nanobots. Once ingested we can now control your very being with this” he holds up a remote. <br>\r\n<br>\r\nI was still being held in Steves fist. <br>\r\n<br>\r\nMike plugged some commands in the remote and hit enter. He then looked at Steve and said  “Squeeze him” <br>\r\n<br>\r\n“NOOOO !” I shouted, sure I was going to be crushed. <br>\r\n<br>\r\nSteve started to curl his fist tighter as the other guys looked on. Instead of being crushed to death, my body mushed in his grip. When he opened it, I fell to one side face down in his sweaty palm. <br>\r\n<br>\r\n“COOL !” came one comment<br>\r\n“Awesome” Came another. <br>\r\n<br>\r\nThen Mike entered into the remote “Immobile” and carried me to the dartboard. He took a piece of duct tape, made a loop and pressed it on my back then pressed me to the bullseye. <br>\r\n<br>\r\nHe turned and questioned “So we playing darts or what?” Laughter and cheering erupted. <br>\r\n<br>\r\nI watched in horror as they guys lined up with huge smiled on their faces and took aim to continue their game. I was totally unable to move, to even shout as he took my ability mo move away from me. I hung there for the next hour as darts wizzed by and close to me. It was down to Butch for the final throw. He smiled and as if in slow motion he pulled back his arm then tossed the dart. It headed directly at me. I tried to move but it was no use. <br>\r\nThe sharp steel tip penetrated directly into my stomach. There was no real pain, just pressure and humiliation. <br>\r\nThe guys all laughed and high-fived one another. I was impaled and hanging there. They didn’t even come pull it out right away. I was left there like that while they gathered some snacks and beers together. Then after a short time Jimmy came over, pulled the dart free, ripped me off the board and removed the duct tape. <br>\r\n<br>\r\nHe carried me over to the living area where the guys were all seated as the TV was flipped on. <br>\r\n<br>\r\nMike held the remote. “SO what should we do next with the runt…..? <br>\r\n</span></div></div>",
            "created":1343797200,
            "id":1395266,
            "title":"1 inch tall"
        },
        "12":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Keep you 3 inches tall for a while",
                "Shrink you more",
                "Make you a little bigger to service them",
                "Turn you into another object",
                "You decide"
            ],
            "content":"<div class=\"\"><div> <span>Spying the pool table you grab a Que stick and ask \"anyone wanna play?\"<br>\r\n<br>\r\nButch replies \"Sure I'll take you on\"<br>\r\n<br>\r\nThe other guys gather up the bags and beer you all brought along and start putting it away. <br>\r\n<br>\r\nYou and Butch play match play up until the very end of the game. <br>\r\n<br>\r\nIts your shot and you take aim at the 8 ball and call the drop pocket. You hit it perfectly and it drops solidly into the hole. You raise your arms \"I WON ?!?! I ACTUALLY WON ? I NEVER WIN !!!\" <br>\r\n<br>\r\nMike is standing behind you and says \"Nope you still loose\" and jabs you in the ass with a syring. You feel a burning sensation in your ass as he pulls the needle out. <br>\r\n<br>\r\n\"What the hell?\" you reply as you slump over and black out. <br>\r\n<br>\r\nWhen you wake up your groggy. Your vision is blurred and you can hear the rest of the guys all taking. When you get to your feet you notice it looks like your in a small glass room. But then you realize its not a glass room. Its a beer mug. <br>\r\n<br>\r\nYou SHRANK !<br>\r\n<br>\r\nJimmy looks at you noticing movement from inside the mug. \"Hey guys hes a wake. Look how pathetic he looks. HAHAH\" he comments. <br>\r\n<br>\r\nYou look up to see your 4 buddies all looking down at you. <br>\r\n<br>\r\n\"What the hell did you do to me ?\"<br>\r\n<br>\r\nMike answers. \"We are just getting you back for all those jokes you have played on us over the years. For the next few days YOU belong to US\"  He holds up a remote and says \"With this we can turn you inot anything we want. Any size, any shape any consistancy.  If you dont behave I may just turn you into an insole for my hiking boot for when we go hiking tomorrow\" he laughs. <br>\r\n<br>\r\nButch picks up the mug and dumps you out onto the table. You estiamte that you are about 3 inches tall. They guys decide to.......<br>\r\n</span></div></div>",
            "created":1202619600,
            "id":532032,
            "title":"Play Pool"
        },
        "121":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Out run the balls",
                "Hide in the corner",
                "Get hit"
            ],
            "content":"<div class=\"\"><div> <span>“Anyone up for another game of pool ?” Jimmy asks. “And we can make it interesting” he adds as he grabs you off the table. <br>\r\n<br>\r\n“Mike hand me that remote” he says. <br>\r\n<br>\r\nMike does. <br>\r\n<br>\r\nJimmy presses a few buttons as the other guys watch. When he presses, “enter” you feel a jolt zap thru you. You are still only about 3 inches tall. You’re unsure what he did to you until he grip tightens and you feel the pressure of his squeezing fist. You can feel your body conforming to the inside of his hand. When he opens it you body is compressed together. He turned your body into the consistence of silly putty. <br>\r\n<br>\r\nThe guys all laugh as you loose your balance in his open hand and fall to the side. <br>\r\n<br>\r\nJimmy then takes you over to the table and lets your body reform. He then pulls out what looks like a small pair of handcuffs and pulls your arms behind your back and clasps them on you. <br>\r\n<br>\r\n“There, now all you gotta do is keep from getting hit by all the balls while we play.” <br>\r\n<br>\r\nYou cant believe what your hearing. <br>\r\n<br>\r\nThe guys all grab a cue stick and smile down. You get to your feet and start looking for a way off the table as Steve racks up the balls. As you try to climb over the ledge, mike takes his stick and flips you back onto the felt. AS you get up you look down the table at Butch taking aim for his shot. <br>\r\n<br>\r\nThere’s a loud crack and balls go rolling everywhere. <br>\r\n<br>\r\nYou try to keep from getting squished. <br>\r\n<br>\r\nYou….<br>\r\n</span></div></div>",
            "created":1210827600,
            "id":532035,
            "title":"Keep you 3 inches tall for a while"
        },
        "1212":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "The 8 Ball rolls in",
                "One of your Captors stands",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You pound across the felt of the table as balls are sent rolling in a frenzy. As you run, your hands slip out of the handcuffs. Now free you speed towards the corner pocket. A gigantic 7 ball rolls infront of you. Acting quickly, you are able to dodge it. <br>\r\n<br>\r\nWith a leap you soar through the opening of the pocket. You land in the bottom of the pocket, breathing heavily. You rest does not last for long as you look up through the opening. Way up above....</span></div></div>",
            "created":1212382800,
            "id":539366,
            "title":"Hide in the corner"
        },
        "12122":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Oh god",
                "Oh god"
            ],
            "content":"<div class=\"\"><div> <span>Way up above, steve stands in his board shorts and singlet. His admittedly impressive body looks godlike from this angle. Looking down, he smiles at you. He places his cue down with one arm as the other is deep within the crotch of his pants. You can see a thick trail of pubic hair poking up above the waistband. As he is next to you, the smell of his sweaty groin is thick on your nostrils and throat.<br>\r\n<br>\r\nSteve looks to the other guys, you notice his smile turning into a smirk. \"Hey fellas,\" What he says next shocks you to your core, he is normally a nice guy, but at this time, with this power, he is a godlike bully. As he gets the other guy's attention he slowly croaks  \"New Game\"</span></div></div>",
            "created":1212382800,
            "id":539371,
            "title":"One of your Captors stands"
        },
        "121222":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Lets go of his package",
                "Turns and sits down over you"
            ],
            "content":"<div class=\"\"><div> <span>Enormous Steve looks back down at your pathetic, tiny form. Smiling, he rips the fly of his board shorts apart. You watch as they crash to the floor. He stands in a pair of very small, very tight black boxer briefs. His hand grasps his dick and balls beneath the old, dirty fabric, you can see a wet patch starting to develop as he is obviously intoxicated by this power.<br>\r\n<br>\r\nHe slowly peels the underwear off, his hand cupping his package. The other guys have clued in on what he is planning, and begin to laugh as they each get another beer. \"Cmon steve, do it, do it, do it , do it\" they all begin drunkenly chanting.<br>\r\n<br>\r\nAs Steve towers over you, every detail is revealed excluding his dick and balls, you can see the dirty, sweat coated skin of his grundle behind his hands; his pores have years of deep, in ground dirt and his thighs and crotch are covered in a nice field of black, wirey hair. Steve Steps up closer to the pocket</span></div></div>",
            "created":1212382800,
            "id":539375,
            "title":"Oh god"
        },
        "1212221":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "He blows",
                "He stops"
            ],
            "content":"<div class=\"\"><div> <span>The light of the cabin is eclipsed by Steve's huge form. A raucous laughter erupts as he lets go of his endowment above you. His huge, tank of a dick with its massive nutsac spills into the pocket of the table. You freak out, you are trapped with Steve's monster cock. The smell is disgusting as the sweaty skin slaps you hard. <br>\r\n<br>\r\nSpeaking of hard, you notice the deep blue veins begining to swell as the dick gets erect.Steve begins to grind you, his scrotum slapping the sides of the pocket. You cannot believe the situation you are in, being 3 inches tall, trapped in a snooker pocket being bashed by your buddy's cock.<br>\r\n<br>\r\nA thick, warm goop soaks your body as Steve's precum begins to flow. Steve's previously slow grinding changes into fast, sharp jolts. You notice his scrotum beginning to tense up, which can only mean one horrifying thing. He is ready to blow his load all over your tiny body.<br>\r\n<br>\r\nWith one more jolt, steve arches back, he looks down at you. Past his abs and pecs you see a drowsy, drunken look in his eyes. An evil, crooked grin creeps onto his face as</span></div></div>",
            "created":1212382800,
            "id":539385,
            "title":"Lets go of his package"
        },
        "12122211":{
            "author_id":"etherfur",
            "author_name":"Etherfur",
            "choices":[
                "You're pulled out of the hole.",
                "Another of your friends is overhead, ready to give Steve's idea a try himself."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, no,\" you choke out, fear settling in as your friend's precum drenches you through your now-sticky clothes. Back against the wall and pressed from ahead by the bulbous head of Steve's massive erection, you've got nowhere to go and no way to stop what's coming. All you can do is brace yourself as, high above you, Steve arches back, groaning deeply and pushing his hips forward towards the snooker pocket. Time slows to a crawl as his slit, big enough for you to stick your arm in, gapes wide. A deep gurgling echoes from within and you close your eyes.<br>\r\n<br>\r\nYou feel a hot gooey blast smack across you. The sticky substance drips across your whole front, and the stench of the semen makes you gag a little. You part your lips to try and breathe in some fresh air, just in time to recieve a mouthful of the next splurt. Choking and coughing as some of it goes down the wrong pipe, you try to spit it out, but more just flows in as his cock blasts against you again and again, forcing you to swallow his seed each time as your nostrils flare, getting whatever air they can in the cramped space of the pocket. All the while, Steve's semen rises around you, halfway up to your knees by the time the spurts crawl to a still.<br>\r\n<br>\r\nYou groan and wipe away what you can from your face. Your whole front and part of your back is just covered in his cum, and it slowly drips down your tiny little body like syrup. Trying not to think about it too much, you blink your eyes open, your mouth opening for a breath of just air, though the taste of Steve's nasty cum still lingers heavily in your mouth. In fact, you realize as you sniff your hand, your whole body smells like his goddamn dick. As if the act itself wasn't enough humiliation, now your very flesh smelled like the hot meat that pulses before you, slowly softening and giving you more space to move around in. From above, the ragged panting sounds like soft thunder, the titanic man basking in the afterglow. Slowly, he steps back, his penis and sack leaving the pocket as he retreats out of sight. No doubt going to sprawl on a couch and revel in his victory, the bastard. The sexy bastard.<br>\r\n<br>\r\nWait, what? Did you really just think that? An errant twitch makes you look south, where you're sporting an erection of your own. No, no, no. You just got humped against a snooker pocket wall by a lusting giant. There was no way that turned you on. It... it's probably just the thick smell of testosterone and arousal rising up from your body and the puddle of semen you're standing in. Brushing off the thought and a little more of Steve's cum, you look up to whatever your gigantic friends have planned for you next.</span></div></div>",
            "created":1373864400,
            "id":1628614,
            "title":"Thar He Blows!"
        },
        "12122212":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Pull you out of the hole,",
                "Put all their dicks in the hole"
            ],
            "content":"<div class=\"\"><div> <span>You are stuck in a moment of horrifying silence as Steve stops jolting. You are not sure what his plan is, but those glazed eyes and careless expression means it can't be good.<br>\r\n<br>\r\nYour answer is given as the other guys all come into view in the opening of the pocket. Your torture is just beginning it seems as they</span></div></div>",
            "created":1212382800,
            "id":539392,
            "title":"He stops"
        },
        "121222121":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Into Steve's soaking wet groin",
                "In between Steve's asscheeks"
            ],
            "content":"<div class=\"\"><div> <span>As Steve's dick retracts from the pocket, Butch instructs him to lay down on the table. Jimmy pulls you out in time for you to see Steve's hairy ass crash onto the fabric of the snooker table. <br>\r\n<br>\r\nJimmy pushes you along the table like a child playing with a toy car. He directs you to the mass that is Steve. Steve lays there, pulling his knees up. As you are pushed further towards him, his massive, naked legs create a valley of hairy, stinking horror.<br>\r\n<br>\r\n\"Jimmy, please, stop\" you beg, only to be met with a slow shake of jimmy's head. He continues to push you</span></div></div>",
            "created":1212382800,
            "id":539397,
            "title":"Pull you out of the hole,"
        },
        "1212222":{
            "choices":[
                "This gives the guys an idea",
                "Use you for something more useful"
            ],
            "content":"<div class=\"\"><div> <span>As the guys chant Steve approaches the pool table with a smirk, walking while hiding his sack from the rest of the guys. His meaty hands eclipse his junk then he lifts it over you. The guys count down as Steve eggs them on. With no where to go you are forced to stand there looking up at your sweaty former friends massive junk. The guys chant loudly... <br>\r\n<br>\r\n3...<br>\r\n2...<br>\r\n\"Noooo\" \"C'mon stop!!\"<br>\r\n1!<br>\r\n<br>\r\nSteve jumps up surprising you as they fall they hit you and smoosh you onto your back... He thrusts the air and his balls wipe you into the socket... Cheering as you make a thud from falling into the pool hole. Steve turns around and sits on top of the pool table hole. The little light coming in illuminates his meaty ass pressed against the opening. Sarcastically He moves his finger to his mouth and \"Ssshhhhhhhhhhh's\" Everyone. They wait for whats going to happen next as you hear a rumbling coming from above. \"LET ME OUT RIGHT NOW!\" You scream as Steve lifts his ass. He scrunches his face with a half smile as his ass opens above you. \"PRRRRRRRRRRRrrrrrrfffffffft!\"</span></div></div>",
            "created":1405832400,
            "id":1830782,
            "title":"Turns and sits down over you"
        },
        "1213":{
            "author_id":"navysteam44725",
            "author_name":"Rowan Catalyst",
            "choices":[
                "Be my next drink",
                "Sleep in my balls",
                "Become my jizz sponge"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for you, running, let alone walking, is a hard enough task when handcuffed. Butch takes his shot and breaks the balls in an expert fashion. You have begun t squirm your way to the side of the table but have barely made it 2 feet when you see the shadow of the ball come over you. Being like putty, you think you are going to contort to the shape of the bowl. You were right. You stuck t the ball like glue, until Steve flicked you off.<br>\r\nWell, it's nice to see that those nano-probes still work. He grabs the controller and taps in a few commands. You see him slide the cohesion bar down to the bottom, and in a few seconds you were just a puddle of skin. \"Haha. You gt hit, and therefore you lost the game.\"<br>\r\n\"I know what he can do as a forfeit, he can...</span></div></div>",
            "created":1514325900,
            "id":2432889,
            "title":"Get hit"
        },
        "12131":{
            "author_id":"wavvle",
            "author_name":"Hshshshsh",
            "choices":[
                "The turn you human again",
                "They let you digest"
            ],
            "content":"<div class=\"\"><div> <span>“I know what he can do as forfeit,” said Steve. “He can be my next drink. Butch looked down at the controller in his hand with a smirk. “Ok then,” he said with anticipation. You watched Butch press a few buttons and before you know it, you slowly start melting. You feel like your entire three inch body is jelly. Your feet are beginning to disappear. “Wait! This won’t do!” shouts Mike from above you. You look up to see him staring at you. He picks you up out of the puddle of you and places you in Steve’s mug. Before you knew it, your lower legs came flying into the mug. Butch must have reformed you. “Ok, now you can melt him,” said Mike. He looked down and winked at you. At the flick of a switch, your body felt like jelly again. After a minute, you were almost completely liquified. It was only your head left, sinking into the goop which was the rest of you. Your mouth melted away, then your nose, then eyes, and all of you gone. Somehow, you could still hear everything the guys were saying, even with your ears out of commission. “There’s not that much of him,” said Steve’s voice. “Don’t worry,” said Butch. I can make him more spacious. He pressed some buttons and you were getting larger. Eventually you feel some of yourself start to overflow out of the mug. “That’s a bit too much!” said Mike. “It’s fine,” said Steve. “This way, we can all have some.” He grabbed his mug which had the vast majority of you in it, and you could feel yourself get poured three times, about a quarter of you in each of your tormentors’ mugs. You felt one part of your body get diluted by an incoming surge of alcohol. Then another, then another, then the last. The four friends sat down at the table. “On three!” you hear Steve say. “One, two, three!” they all chant at once. On three, you feel yourself get raised to pass through four sets of lips, and flow over four sets of teeth, four tongues, and down four gullets at once. You have been drunk. What do the boys decide to do next?</span></div></div>",
            "created":1576126380,
            "id":2758516,
            "title":"Getting drunk"
        },
        "124":{
            "author_id":"lizzie_little",
            "author_name":"lizzie_little",
            "choices":[
                "Mike and Steve win you",
                "Butch and Jimmy win you",
                "They forget and you become an object for the weekend"
            ],
            "content":"<div class=\"\"><div> <span>You stare up into you former friends eyes to see nothing but plesure, and that's what is truly terrifying you. These are supposed to be your friends, and so you may have pulled a few measly pranks over your time but no more then the rest of them, and never anything close to this level of cruelty. A gigantic grin spread across Mike's face as he declares \"alright guys winner's get to keep him for the night\" <br>\r\nThe all get a determined gleam in their eyes, this isn't going to be good no matter who wins. Well for you anyway. \"Come on guys just turn me back this isn't funny\" apparently it was because they all just burst out laughing forcing you to cover your ears. <br>\r\n\"Right time to pick teams, how we doing this\" Steve says swiging some beer.<br>\r\nMike picks up the bottle that you was previously being held in and spun it whilst tells the others that whoever it landed on would be his partner. After landing on Steve he picks up the 8 ball and drops it into the corner pocket before setting up the rest of the balls.<br>\r\n\" Umm, Mike, why'd you stick the 8 ball in the pocket, and who gets the toy till the end of the game\" Jimmy questions, not once taking his eyes off of you. All you can do is sit there and except your fate, you've already been told your nothing more than a toy to them. Unfortunately for you they never were very gentle with their toys or very good with their alcohol all except you and Steve would be wasted by the sixth drink maximum. Mike broke out in unstoppable giggles backing up your thought then stating \" well you see them two answers are the same see, the winner is the person who gets the 8 ball and that means they will get him, so I thought hey you have to get the 8 ball so why not make him the,\" he picks up a small watch looking thing with controls on it instead of a clock face and holds one of the buttons whilst saying \" 8 ball\".  And every pair of eyes settle on you in complete fascination.<br>\r\n<br>\r\nA tingle fills you body like you're being pumped with water before your body starts changing shape becoming rounder and heavier. Suddenly it stops and you realise that the watch thing just have transformed you. OH NO, you must have become the 8 ball but you still have all your senses. You start getting really scared and try to run only to find that you cant move. \" What the fuck\" you say only to realise you can't talk either. How is it fair that you can see, hear taste, smell, feel and think but not be able to talk or move. You wonder why and how you can sense from all over  your 'body' when your thoughts are interrupted by Mike's enormous fingers lowering around you then applying what feels to you like a ridiculous amount pressure when in reality he's only lifting you gently before dropping you into the triangle with the other balls. You feel the pain radiating from all over your 'body' before being jostled about and being released from the triangle. At first you feel relieved before you realise what's going to happen. SHIT.  All the guys are laughing at your state as Mike draws the Que back, aims and CRACK.a noise as loud as thunder hurts your ears just before you feel the impact. Your dying, oh God you feel like you're going to die as you're being crushed by all sides from the force of that hit.  Luckily you're left pretty much alone for most of the game other than the odd stray balls, they where all too busy trying to win you for the night to bother about your pain or humiliation for the moment. Your finally the only ball left and as the white ball aligns with you and the pocket you make one last attempt to move before  CRACK the ball smashes straight into you knocking you into the pocket to crash into the other balls. <br>\r\nNow you just have to wait and hope for the best, your not sure who you hope just won that after all, Mike and Steve are good friends but they always put their entertainment first so you really would just be a toy to them no matter how you feel, they also enjoy to humiliate you as much as they can. Whereas if Butch and Jimmy won it could go either way, Butch is really quiet however dominating who would get his kicks from causing you pain and humiliation, and Jimmy is quiet a softy who only really wanted some attention, so you hope Jimmy gets you for the night but they where playing pairs. <br>\r\n<br>\r\nOption 1- Mike and Steve won the game. Hope you enjoy humiliation.<br>\r\n<br>\r\nOption 2- Butch and Jimmy won the game. Domination or nurturing.<br>\r\n<br>\r\nOption 3- They got so into the game that they completely forgot you was there and carried on the weekend as if you didn't go with them. The only problem is that Mike still has the watch gadget on only it's linked to the wearers mind and transforms him into whatever Mike wants or needs. Hopefully they remember you by the end of the weekend so that you can go back to your life.</span></div></div>",
            "created":1406955600,
            "id":1836671,
            "title":"Turn you into another object"
        },
        "13":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "6 inches",
                "4 inches",
                "3 inches",
                "2 inches",
                "1 inch"
            ],
            "content":"<div class=\"\"><div> <span>As if on queue everyone said “Poker” Mike said he would get some drinks and the other guys set up the table. I took some of the bags we brought in and moved them out of the way and started to organize things. Mike came back over with shots of whisky for everyone. When I reached for one, he moved and put a different one in front of me. Not thinking I just took the not he motioned toward. <br>\r\n<br>\r\n“CHEERS” everyone exclaimed and downed the shot. <br>\r\n<br>\r\nHanding Mike back the empty glasses the rest of us walked to the table. There were only 4 chairs there. <br>\r\n<br>\r\n“I think we’re missing a chair” I said. <br>\r\n<br>\r\nMike replied “No, no were not.” <br>\r\n<br>\r\nAs I looked over puzzled I felt a burning sensation in my stomach. <br>\r\n<br>\r\nButch commented, “Wow that’s working quick”<br>\r\n<br>\r\nWhat was he talking about I wondered. “Guys I don’t feel well” <br>\r\n<br>\r\n“It’s ok, It’ll pass” Mike said. “At least that’s what my cousin told me when he gave the serum to me. It’s what I put in your drink”<br>\r\n<br>\r\nI began to feel funny. I then looked up at the other guys who seamed to be getting taller. Of course they weren’t. I however WAS getting shorter. I was shrinking. <br>\r\n<br>\r\nMike commented that the serum was laced with some kind of microscopic nano-bots. Then he pulled out a palm pilot type device. “When the nano-bots attach to your DNA I can control you completely with this. I can even turn you into other objects if I want.” He laughed. <br>\r\n<br>\r\nI saw him plugging in some kinds of commands. He was the one controlling my shrinking. Somehow ever my clothes were shrinking with me. All except my shoes. <br>\r\n<br>\r\nThe other guys also laughed as they took their seats at the poker table. By the time Mike walked over to me I had shrunk to a reduced height of .......<br>\r\n</span></div></div>",
            "created":1209099600,
            "id":524033,
            "title":"Play Poker"
        },
        "133":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "he turned me into an ice cube for his drink",
                "a pillow for under his feet",
                "Your Choice"
            ],
            "content":"<div class=\"\"><div> <span>At 3 inches tall I was easily scooped up in mikes hand. He then carried me to and tossed me onto the table they were gathered around to play poker. I started to freak out and began shouting. <br>\r\n<br>\r\nJimmy glanced over with an annoyed look. “Can’t you quiet him down?” <br>\r\n<br>\r\n“Actually I can” Mike replied and took out the palm pilot and hit the “mute” button. As soon as he did I was silenced. I tried to speak, to yell, but there was no sound. Like the mute button on a television set, he took my voice away. <br>\r\n<br>\r\nThe guys thought this was hilarious. <br>\r\n<br>\r\nThey began flicking me back and forth to one another with their thick strong fingers. It hurt but my pleas to stop went unheard. Mike feeling just the lightest bit bad for me, and not wanting to inflict any serious permanent damage also typed in “Pliable”. This allowed me to somewhat absorb the blows. This helped physically but was still humiliating !<br>\r\n<br>\r\nMike reached out and snatched me in mid tumble across the table. “Now listen here runt, while we play, your going to be out chip jockey. Its up to you to take our bets and move them into the center of the table. Got it?”<br>\r\n<br>\r\nI stood there arms folded and turned my back to him. <br>\r\n<br>\r\nHe lent down and said “You will do it or Ill turn you into a poker chip and leave you like that for the rest of your miserable life. Got THAT?!?!” <br>\r\n<br>\r\nI lowered my head in defeat and turn to him in acknowledgement of my duties. <br>\r\n<br>\r\nThey began playing and I started running from guy to guy pushing in their bets as they played. Luckily for me they pulled in their own winnings. That would have taken me forever. <br>\r\n<br>\r\nThis continued for what seamed like hours. <br>\r\n<br>\r\nThen one of the guys asked Mike what else the Palm Pilot could turn me into. It was Jimmy. Mike grinned and tossed it to him. “Why don’t you try it and find out.” <br>\r\n<br>\r\nI got a very bad feeling about this ! <br>\r\n<br>\r\nJimmy started punching in commands and I felt myself changing again.This time…..<br>\r\n</span></div></div>",
            "created":1270616400,
            "id":864063,
            "title":"3 inches"
        },
        "1331":{
            "author_id":"grangerdanger",
            "author_name":"Nibby",
            "choices":[
                "Mike turns me into a pillow to sleep on",
                "Butch puts me in his sock"
            ],
            "content":"<div class=\"\"><div> <span>I felt my body transforming into a cubed shape, my face made up one square, with my arms, legs and torso making up the rest of the squares, I couldn't speak but I could still see, smell, and hear everything. <br>\r\n<br>\r\nAll the other guys roared with laughter as Jimmy lifted me up, pinching me between his thumb and finger. I stared into his piercing brown eyes as he said \"Man you are pathetic, at least you'll keep my beer cool.\" At first I didn't realise what he meant until he dropped me into his beer, causing me to tingle. I had been turned into an ice cube.<br>\r\n<br>\r\nThe rest of the guys ignored me as they continued on with the poker game, with Jimmy treating me as if I was nothing more than an ice cube, my existance was to simply keep his drink cold. Every so often I would be overturned in the glass as he swigged his beer, it was completely humiliating.<br>\r\n<br>\r\nEventually the poker game finished, with Mike winning the game with a straight flush. All the guys raised their glasses to him and clinked them together, 'Oommpphh!' The vibrations caused me to shake against Jimmy's glass, as he downed the last of his beer. \"Right!\" Jimmy said, clapping his hands together. \"Time to hit the hay, but what should we do now with the runt to make sure he stays while we sleep?\"</span></div></div>",
            "created":1404968400,
            "id":1825465,
            "title":"He turned me into an ice cube for his drink"
        },
        "13311":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Morning comes and they plan a hiking trip",
                "Morning comes and they plan something else."
            ],
            "content":"<div class=\"\"><div> <span>Since Mike won the poker game he won rights to use me for the night. He decided to use me as a pillow. The one he brought always gave him a neck ache. He used the remote and did an internet search for one he thought he would like and merged it with the program. I instantly transformed to a pillow, now lying on the floor between them all. <br>\r\n<br>\r\nThey began kicking me around and then I was grabbed as one comically shouted “Pillow fight !” I was grabbed by mike at my corners and then they started hitting each other I felt every blow as I was bashed into one guy then another. <br>\r\n<br>\r\nAfter they were exhausted and now all sweaty they decided to retire for the night.  He carried me to his room. One he was sharing with Jimmy. Unfortunately their room had one bed, a full size but still. I was tossed on the bed as they undress down to their boxers. Then got in. At first he pounded me in deliberate blows as though the was “fluffing me up” then he planted his bug sweaty head right on me. He tossed and turned and could not get comfortable. Then he had a better idea. He picked up the remote from the night stand and typed in “body Pillow” I began to elongate to about 4 feet long. He added “Face Center) and he then reposition me from under his head to along the front side of his body. I could feel him all over me. His arms wrapped around me, and my face now pressed into his groin. <br>\r\n<br>\r\nThis was horrible and humiliating. To add insult even more he let out a nasty, long, wet sounding fart. And I was trapped, trapped with him wrapped around me. The covers pulled over us, the sent seeped into my fabric body. <br>\r\n<br>\r\nI hear jimmy cough and hit him, commenting “Nasty dude, your sick” <br>\r\n<br>\r\nMike just laughed, resecured his arm hold and leg hold around my body and drifted off to sleep…..<br>\r\n</span></div></div>",
            "created":1404968400,
            "id":1825494,
            "title":"Mike turns me into a pillow to sleep on"
        },
        "133112":{
            "choices":[
                "Jimmy grabs the device with an idea...",
                "The guys change you into something else..."
            ],
            "content":"<div class=\"\"><div> <span>The humiliation of being mikes pillow keeps you awake and unnerved for a while, but eventually you fall asleep. He's happy as he hugs the long pillow that is you. His masculine crotch next to your face while he sleeps. Morning comes and you are awoken by mikes groin expanding into you. He smiles feeling your soft pillow form on his junk. \"Morning little dude! Ahaha.... or should I say morning wood.\" the sun shines through the window showing the long tent shaping mikes boxers. He laughs slyly as his legs wrap around you and he rolls on top of you humping the pillow comically shaking the bed to wake up his friend. Your face is pounded by mikes balls, his massive stick rubbing all over you. He moans dramatically until his friend wakes up beside him. \"God I love this pillow OHHH MMMM\", he says sarcastically grinning at Jimmy. \"Morning to you too ahah.\" Jimmy says rolling his legs over the side of the bed stretching. Mike gets off the bed and grabs his pants leaving you motionless on his bed. He comes back down and moves you slightly so you're right behind him. His massive sweaty boxer covered ass comes down right where your face is and he sits pulling on his jeans. He pulls his belt on squatting over you, then lets gravity pull his meaty ass back onto your face. \"What are we having for breakfast Jimmy?\" He questions smirking at his friends that just walked in. \"Hows the little guy doing? asks Steve. Mike just grins lifting one massive cheek off you and lets out an obnoxiously loud fart. \"PuuuffffffffrrrrrrrRRRRrrrrrrrRRrttt\" It fills your body as the guys laugh realizing its you. \"Ahhh nasty man!! Can't say I feel bad for the little shit though..\" Mike lets out a chuckle \"The little runt should be thankful to be my little fart smeller!\" The weight of mikes ass sitting down on you is flattening you into the bed. \"So what are we going to do today Jimmy finally says\"</span></div></div>",
            "created":1410752580,
            "id":1857019,
            "title":"Morning comes and they plan something else."
        },
        "1331121":{
            "author_id":"kirito-kun",
            "author_name":"kirito",
            "choices":[
                "humiliate you",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy grab the device and say<br>\r\n\"All my underwears are ugly so I looking for others and I just find one\" he says with laugh<br>\r\nWhen you hear that you know you gonna have a very bad day. Jimmy presses a button and you start to change very quickly, where there was a pillow, there is only a blue underwear. When Jimmy grabs you, you realize that your face is the back of the underwear so you gonna be all the day with his butt and farts. He look at you in your eyes and says \"I made that you can again talk because when I gonna fart or scratch my anus, we could hear you cry and scream and this will be fun\".<br>\r\nAfter he says this words, he wear you and he finishes dressing. During the breakfast you hear Jimmy says \"Hey dudes, morning gaz is coming\" and PPPppprrrrrrrrrttttttttttt he rip a loud hot fart on you and all your \"friends\" laugh about you.<br>\r\n\"So what do we do today?\"</span></div></div>",
            "created":1528308360,
            "id":2503647,
            "title":"Jimmy's underwear"
        },
        "13311212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Rub my feet",
                "lick my cock",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>..........</span></div></span></div>",
            "created":1528399020,
            "id":2504061,
            "title":"other"
        },
        "1331122":{
            "choices":[
                "You went into Jimmys mouth.",
                "You try to stay there for a little time and jump on the bed."
            ],
            "content":"<div class=\"\"><div> <span> The both changed me into a even smaller and thinner guy, so they can have more fun with me. As I see the grin on Mikes face, i was a little bit more afraid. i did not thought, that this is possible, but i just wish him to eat me up and digest me. This would be much better as beeing bothered by the two guys. Anyway. Mikes hand drop me up And look at me. More tinier at the beginning of  the morning. He push me in his piss slit, it seems to me, that he want to shot me through the room. I never was this afraid before, but i have no force to fight against them. Jimmy begins to play with his cock a little. he is licking of some parts of his acorn. sometimes i feeling the soft drop of his wet sponge tongue, from the part under my foot i feel, how a little cum comes up. The temperature increase more and more. The cock grows every minute a little bit more and jimmy begins to put the whole acorn in his mouth. It was very dark, but i like it a little. The feelings, the smell, the taste ... if this would be my end, then it is an more or less god way to go from this planet. Suddenly I dropped out of this deep, warm trap and standing on the wet, agitated acorn. This could be my way to escape.</span></div></div>",
            "created":1411424700,
            "id":1860377,
            "title":"The guys change you into something else..."
        },
        "13312":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Butch keeps me in his sock the next day",
                "Im tossed out on the breakfast table for the next ideas of punishment"
            ],
            "content":"<div class=\"\"><div> <span>Butch Pries off his sneakers exposing his sweaty ankle athletic socks. They are black and his leather sneakers don’t let his feet breath at all. The smell wafted thru the air. All the guys started coughing and gagging. “Come on guys it’s not THAT bad is it??” <br>\r\n<br>\r\nThey all quickly tell Butch that he is definitely getting a room of his own. No one wants to be suffocated in there with him. Mike had turned me from my current Ice Cube form and back to my tiny human form. “Here see what he thinks” and tosses me over to Butch who is now sitting on the sofa. <br>\r\n<br>\r\nButch takes me and holds my arms to my sides and proceeds to push my face right into the fabric under his toes. “What do you think” he asks. <br>\r\n<br>\r\nThe smell is horrific. I am sure it is accentuated due to my miniscule size. I tried not to breath and when I did I did it thru my mouth. Problem was Mike saw this. He took the remote and typed in “Seal mouth” as soon as he hit the activate button I could not open my mouth. If I wanted air I had no choice but to breathe thru my nose. I was held there while they all laughed. Eventually I inhaled. The scent burned my lungs. They could hear me gasping for air thru my nose, long deep breathes in and out just so I wouldn’t pass out from not having any. <br>\r\n<br>\r\n“See he likes it” Butch commented. “Hey Mike Make him immobile. I think I found my sleeping buddy. They left me with no mouth, and now I couldn’t even move of my own accord. Butch pulled off his sock and held me over the opening. With a sarcastic smirk he let go and I feel deep inside. Losing no time he slipped his size 12 foot right back inside and used his fingers to manipulate me to a position between his toes.  He of course had to give me a good squeeze once I was there before returning his foot to the floor. <br>\r\n<br>\r\nAll the guys bantered about my plight. But there was no sympathy. Just angulation and encouragement for ideas of what to do to me next. But they night will give them a few hours to dream up plenty of ideas. <br>\r\n<br>\r\nThere was absolutely no way of getting out of my predicament. I could neither shout to reason with them, nor move of my own ability. I was in essence no more than human toe jam between Butch’s toes. <br>\r\nBefore heading to bed, he got up and walking over to the guys sniffed his fingers and then put Jimmy in a headlock and forced him to smell his fingers from his nasty socks. They wrestled a bit as I was pounded and pummeled between his toes until they decided to call it a might…….. <br>\r\n</span></div></div>",
            "created":1404968400,
            "id":1825489,
            "title":"Butch puts me in his sock"
        },
        "1332":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "the poker game was over and Steve wants me under his feet",
                "IM turned into something else",
                "One of the guys uses me to sleep"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy always had his kids rub his feet when he would be sitting down. He would say it not only felt good but it let them know their place in his house. He’s the boss, and they belong below him looking up. He had a real attitude problem. But I guess when you’re a millionaire you can act however you like. <br>\r\n<br>\r\nJimmy was out of poker chips and said he was going to go sit by the fire and put his feet up. “You mind if I take the runt here with me?” he asked mike. “I need something soft to put my feet up on.” <br>\r\n<br>\r\nMike just shrugged as an indication for him to take me if he wanted. Before he did though he wanted the others to watch what he was going to do to me. He finished punching in the commands and I felt myself morphing. I expanded and felt myself getting puffy. He turned me into a square puffy pillow, to rest his nasty feet on. <br>\r\n<br>\r\nHe held me up showing all the others. “We’ll be retiring by the fire, my fine gents” he said and set the remote back down on the table but carried me off with him. <br>\r\n<br>\r\nJimmy tossed me down to a hard wooden foot stool in front of a rocking chair. He gathered some kindling wood from the box by the fireplace and proceeded to stake the wood for a fire. Once prepared, he stuck in a little paper then lit it and grabbed the bellows. I was face up on the footstool when I saw him lean back and down came his huge bulbous ass. He sat right on me. He set there adjusting his weight from time to time until he was assured the fire had caught. <br>\r\n<br>\r\nHe then get up, tossed on a few larger pieced of wood then got up and moved to the old rocking chair. He kicked off his flip-flops and raised his dirty feet up over me. Even in his form I could speak but not loudly. I trued to bed him not to do this but my gaze to his eyes was replaced with his huge feet coming to rest directly on my face. <br>\r\n<br>\r\nThere was nothing I could do, and with the increasing heat of the fire, the smell from his feet was getting more and more prevalent. I was stuck. He rocked back and forth applying pressure with each rock. <br>\r\n<br>\r\nI remained like this until……<br>\r\n</span></div></div>",
            "created":1270789200,
            "id":865054,
            "title":"a pillow for under his feet"
        },
        "13322":{
            "author_id":"mayorsurveyor",
            "author_name":"Quill",
            "choices":[
                "You wake up with Jimmy",
                "You wake up with another member of the group"
            ],
            "content":"<div class=\"\"><div> <span>The minutes dragging by seemed like days as I had nothing to do but lie there helplessly with Jimmy's feet planted firmly on my squarish face. Mercifully, they weren't dirty or foul-smelling. Being wealthy, Jimmy was expected to maintain certain standards of hygiene. The main issue with this scenario was the humiliation - here I was, lying beneath the feet of someone I thought was a friend. Oh, and I've been turned into a pliable pillow? Did I mention that?<br>\r\n<br>\r\nJimmy flexed his soles, burying them deeper into my face. <br>\r\n<br>\r\n\"Take a good whiff, boy,\" he mocked, adopting a posh accent. \"This is where people like you belong. Beneath me, looking up as I slowly lower my powerful soles onto your face.\" He smiled down at me, his blue eyes twinkling with happiness. Deliberately, he plants one of his soles against my mouth, preventing me from speaking. <br>\r\n<br>\r\n\"It's just not the same when you look like a pillow,\" he murmurs. Almost lovingly, he stroked my face with his foot. Then he sat up and lowered me to the floor in between his feet. The fire crackled softly as he reached for the remote. <br>\r\n<br>\r\n\"What are you going to do?\" I asked fearfully. Rather than answer, Jimmy lowered both feet onto my face again. Then he pressed a few commands on the remote. A tingling sensation ran through my body as I elongated, stretching out like elastic. It didn't hurt exactly...it just felt bizarre. After a few minutes, the feeling stopped, and I realized that I was back to normal! I had arms and legs again. <br>\r\n<br>\r\nHurriedly, I looked up at Jimmy. He was standing over me now, peering down with an impish expression. I was too elated to notice.<br>\r\n<br>\r\n\"Thank you, Jimmy! I'm back! Oh thank you, thank you!\" The words died in my throat when he lifted one sole and hovered it inches above my face. His toes wiggled playfully, as though eager to resume their perch. <br>\r\n<br>\r\nHe waited for my horrified gaze to meet his. Then, with a boyish laugh and sadistic intent, he eased the foot onto my face. It molded perfectly to my skin, as though my face were a plug and his foot an outlet. A more perfect match could not be found. Jimmy pressed down, not hard enough to hurt me, but hard enough to ensure that I wouldn't be getting up anytime soon. Then I heard him reaching around in his pockets. <br>\r\n<br>\r\n\"What are you doing?\" I asked. Or, rather, tried to ask. His foot muffled my speech. My words bounced off his sole and disappeared into nothingness. Jimmy felt the slight gust of air. He curled his toes a few times in response. Then I heard the unmistakable click of a cell phone camera. <br>\r\n<br>\r\nHorror shot through my body. He was taking pictures! My entire life could be ruined! If people found out about this, they'd treat me like a freak! <br>\r\n<br>\r\n\"Please, don't,\" I begged, but his foot again arrested my speech. I was literally helpless beneath it. He stood over me like an emperor, one powerful foot planted dominately on my helpless face. <br>\r\n<br>\r\n\"What was that?\" He mocked, thoroughly enjoying my situation. \"Harder?\" <br>\r\n<br>\r\n\"No!\" I protested, but it was futile. The pressure on my face increased slightly, removing any lingering doubts as to who was in charge. Then it got worse. Something began pulling at my lips. I tried holding them shut, but it was useless. <br>\r\n<br>\r\nJimmy laughed as he forced his toes into my mouth. They basked there for a few seconds, exploring. Jimmy sat, keeping the foot on my face. He pulled his toes out of my mouth and popped his heel there instead. Suddenly, I couldn't breathe. His heel fit into my mouth like a stopper, preventing air from entering. I began inhaling through my nose. Jimmy shook his head at me in mock pity. Then, still grinning sexily and sweetly, he slowly brought his other foot to rest on my captive face. Because of his other heel, all my air came through my nose - and that's exactly where the foot went. Jimmy's smile widened as he stared into my watering eyes. <br>\r\n<br>\r\n\"Look at you,\" he whispered. \"You're pathetic. You're weak and helpless, and your only place in this world is beneath my feet. My godly feet. In fact, I don't even think you deserve that honour.\" With that terrifying thought, he freed his heel and stood, letting all his weight descend on my face. His soles forced me into the ground, pinning me to the soft carpet. I could feel my head bob back up when he stepped off, but I was far too exhausted to move. I just lay there as he walked around me, stopping in between my sprawled legs.<br>\r\n<br>\r\n\"No,\" I pleaded.<br>\r\n<br>\r\n\"Yes.\" And with that, he placed one foot gingerly on my manhood. He didn't stomp or grind or anything. He just felt it, occasionally gripping with his toes or rubbing his sole up and down it. Despite my situation, I felt it beginning to get stiffer and stiffer, and I couldn't stop it. Jimmy worked his foot masterfully, and this was through two articles of clothing! <br>\r\n<br>\r\nAfter a few more terrifying yet ecstatic minutes, Jimmy walked over to me. His toes stopped inches from my face, I studied them from my peripheral vision. Like the rest of his feet, they seemed clean and strong. I heard a few more clicks and suddenly I was a lot smaller. His foot was easily the length of my entire body. Scared beyond measure, I began babbling, pleasing with Jimmy. By way of answer, he lifted his right foot into the air. <br>\r\n<br>\r\n\"You'll survive,\" he promised me. \"But I'll enjoy this. I have no more words for you.\" And with that, he stomped down on me. Hard. His manly, meaty sole ground me into the carpet. It seemed hotter than the fire conversing elsewhere in the room. And to make matters worse, he didn't lift his sole. Instead, he began twisting from side to side, slowly at first, as though I were nothing more than an insect to be ground out of existence, I screamed, but that only amused him further. <br>\r\n<br>\r\n\"Scream all you like,\" I heard his booming voice announce. \"No one will help you.\" His foot continued to grind and smother me. Just when I thought I couldn't take it anymore, mercy appeared. He lifted his foot and peered down at me. I couldn't even speak. I could only gasp, begging him with my eyes to stop. <br>\r\n<br>\r\nInstead, he stomped on me again. And again. And again. And he kept stomping on me so many times that I lost count. Yet he kept his promise - I never died. I was alive every time his heel turned my legs to powder, every time his sole flattened my stomach and chest, every time his toes crushed my face. I was alive for it all. And I could do nothing more than lie there helplessly as each new stomp came, often accompanied by his ringing laughter. Finally, when his foot descended on me, it didn't lift again. I didn't even care. I just let his sole press me into the tender arms of unconsciousness.</span></div></div>",
            "created":1372309200,
            "id":1618398,
            "title":"Back to Normal "
        },
        "133221":{
            "author_id":"grangerdanger",
            "author_name":"Nibby",
            "choices":[
                "Jimmy uses you to clean his body"
            ],
            "content":"<div class=\"\"><div> <span>I woke up on something firm but rather comfy, only to realise I couldn't move, I had been cellotaped to the mattress and must be about an inch tall. Turning my eyes to my right I discovered that it was Jimmy's, he was sleeping next to me.<br>\r\n<br>\r\nLast night was so humiliating and what's worse, I still have a few days ago before we leave and that's if they change me back. Jimmy turned in his sleep and was now facing me, lightly breathing on me. He was definitely the best looking out of us all, he had a defined face, with a golden tan, and a slick Justin Bieber style hair-cut, all of this from his half Italian heritage. <br>\r\n<br>\r\nI turned my gaze down to his slowly rising and falling chest to where his sculpted pecs where located. Butch was the most muscular out of all the guys but Jimmy here had really good definition, I had always been jealous of his looks and millionaire life and sort of admired him, but after last night he could forget it.<br>\r\n<br>\r\nI was startled whenever the alarm on Jimmy's phone blasted from the bedside table right next to me, he stirred a little and then woke up, reaching his carved bicep over me and turning it off. He let out a deep sigh and turned his entrancing brown eyes towards me. \"Morning runt\" he said with a grin, revealing his pearly whites. The strip of tape over me prevented me from speaking, causing Jimmy to roar with laughter.<br>\r\n<br>\r\nHe smelled his arm pits \"Ughhhh, this manly musk is a bit too musky, don't you agree runt?\" He raised his arm pit above me, the smell was awful, I would have gagged had the tape not been sealing me down. \"I think it's time we had a shower runt.\" He said as he peeled the tape off me and carried me towards the ensuite.</span></div></div>",
            "created":1405054800,
            "id":1825896,
            "title":"You wake up with Jimmy"
        },
        "1332211":{
            "author_id":"grangerdanger",
            "author_name":"Nibby",
            "choices":[
                "He leaves you on the soap dish as Butch walks in",
                "He takes me down to the guys having breakfast"
            ],
            "content":"<div class=\"\"><div> <span>\"Jimmy! Please don't do this!\" I said with tears streaming in my eyes. He then took out the remote and punched in 'mute' \"N-\" but then I was silenced. He tutted as he looked down at me. 'You truly are pathetic runt. You must learn that there is hierarchy in here, you are at the bottom of the chain, below me and the other guys. I have wealth and power to me you are nothing but a cleaning rag, this will teach you not to pull any pranks on us.\" He said with his brown eyes twinkling.<br>\r\n<br>\r\nJimmy really had an attitude problem but I couldn't argue with the fact that at this size he was the dominant one. He then typed another command into the remote and I felt my body flattening and morphing, I had been turned into a bar of soap. Leaving the remote on the windowsill, Jimmy stripped down naked in front of me,  turned on the hot water and it began streaming down, he left me on a soap dish while he rinsed himself off.<br>\r\n<br>\r\nHe then lifted me up and rinsed me under the powerful water, it was as well I didn't have a mouth anymore but I could still retain all my other senses which meant this was going to stink. He started by rubbing me around his pecs and in between the grove of his sculpted chest, bouncing his pecs on me as I was lathered all over them. The water and the friction caused me to heat up very quickly and it was becoming unbearable.<br>\r\n<br>\r\nHe then moved on to his well defined abs, bumping me along the six rock hard plates on his stomach, moving me down to his hairy legs, with hairs getting tangled in me. Next he moved onto his back, down to his tight ass cheeks which smelled really bad, but the worst was yet to come. He then rubbed me under his hairy armpits, with hairs and the musky man smell clinging onto me.<br>\r\n<br>\r\nHolding me up to his piercing brown eyes he said \"Almost done runt, just one more spot we need to clean\" if I could speak I wouldn't need to ask where as he lowered me down to his manhood, which seemed to have a hard on from this power-trip that Jimmy was having. \"Nooooooooooooo!\" I screamed inside my head.<br>\r\n<br>\r\nI was then rubbed all over the rubbery monster, his ball cheese sticking to my soap form and rubbing against his cock head, the smell was now unbearable and just when I thought it would never end, mercy was shown and he turned the water off, wrapping a towel around him as he stepped out of the shower. </span></div></div>",
            "created":1405054800,
            "id":1825901,
            "title":"Jimmy uses you to clean his body"
        },
        "13322112":{
            "choices":[
                "Strap you into the toilet",
                "Turn you into a cushion to share..."
            ],
            "content":"<div class=\"\"><div> <span>As Jimmy steps out of the shower he grabs his designer towel and tucks it around his waist. Still dripping wet he grabs you roughly and cockily walks downstairs still dripping and wet, you in his hand. He sees the guys at the table devouring breakfast. With the flash of his teeth he holds the bar of soap up and winks at the table of hungry jocks. \"NO WAY AHAHA! DUDE! YOU DIDN'T\" Butch laughs looking up from his scrambled eggs. \"Nasty... aha\" someone else comments with a grin. Shirtless Jimmy walks to the table and pulls out a chair, the transformation device sitting on the table... He sits down and places the bar of soap (YOU) in the middle of the table. \"Auahh Gross man!\" Jimmy interrupts with a casual smile, \"I was feeling sweaty for a while there, our little friend helped me out with that though.\"<br>\r\n<br>\r\n\"So what should we change him into next?\" Butch wondered outloud....</span></div></div>",
            "created":1407128400,
            "id":1837586,
            "title":"He takes me down to the guys having breakfast"
        },
        "133221121":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Mike entered the Bathroom",
                "Butch returns"
            ],
            "content":"<div class=\"\"><div> <span>I have an idea Butch says and get up and retrieves some elastic string from the desk drawer. He used the remote to change me back to a small human, about 3 inches tall. He enters in Immobile, Posable. I lay there in the table like a childs action figure, he picked me up in his massive hands and began tying lengths of string to my wrists and ankles. He then positioned me in a spread eagle position. <br>\r\n<br>\r\n“After this coffee takes hold it always cleans me out and I haven’t taken a good dump in 2 days.” He held me up and continued “Yup, these bindings should no nicely.” He then carried me to the bathroom and secured me to the opening in the hold of the seat. The string was secured to the seat section that lifted up and down. There was enough give in the string that I sagged down a bit into the opening. He lowered the seat and looked down at me as his stomach began to rumble. <br>\r\nI was totally helpless, unable to move. <br>\r\n<br>\r\nHe left the bathroom and returned to the kitchen to finish his breakfast. <br>\r\n<br>\r\nI remained there alone…..until……<br>\r\n</span></div></div>",
            "created":1407387600,
            "id":1838574,
            "title":"Strap you into the toilet"
        },
        "1332211211":{
            "choices":[
                "Jimmy",
                "Butch"
            ],
            "content":"<div class=\"\"><div> <span>Butch leaves the bathroom with a cocky smirk as you bob up and down from the elastic strapping you to your punishment. You hear the roaring laughter and random high fiving. \"Bet that little shits sorry for all of his asshole pranks over the years!\" Butch chuckles... \"Yeah just wait till after supper!\" Steve questions, \"Where is the little bugger anyway?\" Butch just grins \"...Hes around, you'll find him later\" You smell the smell of something delicious wishing you were regular sized to enjoy it. \"SUPPER GUYS\" Jimmy brings in the Barbequed chicken from the grill and the guys start devouring it. Over the next half hour you are suspended while the guys talk about all of the fun things they're going to use you for. You hear the plates being tossed carelessly into the sink. A loud burp comes from one of the guys. \"DAM I HAVE TO SHIT!\" you hear faintly from a farther room. \"Yeah dude you reek another deep voice agreed. The stomping got closer as your suspension ropes began to shake. In walks..<br>\r\n</span></div></div>",
            "created":1409461200,
            "id":1849636,
            "title":"Mike entered the Bathroom"
        },
        "1333":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Condom",
                "Cock ring",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these?</span></div></span></div>",
            "created":1409374800,
            "id":1849338,
            "title":"Your Choice"
        },
        "135":{
            "author_id":"engineering",
            "author_name":"Spencer",
            "choices":[
                "The others want a try",
                "Mike trys new things with you"
            ],
            "content":"<div class=\"\"><div> <span>Your body shrunk down to an inch tall. You couldn't believe it, something that would be fiction actually happened to you. Only now you are at the mercy of your friends. You looked up at your friend, Mike. His feet stopped in front of you, then his hand came down and grabbed you.<br>\r\n<br>\r\n\" Well, it looks like it worked,\" Mike said.<br>\r\n<br>\r\nHe held you firmly in his hand. Then he started to squeeze you.<br>\r\n<br>\r\n\" Ow! Stop!\" you yelled.<br>\r\n<br>\r\n\" Shut up, it won't even kill you,\" he said.<br>\r\n<br>\r\nMike then dropped you to the floor. You hit the floor hard and shatter your arm. Pain erupted all over your body. Then your arm felt better, the nano-bots fixed your arm. <br>\r\n<br>\r\n\" That worked well, now lets try this,\" he said.<br>\r\n<br>\r\nMike raised his giant foot over you and lowered onto you. His warm foot pressed you down to the floor. You tried to push up but he was too big.<br>\r\n<br>\r\n\" Don't even try, I am going to crush you like a bug,\" he said.<br>\r\n<br>\r\nAll the others watched and laughed.<br>\r\n<br>\r\n\" Please, don't do it,\" you said.<br>\r\n<br>\r\nThe smell from his foot was terrible, it made you want to gag. Mike pressed down even more and your body smear out underneath his foot. Mike raised his foot and the nano-bots went to work. Soon your were no longer a flat piece of flesh on the ground.<br>\r\n<br>\r\n\" This is awesome,\" one said.<br>\r\n<br>\r\nUnfortunately for you, your day just got longer...</span></div></div>",
            "created":1211173200,
            "id":533972,
            "title":"So small"
        },
        "1352":{
            "author_id":"engineering",
            "author_name":"Spencer",
            "choices":[
                "Cut the bar free",
                "Make you deal with it"
            ],
            "content":"<div class=\"\"><div> <span>Mike looked down at you and smiled, \" We have many more experiments for you yet.\"<br>\r\n<br>\r\nAll you wanted to do was run but you knew you wouldn't be able to escape. Mike bent down and grabbed you. The others kept watching and smiling too. You still couldn't believe what happened but it was very real.<br>\r\n<br>\r\nMike walked over to the table and so did the others. They all sat down and Mike laid you down on the table and held you there. One of the others took out a mouse trap and placed it on the table. Mike picked you up and laid you down on the mouse trap.<br>\r\n<br>\r\n\" I want to see how the Nano-bots react to this,\" Mike said.<br>\r\n<br>\r\nBefore you could react Mike tripped the trap and the arm came down and crushed your hip bone into nothing. Now you were trapped and your legs were going numb.<br>\r\n<br>\r\n\" Ow, help me!!!\" you yelled.<br>\r\n<br>\r\nAll the others laughed at you. Then you body started to tingle. The nano-bots went to work except you were not free. They built your body up around the bar, now the bar was closed in your body and stuck.<br>\r\n<br>\r\n\" Well this is interesting,\" Mike said, \" I guess we are going to have to...\"...</span></div></div>",
            "created":1211950800,
            "id":536808,
            "title":"Mike trys new things with you"
        },
        "13521":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "In a meatball",
                "In the Salad Bowl"
            ],
            "content":"<div class=\"\"><div> <span>The trap was too heavy for you to even get up. You laid there, trapped….like a rat. <br>\r\n<br>\r\nYou could hear Steve rummaging around behind the bar. There was an old tool box there on the shelf. He had been stooped over but then he arose holding a wire cutter. <br>\r\n<br>\r\nYou gulp hard. <br>\r\n<br>\r\nSteve walks over smiling. <br>\r\n<br>\r\nYour hoping he’s only planning on cutting the bar that had grown around you and not planning on taking off your whole leg but your finding out that with these guys anything is possible. <br>\r\n<br>\r\nHe leans down playfully snipping at your leg but no actually getting it. You cry and beg him to stop which only makes the other guys laugh harder. Mike then reached down and places his hand over the top part of you body pressing down and obstructing your view from what they are doing. <br>\r\n<br>\r\nMike says “Go ahead, cut it off”  <br>\r\n<br>\r\nYou wince then hear “SNIP” then another “SNIP”<br>\r\n<br>\r\nThere was no pain. Mikes removes his hand. You look down to see that the bar was cut on either side of you, yet still protruding bout of both sides of you. <br>\r\n<br>\r\nJimmy and Butch lean over the other side of the table. Jimmy holds you down once again now free from the mousetrap. Butch takes a needle nosed pliers and Grips the one end of the rod going thru you and begins slowly pulling it out of you. You feel a weird sensation as it is extracted. <br>\r\n<br>\r\nThe holes on you slowly heal and you get feeling back in your legs. <br>\r\n<br>\r\n“This is SOOOOO awesome” Butch says. There are so many things we can do with him. <br>\r\n<br>\r\nIts getting late and they decide they better start to make something to eat. Jimmy grabs you and uses some fishing line to tie you up then leaves enough on the ends to tie in a knot. You are hung on a nail while they decide what to do for dinner. <br>\r\n<br>\r\nButch head into the kitchen and decides to make them all spaghetti and meatballs. <br>\r\n<br>\r\nThe other finish putting all their belongings away as Butch finalizes dinner. <br>\r\n<br>\r\nThe table set he calls them out. There in the middle of the table is a huge plate of spaghetti, a plate full of huge meatballs, Garlic bread, and a giant salad. <br>\r\n<br>\r\nNo one notices right way but you are no longer hanging on the nail. <br>\r\n<br>\r\nThat’s because Butch as stashed you …….<br>\r\n</span></div></div>",
            "created":1211950800,
            "id":536930,
            "title":"Cut the bar free"
        },
        "135211":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "the sting gives way and you pop out",
                "A fork pics up the meatball your in. "
            ],
            "content":"<div class=\"\"><div> <span>In the kitchen Butch has tied you up with some string from a drawer. You are in a rough ball form. He then takes a gob of hamburger and begins forming it around you. He’s turning you into a meatball. <br>\r\n<br>\r\nThen dropping it into the skillet he begins browning it along with the other meatballs. As they cook they all begin to look alike in the pan. He rolls them about, then begins putting the huge bowl of spaghetti together. The noodles and sauce are tossed together, the then lifts the meatballs and drains the excess oil from them and placing them on the spaghetti. <br>\r\n<br>\r\nHe no longer knows which one you are in. <br>\r\n<br>\r\nThe table is set and the food set on the table. <br>\r\n<br>\r\nMike asks where I got to. Butch replies that he’s sure IM around. Where am I gonna go at my size. They are the only ones that can change me back to normal, if that ever happens. <br>\r\n<br>\r\nThe guys dig in to the spaghetti and forks start plunging into the meatballs. <br>\r\n<br>\r\nYou are still tied up and unable to escape the beefy prison. <br>\r\n<br>\r\nThen…..<br>\r\n</span></div></div>",
            "created":1218603600,
            "id":569487,
            "title":"In a meatball"
        },
        "1352112":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Jimmy",
                "Mike"
            ],
            "content":"<div class=\"\"><div> <span>A fork plunges into the meatball you are in. It is dropped onto the pile of saucy spaghetti. You can hear the clamoring of all the guys as they dig into the meal The clanging of forks on plates and beer bottles being set down onto the table. <br>\r\n<br>\r\nThe moisture of the meatball weekends the string you are bound up by and your hands and feet spring free. You pop battle your way out of the meatball and slap down into the rope like noodles. <br>\r\n<br>\r\nWhen you finally get your wits about you, you look up to see your on the plate of ….<br>\r\n</span></div></div>",
            "created":1242277200,
            "id":691054,
            "title":"A fork pics up the meatball your in. "
        },
        "13521121":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "You are put in his mouth unknowingly ",
                "He sees you entangled and smiles"
            ],
            "content":"<div class=\"\"><div> <span>You are covered in sauce and cheese and blend in perfectly on Jimmy’s plate. He beings taking his fork and spoon and using them to wind up the spaghetti into a ball on his fork. Being part Italian, he doesn’t even have to look to do this. You get battered about on the plate and pushed into the huge mound of noodles. In seconds your buried again. <br>\r\n<br>\r\nYou look up thru the mounds of noodles and watch as he stuffs the fork full of inot his mouth. There is a loud slurping sound as he sucks in the stragglers hanging outside of his mouth. <br>\r\n<br>\r\nThe sound turns your stomach. <br>\r\n<br>\r\nHe chews and talks at the same time. You can see the partially chewed remnants in his mouth then he swallows. <br>\r\n<br>\r\nBefore you know it, his fork and spoon are down at the pile on his plate again. This time as he swirls the noodles, your entangled in them and lifted up as he continues to banter with the other guys. You shout, trying to get his attention. <br>\r\n<br>\r\nThe fork lifts slowly to his gaping mouth. Then……..<br>\r\n</span></div></div>",
            "created":1335848400,
            "id":1327151,
            "title":"Jimmy"
        },
        "14":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "1 foot tall",
                "6 inches Tall",
                "3 inches tall",
                "You Decide",
                "You Decide"
            ],
            "content":"<div class=\"\"><div> <span>Leaning into a duffle bag Butch pulls out a stack of small cups and some  ping-pong balls. All the guys high-fived one another.<br>\r\n<br>\r\n“You in?” Mike asked.  <br>\r\n<br>\r\n“Sure, I gotta be honest though, I’ve never actually played before” <br>\r\n<br>\r\nThe guys laughed. <br>\r\n<br>\r\n“OH don’t worry, this will be a game you will remember for a long time” Mike continued. He diverted Walts attention from the table as Butch set up the cups, the pins on a bowling alley at either side of the long table. What I didn’t know was that Butch was not putting beer in the cups Walt was going to have to drink. Mike continued to explain the rules to him. <br>\r\n<br>\r\n“All set” Butch announced and Walt was directed to one end of the table. <br>\r\n<br>\r\n“Ill let you go first” Butch said as though he was doing me a favor. Walt tossed the ball and it bounced into one of the cups. Butch picked up the cup and downed the beer. The cup was then removed. <br>\r\n<br>\r\nIt was Butch’s turn. He tossed his ball and sank his shot. I picked up the beer and chugged it down. “Hummmmm, tastes funny” Walt thought. <br>\r\n<br>\r\nAll the guys smiled and looked at one another. <br>\r\n<br>\r\nThe game continued and for some reason my tosses were all bouncing all off the rims of his cups. He kept sinking his shots and I had to keep downing my drinks. Funny thing though I was not getting the least bit buzzed. <br>\r\n<br>\r\nDown to the last shot he tossed his ball and kerplunk, in it went. I downed the last beer. <br>\r\n<br>\r\n“Guess I lost” I commented. <br>\r\n<br>\r\n“Dude you have no idea” he said and pulled out a GPS type control looking device. <br>\r\n<br>\r\n“What’s that ?” I asked<br>\r\n<br>\r\n“Oh This? This is just a little device I’ve been working on at the lab. Ya see, that wasn’t beer you were drinking. It was an experimental micro-nanobot solution that was beer flavored” <br>\r\n<br>\r\n“You let me drink experimental chemicals? What the hell?”<br>\r\n<br>\r\nThe then began pressing some of the buttons and typing on the small keypad. He then aimed it at me an a red beam shot me square in the chest. <br>\r\n<br>\r\nI then shrank to….<br>\r\n</span></div></div>",
            "created":1202446800,
            "id":495829,
            "title":"Play Beer Pong"
        },
        "141":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Im shrunk further",
                "Im Made to be their slave",
                "They change me into something else"
            ],
            "content":"<div class=\"\"><div> <span>As my vision clears from the flash I look around to see my now huge buddies all standing around me. I could not be more then a foot tall. <br>\r\n<br>\r\n“Well well, well, who’s the prankster now?” Steve asks. <br>\r\n<br>\r\n“What did you guys do to me ?” I shout as Jimmy bends down and picks me up from under the arms holding me like a doll.<br>\r\n<br>\r\n“Lets just say the next couple days are going to be payback for all those pranks you’ve been playing on us all these years.” He advises. <br>\r\n<br>\r\nI knew this was not going to be good. <br>\r\n<br>\r\nSteve took the remote and told Jimmy to hold me up. Then he shot me again, but this time with a green light. “Hey Jimmy give him a little squeeze” he said. <br>\r\n<br>\r\n“NO DON’T !” I protested, but he ignored me. <br>\r\n<br>\r\nJimmy’s huge hands began to tighten around me. I felt them squish into my body. Waiting for my ribs to crack but the didn’t. <br>\r\n<br>\r\n“Dude, he’s all squish, like putty or a sponge or something.” As he released his pressure my body returned to normal. <br>\r\n<br>\r\n“Yeah with the nano-bots and this remote we can do anything we can do anything we want to him. Make him smaller, shoosh him into a different shape and even freeze him in that shape. That will come in handy if we decide we wanna toss a football around since I forgot my real one at home.” <br>\r\n<br>\r\nI did not like the sounds of this at all. <br>\r\n<br>\r\nThey then decide…….<br>\r\n</span></div></div>",
            "created":1202446800,
            "id":495831,
            "title":"1 foot tall"
        },
        "1412":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "The others wanted a massage too",
                "My size was changed again",
                "They turned me into an object"
            ],
            "content":"<div class=\"\"><div> <span>Steve was making himself comfortable over by the fire and licked off his sneakers and hoisted his feet up onto the ottoman. <br>\r\n<br>\r\nButch lent down and grabbed me. “Hey Steve, how about a foot massage” he asked. <br>\r\n<br>\r\n“Dude I don’t think you wanna be touching these ole dogs. They are nasty being in those tarry old sneakers” he commented. <br>\r\n<br>\r\n“You’re right, I wouldn’t” Butch commented back, “But I don’t think HE would mind” he said lifting me up. “And if he does, who cares we can make him do it anyway” he laughed. <br>\r\n<br>\r\nSteve Smiled.  “Toss him over” <br>\r\n<br>\r\nWith a swift hurl I was tossed thru the air and caught by Steve like I was little more then a rag doll. He held me arms tight against my body and forced my face down between his sweaty sole he had resting in front of him. The smell was pungent and sour. I struggled as he held my face there then wiped it between his sweaty socks. I was gagging at the horrible smell. <br>\r\n<br>\r\nThen he flipped my body over and I landed with a bounce on the ottoman. <br>\r\n<br>\r\nEveryone laughed at his treatment of me. I however was not amused. <br>\r\n<br>\r\nHis feet out in front of him, and me face to face with them he wiggled his toes. “Get to work Runt.” Afraid not to I began pressing my hands into his soles thru the thick wet cotton socks. <br>\r\n<br>\r\nI knew this was going to be just the beginning of a long next couple days. <br>\r\n<br>\r\nI continued to massage his feet as the other guys milled about the cabin and Steve watched me intently until I was don’t. <br>\r\n<br>\r\nNow covered up to my elbows in his musky sock scent and done with his massage I leaned back and hoped they had had their fill of funning with me but were going to change me back to normal. But that was not the case.<br>\r\n</span></div></div>",
            "created":1202706000,
            "id":497033,
            "title":"Im Made to be their slave"
        },
        "14121":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Groin",
                "Thigh"
            ],
            "content":"<div class=\"\"><div> <span>Mike headed over, carrying beers from the fridge. Standing over me like a man standing over a barbecue, he took a sip. \"So steve, how does this thing go?\" He let out a slight burp as he stood there in a dirty singlet which showed off his dense armpit hair. His tiny shorts left nothing to the imagination, there was many a time I had to remind him to tuck himself back in.<br>\r\n<br>\r\nSteve smiles \"Pretty f'n good mate, you can have next if you like\" to which Mike eagerly agrees \"Oh sweet, I'm pretty tense after football this morning\". He lays down on his back on a sleeping bag on the floor, one leg out straight, the other knee lifted up. \"Get to work runt\"<br>\r\n<br>\r\nSighing, you shuffle over to the extended foot and begin to rub.<br>\r\n<br>\r\n\"WHOA!\" he exclames \"My feet are fine, I want you to massage my.....\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1209445200,
            "id":525879,
            "title":"The others wanted a massage too"
        },
        "141212":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "To comply",
                "To Refuse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"What? NO!\" you protest. The three other guys come around you \"Do it, or face the consequences\"<br>\r\n<br>\r\nIn sheer anger you stare at them and decide</span></div></span></div>",
            "created":1209445200,
            "id":525886,
            "title":"Thigh"
        },
        "1412121":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Pushes the dick in your mouth",
                "Lets out a ripping wet fart right in your face"
            ],
            "content":"<div class=\"\"><div> <span>Not liking the idea of consequences, you shuffle over to Mike, who is laying on the ground in his tiny shorts.  Sliding between his legs, Your shoulder rests under his knee. You go to work massaging the tight muscle. You can feel the wirey hairs rubbing against your face and neck as he stretches his arms out beside him. \"Oh this is great. You need to head a little higher though\"<br>\r\n<br>\r\nYou close your eyes, look away and begin to move your hands closer to the waist of the man. Kneading into the tight knots, you almost gag as he lets out a pleasurable moan. You feel your fingers brush the material of the shorts.  You stop moving south and massage the massive thigh where you are. Looking down you notice Mike has his eyes firmly planted on you, you're not getting away as long as his crooked smile stays on.<br>\r\n<br>\r\nBeside you, the other leg curls up \"Now do the other one,\" he grins. Sure enough you do the same, starting off at the knee and moving to the shorts line.  As you reach the tiny material, Mike sits up \"Hey, Check this out\" His hand hooks the leg of the shorts, pulling on it. You feel sick as you see his dick and balls flop out, inches away from you.<br>\r\n<br>\r\nInstinctively you jerk away, but mike is too quick. The thighs beside you pin your body in place. The pain is excruciating. Tears begin to well as you chant \"nonononononono\" as mike holds his shorts open. His cut cock hangs ominously, before giving a slight, horrifying twitch. You struggle against the hairy thighs, but they are too strong. With his free hands, mike grabs the back of your head. Grinning in pleasure he pulls you face down till the tip of the flaccid penis nuzzles your nose, your chin resting on the ground.<br>\r\n<br>\r\nMike bites his lip as he</span></div></div>",
            "created":1209618000,
            "id":526471,
            "title":"To comply"
        },
        "14121212":{
            "author_id":"easycans",
            "author_name":"CanCans",
            "choices":[
                "Shrink you further and sit on your tiny form for more fart torture. ",
                "Use your face as a sweat rag to clean their rank pits",
                "Shrink you down and see how long you can hold up Mike's balls"
            ],
            "content":"<div class=\"\"><div> <span>Mike grabs your hair and shoves your face into his jungle of an ass. It is hell, the hairy forest tickles your face while the fetid odor burns your lungs. As he pulls you closer, your nose touches his greasy, winkled anus. The anus flexes against your nose as it makes contact. Soon you hear a rumble emanating from the massive man. Know what is about to happen you begin to struggle with all of your might. You reach around and try to pull his hands off, you use your legs to kick his meaty thighs. However no matter how much you fight, the massive man has you trapped in his rancid ass. You hear him chuckle briefly before the anus contracts back. Soon a massive fart is unleashed directly on your prone face. You began screaming as the fart is happening, the vibrations only causing Mike to laugh. Soon you have to take the first breath. Immediately you start to gag and choke. The terrible odor is a mixture of fermentation, sewage, and egg. The horrible concoction burns causes your eyes to water. The smell so bad you can partially taste it. After a bit of time a few more minor farts are shot directly into your nose, however it seems that Mike is empty. Releasing you from your prison, the guys decide to...</span></div></div>",
            "created":1524119040,
            "id":2481577,
            "title":"Lets out a ripping wet fart right in your face"
        },
        "1412122":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Pulls his underwear off too",
                "Lets out a ripping wet fart"
            ],
            "content":"<div class=\"\"><div> <span>\"No way I am doing that,\" you protest\"Do what you want but Im not a slave.\"<br>\r\n<br>\r\nButch grabs you immediately \"Oh I think you'll find you are!\"<br>\r\n<br>\r\nMike stands up \"Time for punishment little guy\" He smiles, flicking your nose. He bends over to pick up the sleeping bag he was on, his hairy ass pokes over the top of his tiny shorts.<br>\r\n<br>\r\nUnceremoniously, Butch dumps you into the bag as it is held up. With a thud you land on the ground. Looking up, you see all your friend's faces peering into the bag.<br>\r\n<br>\r\nMike has a huge grin as the bag is carried over to the bed. Mike cant help but laugh as he slides one leg into the sack. As he lays down, he slides the other in. With a quick jolt he enters the bag, his feet kicking you in the process. The smell of them is horrible, you cough and gag, which only amuses your buddies more.<br>\r\n<br>\r\nOutside the bag, the others are laughing as they see your form struggling against the hairy feet. They watch as you try to climb out of the bag, only to be stopped by Mike's body sliding in your way. You try three times to no avail.  You cannot see what is happening in the darkness, but it can't be good because the guys are laughing harder.<br>\r\n<br>\r\nOutside the sleeping bag tomb, the giant friends roar in vicious laughter as Mike's hands descend into the bag. After a few short kicks, they return out, with his shorts in hand. With tears in his eyes,he drops the shorts to the ground beside the bed.  The laughter only increases as Mike lifts his waist up and...</span></div></div>",
            "created":1209531600,
            "id":526064,
            "title":"To Refuse"
        },
        "14121221":{
            "choices":[
                "They all fart",
                "They all roll over."
            ],
            "content":"<div class=\"\"><div> <span>Mike pulls off his underwear. He says, \"C'mon guys, join me!\" The rest of the guys take off their underwear and slowly join Mike in the sleeping bag. You are now 3 inches and smell disgusting. You can't see anything, but you feel you are being rubbed between something. \"Hey Guys! I feel something between my ass cheeks,\" says Mike. He farts, and the guys all cracked up. You are being squashed between four naked guys. Suddenly...</span></div></div>",
            "created":1230699600,
            "id":627170,
            "title":"Pulls his underwear off too"
        },
        "14121222":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Have mercy and let you out, but gives you to another guy",
                "Keeps you in there and decides if he wants to make you smaller"
            ],
            "content":"<div class=\"\"><div> <span>The guys see the look on his face as though he’s concentrating on something and they all know what. He smiles a curled lip smile as they hear the flapping of his ass cheeks. Mike has you pinned beneath his feet. You are only 1 foot tall but at least you are pliable. His feet sink into you, one across your chest, the other across your stomach. He’s holding you down. The smell in the sleeping bag is horrible. It is a bag he uses to camp outside, so it is insulated and thermal. The heat from both your bodies increases the scent of his nasty fart. <br>\r\n<br>\r\nBut he’s not done yet. He then reaches down and removes his underwear dropping them on your face. You cringe as the wet spot lands right over your nose and mouth. You try to shake it off but cant. He then squats down and lets two more rip. Steve brings over a bungie cord and mike uses it to secure the bad around his waist like a belt. You are definitely stuck. <br>\r\n<br>\r\nThe other guys are even gagging at the thought of being trapped in there. <br>\r\n<br>\r\nMike then decides to…….<br>\r\n</span></div></div>",
            "created":1209618000,
            "id":526618,
            "title":"Lets out a ripping wet fart"
        },
        "141212222":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "puts on his slippers",
                "takes you out and gives you to another to play with"
            ],
            "content":"<div class=\"\"><div> <span>Mike motions for Steve to toss him the remote. Once in his hands he sets new size dimensions then presses the enter button. His feet still on you, you feel yourself pulling into the center. The bottoms of his feet scrape across your body. He has shrank you from 1 foot tall to a mere 3 inches. <br>\r\n<br>\r\nHe laughs and then feels for you with his feet. Finding you, he positions his right foot over your body and presses down. You are face down into the sleeping bag, your back against his foot. He presses as hard as he can, feeling you flatten under him. <br>\r\n<br>\r\nMikes enjoying the control he has. <br>\r\n<br>\r\nUntying the bungee he lets the sleeping bag drop to his feet and steps out. <br>\r\n<br>\r\nThe guys all look expecting you to crawl out of the bag, but nothing happens. Jimmy comes over and looks in the bag. The lingering smell from the farts still radiates from the bag. He gags and coughs. “He’s not in there” he says. <br>\r\n<br>\r\nMike says “No shit, he’s here” and lifts his foot reveling your flattened body on the bottom of his bare foot. <br>\r\n<br>\r\nThe guys practically roll over laughing. <br>\r\n<br>\r\nButch tosses mike his socks and he sits down and puts them on. Right over you. <br>\r\n<br>\r\nYou cant believe his doing this. <br>\r\n<br>\r\nHe gets up and starts walking Your faces pressed down into the musty smelling sock material. <br>\r\n<br>\r\nMike begins stomping his feet on the ground and laughing. <br>\r\n<br>\r\nYou wonder how long you will have to endure being stomped on by your best friend. <br>\r\n<br>\r\nHe…<br>\r\n</span></div></div>",
            "created":1214888400,
            "id":550509,
            "title":"Keeps you in there and decides if he wants to m..."
        },
        "1412122221":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Humilate you more",
                "Watch a movie, put their feet up and relax"
            ],
            "content":"<div class=\"\"><div> <span>Mike reaches down into his duffle bag and pulls out an old pair of bedroom slippers. The fake wool on the inside is all dirty and matted down. You recognize them. You bought them for him like 3 years ago for his birthday. <br>\r\n<br>\r\nYou are now flattened under his foot and stuck to his sock. He begins to put on the slipper but then get a better idea. <br>\r\n<br>\r\nHe pulls the sock off and it turns inside out in the process. He then puts it back on. You are now being pressed between his sole and the sock, he then slips the slipper on his foot, wiggles his toes and sighs. <br>\r\n<br>\r\nHe leaves you there while he and they guys decide what to do next……<br>\r\n</span></div></div>",
            "created":1218603600,
            "id":569496,
            "title":"puts on his slippers"
        },
        "14121222211":{
            "author_id":"musicboy1",
            "author_name":"musicboy",
            "choices":[
                "Mike puts on footy pajamas, sealing you in for a good night's sleep.",
                "Mike wants to have a stomping contest with you still trapped under him."
            ],
            "content":"<div class=\"\"><div> <span>Mike says \"Ok guys, so he's under the sole of my sweaty foot, and covered with my sock and slipper. Think that's enough humiliation for him? haha.\"<br>\r\n<br>\r\n\"No man!\" says Jimmy. \"We gotta heat up his living situation for the night, put on a few more socks, THAT will torture him!\"<br>\r\n<br>\r\nThe other guys laughed at your pitiful situation as Mike took off the slippers and put 3 more socks over the first, which applied more pressure and made your home full of sweat and heat.<br>\r\n<br>\r\nHe stuffed his feet into his slippers again, kicked back on the couch and propped up his feet towards the fire.<br>\r\n<br>\r\nYou were in hell as the heat and the amount of layers that were sealing you to his giant foot were causing you pain and humiliation. \"At least he's not putting weight on his foot,\" you thought.<br>\r\n<br>\r\nTwo more hours of went by of the guys relaxing by the fire and laughing over today's events that involved you.</span></div></div>",
            "created":1395378000,
            "id":1764420,
            "title":"Humilate you more"
        },
        "14121222212":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "are snatched from sleeping mikes slipper",
                "Its morning and your going fishing with the guys"
            ],
            "content":"<div class=\"\"><div> <span>Mike catches them and sits in the recliner and drops the slippers to the floor. He then slips them on. “mmmmmm yeah.” He says. <br>\r\n<br>\r\nFrom inside the sock you remember the familiar scent that you would catch while at mikes house. You know what he just put on and the heat inside was building quickly. He then pushes back on the recliner and lifts the footrest. His feet now pointing at the fire. He sighs in a relaxed tone. “If I fall asleep, just wake me up early enough to go fishing.” He says. <br>\r\n<br>\r\nYou struggle under this sole not that you would be able to go anywhere. <br>\r\n<br>\r\nYou……<br>\r\n</span></div></div>",
            "created":1242277200,
            "id":691056,
            "title":"Watch a movie, put their feet up and relax"
        },
        "14122":{
            "author_id":"joel34",
            "author_name":"Joel34",
            "choices":[
                "Get the beers and hope no-one else notices",
                "Too late, someone already has an idea"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright runt, You also have to be beer wench tonight\" steve smiles as he grabs the remote. After a few button presses I feel myself growing to a height of 3 feet. Not perfect, but a lot better.<br>\r\n<br>\r\nThat was until i realise something, As I went to walk to the fridge to get the beers, Butch was standing up. Directly in line with me was his enormous groin. Looking around, i realised I was groin level with all my buddies...this was not going to end well. Looking up at Butch's face it dawned on me that he had made this realisation too..</span></div></div>",
            "created":1209445200,
            "id":525878,
            "title":"My size was changed again"
        },
        "141222":{
            "author_id":"markgabegore33",
            "author_name":"Mark",
            "choices":[
                "Accept and get Mark his coke",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>A young boy stepped into the house. Jimmy shouted \"Yo Mark. Remember that prankster who ruined your elect-.\" Mark had already noticed you. \"Jims, pass.\" Mark caught an extra wraistband. \"It's payback time. Pass me a coke.\"</span></div></div>",
            "created":1499303340,
            "id":2347966,
            "title":"A new Torturer"
        },
        "1412222":{
            "author_id":"markgabegore33",
            "author_name":"Mark",
            "choices":[
                "You wake up with Mark and his bro, Jimmy's friend surrounding you."
            ],
            "content":"<div class=\"\"><div> <span>You nodded your head no. Immediately after, Mark shrunk you to an inch again and immediately got a torture plan. \"Jims, I know a good burrito shop. Steve, tie him up to the bed. Butch and Jims, get in the car. We're going to the burrito shop and getting takeout. Sayonara, Walt.\" Mark slowly knocked you out using the watch. Jimmy said. \"I didn't even know they could do that.\" Mark replied \"My technological prowess knows no bounds. I've already pushed it onto all of your watches. Think of it as Walt having too much beer.\" That was the last thing you heard before you passed out.<br>\r\n</span></div></div>",
            "created":1499303880,
            "id":2347969,
            "title":"A torturous plan"
        },
        "14122221":{
            "author_id":"markgabegore33",
            "author_name":"Mark",
            "choices":[
                "A hockey puck",
                "A basketball"
            ],
            "content":"<div class=\"\"><div> <span>Mark and his friends were surrounding you when Walt woke up. Mike said \"So Mark. Let me get this straight. You want us to Dutch oven him- Mark interrupted \"He didn't pass me a coke.\" Mike then said \"I have no qualms.\" All of them started to turn around and pull down their boxers. Mark said \"Bombs away\" They all started to release a endless torrent of smelly farts all at once. After 30 seconds, the torture ended. Mark then knocked you out again as a act of mercy. Jimmy said \"What the hel- oh. You've got a wicked idea.<br>\r\nWhen you woke up, Mark said to his bro and friends \" Jims, Michael, Butch and Steven we're going to play a sport. What shall we make him.</span></div></div>",
            "created":1499304420,
            "id":2347972,
            "title":"Fart Frenzy"
        },
        "141222212":{
            "author_id":"markgabegore33",
            "author_name":"Mark",
            "choices":[
                "Shrinking you, increasing your smell and put you in Mark's butt."
            ],
            "content":"<div class=\"\"><div> <span>Mark changed you into the size of the basketball and did something unexpected. He put you in his butt and let off a fart that could have woke the dead. Jimmy and his friends were laughing too... When Mark got a text. Mark got off your face and talked to Jimmy. Mark cheerily said \"Hey Jimster. We're out of school... permanently due to it closing down.\" Jimmy then walked over to you and released an SBD... Bare naked. Bad news was... It was in Mark's tent. The others were rolling on the floor laughing. Mark said \"Well, mom and dad were murdered. Walt's brother did it... So why not torture Walt more in payback? But what should we do???\" Jimmy got the idea of...</span></div></div>",
            "created":1499561280,
            "id":2350005,
            "title":"Farted on as a basketball"
        },
        "1413":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "lay me on the floor and step on me",
                "put me on a chair and sit on me",
                "fold me into a \"paper\" airplane"
            ],
            "content":"<div class=\"\"><div> <span>Steve took me over to the bar and told me to lay down. I didn’t want to and resisted. He grabbed me and forced me down to the bar surface. Reached under the bat to a shelf he pulled out what looked like a rolling pin. He pressed it down into my stomach. My head and fee lifted form the pressure. <br>\r\n<br>\r\nAn evil grin spread across his face as the other guys walked over to see what he was doing to me. Steve began pressing and rolling my body out. I protested as my body was pressed one way, then the other. My body was a rough square shape. My head still “3-d” He then pealed me up and laid me on my stomach, then tilted my head back. It rested on the back of my shoulders. He then started at my neck and rolled my head flat onto myself. I could no longer speak. But could see and hear everything. <br>\r\n<br>\r\nMike grabbed the remote and pressed “Pause” I froze in that shape. I looked kinda like a placemat. <br>\r\n<br>\r\nJimmy reached over and held me up. My body was thin and floppy. <br>\r\n<br>\r\nThey decide to……<br>\r\n</span></div></div>",
            "created":1210827600,
            "id":532053,
            "title":"They change me into something else"
        },
        "14131":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "They go fishing and take me along",
                "They go Hiking and take me along"
            ],
            "content":"<div class=\"\"><div> <span>I’m carried over to the door and laid on the floor in front of it. They lay me there like a rug. Mike laughs saying “Good Idea we need something to wipe our feet on when we come in from outside.” <br>\r\n<br>\r\nI can do nothing but look up. Up at all the guys staring down at me. <br>\r\n<br>\r\nSteve walks over with a beer for each of them and suggests going out on the front porch to relax as it’s a nice night. All the guys agree and the door swings open over me. Then, one by one they step on me on their way out of the door, some of the pausing to take the opportunity to step firmly on my face. The door was pulled closed behind them. I was left to lie there. <br>\r\n<br>\r\nAfter a while I heard a strange noise on the roof. It was raining. I heard the guys laughing. No doubt about what else they could do to me. I lost track of time and was snapped back into reality as the door swing open again. I looked up to see Jimmy standing there holding his flip-flops. He lifted his foot over my face for me to see that he had been out walking I the mud. He stepped forward and wiped his feet right on me. <br>\r\nThen one by one they all came in doing the same. Some on my face, some on my stomach but all making sure their feet and shoes were clean when they were done with me. <br>\r\n<br>\r\nThen they kicked off their shoes, that were still wearing any, and they headed in to get ready for bed. They left me there to dry with mud chunks all over me for the night. <br>\r\n<br>\r\nI heard them talking about what they wanted to do the next morning. Some wanting to fish, some to dirtbike, other to hike. <br>\r\n<br>\r\nI could only imagine what any of those meant for me. <br>\r\n</span></div></div>",
            "created":1242277200,
            "id":691084,
            "title":"lay me on the floor and step on me"
        },
        "141312":{
            "author_id":"john91043353",
            "author_name":"Duke of Parr",
            "choices":[
                "The guys heads towards a small lake in the forest",
                "Time to go climb some hills"
            ],
            "content":"<div class=\"\"><div> <span>The guys’ chatter faded to whispers. Whatever they were planning for me, I realised that it must be truly horrific. Eventually even the whispers silenced and instead were replaced by loud and heavy snores. I couldn’t sleep that night. I was lying awake fearing what would happen the next day. If I knew the guys, and I did, they wouldn’t settle with turning me into their doormat.  <br>\r\n<br>\r\nThe sun rose, and the morning come. The snoring abruptly ended inside one of the bedrooms, and seconds later Steve appeared in the doorway. When he saw me, he couldn’t help but to grin. <br>\r\n<br>\r\n“The guys and I decided yesterday to go hiking today,” he informed me cheerfully. “We decided not to take you along at first.” He paused. I couldn’t believe my ears. They wouldn’t take me with them to torture me? After a few seconds of dramatic effect, Steve continued. “But guess what, today is apparently your lucky day. You see, I seem to have misplaced my clean underwear. Good thing we have some perfect cloth to make new ones of.”<br>\r\n<br>\r\nI tried to understand what the hell he was talking about. Maybe I was a bit dim-witted, but at that moment I didn’t understand what he meant with what he was saying. <br>\r\n<br>\r\nSteve picked me up and carried me to the bathroom. He washed the mud off of me, and put me on a towel hanger to dry. He disappeared to go and grab breakfast with the other guys. When he reappeared I was once again dry. <br>\r\n<br>\r\n“The others are getting impatient, so we gotta hurry.”<br>\r\n<br>\r\nAt this point Steve pulled out a huge sewing needle and some thread. After pressing the pause bottom again to make me more workable, he grabbed me in his left hand and the needle in his right. It was first when the needle pierced my body that the connection between me and Steve’s missing underwear became obvious to me. He was going to sew me into a pair of underwear. I would have screamed, but I still couldn’t make a single noise due to my flat condition.    <br>\r\n<br>\r\nWhen Steve has finished the work, he carries me out to the hallway were the other guys are getting ready for the hike. As Steve held his new boxers above his head to show them of the other guys started to cheer clap, and laugh.<br>\r\n<br>\r\n“Man he’s so gonna enjoy this,” Mike exclaims in a slightly sadistic tone. <br>\r\n<br>\r\nSteve stripped out of his other dirty pair of grey briefs. He was holding me so I could see his whole naked glory. He was hung like a horse. Then he did something unexpected. He flipped me inside out. Then slowly he started to slip me on. He was holding the waistband out so that I could see myself going up his legs. Suddenly I was face to face with his giant cock. Steve looked down on my face and chuckled. He then let go of the waistband, so that my face smacked right into the shaft of his penis.<br>\r\n<br>\r\nTwo minutes later Steve was completely dressed, and the boys were heading out into the wilderness on their hike. <br>\r\n</span></div></div>",
            "created":1249966800,
            "id":742727,
            "title":"Preparing for the hike"
        },
        "1413121":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "use me as fish bait making me indistructible",
                "puts me inside his nasty smelling water shoe"
            ],
            "content":"<div class=\"\"><div> <span>Out the door we go. Steves balls slapping in my face as he walks. He was beginning to sweat and grabbed himself to adjust his package to one side. Before he left the cabin he grabbed the remote just in case they would want to have some fun with me at the lake. <br>\r\n<br>\r\nIt was a one mile trail walk to the lake. Once at the end of the trail the path opened up to a huge beautiful lake. In the distance they saw a trout jump out of the water and snatch up a bug flying just above the waters surface. <br>\r\n<br>\r\n“Awesome Lake Dude !” Mike commented. <br>\r\n<br>\r\nThere was a small dock, two small row boats and a picnic area. The guys dropped their gear and got situated. Steve said he wanted to go fishing, as did some of the other guys. Jimmy said he would stay behind and see about getting a camp fire started in the fire pit. <br>\r\nI could feel myself being rubbed and grinded into his crotch. His hairy balls rubbing all over my face. Finally all the fishing gear in the boat he got in. I felt him sit down. As Steve squeezed his legs together I got a strong whiff of his musky scent. <br>\r\n<br>\r\nThey rowed out about 2 hundred yards and got ready to fish. I thought he had forgotten about me until I head a rumbling and then he let out a loud fart. It was nasty. The guys just laughed as it was loud enough for them all to hear. <br>\r\n<br>\r\nSteve stood up and dropped his pants ands revealed me. He then pulled me off as the other guys geared him telling him to put his pants back on, which he did. Commando. <br>\r\n<br>\r\nUsing the remote he changed me back to human form but I was reduced to about 2 inches in height. <br>\r\n<br>\r\nHE decided to…….<br>\r\n</span></div></div>",
            "created":1250139600,
            "id":743805,
            "title":"The guys heads towards a small lake in the forest"
        },
        "14131212":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Im kept in his shoe",
                "Im taken out for some more \"fun/humiliation"
            ],
            "content":"<div class=\"\"><div> <span>Steve was wearing a pair of Speedo mesh water shoes. They didn’t look that old but he commented that he has had them for years. He wiggled his toes from inside and being a material that hugged his foot, was easy to see the movement. <br>\r\n<br>\r\nJimmy questioned, “Those aren’t the same ones that you had when we went to the shore 2 years ago are they?”<br>\r\n<br>\r\nSteve replied “Yeah, why” He chuckled knowing why Jimmy was asking. <br>\r\n<br>\r\n“Dude those things stank up the whole bungalow that weekend.” Jimmy retorted. <br>\r\n<br>\r\nSteve then pulled his right one off and sniffed it. “Yup these are them and still not any better.” He coughed a little. He then looked at me in his other and asked “What do you think? He said and held me down into the nasty black footwear. <br>\r\n<br>\r\nI began struggling trying to escape the smell and sweat soaked insole as his finger effortlessly held me down against it. All the guys laughed. <br>\r\n<br>\r\n“That’s cold dude !” mike laughed. <br>\r\n<br>\r\n“Ill give ya $5 if you drop him inside and wear it all afternoon.” Mike offered. <br>\r\n<br>\r\n“HEY !!! Mike that’s not funny !!! Come one guys stop this!” I was ignored. <br>\r\n<br>\r\nSteve replied. “Make it $10”<br>\r\n<br>\r\n“Deal” <br>\r\n<br>\r\nSteve let his finger up off of my back but proceeded to tilt the water shoe toe down and I rolled deep within. I could see shadows thru the finely meshed material then turned to see his huge foot entering in. Within an instant I was pinned against the interior wall. After allowing the back snap against his heal, he set his foot on the ground. <br>\r\n<br>\r\nThen as if nothing happened, he said. “OK who wants to go out in the boat and do some fishin??”<br>\r\n<br>\r\nHe then started walking with me in his shoe while the other guys laughed. <br>\r\n<br>\r\nMike replied “Ill head out with you” and grabbed the rods and tackle box and headed to the boat. Once in Steve said he would cast them off and pushed the boat into the water. Problem was he was walking in and I was in his shoe !!! The cold smelly water filtered into the shoe mixing with his foot sweat and then once clear he hopped inside the boat too as Mike paddled out into the lake. <br>\r\n</span></div></div>",
            "created":1251867600,
            "id":754334,
            "title":"puts me inside his nasty smelling water shoe"
        },
        "141312121":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Use the jar to spit their chew tobacco in. ",
                "let me roll around the floor of the boat while they fish"
            ],
            "content":"<div class=\"\"><div> <span>Steve is a power junkie and the sheer feeling of having me under his toes, trapped in his shoe was exactly what his already bloated ego asked for. The adrenaline rushed thru him. <br>\r\n<br>\r\nMike Paddled the boat out from shore as Steve arranged some of the fishing rods and supplies. Once out to the right spot they dropped anchor. The whole time Steve’s toes clenched and clutched around me as he moved. I half think it was reflex and not intentional but either way it was getting him excited. Being the jock he is he had no shirt on, allowing his solid plate sized pecs to be exposed. The shorts he was wearing were nylon knee length basketball type shorts. His body betrayed him in keeping his power trip a secret. The tent he was pitching in hi shorts was clearly evident. When Mike turned around to get the tackle box on the floor between Steve’s feet he almost poked his eye out. <br>\r\n<br>\r\nSteve was only partly embarrassed. He commented, “That’s your buddies fault.” <br>\r\n<br>\r\nMike just looked up at him. <br>\r\n<br>\r\nSteve said, “I may have to rub one off get that bad boy down.” <br>\r\n<br>\r\nSurprisingly Mike replied “Go a head.”<br>\r\n<br>\r\nSteve smiled and dropped his drawers and spit in his hand. He stretched his legs out and curled his toes wanting to feel me there as he vented his built up anxiety. Needless to say it didn’t take long. As he was just about to blow Mike handed him a small jar and said, “Shoot in this, I have an idea” Steve grabbed it and blew his entire load into.<br>\r\n<br>\r\n“Impressive” Mike said. <br>\r\n<br>\r\nSteve collected himself together again and washed his hands off over the side of the boat. <br>\r\n<br>\r\nMike then told Steve to take off the water shoe. He did and I slide down into the heal section. I gasped and panted from the ordeal. Mike then tilted the shoe and dropped me out…..right into the jar Steve just jacked off into. I landed with a splat. Then Mike screwed on the lid. <br>\r\n<br>\r\nI got to my feet and pounded on the glass wall. “LET ME OUT OF HERE !” <br>\r\n<br>\r\nThe two giant faces just laughed at my antics. <br>\r\n<br>\r\nThey decided to…..<br>\r\n</span></div></div>",
            "created":1270789200,
            "id":865062,
            "title":"Im kept in his shoe"
        },
        "1413121211":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "Use me as Bait",
                "head back to shore to torture me there"
            ],
            "content":"<div class=\"\"><div> <span>From inside the jar I could see them pulling out a small pouch and pinching their fingers inside. They pulled out some stringy brown stuff that looked like dead grass or something; I then realized it was chewing tobacco. <br>\r\n<br>\r\nMike and Steve each put a wad of chew into the pockets of their cheeks. <br>\r\n<br>\r\nI was kept in the jar with Steve’s spooge while they fished until I saw them looking around. Then Mike spied the jar and reached down. He unscrewed the lid and held it up to his mouth then spit out a huge gob of tobacco spit. It landed right on me. It was disgusting and the site of me covered in the brown goo made him laugh. <br>\r\n“You need to spit Steve?” he asked. <br>\r\n<br>\r\n“Yeah, actually I do,” he replied. “But lets check out my aim, just tilt the jar from over there.” <br>\r\n<br>\r\nWith that being said Mike tilted the jar which made me loose my footing and I slid down into the foul muck. I saw Steve taking aim and he spit. It flew, in a formed wad thru the air and mike moved the jar so it would splat right inside. Again, direct hit. <br>\r\n<br>\r\nI yelled in protest. Mike just swirled the jar and relished in the torment he was inflicting on me. I fell and as I gasped got a mouthful of the now thickening liquid. <br>\r\n<br>\r\nThe jar was then set on the boat floor, with no lid between their feet while they continued fishing. <br>\r\n<br>\r\nAfter about 45 minutes of not even the slightest bite they decided to…..<br>\r\n</span></div></div>",
            "created":1335848400,
            "id":1327141,
            "title":"Use the jar to spit their chew tobacco in. "
        },
        "14131212111":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Turns me into a worm",
                "Turns me into a lure",
                "Leaves me human but makes it so I can breathe under water. "
            ],
            "content":"<div class=\"\"><div> <span>“Man, we haven’t gotten a single bite since we got here.” Steve complained. “Maybe we are using the wrong kind of bait.” Mike suggested. They both argued over which of the baits they where using was better, when Steve’s foot almost knocks over the jar I’m stuck in. Both Steve and mike look down. At the jar for a few moments before the both grin and say “Walt bait!” <br>\r\n<br>\r\nMike snatched up the jar, and shakes it around till I’m near the opening, then takes me out. They squirt me with a water bottle to clean me off. Steve uses the remote to make me 4 inches tall. Mike reels his line in and grabs his hook and prepares to attach me to it. Steve looks at the remote and...</span></div></div>",
            "created":1541251800,
            "id":2572416,
            "title":"Use me as Bait"
        },
        "14132":{
            "author_id":"jackc3321",
            "author_name":"Peace0utDude",
            "choices":[
                "Steve",
                "Mike"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jimmy laughs and says..<br>\r\n<br>\r\nok boys... who wants to sit on him first?</span></div></span></div>",
            "created":1212469200,
            "id":539789,
            "title":"put me on a chair and sit on me"
        },
        "141321":{
            "choices":[
                "Steve Grips His Wasteband",
                "His stomach begins to rumble"
            ],
            "content":"<div class=\"\"><div> <span>Steve chuckles wiping the sweat from his forehead. \"It's so fucking hot out, HAHA I might have to take a seat on the little runt!\" Jimmy hands Steve the remote and he scrolls through the commands. \"Fragile...nah...Mooshy...hmm... Pliable...hmm... \" You begin to beg. From the chair you have no where to run and if you did you would never get back to normal size. You can only stare up at Steve and Jimmy as they smirk down at the controller then at you. Their massive hands pawing through the settings. \"PLEASE GUYS! PLEASE I\"VE BEEN THROUGH ENOUGH! JUST CHANGE ME BACK! YOU HAD YOUR FUN! c'mo...\" Steve continues swipe through the remote ...invisible...eh..transform.....oh MUTE!! Ahaha that's useful.\" Steve quickly taps the button peering down at you as your mouth closes mid plea. \"Hehe there we go I knew <i>bugs</i> didn't talk!\" You try to scream but nothing comes out. Steve turns around his massive red basketball shorts eclipsing your view. Jimmy encourages Steve as he pulls up a chair parallel to Steve. \"Ahh Have a seat mate, its been a long day. Steve hands the remote back to Jimmy and he presses \"STILL\" on the remote and you freeze unknown to Steve. You panic laying still unable to move as Steve's massive warm ass gets closer and closer it stops right before you.... Jimmy and Steve exchange glances as Steve mouths the words \"Should I?\" out of smirking lips. You panic even more not knowing what your two giant domineering friends are planning for you.</span></div></div>",
            "created":1401512400,
            "id":1805002,
            "title":"Steve"
        },
        "14133":{
            "author_id":"blacklance",
            "author_name":"TheStorm",
            "choices":[
                "Crash land in the waste basket by the door. They leave you in there.",
                "Crash land in the waste basket by the door. They take you back out."
            ],
            "content":"<div class=\"\"><div> <span>The guys all laughed as Jimmy slowly twirled me around in a circle in front of them.<br>\r\n<br>\r\n\"Well guys, what do you think we should do with him?\" Jimmy asked everyone<br>\r\n<br>\r\n\"I had something in mind when I rolled him out flat.\" Steve said as he swiped me out of Jimmy's hand. <br>\r\n<br>\r\n\"Okay lets see what you got for the little flat guy haha.\" Jimmy looked at me while laughing.<br>\r\n<br>\r\nSteve quickly set me back down on the bar and ran his hands over me making sure I was flat and square. I looked up unable to move or speak as the other guys came up behind his shoulder looking down at me and smirking as Steve began grabbing my edges and folding me. Again and again I moved up and down my vision going back and forth as they laughed at whatever Steve was doing to me.<br>\r\n<br>\r\nMike barked out a laugh \"Haha look at that, he makes a great little paper airplane. He's worth about as much.\"<br>\r\n<br>\r\nSteve reached a thumb and forefinger down and grabbed me and held me up for all to see. \"Well guys, lets see how he flies shall we?\"<br>\r\n<br>\r\nJimmy went to the other side of the room by the door,  \"Toss him over here Steve!\"  <br>\r\n<br>\r\nSteve held me up close to his face and glared at me,  \"You better fly good punk. Or else.\" He then abruptly pulled me back and I went flying towards Jimmy.....</span></div></div>",
            "created":1335330000,
            "id":1322385,
            "title":"Folded and thrown"
        },
        "143":{
            "author_id":"robinh00d1o1",
            "author_name":"lookingupatyou",
            "choices":[
                "The Floor",
                "His Crotch",
                "The Bed"
            ],
            "content":"<div class=\"\"><div> <span>I wake up naked in some type of cloth that surrounds me in the darkness beside the slight bit of light that was peaking through from the top. Making my way out of this cave-like structure, everything hit me I was shrunken. Frozen up i couldn't move because i didn't know what I was going to find when i reach the top. I reached the top finally. And I look up staring at my \"friends\" legs all around me. I see their eyes behind their giant crotch looking down at me all with big smiles. I lay on the ground of what used to be my favorite shirt. I begin to stand up still I here a large rawr coming from way up above me. I tried flipping them off but I guess that only made them laugh more. Embarrassed i was. Butch was looking down at me with the largest smile and eventually Butch bent down to pick me up. He wrapped his meaty fingers around me, i thought about running but ain't no way i was going to outrun any of them without putting myself in harm's way. I couldn't see anything besides Butch's hand and Butch himself. What else i did notice was Butch was boning. Anytime anyone talked it sounded like a rawr coming from all directions. Butch was now standing straight up and i felt like the ground was over a half mile away. Butch than gave me an evil eye and took me to the bedroom. When the door was closed and locked. I heard one word that the rawr didn't block out. \"RUNT!\" Butch said. As he was lowering me down to.</span></div></div>",
            "created":1523144700,
            "id":2476353,
            "title":"3 inches tall"
        },
        "1432":{
            "author_id":"elanston05",
            "author_name":"Elang ",
            "choices":[
                "Butch decides to have a little more fun",
                "Butch shares the wealth "
            ],
            "content":"<div class=\"\"><div> <span>Still stuck in his meaty paw, I began to panic what was going to happen now? Where was I going and that’s when I saw his other hand pull his shorts open and then I dropped. Down into smelly darkness of the front of his underwear. I landed in what felt like thick lush grass, but the smell of heavy must reminded that this wasn’t grass! I had landed in Butch’s pubes, which apparently had never met a pair of clippers before. As kept sliding down, I felt myself gripping a large fleshing pole! Oh my God I am touching Butch’s dick! </span></div></div>",
            "created":1566753420,
            "id":2707633,
            "title":"His Crotch"
        },
        "15":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "1 1/2 feet tall",
                "1 Foot Tall",
                "8 inches Tall",
                "4 inches tall",
                "1 inch tall"
            ],
            "content":"<div class=\"\"><div> <span>Mikes walks out from behind the bar with a bottle of Whisky. <br>\r\n<br>\r\n\"Lets start out with a toast\" he says and begins pouring out shots for each of the guys. With the shot glasses on the table, and his back turned he begins to pour them out. He put a little something extra into yours. <br>\r\n<br>\r\nMike hands them out and raises his glass. <br>\r\n<br>\r\n\"Heres to good friends, good times, and and having some good ole guy fun\"<br>\r\n<br>\r\nYou all raise your glasses \"Cheers\" and drink down the shot of whisky. <br>\r\n<br>\r\nAlmost instantly you feel funny. A burning warm sensation filters thru your body. You know your not a big drinker and that whe whisky will warm you but this was different. <br>\r\n<br>\r\nThe other guys return to looking around the cabin as Mike calls you over. <br>\r\n<br>\r\n\"Hey Walt, did I show you the new invention I was working on for work?\" he asks you. <br>\r\n<br>\r\n\"No, that is it?\" you ask.<br>\r\n<br>\r\n\"It's a new remote controlled nano-technology Im working on for the army.\" he says and pulls out a small electronic device that looks like a personal data assistant. <br>\r\n<br>\r\nYou walk over to the bar stool and sit down. <br>\r\n<br>\r\n\"You ok ?\" He askes. <br>\r\n<br>\r\n\"Yeah, just a little tingly for some reason.\" <br>\r\n<br>\r\n\"OH that means its working\" He replies. <br>\r\n<br>\r\n\"Working ? Whats working?\"<br>\r\n<br>\r\n\"The Nano-probes I put in your drink\" <br>\r\n<br>\r\nHe then uses the PDA and types in some commands. You feel a slight jolt run thru you and you notice everything getting bigger.....and bigger and bigger until your only.....</span></div></div>",
            "created":1202619600,
            "id":496558,
            "title":"Lets make a Toast to having Fun\""
        },
        "152":{
            "author_id":"spudd",
            "author_name":"Spudd",
            "choices":[
                "They continue playing football with me",
                "They Brake and someone uses me to sit on",
                "I'm turned into something else"
            ],
            "content":"<div class=\"\"><div> <span>As you shrink the other guys act as though its not a big deal. Probably because they were told before getting to the cabin what was going to happen to me. They all poured themselves another drink and quickly downed them. Shot after shot they continued until I had shrunk down to about 1 foot tall. I was now surrounded by my “friends” and the liquor was starting to kick in.  They began grabbing for the PDA wondering what else it could do to me. <br>\r\n<br>\r\nMike told them all to relax, that they would have plenty of time to toy with me. The weekend had just started. “How about we toss around a little football in the meantime” he asked and began punching in some commands. <br>\r\n<br>\r\nWithin seconds and before I could even protest I had been turned into a football. I fell to the side and rocked side to side now not having any will of motion any longer. Steve reached down and gripped me, picking me up and planting his open palm over my face. He then slammed his other hand on the other side of me and told the guys its time to go out and get some fresh air. They headed outside. <br>\r\n<br>\r\nSteve spun me around seeing my flat dimpled face looking up. “Dude you look so pathetic” he said and yelled to butch to “go deep” I was then tossed in a long airborne spiral to Butches awaiting hands. <br>\r\n<br>\r\nHe grabbed me then spiked me to the ground. I winced at impact and went tumbling across the grass. <br>\r\n<br>\r\nJimmy Ran by snatching me up and tossed me to Mike. <br>\r\n<br>\r\nNone of them were even looking at me any more. Not as a person anyway. Not even as a person, now a football. Just as a recreational toy. <br>\r\n</span></div></div>",
            "created":1270616400,
            "id":864082,
            "title":"1 Foot Tall"
        },
        "1523":{
            "author_id":"blacklance",
            "author_name":"TheStorm",
            "choices":[
                "Changed into something else.",
                "Keep you in your \"paper\" form for something else.",
                "They stick you inside of an actual newspaper and decide to recycle you."
            ],
            "content":"<div class=\"\"><div> <span>They continue tossing me around and spiking me to the ground laughing all the while at my fate. Finally Steve caught me one final time and held me in his left hand while he wiped his brow with his right.  \"Whew, man it's getting warm out here. Lets take a break for a bit.\" <br>\r\n<br>\r\n\"Good idea. All this tossing around of the ol' Walt-skin is making me tired\" Butch laughed along with all the others. <br>\r\n<br>\r\nThey walked over to the porch and grabbed some drinks Steve still carrying me in one hand and occasionally slamming me into his other hand. Casually just like he would with any other football. <br>\r\n<br>\r\n\"Hey toss me the ball will ya?\"  Jimmy said.<br>\r\n<br>\r\nSteve slung me underhand to Jimmy who roughly caught me between his hands. He held me to his face and said \"Ahh you should do just fine, my feet are killing me.\" Abruptly I'm dropped to the ground and Jimmy places his left foot on me, rolling me back and forth like a foot massager.  \"This is the life huh guys? Tossing the ball around, hanging out on the porch. What else should we do with our little \"toy\"?<br>\r\n<br>\r\nMike slapped his arm and said \"I wish we could turn him into bug spray. These flies are killing me. Guess there's not much we can make him do about that though.\"  By now I'm getting a little dizzy being constantly rolled back and forth on the hard ground under Jimmy.<br>\r\n<br>\r\n\"Wait a minute, who says he can't do anything? I'll be right back.\" Steve said as he got up and walked back into the house. He then came back out with a rolling pin from the kitchen. From under the table I hear him set it down on the table then suddenly his hand fills my field of vision as he grabs me out from under Jimmy and SLAMS me onto the table. He points the Change remote at me and I can feel myself resuming human form.<br>\r\n<br>\r\nSuddenly I find myself able to talk again as my small human form regains itself from the football. \"All right guys this is enough! Change me back to normal now!\"<br>\r\n<br>\r\n\"Hey shut up you\" Steve says as he forces you flat onto the table with his hand. \"Footballs and newspapers don't talk.\"  He keeps you held down with one hand and grabs the rolling pin with his other.<br>\r\n<br>\r\nI fearfully speak up, \"Newspaper? What the heck are you talking abo-\"  my voice is cut off as Steve slams the rolling pin onto me and begins rolling me flat, no longer can I speak. Back and forth I'm rolled flat, seeing and hearing nothing but the guys looking down at me and laughing. Steve picks me up and flips me over SLAMMING me back down again as he rolls me out flat another way. <br>\r\n<br>\r\n\"There, perfect, just like a regular newspaper sheet.\" Steve says as he points the remote at me and hits \"PAUSE\". I am now stuck flattened out to the size of an opened newspaper sheet. He grabs my center and folds me longways, and then folds me over again so that I now look like a normal square folded newspaper. But Steve's not done yet, he now picks me up in both of his hands and begins tightly rolling me up with my \"face\" facing \"out\"  I now fit completely rolled up in his fist. Suddenly without warning I am SMACKED onto the table.<br>\r\n<br>\r\n\"Lol perfect Steve. I guess we can use him to swat some bugs.\"  Jimmy says and all the others laugh.<br>\r\n<br>\r\nSteve smacks me on the table again \"Oops, missed that bug there.\"  Again I am lifted and smacked.  \"Oops missed again guys.\"  I am used as a flat swatter for the entire time they relax on the porch and enjoy some drinks.</span></div></div>",
            "created":1335330000,
            "id":1322393,
            "title":"Rolled and swatted"
        },
        "15232":{
            "choices":[
                "Turn you into a...",
                "Shrink you and have a stomping contest. GODS VS BUG"
            ],
            "content":"<div class=\"\"><div> <span>Hours pass as the guys sit on the porch relaxing enjoying their vacation. You're occasionally used to crush an annoying pest. Your face slamming into the bug, you remember being just that size. Not much you can do about it in your frozen state. The gigantic testosterone filled men enjoying their casual dominance over anything smaller. Steve casually squeezes you in the humid summer air, almost forgetting you're existence. His grip strong, you're moved fast as jimmy goes inside for another drink. He swats Jimmy's ass as he walks into the kitchen. \"OWW! What'd you do that for?\" You face slams into Jimmys round ass, now smelly ripe in the mid day summer. Jimmy looks to Steve annoyed until he remembers the newspaper is you. \"Aha OH! Little shit! Forgot that was you! You like my big ass? haha!?\"<br>\r\n<br>\r\nThe guys chuckle as jimmy disappears to get the drink. They're getting bored of you as a newspaper.</span></div></div>",
            "created":1431991740,
            "id":1979925,
            "title":"Keep you in your \"paper\" form for somet..."
        },
        "155":{
            "choices":[
                "Jimmy wants to wrestle with you as the tiny ref",
                "Steven wants to go fishing",
                "The guys are curious about the transformation button"
            ],
            "content":"<div class=\"\"><div> <span>The guys start to get taller while you feel woozy. Looking up you begin to question what they slipped in your drink. \"What the fuck... did you guys slip me something?\" Looking up at mike as he grows taller you realize the whole room is growing. \"This isn't cool guys! What did you do?\" Mike smirks and the guys just watch as you dwindle in size. \"Chill out man its all in good fun!\" As you rapidly shrink smaller then mikes shoe your angry voice starts to sound like a faint squeaking. \"Ohhh dude haha he's so pissed! Listen to that squeaking lol!\" Now a foot away from mikes shoe and surrounded by your giant friends you look up screaming at mike. \"CHANGE ME BACK NOW YOU FUCKING DOUCHBAG!\" The guys burst into laughter as your pathetic squeaking fills the room. Mike just shakes his head and raises his dirty sneaker above you. \"NO NONO MIKE NO!\" He brings it down slamming it onto your legs. They flatten like putty as the guys watch in amazement. Your face grimaces with slight pain and more embarrassment. \"Oh yeah haha the pain threshold\", Mike grabs the controller and sets it to Zero. \"That should be better for the little shit Mike says as he lifts his shoe off of you. You stick and fall to the ground before Mike Stomps his foot heavily back down on you this time smashing your full body down under his grimy sneaker. All of your friends watch as mike puts his full weight on you and you flatten beneath him like a piece of old gum. Thank god he turned off the pain threshold or you would be feeling rough. Mikes old sneaker totally fills your view as you're pressed against his treads like nothing more then a tin can. Jimmy and Steve high fived as Mike squashed you. \"Sweet! This thing is crazy! AhHA It's going to be a long week for the little shit! Time for payback for the past five years of pranks\" <br>\r\n<br>\r\n\"We could do ANYTHING with him! We could transform him into anything we want, make em pliable. What ever you guys want.\"<br>\r\n<br>\r\nMike rolled you out from under his foot making you squeal as he kicked you lightly to Stevens sneakers. You look up at all of your so called friends as they grin and smirk down at you looking like skyscrapers. \"What should we do with the little bitch first?!?\" </span></div></div>",
            "created":1401598800,
            "id":1805447,
            "title":"1 inch tall"
        }
    },
    "info":{
        "author_id":"spudd",
        "author_name":"Spudd",
        "brief_description":"A fun weekend with the guys turns into a shrinking nightmare. PLEASE ADD ! ANYTHING goes !",
        "created":1202499840,
        "description":"<td align=\"left\" class=\"norm\">\"Male Only\" please<br>\r\n<br>\r\nA guys weekend away turns out being a high stakes game of shrinking, humiliaiton and jockularity. Walt (You) ends up getting set-up and shrunk then played with by the cabin full of his so-called friends. They are in the middle of no-where so there is no one to hear your cries for help. <br>\r\n<br>\r\nWhat do they have instore for you ?!?! <br>\r\n<br>\r\nThe more creative the play the better. PLEASE ADD !!!!!!!<br>\r\n<br>\r\nAnyting goes when the guys keep changing his size and ability to be pliable...or not. </td>",
        "id":1385763,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576126380,
        "modified":1576126380,
        "pretty_title":"A shrinking payback. Buddies to Bullies"
    }
}