{
    "chapters":{
        "1":{
            "author_id":"pappybaker45",
            "author_name":"Pappybaker45 ",
            "choices":[
                "Emo",
                "Formal",
                "Casual",
                "Goth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's 5 o'clock and you're in your room preparing for your date with James. You open up your wardrobe and look for a pretty outfit to wear for your date. <br>\r\nThat will make him lost for words, when he meets you tonight.</span></div></span></div>",
            "created":1583557200,
            "id":2798008,
            "title":"Going on a date with James."
        }
    },
    "info":{
        "author_id":"pappybaker45",
        "author_name":"Pappybaker45 ",
        "brief_description":"You are playing the character of a young 14 year old girl called Isabelle.",
        "created":1583174160,
        "description":"<td align=\"left\" class=\"norm\">You are playing the character of a young 16 year old girl called Isabelle who goes to a school in Manchester and has a boyfriend called James.<br>\r\n<br>\r\nJames is a 16 year old boy who is your boyfriend and goes to the same school as you.<br>\r\n<br>\r\nYou have a best friend called Danielle, she is 16 years old. Who you've known since year 1 she is also in the same school as you.<br>\r\n<br>\r\nYou have another best friend called Janet, she is 16 years old. Who you've known since year 1 who is also in the same school.<br>\r\n<br>\r\nAt high school you're in a group of friends consisting of Megan; Sabrina, Charlie, Danielle, Jannet and You.<br>\r\n<br>\r\nDanielle lives at home in Manchester with her Mother and her Father, who lives in London the capital city of The UK and England.<br>\r\n<br>\r\nIsabelle lives at home in Manchester with her Father called Matthew and her Mother called Lottie who lives in Spain with her boyfriend Hernandez.<br>\r\n<br>\r\n<br>\r\nIf you're going to edit this story please refrain from the following,<br>\r\nChanging the characters names.<br>\r\nKilling off any characters.<br>\r\nAdding any fetishes.<br>\r\nNo politics especially from the (Labour party)<br>\r\n<br>\r\n</td>",
        "id":2214686,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583621460,
        "modified":1583621460,
        "pretty_title":"A Young Kiss."
    }
}