{
    "chapters":{
        "1":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Skip to training grounds.",
                "Skip to first mission."
            ],
            "content":"<div class=\"\"><div> <span><b><u>2 years after Naruto left</u></b><br>\r\n<br>\r\nThe sun was shining over the bustling Hidden Leaf Village as the residents went through another day of peace. Amongst all this, a certain pink haired kunoichi was making her way towards the Hokage's office. Sakura Haruno was curious as to why Tsunade would call for her out of the blue, but she had a good feeling. Apon arriving at the door, she politely knocked.<br>\r\n<br>\r\n\"Come in.\" came Tsunade's slightly muffled voice. As Sakura entered, she couldn't believe her eyes. There in front of her, next to Tsunade's desk stood none other than NARUTO!! After a moment of silence, she marched over and grabbed him by the collar.<br>\r\n<br>\r\n\"Naruto, you jerk!! You leave for two years and don't even bother to let me know when you're coming back!? You are so...oh, hi Kakashi-sensei.\" she said, greeting Kakashi, whom she had only just noticed. After releasing a slightly dazed Naruto, Sakura decided to be more friendly. \"So Naruto, when did you get back?\" she inquired innocently.<br>\r\n<br>\r\n\"Hey Sakura, just this morning, please don't kill me.\" he replied, still wary of her temper. Sakura smiled.<br>\r\n<br>\r\n\"Don't worry, I won't. Anyway, was there anything else you called me here for, milady?\" she asked, addressing Tsunade.<br>\r\n<br>\r\n\"Actually yes, Sakura, there was. I wanted to introduce the two of you-\" she replied, addressing Sakura and Naruto \"-to your new team-mate.\"<br>\r\n<br>\r\n\"New team-mate?\" chorused Naruto and Sakura, obviously surprised. <br>\r\n<br>\r\n\"Yes, to make up numbers on your squad. All right, you can come in now.\" As she said this, the door opened for a second time, and in stepped a boy about Naruto's height, with black hair which obscured the left of his golden eyes and wearing an unusual outfit (<a rel=\"nofollow\" href=\"http://finalfantasy.wikia.com/wiki/File:ZackCGModel-CrisisCore.png\" target=\"_blank\">http://finalfantasy.wikia.com/wiki/File:...</a>) with a sword across his back(<a rel=\"nofollow\" href=\"http://cosplaysky.com/media/catalog/product/cache/2/image/5e06319eda06f020e43594a9c230972d/F/F/FF7-Final-Fantasy-VII-Cloud-Strife-Buster-Sword-A1-Cosplay-1.jpg\" target=\"_blank\">http://cosplaysky.com/media/catalog/prod...</a>). Once he noticed the two, he smiled and gave a small wave.<br>\r\n<br>\r\n\"Hey.\" he greeted.<br>\r\n<br>\r\n\"Hi.\" replied Naruto and Sakura, then Tsunade spoke up.<br>\r\n<br>\r\n\"Anyway, now that we're all here I'll introduce you. Naruto, Sakura, this is Takeshi, Takeshi Hatake.\" As soon as they heard that, Naruto and Sakura's jaws practically hit the floor.<br>\r\n<br>\r\n\"What!! Kakashi-sensei, is he your son or something?!\" cried Sakura. Kakashi rubbed the back of his head sheepishly.<br>\r\n<br>\r\n\"Well, not exactly. He's not from the Leaf Village.\" he replied.<br>\r\n<br>\r\n\"Ok, now I'm confused. If he's not from the village, then how does he have your last name?\" Sakura asked, a puzzled look on her face.<br>\r\n<br>\r\n\"That's what I was thinking.\" agreed Naruto.<br>\r\n<br>\r\n\"I can explain that.\" announced Takeshi. \"I'm from a small village that is, or was, not far from here.\" he said, his cheerful expression turning grim.<br>\r\n<br>\r\n\"Was? What happened?\" Sakura asked, concern clear in her voice and on her face. Naruto wore a similar expression.<br>\r\n<br>\r\n\"Well, about 2 years ago, these two strangers arrived, which was weird because we don't get many visitors. Anyway, they started asking questions about spirits and stuff like that. Then a few days after they arrived, they killed everyone in the village, except for me. I confronted them, but all they said was that they'd be watching me from then on. So, after burying everyone, I decided to come here, since it was the closest village. When I told the people at the gate where I was from, they brought me to your Hokage. I explained what had happened and she offered to let me live here and be a Leaf ninja. I accepted, and she decided that it would be best if I trained in secret until you came back, Naruto. That way, I could join your squad without anyone batting an eye. As for the name thing, well, Kakashi thought it best if he adopted me, since me having no family here would seem a little suspicious.\" he told them.<br>\r\n<br>\r\n\"That's...terrible.\" Sakura whispered.<br>\r\n<br>\r\n\"Yeah.\" agreed Naruto.<br>\r\n<br>\r\n\"Don't worry, I've sort of learned to cope with it. Kakashi and Tsunade were a great help.\" he replied, a smile back on his face. Naruto however, looked uneasy. Tsunade seemed to notice his unusually quiet behaviour.<br>\r\n<br>\r\n\"Something on your mind, Naruto?\" she asked.<br>\r\n<br>\r\n\"Yeah. Takeshi, those two guys who attacked your village.\" he inquired.<br>\r\n<br>\r\n\"What about 'em?\" asked Takeshi.<br>\r\n<br>\r\n\"What were they wearing?\"<br>\r\n<br>\r\n\"If memory serves, they were wearing black cloaks with red clouds on them. Why?\" As soon as he said that, the other four all went pale, which was not lost on Takeshi. \"Um, why do you guys all look like you just saw a ghost?\" he asked. Tsunade was the first to recover.<br>\r\n<br>\r\n\"Takeshi, you should have mentioned this sooner. Those two were members of the Akatsuki, a group comprised of S-rank rogue ninja.\"<br>\r\n<br>\r\n\"Seriously?! But what could they possibly have wanted with my village?\" asked Takeshi.<br>\r\n<br>\r\n\"Well, I may have an idea, but no one else can know about this, understood?\" announced Tsunade. Everyone nodded. \"Good. Well, from what we know, the Akatsuki are after the nine Tailed Demon Beasts, such as the Nine-Tailed Fox inside Naruto and the Shukaku within Gaara. That means they must have been looking for one of the demon spirits in Takeshi's village.\" Then Takeshi spoke up.<br>\r\n<br>\r\n\"Tsunade, I think I might have an idea. My village has this legend that mentions a demon spirit, but it's not a Tailed Demon. Its more like a human, but the legend says it's as powerful, if not more, than all the Tailed Demons combined. Supposedly, its name is Sephiroth, the One-Winged Angel.\" he told them, causing the others pale again.<br>\r\n<br>\r\n\"Then, if they let you live...that must mean that this...Sephiroth dwells within you.\" said Tsunade, looking concerned.<br>\r\n<br>\r\n\"That would explain why his chakra level is so high. From what I've seen during his training, Takeshi probably has more chakra than Naruto.\" said Kakashi. Tsunade nodded, then stood up.<br>\r\n<br>\r\n\"All right, in light of this, I'm ordering our spies to keep a sharp eye out for the Akatsuki. Takeshi, Naruto, Sakura, Kakashi?\" she said.<br>\r\n<br>\r\n\"Yes, Lady Hokage?\" they replied.<br>\r\n<br>\r\n\"From now on you are all to keep your guard up whenever on missions, got it?\"<br>\r\n<br>\r\n\"Yes ma'am.\" they replied. Tsunade sat down, satisfied.<br>\r\n<br>\r\n\"Good. Now, why don't you all head over to the training grounds, so Takeshi can show you two some of his abilities?\" she asked.<br>\r\n<br>\r\n\"That sounds like a great idea.\" replied Kakashi.<br>\r\n<br>\r\n\"Same here.\" said Sakura.<br>\r\n<br>\r\n\"Sounds good.\" agreed Naruto.</span></div></div>",
            "created":1306126800,
            "id":1111188,
            "title":"Meeting."
        },
        "11":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The next day. Ino approaches Takeshi.",
                "Team 7's first mission in two years!"
            ],
            "content":"<div class=\"\"><div> <span><u><b>At the training grounds</b></u><br>\r\n<br>\r\nAs the group arrived at the training grounds, it was obvious to Naruto that things had changed a lot since he had left. Not only were there numerous shattered boulders lying around, but there also seemed to be less trees than he remembered.<br>\r\n<br>\r\n\"Uh, Kakashi-sensei? What's been going on here?\" he asked. Sakura seemed equally confused.<br>\r\n<br>\r\n\"Yeah, every time I asked you about it, you kept changing the subject.\" she said. Takeshi spoke up.<br>\r\n<br>\r\n\"Actually, that would be my handiwork, gotta practice on something.\" he explained. <br>\r\n<br>\r\n\"Ok, so what exactly do you specialise in, then?\" asked Sakura.<br>\r\n<br>\r\n\"Mostly ninjutsu and taijutsu, although I'm ok with genjutsu. But I mostly use my sword when I fight, that's why there's a few less trees. You want a demonstration?\" he asked. Both Naruto and Sakura nodded. \"All right, that one should do nicely.\" he announced, indicating a fairly tall and thick tree a short distance away. He then ran at the tree, grasping the sword on his back. Once close enough, Takeshi seemed to disappear for a split second as he sliced at the trunk. With a crash, the tree split into hundreds of pieces, all of which crashed to the ground, as Takeshi swung his sword twice, then spun it before replacing it on his back, gasping slightly. Naruto and Sakura were speechless.<br>\r\n<br>\r\n\"H-How did split into so many pieces? He only cut it once!\" exclaimed Naruto, while Sakura just stared. Kakashi chuckled.<br>\r\n<br>\r\n\"That...was Takeshi's kekkei genkai. It's called the Kousokudo, or the Speed of Light. It allows Takeshi to move faster than light, which is why it looked like he temporarily vanished. You only saw him slice once, but in reality he probably sliced it over a hundred times in a split second. The downside is that this requires an enormous amount of chakra. A normal ninja would probably die, and even Takeshi only uses it occasionally.\" he explained.<br>\r\n<br>\r\n\"Wow, awesome!\" shouted Naruto. Takeshi smiled as he came back over.<br>\r\n<br>\r\n\"Glad you think so.\" he said, but Sakura was looking at him disapprovingly. \"What?\" he asked her.<br>\r\n<br>\r\n\"Was there really any point to spinning your sword around like that?\" she asked, at which he laughed a bit.<br>\r\n<br>\r\n\"I knew you'd ask. It helps with my concentration, if I got it wrong I'd cut myself. But mostly I just enjoy it.\" he replied. Sakura sighed and shook her head.<br>\r\n<br>\r\n\"Boys.\" she exclaimed.<br>\r\n<br>\r\n\"Hey!\" cried both Takeshi and Naruto.<br>\r\n<br>\r\n\"Hey, not bad!\" came a voice from behind them. They turned to see the members of Team 10; Shikamaru, Choji and Ino watching. <br>\r\n<br>\r\n\"Um, how long have guys been there?\" asked Naruto.<br>\r\n<br>\r\n\"The whole time.\" replied Shikamaru. Ino then piped up.<br>\r\n<br>\r\n\"So, who's the new guy?\" she asked, staring at Takeshi dreamingly.<br>\r\n<br>\r\n\"Name's Takeshi, Takeshi Hatake. Nice to meet you.\" he replied with a smile. Team 10 were just as surprised as Naruto and Sakura had been.<br>\r\n<br>\r\n\"Hatake? You mean you're...\" stuttered Choji.<br>\r\n<br>\r\n\"Yes, he's my son. Adopted, actually.\" answered Kakashi.<br>\r\n<br>\r\n\"Oh, I see. That explains that special technique he used before.\" said Shikamaru, always the observant one. \"So, Naruto, finally came back, huh?\" he asked, turning to face Naruto.<br>\r\n<br>\r\n\"Yep, just got back today.\" he replied.<br>\r\n<br>\r\n\"And let me guess, Sakura's already beaten you up?\" Shikamaru joked.<br>\r\n<br>\r\n\"Uh, yeah.\" Naruto replied, embarassed. While their conversation had been going on, Sakura and Ino had gotten into an arguement over something.<br>\r\n<br>\r\n\"That's right, you heard me, Billboard Brow!\" shouted Ino.<br>\r\n<br>\r\n\"Shut up, Ino-Pig!\" Sakura shot back. The two girls continued to shout at each other while the guys just stared. Takeshi raised an eyebrow.<br>\r\n<br>\r\n\"Are they always like this?\" he asked Shikamaru.<br>\r\n<br>\r\n\"Yep, every day. It's troublesome. Would you believe they were friends as kids?\" replied Shikamaru. Takeshi looked startled.<br>\r\n<br>\r\n\"You're kidding!\" he exclaimed, as the girls continued their shouting match. \"Well, on the plus side, that Ino's pretty beautiful, even when she's angry.\" Ino somehow heard this over her and Sakura's shouting, because she immediately stopped and turned to face Takeshi.<br>\r\n<br>\r\n\"You...really think I'm beautiful?\" she asked, blushing.<br>\r\n<br>\r\n\"Uh...yeah.\" replied Takeshi, rubbing the back of his neck, a blush evident on his face as well.<br>\r\n<br>\r\n\"No one's ever...said that to me before. Thank you.\" she replied, giving Takeshi a quick kiss on the cheek, before walking off humming happily to herself. Takeshi and the others were speechless. Shikamaru was the first to speak.<br>\r\n<br>\r\n\"Wow, she's never acted that way before.\" he said, amazed.<br>\r\n<br>\r\n\"Really?\" asked Takeshi.<br>\r\n<br>\r\n\"Yeah, probably because the person she had a major crush on never even said a word to her. You're one lucky guy.\" replied Sakura.<br>\r\n<br>\r\n\"I guess so.\" Takeshi agreed.</span></div></div>",
            "created":1306299600,
            "id":1112488,
            "title":"Secret's Out!"
        },
        "111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The next day.",
                "First date!"
            ],
            "content":"<div class=\"\"><div> <span><u><b>The next day, Takeshi's apartment</b></u><br>\r\n<br>\r\nIt was another sunny midday in the village Hidden in the Leaves, with a few clouds drifting lazily overhead. However, not everyone was outside enjoying the gorgeous weather. Inside his apartment, which was situated in the same block as Naruto's, Takeshi was sitting on the floor, legs crossed, arms folded and eyes shut. He was trying to see if Sephiroth really was inside him and if so, if he could talk to him.<br>\r\n<br>\r\n<i>\"He must be in here somewhere, I've been like this for two hours!! Wait, what's that?\"</i> He wondered, as he spotted a doorway-shaped white light in the inky blackness off his mindscape. However, as Takeshi went to check it out, someone knocked on his door, interupting his thoughts and breaking his concentration. <i>\"Damn, just when I start to get somewhere.\"</i> he grumbled. Opening his eyes, Takeshi stood up and went to open the door. When he did, he was surprised to see Ino standing outside, her back to him, mumbling something incoherent. \"Um, Ino?\" he asked, causing her to to jump slightly. When she turned to face him, Takeshi noticed a faint blush on her face.<br>\r\n<br>\r\n\"H-hi Takeshi.\" she replied, stumbling over her words slightly.<br>\r\n<br>\r\n\"What brings you here? Need something?\" he asked, giving her a friendly smile. At this, Ino smiled back, looking a little less nervous.<br>\r\n<br>\r\n\"Um, yeah. Listen, can we talk for a bit?\" she asked.<br>\r\n<br>\r\n\"Sure, why don't come inside and sit down?\" he replied, motioning for her to enter. <br>\r\n<br>\r\n\"OK.\" Ino replied. Takeshi then stepped aside to let her in. As she entered, Ino noted that the apartment was pretty good. She was standing in a small living room with decent sized TV, a kitchen off to the side, and a hallway with presumably a bedroom and bathroom branching off it. Over in the corner, Takeshi's sword stood against the wall. \"Wow, nice place.\" she commented, sitting down on the couch. Takeshi then joined her.<br>\r\n<br>\r\n\"Yeah, it sure is. Compliments of Tsunade. Now what did you want to talk about?\" he asked. Ino gulped, then blushed again.<br>\r\n<br>\r\n\"Um, well, you remember yesterday? When I...\" she asked, uncertain.<br>\r\n<br>\r\n\"Yeah, what about it?\" Takeshi asked, slightly concerned.<br>\r\n<br>\r\n\"Well, I was thinking, and I think I know why I acted like that.\" she replied, her blush deepening.<br>\r\n<br>\r\n\"And?\" he asked.<br>\r\n<br>\r\n\"I-I think I'm in love with you, Takeshi.\" she replied. Takeshi's eyes widened and he was speechless. After a few seconds, he recovered enough to speak.<br>\r\n<br>\r\n\"R-Really?\"<br>\r\n<br>\r\n\"Yes. After I got home, I couldn't stop thinking about you and how you told me I was beautiful. I really do think I'm in love.\" she replied, holding her cheeks, her blush intensifying. Takeshi didn't know what to say. He was completely taken by surprise. Then it him, he really did like Ino. Her smile, her looks, and that kiss she had given him. Ino noticed his silence.<br>\r\n<br>\r\n\"Takeshi,what's wrong? It's all right if you don't feel the same, I just wanted to te-\" she stared to say, but was cut off by Takeshi's lips meeting hers. Ino's eyes drifted closed as she wrapped her arms around Takeshi's neck, deepening the kiss. He responded, his arms encircling her waist. After a few more moments, their lips separated, as they both gasped for air, still in each other's arms. Ino simply gazed into Takeshi's golden eyes. \"Wow.\" she breathed.<br>\r\n<br>\r\n\"Yeah.\" agreed Takeshi.<br>\r\n<br>\r\n\"So, does this mean...\" she asked. He nodded.<br>\r\n<br>\r\n\"Yes, I love you too, Ino.\" he replied. Ino was so happy, she buried her face in Takeshi's chest, tears running down her face as she cried.<br>\r\n<br>\r\n\"Ino, what's wrong? Are you okay?\" Takeshi asked, worried that he had somehow hurt her feelings. Ino shook her head as the tears continued to flow.<br>\r\n<br>\r\n\"No, I'm just so glad. I was afraid you wouldn't feel the same way.\" she replied. Takeshi lifted Ino's chin so that she was looking at him.<br>\r\n<br>\r\n\"Ino, I'd never want to hurt you. And I don't want to have to see you cry.\" he told her, as he wiped away her tears.<br>\r\n<br>\r\n\"Okay.\" she replied, smiling.<br>\r\n<br>\r\n\"How about I take you out for dinner tomorrow night, if we don't have missions?\" Takeshi offered. Ino smiled.<br>\r\n<br>\r\n\"Sure, pick me up at eight?\"<br>\r\n<br>\r\n\"Eight sounds good.\" he agreed, as they both headed back to the door. Before leaving, Ino kissed Takeshi on the cheek again.<br>\r\n<br>\r\n\"See you tomorrow, then.\" she said, giggling as she went. Takeshi closed the door, returning to his previous pose.<br>\r\n<br>\r\n<i>\"Looks like I'm in for some fun tomorrow, hope I can make Ino have a good time as well. Now, where did I leave off?\"</i></span></div></div>",
            "created":1306645200,
            "id":1115217,
            "title":"Blossoming Love"
        },
        "1111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Skip to the date.",
                "Skip to lunch.",
                "Other choice."
            ],
            "content":"<div class=\"\"><div> <span><u><b>The next day, training grounds</b></u><br>\r\n<br>\r\nThe next day, the new Team 7 were at the training grounds again. As Takeshi had already shown his talents, he had suggested that Naruto show them how much he had learned over the last two years, by fighting Sakura. As a result, Takeshi had left his sword at home, and was now watching a pretty intense fight. Currently, both Naruto and Sakura had decided to stop, as they were both worn out.<br>\r\n<br>\r\n\"Man, when did you get so tough, Sakura?\" Naruto asked, panting.<br>\r\n<br>\r\n\"Come on, Naruto, I've been training with Tsunade for two years! You shouldn't be surprised.\" Sakura retorted. Takeshi laughed.<br>\r\n<br>\r\n\"Better be careful, Naruto! Keep ticking her off and you might end up dead.\" he shouted, walking over. He held out a hand, which Naruto took, before pulling him upright.<br>\r\n<br>\r\n\"Well, at least you have gotten better. Looks like all that training wasn't a complete waste.\" Sakura told him.<br>\r\n<br>\r\n\"Why don't we get something to eat, I'm starving.\" Takeshi asked. The other two agreed, and the group headed into the village. Just as they arrived outside Ichiraku's, someone called out to them.<br>\r\n<br>\r\n\"Takeshi!\" said a voice. Takeshi didn't even have time to turn around, before Ino tackled him from behind, causing both of them to fall to the ground.<br>\r\n<br>\r\n\"Ino! A little warning might be nice.\" he told her, as they both got back up. As they did, Ino saw Sakura staring.<br>\r\n<br>\r\n\"What?\" she asked.<br>\r\n<br>\r\n\"Since when are you so hyper?\" Sakura asked. Ino giggled.<br>\r\n<br>\r\n\"If you must know, I have a date tonight.\" Ino announced. Sakura couldn't believe her ears.<br>\r\n<br>\r\n\"What?! With who?\" she yelled.<br>\r\n<br>\r\n\"Takeshi, now calm down.\" she replied, linking her hand with Takeshi's, who blushed, rubbing the back of his head.<br>\r\n<br>\r\n\"Hmph, well I have to say I'm surprised. I never thought anyone could put up with your attitude.\" Sakura remarked.<br>\r\n<br>\r\n\"You're just jealous 'cause you don't have a guy like Takeshi.\" Ino replied. \"Come on, Takeshi, you can have lunch with me.\" she told him.<br>\r\n<br>\r\n\"Sounds good. Later, guys.\" Takeshi replied, then he and Ino headed off, leaving a fuming Sakura and a laughing Naruto.</span></div></div>",
            "created":1307336400,
            "id":1120724,
            "title":"An Unbreakable Bond."
        },
        "11111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "A special mission.",
                "The next day."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Outside the Yamanaka household</b></u><br>\r\n<br>\r\nTakeshi stood outside the door of Ino's house, feeling slightly nervous. It was his first date and he hoped he wouldn't screw up. He was wearing a simple black suit and tie, with the leaf village symbol embroidered in gold on each upper sleeve. Shaking his head to clear his mind, he knocked on the door.<br>\r\n<br>\r\n<i>\"Ok Takeshi, chill out. You'll be fine.\"</i>he thought to himself. Then the door was opened by a woman in her mid-thirties, with blond hair and wearing an apron. She smiled.<br>\r\n<br>\r\n\"You must be Takeshi. Ino's said a lot about you.\" she said.<br>\r\n<br>\r\n\"Yes, ma'am. Is Ino ready?\" Takeshi asked, bowing slightly. Ino's mother smiled again.<br>\r\n<br>\r\n\"And such a gentleman too! Ino, there's a very handsome boy here for you!\" she called up the stairs.<br>\r\n<br>\r\n\"Coming, mom!\" came Ino's reply.<br>\r\n<br>\r\n\"Why don't come inside while we wait for her?\" Ino's mother suggested. Takeshi nodded, as she lead him into a small living room. A few minutes later, Ino emerged from upstairs and Takeshi was at a loss for words. Ino had her hair down, which reached just past her shoulders, shining like silk. She wore a black kimono with gold embroidery, and was a picture of beauty. <br>\r\n<br>\r\n\"Who is this angel I see before me?\" he commented. Ino blushed heavily.<br>\r\n<br>\r\n\"Takeshi, stop it!\" she complained, not meaning it.<br>\r\n<br>\r\n\"Now then, you two.\" announced Mrs Yamanaka. \"I expect you have Ino back by 10, understood?\"<br>\r\n<br>\r\n\"Yes, ma'am\" Takeshi replied, as the two ninja left the house, Ino holding on to Takeshi's arm. Takeshi led Ino to a small restaurant, where they had a beautiful dinner, talking about various things, such as their respective childhoods and families. Ino was quite curious about Takeshi's family, which he was more than happy to tell her about, as it made him remember all the fond memories. Afterwards, the young couple decided to watch the stars from on top of the Hokage Monument. As they sat gazing up at the heavens, Ino rested her head on Takeshi's shoulder.<br>\r\n<br>\r\n\"I never knew it was so beautiful up here.\" she told him.<br>\r\n<br>\r\n\"It's still not as beautiful as you.\" he replied. Ino giggled, wrapping her arms around his neck, kissing him on the cheek.<br>\r\n<br>\r\n\"You are too nice.\" she told him.<br>\r\n<br>\r\n\"I love you, Ino.\" Takeshi replied.<br>\r\n<br>\r\n\"I love you, too.\" she replied. They lent towards each other, their lips meeting in a passionate kiss. Takeshi's arms wrapped around Ino's slim waist, as his tongue ran across her lips. Ino parted her lips, allowing him access. Takeshi knew Ino was beautiful, but her tase was something else. She tasted so sweet and delicious he thought he'd died and gone to heaven. Their tongue dancing, as though neither could taste the other enough to be satisfied. After a while, the lack of oxygen forced them to part, gasping for breath. \"That was new.\" Ino said, blushing.<br>\r\n<br>\r\n\"You enjoyed it, didn't you?\" Takeshi asked.<br>\r\n<br>\r\n\"Mmm.\" she replied. After that, Takeshi walked her home. After saying goodbye, with another long kiss, he headed back home himself, smiling happily all the way.</span></div></div>",
            "created":1307768400,
            "id":1123705,
            "title":"First Date!"
        },
        "111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Takeshi, Naruto and Kakashi.",
                "The next day."
            ],
            "content":"<div class=\"\"><div> <span><u><b>A few weeks later, Tsunade's Office</b></u><br>\r\n<br>\r\nA few weeks had passed since Takeshi and Ino's date. Takeshi had been on a few missions, some of them by himself, usually because they required speed or stealth. Ino officially referred to him as her boyfriend, while Takeshi had been surprised to hear that the Naruto and Sakura were now a couple. Currently, he was at Tsunade's office for a 'secret' mission. Eager to find out what it was, Takeshi entered, to find Kakashi and Naruto there as well.<br>\r\n<br>\r\n\"Good, you're all here. Let's get to business.\" Tsunade announced. \"I'm sending the three of you on high-priority S-Rank mission.\"<br>\r\n<br>\r\n\"Woah, seriously?!\" exclaimed Takeshi.<br>\r\n<br>\r\n\"Awesome!\" yelled Naruto.<br>\r\n<br>\r\n\"Calm down you two. I haven't even told you what it is yet.\" Tsunade replied, cutting Naruto off. \"You three are to locate and eliminate Orochimaru and Sasuke Uchiha.\"<br>\r\n<br>\r\n\"No way! I promised Sakura I'd bring Sasuke back!\" protested Naruto.<br>\r\n<br>\r\n\"I'm well aware of that. That's why Sasuke is to be killed only as a last resort. You have to try to bring him back so he can be held accountable for betraying the village.\" she explained. Naruto calmed down after hearing this. \"As for Orochimaru, he's been a threat for too long. We need to kill him before he tries anything. That will be your job, Takeshi.\"<br>\r\n<br>\r\n\"You serious?\" Takeshi asked, shocked.<br>\r\n<br>\r\n\"Dead serious, you're the only one with enough power to stand a chance against him. Besides, Naruto and Kakashi have more experience with Sasuke.\" Tsunade told him.<br>\r\n<br>\r\n\"Fair enough.\" Takeshi conceded.<br>\r\n<br>\r\n\"Good. Then pack whatever you need, you'll be leaving in two hours. Dismissed.\" she told them.<br>\r\n<br>\r\n\"Yes, ma'am.\" they replied, leaving the office.<br>\r\n<br>\r\n<i>\"Hopefully, they all come back alive.\"</i> Tsunade thought, slightly worried.<br>\r\n<br>\r\n<u><b>Later, at the village gate</b></u><br>\r\n<br>\r\nTakeshi, Kakashi and Naruto arrived at the gate, ready for their mission. Kakashi noted that his adopted son seemed very occupied, as he wasn't as cheerful as usual.<br>\r\n<br>\r\n<i>\"Well, I don't blame him. He's going to be up against one of the Sanin. Even I'd be nervous.\"</i> Kakashi thought. He was jolted from his thoughts as Tsunade approached him, handing over a scroll.<br>\r\n<br>\r\n\"This is the map telling you where Orochimaru is. The ANBU who found him made sure they weren't seen, so he should still be there.\" Tsunade told him.<br>\r\n<br>\r\n\"Right, thanks.\" he replied. \"Come on, you two, let's get going.\" he announced, addressing Takeshi and Naruto.<br>\r\n<br>\r\n\"Right.\" they replied. Then the group sprinted offf towards their targets.<br>\r\n<br>\r\n<b>That afternoon...</b><br>\r\n<br>\r\n\"Hey, Sakura!\" Sakura stopped her training as Ino called out to her, striding across the field. Since she had started going out with Naruto, Sakura had gone back to being friends with Ino, after they both realised how stupid their fight had been. \"You seen Takeshi? We were supposed to have lunch together.\" Ino asked.<br>\r\n<br>\r\n\"Sorry, I haven't. By the way, have you run into Naruto anywhere?\" Sakura asked.<br>\r\n<br>\r\n\"No.\" Ino replied. \"Maybe we should ask Tsunade. She probably knows something.\" she suggested. Sakura agreed, and the two friends headed towards Tsunade's office. Sakura knocked on the door.<br>\r\n<br>\r\n\"Come in.\" came Tsunade's voice. The two girls entered, to find Tsunade with a ton of paperwork on her desk. \"Ino, Sakura. Can I help you?\"<br>\r\n<br>\r\n\"Lady Tsunade, do you know where Naruto and Takeshi are?\" Ino asked. Tsunade sighed.<br>\r\n<br>\r\n\"Well, I knew you'd ask at some point. But, what I'm about to say doesn't leave this room, got it?\" she asked.<br>\r\n<br>\r\n\"Of course.\" they both replied.<br>\r\n<br>\r\n\"All right. I've sent Naruto, Takeshi and Kakashi on a special mission, to eliminate some of our enemies.\" she told them.<br>\r\n<br>\r\n\"Who?\" asked Sakura.<br>\r\n<br>\r\n\"Orochimaru and Sasuke.\" Tsunade told her.<br>\r\n<br>\r\n\"What?! Why'd you keep me here, then?\" Sakura cried.<br>\r\n<br>\r\n\"Because, it's too dangerous. Besides, Naruto and Kashi will only kill Sasuke if they can't bring him back.\" Tsunadfe told her. Sakura calmed down but still looked pretty upset.<br>\r\n<br>\r\n\"Wait, you said Naruto and Kakashi would deal with Sasuke, right? What about Takeshi?\" Ino asked.<br>\r\n<br>\r\n\"His job will be to kill Orochimaru.\" Tsunade said plainly. Ino couldn't believe her ears.<br>\r\n<br>\r\n\"What?! You've basically signed his death warrant!\" she shouted, tears running down her face.<br>\r\n<br>\r\n\"Ino please, hear me out on this.\" Tsunade asked. Ino calmed down a bit, but was still crying. \"You haven't what Takeshi's capable of yet. For one of training sessions he fought myself and Kakashi at the same time and won. Also, he's probably got more chakra than even Nruto. He's the only one that stands a chance against Orochimaru. Now please, I know you're worried, but he'll be fine. You'll see.\" Tsunade told her. Ino nodded, still speechless. Sakura put an arm around her shoulders.<br>\r\n<br>\r\n\"I'll take her home.\" she told Tsunade, as the two friends left the office. Sakura decided that Ino should stay at her place for the night, seeing as she probably needed the support. <br>\r\n<br>\r\nAfter dinner, the two got dressed for bed. Ino was borrowing some of Sakura's pyjamas, since she had only the clothes she arrived.<br>\r\n<br>\r\n\"Thanks Sakura.\" Ino told her. Sakura smiled.<br>\r\n<br>\r\n\"No problem.\" she replied.<br>\r\n<br>\r\n\"I'm just worried about Takeshi. I mean, he's gone away before but this time, what if this time he-\" Ino broke down crying before she could finish. Sakura rushed over, wrapping Ino in a sisterly hug.<br>\r\n<br>\r\n\"Hey, I'm worried too. Besides, if he's as strong as Lady Tsunade said, he'll be fine.\" Sakura told her friend. Ino crying ceased, her expression now one of hope.<br>\r\n<br>\r\n\"Thanks.\" she replied.<br>\r\n<br>\r\n\"No worries. Now come on. You need your sleep.\" Sakura said, as they both climbed into bed and fell asleep, dreaming of their respective boyfriends.</span></div></div>",
            "created":1307873460,
            "id":1124162,
            "title":"An Old Enemy & Friend."
        },
        "1111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The return.",
                "Ino and Sakura."
            ],
            "content":"<div class=\"\"><div> <span><u><b>A few days later, Orockimaru's location</b></u><br>\r\n<br>\r\nAfter a few days travelling, the group arrived at the location where Orochimaru was reported to be, which turned out to be the site of an old temple. But Orochimaru was nowhere to be found.<br>\r\n<br>\r\n\"Where are they?\" Naruto wondered. <br>\r\n<br>\r\n\"Hm, Naruto, come with me, we'll check inside. Takeshi, you stay here and keep an eye out.\" Kakashi told them.<br>\r\n<br>\r\n\"Right.\" they replied. Naruto then followed his sensei, while Takeshi searched the outside for his target. Then, after the other two had vanished inside the temple, Takeshi was forced to dodge three kunai thrown his way. Looking around, he spotted someone who made his blood run cold; Orochimaru.<br>\r\n<br>\r\n\"Well, well. I must say, I'm surprised Tsunade sent someone as young as yourself to face me. I'll make sure she regrets it.\" he told Takeshi, who drew his sword.<br>\r\n<br>\r\n\"We'll just see about that.\" Takeshi replied. Orochimaru laughed.<br>\r\n<br>\r\n\"Well, at least you have some spirit. This should be fun.\" he announced, drawing the Grass Longsword. The two then charged each other.<br>\r\n<br>\r\n<u><b>Inside the temple</b></u><br>\r\n<br>\r\nKakashi and Naruto had just entered a large chamber, then a voice called out to them.<br>\r\n<br>\r\n\"So, you did come after all, Naruto.\" Sasuke said, as he emerged from the shadows.<br>\r\n<br>\r\n\"Sasuke, you're coming back whether you like it or not!\" Naruto yelled, charging at Sasuke.<br>\r\n<br>\r\n\"Naruto!\" Kakashi cried out, as Naruto summoned his Shadow Clones and attacked Sasuke. <br>\r\n<br>\r\n\"Fire Style: Fireball Jutsu!\" Sasuke yelled, blowing a massive ball of fire, incinerating the clones. However, he wasn't fast enough to dodge Naruto's Rasengan, which sent him flying into the far wall. He slowly got up, coughing up some blood. Naruto also struggled to stand, having charged through the fire to get to Sasuke. However, his wounds quickly healed, thanks to the Nine-Tailed Fox.<br>\r\n<br>\r\n\"Sasuke.\" Naruto said.<br>\r\n<br>\r\n\"What do you say...we finish this?\" Sasuke asked him, charging up his Chidori, whilest Naruto prepared his Rasengan.<br>\r\n<br>\r\n\"I couldn't agree more.\" Naruto replied, as the two charged once more.<br>\r\n<br>\r\n<u><b>Takeshi vs Orochimaru</b></u><br>\r\n<br>\r\nTakeshi was worn out. He'd barely managed to stay alive, dodging Orochimaru's attacks constantly. He had yet to land a decisive blow. At last, he saw an opening, As the Sanin attacked again, Takeshi slipped inside his guard, before slashing at Orochimaru's chest, leaving a long but shallow wound, and throwing him back a fair distance.<br>\r\n<br>\r\n\"Hm, looks like you're better than I expected. I'll have to start fighting seriously now.\" he announced, forming handsigns, some of which Takeshi didn't recognise. \"You should feel honoured. I've only used this jutsu on one other ninja before you; the Third Hokage. And even he couldn't defeat it. Summoning Jutsu: Reanimation!\" As he said this, four caskets emerged from the ground in front of the Sannin. As they opened, and the occupents emerged, Takeshi speechless. The four figures were the First, Second, Third and Fourth Hokage of the Leaf Village! Takeshi found himself paralyzed with fear.<br>\r\n<br>\r\n<i>\"No way...there's no way in hell I can beat them.\"</i> he thought, terrified, as the Hokage assumed a fighting stance.<br>\r\n<br>\r\n<i><b>Naruto/Kakashi vs Sasuke</b></i><br>\r\n<br>\r\n\"Chidori!\"<br>\r\n<br>\r\n\"Rasengan!\"<br>\r\n<br>\r\nThe two former friends cried out their jutsu, as they met in mid-air. The two jutsu crahsed into each other, neither giving way. Then Sasuke did something that Naruto felt would haunt him forever; he shifted his arm, causing the Chidori to miss Naruto, as the Rasengan tore into his chest. As they fell to the floor, Naruto rushed over to Sasuke.<br>\r\n<br>\r\n\"Why, Sasuke?\" he cried. Sasuke laughed weakly.<br>\r\n<br>\r\n\"Idiot, you still have to make Hokage, right? I can't let you die yet.\" he replied, coughing up more blood. \"Just tell Sakura...I'm sorry.\" And then, one of the two remaining Uchiha breathed his last.<br>\r\n<br>\r\n\"Sasuke...I forgive you.\" Naruto whispered solemnly. Then, he and Kakashi heard what sounded like heavy fighting outside, so they rushed to investigate.<br>\r\n<br>\r\n<u><b>Takeshi vs Orochimaru/Hokage</b></u><br>\r\n<br>\r\nIf Orochimaru was tough, the Hokage were in a different league. No matter what he tried, Takeshi couldn't injure the four. They kept attacking him at the same time, meaning he could only defend against one of them, leaving his sides and back exposed. Then, Naruto and Kakashi came running out of the temple.<br>\r\n<br>\r\n\"Takeshi!\" Naruto cried, ready to jump in. But Takeshi held up his hand.<br>\r\n<br>\r\n\"Stay back, Naruto. I-\" before he could finish, the First and Second Hokage hit him simoultaneously with Water Wall and Earth Wall, then the Third attacked with Dragon Flame Bomb. Finally, the Fourth hit Takeshi with a Rasngan, throwing him hard against a wall. Takeshi fell to the ground, his sword land a short distance away.<br>\r\n<br>\r\n\"Finish it.\" Orochiumaru ordered. But then, Takeshi struggled to his feet, his eyes a fluorescent blue-green. He simply looked as the four Hokage leaped up to end it. However, before their attacks could connect, Takeshi transformed instantaneously into a tall man with long silver hair, wearing a black cloak (<a rel=\"nofollow\" href=\"http://finalfantasy.wikia.com/wiki/File:SephirothCGModel-CrisisCore.png\" target=\"_blank\">http://finalfantasy.wikia.com/wiki/File:...</a>). He raised both hands, stopping the four attacks in mid-air, as a long sword materialised between them (<a rel=\"nofollow\" href=\"http://finalfantasy.wikia.com/wiki/File:Dissidia-Masamune.png\" target=\"_blank\">http://finalfantasy.wikia.com/wiki/File:...</a>). The man then sliced the sword through the air, throwing the Hokage back.<br>\r\n<br>\r\n\"Sorry, but I cannot allow you to kill my vessel.\" he told them.<br>\r\n<br>\r\n\"W-Who are you?\" Orochimaru asked. The man laughed.<br>\r\n<br>\r\n\"I am Sephiroth, the One-Winged Angel, and your end.\" Sephiroth replied. He then dashed forward with lightning speed, slashing through the Hokage in one slice. All four fell to the ground, their bodies returning to erarth, revealing the bodies of four Sound shinobi.<br>\r\n<br>\r\n\"How-\" Orochimaru was cut off as Sephiroth's sword impaled him through the chest, before slicing him in half. The Sannin fell down, finally dead. Sephiroth banished his sword, as he was engulfed in black feathers, which parted to reveal Takeshi, who almost fell down, before Kakashi caught him.The Jounin realised he was both unconscious and dangerously low on chakra. Putting Takeshi's limp body over his shoulder, he turned to Naruto.<br>\r\n<br>\r\n\"Naruto, grab Takeshi's sword, we've got to get back to the village fast!\" he ordered, then he took off. Naruto picked up the sword and quickly followed.</span></div></div>",
            "created":1308663660,
            "id":1131001,
            "title":"Power Unleashed."
        },
        "11111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Explanation and relief",
                "A surprise."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Village Hidden in the Leaves, Hospital</b></u><br>\r\n<br>\r\nSakura knew something was wrong when she saw Takeshi being wheeled in on a stretcher, headed for the operating room. Tsunade then approached her.<br>\r\n<br>\r\n\"Sakura, you'd better go get Ino quickly. I'll do what I can for now but I could really use your help on this one.\" she told her.<br>\r\n<br>\r\n\"Yes ma'am.\" the young kunoichi replied, before sprinting off.<br>\r\n<br>\r\n<u><b>Training Grounds</b></u><br>\r\n<br>\r\nSakura found her friend practicing taijutsu on a few boulders. Apparently, Takeshi had been giving her some extra training, to the point where Ino could almost give Rock Lee a run for his money.Sakura approached after Ino had destroyed another boulder.<br>\r\n<br>\r\n\"Ino!\" she called out. The blond looked up at her, clearly exhausted.<br>\r\n<br>\r\n\"Yeah?\" Ino asked.<br>\r\n<br>\r\n\"Tsunade sent me to find you. It's Takeshi, he's...\" Sakura couldn't bring herself to finish. Ino's face became one of despair.<br>\r\n<br>\r\n\"Why?! What happened?!\" she demanded, tears in her eyes.<br>\r\n<br>\r\n\"Ino, calm down. Tsunade's already doing what she can, and I'll be helping her once I bring you back.\" Sakura told her. Ino nodded weakly, then the two ninja ran towards the hospital.<br>\r\n<br>\r\n<u><b>The Hospital, an hour later</b></u><br>\r\n<br>\r\nThe mood in the room was grim, the silence only broken by the steady beeping of the heart monitor. Takeshi lay in the hospital bed, looking for all appearances asleep. Tsunade had discovered that Orochimaru had hit Takeshi with a jutsu that steadily drained his chakra to fuel itself. Sadly, no one knew how to stop it. Ino was at Takeshi's bedside, holding his hand, taking comfort in the fact that he still had a pulse, he wasn't beaten yet. Naruto, Sakura and Kakashi were standing opposite Ino, while Shikamaru and Choji were with Ino. Tsunade was next to the door, racking her brain for anything that might help.<br>\r\n<br>\r\n\"So young...he doesn't deserve this, not after what he did.\" Kakashi said. The others nodded. While Sakura and Tsunade had been trying to help Takeshi, Kakashi and Naruto had explained to the others what had happened. Ino especially was shocked to learn about Sephiroth, but they were all speechless when they were told that Sephiroth had defeated the four Hokage and killed Orochimaru with little effort.<br>\r\n<br>\r\n\"Ino...I'm so sorry.\" Tsunade apologised, Ino shook her head a little.<br>\r\n<br>\r\n\"No, you did what you could.\" she replied, smiling weakly. Then, she felt Takeshi's hand grip hers slightly.Before she could gasp, Ino felt herself being pulled in, as her vision went black. After a few seconds, she found herself in what appeared to be a large cave. Turning around, Ino noticed a familiar head of hair and grin.<br>\r\n<br>\r\n\"Takeshi!!\" she cried, embracing him in a crushing hug. Takeshi returned the favour, before Ino gave him a confused look.<br>\r\n<br>\r\n\"What's going on here?\" she asked.<br>\r\n<br>\r\n\"We're inside my mind right now. Sephiroth helped me bring your spirit here for a while.\" he replied. As he did so, Ino noticed a man standing a short distance away (<a rel=\"nofollow\" href=\"http://finalfantasy.wikia.com/wiki/File:SephirothCGModel-CrisisCore.png\" target=\"_blank\">http://finalfantasy.wikia.com/wiki/File:...</a>).<br>\r\n<br>\r\n\"You must be Sephiroth.\" Ino said. Sephiroth nodded.<br>\r\n<br>\r\n\"Yes, I am. And you must be the young kunoichi that has captured my vessel's heart.\" he replied, smiling slightly, at which Ino blushed. Then Takeshi groaned, stumbling slightly.<br>\r\n<br>\r\n\"What's wrong?\" Ino asked.<br>\r\n<br>\r\n\"The reason is quite simple.\" Sephiroth told her. \"I haven't yet fully bonded with Takeshi, which is why he is dying. I am unable to purge the jutsu that is eating away at his chakra.\"<br>\r\n<br>\r\n\"I-Ino.\"Takeshi said, weakly.<br>\r\n<br>\r\n\"Yes?\" she replied.<br>\r\n<br>\r\n\"Before you leave, I just want you to know that...you're the most beautiful girl I've ever met. And please...don't forget me.\" He said, tears in his eyes.<br>\r\n<br>\r\n\"No!! You can't die!!\" Ino cried, tears running down her face. Takeshi kissed her sweetly, before her vision went dark again. When Ino could see again, she was in the hospital room, but something was wrong.<br>\r\n<br>\r\n... ...<br>\r\n<br>\r\nThe heart monitor was now emitting a steady tone, which meant only one thing. Sakura was crying into Naruto's chest, his arms around her. Kakashi was unreadable, except for a single tear that ran from his uncovered eye. Shikamaru and Choji were completely silent, while Tsunade had sat down, her face buried in her hands. After a few minutes, the group decided to give Ino some privacy. Once she was alone, Ino broke down crying.<br>\r\n<br>\r\n\"Why?! Why'd you have to leave me?!\" she sobbed, crying into the bedsheets. After a while, she sat up, rubbing her eyes, before looking at her love's face.<br>\r\n<br>\r\n\"Goodbye Takeshi, I promise I'll never forget you.\" she said. Then, Ino kissed him gently on the lips.<br>\r\n<br>\r\nBEEP...BEEP<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\nBEEP...BEEP<br>\r\n<br>\r\nThe heart monitor, silent up till then, was registering a steady heartbeat. Slowly, Takeshi's eyes fluttered open. He slowly sat sat up, clearly drained. But before he could recover, Ino wrapped her arms around his neck and kissed him with all the passion she held for him.</span></div></div>",
            "created":1308747360,
            "id":1131773,
            "title":"Farewell?"
        },
        "111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Two years later.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Takeshi wasn't sure what had happened. One minute he was floating towards the light, the next he was in a hospital bed with Ino kissing him furiously. After a few seconds, Ino broke away, snuggling up to her boyfriend.<br>\r\n<br>\r\n\"Ino?\" Takeshi asked, confused.<br>\r\n<br>\r\n\"I thought...I'd lost you...for good.\" Ino sobbed, tears of joy running down her cheeks. Takeshi wondered what had happened.<br>\r\n<br>\r\n<i>\"It's possible her love for you allowed me to finally bond with you, allowing me to remove that jutsu Orochimaru used on you and to replace the chakra you had already lost.\"</i> Sephiroth told him in his mind.<br>\r\n<br>\r\n<i>\"Hmm, you might be right. I guess he didn't count on that, did he?\"</i> Takeshi thought, smiling at the blonde kunoichi in his arms. After a few minutes, Tsunade, Naruto, Sakura and Kakashi came back in, doing a double-take upon seeing Takeshi alive. Tsunade rushed over, emracing Takeshi in a super-strong hug.<br>\r\n<br>\r\n\"You're alive!\" Tsunade cried, as Takeshi cried out in pain. Tsunade immediately released him, as the other three behind her cheered, Naruto being the loudest. <br>\r\n<br>\r\n\"Ow, I think you broke a couple of ribs!\" he complained. Everyone burst out laughing, apart from Ino, who latched back onto Takeshi, nuzzling under his chin. Takeshi blushed, not used to Ino displaying this much affection in front of other people. Tsunade had a confused look on her face.<br>\r\n<br>\r\n\"But...how did he survive? That jutsu should've killed him easily.\" she wondered.<br>\r\n<br>\r\n\"You're right. Any ideas, Takeshi.\" Kakashi asked his son. Takeshi nodded.<br>\r\n<br>\r\n\"Yeah. Sephiroth thinks that Ino's feelings for me allowed him to properly bond with me. That then allowed him to deal with that jutsu you mentioned.\" he replied. Everyone but Ino gaped at the news.<br>\r\n<br>\r\n\"Wait, you're telling us you actually spoke with him?\" Tsunade shouted in disbelief. Takeshi simply nodded, while Kakashi and Naruto looked slightly guilty, which Tsunade spotted.<br>\r\n<br>\r\n\"All right you two, tell me what you know.\" she ordered. Kakashi nodded, then proceeded to recount what he had seen at the temple, with Naruto occasionally adding in his view of what happened. Tsunade, Sakura and Ino were speechless at what he had to say.<br>\r\n<br>\r\n\"He defeated all four Hokage with one blow?!\" Sakura exclaimed, clearly caught off guard.<br>\r\n<br>\r\n\"Yes, from what I saw, Sephiroth is extremely powerful. I suspect he didn't even use half his strength in that fight as well.\" Kakashi replied. \"He's definitely as powerful as that myth suggests.\"<br>\r\n<br>\r\n\"What surprises me is that Orochimaru didn't know about him. He's always been known to have knowledge on this sort of thing.\" Tsunade said. \"But then again, Takeshi's people probably kept it a secret for that very reason.\".<br>\r\n<br>\r\nAfter a few more minutes of discussion, Tsunade decided to release Takeshi, seeing as Sephiroth had healed all of his wounds. Takeshi and Ino headed for the Hokage monument, to watch the sunset. As the sun slowly dipped below the horizon, Takeshi sighed.<br>\r\n<br>\r\n\"I still can't believe what happened back there.\" he said, referring to his battle with Orochimaru. Ino smiled, taking his hand.<br>\r\n<br>\r\n\"I never doubted you for a moment, you know that.\" she told him, pecking Takeshi on the cheek.<br>\r\n<br>\r\n\"I know. I can always count on you, can't I?\" he asked.<br>\r\n<br>\r\n\"Of course.\" Ino replied, as their lips met, the gleaming sun providing a majestic backdrop.</span></div></div>",
            "created":1309245600,
            "id":1136200,
            "title":"Miraculous Recovery."
        },
        "1111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Team 11's 1st mission.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Two years had passed since that fateful mission. An 18 year old Takeshi strode through the village, on his way to the Hokage Monument. Since the mission two years ago, he and Naruto had been promoted to Jonin, in light of their acheivements. Takeshi's outfit was now black where it had previously been blue (<a rel=\"nofollow\" href=\"http://images1.wikia.nocookie.net/__cb20090317063435/finalfantasy/images/d/df/Crisis_core_FF7_Zack_with_buster_sword.jpg\" target=\"_blank\">http://images1.wikia.nocookie.net/__cb20...</a>) to show his new rank. A few days ago, he'd decided to request a Genin squad, feeling he was ready for a little more responsibilty.<br>\r\n<br>\r\n<i>\"Hm, I wonder what my squad's gonna be like.\" </i> he thought, nearing the Monument.<br>\r\n<br>\r\n<i>\"Well, we'll soon find out. I'm sure you'll do fine regardless.\"</i> Sephiroth replied. Takeshi smiled. He and Sephiroth had talked every day since they met each other and had become good friends. Thanks to the fact they were properly bonded now, Takeshi had been able to create a few new jutsu, as a result of Sephiroth's chakra being so strong.<br>\r\n<br>\r\nA few minutes later, Takeshi could see Iruka and a group of Genin in front of the monument. Iruka appeared to be explaing the monument to his students, some of whom didn't appear very interested. Takeshi approached them, his presence only noticed by Iruka, who continued without pausing.<br>\r\n<br>\r\n\"Come on, Iruka-sensei! I;m gonna be the best ninja ever, so why should I be learning this?\" One of the genin, who Takeshi recognised as Konohamaru, said, standing up at the back of the group. Takeshi smirked, pulling out his sword, which he put beside Konohamau's head.<br>\r\n<br>\r\n\"You're never gonna be the best ninja if I can sneak up on you this easily.\" he said, causing the young Sautobi to jump, The rest of the class turned around, looking surprised to see Takeshi, whom none of them knew. Takeshi swung his sword twice, before spinning it and replacing it on his back.<br>\r\n<br>\r\n\"Cool!\" one of the students said. The rest stared in amazement.<br>\r\n<br>\r\n\"So who're you supposed to be?\" Konohamaru demanded.<br>\r\n<br>\r\n\"Name's Takeshi Hatake. And since I'm a jounin, I think I deserve a bit more respect than that.\" Takeshi replied. Konohamaru immediately shut up and sat back down.<br>\r\n<br>\r\n\"Nice of you to join us, Takeshi. And on time too!\" Iruka laughed.<br>\r\n<br>\r\n\"Come on! It's my father who's always late, not me.\" Takeshi replied. \"So, which of these genin are my squad?\"<br>\r\n<br>\r\n\"Ah yes, about that. Konohamaru! Hanabi!\" he shouted. Konohamaru stood up again, along with a girl with long, dark brown hair.<br>\r\n<br>\r\n\"Yes, sensei?\" they asked.<br>\r\n<br>\r\n\"Meet your new sensei, Takeshi. From now on, you'll be known as Squad 11.\" he told them.<br>\r\n<br>\r\n\"Fine.\" Konohamaru grumbled, while Takeshi laughed.</span></div></div>",
            "created":1313397360,
            "id":1168506,
            "title":"Two years later."
        },
        "11111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "A few months later.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>A few days later, Team 11 left the village on a simple mission. Tsunade wanted them to scout an area for any sign of the Akatsuki's whereabouts. The hope was that the Akatsuki wouldn't show up, but Takeshi knew that they probably would. In the past few days he'd watched Konohamaru and Hanabi as they trained and was impressed by what he saw. Konohamaru was a bit brash, like Naruto, but was quite skilled with ninjutsu and taijutsu. Hanabi's use of her Byakugan and the Gentle Fist style were amazing for someone her age.<br>\r\n<br>\r\n\"So sensei, what should we do if the Akatsuki do show up?\" Hanabi asked.<br>\r\n<br>\r\n\"Well, if it's just one of them, you should be okay if you stay, then at least you'll be able to learn a thing or two. But if more than one appear, run. There's no ay I can protect you properly from two of them at once.\" Takeshi replied. After a few hours, the group arrived at the edge of a large clearing between two forests. However, before they could continue, Takeshi felt something nearby.<br>\r\n<br>\r\n<i>\"Sephiroth, did you feel that?\"</i> he asked.<br>\r\n<br>\r\n<i>\"Yes, someone else is near.\"</i> Sephiroth replied. Takeshi held up his hand.<br>\r\n<br>\r\n\"Hold up, we're not alone.\" he told the other two. Konohamaru and Hanabi were surprised at first, but prepared for an attack. Suddenly, a voice came from behind them.<br>\r\n<br>\r\n\"Well, well. What have we here?\" The group spun around to confront their foe. Takeshi gasped when he recognised the person.<br>\r\n<br>\r\n\"You again?!\" he shouted. Kisame simply laughed.<br>\r\n<br>\r\n\"Good, I was afraid you'd forgotten me after all these years.\" he said. Takeshi remained silent, gripping his sword.<br>\r\n<br>\r\n\"Konohamaru, Hanabi, get back.\" he ordered. The two genin retreated to a safe distance.<br>\r\n<br>\r\n\"Well then, shall we?\" Kisame asked, drawing his Samehada. Takeshi smirked, then charged forward. Kisame did the same, their blades meeting in a shower of sparks. Takeshi pushed Kisame back, then launched a barrage of swift slices. Kisame managed to block them all, then swiped at Takeshi's feet. The jounin leaped, putting his sword on his back, quickly forming handsigns.<br>\r\n<br>\r\n\"Fire Style: Fireball Jutsu!\" he shouted, blowing an enormous ball of flame towards Kisame. <br>\r\n<br>\r\n\"Hmph, not bad. Water Style: Water Wall!\" Kisame shouted, forming a wall of water in front of him. The two jutsu's collided, covering the area with steam. Without waring, Kisame attacked through the steam. Takeshi swiftly blocked, holding his sword in one hand.<br>\r\n<br>\r\n\"What?!\" Kisame shouted.<br>\r\n<br>\r\n\"Now it's my turn!\" Takeshi shouted, punching Kisame in the chest. The rogue ninja flew through the air, slamming into a boulder nearby. He picked himself up, only slightly scratched.<br>\r\n<br>\r\n\"Impressive strength. You have improved.<br>\r\n<br>\r\n\"Then how about this?!\" Takeshi shouted, switching his sword to its other mode (<a rel=\"nofollow\" href=\"http://images2.wikia.nocookie.net/__cb20110218052443/finalfantasy/images/5/5d/Dissidia-FirstTsurugi.png\" target=\"_blank\">http://images2.wikia.nocookie.net/__cb20...</a>). He then started focusing his chakra into the sword. Blue electricity began forming between the two halves of the blade.<br>\r\n<br>\r\n\"What's that jutsu? Hm, no matter.\" Kisame said, before charging Takeshi again.<br>\r\n<br>\r\n\"Big mistake. Ninja Sword Art: Lightning Blade!\" Takeshi shouted, swinging the sword up over his head, bringing it down on the ground. A wall of blue light erupted from the sword, headed straight for Kisame, who could only block as the lightning wall crashed into his blade. Kisame was thrown back even further, through at least three boulders before coming to a stop. His body felt bruised and battered all over.<br>\r\n<br>\r\n\"Damn, he's too strong to fight by myself. I'd better retreat for now.\" he said, dashing away. Takeshi replaced his sword in his usual fashion, as his students came running up to him.<br>\r\n<br>\r\n\"That was amazing, Takeshi-sensei!\" Konohamaru exclaimed.<br>\r\n<br>\r\n\"Hey, all I did was make him retreat, I didn't properly defeat him. Anyway, we should head back now. It's clear the Akasuki are in the area. Now that they knew we're here, it's unwise to try and find them.\" he replied.</span></div></div>",
            "created":1313489340,
            "id":1169257,
            "title":"An Ominous Battle."
        },
        "111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "That night.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>A few months later, the training grounds echoed with the sound of clashing steel, as Takeshi and Ino engaged in a furious duel. Since she had demonstrated great proficeince with a sword, Takeshi had decided Ino should have her own blade, instead of using his.<br>\r\n<br>\r\nFlashback<br>\r\n<br>\r\n<i>\"So Takeshi, how am I doing?\" Ino asked.<br>\r\n<br>\r\n\"I have to say, you've improved amazingly over the past two years. I think you were meant to fight with a sword. Because of that, I have a present for you.\" he replied, bringing out a wooden box and placing it on the table. He opened it, revealing a beautifully crafted blade and scabbard (<a rel=\"nofollow\" href=\"http://fc02.deviantart.net/fs36/f/2008/279/c/d/Phoenix_Steel_Straight_Sword_by_weaponry_guild.jpg\" target=\"_blank\">http://fc02.deviantart.net/fs36/f/2008/2...</a>).<br>\r\n<br>\r\n\"It's beautiful, Takeshi.\" Ino gasped.<br>\r\n<br>\r\n\"Glad you like it. It's called the Phoenix Steel. I imbued it with fire chakra when I made it, so you'll be able to channel chakra into it, making cutting through something like a rock quite easy.\" Takeshi explained, before Ino jumped on him.<br>\r\n<br>\r\n\"Thank you so much!\" she cried, hugging him tightly.<br>\r\n<br>\r\n\"Ow! Maybe teaching you taijutsu was a bad idea.\" he complained, while Ino laughed.<br>\r\n</i><br>\r\nEnd Flashback<br>\r\n<br>\r\nThe two ninja continued to trade blows, until they ended up with their blades on each other's throats. Takeshi and Ino replaced their swords, Ino panting slightly. Since Takeshi gave her the sword, she'd decided her old outfit was too flashy and instead now wore an outfit more like Takeshi's (<a rel=\"nofollow\" href=\"http://www.google.co.nz/imgres?q=ninja+by+evil+monkey+chu&amp;um=1&amp;hl=en&amp;sa=G&amp;tbm=isch&amp;tbnid=XsATks7PSirItM:&amp;imgrefurl::EH::evil-monkey-chu.deviantart.com/art/Ninja-66291825&amp;docid=TdqvqKI1-926mM&amp;w=736&amp;h=1476&amp;ei=7ipSTr6GKojXiAKMsOx3&amp;zoom=1&amp;iact=rc&amp;page=1&amp;tbnh=161&amp;tbnw=80&amp;start=0&amp;ndsp=35&amp;ved=1t:429,r:0,s:0&amp;tx=44&amp;ty=61&amp;biw=1280&amp;bih=894\" target=\"_blank\">http://www.google.co.nz/imgres?q=ninja+b...</a>). The Phoenix Steel's scabbard was strapped to her back.<br>\r\n<br>\r\n\"Not bad, Ino. You're pretty good.\" Takeshi commented. Ino blushed.<br>\r\n<br>\r\n\"Well, I have a great teacher.\" she replied. Suddenly, they were interupted by Pakkun bursting out of a bush nearby. Takeshi knelt down on one knee.<br>\r\n<br>\r\n\"What is it, Pakkun?\" he asked.<br>\r\n<br>\r\n\"Tsunade needs the two of you back right now! One of the Akatsuki is heading for the village!\" he replied frantically. Takeshi's breath caught in his throat.<br>\r\n<br>\r\n\"Right, we're on it. Ino, let's go.\" he said. The blonde kunoichi nodded. The two dashed off, following Pakkun.<br>\r\n<br>\r\nA short while later, they arrived outside Tsunade's office building to find the other teams already there, along with Tsunade and Jiraiya.<br>\r\n<br>\r\n\"Good, you're here.\" Tsunade said.<br>\r\n<br>\r\n\"What's the situation?\" Takeshi asked, getting straight to the point.<br>\r\n<br>\r\n\"Right. Well, a few minutes ago, one of our scouts reported a large bird flying towards the village. Thanks to Neji and Hinata, we now know that the Akatsuki member called Deidara is riding on this bird.\" she explained.<br>\r\n<br>\r\n\"If I remember correctly, he uses Detonating Clay as his primary weapon. This could get messy\" Kakashi mused.<br>\r\n<br>\r\n\"And that's why I've evacuated the villagers to the shelters. The genin are with them for protection. You're here to try and stop Deidara.\" Tsunade explained.<br>\r\n<br>\r\n\"But that won't be easy. He can strike from the air. We can't get close enough to hit him.\" Jiraiya said. The others all nodded in agreement. Suddenly, Neji spoke up.<br>\r\n<br>\r\n\"Well, we'd better figure something out now. He's here!\" he told them. Takeshi scanned the sky, spotting a large white bird with someone riding on its back.<br>\r\n<br>\r\n\"What else can you see, Neji?\" he asked.<br>\r\n<br>\r\n\"Hold on. It looks like he's carrying some sort ofwhite bird statue. It looks to be about a foot tall and six inches thick.\" he replied.<br>\r\n<br>\r\n\"This bad. That's his most powerful bomb. It'll destroy at least half of the village if it hits.\" Kakashi said. As they watched, Deidara dropped his bomb. It transformed into its full size, ready to fall.<br>\r\n<br>\r\n<i>\"Sephiroth! I've got an idea, but I'll need to borrow your Masamune.\"</i>Takeshi said in his mind.<br>\r\n<br>\r\n<i>\"Sure, just be careful.\"</i> Sephiroth replied. Takeshi nodded.<br>\r\n<br>\r\n\"Guys, get back. I've got a plan.\" he said. The others looked sceptical, but moved back a few steps. Takeshi then made a few handsigns.<br>\r\n<br>\r\n\"Summoning Jutsu: Masamune!\" he shouted, holding his right hand out. Suddenly, Sephiroth's extremely long sword materialised in his hand. Takeshi watched as the bomb started to fall, his eyes now fluorescent blue-green. He jumped skyward as high as he could, creating a small crater from the force of his leap. As he began to slow down, he created a Shadow Clone. The clone grabbed his free hand, throwing him upward, speeding up his ascent.<br>\r\n<br>\r\n<i>\"Here we go.\"</i> he thought, channeling his and Sephiroth's chakra into the Masamune's blade, causing it to glow. After a few moments, Takeshi was close to the giant bomb.<br>\r\n<br>\r\n\"Take this! Draw Slash!\" he shouted, slashing the Masamune from left to right in front of him. A blade of energy shot forth, cleaving the bomb in two. The two halves exploded, throwing Takeshi towards the earth, as the Masamune disappeared.<br>\r\n<br>\r\n<i>\"Let's see if my new jutsu works.\"</i> he thought, rapidly forming handsigns.<br>\r\n<br>\r\n\"Ninja Art: Angel Wings Jutsu!\" he shouted. Two large, snow-white wings burst forth from his back. Takeshi flapped his wings, slowing himself down. He then caught his sword, which had fallen off when his wings formed, and flew towards Deidara.<br>\r\n<br>\r\n\"What?! You can fly?!\" he shouted.<br>\r\n<br>\r\n\"It's time to end this!\" Takeshi shouted. Deidara hurled a large number of his smallers bombs, burt Takeshi weaved through them all.<br>\r\n<br>\r\n\"You're done!\" he shouted, stabbing his blade through Deidara's chest. The rogue ninja coughed up blood, before he slumped over, dead. Takeshi pulled his sword out, grabbing Deidara's body with his free arm. When he landed, he dumped the body unceremoniously on the ground, as the others ran over to him.<br>\r\n<br>\r\n\"Nice work, Takeshi!\" Naruto shouted. Takeshi grinned.<br>\r\n<br>\r\n\"When did you get these? They're beautiful.\" Ino asked, brushing her hand over the feathers of Takeshi's left wing.<br>\r\n<br>\r\n\"It's a new jutsu I've been working on. To be honest, I wasn't sure it would work. So I just...winged it.\" he replied.<br>\r\n<br>\r\n\"Corny.\" Naruto said, before Sakur bonked him on the head. Takeshi made a handsign, causing the wings to dissipate, leaving behind a few snow-white feathers.<br>\r\n<br>\r\n\"I must say, I'm impressed Takeshi. You've fought two Akatsuki members single handed and killed one of them.\" Tsunade said.<br>\r\n<br>\r\n\"Hey, I'm just glad I stopped him.\" Takeshi replied.<br>\r\n<br>\r\n</span></div></div>",
            "created":1313846520,
            "id":1171756,
            "title":"Attack the Leaf Village!"
        },
        "1111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The battle!",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Later that evening, Takeshi and Ino were in his apartment, cuddling on the sofa whilest watching TV. Takeshi especially enjoyed these opportunities when the two could simply enjoy the other's warmth.<br>\r\n<br>\r\n\"Hey, Takeshi?\" Ino asked.<br>\r\n<br>\r\n\"Hm?\" he replied.<br>\r\n<br>\r\n\"I was just thinking...are the Akatsuki going to attack the village? I mean, they wouldn't have sent Deidara for any other reason, right?\"<br>\r\n<br>\r\n\"I was thinking the same thing. I've seen first hand what they'll do to a village that gets in their way.\"<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"It happened two years before Naruto came back. The Akatsuki came to my village and killed everyone. But for some reason they spared me, probably because of Sephiroth.\"<br>\r\n<br>\r\n\"Takeshi...I'm sorry.\"<br>\r\n<br>\r\n\"Don't be, it's not your fault.<br>\r\n<br>\r\n\"But you've been carrying that around for four years, why didn't you tell me?\"<br>\r\n<br>\r\n\"I didn't want you to worry. Besides, it's not something I like remembering.\" he replied. Ino smiled warmly.<br>\r\n<br>\r\n\"Well then, how about I help you forget about it?\" she asked getting to her feet, pulling Takeshi up as well. Despite his slight protest, she led him to the bedroom. The two had been living together for roughly two months, so they'd swapped out the previous single bed for a king size one. When Takeshi turned around after closing the door, he was surprised to find Ino already under the covers, which by the way they framed her figure, meant she wasn't wearing anything underneath.<br>\r\n<br>\r\n\"Ino, what're you...\" Takeshi stuttered. Sure, they'd slept in the same bed, but not like this!<br>\r\n<br>\r\n\"C'mon, I want this. Besides, it'll help take your mind off you know what.\" she replied. Takeshi looked down to find his clothes lying on the floor.<br>\r\n<br>\r\n\"How...\"<br>\r\n<br>\r\n\"A little jutsu I came up with. How do you think I got undressed so fast?\" she replied. Takeshi slipped under the covers as well, sliding his arms around Ino's slim frame, his heart beating rapidly.<br>\r\n<br>\r\n\"You ready?\" Ino asked teasingly. Her seductive smile threw Takeshi's doubts out the window.<br>\r\n<br>\r\n\"I was born ready.\" he replied, kissing Ino passionately.<br>\r\n<br>\r\nThe next morning, Takeshi felt a warm ray of sunlight stream across his face. Reluctantly, he opened his eyes. Through the window he could see some of the other buildings waking up as well. A small weight on his chest caused him to look down. In his arms, lay a sleeping Ino, her blonde hair splayed out over her bare back. Takeshi smiled, stroking her hair slowly as he recalled the previous night.<br>\r\n<br>\r\n<i>\"What did I do to deserve you, Ino?\"</i> he wondered. Slowly the kunoichi shifted, her eyes fluttering open, before she yawned quietly.<br>\r\n<br>\r\n\"Morning, my angel.\" Takeshi said. Ino looked up at him, smiling.<br>\r\n<br>\r\n\"You don't have to flatter me every time you speak, you know. You showed me last night how you truely feel.\" she replied, pushing her pelvis against him suggestively, before catching her lover's mouth in a deep kiss. After a few seconds they broke apart, enjoying the warm sunlight streaming through the open window. After about half an hour, they reluctantly got out of bed and got dressed, before enjoying a pancake breakfasty, which Takeshi prepared in record time. After breakfast, Ino decided to tag along while Takeshi met his squad that morning. Takeshi made it no secret that he was very proud of Konohamaru and Hanabi. Just two month's ago, he'd decided the two were ready for the Chunin Exams, despited Tsunade's reluctance. To everyone's amazement, both genin had passed each portion of the exam with flying colours. The two new chunin insisted it was because of Takeshi's training, but he knew that the two were exeptionally skilled, like their parents.<br>\r\n<br>\r\n\"Takeshi-sensei! Ino-sensei!\" Konohamaru called out, as the two jounin arrived at the usual meeting spot.<br>\r\n<br>\r\n\"Hey Konohamaru, Hanabi.\" Takeshi replied. Behind him, Ino smiled. She loved how good Takeshi was when it came to kids.<br>\r\n<br>\r\n<i>\"He'll make a great father.\"</i> she thought, as the four chatted for a while, since Team 11 had no missions at the moment. After an hour, the two chunin excused themselves, saying they had plans for the rest of the day. Takeshi agreed, bidding them farewell. He knew exactly what they ment. He'd seen how the two teens looked at each other, the same way he and Ino looked at each other.<br>\r\n<br>\r\n\"Ah, young love.\" he said.<br>\r\n<br>\r\n\"They're just like us, aren't they?\" Ino asked, resting her head on his shoulder.<br>\r\n<br>\r\n\"I guess you're right.\" he replied. Suddenly, Takeshi spotted a black bird fly overhead, a scroll carrier attatched to its leg.<br>\r\n<br>\r\n\"A black carrier bird? Who would use a...\" he wondered aloud, before realisation struck, causing him to gasp.<br>\r\n<br>\r\n\"Takeshi, what's wrong?\" Ino asked.<br>\r\n<br>\r\n\"We'd better head over to Tsunade. There's only one place that bird could've come from.\" he replied. Ino nodded following his train of thought. The two sword-ninja sprinted towards their destination.<br>\r\n<br>\r\nWhen they arrived, they found Naruto, Sakura and the rest of the village jounin already there. At her desk, Tsunade sat frozen, her eyes gaping at the scroll in front of her.<br>\r\n<br>\r\n\"Takeshi, it's...\" Kakashi sad, before Takeshi cut in.<br>\r\n<br>\r\n\"I figured it out already.\" he replied.<br>\r\n<br>\r\n\"This isn't good.\" Jiraiya said. \"One Akatsuki was enough, but all of the remaining members at once?\"<br>\r\n<br>\r\n\"It's clear what their mentality is. They want both Naruto and Takeshi, and they're prepared to destroy the village to do it.\" Kakashi said.<br>\r\n<br>\r\n\"But what can we do? Even if we get everyone into the shelters, that won't protect the village itself, not from a full scale battle.\" Tsunade said.<br>\r\n<br>\r\n\"How about this? We engage them a few miles outside the village? Not only will it buy time, but it'll stop the village from taking any major damage.\" Takeshi suggested.<br>\r\n<br>\r\n\"True, but what's stopping them from bypassing us? They've got the numbers and strength to do it.\" Guy asked.<br>\r\n<br>\r\n\"Simple, I'll lead the group to hold them up. Since they want me, they'll be forced to fight us.\" Takeshi replied. Everyone in the room gasped.<br>\r\n<br>\r\n\"Are you crazy?! That's suicide!\" Sakura shouted.<br>\r\n<br>\r\n\"Maybe so, but if I don't do this, the villaghe will be destroyed. Besides, they haven't seen everything Sephiroth and I can do.\" he replied.<br>\r\n<br>\r\n\"Takeshi...\" Ino whispered.<br>\r\n<br>\r\n\"All right Takeshi, we'll try it. We've still got a few hours before they get here.\" Tsunade said. \"Shikamaru, you'll lead the others and the genin in getting the villagers to safety and protecting them.\"<br>\r\n<br>\r\n\"Got it.\" Shikamaru replied.<br>\r\n<br>\r\n\"Meanwhile, myself, Jiraiya, Takeshi, Naruto, Kakashi and Guy will do everything we can to keep the Akatsuki at bay. Clear?\" Tsunade asked.<br>\r\n<br>\r\n\"Yes, Lady Hokage!\" they replied.<br>\r\n<br>\r\n\"Good. Shikamaru, get the evacuations underway, but do it calmly. Don't let anyone know what's really coming, or they'll panic.\" Tsunade said.<br>\r\n<br>\r\n\"You can count on me.\" he replied.<br>\r\n<br>\r\nA few hours later, they were gathered in front of the gates to the village. The group was just waiting for Takeshi to turn up, then they could go their separate ways. Suddenly, Takeshi jumped down from a tree landing nearby. As he approached, they were surprised by his new outfit. It now consisted of just one armoured shoulder pad, with less baggy pants and sort of cloak on the left side of the pants. On the left arm was a long, billowing black sleeve, while the right arm was exposed (<a rel=\"nofollow\" href=\"http://th04.deviantart.net/fs19/PRE/f/2007/256/8/c/REUNION_WIP_STEP_2_by_Wen_JR.jpg\" target=\"_blank\">http://th04.deviantart.net/fs19/PRE/f/20...</a>). On the back was an arrangement of belts and buckles. This arrangement held Takeshi's original sword (<a rel=\"nofollow\" href=\"http://cosplaysky.com/media/catalog/product/cache/2/image/5e06319eda06f020e43594a9c230972d/F/F/FF7-Final-Fantasy-VII-Cloud-Strife-Buster-Sword-A1-Cosplay-1.jpg\" target=\"_blank\">http://cosplaysky.com/media/catalog/prod...</a>), along with a hollow sword (<a rel=\"nofollow\" href=\"http://fc09.deviantart.net/fs70/i/2011/165/f/b/hollow_sword_by_wh1pla5h-dnsah0.jpg\" target=\"_blank\">http://fc09.deviantart.net/fs70/i/2011/1...</a>), two serrated swords (<a rel=\"nofollow\" href=\"http://fc04.deviantart.net/fs71/i/2011/165/a/3/serrated_sword_by_wh1pla5h-dnsayn.jpg\" target=\"_blank\">http://fc04.deviantart.net/fs71/i/2011/1...</a>), and two switchblade swords (<a rel=\"nofollow\" href=\"http://fc02.deviantart.net/fs71/i/2011/165/d/8/switchblade_sword_by_wh1pla5h-dntrvu.jpg\" target=\"_blank\">http://fc02.deviantart.net/fs71/i/2011/1...</a>).<br>\r\n<br>\r\n\"Since when did you have all of those?\" Kakashi asked.<br>\r\n<br>\r\n\"For a while. Since we're facing the Akatsuki, I need all the power I can get.\" Takeshi replied.<br>\r\n<br>\r\n\"But how can you fight with six blades?\" Guy asked.<br>\r\n<br>\r\n\"You'll see soon enough.\" Takeshi replied.<br>\r\n<br>\r\n\"Okay people, let's get miving, we don't have much time.\" Tsunade announced. Ino quickly ran over to Takeshi.<br>\r\n<br>\r\n\"Be careful.\" she told him.<br>\r\n<br>\r\n\"Don't worry, I'll be fine.\" he replied, kissing her briefly before dashing off.<br>\r\n<br>\r\n<i>\"Takeshi...just come back, alright?\"</i></span></div></div>",
            "created":1314022860,
            "id":1172955,
            "title":"The Approach of Judgement."
        },
        "11111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Kakashi/Guy/Naruto vs Kisame.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>After exiting the village, the group began running full speed. The plan was to intercept the Akatsuki in a large plain a few miles outside the village. This would mean that they wouldn't have to worry about getting separated or lost. As the reached the field, a rain of kunai fell from the sky. Everyone instinctively dodged, the kunai hitting bare earth.<br>\r\n<br>\r\n\"What the...\" Takeshi said, seeing the kunai were made from what looked like...paper. Looking up, he spotted a figure wearing the Akatsuki's uniform, flying by wings made of paper.<br>\r\n<br>\r\n\"Of course...Konan. She uses paper as her weapons, but she's very dangerous.\" Kakashi said. Suddenly, the rest of the Akatsuki appeared as well, a few hundred metres away. The Leaf ninja all assumed their respective stances, ready for an attack. Takeshi drew his usual sword and the hollow sword, before linking them together (<a rel=\"nofollow\" href=\"http://fc03.deviantart.net/fs16/f/2007/162/3/9/First_Tsurugi___Sword_1_and_2_by_mogcaiz.jpg\" target=\"_blank\">http://fc03.deviantart.net/fs16/f/2007/1...</a>).<br>\r\n<br>\r\n\"Akatsuki...\" Takeshi growled, feeling his hatred for the group that killed his family. \"Kakashi, I'll handle Konan for now. You guys keep the rest occupied.\"<br>\r\n<br>\r\n\"Alright, be careful.\" Kakashi replied. Takeshi nodded, performing his Angel Wings Jutsu again. He took off, flying straight at Konan. At the same instant, the Akatsuki charged forward, closing the distance quickly.<br>\r\n<br>\r\n\"Get ready!\" Jiraiya shouted. He, Kakashi ans Naruto began forming hand signs.<br>\r\n<br>\r\n\"Fire Style: Fireball Jutsu!\" they shouted, simultaneously blowing massive balls of flame. Apart from Hudan and Kakuzu, the other five swiftly dodged the fire, only to be met by Guy and Tsunade, who forced them back.<br>\r\n<br>\r\n<u><b>Takeshi vs Konan</b></u><br>\r\n<br>\r\n\"So, you're the brat who holds the One Winged Angel? I expected more. Still, you did manage to kill Deidara, so you can't be compltely hopeless.\" onan taunted, throwing more paper shurikan and kunai. Takeshi evaded, while deflecting any that got too close. Then he charged forward. Before Konan could readt, Takeshi activated his Kousokudo, vanishing into thin air from his speed. Konan was caught completely of guard, allowing Takeshi to get up close and decapitate her with one slash of his blade. Takeshi watched her body fall towards the ground trailing scraps of paper.<br>\r\n<br>\r\n\"Sorry, but there's only room for one angel.\" he said heading back down.<br>\r\n<br>\r\n<u><i>Leaf vs Akatsuki</i></u><br>\r\n<br>\r\nMeanwhile, things weren't going as well for the others. Although Naruto had managed to kill Sasori with his Rasenshuriken, the rest of the Akatsuki were proving ro be a tough challenge. Guy was struggling against Kakuzu, surprised to find the rogue ninja was as skilled with taijutsu as he was. Tsunade meanwhile was focused on the scythe-wielding Hidan.<br>\r\n<br>\r\n\"So, Kakashi, shall we?\" Itachi asked, as the two Sharingan users squared off.<br>\r\n<br>\r\n\"Gladly.\" Kakashi replied, as the two charged forward. Kakashi threw a few kunai, which Itachi deflected with his own. The two met, exchanging a series of powerful blows, before Kakashi managed to land a hit in Itachi's stomach. As he doubled over, Kakashi leaped back, charging his Chidori, or Lightning Blade.<br>\r\n<br>\r\n\"Not bad, you have improved.\" Itachi said, summoning a doxen Shadow Clones.<br>\r\n<br>\r\n\"It ends for you, Itachi...right here!\" Kakashi shouted, charging forward. Itachi's clones attacked, attempting to stop the Copy ninja. Kakashi evaded each one, before plunging his Lightning Blade into a startled Itachi.<br>\r\n<br>\r\n\"But, how?\" Itachi gasped.<br>\r\n<br>\r\n\"Never underestimate me.\" Kashi replied, as Itachi's body fell to ground.<br>\r\n<br>\r\n<i>\"Better go help Naruto. Kisame won't be an easy one.\"</i> Kakashi thought, leaping away.<br>\r\n<br>\r\n<u><b>Guy vs Kakuzu</b></u><br>\r\n<br>\r\n<i>\"Damn, this guy's good!\"</i> Guy thought, as Kakuzu effortlessly blocked his Leaf Hurricane. Suddenly, Kakuzu was forced to siengage as Takeshi's sword landed between them. Takeshi arrived moments later, pulling his blade out of the ground, splitting it into its separate swords before replacing them in their holsters.<br>\r\n<br>\r\n\"Takeshi, nice timing!\" Guy said, giving his classic pose.<br>\r\n<br>\r\n\"No problem, how's it going?\" Takeshi replied, as the two faced Kakuzu.<br>\r\n<br>\r\n\"Hard. This guy's just as fast and as strong as me. I can't land a single hit.\" Guy replied.<br>\r\n<br>\r\n\"Can you hold him for a few seconds? I think I have something that might work.\"<br>\r\n<br>\r\n\"Sounds good, let's go!\" Guy replied, racing forward. Kakuzu followed suit, the two meeting again in a furious clash.<br>\r\n<br>\r\n<i>\"Better hurry, I don't want to keep Guy waiting!\"</i> Takeshi thought, as he formed the handsigns for another of his new jutsu. Once he was done, he charged towards the duel.<br>\r\n<br>\r\n\"Guy! Now!\" he shouted. Guy responded, leaping clear of Kakuzu.<br>\r\n<br>\r\n\"Try this! Ninja Art: Death Jutsu!\" Takeshi shouted, slamming his open palm into Kakuzu's chest. The ninja looked stunned for a second, before he collapsed on the ground.<br>\r\n<br>\r\n\"Nice wirk, Takeshi. What jutsu was that?\" Guy asked.<br>\r\n<br>\r\n\"I call it the Death Jutsu. Basically, it'll kill anyone it comes into contact with by draining their chakra in an instant. However, because of that I can't use it too often.\" Takeshi explained.<br>\r\n<br>\r\n\"I see. Impressive as always, Takeshi.\" Guy replied. \"I'll go help Kakashi and Naruto. You go find Tsunade and Jiraiya.\"<br>\r\n<br>\r\n\"Right\" Takeshi agreed, as the two went their separate ways.<br>\r\n<br>\r\n<u><b>Tsunade/Jiraiya vs Hidan</b></u><br>\r\n<br>\r\nTsunade leaned back, narrowly dodging Hidan's three-bladed scythe. Jiraiya attacked again with a Rasengan, but Hidan didn't even flinch, before the Toad Sage was forced to retreat again.<br>\r\n<br>\r\n\"Damn, we're getting nowhere.\" Jiraiya said, as Hidan smirked at them.<br>\r\n<br>\r\n\"It doesn't matter if he's immortal, there's got to be a way to beat him.\" Tsunade replied. They both turned around as Takeshi arrived.<br>\r\n<br>\r\n\"Oh good, finally some help!\" Jiraiya said.<br>\r\n<br>\r\n\"Give me a break! I've already killed Konan, Kakuzu, and bailed out Guy. I can't be everywhere at once!\" Takeshi protested.<br>\r\n<br>\r\n\"Well now that you're here, any ideas?\" Tsunade asked.<br>\r\n<br>\r\n\"On it.\" Takeshi replied. He then performed a quick series of handsigns.<br>\r\n<br>\r\n\"Summoning Jutsu: Mokujin Squad!\" he shouted, placing his palm on the ground. A cloud of smoke appeared, clearing to reveal eight wooden figures (<a rel=\"nofollow\" href=\"http://www.gameinformer.com/cfs-filesystemfile.ashx/__key/CommunityServer-Discussions-Components-Files/72/1106.mokujin.jpg\" target=\"_blank\">http://www.gameinformer.com/cfs-filesyst...</a>) standing in front of Takeshi. One by one, their eyes light up, glowing red. All eight assumed a basic stance.<br>\r\n<br>\r\n\"That's an interesting summon.\" Jiraiya said.<br>\r\n<br>\r\n\"They're called the Mokujin Squad. It's a summoning jutsu passed down through my old village. Each of the Mokujin are made from wood that's been soaked in strengthening fluids for over 300 years, making them stronger than steel. In addition, they know every form of taijutsu ever created. They're the ultimate close combat fighters.\" Takeshi explained.<br>\r\n<br>\r\n\"Whatever. They're no match for me.\" Hidan said.<br>\r\n<br>\r\n\"We'll see about that. Mokujin Squad, attack!\" Takeshi shouted. The Mokujin all charged forward, attacking the immortal from all sides. Hidan blocked the first three, but the other five landed a barrage of crushing blows with their iron ball fists. Hidan was knocked to the ground, before another Mokujin kicked him into a nearby tree.<br>\r\n<br>\r\n\"Heh, not bad.\" Hidan said, getting back up. But it'll take more than that to beat me.\"<br>\r\n<br>\r\n\"You're right. Good thing I've got plenty more.\" Takeshi replied. \"Mokujin, hold him!\" The Mokujin moved swiftly, trapping Hidan and his weapon with their chains. Takeshi charged forward, his sword charged with blue lightning.<br>\r\n<br>\r\n\"Ninja Sword Art: 1000 Lightning Strikes!\" Takeshi shouted, activating his Kousokudo, before slashing Hidan multiple times. After a split second, Takeshi replaced his sword, as Hidan went limp in the Mokujins' chains, dead. Takeshi released the summoning, causing the Mokujin to disappear in a cloud of smoke.<br>\r\n<br>\r\n\"How did he do that? I thought Hidan was immortal.\" Tsunade said.<br>\r\n<br>\r\n\"I think I know. Think about it, he dekivered 1000 blows, each with the same power as one Chidori. It effectively burnt of everything in Hidan's body. Even he can't survive something like that.\" Jiraiya explained.<br>\r\n<br>\r\n\"He sure is one heck of a ninja.\" Tsunade said.</span></div></div>",
            "created":1314184140,
            "id":1174133,
            "title":"Let the Battle Begin!"
        },
        "111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Back at the village.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile, Naruto, Kakashi and Guy had their hands full dealing with Kisame. Since he had almost as much chakra as Guy and Kakashi combined, his jutsu were incredibly powerful.<br>\r\n<br>\r\n\"What's wrong? Am I too much for you?\" Kisame taunted, as the ninja faced off.<br>\r\n<br>\r\n\"Guy, flank him from the right, I'll go left. Naruto, you charge straight in.\" Kakashi whispered. The other two nodded, as the three chraged forward. Then they split up, Guy and Kakashi moving to the sides while Naruto prepared the Rasengan.<br>\r\n Kisame fended off the attacks from either side, but was caught completely off guard by Naruto. The Rasengan threw Kisame into a nearby boulder, cracking it from the force of the impact.<br>\r\n<br>\r\n\"Well, not bad. For a kid.\" Kisame said, getting to his feet. <br>\r\n<br>\r\n<i>\"Hey Fox, I need two tails. That should be enough.\"</i> Naruto thought.<br>\r\n<br>\r\n<i>\"Coming up, kid. Just don't get yourself killed.\"</i> the Nine Tails replied. Naruto felt a massive surge of chakra, as a red aura enveloped his body. Two tails made up of red chakra sprouted from his back, his eyes turning red.<br>\r\n<br>\r\n\"Well, this is interesting.\" Kisame said, preparing for his own attack. Naruto formed another Rasengan, only this time using the Nine Tails' chakra. Naruto charged Kisame with a yell, closing the distance quickly. Kisame smirked, raising his Smaehada to block. However, as soon as the Rasengan made contact, it burned through the blade, before tearing through Kisame's chest.<br>\r\n<br>\r\n\"But...how?\" Kisame gasped, before he fell down, dead. Naruto sighed with relief as the aura subsided. Kakashi caught him as he fell down from exhaustion. Moments later, Takeshi arrived with Tsunade and Jiraiya.<br>\r\n<br>\r\n\"Looks like things are under control here.\" Takeshi said.<br>\r\n<br>\r\n\"Believe it! Where've you been?\" Naruto said.<br>\r\n<br>\r\n\"Just...helping out.\" Takeshi replied, causing them all to laugh. Suddenly, a slim black blade stabbed into Tsunade's chest from out of nowhere. She didn't even cry out as she fell to the ground.<br>\r\n<br>\r\n\"Tsunade!\" Takeshi shouted. Then, they all heard a laugh. They turned to see another Akatsuki with red hair in the distance.<br>\r\n<br>\r\n\"Nagato...\" Jiraiya growled, as Kakashi rushed over to Tsunade.<br>\r\n<br>\r\n\"She needs help now! We've got to head back.\" he said, lifting the Hokage's limp body. Takeshi remained where he was.<br>\r\n<br>\r\n\"You go on ahead, Kakashi. I've got some business to take care of.\" he replied, drawing his sword.<br>\r\n<br>\r\n\"Are you insane?! Nagato's too powerful for you!\" Jiraiya shouted.<br>\r\n<br>\r\n\"Well, we'll find out soon, won't we?\" Takeshi replied. As he said this, he began connecting each of his six swords together, forming a massive blade, larger even than the Samehada (<a rel=\"nofollow\" href=\"http://fc00.deviantart.net/fs70/i/2011/165/4/3/first_tsurugi_fusion_sword_by_wh1pla5h-d3iw240.jpg\" target=\"_blank\">http://fc00.deviantart.net/fs70/i/2011/1...</a>). <br>\r\n<br>\r\n<i>\"Sephiroth, I'll need some of your chakra for a bit.\"</i> Takeshi thought.<br>\r\n<br>\r\n<i>\"All right, but be cautious. I sense this foe is...different.\"</i> Sephiroth warned. Takeshi nodded. Suddenly he felt Sephiroth's powerful chakra flowing through his body. His eyes changed frome gold to fluorescent blue-green.<br>\r\n<br>\r\n\"All right Nagato, let's see what you can do!\" Takeshi yelled, charging forward. Nagato didn't respond, simply forming handsigns, before hurling a large boulder towards Takeshi. Takeshi smirked, slashing at the boulder, cutting it half. Undeterred, he continued forward. The Akatsuki leader shot more of the slim blades from before, all aimed at Takeshi. The Leaf ninja ejected one of the switchblade swords, using both blades to deflect the incoming threat.<br>\r\n<br>\r\n\"Is that all you've got?!\" Takeshi shouted.<br>\r\n<br>\r\n\"Far from it.\" Nagato replied. He clapped his hands together, forming a dark orb of gravity between them <br>\r\n<br>\r\n\"Chibaku Tensei!\" he shouted, throwing the orb into the air. Takeshi was pulled into it, as the orb ribbed large chunks of earth out of the ground, which ended up compressed around Takeshi, trapping him.<br>\r\n<br>\r\n\"Takashi!\" Naruto shouted. However, after a few seconds, cracks appeared in the earth surrounding Takeshi. Suddenly, the orb broke apart in a flash of lifght, as Takeshi landed on his feet, on the edge of the crater formed by the technique.<br>\r\n<br>\r\n\"Impossible!\" Nagato said.<br>\r\n<br>\r\n\"Not bad, now it's my turn!\" Takeshi shouted. with his kekkei genkai, he closed the gap before Nagato could react. With a powerful punch, he sent Nagato flying upwards. Takeshi leaped after him. Then he held his sword in front of him, as the five blades attatched to it disengaged and floated around Nagato. Takeshi released the main sword, which flew upwards to hover above Nagato. Takeshi then grabbed one of the five swords around Nagato and slashed him with it, his body glowing blue with raw chakra. Takeshi repeated this seven more times, leaving a glowing blue silhouette of himself holding each of the five blades. Takeshi then leaped higher, grabbing his main sword, before descending down towards Nagato. As he did so, each of the silhouettes slashed the Akatsuki leader with their blades. Finally, Takeshi slashed down through Nagato, releasing a shockwave of chakra as the strike connected. Takeshi landed on the ground, the five blades stuck into the ground around him. The main blade fell down to be caught by Takeshi (<a rel=\"nofollow\" href=\"http://www.youtube.com/watch?v=HusTZVx_z_E&amp;feature=player_embedded\" target=\"_blank\">http://www.youtube.com/watch?v=HusTZVx_z...</a>), as Nagato's body exploded into a fine red mist, which quickly dissapated.<br>\r\n<br>\r\n\"That's the price you pay.\" Takeshi mused, as her relinquished Sephiroth's chakra, his eyes returning to normal.</span></div></div>",
            "created":1314282840,
            "id":1174904,
            "title":"The Six Fusion Swords!"
        },
        "1111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "Tsunade's office.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Takeshi caught up with the others outside the village gate. Kakashi had gone on ahead with Tsunade and Jiraiya, while the others waited for Takeshi.<br>\r\n<br>\r\n\"Hey, sorry I'm late.\" Takeshi said. The others gave a grim smile.<br>\r\n<br>\r\n\"Don't worry about it, Takeshi.\" Naruto replied.<br>\r\n<br>\r\n\"I just...hope Tsunade's all right. She's been...like a mother to me since I came here.\" Takeshi said. The others nodded, Naruto especially sympathising with him. The group re-entered the village, to find Ino and Sakura waiting for them. The two kunoichi rushed to meet their respective boyfriends.<br>\r\n<br>\r\n\"Takeshi!\" Ino cried, wrapping her arms around him tightly. \"You're alright...\"<br>\r\n<br>\r\n\"I told you I'd be fine, didn't I?\" Takeshi replied, before giving her a passionate kiss. Meanwhile, Naruto and Sakura had their little reunion.<br>\r\n<br>\r\n<u><b>Later, at the hospital</b></u><br>\r\n<br>\r\n\"No...\" Takeshi gasped, unable to comprehend what he'd just heard. Shizune had just explained that despite everything she'd done, Tsunade had been too severely injured and had passed away. Takeshi held a crying Ino his arms, shedding his own tears as well. Kakashi's expression was unreadable, but his body language reflected his sorrow. The other ninja, Neji, Shikamaru etc were each speechless, their grief obvious in their eyes. Sakura was comforting Naruto, who was weeping while holding the necklace Tsunade had given him.<br>\r\n<br>\r\n\"Naruto, Takeshi? I need to speak with you about something briefly. Could you meet me in Tsunade's office in two hours?\" Shizune asked. She would've preferred to deal with the matter sooner, but knew that the two needed some time to sort things out. Both ninja agreed, before leaving to try and grasp what ad just occured.<br>\r\n<br>\r\n<u><b>Takeshi/Ino's apartment</b></u><br>\r\n<br>\r\n\"It's all right, Takeshi. It wasn't your fault.\" Ino said, rubbing his back soothingly.<br>\r\n<br>\r\n\"I know, it's just...I wish I could've done something.\" Takeshi replied. Thanks to Ino, he was feeling a bit better, but Tsunade's death was a massive shock for him. She had taken him in without any fuss when he had nowhere to go. She'd given him a new family, and more importantly the chance to meet Ino. For her to die was like losing his mother all over again.<br>\r\n<br>\r\n\"I know, but remember, I'm here for you, Takeshi.\" Ino replied, kissing him lightly on the cheek. Takeshi looked at her, his expression now happy rather than depressed. Ino smiled back as the two embraced, comforting each other with their warmth and presence.<br>\r\n<br>\r\n</span></div></div>",
            "created":1314369600,
            "id":1175507,
            "title":"The Price of Battle."
        },
        "11111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "The ceremony.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Tsunade's office</b></u><br>\r\n<br>\r\nTwo hours later, Naruto, Takeshi, Kakashi and Shizune were gathered in Tsunadr's office, where Shizune proceeded to draw a scroll from inside the desk.<br>\r\n<br>\r\n\"So, what did you want us for?\" Takeshi asked.<br>\r\n<br>\r\n\"This...is Tsunade's will. She wrote it out a few weeks ago, probably because she anticipated something like this.\" Shizune explained.<br>\r\n<br>\r\n\"And what does it have to do us?\" Naruto asked. <br>\r\n<br>\r\n\"Well, according to this, Tsunade was planning make a slight change to the shinobi rank system.\" Shizune replied.<br>\r\n<br>\r\n\"What kind of change?\" Takeshi asked.<br>\r\n<br>\r\n\"She'd decided to make Sannin an official rank. Up till now, Sanin was simply a term applied to herself, Orochimaru and Jiraiya. However, as of now, it's an official ninja rank. Only one shinobi can hold the rank of Sannin at any one time, and in terms of authority the only person they are subordinate to is the Hokage. As a result, only the most capable ninja can be selected.\"<br>\r\n<br>\r\n\"Whoa.\" Takeshi breathed.<br>\r\n<br>\r\n\"Don't be too surprised, Takeshi. The will also mentions who Tsunade selected for this rank. So congratulations, Takeshi. As of this moment, you're officially promoted to Sannin.\"<br>\r\n<br>\r\n\"S-Seriously?\" Takeshi stuttered, slightly shocked at what he'd just heard.<br>\r\n<br>\r\n\"Yes. Takeshi, there's no denying how skilled and powerful you are. You managed to kill five of the most powerful shinobi in the world single handed. Besides that, the two ninja you taught became chunin at least a year earlier than normal. You're more than qualified.\" Kakashi pointed out.<br>\r\n<br>\r\n\"I just...I'm so honoured. I'll try not not to screw up too badly.\" Takeshi replied.<br>\r\n<br>\r\n\"Glad to hear it. Anyway, moving on.\" Shizune said. \"Tsunade also mentioned something regarding her successor. She'd been talking this over with me for a while, so I suspect she was planning to step down soon. And the person she nominated as her successor, was you Naruto.\"<br>\r\n<br>\r\n\"W-What?!\" Naruto exclaimed.<br>\r\n<br>\r\n\"I mean it. Tsunade put it to the council, and everyone voted in your favour. They've finally started to see you as a person, not just a Jinchūriki host. So congratulations, Sixth Hokage.\" Shizune replied, grinning.<br>\r\n<br>\r\n\"Yes! Beleive it!\" Naruto shouted. Takeshi laughed while Shizune and Kakashi smiled.<br>\r\n<br>\r\n\"As for your inauguration, we've decided to move it to two months from now, to allow for Tsunade's funeral.  We'll also announce Takeshi's promotion at the same time, so try and keep it a secret, okay?\" Shizune asked.<br>\r\n<br>\r\n\"No problem!\" they both replied.</span></div></div>",
            "created":1314455580,
            "id":1176069,
            "title":"Revelations."
        },
        "111111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "3 months later.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Hokage Tower balcony</b></u><br>\r\n<br>\r\n(Takeshi's POV)<br>\r\n<br>\r\nI stood on the balcony of Hokage Tower overlooking the entire village. The rumble of the crowd that had gathered gave me a constant reminder that Konoha was one of the largest villages in all of the Elemental Nations. Ino stood next to me, along with Naruto andSakura, while Jiraiya, Kakashi and Shizune stood behind us. The Council Elders were currently giving their speech, approaching the part wher they would announce Naruto's appointment and my own. Although Naruto was putting on a brave face, I can honestly say I've never seen him this nervous!<br>\r\n<br>\r\n\"Hey Naruto, take it easy. Stressing'll only make it worse.\" I said, nudging him. Naruto let out a deep breath.<br>\r\n<br>\r\n\"Easy for you to say, Takeshi. You're not about to become Hokage, Mr Sword God.\" he replied sarcastically. I laughed a bit at Naruto using my nickname again. Since a few month's ago, I found out that I was featured in the bingo books over all the Elemental Nation, with most of them having given my the nickname \"The Sword God\". I have to admit I was a bit surprised, but Iliked the title right away.<br>\r\n<br>\r\n\"Listen, you'll be fine. After all, you've got the future Mrs Uzumaki here, right?\" I said, grinning. Certainly, few were surprised when Naruto proposed to Sakura about a month ago. We all knew it would happen eventually (although I did try to help Naruto get it over and done with before the ceremony).<br>\r\n<br>\r\n\"I guess you're right.\" he replied, gripping Sakura's hand. She smiled at him sweetly, both of them off in their own little world.<br>\r\n<br>\r\n<i>\"Sephiroth, you think I should?\"</i> I asked.<br>\r\n<br>\r\n<i>\"Yes. It's clear you both deeply love each other, you might as well ask her now.\"</i> he replied.<br>\r\n<br>\r\n<i>\"Right, thanks.\"</i> I replied, just as the Council announced who would succeed Tsunade, the crowd cheering at hearing Naruto's name. The council motioned for Naruto to step forward, which he did.<br>\r\n<br>\r\n\"Naruto Uzumaki, do you swear to protect this village, with your life if need be?\"<br>\r\n<br>\r\n\"I do.\"<br>\r\n<br>\r\n\"Do you swear by the honor of our village's name to lead us to the best of your ability, to serve it with the best of intentions?\"<br>\r\n <br>\r\n\"I do.\"<br>\r\n <br>\r\n\"Then by the power given to the Council, we hereby pass the title of Hokage down to you.\" they said, placing the hat on Naruto's head. \"Congratulations, Sixth Hokage.\" The crowd cheered even louder than before, the noise almost deafening now. Naruto stepped forward to make his speech to the people.<br>\r\n<br>\r\n\"...people of Konoha...I stand here today...honored.\" he began, \"I spent my life, living for this moment. The moment to finally achieve the highest honor a ninja of Konoha can achieve...many of you may know this, having personally met me...\"<br>\r\n<br>\r\nThe people fell silent, listening to his every word.<br>\r\n<br>\r\n\"Some of you may have doubted me in the past...though I suppose many of you are the reason I got to this point today...\"<br>\r\n <br>\r\nIno looked at me, smiling warmly. I put a hand on her shoulder, a small comforting gesture. She put her hand over mine, as Naruto continued.<br>\r\n<br>\r\n\"I will be the first to admit that my life was nothing to brag about...but I always believed that if I continued to strive and work for what I believed in that someday I would achieve my dream...\"<br>\r\n <br>\r\n\"I promise that as long as I serve as Hokage that I will do all that I can to insure its peace and prosperity. I promise that I will look into the local issues, as well as those involving foreign affairs. I will do all that I can to bring Konoha into the greatest era it has seen yet.\"<br>\r\n <br>\r\n\"People of the Leaf Village, I know that many of you are aware of what I hold within me. Many of you may hold a grudge against me for it...but I will tell you right now, I have it under control. As of today, I lift the law created by the Third Hokage, and the secret of me being a Jinchuuriki is no more. I will not hold this secret any longer. If I am to be Hokage, then the first thing I must do is have my people's trust.\"<br>\r\n<br>\r\n\"My father had entrusted me with that burden when I was first born. I do not wish to tarnish that trust he had in me by hiding the truth from all of you. I am the container of the Nine-tailed Fox, but nothing more. I can use it's powers, but only to a certain degree. Will the fox take over me? No. Will the fox be the death of me. Not likely. Does my status as a Jinchuuriki affect the village at all? Without a doubt...but I will not let this fact be our doom. I am strong not because of the Nine Tailed Fox, but because of how hard I have worked to become the shinobi I am today...\"<br>\r\n<br>\r\n\"To me...all of you are my family. Only recently have I found out of my lineage...but I still see all of this village as a part of who I am, and what I am. It's because of all of you that I am what I am today. It is because of this village that I want our children...and our children's children to have the opportunity to lead successful lives of their own. Again...I promise all of you that as long as I am Hokage, I will do all I can to insure this village's peace and prosperity. That is a promise...and I never go back on my word...for that is my nindo!\" he finished. For a short while, there was an eerie silience, before it was ubruptly broken.<br>\r\n<br>\r\nThen Kiba let out a hooting cheer, \"Yeah, Naruto!!\" With that, the village burst into applause, cheers and shouting reaching insane volumes. Naruto grinned so wide I thought his face would split. Then, the Council members stepped forward once more.<br>\r\n<br>\r\n<i>\"All right, showtime!\"</i> I thought, as they spoke.<br>\r\n<br>\r\n\"In addition to Naruto's appointment as Hokage, we have one further announcement. As of this day, the title of Sannin will be an official ninja rank, and we have already chosen a ninja who has proved himself more than worthy.\" they said, motioning in my direction. Nervously, I stepped forward, into the crowd's view.<br>\r\n<br>\r\n\"People of the Leaf Village, we present to you the first official Sannin, Takeshi Hatake!\" Once again, the villagers erupted into cheers, with my father joining in as well. Smiling, I motioned for Ino to join me, as the village fell silent again.<br>\r\n<br>\r\n\"People of the Leaf, thank you very much for your kindness. If I may, I have an announcement of my own to make.\" I then turned to face Ino, going down on one knee. I heard many of the villagers gasp in surprise.<br>\r\n<br>\r\n\"Ino, when I first met you, I felt something that I thought I would never feel again in my heart. You have been so supportive throughout everything I've been through, throughout these two long years. Ino Yamanaka, will you marry me?\" I aslked, pulling out the ring I'd bought two months earlier. It was a simple golden ring, with a small topaz set in it, the Leaf Village symbol carved into it. Ino put her hands to her mouth, tears running down her cheeks, as she gasped in shock. Suddenly she grabbed my hand with both of hers, smiling joyfully.<br>\r\n<br>\r\n\"Yes! Of course I'll marry you, Takeshi!\" she cried. I stood back up, sliding the ring onto her left hand, as the village cheered once more.<br>\r\n<br>\r\n<u><b>Later, the Hokage's Office</b></u><br>\r\n<br>\r\nAn hour later, myself, Shizune, Ino, Sakura, Naruto and Kakashi were gathered in the Hokage's (Naruto's) office. Ino hadn't let go of me since the ceremony, still clinging to my arm while admiring her ring. Mean while, Naruto kept fiddling with his hat, constantly adjusting it.<br>\r\n<br>\r\n\"Naruto quit messing around with the hat, will ya?\" Sakura asked. Naruto chuckled, before doing as she said.<br>\r\n<br>\r\n\"Sorry Sakura, I'm just excitied. I can't believe it's finally happened.\" he replied. I smirked.<br>\r\n<br>\r\n\"Yeah well, just remember. I might be your right-hand man now, but don't expect me to bail you out if you screw up, all right?\" I said.<br>\r\n<br>\r\n\"Don't worry, he's got me for that.\" Sakura replied. Everyone including myself laughed loudly, before Ino turned to face me.<br>\r\n<br>\r\n\"Takeshi, now that we're engaged, there's something I need to tell you.\" she said.<br>\r\n<br>\r\n\"What is it?\" I asked. Ino looked conflicted, as if unsure of what to say, or rather, how to say it.<br>\r\n<br>\r\n\"Well, I...I'm pregnant, Takeshi.\" she said quietly. Everyone was shocked, while Ino looked sad.<br>\r\n<br>\r\n\"R-Really?\" I stuttered, trying to recover my wits after the bombshell my future wife had just dropped.<br>\r\n<br>\r\n\"I-I'm sorry...\" she sobbed, before I cut her off with a kiss.<br>\r\n<br>\r\n\"That's great, Ino! We're gonna be parents!\" I cried. Ino looked up at me in astonishment.<br>\r\n<br>\r\n\"You're not mad?\"<br>\r\n<br>\r\n\"How could I be? I love you, remember? So, how long?\" I asked.<br>\r\n<br>\r\n\"About two months now. I also know I'm carrying twins.\" she replied.<br>\r\n<br>\r\n\"Well Takeshi, looks like you've got quite the burden now. I'm proud of you.\" Kakashi said, putting a hand on my shoulder. I looked back at him.<br>\r\n<br>\r\n\"Thanks dad.\" I said.<br>\r\n <br>\r\n <br>\r\n <br>\r\n<br>\r\n <br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1315219380,
            "id":1181504,
            "title":"The Ceremony."
        },
        "1111111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "It's time!",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Takeshi &amp; Ino's apartment</b></u><br>\r\n<br>\r\n(Takeshi's POV)<br>\r\n<br>\r\nThree months later, Ino and I were now officially husband and wife. After Ino revealed she was carrying our children both her family and Kakashi agreed that it was best to have the wedding quickly, to avoid a scandal. We'd also moved into a luxury apartment near the Hokage building, thanks to my generous pay. Being Sannin does have its perks, after all.<br>\r\n<br>\r\nCurrently, I was busy cleaning my swords. Although having six swords that can combine is incredibly versatile, it can be pain sometimes.<br>\r\n<br>\r\n\"Takeshi! Come here quickly!\" Ino shouted from the living room. I immediately dropped what I was doing (not literally) and ran in. Surprisingly all I found was Ino sitting on the couch, a hand on her bare belly, which by now was visibly growing.<br>\r\n<br>\r\n\"What's the emergency?\" I asked, kneeling in front of her. <br>\r\n<br>\r\n\"The babies are kicking.\" she replied, placing my hand on her stomach. Suddenly, there it was; a tiny thump against my hand. Then another. I was speechless, so much emotion flowing through my mind to speak. After a few more minutes, I stood up and sat down next to Ino. She immediately wrapped her arms around me, snuggling closer, being careful of her extra size. I embraced her back, slowly carressing her belly.</span></div></div>",
            "created":1315232040,
            "id":1181583,
            "title":"A Tiny Miracle."
        },
        "11111111111111111111":{
            "author_id":"anzac",
            "author_name":"Anzac",
            "choices":[
                "At home.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Leaf Village Hospital, 6 months later</b></u><br>\r\n<br>\r\n(Takeshi's POV)<br>\r\n<br>\r\nSix months later, Ino and were relaxing on the balcony, when her water suddenly broke. Despite the fact that I was near panic, I managed to get her to the hospital quickly, where Sakura came and helped us to a room. Currently, Ino's contraction were coming about every five or six minutes, indicating she was getting close. She was panting slightly from the pain of the contractions, her forehead covered in a thin film of sweat. I was kneeling beside the bed, holding her hand, while Sakura was waiting to tell Ino to start pushing. Naruto, Kakashi and Ino's family were outside, waiting for any news. Her parents had visited briefly a few minutes ago, giving their daughter some emotional support.<br>\r\n<br>\r\n\"Okay Ino, you're almost fully dilated now. You'll be able to start pushing soon.\" Sakura told us.<br>\r\n<br>\r\n\"Takeshi, I...I'm scared.\" Ino said, looking at me. I smiled back.<br>\r\n<br>\r\n\"Don't worry, you'll be fine. I'm here for you.\" I replied.<br>\r\n<br>\r\n\"Okay Ino, when I say now, push as hard as you can, alright?\" Sakura asked. Ino nodded briefly.<br>\r\n<br>\r\n\"Okay...NOW!\" Sakura shouted. Ino pushed, screaming in pain, her hand clenching mine. I grunted from her sudden burst of strength.<br>\r\n<br>\r\n\"I can see the head! Once more...NOW!\" Sakura said. Ino pushed again, her screams intensifying. Suddenly, I heard a baby's cry, along with Sakura's gasp.<br>\r\n<br>\r\n\"Congratulations you two! Looks like we've got a healthy baby boy here!\" she told us. I looked at Ino happily, just before she felt another sharp contraction. Sakura cut the umbilical cord and handed our son over to another nurse, then got ready for the second baby.<br>\r\n<br>\r\n\"Okay Ino...NOW!\" she shouted. Ino again pushed with all her strength, crying out in pain. I almost screamed myself, her grip became so strong.<br>\r\n<br>\r\n\"One more time...NOW!\" Sakura said. Inmo pushed once more, screaming even louder if possible. I couldn't imagine the pain she was in right now, but I was so proud that she wasn't letting it stop her. Once again, I heard the wonderful sound of a baby crying, as Sakura cut the umbilical cord of our second child.<br>\r\n<br>\r\n\"And it's a girl!\" she said, handing our daughter over to the nurse again. The babies were cleaned up as Ino fell back from exhaustion, panting heavily. I smiled, wiping the sweat off her forehead.<br>\r\n<br>\r\n\"You did Ino. I'm so proud of you.\" I told her. She looked to me with untold joy in her eyes, completey drained of energy. A few minutes later, Sakura came back holding two small bundles in her arms, one blue and the other pink.<br>\r\n<br>\r\n\"Here you go, you two. Two healthy kids.\" she said handing the two babies to Ino. Ino took them in her arms, gazing at the two babies with what I could only describe as a mother's love. The boy had some slight blonde hair, slightly more vivid than Ino's while the girl had some faint black hair like mine. I was surprised to notice that both babies' hair had a slight silvery sheen to it. I made a mental note to ask Sephiroth about that later on.<br>\r\n<br>\r\n\"They're so beautiful.\" she whispered. I gently patted her arm, watching my children sleep. I looked up to see everyone else coming into the room. Ino's parents rushed to the other side of the bed, kneeling beside their daughter.<br>\r\n<br>\r\n\"Well done, dear. They're both gorgeous.\" her mother said, while her father smiled.<br>\r\n<br>\r\n\"So, any thoughts on their names?\" Sakura asked. Everyone else looked at us, clearly thinking the same thing. Ino and I looked to each other. We'd actually been discussing names before she went into labour, and we'd decided on what we'd choose.<br>\r\n<br>\r\n\"The boy's name is Shiro, and the girl is Tsubaki.\" Itold them, knowing Ino was still worn out.<br>\r\n<br>\r\n\"Those're lovely names.\" Ino's mother said. <br>\r\n<br>\r\n\"Takeshi, you want to hold shiro?\" Ino asked. I nodded, as she placed the sleeping form in my arms.<br>\r\n<br>\r\n\"Here...just support his head.\" she told me. I shifted so that I was holding Shiro the same way she was holding Tsubaki. I felt an overwhelming love as I looked down at the baby in my arms. My son. Suddenly, I felt my mind get pulled somewhere else. I found myself standing in a large cave, with Sephiroth standing next to me.<br>\r\n<br>\r\n\"Sephiroth, what's going on?\" I asked.<br>\r\n<br>\r\n\"I don't know, Takeshi.\" he replied. Then, a man wearing a red coat and holding a red-bladed sword appeared in front of us (<a rel=\"nofollow\" href=\"http://images1.wikia.nocookie.net/__cb20110225233727/finalfantasy/images/3/3e/GenesisCGModel-CrisisCore.png\" target=\"_blank\">http://images1.wikia.nocookie.net/__cb20...</a>).<br>\r\n<br>\r\n\"Who are you?\" I asked.<br>\r\n<br>\r\n\"I am Genesis. The demon spirit that dwells within your son.\" the man replied.<br>\r\n<br>\r\n\"Genesis, it's been a while.\" Sephiroth said.<br>\r\n<br>\r\n\"It has, my friend. I see Taksehi and you have worked well together. I hope I can do the same with Shiro.\" Genesis replied.<br>\r\n<br>\r\n\"Wait, so are you two related in any way?\" I asked, confused.<br>\r\n<br>\r\n\"In a way, yes. Sephiroth and myself have always been tied to each other. So it makes sense that, because Sephiroth manifested himself inside you, that I would manifest in your son.\" Genesis explained. \"Now then, I'll let you get back to your friends. Farewell.\" As he said this, I found myself back in the hospital room, still holding Shiro. I decided to mention Genesis later. Suddenly, Shiro yawned quietly, before opening his golden eyes, which also had slight blue flecks. He gazed up at me as I gazed down at him.<br>\r\n<br>\r\n\"Hey Shiro, I'm your daddy.\" I said, tickling his cheek. Shiro giggled, grabbing my finger with his tiny hand. I sighed, amazed at how far I'd come since I first arrived in the village five years ago.</span></div></div>",
            "created":1315666500,
            "id":1184573,
            "title":"It's time!"
        }
    },
    "info":{
        "author_id":"anzac",
        "author_name":"Anzac",
        "brief_description":"When a new ninja joins the village, a new power is unleashed.",
        "created":1306132980,
        "description":"<td align=\"left\" class=\"norm\">The story begins just after Naruto returns to the Hidden Leaf village after two years. In his absence, a new ninja named Takeshi has joined the village, but Tsunade has kept this fact a secret from most of the village, except for a few of the Jounin.<br>\r\n<br>\r\n<u>Takeshi</u><br>\r\nAge: 16 years old.<br>\r\nHeight: 170cm.<br>\r\nHair: Black, short, slightly covers left eye.<br>\r\nEyes: Golden (turn almost fluorescent blue-green when using Sephiroth's chakra).<br>\r\nBuild: Athletic, but muscular.<br>\r\nSpecialities: Taijutsu, Ninjutsu, Sword Combat.<br>\r\nKekkei Genkai: Kousokudo (The Speed of Light).<br>\r\nPersonality: Normally quite laid back and friendly, cool, calm and collected in battle, cares greatly for his friends.<br>\r\nWeapons: 4 foot broadsword, later 5 foot buster sword.<br>\r\nAlso posseses the demon spirit Sephiroth, 10 times as powerful as the Nine Tailed Fox.<br>\r\n<br>\r\nOnly rule: 1st pathway is my story eg. 1,1,1,1,1 etc. All other pathways are free for you all to add to.</td>",
        "id":1778609,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1315666500,
        "modified":1315666500,
        "pretty_title":"Naruto: Advent Ninja"
    }
}