{
    "chapters":{
        "1":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto",
                "Dragon Ball Z",
                "Soul Eater",
                "Fairy Tail",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There's lots of anime out there. Time to choose one. </span></div></span></div>",
            "created":1325653200,
            "id":1252633,
            "title":"First Choices"
        },
        "11":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto",
                "Naruto: Shippuden"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The original Naruto (Part 1) or Naruto: Shippuden (Part 2)?</span></div></span></div>",
            "created":1325653200,
            "id":1252635,
            "title":"Naruto"
        },
        "111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto",
                "Sasuke",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252636,
            "title":"Naruto"
        },
        "1113":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Kiba",
                "Shikamaru",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lots of guys in Naruto.</span></div></span></div>",
            "created":1325653200,
            "id":1252639,
            "title":"More"
        },
        "112":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto",
                "Sasuke",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252640,
            "title":"Naruto: Shippuden"
        },
        "1121":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Kiba",
                "Shikamaru",
                "Konohamaru"
            ],
            "content":"<div class=\"\"><div> <span>Naruto Uzumaki walked down the streets of Konoha; arms laced behind his head. The spiky haired blond had just come back from a mission that took much longer than expected. As a result he had eaten barely anything the last few days and was starving!<br>\r\n<br>\r\n“Ugh, I need some grub.” Naruto told himself as he touched his growling belly with one hand. His blue eyes glanced around for a place to eat. As he looked slightly behind him he noticed his favorite restaurant: Ramen Ichiraku. “Oh wow! I wasn’t paying attention and almost walked by Ichiraku!” Naruto mentally slapped himself for the near mistake and hurried toward the small shop; the smell of ramen pulling him toward it by his nose. <br>\r\n<br>\r\n“Naruto! I thought I heard your stomach growling out there!” Teuchi greeted the young ninja as he appeared through the sliding door.<br>\r\n<br>\r\n“Hehe.” Naruto chuckled as he blushed and scratched the hair on the back of his head. The orange ninja took a seat on one of the stools in front of him before speaking to the older man. “Well I’m starving! Get me something really filling, Teuchi!” Naruto barked in his usual hyperactive voice. <br>\r\n<br>\r\n“Filling, eh?” the chef scratched his chin before smiling. “Well, that’d be most of your usuals, but I have something special for you today!” the restaurant owner turned away from Naruto and started preparing his favorite customer’s meal. Naruto blinked in curiosity; wondering what the man had planned. It was Ayame who spoke up moments later.<br>\r\n<br>\r\n“A friend of father’s stopped by not long ago,” the girl stated to explain. “He gave us a very strange herb that’s apparently really good in ramen dishes.”<br>\r\n<br>\r\n“That’s right!” Teuchi cut in as he stood over a boiling pot. “See, he’s also in the ramen business and he says this stuff’s been making him a fortune. It’s supposed to shrink your hunger right down!” <br>\r\n<br>\r\n“Oooh…” Naruto watched as the older man prepared the ramen; his mouth already drooling and his ears only listening to half of what he was saying. He was just too famished to care where the delicious smelling ramen came from. After a few more minutes Teuchi carried over a steaming bowl of ramen and placed it in front of Naruto. The blond teen stared at the bowl of goodness with pure joy, though he didn’t recognize any difference compared to a normal bowl of pork ramen. <br>\r\n<br>\r\n“Unfortunately, he only gave me enough for one bowl. You’ll have to decide whether I go ask him if he can sell me any of the stuff!” <br>\r\n<br>\r\n“Well it smells the same…” Naruto muttered as he separated his chopsticks. “But it’s the taste that matters! Ikadakimasu!” The sixteen year-old genin immediately got to work scarfing down the ramen. Teuchi and Ayame both watched as their #1 customer consumed the contents of the bowl as if he inhaled the meats and noodles. It was a sight they were very used to and in just five minutes Naruto was already picking up the bowl and pouring the last of the broth down his throat. “Wow!” Naruto shouted as he slammed the bowl down upon the counter. He leaned back and gave his stomach a few pats. “That was great! Your friend was right, I’m really-“<br>\r\n<br>\r\nBefore he could finish, the young teenager disappeared in a cloud of white smoke. The two ramen chefs stared in disbelief as the smoke dissipated and revealed an empty stool where Naruto once sat.<br>\r\n<br>\r\n“Not again…” the older chef said with a sigh as he recalled the last time Naruto had vanished like this in his restaurant. “Now how am I supposed to know if these herbs are worth buying?”<br>\r\n<br>\r\n“Don’t worry, father. He’ll be back soon like last time.” Ayame replied as she gathered up Naruto’s bowl and chopsticks and brought them to the sink.<br>\r\n<br>\r\n Unbeknownst to the father and daughter, Naruto was still very much among them this time. For you see, Teuchi’s “friend” was actually a bitter rival of his who harbored a deep hatred for him and his successful ramen shop. The rival had thus given Teuchi a dangerous herb that spelt doom for whoever consumed it. The bitter rival knew the tainted ramen would be prepared only for Teuchi’s best customer. Without their best customer, Ichiraku’s business would surely dwindle. Speaking of dwindle…<br>\r\n<br>\r\n“W-What?” Naruto stuttered, blinking in confusion. He was still seated like he was seconds ago, but this time he was sitting on a strange green landscape. No longer was he looking into the faces of his two favorite ramen chefs; they had just vanished. “What’s going on?! Did you summon me away again, Fukasaku?!” Naruto shouted for the toad sage as he leaped to his feet, but he saw no sign of him…or anyone for that matter. “Where am I?!” Right after shouting this, the Leaf ninja went wide eyed and looked down at the green “land” below him. Slowly he bent down and touched it; the texture, while thicker, was much like the seats of Ichiraku! “N-No way…that’s impossible.” Naruto fell back onto his butt as his body shook in fright. He was STILL in Ichiraku…but his seat was now enormous! For it to be mistaken for a whole other landscape he had to be ant sized…maybe even smaller! “T-This has to be a dream…Teuchi wouldn’t give me a ramen that-“<br>\r\n<br>\r\nBefore Naruto could finish reassuring himself, he heard a loud sound behind him. The blue eyed, shrunken ninja turned his head around to see that someone had slid open the door to Ichiraku and stepped in. Naruto craned his neck and gaped as the titanic figure of a fellow ninja stood before him; his shadow surrounding him. Naruto recognized the titan’s clothes, face, and soon his voice. It was none other than…</span></div></div>",
            "created":1337835600,
            "id":1344065,
            "title":"Shrinking Hunger"
        },
        "11213":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Naruto survives.",
                "Naruto is crushed."
            ],
            "content":"<div class=\"\"><div> <span>The young, mountainous figure that towered over Naruto was Konohamaru Sarutobi. Naruto couldn’t believe it was the same spiky haired genin he knew, however. The kid he knew was a whole head shorter than him, but this Konohamaru…he was bigger than anything Naruto thought could exist in this world!<br>\r\n<br>\r\n“Hey, old man!” Konohamaru greeted; his youthful, child-like voice booming in Naruto’s eardrums. The young teenager closed the sliding door behind him and glanced over the empty row of stools in front of him. “No one else here today?”<br>\r\n<br>\r\n“Well, you just missed Naruto.” Ayame replied to the young shinobi as she washed Naruto’s bowl in a sink; any remnants of that mysterious herb disappearing down the drain. <br>\r\n<br>\r\n“Oh, boss just left?” Konohamaru asked as he took a step further into the small shop. The whole time Naruto was staring up at the looming kid; his neck craned back just to see his face. The miniscule blood stood there paralyzed, his mouth gaped open in shock and his fingers twitching. Unintelligible sounds came from the ramen lover’s throat; he was just unable to come up with a word to describe his situation. That one step brought the titanic Konohamaru so close to Naruto that the older male fell onto his butt trying to keep his eyes on the boy’s face. For a moment the fox boy’s vision was completely taken up by the pale green of Konohamaru’s jacket. A second later the young genin swung a leg over Naruto’s head and the tiny boy’s eyes grew even wider. <br>\r\n<br>\r\n“FUCK!” Naruto cursed loudly as he looked up and saw nothing but the gray clad butt of his rival/apprentice. Konohamaru was about to sit down…right on top of him! Not a thought of escape crossed Naruto’s mind in the following milliseconds. He didn’t even move, for he knew there was no point. There was no way he could escape something so massive; not even if he was ten times faster. He would need a space/time jutsu, and even then he wouldn’t have enough time to use it. The only thing the gnat of a ninja could do was brace himself.<br>\r\n<br>\r\nWith a THUMP Konohamaru sat himself down on the stool; unknowingly pinning Naruto under his bigger body. Naruto was smashed between the seat and the giant kid’s butt; flat on his back and totally helpless. <br>\r\n<br>\r\n“You could say that,” Teuchi replied to the young customer’s question. “So, what’ll it be?”<br>\r\n<br>\r\n“Hmmm…” Konohamaru thought for a moment before answering. “I’ll have something with beans in it! I have an odd craving for some…” Konohamaru giggled as he licked his lips in anticipation.<br>\r\n<br>\r\n“Beans, eh? Coming right up!” The Ichiraku owner nodded before starting on the order. Meanwhile, by some miracle, Naruto was not a pasty stain under Konohamaru’s rump (at least not yet…). The poor orange-clad ninja had been caught right between the giant boy’s butt cheeks and temporarily saved from a humiliating end. He still felt the heavy, unforgiving weight of the giant boy, however, as it slowly crushed him into the cushioned stool. The shrunken blond could barely move at all; in fact the only thing he could move was his mouth.<br>\r\n<br>\r\n“Ugh…t-this can’t be happening!” Naruto exclaimed to himself as he tried his best to squirm underneath the sitting titan, but to no avail. “Konohamaru!! Get off me!!” The tiny ninja put all his strength into his struggling, but made no progress whatsoever. The giant brat was just too impossibly big; all Naruto could do was wait and hope he stood up soon.<br>\r\n<br>\r\nAnd wait he did. It doesn’t take particularly long for Teuchi to prepare a bowl of ramen, but for Naruto the wait was unbearable. Every second was spent enduring the unbelievable weight of the giant above him. Within the first ten seconds Naruto’s face became covered in sweat due to the immense heat collecting underneath Konohamaru’s rump. The teenage shinobi laid there panting and trying to understand how a typical visit to Ichiraku has suddenly turned into a life or death situation. He was alive right now, but he couldn’t help imagining Konohamaru adjusting his position on the stool. These stools weren’t exactly Grade A after all and the simplest movement on Konohamaru’s part would spell instantaneous doom for him. <br>\r\n<br>\r\n“Here you are, kiddo!” Teuchi called as he placed a steaming bowl of ramen in front of the scarf wearing teenager. A line of drool dripped down Konohamaru’s mouth as he gazed at the bean sauce topped noodle bowl. <br>\r\n<br>\r\n“Mmmmm! Smells great!” the brown haired boy shouted as he grabbed his chopsticks, picked up the bowl, and dug in. He wasn’t as fast as Naruto, but after watching the older ninja eat ramen so much he tried his best to mimic his boss. While Konohamaru stuffed his boyish face he was unaware of Naruto’s suffering underneath him. The blond fox boy grunted as he felt his ribs start to creak from the pressure the giant of a boy was putting on him. It made him understand how fragile he was at this size; the mere twist of the butt or even a slide to the right would obliterate his tiny frame. The worst part, however, was that Naruto was consumed in complete darkness and silence. The massive ass flattening him blocked out any and all light and sound. He would never see his demise coming and that made him tremble in fear. </span></div></div>",
            "created":1338094800,
            "id":1346000,
            "title":"A Big Pain in the Ass"
        },
        "112132":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "content":"<div class=\"\"><div> <span>“Ow ow! K-Konohamaru…!” The tiny Nine-Tails Jinjuriki hissed out in pain as he felt something crack. This was really happening: he was being crushed to death under his own friend! The godly boy had no clue either! “I-I can’t die…not like this!” the blond ninja spat as a trickle of blood dripped from his mouth. Things were quickly accelerating to a gruesome end; at this rate Naruto would burst like a grape no matter what Konohamaru did! The great Naruto, hero of the village, fated to end his ninja career under the ass of someone not even half as strong as him. As Naruto’s face was pinned onto its side and it became difficult to speak, the teenage genin started hyperventilating for a few seconds. However, the shrunken young man suddenly took a deep breath of the musky, hot air and calmed himself down. He couldn’t lose it now; he had to believe in the boy he shared a brotherly bond with! Konohamaru would never kill him; not even unintentionally!<br>\r\n<br>\r\n“I’m not…dying here…” Naruto mumbled as he sported his signature smug smirk. “Because I’m Naruto Uzumaki, the-!”<br>\r\n<br>\r\n<i>*squish*</i><br>\r\n<br>\r\n“Ahhhh, delicious!” shouted Konohamaru as he finished drinking the broth out of the bowl and slammed it down on the counter. His cute face blushed with delight as the young shinobi slid back on the stool and rubbed his belly happily. <br>\r\n<br>\r\n“That was fast! Almost as fast as Naruto.” Teuchi spoke as he took the empty ramen bowl from Konohamaru. “You’re one of his rivals, right? Are you aiming to be my second best customer, kiddo?” The older man chuckled amusingly. <br>\r\n<br>\r\n“Eh?” Konohamaru raised an eyebrow as he removed a bit of money from his wallet. “Well…Naruto’s going to be the Sixth Hokage one day and then he won’t have as much time to eat here. That’s when I’ll be your Number 1 customer, old man!” the spiky haired kid paid for his meal and gave the chef a thumbs up. He then hopped out of his seat and left the small restaurant; leaving Teuchi and his daughter to laugh. As Konohamaru walked down the crowded streets of the Leaf Village, none of his passersby noticed the dark, speck-sized smudge on his pants.</span></div></div>",
            "created":1338094800,
            "id":1346588,
            "title":"Too Small for Bonds"
        },
        "1122":{
            "author_id":"vashorchihide",
            "author_name":"Male Stomper",
            "choices":[
                "Uzumaki house",
                "Inuzuka compound",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>\"Dammit\", Sasuke cursed as he walked along Madara's hideout. It had been about a week since he had fought against Naruto, Kakashi, Sakura,and Danzo.He had gained his even stronger Sharingan bye transplanting his eyes with Itahi's.<br>\r\n<br>\r\n\"Naruto how did you get so strong, even strong enough to repel my Chidori\", he muttered as he entered the hideout's lab.Almost instantly he noticed a set of vile's that had been set out and their description. Some read human animal permanent transformations. One he found read The ultimate Uchiha Test-only those with fully mastered eyes and unmatchable speed should take this or 100% chance of death.<br>\r\n<br>\r\n\"Well  I am the greatest Uchiha a live so I can handle it easily\". With that said he took a sip, and was engulfed in a purple cloud of smoke.After a few coughs the smoke cleared and Sasuke realized he was in some one's house.<br>\r\nNot only that but as he looked around his eyes started to shoot out of his head.<br>\r\n<br>\r\n\"How did I get transported and shrunken\"! Sasuke screamed at the top of his voice. just then a giant figure walked into view.He looked up and realized that he is in the</span></div></div>",
            "created":1327986000,
            "id":1268753,
            "title":"Sasuke"
        },
        "1123":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Kiba",
                "Shikamaru",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More guys.</span></div></span></div>",
            "created":1325653200,
            "id":1252641,
            "title":"More"
        },
        "12":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Goku",
                "Gohan",
                "Vegeta",
                "Multiple Characters",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252644,
            "title":"Dragon Ball Z"
        },
        "122":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Kid Gohan",
                "Teen Gohan",
                "Adult Gohan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Gohan?</span></div></span></div>",
            "created":1325653200,
            "id":1252645,
            "title":"Gohan"
        },
        "123":{
            "choices":[
                "Vegeta(Dbz)",
                "Vegeta(Dbs)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which vegeta </span></div></span></div>",
            "created":1460350800,
            "id":2131390,
            "title":"Vegeta"
        },
        "1232":{
            "choices":[
                "Goku",
                "Beerus"
            ],
            "content":"<div class=\"\"><div> <span>In beerus planet Goku and vegeta are training \" wow vegeta ur very strong says Goku while he and vegeta are catching blows hitting each other right left right left and then they knock each other out good whis gives vegeta a sense bean \" get up vegeta says whis\" vegeta stands up and stares at Goku knocked out \" u gonna give him a senzu beam whis says whis\" \"no yet vegeta come here I need show u something replies whis\" vegeta is confused so whis and vegeta go to beerus chamber where he's sleeping. \"Vegeta this fruit has rumors that  it can boost anyone's power by a large margin and I wanna see if it works so can u try.  \"hmmmmm know I can finally pass that fool kakarot and then he will be begging for mercy alright<br>\r\n I'll take it.vegeta ate the fruit 10 mins nothing happen whis leave for a little to check on other planets and then it happened vegeta started shrinking and shrinking \"what is happening to me says vegeta.he stops and he looks like a bug and then he hears sounds doom doom he turns around and sees?<br>\r\n</span></div></div>",
            "created":1460350800,
            "id":2131400,
            "title":"Vegeta shrinks "
        },
        "12321":{
            "choices":[
                "VEGETA?",
                "jut a bug"
            ],
            "content":"<div class=\"\"><div> <span>who vegeta sees is goku walking down same place where he is goku is bare foot and his feet are so bad vegeta could smell it from where he is and sweaty no way he's gonna under that goku coming more closer goku says\"i wonder where vegeta is i can't sense his energy hmm he probably doing something oh how my feet hurt they  probably stink haha. goku is coming close to vegeta the odor from his feet is so bad vegeta can't stand to smell it anymore vegeta tries to fly away but WHAT HAPPENED I CANT FLY that fruit must of took my powers and my strength damnit,Then goku giant foot goes down on vegeta STOMP vegeta still alive but stuck face first in goku dirty smelly feet vegeta smelling and by accident kissed his dirt sole getting some of his foot sweat  in his mouth meanwhile goku continue walking no knowing vegeta under his feet.goku goes get his shoes\"i better keep this feet in my shoes because they stink alot goku says as goku puts his right foot in the he puts his left one vegeta is inside his shoe ugh it stinks in here vegeta is know in vegeta toes as goku wiggle his toes all over vegeta. \"alright i better go home says goku he does instant transmission and is right inside his house hmm i better eat wait i feel something coming from my foot goku thinks he takes off his left shoe and checks bottom he sees something between his toes  he sees?</span></div></div>",
            "created":1460610000,
            "id":2133050,
            "title":"under goku's feet"
        },
        "124":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Gohan, Goten, and Trunks all shrink!",
                "Goku and Vegeta shrink!",
                "More groups"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The only thing better than one shrunken guy is two! Or three! The first two groups of shrinkies is Gohan, Goten, and Trunks or Goku and Vegeta.</span></div></span></div>",
            "created":1325653200,
            "id":1252663,
            "title":"Multiple Characters"
        },
        "1241":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Goku",
                "Krillin",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Gohan walked out of his room; checking to make sure his blue gi was on tight. The 17 year-old had promised his father he would spar with him today, but he had taken five minutes longer to change that usual. Not wanting to make his dad wait any longer Gohan hurried down the stairs. As he did he heard some giggling coming from the nearby living room. It sounded like Goten and Trunks and Gohan was going to just ignore them when suddenly there was a <i>zap</i> sound followed by a bright flash of green. A second later he heard Trunks’ voice shouting excitingly. <br>\r\n<br>\r\n“Awesome, it worked!” cried Trunks, laughing with joy. “Now it’s my turn!” Gohan hurried toward the room to see what was going on, but before he got there another <i>zap</i> was heard and then another flash of green light. Gohan entered the living room a second later and discovered…nothing. The room was completely empty. <br>\r\n<br>\r\n“What the heck?” the teenage half-Saiyan walked further into the room as he looked around with his black eyes. He definitely heard Goten and Trunks in here. After taking a few more steps away from the doorway, Gohan’s foot bumped into something and it slid away a couple feet. He glanced down and spotted what looked like a toy gun on the floor. Curious, Gohan picked it up and examined it in his hands. “That Goten…you’d think he’d of learned by now how angry mom gets when he leaves his toys around.” Gohan looked up from the gun and glanced around the room sternly. “Goten! I know you’re in here!” Gohan waited for his younger brother to come out of hiding, but there was no sign of him. Gohan went back to observing the toy gun and noticed the Capsule Corporation’s logo on it. “So it’s not a toy…don’t tell me it’s some kind of invisibility ray.” Gohan pointed the gun at himself and pulled the trigger as he said this. At the time he didn’t think much of the action, but it would prove to be one of his biggest mistakes. The gun lit up in his hands and with a <i>zap</i> it fired a green beam that hit Gohan square in his chest. Gohan was blinded by the resulting flash of light for only a second, but when his vision returned he noticed two things.<br>\r\n<br>\r\nFirst, the gun was no longer in his hands, but on the floor in front of him. Second, it was HUGE. What had once looked like a toy gun now looked like a gigantic contraption before him. Gohan gaped up at the huge mechanism before spinning around and looking at the rest of the room. His living room now looked impossibly huge as if it was a whole other world. The cracks in the wooden floor now looked like he could squeeze through them and the furniture around him went up for miles. Gohan estimated he was only a centimeter in height!<br>\r\n<br>\r\n“O-Okay…not an invisibility ray.” Gohan mumbled to himself. <br>\r\n<br>\r\n“Yeah! Gohan joined us!” came the familiar, childish voice of Goten. Gohan looked to his right to see his brother and Trunks running toward him. Both were shrunken like him. <br>\r\n<br>\r\n“Hey, watch where you’re stepping, Gohan!” Trunks shouted as they reached him. “You almost stepped on us a few times back there!”<br>\r\n<br>\r\n“I did?” Gohan realized the two kids really were in the room and he simply hadn’t noticed. He was glad they were both unhurt, but… “Would one if you tell me what’s going on?”<br>\r\n<br>\r\n“Can’t you figure it out?” Goten asked, smiling widely as he laced his arms behind his head. “Trunks brought a real-life shrink ray from home! Now we have all this space to play in! Isn’t it awesome?!” <br>\r\n<br>\r\n“Awesome? Are you joking? Goten, this-” But the two demi-Saiyans didn’t seem to want to stick around since they both started to take off into the air while Gohan was still talking. The spiky haired teen thought fast and quickly grabbed one of the kids’ short legs in each hand before pulling them back down to the floor. <br>\r\n<br>\r\n“What’s the big idea?!” Trunk’s asked as he glared at the older male.<br>\r\n<br>\r\n“Listen, you two! You don’t seem to understand how dangerous this is! We’re the size of flies! What does mom do when she sees a fly?” <br>\r\n<br>\r\n“S-She…swats it.” Goten answered with a gulp, but returned Gohan’s stern gaze with his own. “But mom isn’t home right now! She and Trunks’ mom went on some vacation together. The only one home is dad.” <br>\r\n<br>\r\n“That doesn’t make this any less dangerous!” Gohan shouted back; getting frustrated. He couldn’t believe he had accidentally shrunk himself…but then again if he hadn’t he or someone else might of stepped on the two tiny kids. “Listen…we need to get back to normal. Lets try to find an undo switch on the shrink ray and-” <br>\r\n<br>\r\nBefore Gohan could finish he was interrupted by a loud BOOMing noise. It was quickly followed by another BOOM…then another…then another. The booms were getting closer and the floor started to tremble with each one. The three boys realized the sound was footsteps and they all fearfully turned their heads toward the living room’s entryway. A few BOOMs later and someone entered the living room. It was…</span></div></div>",
            "created":1325653200,
            "id":1252665,
            "title":"Triple Trouble"
        },
        "12411":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Gohan tells Goten and Trunks to stay put while he tries to get Goku's attention.",
                "Gohan suggests they all try to get his attention."
            ],
            "content":"<div class=\"\"><div> <span>The three Saiyan boys watched as the towering form of Gohan’s and Goten’s father, Goku, appeared at the doorway. The hulking man’s dark blue boots hit the floor with such force that the tiny trio thought he was stomping into the room; but actually he was simply walking normally. Goku stopped in front of the living room entrance and glanced around the empty room confused. <br>\r\n<br>\r\n“Gohan? You in here?” Goku asked in a slightly raised voice. The Saiyan scratched the back of his head when he saw no signs of his son and heard no reply. “Could of sworn I heard him yelling…”<br>\r\n<br>\r\n“Whoooaa…Goten, your dad is HUGE!” Trunks remarked, gazing up at the behemoth that had entered the room. Trunks was used to looking up at the adults, but never like this!<br>\r\n<br>\r\n“Y-Yeah.” Goten replied, unable to say anything but an agreement to his friend. He was too busy staring up in awe at his titan-sized dad. <br>\r\n<br>\r\n“H-He sure is a sight,” said Gohan, chuckling nervously as he craned his neck to look up at Goku’s clueless face. The older male then turned his attention to the two younger ones. “Why are you two so surprised? You saw me like this a few minutes ago. Wasn’t I-?’ <br>\r\n<br>\r\nBefore Gohan could finish he was interrupted by the floor shaking under his feet and the loud booming noise of Goku’s footsteps returning. The giant man was on the move again; this time heading right for the shrunken gang!<br>\r\n<br>\r\n“H-He’s c-coming t-this w-way!” Trunks shouted, stuttering due to the floor vibrating. <br>\r\n<br>\r\n“M-Move!” Gohan ordered and the three boys scattered just as a shadow engulfed them. One of Goku’s blue boots hanged overhead and was about to come down on them without mercy. They flew as fast as they could and managed to escape the impact zone just as Goku stepped down, but little Goten was hit by the following wind pressure and sent flying back several feet. “Goten!” Gohan rushed to his little brother’s side and helped him up. “Are you okay?”<br>\r\n<br>\r\n“I’m alright.” Goten replied while rubbing his forehead. “I can’t believe I was sent flying that easily…”<br>\r\n<br>\r\n“It’s cause you’re so weak, Goten!” Trunks joked as he appeared at Goten’s side. The messy haired boy gave Trunks a glare in response. <br>\r\n<br>\r\n“Anyway, we need to get dad’s attention before that happens again.” Gohan said before the two kids could start arguing. “Or worse, he finds the shrink ray and shrinks like us!”<br>\r\n<br>\r\n“Hey, what’s this?” came Goku’s booming voice. Gohan looked back at his giant father to see him crouching down to pick up the shrink ray. The teenager cursed as Goku picked up the gun and examined it in his hand. “One of Goten’s toys? Heh, he sure is forgetful sometimes.” Goku chuckled before, to Gohan’s relief, pocketing the shrink ray. <br>\r\n<br>\r\n“Aww man, it would have been funny if he shrunk himself too.” noted Trunks as he grinned. Gohan ignored him and kept his gazed fixed on his father. Now that he had the shrink ray they had no choice but to get his attention if they wanted to return to normal. However, Goku had already inadvertently showed how dangerous he was to be around and Gohan didn’t want to put the children in any unnecessary danger. Could he get his oblivious dad’s attention by himself, however?</span></div></div>",
            "created":1326949200,
            "id":1262109,
            "title":"The BIGGEST Hero"
        },
        "124111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Trunks has an idea.",
                "Trunks can't think of anything."
            ],
            "content":"<div class=\"\"><div> <span>“Alright, you two stay put while I go and get his attention.” Gohan told the two youngsters with his back turned to them.<br>\r\n<br>\r\n“What?!” Trunks shouted. Gohan should of known better than assume he was going to follow his directions without complaint. “Why do we have to stay here and do nothing while you have all the fun?”<br>\r\n<br>\r\n“I’m not going to have <i>fun</i>.” replied Gohan as he glared down at the lavender haired boy. “Did you forget how we were almost stepped on like bugs a minute ago? Was that <i>fun</i>?”<br>\r\n<br>\r\n“N-No…” Trunks folded his arms across his chest and looked away. He didn’t want to admit it, but he really thought for a second they were going to be crushed back there…<br>\r\n<br>\r\n“That’s what I thought. Unless you want to put yourself in more danger like that you’ll stay here.” The teenager than turned his attention to his brother. “The same goes for you, Goten.”<br>\r\n<br>\r\n“Yes, Gohan.” Goten replied easily. He was disappointed that shrinking hadn’t been as fun as he thought it would be, but knew his brother was right about the danger. “Be careful, okay?”<br>\r\n<br>\r\n“No sweat!” Gohan smiled as he stared to hover off the floor. “I’ve survived tones of tough battles; there’s no way I’m being done in by my own dad.” Gohan gave the duo a wave before zipping off into the air. <br>\r\n<br>\r\n“Huh, I guess no one’s here.” Goku said to himself as he glanced around the room one last time. “I suppose Goten dragged him off on some adventure of something.” Goku laughed and started making his way toward the door. Gohan, not wanting his giant father to get to far, increased his speed so he could fly up to Goku’s face faster.<br>\r\n<br>\r\n“Dad! Over here!” Gohan yelled while he zipped around the left side of Goku’s face. However, he was just too small for his voice to reach Goku’s ears. He continued to yell anyway, but the reaction h got wasn’t what he was hoping. Goku seemed to have noticed the tiny speck near his face since one of his big hands came up to swat it away. Gohan just narrowly managed to avoid the hand as it flew past him. “Hey, watch it! It’s me, dad! Gohan!” The tiny teen flew over Goku’s right side and repeated his attempts to get Goku’s help. Again, without even looking at the little pest, Goku swung his hand at it. This time Gohan wasn’t able to dodge completely and got struck by one of his dad’s knuckles. Goku barely felt anything, but Gohan was hit so hard that he was flung halfway across the room.<br>\r\n<br>\r\n“Brother!” Goten yelled as he watched his dad swat his shrunken son away. Gohan grunted and managed to stop himself from crashing into anything. He winced in pain and rubbed his chest where the knuckle had hit him. <br>\r\n<br>\r\n“Damn, that smarts…” Gohan muttered before glaring back at Goku with annoyance. Before Gohan reached the living room doorway, Gohan shot through the air at sonic speed and stopped right between his giant, hulking father and the exit. Goku once again noticed the “fly” which had stopped fight in front of his face. His huge eyes focused on Gohan and the tiny Saiyan believed he had finally succeeded. “Dad! You gotta help; the kids and I were shrunken by that device you found and-”<br>\r\n<br>\r\n*SLAP*<br>\r\n<br>\r\nGohan was cut off when his titanic dad slammed his hands together on him. The two meaty hands came together with a loud SLAP and it appeared as if Gohan vanished between them. From the floor, Trunks’ and Goten’s mouths gaped in shock at this happening.  <br>\r\n<br>\r\n“You sure are a persistent fly,” Goku said to the bug between his palms. “I was trying to give you a chance, but now you leave me no choice. Chi-Chi told me to crush any bugs I find in the house and I really don’t want to disobey her, so…sorry about this.” Goku started to his press his hands together harder, since he could still feel a tiny bit of resistance between his palms. He was completely unaware that it was his son’s struggles as he was desperately pushing against the massive hands to avoid being totally sandwiched between them. The black haired teen had managed to throw up his hands just in the nick of time and was now using every ounce of his strength to keep his dad’s hands from closing completely. As blood vessels popped in his head and arms Gohan knew he couldn’t keep this up for very long. Goku was just far too strong at this size; the giant man was in a totally different league than him now. The only reason he hadn’t been crushed already was because Goku was only using less than one percent of his strength. <br>\r\n<br>\r\n“Gotta…get out of here…before it’s too late!” Gohan told himself as he looked around for some way out. All he could see was the sweaty flesh of his dad’s palms all around him. The moment he let go to try and slip out would be the moment he’d die. Things looked bleak; his two muscular arms were already starting to strain. “S-Shit…shit…”<br>\r\n<br>\r\nBack on the floor, Goten and Trunks couldn’t take their eyes off the scene before them. Things had taken a dramatic turn for the worse. <br>\r\n<br>\r\n“G-Goten, at this rate your dad’s…going to mash Gohan into pulp!” <br>\r\n<br>\r\n“W-We gotta save him, Trunks!” Goten turned to his older friend; a look of desperation and fear on his face. Tears were already starting to swell up in the boy’s eyes as well. <br>\r\n<br>\r\n“I know, I know. Just let me think…” Trunks stared up at Goku; his mind racing. If he didn’t think of something in the next few seconds; Gohan was doomed!</span></div></div>",
            "created":1327813200,
            "id":1267971,
            "title":"Gohan in Peril"
        },
        "1241112":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Trunks leaves Goten behind.",
                "Trunks convinces Goten to help him."
            ],
            "content":"<div class=\"\"><div> <span>As Trunks’ mind raced to come up with some kind of rescue plan, Gohan was busy fighting a losing battle against his father’s hands. The teen was finding it harder and harder to breathe within the small, enclosed space between Goku’s palms. To make things worse the heat radiating off of Goku’s sweaty palms was intense; causing his shrunken son to sweat profoundly. Gohan grunted with pain as the space he was in shrank a little; his arms beginning to fail him. It was only a matter of time before Goku succeeded in crushing him into oblivion; Gohan had to do something before then! He had drained too much energy to go Super Saiyan; so there was only one hope left. <br>\r\n<br>\r\n“D-Dad…s-stop!” Gohan cried as he closed his eyes and focused <i>ki</i> into the hands that were between him and death. In his fatigued state all Gohan could muster was enough <i>ki</i> for two small energy blasts. He prayed that it would be enough to make his dad separate his hands; if just for a second. That’s all he needed to escape. With a shout the demi-Saiyan unleashed two energy blasts from his palms into Goku’s massive ones. At his pathetic size all Gohan could hope for was giving his father a tiny sting; but maybe that would be enough…<br>\r\n<br>\r\n“What was that?” Goku question as he raised an eyebrow. “You biting me? You’ve got a pretty strong bite too; I actually felt that. Still…with a bite that strong you’re way too dangerous to remain in this house. Sorry, but it’s time to end this.” With that said Goku closed his eyes and was silent for a moment. The air around Goku started to twist and grow hotter. Gohan felt it more than anyone; his pupils dilated as realized Goku’s power level was rising dramatically. Fear overtook him at this point and he screamed for his dad to stop. Not able to hear his miniscule son’s pleas; Goku’s eyes shot open and he released a booming shout. The man’s black hair lit up gold and an aura of super hot <i>ki</i> engulfed his form. The unbelievable heat consumed Gohan; but thankfully the young man was only exposed to it for a millisecond. With Goku’s strength multiplying, Gohan didn’t stand a chance. His arms snapped like twigs and in the same moment his body was completely and utterly smashed between Goku’s hands; a visible distortion rippling the space around the hands as they met. “You were a worthy opponent, bug.” stated Goku as he powered down and rubbed his palms together. What remained of the once all powerful Gohan was smeared across his dad’s muscular hands and became nothing more than a couple tiny red spots. Goku then took his hands and wiped them off on his gi; erasing any evidence of his son from existence. The giant man then continued out of the room; leaving behind two stunned and speechless kids. <br>\r\n<br>\r\n“O-O-Overkill…” was all Trunks could say after witnessing that. Next to him Goten fell to his knees while his watery eyes stared at his massive father until he disappeared from view. Tears rolled down his cheeks and the younger boy began bawling. <br>\r\n<br>\r\n“Gohaaaan!!!” he cried. “T-This can’t be happening!”<br>\r\n<br>\r\n“Hey, Goten!” Trunks knelt down and placed his hands on his friend’s shoulders. “You can’t break down on me now! We’ve gotta get that shrink ray from your dad and return to normal!”<br>\r\n<br>\r\n“I-It’s all our fault, Trunks! We never should of shrunk ourselves! G-Gohan told us how dangerous it was, b-but we weren’t listening! N-Now he’s…now he’s…” Goten covered his eyes with his hands and continued to sob. Trunks bit his lip; this really sucked. All he wanted was to have fun and now Gohan was dead and Goten was drowning in despair. He knew they needed to get that shrink ray back…but Goten wasn’t going anywhere in this state. Was there any way to snap Goten out of it? Or would he have to leave him behind and try to get the shrink ray alone?</span></div></div>",
            "created":1328504400,
            "id":1272001,
            "title":"Too Much of a Bad Thing"
        },
        "125":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Goten",
                "Trunks",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lots of DBZ guys.</span></div></span></div>",
            "created":1325653200,
            "id":1252646,
            "title":"More"
        },
        "13":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Soul",
                "Black Star",
                "Death the Kid",
                "Death Scythe (Spirit)",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252649,
            "title":"Soul Eater"
        },
        "131":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "It was Black Star.",
                "It was Kid.",
                "It was someone else."
            ],
            "content":"<div class=\"\"><div> <span>Soul Eater Evans was laying down on his bed; sunlight filtering in through the window right on his face. With an annoyed groan Soul woke up and his red eyes fluttered open. He glanced over at the digital clock next to his bed and sighed.<br>\r\n<br>\r\n“Man, why does Maka have to be so protective?” Soul said to himself as he sat up in his bed and looked down at himself. Yesterday the two of them had been ambushed by a couple witches on their way back from a mission. It was pretty hairy, but both of them escaped unscathed.<br>\r\n<br>\r\nWell…almost unscathed. <br>\r\n<br>\r\nSoul lifted up his yellow and black jacket and glared at the black symbol decorating his belly. One of the witches had hit him with a spell while in scythe form. While relatively unharmed, it had left him with his odd fly-shaped mark. The moment they got back to Death City Maka had insisted that Soul stay at home while she searched for any info on the spell at Shibusen. <br>\r\n<br>\r\n“Knowing her she’ll be in that  library all day.” Soul muttered to himself as he let himself fall back on the bed with his arms laced behind his head (which he turned away from the window). “If it didn’t do anything then it isn’t going to do anything now.” Soul told himself before going back to sleep a minute later. <br>\r\n<br>\r\nTen minutes passed before Soul was awoken once again. This time it wasn’t because of the sunlight, however, but because of the terrible pain coming from his stomach. Soul shot up and hugged his gut with both arms while his face twisted with pain. It felt like he had suddenly been decked in the stomach by Black Star…using BOTH his fists!<br>\r\n<br>\r\n“The hell is this?” Soul grunted as he slowly got out of bed and wobbled out of his bedroom. He made his way toward the bathroom, but something told him he wasn’t going to make it that  far. His vision was getting blurry and it was difficult to walk straight. Soul smacked into the right wall and slid to his knees. The world seemed to melt around him before he lost consciousness and collapsed in the middle of the hallway. <br>\r\n<br>\r\nSoul didn’t know how much time had passed before he woke up. As he sat up he held his head and hissed in pain. <br>\r\n<br>\r\n“Ugh…if this is what a hangover feels like I’m never drinking.” Soul joked to himself as he shook the dizziness away and made his way to the bathroom. <br>\r\n<br>\r\n…at least he would of if the sight before he hadn’t frozen him in his tracks. Soul’s jaw dropped as he gazed up at the MASSIVE hallway he was in. The doors on either side of him stretched up like skyscrapers; it was unbelievable. Next to him were a couple misplaced books and magazines, but Soul mistook them for buildings! This wasn’t his apartment! This was the apartment…of a giant! <br>\r\n<br>\r\n“W-Where the hell am I?” Soul took a few steps backwards. His foot got caught in something and he fell back with a yelp; slamming his back against the hard wooden floor. Soul winced and rubbed his back while he looked down at his foot. His shoe had gotten caught in a hole…and then it dawned on Soul. He knew this hole…it was one of many that dotted his apartment. They were common in such a cheap place like his. But this was impossible; he couldn’t fit his fingernail through those holes yet it looked like he could squeeze both his legs through this one! “What the hell is going on?” Soul stood up again and took a minute to clear his head. He thought for a moment before lifting his jacket up and noting that the weird mark was gone. “Damn it! That thing must if shrunk me!” Soul cursed as he let his jacket fall back into place before returning his gaze to the giant apartment…HIS giant apartment. “Maka was right. If this had happened out in public…” Soul shuddered at the thought. It was a good thing he was alone. He just had to find a safe place before-<br>\r\n<br>\r\n“Hey, anyone home?” came another voice out of the blue. Soul’s eyes widened as he heard a door open and close, followed by the sound of someone walking around the apartment. Their footsteps sounded like explosions in the distance to the minuscule Soul. Someone had just invited themselves into his home…and judging by their voice Soul knew exactly who it was!</span></div></div>",
            "created":1325653200,
            "id":1252699,
            "title":"The Bug Curse"
        },
        "1311":{
            "choices":[
                "Maka Comes in and Digustedly Kicks Black Star Out",
                "Kid Comes In and Is Horrified By Star's Disgusting Feet's Lack of Symmetry",
                "Tsubaki Politely Knocks To See if Black Star is There"
            ],
            "content":"<div class=\"\"><div> <span>BOOM!<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nBOOM!<br>\r\n<br>\r\nSoul looked up in absolute awe to see his now enormous blue haired best friend: Black Star! Black Star now really look like the god he always said he would surpass. Judging by how Soul hardly came up to the toe end of Star's enormous shoe in front of him, he must've been quite small indeed! <br>\r\n<br>\r\n\"Whoa, Black Star would get such a power trip from this if he saw himself right now.\" The stunned Soul said as his friend's feet soared over his head as B*S leapt onto the couch, butt first. <br>\r\n<br>\r\nThe groaning of the couch springs as soon as his muscular ass made contact with the cushion was like nails on a chalkboard to tiny Soul. He grit his teeth and cried out as he covered his ears. \"Dammit Black Star! Sigh....okay, I need to get his attention....lets hope he doesn't get too full of himself once he sees me.\" <br>\r\n<br>\r\nPreparing himself to rush at B*S's shoe and begin the long trek up his best friend's leg, Soul jogged in place and did some warmup exercises. When he was finally ready, he rushed the black and silver shoe only to have it lifted up right before him, he ran right under the couch skidding to a stop before he got too far. <br>\r\n<br>\r\nPeeking out from underneath it, he saw Black Star removing his shoes, obviously making himself quite at home. The shoes were removed, one kicked across the room, the other falling right towards him! <br>\r\n<br>\r\n\"AH!!!\" Soul tried to get away, but he was just in the wrong spot at the wrong time, luckily.....or unluckily, for him, the shoe landed in a way that the opening was right on top of him, he lurched forward and found himself in the upside down toe section of the shoe that Sta wore everyday without socks. \"Oh man! This is so gross, it reeks in here!\" <br>\r\n<br>\r\nHe heard Black Star sighing in comfort above him as he placed his big sweating feet on the coffee table. \"Maka would kill him if she knew what he was doing right now.\" <br>\r\n<br>\r\nJust then....</span></div></div>",
            "created":1325739600,
            "id":1252715,
            "title":"It was Black Star."
        },
        "13111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Black Star heads back to his own apartment.",
                "Black Star takes a walk somewhere."
            ],
            "content":"<div class=\"\"><div> <span>Not three seconds after Soul uttered these words he heard the sound of the door opening and closing again. Then the voice of his meister caught his attention.<br>\r\n<br>\r\n“Soul! I’m back!” Maka called as she walked into the living room holding a folder filled with papers in his hand. She promptly froze in place when her eyes fell upon Black Star sitting on the couch; bare feet resting on the coffee table. The blue haired assassin had his eyes closed and arms resting behind his head. He had heard Maka come in, but kept his eyes closed in a relaxed state. Maka’s face slowly twisted with disgust and anger as she squeezed the folder in her hand. “Black Star! What the hell are you doing?!”<br>\r\n<br>\r\n“Yo.” Black Star replied simply, giving Maka a casual wave. “What’s up?” <br>\r\n<br>\r\n“What’s up? WHAT’S UP?!” Maka stomped over to Black Star, rolling up the folder in her hands and using it to whack one of the teen’s feet hard. Black Star hissed in pain as he took his feet off the coffee table and rubbed the one that had been whacked.<br>\r\n<br>\r\n“What’s your problem?!” Black Star shouted, glaring at the pissed off girl. <br>\r\n<br>\r\n“What are you doing here?! Soul needs to rest and I need to go over these documents. The last thing we need is for your DISGUSTING feet to stink up the place. Get out!” <br>\r\n<br>\r\n“Soul’s here?” Black Star asked, surprised. “I thought no one else was here; I’ll go say hi!” Black Star got to his feet, but before he could head towards Soul’s room Maka picked up one of his black shoes (the one Soul wasn’t in) and tossed it at the boy’s face. Black Star caught it with one hand as it came within inches of his nose. <br>\r\n<br>\r\n“No you won’t! You’re gonna put your filthy shoes on and get your ass out of here! NOW!” <br>\r\n<br>\r\n“Okay, okay! Crazy bitch…” Black Star cursed under his breath as he slipped on the shoe in his hands. He then reached down and turned the upside-down shoe right side up. The tiny Soul screamed as his entire world shifted upside-down. He fell from the top of the toe section to the bottom; groaning as he picked himself up. He noticed light was flooding into the shoe and turned around to watch as the light was quickly blocked by something else. Soul’s eyes dilated and he gaped as he watched Black Star’s huge, sweating foot slip into the shoe and rush toward him. <br>\r\n<br>\r\n“N-No! Black Star, stop!” Soul cried, but Black Star had no idea there was anything in his shoe. Soul tried to run, but the foot was just too huge and where would he go? Before he could take a second step the foot hit him and forced him deeper into the shoe. Soul pulled the shoe on nice and tight before making his way to the door. Apparently he wasn’t going fast enough since Maka angrily pushed him out the rest of the way. When Black Star turned around to face her she slammed the door in his face. The athletic meister stood there staring at the door for a moment; grinding his teeth together. That girl really got on his nerves sometimes, but he knew Soul would get angry at him of he ever retaliated. <br>\r\n<br>\r\n“Whatever.” Black Star muttered as he laced his muscled arms behind his head and went back the way he came. Meanwhile, inside his right shoe, Soul was still very much alive, but trying to figure out where he was. The albino teen was laying on his stomach; his face pressed against the hot, moist material of Black Star’s insole. On either side of him was a wall of flesh that occasionally shifted. All a round him he could hear and feel booms and with each boom came a jolt of pain in his legs. The ant sized weapon tried to move, but was unable to move an inch. He looked behind him and saw his entire lower half was hidden under Black Star’s foot. It took Soul a few minutes to fully understand his position; mainly because the fumes and constant motion were making him ill. He must be between two of Black Star’s toes with half of him pinned under the foot itself. Each time the titan of a boy took a step his godly weight would come down on Soul’s legs. Luckily the skin between the toes was soft or else Soul’s legs would be paste by now. <br>\r\n<br>\r\n“This is so uncool.” Soul complained, unsticking his face from the bottom of the shoe with a little effort. <br>\r\nHe tried to get his legs free, but it was useless. He would have better luck just pulling them off. There was nothing the shrunken teenager could do but lay there within the hot, smelly confines of Black Star’s shoe until a chance of getting out presented itself. <br>\r\n<br>\r\n“I wonder why Soul’s resting…” Black Star wondered to himself as he looked up at the blue sky. “This sucks; I wanted to hang out with him today! Now what am I gonna do…?” Black Star made his way down the sidewalk; unaware that Soul and he were already “hanging out” together. </span></div></div>",
            "created":1325739600,
            "id":1253171,
            "title":"Maka Comes in and Digustedly Kicks Black Star Out"
        },
        "131111":{
            "author_id":"bloke",
            "author_name":"Bloke",
            "choices":[
                "the pool of soda formed on Black Star’s belly.",
                "something inside the opened fridge."
            ],
            "content":"<div class=\"\"><div> <span>“Tsk! There’s nothing to do here, this is boring. I should go home and do some exercise. Or maybe Tsubaki has bought some food and she’s cooking something delicious. That’d be great. Tsubaki knows how to nourish the person who will become superior to Gods.” The young Meister was talking alone, drooling, as he continues walking down the sidewalk.<br>\r\n<br>\r\nFrom inside his shoe, the white haired weapon could hear muffled sentences with his friend’s intonation without know what he was planning. Each step only made him moan with pain as waves of stench invaded his nose when a bit of air circulated each time Black Star lifted his humongous foot. “Damn! This is not cool crying for help, but this is starting to be even more disgusting! Agh!” Soul felt the pressure of the giant’s whole body against his body again as the perspiration on Black’s feet rose due to the heat and the lack of ventilation. Strands of liquid sweat ran over his face and mixed with his own. The smell in there was unbearable; it was almost impossible to breathe. He only wished to reach some place that made his best friend stop walking to avoid, at least, the pain of the pressure crushing his minuscule body.<br>\r\n<br>\r\nAfter running upstairs to reach his house and making Soul endure the worst seconds in his whole life due to the strength used in each step, Black Star reached the door of his house. Under him, he found the doormat, and recalling what Maka said about his feet, he brushed his feet against it. Then, he knocked the door which seemed to be opened. “Whops! It seems I forgot to close the door when I left the house, hehe.” Inside his shoe, the tiny was wriggling in pain under the meaty surface. The wriggle made the blue haired guy think that his toes were itching, so suddenly he started to scrub the sole of his shoe against the doormat trying to get some relief. This made the tiny bug trapped between the foot and the sole of the shoe to scream in pain, feeling the friction of the whole mass of muscle over him falling on every part of his hurt body. After doing this, the young boy smiled and entered the house shouting, “I’m back!!” He walked a little around the place trying to see if Tsubaki was home, but did not discover any clue of her presence. “Now that Tsubaki isn’t around I can do whatever I want!” And saying this, he ran towards the fridge; opening it and finding that it was full of food… and a note. The energetic kid grabbed it and read it loud: “Don’t touch the food. Tsubaki. Smiling face…” The ninja meister crumpled the little note with his hand and threw it against the floor. He then stomped it violently, luckily for Soul, with the foot without his friend, letting him hear loud booming hits against the floor. “Damn Tsubaki! How dare to do this to me! To the guy who shines even more than the sun! Not fair!” Then the guy calmed down and saw some cans of what looked like soda. “Hey! She didn’t say anything about these cans.” The guy said grabbing one and lifting it into the sky and laughed loud and naughtily. Then, without taking care to close the door of the fridge, he ran towards the sofa and jumped over it. He sat on it in with his arms and legs extended. “Let’s have a relaxing time! You agree, right?” Black said to the can. <br>\r\n<br>\r\nSoul was waiting for an opportunity like this for what seemed like hours to him. Finally, his so active friend stopped for a little while and his world seemed to rise again. In fact, after spending the whole time lying down, now he was in a vertical position. He could see as his friend wriggled his toes inside the shoe and stretched them. That was a good sign. It looked like he was going to remove his shoe. <br>\r\n<br>\r\nOn the sofa, Black Star stretched his whole body and suddenly started to remove his sleeveless shirt; making him bare-chested. He passed the cold can over his pectorals and abdominals feeling a chilling sensation along his whole body. The guy was looking really relaxed as he started to remove one of his shoes, the one containing his little friend, using his other foot as he started to open the can. When he felt his shoe wasn’t encasing his foot he moved his leg violently and sent the shoe flying. He then opened the can; spilling some soda over his belly accidentally. He forgot he had to wait a bit because he ran toward the sofa shaking the can.<br>\r\n<br>\r\nSoul smelled as the odor inside the shoe started to mix with Black’s house smell. Some light was filtering into the footwear and suddenly an intense shaking sent his foul smelling prison and himself spiraling across the room. Everything started to spin around, but the force of gravity caused him to slip from the shoe before it crashed somewhere. He was falling until he reached…</span></div></div>",
            "created":1329627600,
            "id":1280277,
            "title":"Back to home."
        },
        "1311111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Black Star finds something that makes him laugh and Soul loses his balance again",
                "Black Star wipes the pool of soda off his belly with his hand and licks it up"
            ],
            "content":"<div class=\"\"><div> <span>Soul squeezed his eyes shut as he fell through the air. He had no clue where he was going, but knew he was most likely going to end up a stain on Black Star’s floor. The young Weapon braced himself for the inevitable impact, when suddenly…*SPLASH*<br>\r\n<br>\r\nInstead of going splat on some hard surface, Soul had landed in a pool of some kind of cold liquid. It tickled his nose and prickled his skin; upon sitting up in the waist-deep pool Soul confusingly rubbed the back of his head and sniffed his soaked arm. <br>\r\n<br>\r\n“What the hell?” Soul pondered as he winced at the pain in the back of his head. The landing hadn’t exactly been soft, but this odd brownish liquid had probably saved him. It was only upon licking his fingers that Soul realized what he was sitting in. “This is…soda? That kind Black Star likes. Coke or Pepsi or something.” Soul wondered what a pool of the stuff was doing here when suddenly the “ground” he was sitting on started to shake. The itty-bitty teen heard some humming behind him and looked behind him to get the sight of his life. Past a landscape of youthful muscles was Black Star’s face; smiling as he sipped from a can of soda. His adam’s apple bobbed as he chugged the soda before gasping for breath and belching loudly. <br>\r\n<br>\r\n“Ahh, this is the life~” the blue haired Meister exclaimed as he rubbed his bare back against the sofa cushion; an action that once again made the “ground” tremble. <br>\r\n<br>\r\n“Oh shit, not cool!” Soul muttered, eyes wide as he realized he was sitting on top of his giant friend. Judging by the view he had of the rest of his friend’s massive torso, Soul estimated he was on his belly. He also just noticed the gaping hole behind him; Black Star’s navel. “That oaf must of spilt soda on himself and didn’t bother to clean it up.” Soul grumbled to himself and stood up; his shoes still submerged in the pool of soda. What was nothing but an insignificant puddle of soda to Black Star was like a large kiddie pool to Soul. <br>\r\n<br>\r\n“Let’s see what’s on!” Black Star shouted to himself before snatching up the TV remote on the floor nearby and powering on the television. Soul watched as the shirtless giant aimlessly clicked through the channels’ occasionally sipping from the soda can in his hand. <br>\r\n<br>\r\n“Well, this isn’t too bad…” Soul mumbled to himself as he glanced around. “Doesn’t look like he’ll move for awhile, so it gives me some time to get up there and get him to notice me. “ The albino Weapon started to move, but upon taking the third step he suddenly slipped and lost his balance for a moment. He quickly regained his composure and sighed. “Damn, this soda’s really made his abs slippery. If I’m not careful I’ll slip and slide right into…that.” Soul’s crimson eyes glanced at the wide bellybutton behind him. “If I fall in there I might not get out!” The teenage Shibusen student took a moment to calm himself before slowly making his way through the pool of chilly soda. Unfortunately, upon taking that third step again…</span></div></div>",
            "created":1333429200,
            "id":1308427,
            "title":"Safe(?) Landing"
        },
        "13111111":{
            "author_id":"ratix_d",
            "author_name":"Ratix D",
            "choices":[
                "Wait for Black Star to finish watching TV, while the soda slowly dries",
                "Try to climb out of the bellybutton despite the frequent ‘belly rumbling’"
            ],
            "content":"<div class=\"\"><div> <span>Black Star finally found a channel worth watching and, suddenly, the ‘ground’ below Soul started rumbling. His foot slipped on the puddle of soda and he fell backwards, his butt landing with a splotch in the brown liquid, soaking his pants.<br>\r\n<br>\r\n“Whahahaha!!”<br>\r\n<br>\r\nBlack Star’s laughing voice was booming from above, laughing at the TV. Whatever that blue-haired loudmouth was watching, it was apparently very funny. However, Soul was not all amused by the current situation right now. <br>\r\nHe felt himself slipping further down, and flailed his arms in a desperate attempt to catch hold of something… anything. His fingers brushed against one of the downy hairs on Black Star’s stomach, and he managed to grab hold of it. He skid over on his stomach and reached out for another hair with his other hand. He kept holding on, his stomach to Black Star’s and his clothes getting soaked by the sugary soda, as the tremors slowly subsided.<br>\r\n<br>\r\nHeaving a sigh of relief, Soul looked back. He had slid down precariously close to the wide bellybutton, and a thin trail of soda was slowly flowing down towards it. Just when he was about to pull himself up again and get out of this awkward position, Black Star started laughing again, even louder, and his whole belly shook along with it.<br>\r\nSoul tightened his grip on the hairs as he tried to withstand the tremors of the stomach and avoid slipping down any further. His arms felt like they were at their limit, but he gritted his teeth as he kept struggling to stay where he was.<br>\r\n<br>\r\nHowever, Black Star was obviously enjoying the show – some kind of stand-up comedy thing by the sound of it, although Black Star’s boisterous laughing drowned out most of the sound coming from the TV. In fact, he was enjoying the show so much that he started slapping the side of his stomach in delight.<br>\r\n<br>\r\nIt was at this time that Soul really started hating his friend’s animated, overexcited personality, for the vibrations being caused by Black Star’s hand slapping the side of his stomach – which sounded much like a series of bombardments – made him bounce up in the air and loose his grip on Black Star’s stomach hairs.<br>\r\n<br>\r\nWith another wet ‘splotch’ he fell back down into the puddle and bounced along. He tried to get some kind of hold anywhere, but his hands were so thoroughly covered with the fizzy brown liquid that he couldn’t get a grip. And, much to his dismay, he started sliding downwards – flailing his limbs – along the trail of soda into Black Star’s bellybutton.<br>\r\nHe fell face forward into the navel, and rubbed his head, trying to stand up.<br>\r\n<br>\r\n“Oh, crap. Not cool, not cool.”<br>\r\nHe looked up at his surroundings, and it was like he had fallen down a deep pit. Some soda was seeping in from above, and although the navel was only about two or three times his height, with his soda-covered state and the slick feel of Black Star’s skin, he doubted he could scale up.<br>\r\n<br>\r\n“Arghh… what’s that smell!?”<br>\r\nA sharp, pungent smell invaded his senses, and when he looked around Soul realized that, from all the gathered lint and dirt he could see, Black Star hadn’t cleaned his bellybutton in a long time. It wasn’t as bad as being under his feet had been, but being gathered here and unable to get out – much like the bellybutton lint surrounding him – made him feel all the more insignificant.<br>\r\nAs the soda trickled down and pooled around him, and every now and then his world seemed to shake as Black Star laughed at another joke, Soul pondered on what to do.<br>\r\n</span></div></div>",
            "created":1333947600,
            "id":1312429,
            "title":"Stomach Tremors"
        },
        "131111111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "...the giant still snoring away.",
                "...the giant awake after watching a tiny bug crawl out of his bellybutton."
            ],
            "content":"<div class=\"\"><div> <span>Soul thought about attempting an immediate escape from this damp pit, but he quickly dismissed the idea when another rumbling laugh from Black Star sent him off his feet and face first into a mound of wet navel lint. The albino weapon gagged as he picked himself up and wiped the black filth from his face. <br>\r\n<br>\r\n“Ick, not cool!” Soul exclaimed as he wiped his face with his hands and sat down with a slight “splash”. The small pool of soda on the giant’s stomach was continuing to drip into the navel; forming another pool at the bottom that mixed with he giant’s sweat and bellybutton lint. It was completely repulsive, but Soul had no choice but to sit in it. Trying to climb out now would probably just end in another face full of smelly lint. “No choice…guess I just have to wait for it to dry.” Soul sighed as he leaned against the slick flesh behind him and tried to ignore the obnoxious laughing coming from outside and the musky smell coming from all around him. Instead he focused on the sounds that were coming from all around him; behind Black Star’s strong stomach muscles were his noisy innards that somehow seemed to soothe Soul. Even as the shrunken pianist sweated in his friend’s body heat and droplets of soda dampened his white hair, he was somehow able to close him crimson eyes and drift off into sleep. Perhaps the fatigue he had collected from almost getting crushed several times in one day had something to do with it…  <br>\r\n<br>\r\nSoul didn’t know how long he slept. It could have been an hour, two hours, or just thirty minutes. When his eyes fluttered open, it wasn’t to the sound of Black Star’s booming laughter, but to another obnoxious sound that he was capable of making: snoring. The television was still blasting nearby, but Soul could clearly hear the sound of his ninja friend’s snoring mixed in with it. <br>\r\n<br>\r\n“That muscle head must of fell asleep. He can sure be lazy sometimes…” Soul mumbled to himself as he stood up. As his shoes set down upon the soft bottom of the titan’s bellybutton, the shrunken teen noticed the soda was gone. The smell still lingered in the air and on his clothes, but the liquid had been completely absorbed by the giant’s skin. “Alright, now’s my chance!” Soul craned his neck and looked up through the hole above him. He wanted to get out before the giant started moving again, so he quickly grabbed onto one of the fleshy walls and started climbing. Black Star’s bellybutton wasn’t very deep, so it didn’t take long before he was pulling himself over the edge and back onto his giant buddy’s abs. The unlucky Weapon laid down on the giant Meister’s stomach and breathed in the (relatively) fresh air. <br>\r\n<br>\r\n“I’m so glad to be out of there…” Soul said to himself between breaths. While still laying down on his back, Soul looked behind him toward Black Star’s upside-down face and saw…</span></div></div>",
            "created":1334984400,
            "id":1320435,
            "title":"A Short Rest"
        },
        "135":{
            "author_id":"dontkno",
            "author_name":"dontknow",
            "choices":[
                "franken stein",
                "free",
                "more...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about theses</span></div></span></div>",
            "created":1517760480,
            "id":2449274,
            "title":"More"
        },
        "1353":{
            "author_id":"dontkno",
            "author_name":"dontknow",
            "choices":[
                "lord death himself (to go wih the original series, he cant go outside of the DWM",
                "joe buttataki (the buff coffee man)",
                "even more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>some more characters</span></div></span></div>",
            "created":1517761020,
            "id":2449284,
            "title":"more...."
        },
        "14":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Natsu",
                "Gray",
                "Gajeel",
                "Elfman",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252651,
            "title":"Fairy Tail"
        },
        "141":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Natsu attacks Romeo's feet in his anger.",
                "Natsu tries to stay calm and come up with a plan.",
                "Someone else enters the room."
            ],
            "content":"<div class=\"\"><div> <span>It was your typical, noisy day at the Fairy Tail guild house. Lunch was being served and Natsu Dragneel was busy chowing down on some beef and mashed potatoes. Seated around him were his friends whom he chatted with; usually with a mouthful of grub. All of a sudden…<br>\r\n<br>\r\n“Hey, big bro!” came a youthful, loud voice. Natsu turned his head just as a young, black haired boy leaped onto the table he was sitting at. The youngster of Macao , Romeo Conbolt,  stood atop the wooden table with his hands on his hips and eyes focused down on Natsu. “Big bro; fight me!” Romeo exclaimed, pointing a finger at the rosy haired Dragon Slayer. The demand shocked almost everyone in the guild; even Natsu just blinked at him. In seconds, however, that blank stare turned into a grin.<br>\r\n<br>\r\n“Alright!” Natsu replied, putting on his usual “I’m getting fired up!” look. <br>\r\n<br>\r\n“Hey, Natsu-!” Lucy tried to stop him, but Natsu had already gotten out of his seat. A similar grin decorated Romeo’s face as he leaped down from the table and faced the older teen. Natsu just folded his arms over his muscular chest and watched to see what the boy would do. <br>\r\n<br>\r\n“I’m gonna give it my all, big bro, so watch out!” Romeo announced before wrapping his right fist in a bright, purple flame. The young Fairy Tail mage cried out as he charged at Natsu; rearing the fist back and plunging it right into Natsu’s stomach. Romeo’s smile twitched as he tried to ignore the pain in his knuckles, but the smile went away completely when he heard the older fire mage laugh above him. <br>\r\n<br>\r\n“Awesome! I won’t hold back either!” Natsu replied, unfazed by Romeo’s punch. The smaller male could only watch frighteningly as Natsu wrapped his own fist in a blazing red flame.<br>\r\n<br>\r\nA second later, Romeo was sent hurtling into another (thankfully empty) table. The wooden table snapped in half by the impact; leaving Romeo twitching on the broken planks. His cheek was swollen and some blood trickled down his chin. Natsu shouted in victory as he pumped his fist into the air. It was short lived, however, as a certain red haired woman grabbed him by the ear.<br>\r\n<br>\r\n“What do you think you’re doing, Natsu?!” Erza asked, tugging on the pink haired teen’s ear. “Romeo’s just a kid; don’t use your full strength!”<br>\r\n<br>\r\n“Ow ow ow ow! What’s the problem, Erza?! He was the one who asked for a fight, plus Gildarts never went easy on me when I was his age!”<br>\r\n<br>\r\n“Still…” the female knight grumbled, knowing Natsu was right. “Alright then, what about the table?!”<br>\r\n<br>\r\n“T-The table?” Natsu looked at the broken piece of furniture before chuckling nervously. “Ah…well…you see…” Before Natsu could come up with an excuse he was already being dragged away by Erza; screaming the entire time. <br>\r\n<br>\r\n“Romeo, are you okay?!” came Macao’s voice as the older, blue haired man ran over to his son. Romeo grunted as he sat up and rubbed his puffy, slightly burnt cheek. It was a miracle he hadn’t lost any teeth. <br>\r\n<br>\r\n“Yeah, I’m fine, dad.” replied the black haired teen as he wiped away the blood that was coming from his lip. “Big bro is really strong, but one day I’ll definitely pay him back for that. Tenfold!\" Macao stared at his son for a moment before smiling at him. <br>\r\n<br>\r\n“You know, I don’t appreciate someone slugging my son like that.” Macao stated as he helped Romeo to his feet. “What do you say we pay him back now instead of later?” Macro smirked while Romeo was left staring at his father and wondering what his plan was…<br>\r\n<br>\r\n~~~~~<br>\r\n<br>\r\nAwhile later, Natsu was alone in the Fairy Tail storage room. And busy stacking what seemed like an endless amount of wooden crates and boxes. The Salamander groaned to himself as he realized how much more he still had to do.<br>\r\n<br>\r\n“Ugh, this is going to take me all day!” Natsu complained as he ran his fingers through his hair. “I can’t believe I’m being punished for breaking one little table. It’s not like it’s the first time either…I wonder if I can sneak out the back.” Before Natsu could think about this a little more he heard someone enter the storage room. He turned around to set eyes upon Romeo again, who looked good for someone who had just been sent flying into a table. The swelling in his cheek had also all but vanished; this was most likely Wendy’s doing. What Natsu noticed the most, however, was the strange ball of gray flames in the boy’s palm. “Hey, Romeo, what are you doing here? Don’t tell me you’re angry about the beating I gave you…or do you want a rematch already?” Natsu chuckled and crackled his knuckles; he was always raring to go. <br>\r\n<br>\r\n“H-Huh? Oh, no! I came to…reward you for defeating me.” Romeo offered the gray fireball to Natsu. “This is a really special flame I made just for you, big bro! It’s meant for you too eat; it tastes really sweet!” Romeo explained, mentally chuckling in his mind. If his father was right, this flame would drastically weaken Natsu both in strength and magical power once it was consumed. Then he would have a much better chance at defeating him!<br>\r\n<br>\r\n“Really? Heh, you didn’t have to do this, Romeo. Beating you wasn’t that much trouble…” replied Natsu as he transferred the gray flame from Romeo’s hand to his own. He was a little suspicious of the flame, but a quick sniff revealed it didn’t stink to high heavens like his Yellow Fire, which was enough for Natsu to assume it was safe. “Oh well, itadakimasu!” Natsu opened his maw and sucked in the gray flame. Romeo watched Natsu’s cheeks fill up before he “chewed” the flame and swallowed. “Hey, what’s the big idea? That didn’t taste sweet at all! If anything it makes me feel kind of funny…” <br>\r\n<br>\r\n“Hehe, success!” shouted the younger male before moving into a battle stance. “Now it’s time for some payback, big bro!” Romeo grinned and lit both of fists up with purplish flames. Natsu just raised an eyebrow and watched Romeo punch him in the gut once again…<br>\r\n<br>\r\n…which, once again, didn’t make the Dragon Slayer budge an inch. Romeo instantly backed up and rubbed his sore knuckles. “I-I don’t understand! That should of hurt you!”<br>\r\n<br>\r\n“Huh?” Natsu looked at Romeo with a confused stare before quickly grinning at him. “Oh I see…that flame was supposed to cripple me somehow, right? Haha, looks like I need to teach you there’s only one kind of flame that matters!” Natsu clenched his own fist, which burst into a raging flame. Romeo’s face went pale as he watched the older Fairy Tail mage rear his fist back again. He squeezed his eyes shut and prepared himself for the pain…<br>\r\n<br>\r\nIt took several seconds for Romeo to realize something was off. He hadn’t been punched through the door yet and he couldn’t even sense Natsu’s presence in front of him anymore. Sure enough, Romeo opened his eyes to see that Natsu was gone. He glanced around to make sure he wasn’t planning a sneak attack, but the Dragon Slayer was no where to be seen. <br>\r\n<br>\r\n“W-What the…”<br>\r\n<br>\r\n“…hell happened?!” Natsu exclaimed as he craned his neck all the way back just to look at Romeo’s face far, far above him. Just seconds ago the weaker flame mage had only stood below his chest, but now he towered over him like some kind of young god! Judging by the boy’s titanic, brown boot directly in front of him, Natsu guessed he wasn’t even an inch in comparison to the giant of a kid. He was mere millimeters! “Hey! Hey, Romeo! What the hell did you do to me?!” Natsu screamed up at the junior guild member, but Romeo wasn’t even looking down at him. In fact, the boy seemed just as confused as he was. It would seem Romeo hadn’t planned on this happening, but that didn’t quell Natsu’s rage in the slightest. Needless to say, the mighty Salamander was NOT happy about being shrunken to the size of a mere speck. </span></div></div>",
            "created":1333429200,
            "id":1308974,
            "title":"The Tiny Salamander"
        },
        "1411":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Romeo heads home.",
                "Romeo heads somewhere to train.",
                "Romeo sticks around in the guild."
            ],
            "content":"<div class=\"\"><div> <span>“Romeo! Look at me when I’m talking to you!” Natsu shouted up at the titan of a boy; clearly pissed off as he waved his fists up at the young teen and blew fire from his mouth. Like before, Romeo gave no indication he noticed Natsu’s efforts in the slightest. The Dragon Slayer’s voice simply couldn’t reach his ears so high above. Instead of trying a third time, Natsu moved onto the only other solution he knew: violence. The young fire mage gave his usual battle cry before charging at Romeo’s left boot; both of his fists igniting behind him. Once he reached the brown wall that was Romeo’s foot, he delivered a devastating, explosive punch to it. The strength behind it was enough to take out your average wizard, but the giant didn’t even flinch. While Natsu had barely felt anything from Romeo’s punches, Romeo hadn’t felt a thing from Natsu’s. Getting further agitated, the pink haired Salamander unleashed a barrage of those mighty punches, each one as powerful as the last. When mere punches didn’t seem to have any effect, Natsu resorted to more powerful attacks…<br>\r\n<br>\r\n“Fire Dragon’s Claw!”<br>\r\n<br>\r\n“Fire Dragon’s Iron Fist!”<br>\r\n<br>\r\n“Fire Dragon’s Wing Attack!”<br>\r\n<br>\r\nNatsu preformed three of his signature moves in quick secession before stepping back for a breather. Even after all of those powerful blows, the towering Romeo still saw no reason to look down. In addition, the fiery attacks had barely made a scorch mark on the front of the boy’s boot. <br>\r\n<br>\r\n“Damn you, Romeo!” Natsu cursed, gritting his sharp teeth. “If attacking from here is useless, then…” The Dragon Slayer once again charged at the boot, but this time he leaped up mid-run. Even with his superhuman jumping capabilities, Natsu wouldn’t be able to reach the top of Romeo’s boot with them alone. The boy’s foot was just too massive in size. To make up for the distance, Natsu used his fire magic and create thrusters on the bottom of his feet that rocketed him up further. With this he easily made it to the top of the boot where he landed with an “oof” <br>\r\n<br>\r\n“Success!” Natsu exclaimed, but his victory was short lived as he was suddenly knocked off his feet. Romeo had decided he had enough of standing around in an empty room and started making his way out. Natsu laid on his stomach and gripped onto the rough material of Romero’s boot with both hands. What was simple walking on Romeo’s part was like the moving of Earthland on Natsu’s. If he didn’t hold on he would probably roll off from the boy’s constant motion. <br>\r\n<br>\r\n“Grrrr! Stand still so I can hit you some more!” Natsu shouted in frustration as he raised a flaming fist above his head. Before he could slam it down, however, something came over the rosy haired teen. His gut felt like it was doing the tango and his face suddenly turned a sickish green. The hand instead covered Natsu’s mouth as he groaned horribly. “N-No way…I’m being carried on top of his boot. This is…transportation!” Natsu gripped onto the top of the boot with both hands as he buried his sickly face into the slightly musky material of Romeo’s footwear. His cheeks seemed to inflate like balloons and he could feel the need to puke coming on. He was completely helpless. <br>\r\n</span></div></div>",
            "created":1333774800,
            "id":1311238,
            "title":"Fire Dragon's Useless Attempts"
        },
        "14111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Romeo does some push-ups.",
                "Romeo picks up a dumbbell or two."
            ],
            "content":"<div class=\"\"><div> <span>“Romeo, where are you off to?” Macao asked his son as the boy started heading out the guild’s front entrance. He looked pretty down, which surprised the blue haired elder. Had that flame he’d given Romeo not worked?<br>\r\n<br>\r\n“I’m just gonna head home for a bit.” Romeo answered his father without turning to look at him. After being humiliated by Natsu in in front of the whole guild and possibly allowing him to escape his punishment, Romeo decided it may be wise to take some time away from the guild. As the spiky haired wizard made his way down the dirt path to Magnolia Town, he was oblivious to the pint-sized passenger that clung to his boot. Natsu was watching through sickly eyes as the world around him sped by as Romeo walked. The giant teenager was going at a normal pace, but Natsu felt like he was moving faster than ever before. The booming quakes that came with each footstep rang in Natsu’s ears and shook his very being. The shrunken Salamander felt the contents of his stomach toss around like a blender and his face turned a darker green. <br>\r\n<br>\r\n“Ughhh, I’m gonna hurl!” Natsu exclaimed as he gripped onto the boot’s material harder and forced his face into the brownish footwear.<br>\r\n<br>\r\n~~~~<br>\r\n<br>\r\nSometime later, Romeo arrived inside his bedroom. The young fire mage stood in front of his door with is hands on his hips and sighed. <br>\r\n<br>\r\n“I feel like shit.” Romeo said to himself as he scratched he back of his neck. He had made such a fool of himself in front of Natsu not once, but twice. The older mage probably thought he was nothing but a nuisance now. He just wanted to collapse on his bed and sleep. As Romeo made his way toward his bed, the mini-Natsu on his boot had reached his limit. He was just too weak to hang on anymore. When next the giant kid lifted his foot to take a step; Natsu’s tiny form slid off the brown boot and fell to the wooden floor below. It was a long drop and any normal person would have been a broken mess upon landing, but Natsu was thankfully much more durable and got away with only a few bruises. Moments after his body hit the floor, Romeo’s massive foot followed and slammed down nearby. The loud thoom so close to Natsu rendered the smaller male temporarily deaf and he covered his ears in pain. A few more thooms later and Romeo was on the other side of the room. <br>\r\n<br>\r\n“Ow…well, that wasn’t so bad,” Natsu said to himself as he sat up and rubbed his throbbing head. Now that he was no longer on Romeo, he was starting to feel a lot better. “I only vomited five times!” The rosy haired male got to his feet and took a glance around Romeo’s room. It looked like the room of your average young boy, but many posters of Fairy Tail decorated the walls. There were even a few of him. When Natsu turned back to Romeo, he saw the younger boy standing by his bed. Despite only taking a few steps away from Natsu, the titan seemed to be miles away now!<br>\r\n<br>\r\n“Hmmm…ya know, there’s nothing like some healthy exercise to beat depression!” Romeo exclaimed to himself, grinning and pumping his fists into the air. Natsu watched from the floor below as the giant boy began untying his orange scarf and light-colored sash. When both were folded on the ground nearby Romeo slipped off his long jacket; leaving him in just his brown boots and green pants. Natsu was still shocked to see how much Romeo had grown in his seven-year absence. No longer was he the scrawny kid he used to know; he was now very fit for his age. The training the boy put himself through to obtain his current physique must have been hard on him. <br>\r\n<br>\r\n“What am I doing?!” Natsu asked himself as he slapped his cheeks. This was no time to be admiring Romeo’s progress; he had to get the boy’s attention and get back to normal! Plus, he still hadn’t forgiven the brat for putting him in this jam in the first place! As the angry, fully recovered, Dragon Slayer dashed toward the bare chested behemoth, Romeo began his exercising…</span></div></div>",
            "created":1335416400,
            "id":1323224,
            "title":"Difference of Opinion"
        },
        "141111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Chest",
                "Stomach"
            ],
            "content":"<div class=\"\"><div> <span>As Natsu ran across the seemingly endless landscape of Romeo’s room he heard a series of booms in the distance. The young titan was lowering himself to the floor and getting into a prone position. Once ready, Romeo started to do push ups; raising and lowering his fit body off the floor at a quick pace. Natsu didn’t think much of this at first; he was too busy trying to reach the giant before he moved again. Natsu ran as fast as he could (which was pretty darn fast), but Romeo seemed to remain miles away no matter the distance he covered. <br>\r\n<br>\r\n“Gaaaarrhh!! This sucks!” Natsu growled in frustration as he pumped his leg muscles as much as he could. He hated being so small; so insignificant and weak. The Dragon Slayer continued to roar in anger and frustration the entire time he ran. By the time Natsu finally reached the mountainous boy he was already past three hundred push-ups. His body was just now starting to sweat; salty dew forming on his face and torso. He wasn’t the only one sweating; Natsu was forced to take a breather after running what seemed like the length of a couple cities. “F-Finally made it.” Natsu mumbled as he wiped off his sweating face and looked up at the godly mage before him. “Alright…this is good. With his torso so close like this I have a better shot at getting his attention.” The flame mage grinned toothily and lit one of his fists ablaze. “Get ready to really feel the burn, Romeo!” Natsu exclaimed as he ran directly underneath the exercising behemoth. While the heaving chest of the titan came close to the floor each time he lowered; it didn’t touch it and thus allowed plenty of room for the minuscule Natsu to move around. <br>\r\n<br>\r\nOnce he was underneath Romeo’s midsection Natsu got to work. The rosy haired mage formed a large fireball in his hand and threw it up at the giant. The tiny speck of fire slightly illuminated the shadowed space under Romeo…but that’s all it did. Natsu’s flames never made it to Romeo’s skin; the fireball was extinguished via the thin layer of sweat that had formed across his body. Natsu wasn’t aware of this, however, and lobbed a few more at random places. Each one was as ineffective as the last; snuffed out by the younger boy’s perspiration. Natsu’s aggravation grew with each failed attempt, but he refused to give up. As Natsu tossed fireball after fireball at Romeo’s abs and pectorals, Romeo was unintentionally fighting back. As the boy reached four hundred push-ups his body sweated ever more; droplets of that sweat fell from his skin and hit the wooden floor below. To Natsu these mere drops of fluid were like bombs; exploding on impact and splashing the area with a hot wetness. Natsu leaped to dodge these explosions; but a few times he wasn’t quick enough and got doused. Soon Natsu’s pink hair had turned damp and flat and his clothes were so soaked they clung to his own muscled torso. <br>\r\n<br>\r\n“I’ve had it!” cried Natsu as he got to his feet after being drenched in another helping of Romeo’s fragrant body fluid. The shrunken wizard glared up at Romeo’s torso and clenched his fists. “Fire Dragon’s…” Natsu’s cheeks started to inflate as he filled them with fire. He pointed his mouth straight up and then…”ROAR!!” Natsu opened his maw and released a massive beam of scorching flames into the air. In actuality; the beam was terribly thin compared to Romeo’s size, but it was still powerful enough to make it past the teen’s “barrier” of sweat. As powerful as the attack was, however, it left not but a mark on Romeo’s young figure. The only reaction the titan had was a quick scratch to the area Natsu had hit; Romeo hadn’t even paused in his exercising. Once again Natsu roared in anger as he fell to his knees and slammed his fists against the hard floor. “Nothing’s working! None of my attacks even register with him!” The older teen knew he had even stronger spells in his arsenal, but the truth of the matter was he was low on magical power. He didn’t want to admit it, but perhaps the best thing to do now was find a place to hide and wait for…<br>\r\n<br>\r\nNatsu’s thoughts were interrupted by a strange sound in the air. The tiny wizard gazed up at Romeo’s face and noticed the young teenager was breathing much louder. His push-ups were also getting significantly slower. At that precise moment Natsu’s eyes widened in horror and he finally realized the danger he was in at this puny size. <br>\r\n<br>\r\n“Oh crap! Crap crap crap!!” Natsu, completely forgetting his fatigue, stood up and raced in a random direction. He needed to get out of the shadow Romeo was casting NOW. Unfortunately, the Fire Dragon Slayer was much too late. He simply wasn’t covering enough ground no matter how hard he pushed himself. The humongous Romeo lifted himself off the ground one more time before reaching his limit. His toned arms stopped supporting him and he let his body collapse to the ground. Natsu, no where near safety, looked up just in time to see Romeo’s _____ falling upon him.</span></div></div>",
            "created":1335934800,
            "id":1327550,
            "title":"Fire Vs. Sweat"
        },
        "1411111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "content":"<div class=\"\"><div> <span>It all happened in a millisecond, but for Natsu it was much longer. One moment Romeo’s chest hanged above him at a safe distance, the next it was descending upon him without mercy. It was like an entire mountain was being dropped on him; a living, breathing mountain of youthful muscle. As the area around Natsu darkened all he could see was the smooth, perfect skin of Romeo’s chest and the moisture that leaked from the countless pores. He could smell the younger male’s B.O. all around him. He could feel the body heat of the mage as he closed in. <br>\r\n<br>\r\n“Ro-” Natsu attempted to say something, but barely had time to utter the first syllable of Romeo’s name. The wall of muscle that was one of Romeo’s pecs touched Natsu’s lips…and that was the last thing he tasted. Romeo’s form hit the floor with all of its heavy power and the Dragon Slayer known as Natsu Dragneel simply popped. Romeo felt nothing out of the ordinary; did not feel the body of his hero get obliterated underneath him. For a minute Romeo just laid on the floor; panting for air and resting with a smile on his boyish face. Eventually he picked himself off the ground, but only wobbled backwards before collapsing onto his bed. The black haired fire mage laid there with his arms laced behind his head; his sweaty, chiseled chest lifting and falling with each big breath. Soon he started to calm down and is eyelids closed; welcoming sleep…<br>\r\n<br>\r\n“Wait a second!” Romeo’s eyes flew open without warning and his face displayed an expression of annoyance. “I’ll never get as big and strong as big bro if I just rest all the time!” With that said, the young Conbolt ignored his screaming muscles and instantly started on some sit-ups. His body ached and begged for rest, but Romeo would have none of that. He wanted to get stronger and stronger until he could prove to Natsu he was a capable wizard! As the boy worked his abdominals, his body sweated even more from the workout. One of the many droplets of perspiration that decorated his left pec slid over a tiny red dot; effectively washing it away. Any evidence of the mighty Salamander had now disappeared without a trace. </span></div></div>",
            "created":1335934800,
            "id":1327604,
            "title":"Dropped a Kid on Him"
        },
        "142":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Natsu grabs some lunch.",
                "Natsu lays down and rests.",
                "Natsu takes off his waistcoat."
            ],
            "content":"<div class=\"\"><div> <span>Natsu Dragneel walked into his house with a big, toothily grin on his face. The Fire Dragon Slayer was just coming from the Fairy Tail Building after getting into another fight with his rival, Gray Fullbuster. This fight, however, had a very satisfying conclusion. Whether it was a lucky shot or the ice mage was having a bad day, Natsu had succeeded in delivering a devastating uppercut that launched Gray into the ceiling of the building. The smug Natsu then walked out; leaving Gray with his head stuck in the roof and the rest of the guild laughing hysterically. <br>\r\n<br>\r\n“Heh, that perverted stripper deserved it!” Natsu said to himself as he slammed his fist into his palm. “After a victory like that I think I deserve some relaxation! The rosy haired teen walked away from his front door and was about slump onto one of the nearby couches when he heard a pounding on his door. Startled, Natsu looked back at the wooden door as someone banged on it again. “Geez, who could that be? Can’t a Dragon Slayer just relax?” Natsu grumbled as he made his way back to the door and opened it while saying, “Yeah? What do you-?” However, he could not finish the sentence, seeing as it’s quite difficult to speak when an ice-coated fist is buried into your mouth. The blow sent Natsu flying backwards; his body soaring over his rectangular table and landing with a “thump” on one of the sofas. The force of the impact almost tipped the couch backwards. “The hell?!” Natsu covered his aching mouth with his hands and glared back at the person who had punched him. The black-haired, muscular form of Gray stepped into Natsu’s house. He stared at Natsu with the most hateful of looks.<br>\r\n<br>\r\n“Natsuuuu!” Gray growled, cracking his knuckles and causing the ice that coated one fist to crumble. “Did you think we’re finished? Did you think you could just walk away?!”<br>\r\n<br>\r\n“Seriously?” Natsu responded; removing his hands from his mouth. A normal person would of lost most of their teeth after a hit like that; but Natsu was made of sturdier stuff. “I beat you fair and square. Do you want me to kick your ass here in my house too?” <br>\r\n<br>\r\n“It was a lucky punch,” replied the shirtless wizard as cold air started to swirl around his fists. “but when I turn you into an ice sculpture and stash you in your own fridge; that WON’T be luck!” Upon giving Natsu his threat the Ice-Make Mage charged toward is fellow Fairy Tail wizard. Natsu, upon instinct, lit his fists aflame and was about to kick his table toward the incoming Gray when a light bulb lit up in his head. The two of them were alone in the privacy of his home; no other guild members to interfere with them. This was the perfect chance for Natsu to try out a new magic he had been practicing all month. A magic the Master would surely punish him for using on a fellow guild mate…if he knew. <br>\r\n<br>\r\n“Hehe, too bad for you, Gray.” Natsu spoke as the flames around his fists went out and he stretched out a hand toward Gray.  “You just made things a whole lot worse for yourself!” The Dragon Slayer coiled his hand into a fist and a white magic seal formed at the tip of his knuckles. “Reduction Magic!” A moment later the stampeding Gray was consumed in a cloud of white smoke. When the cloud dissipated a second later, Gray was gone. Natsu’s toothily grin returned as he hopped off the couch and stomped over to where Gray had been. As he approached where Gray once was the pink haired male’s grin slowly vanished. “What’s going on here?!” Natsu looked down at the floor, but saw no signs of a shrunken Gray. The spell should of reduced Gray to a miniature size like it did the objects and animals Natsu had practiced on, but instead Gray was simply…gone. He tried to sniff the air to catch a hint of Gray’s scent, but to no avail. “Stupid piece of shit magic! It wasn’t supposed to teleport him somewhere!” Natsu angrily clenched his teeth before sighing with disappointment and turning around. “Oh well…maybe if I’m lucky I sent him halfway across the world. Then he wouldn’t be around here for awhile, hehe!”<br>\r\n<br>\r\n~Seconds before~<br>\r\n<br>\r\nGray was rushing toward the seated Natsu when he noticed the scarf-wearing teen make a strange magic seal he had never seen before. He was surprised to see Natsu use another magic besides Fire Magic, but was even more surprised when his vision was overtaken by a screen of smoke. <br>\r\n<br>\r\n“Ha, a smokescreen? What an amateur magic!” Gray shouted before he emerged from the smoke cloud. As he did he immediately noticed two things were off. First, his feet were no long touching the floor. In fact he was what seemed to be miles above the ground as if he had just ran off a cliff. Second, the Natsu that sat before him was no longer the Natsu he knew. He was now soaring toward a massive, titanic version of the flame eater! “What the-?!” Before he could end his sentence the tiny Gray smacked right into Natsu’s bare chest. It felt as if he had hit a wall of solid iron, however. “H-How…?” Gray mumbled as his shrunken form slipped off of the giant’s chiseled chest. Before he fell too far Gray reached out and grabbed onto Natsu’s black waistcoat. The tiny wizard was now hanging from Natsu’s clothes as the bigger teen moved. The rosy haired mage had no idea Gray was there; not expecting the Ice-Make Mage to shrink so small. He expected Gray to shrink to around six inches like everything else he used the spell on, but instead Gray shrunk to mere millimeters in height! He was now just a tiny speck barely noticeable on Natsu’s torso. “This…this is not good.”</span></div></div>",
            "created":1328850000,
            "id":1274478,
            "title":"Gray's Losing Streak"
        },
        "1421":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Natsu thinks it's a bug bite and slaps the \"mosquito\".",
                "Natsu thinks it's an itch and scratches it. ",
                "Natsu didnt feel a thing."
            ],
            "content":"<div class=\"\"><div> <span>“I’m kinda hungry.” Natsu mutters as he scratches his growling abdominals. As he recalled, the fight between Gray and him broke out just before he was going to sit down to have some grub. He hadn’t eaten anything since breakfast and he was starving! “Alright, lunchtime!” Natsu marched over to the “kitchen”, a small corner of his house that was decorated with several kitchen supplies. The Fairy Tail mage approached his small refrigerator and took a peek inside. As he was doing this, the tiny shrunken Gray was busy scaling up Natsu’s black waistcoat. <br>\r\n<br>\r\n“I can’t believe this happened,” Gray whispered under his breath as he grabbed handful after handful of the thick black material that made up Natsu’s clothing. “What was that fool thinking using such a dangerous magic?!” Gray took a deep breath and tried not to let himself panic. Sure, Natsu had shrunken him to a pathetically small size and humiliated him even more. Sure, Natsu was oblivious to him and could probably crush him without even realizing it. However, Gray was not a quitter! He would not let himself be overcome with fear and hopelessness. His chances may be small, but if Gray could just get the giant hot head’s notice then maybe he could get back to normal. It was far more likely Natsu would take advantage of the situation and do terrible, TERRIBLE things to him, but at least he wouldn’t purposely kill him. Without knowing he was there, however, was a completely different story…<br>\r\n<br>\r\n“Let’s see…” Natsu began fishing through the clustered fridge looking for something to eat. “Spoiled milk, rotten vegetables, fish bones, fish bones, fish bones…” Natsu sighed, thinking he wasn’t going to find anything. He would have to head back to town for lunch. Right before he was about to close the fridge, the pink haired teenager noticed a plate wrapped up with plastic. Natsu took out the plate and pulled back the plastic to reveal a mound of spaghetti. Natsu gazed at the pasta hungrily as some drool trickled down his lips. “This is…!” It was some of the spaghetti Lucy had brought over yesterday! She must of put the leftovers in the refrigerator after Happy and him got full. “This is perfect!” Natsu closed the fridge and carried the plate of spaghetti toward the sofas. <br>\r\n<br>\r\nMeanwhile, the physically fit Gray was making great progress in his climb up the fire spitting titan. Without being able to put his hands together, Gray was unable to use Ice-Make Magic, but that hadn’t stopped the shrunken teen. He had made it to Natsu’s scarf and was quickly making his way up the white, checkered piece of cloth. Soon he reached the end and threw himself on top of the thick, white scarf. Gray was so tiny that he could rest his entire body on the rim of the scarf as if was a solid floor. <br>\r\n<br>\r\n“It’s like…climbing a frickin mountain.” the exhausted Grey groaned. As he rested he watched the world go by as the titan he was riding walked on over to the middle of his home. Soon he came to a stop when he seated himself on one of the couches; the same couch Gray had knocked him into minutes before. The barechested ice wizard glanced over at Natsu’s massive, boyish face next to him as the giant looked down at something in his hands. Gray, however, could not see what it was from here. “Goddammit, Natsu. Look over here!” Gray cursed as he got to his feet and peeked inside the scarf where Natsu’s neck was. Preparing himself, Gray leapt toward Natsu’s normally hidden neck and placed his hands together in midair. “Ice-Make: Battle Axe!” A solid axe of ice appeared in Gray’s hands as he descended toward Natsu’s neck. When he was close enough the ice mage swung the axe down upon the giant’s flesh. The axe, which was smaller than a toothpick, shattered instantly upon connecting with Natsu’s skin. As the thousands of ice particles fell around Gray, the gnat-sized mage touched down on Natsu’s smooth neck and waited to see if their was any reaction.</span></div></div>",
            "created":1328850000,
            "id":1274551,
            "title":"Mt. Dragneel's Lunchtime"
        },
        "14212":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Natsu eats all of the pasta.",
                "Natsu's lunch is interrupted."
            ],
            "content":"<div class=\"\"><div> <span>Gray did the best he could to cling to Natsu’s broad neck while waiting for some kind of reaction from Natsu. Surely the giant must of felt SOMETHING from his attack. He did not have to wait very long. Without the expression on his face changing a bit; Natsu reached a hand behind his scarf. Gray gaped in amazement as Natsu’s huge, god-like hand came into view. Each one of muscular, manly fingers was as thick as a tree trunk. Gray couldn’t help but feel a little intimidated as he imagined what one wrong move from one of those digits could do to him. Thinking Natsu was reaching for him, Gray didn’t move a muscle. By the time he realized Natsu still didn’t have a clue he was there it was too late. Natsu’s fingers touched his neck and he began to scratch. One of those giant fingers caught Gray underneath it; pinning the bug-sized wizard between it and Natsu’s neck. Gray grunted in pain as the digit rubbed him over Natsu’s slightly moist skin; threatening to pop him like a tiny berry. Thankfully Natsu itched for only a second before his hand retreated back to its original spot. Gray, however, remained stuck to the finger pad via the perspiration that coated it. <br>\r\n<br>\r\n“F-Fuck!” Gray swore, struggling to free himself from Natsu’s finger. <br>\r\n<br>\r\n“This is gonna hit the spot!” Natsu announced to the empty house before placing the plate of pasta on the wooden table in front of him. The fire mage then hovered a hand over the spaghetti; fingers spread wide. At this precise moment Gray peeled off of Natsu’s fingertip and fell into the plate of pasta. The half-naked teen coughed as he picked himself up after the soft landing; his face and torso covered in red sauce. <br>\r\n<br>\r\n“What is this?” Gray pondered as he stood up at the peak of the pasta mound. He ran his tongue over his lips to taste the red stuff he was covered in. “…marinara sauce? But that must mean…” Gray’s blue eyes widened in horror and he looked back down at what he was standing on. Noodles…he was standing on a mountain of noodles! Now Gray started to get scared, but things were only beginning to go downhill. The shrunken Fairy Tail wizard noticed the air around him start to twist and the heat level slowly rise. The frozen, hardened sauce covering the spaghetti began to soften and bubble a bit. The thick noodles themselves softened under Gray’s feet as they grew warmer and warmer. Gray, puzzled, craned his neck and looked up. The titan that was Natsu was holding his palm out over the pasta; his hand lit by a raging flame. Natsu was directing heat down onto the pasta; heating it up! “N-No! Natsu, stop!” Gray called, but there was no way Natsu was going to hear his voice. The heat rose and rose as Gray started sweating profoundly. He tried to move through the pasta mound; but his feet sank deeper into the spaghetti and there was just too much of it. Gray couldn’t even see the end of the pasta; it was like a valley of red sauce and spaghetti to him. The extreme heat started taking its toll on Gray as he collapsed to his knees and his mouth went dry. All around him the pasta was popping and sizzling under the heat the fire giant was giving it. The mini-mage weakly put his fist into his palm and attempted to use Ice-Make Magic. “I-Ice-Make…” It was hopeless; the ice particles around his hands quickly melted and evaporated into steam. His magic was useless in this heat.<br>\r\n<br>\r\n“N-Natsu…y-you, idiot…” Gray fell onto his stomach; wincing as the bubbling hot marinara sauce singed his skin. It was so hot that his sweat started to evaporate off his reddening skin. Gray could just lay there and whimper under the fearsome heat while waiting for his blood to boil. Before that could happen, Natsu retracted his hand and the heat stopped increasing. Still, Gray was too weak to move a muscle and simply rested there in the warm noodles; thick steam all around him. <br>\r\n<br>\r\n“Oooh, looks delicious!” Natsu licked his lips hungrily as he took out a fork he had also brought along. Using the fork the giant rose head began stirring the spaghetti and sauce around. He did not notice the little Gray in his food as his body was swept underneath the pasta and buried under several tons of spaghetti and several gallons of red tomato sauce. “Time to eat!” exclaimed Natsu as he twirled the fork and spun himself a large ball of red smeared spaghetti. He then brought the ball of pasta to his mouth, opened wide, and slurped all of it right off the fork. The Dragon Slayer made content sounds as he chewed loudly a few times (much less than normally needed) and swallowed his first bite down. It formed a thick lump in his throat that traveled down the inside before disappearing into his toned chest. “Ahhhh, it tastes great!” Natsu grinned happily and went for another bite; unaware of the little extra addition to his meal.</span></div></div>",
            "created":1328850000,
            "id":1274599,
            "title":"Turn Up the Heat"
        },
        "142121":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "content":"<div class=\"\"><div> <span>The hungry Dragon Slayer consumed forkful after forkful of the delicious pasta; each one masticated only barely before being sent down the teen’s gullet. Not once did Natsu come close to choking; his powerful inner muscles did their job well and made sure each mouthful was carried down to where it belonged. As he ate, Natsu didn’t know that a certain rival of his was fighting for his life within the mound of pasta in front of him. Gray, able to hear what Natsu was doing far above him, crawled for his life to escape the mess he had gotten into. In his disoriented and weakened state, however, Gray was not doing a very good job at escaping his fate. Within the maze of marinara sauce and thick strings of spaghetti Gray could not tell that he was merely crawling around in circles. Nor did he know that his erratic movements were saving him from certain doom. Several times Natsu had rolled up a ball of pasta made from an area Gray had just been in. Luck seemed to be on Gray’s side, but that luck was about to run out.<br>\r\n<br>\r\n“Ahhh, so full.” moaned the teenage mage as he laid back on his sofa and gave his firm abs a few pats. His black eyes glanced down at the plate on the table and he saw one small heap of pasta left. Natsu stared at the remaining food for a moment before smirking. “I guess one more bite won’t hurt.” The wizard sat back up, aimed his fork at the last of his lunch, and brought it down.<br>\r\n<br>\r\nInside that heap of pasta was Gray; still digging through noodles and sauce for a glimpse at freedom. No matter how many strings of spaghetti he seemed to push aside there would always be more behind them. Gray started to think he’d never get out; he didn’t hear Natsu’s loud chewing and swallowing outside either. Would he be lost in this maze of pasta for as long as it took Natsu to throw it into the trash? Was that his ultimate fate? Soon after thinking this, Gray pushed himself past some more noodles and saw a glimpse of the outside world. Desperately he clawed his way toward it and pulled half his body out into the open. Despite his body screaming at him for a rest, a smile formed on Gray’s face. He had made it out; he wasn’t going to end up a meal for that fire breathing iguana! All he had to do was pull the rest of himself out and then…<br>\r\n<br>\r\nBefore he could advance any further, Gray’s luck went dry. Natsu plunged the fork into the last heap of pasta on his plate and spun it around. The noodles tangled around Gray’s lower half started to move and he was pulled with them. He gave a panicked scream as his speck-sized body was yanked away from freedom and firmly held between the noodles that closed in around him. Once Natsu had spun up his last ball of spaghetti he raised it up from the plate and held it in front of his huge face. He eyed the last of the pasta and ran his tongue over his lips once more. He didn’t see Gray on the outside of the ball; held in place by several noodles not much smaller than himself. Gray, however, saw him. He saw Natsu’s youthful face as it looked at him hungrily and he saw as his huge lips parted to reveal his saliva drenched maw. Gray stared into the dark cavern of Natsu’s mouth and fruitlessly pulled at the spaghetti that bound him to the fork. A look of unspeakable horror was glued to his face as the fork sped toward Natsu’s open mouth.<br>\r\n<br>\r\n“NO! NATSU! YOU’RE GONNA EAT ME!” Gray cried out with anguish, but it went unheard as the fork disappeared between Natsu’s lips. Natsu closed his eyes and savored the last bite as he slipped the clean fork out of his mouth. Inside the hot cavern Gray was tossed around the mouth and lost all sense of direction. He screamed, but couldn’t even hear his own voice over the sound of the titan chewing and reducing the pasta around him to mush with his pearly whites. With most of the noodles still whole Natsu tilted his head back and gulped powerfully. He was none the wiser to the little ice mage that was swept into his esophagus as well and pulled down to his awaiting belly. Natsu dropped the fork onto the empty plate and leaned back on his sofa; both hands patting his gurgling stomach. Behind those hard abs, Gray fell into the hot chamber that was the Dragon Slayer’s stomach. He landed with a plop into a mound of chewed up and whole noodles; remarkably less than there should have been. For Natsu’s digestive acids were like lava; quickly breaking down anything and everything the fire mage ate. Gray resumed his struggles within his new confinement; but it was short-lived. The mound of pasta slowly sank into the gastric lake at the bottom of Natsu’s stomach and Gray along with it. The frantic Ice-Make Mage’s muffled screams were completely drowned out by the churning and squelching of Natsu’s belly, and eventually they just…stopped. The mighty Fire Dragon Slayer gave his abs one last slap before opening his mouth and belching loudly. He then smacked his lips and laced his arms behind his head; eyes fixated on his gurgling belly. <br>\r\n<br>\r\n“Mmmm, not bad! Now if only I had the chance to do to Gray what my stomach’s doing to that pasta!”</span></div></div>",
            "created":1328936400,
            "id":1274624,
            "title":"Fire Dragon's Consuming Maw"
        },
        "143":{
            "author_id":"davmil3111",
            "author_name":"TitanLeon",
            "choices":[
                "Natsu",
                "Pantherlily",
                "Laxus"
            ],
            "content":"<div class=\"\"><div> <span>\"Urrgh... my head!\" Gajeel said, his hand on his forehead. He winced in pain, feeling like his brain was being hammered constantly. Fortunately for him, the sharp pain faded after a few seconds. The iron dragon slayer got to his feet and shook his head, trying to remember why his head ached so bad. All he remembered was sitting at a table in the guild's hall and suddenly, he blacked out.<br>\r\n<br>\r\n\"Something must have hit me behind the head... urgh!\" He muttered, looking around to see if anybody decided to go all smart-ass on him. \"What the...?\" He then realized; something was off... way off. The tables and chairs around him were huge! Or rather, he was minuscule! Even a mere chair leg was around ten times wider than him. The whole thing being so surreal and so sudden, Gajeel felt a little light-headed, tumbling around as his brain tried to assimilate the learned information.<br>\r\n<br>\r\n\"Heh... no use standing here. Gotta find a way to get back to normal. I won't accept being that puny for much longer.\" He was about to move in any direction when the ground started trembling. At first it was quite faint, but it quickly gained in intensity. So much that Gajeel ended up falling on his butt, then bounced up and down on the hard wooden floor of the hall. \"Damnit! What's all this ruckus?!\"<br>\r\n<br>\r\nThen as suddenly as they started, the quakes came to an end. The iron dragon slayer got back to his feet once again to look around, and he spots something. For the first time since he woke up, he sees another living person. Sure, they were huge, but it was better than nobody at all. \"Hmm, now to get his attention.\"<br>\r\n<br>\r\nGajeel thought that he should see who it is first, as looking at their feet won't tell everything. He looks up and sees none other than...</span></div></div>",
            "created":1329714000,
            "id":1280862,
            "title":"The Iron Dragon Slayer's Misfortune"
        },
        "1432":{
            "author_id":"davmil3111",
            "author_name":"TitanLeon",
            "choices":[
                "Pantherlily sat on a bench at the bar.",
                "Pantherlily lifted his foot to scritch it."
            ],
            "content":"<div class=\"\"><div> <span>\"Lily!\" Gajeel yelled as he noticed his partner right in front of him. He could see the black furred Exceed, his maroon eyes looking forward. The iron dragon slayer waved, but Pantherlily wasn't noticing him. Even in his chibi form, the panther was still humongous compared to the puny half-inch tall Gajeel. He ran towards him, hoping to get his attention once he got closer, but his partner advanced towards him right as he was only a few feet away. His eyes opened wide once he realized that his friend might just crush him where he stood if his steps had a right timing.<br>\r\n<br>\r\nThe iron muncher turned in a ninety degrees angle and dashed to the side, but Lily's tiny squeaky steps got dangerously closer to him. A shadow covered the iron dragon slayer, he looked up to see that white furred sole come down on him at an alarming speed. He tried to dodge it, but Pantherlily's size was way too important for him to avoid the paw entirely. Even though it was heavy, the foot was quite soft when it slammed on Gajeel.<br>\r\n<br>\r\nWhen the foot lifted up, the young man found himself stuck to the sole quite tightly, tucked in white fuzz. \"Urrgh!\" Gajeel whined as the foot repeatedly got up and down on him as Pantherlily walked. He thanked his iron scales for protecting him from a crushing fate, but he was still quite uncomfortable each time the hard wooden floor came up on his front. \"LILY!!!\" He screamed out of his lungs, but to no avail. Even his cat wouldn't hear him at this size. <br>\r\n<br>\r\nAfter interminable seconds, the footsteps stopped, and Gajeel found himself muffled by the ground. After a few seconds of breath-taking torture, the foot goes up and doesn't come down.</span></div></div>",
            "created":1330232400,
            "id":1284392,
            "title":"Not such a small black cat anymore..."
        },
        "14321":{
            "author_id":"davmil3111",
            "author_name":"TitanLeon",
            "choices":[
                "Pantherlily devours the nachos very quickly.",
                "Pantherlily takes his time to savour the delicious nachos."
            ],
            "content":"<div class=\"\"><div> <span>Gajeel didn't know why his partner stopped walking, but he didn't mind. He sighed in relief, unable to take any more crushing against the hard floor. He immediately tried to pray himself off the furry white sole, but he was sank in Pantherlily's flesh pretty hard. As he pushes against the soft and musky surface, he can hear some talking from above. He stops an instant to listen, he can hear Lily and Mirajane's voice. \"Oh, hello, Lily! Would you like something to eat?\" Mirajane asked with her soft voice.<br>\r\n<br>\r\n\"Yes please. I would like to try nachos, I've never eaten any.\" The black Exceed replied.<br>\r\n<br>\r\n\"Right away. I'm sure you'll enjoy them.\"<br>\r\n<br>\r\n\"Thank you.\"<br>\r\n<br>\r\nThe iron dragon slayer felt relieved, this meant that Pantherlily would stay at the bar for a while, which would give him plenty of time to get off from under his foot and try to get his attention. With a sudden spurt of will and strength, the iron muncher finally teared himself from the fuzzy paw. He hanged unto the fur and swung to the tip of his toes. He panted a little, pulling himself on top of the now black foot, reaching the ankle and catching his breath. He hoped his cat wouldn't move his legs too much as he grabbed the fur of the shin and started climbing, helping himself with the slightly sinking flesh to keep his grip.<br>\r\n<br>\r\nThankfully, Lily was in his small form; he was MUCH shorter like this, and Gajeel reached his waist rather quickly. He was getting quite tired though, it still required a lot of effort even if he had all that fur to get a good grip on. But he kept on, the top of the table was near.<br>\r\n<br>\r\nMirajane came back with a plate filled with nachos, a delicious, thick cheese sauce copiously covering the chips. \"There you go. Bon appétit.\"<br>\r\n<br>\r\n\"It really does look good, thank you, Mirajane.\"<br>\r\n<br>\r\nAs the waitress got back to serve someone on the other side of the bar, Lily got up to have a better look at the plate. He was quite tiny, and he got frustrated when he noticed he could barely touch the plate. He picked the closest nacho and pulled it closer to him, sniffing it. His mouth spread into a smile; the panther found the nacho's smell quite enticing. He opened wide a took a bite of it. He instantly fell in love with the cheesy goodness, devouring the rest of the nacho quite quickly. But then, he realized that it would take him ages to eat that generous serving at his size. He looked around, and then decided to change into his battle form. He expanded rather fast, his bulk greatly increasing, his palms and soles turning black just like the rest of his body and his face morphing into a more mature figure. He grinned, this time he would be able to eat much easier.<br>\r\n<br>\r\nGajeel was up to Pantherlily's chest, able to perceive the huge plate of food, when the black Exceed started growing. The huge burst of magic took him by surprise, expelling him from the huge body. He was thrown quite high in the air, falling down right in the nachos. Covered in hot cheese, he squirmed madly, getting back to the surface before drowning in it. He gasped and looked around, realizing he had fallen in quite a bad place. A shadow covered his sight, and he looked up to see Lily's huge, now human-like, hand come down towards him. He gasped and quickly moved away as the panther's thumb and index pinched the tip of a nacho, pulling it off with a sticky bit of cheese. He hoped he had the time to get away more, because the sickening crunching noises he heard behind him weren't reassuring at all. He did not want to hear them from any closer.</span></div></div>",
            "created":1331701200,
            "id":1294540,
            "title":"Ordering some food."
        },
        "143212":{
            "author_id":"wallinberg",
            "author_name":"Wallinberg",
            "choices":[
                "Gajeel is licked into Pantherlily's maw",
                "Gajeel drops back down onto the plate"
            ],
            "content":"<div class=\"\"><div> <span>When Gajeel landed in the mass of nachos he had no idea which way was quickest off the plate of delicious food but he did know he wanted to be as far away from Lily as possible. So he turned and began to make his way away form Lily as the crunching sound turned to chewing then finally an audible gulp, sending shivers down his spine. As Gajeel attempted to wade his way through the thick cheese and around the large nachos he could see the shadow of Lily's hand come close and grab the next chip right beside him. The nacho was slowly pulled from the pile, a long sting of cheese still connected to the plate, as a pleasurable purr could be heard from Lily who was greatly enjoying his savoury treat. <br>\r\n<br>\r\nGajeel turned just in time to see his partners maw open revealing the slimy pink insides as the whole chip was placed inside then disappear, closed eyes as another loud crunch was heard. He was in awe as he watched the jaw worked to turn the once crunchy nacho into mush for easy swallowing then a large bump go down Lily's neck with a loud gulp. If he didn't get off this plate soon that might be him going down to meet the same fate as the rest of the plate. Lily looked back down at the plate before him and licked his lips, nearly half the plate already devoured. <br>\r\n<br>\r\nGajeel thought this might be his chance to be seen and rescued from this minuscule size so he began to wave his arms and shout for Lily's attention. His idea seemed to be working as Lily looked closely at the plate and leaned in a bit closer, a paw moving right over to where Gajeel stood. Little did he know that being covered in cheese did him no favours in revealing his true self and Lily's paw went right over him to grab the nacho right behind him.<br>\r\n<br>\r\nThe tipping of the chip caused a wave of melted cheese to take Gajeel for a ride as the nacho was pulled away from the plate and towards the hungry maw of his partner. Still half buried in the cheese Gajeel was pulled along by the stretchy sticky string of cheese attached to the chip as it was placed in his partners waiting mouth. He heard the first crunch as he dangled from the strand of cheese dangerously close to the humid muzzle. A quick lick brought half the sting of cheese in to join the rest of the nacho as Gajeel began to yell for his friends attention and struggle to get out the sticky and deadly cheese.</span></div></div>",
            "created":1483333200,
            "id":2257861,
            "title":"Pantherlily takes his time to savour the delici..."
        },
        "14322":{
            "author_id":"eclipsegemini",
            "author_name":"BlueHologram",
            "choices":[
                "Woke up on the train (on a mission)",
                "Woke up in a house (Pantherlily went home)"
            ],
            "content":"<div class=\"\"><div> <span> Pantherlily had stopped walking after feeling a itch on the bottom of his foot he then lifted it up to scratch it. Gajeel thought that his exceed companion had finally noticed him and started to yell “Lily! Im-\" Gajeel was cut off as Pantherlily's huge fingers (To Gajeel) scratched over him.<br>\r\n<br>\r\n The scratch wasn't enough to hurt Gajeel but it was strong enough to make him change positions so that he was facing Pantherlily's foot rather than the floor. It also pushed Gajeel even deeper into the exceeds foot “Urrgh, I cant move..\" Gajeel said struggling to move he then felt something wet come down on his face “gross!\" Gajeel yelled realizing it was a drop off sweat!. Gajeel got the wind knocked out of him every time Pantherlily took a step and was forced to breath in Pantherlily's musk every time it went up. Gajeel then passed out due to the strain on his body and then woke up in..</span></div></div>",
            "created":1462770000,
            "id":2145439,
            "title":"Pantherlily lifted his foot to scritch it."
        },
        "145":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "Romeo",
                " more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a shrunk little Romeo?</span></div></span></div>",
            "created":1453698000,
            "id":2094295,
            "title":"how about..."
        },
        "15":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Bleach",
                "One Piece",
                "Detective Conan",
                "Fullmetal Alchemist",
                "More Anime"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More anime</span></div></span></div>",
            "created":1325653200,
            "id":1252654,
            "title":"More Anime"
        },
        "151":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Ichigo",
                "Renji",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252656,
            "title":"Bleach"
        },
        "152":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Luffy",
                "Zoro",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252658,
            "title":"One Piece"
        },
        "1522":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes, Zoro",
                "Sanji",
                "Another character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(seeing as the last option choices saying 'More' leads to a dead end, I wanted to put the continuation here)<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1499576400,
            "id":2350144,
            "title":"Zoro"
        },
        "15223":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yeah, long nose ahead",
                "No, somone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Ussop</span></div></span></div>",
            "created":1499585040,
            "id":2350145,
            "title":"Another character"
        },
        "152232":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yeah",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Chopper?</span></div></span></div>",
            "created":1499585040,
            "id":2350146,
            "title":"Chopper"
        },
        "1522322":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yeah",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Luffy's older brother, Ace?</span></div></span></div>",
            "created":1499585100,
            "id":2350147,
            "title":"Portgas D Ace"
        },
        "15223222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Smoker it is",
                "No thanks, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the devil fruit using Marine, Smoker?</span></div></span></div>",
            "created":1499585220,
            "id":2350148,
            "title":"Smoker?"
        },
        "1523":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The straw hat cook</span></div></span></div>",
            "created":1460437200,
            "id":2131661,
            "title":"Sanji"
        },
        "153":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Conan",
                "Heiji",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252659,
            "title":"Detective Conan"
        },
        "154":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Edward",
                "Alphonse",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky guy?</span></div></span></div>",
            "created":1325653200,
            "id":1252660,
            "title":"Fullmetal Alchemist"
        },
        "1541":{
            "author_id":"jkios",
            "author_name":"jkios",
            "choices":[
                "Al"
            ],
            "content":"<div class=\"\"><div> <span>It had been over a year since peace had returned to Amestris after the Promised Day. This peace was accomplished largely by the Elric brothers and their heroic efforts. Things had returned mostly to normal for Edward and Alphonse, but life in Amestris was still very interesting...<br>\r\n<br>\r\nEdward Elric was in a very bad mood. Just over a year ago, he was excited about finally growing taller, but now he realized that he was somehow getting shorter in height. <br>\r\n<br>\r\n“How is this even possible!” Edward yelled furiously, holding a measuring stick in his hand. <br>\r\n<br>\r\n“What’s wrong, Ed?” Winry called from a nearby room. She and Ed had finally moved in together after several months of awkward interactions. While they were not officially married, they had plans for a wedding in the future. <br>\r\n<br>\r\n“I know I was 5 foot 8 last year, and now I’m 5 foot 5!” Ed exclaimed. “Somehow I shrunk, and I blame it on that asshole Truth.” <br>\r\n<br>\r\n“You’re probably just imagining that because you can’t accept being shorter than me,” Winry responded, unaware of her mistake. <br>\r\n<br>\r\n“I am NOT short!” Edward screamed in reply. <br>\r\n<br>\r\n“What’s the matter, Ed?” Alphonse asked as he entered the house. <br>\r\n<br>\r\n“Height problems,” Winry told him. “Not that you’d understand.” <br>\r\n<br>\r\nAl, like Winry, was taller than Ed, but he towered over his brother by nearly a foot. After the Promised Day, Al, to Ed’s irritation, had a major growth spurt and quickly grew much larger than Ed.<br>\r\n<br>\r\n“If you only drank your milk, this would never have happened,” the 6 foot 4 Al told Ed. <br>\r\n<br>\r\n“This has nothing to do with milk!” Ed yelled. “I’m shrinking! I’m 3 inches shorter than I was last year!”<br>\r\n<br>\r\n“Are you sure you haven’t always been this height?” Al asked, cockily placing his large hand on Edward’s<br>\r\nhead. <br>\r\n<br>\r\nEd pushed Al’s hand away and sprinted out of the room angrily. Why don’t they believe me? He wondered to himself. Suddenly, Edward felt a strange sensation, almost as if his body was being compressed. He immediately fell unconscious for several seconds.<br>\r\n<br>\r\nWhen Ed opened his eyes, he was surrounded by an enormous room. He quickly recognized his house, but he realized that it was a giant version of it. Is this a dream? He thought. At that moment, Ed felt a rumble and noticed an unbelievably massive figure approaching him. This giant was ...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1553062080,
            "id":2632534,
            "title":"Edward"
        },
        "1542":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "Successful evade impending death.",
                "End up underneath his foot...But which one?(Possible Life/Death).",
                "Hey, Idiot! YOU ARE AN ALCHEMIST! Use it!"
            ],
            "content":"<div class=\"\"><div> <span>Credit where credit is due. Most of this story is adapted from a Full Metal Alchemist: Brotherhood story of the title:<br>\r\nInseparable Brothers.<br>\r\nUrl: <a rel=\"nofollow\" href=\"https://www.deviantart.com/darklord665/art/Inseparable-Brothers-515185855\" target=\"_blank\">https://www.deviantart.com/darklord665/a...</a><br>\r\n<br>\r\nIt had been one year since Father’s defeat. One year since Edward recovered his right arm and Alphonse his entire body. Other than Ed’s now inability to preform alchemy, life was good and returning to normal. The Elric brothers returned to Resembool, they rebuilt their old home, and then…<br>\r\n<br>\r\n“So…how’s Al holding up?” asked Winry as she sat across from Edward at the kitchen table of the Rockbell's house. In front of her were various tools and dismantled automail parts that were keeping the blonde so busy she couldn’t spare the moment to look up at the person she was speaking to.<br>\r\n<br>\r\n“Pretty good, all things considered.” The former alchemist replied, also neglecting to look up from his work. As Edward sat there, dressed in a pair of black trousers and a sleeveless, black top, he was immersed in the texts of several books at once. On either side of him were stacks of even more tomes. “He says he’s gotten used to it—the whole being tiny thing—but I think he’s just trying to put on a brave face. Being so small someone can pick you up into their hand would unsettle anyone, but he trusts the guys back at Central and I to come up with a solution.”<br>\r\n<br>\r\nAbout three weeks ago, Edward’s brother Alphonse began experiencing an extreme decline in height. It started with just a few inches, then a foot or two, and suddenly Edward came home one day and almost stepped on his younger brother after he had shrunken to the size of a doll!<br>\r\n<br>\r\n“And? Have you made any headway?” the Winry inquired while she used a wrench to twist a screw on an automail hand.<br>\r\n<br>\r\n“None.” Ed answered with a heavy and drawn-out sigh. “We haven’t even been able to figure out what’s caused it. The very fact he’s so small and still alive is scientifically implausible, so it can’t be related to alchemy. Either he’s been poisoned, God’s fucking with us again, or…” Ed scoffed and slammed shut an old book on “magic” and “rituals”. “…it’s some weird voodoo, hocus pocus baloney.”<br>\r\n<br>\r\n“Well…at least he stopped shrinking, right?”<br>\r\n<br>\r\n“Yeah, he hasn’t shrunken in over a week now.” He said as he opened up a new book on plants and poisons from foreign countries and began flipping through the pages. “I don’t think he’ll get any smaller, that’s why I left him back at home. The only thing he has to worry about there is the occasional cockroach, and he has little trouble with them.”<br>\r\n<br>\r\nThe duo spent the next several minutes in silence as they both worked on their separate projects. Eventually, Winry looked up and caught Ed pulling at the collar of his shirt. Due to today’s dreadful summer heat, the 17-year-old was sweating bullets and his shirt was practically glued to his skin. Next to his arm was an empty glass that once held an abundance of refreshing, cool water, but Ed was so engrossed in his reading that he would rather die in the heat than get up to replenish it. Rolling her eyes, the automail mechanic stood up and grabbed Edward’s glass on her way by. She refilled it for him and placed it back down next to him. Mumbling a thank you, the long-haired youth took the tumbler and brought it to his lips without ever actually checking its contents.<br>\r\n<br>\r\n“Ptooie!” The former Fullmetal Alchemist spat out a white haze the moment the pale liquid touched his tongue. Slamming the glass down upon the wooden table, Edward directed his eyes up at his friend in a loathing glare. “MILK?! Are you trying to kill me?!”<br>\r\n<br>\r\n“So close…” Winry muttered under her breath as she took the glass of cold milk back; disappointment diffused across her face. As she took the milk to the refrigerator so it wouldn’t go bad, she spoke out loud, “Honestly, Ed, milk is good for you! Don’t you wanna be tall?”<br>\r\n<br>\r\n“In case you didn’t notice, I’m taller than you! I’ve grown plenty these last couple years without having taken a sip of that repugnant cow piss! It’s probably thanks to your damn automail I wasn’t gro—“<br>\r\n<br>\r\nBefore Ed could finish, he was quickly silenced with a wrench to the head. As he doubled over and held the back of his head in pain, Winry went on to say, “And what about Al? How tall was he before this whole shrinking business happened?”  Edward immediately froze and ceased his resentful grousing. The reaction pleased Winry as she continued. “A few inches taller than you, if I recall! If you start drinking milk, you might be able to surprise him when he finally returns to normal!”<br>\r\n<br>\r\n“Would you just get off my back?” Ed took his hands off his cranium and rested them on the tabletop as he returned to his books. “I need to focus.”<br>\r\n<br>\r\n“Fine.” Winry spat, but instead of returning to her seat, she grabbed a bag off the kitchen counter and headed for the door. “I need to pick up some things at the market. Try not to cause any trouble while I’m gone, alright?”<br>\r\n<br>\r\n“The hell does she think I’m gonna do?” Edward asked himself after she had shut the door behind her. With both Pinako and Den out of town, there wasn’t even anyone for him to argue with. A few minutes after he was left alone, Edward heard an irritating buzzing by his ear. When he felt something land on his cheek, he instantly slapped it with the lightning-fast reflexes of a martial artist. Taking his hand away from his face, he examined it and spotted the black, flattened remains of a fly staining his palm. As he wiped his hand against his pants he said, “Not even she would get mad at me for killing some bug, right?”<br>\r\n<br>\r\nNot long afterwards, the silent and peaceful atmosphere was disturbed by a peculiar scratching noise. Ed only acknowledged it the second time it occurred when he lifted his eyes from his work and they darted around to find the source. He traced the third instance to the door Winry had left through not long ago. “What is it now?” he grumbled quietly as he slid his chair back, stood up, and made his way to the door just as something scratched at it a fourth time. When he pulled it open, no one entered his sight until he lowered it. There, sitting on the front steps and staring right at him, was a golden cat. Edward recognized it as the same feline that had been spotted around Resembool lately; the one that had taken a liking to his brother.<br>\r\n<br>\r\n“What do you want? Get out of here! Shoo!” shouted Ed as he dismissingly waved while sneering down at the stray animal. It refused to budge and simply sat there; staring up at the human with big, green eyes. The crying it made pierced the teen’s ears and made his eyebrow twitch. “Geez. If I give you some milk, will you scram?” Uttering some not-so-nice things about cats, Ed spun around and walked to the white refrigerator.<br>\r\n<br>\r\n“Brother! Big brother, I’m down here! Don’t you see me?!” squeaked a voice belonging to none other than Alphonse Elric; the younger of the two Elric brothers. The tiny alchemist stood between Victor’s (that’s the cat) ears and was shouting at his ginormous, towering brother while waving his arms to signal him. His older brother seemed to glare right past him, however, and was soon turning his back to walk away. “No! Ed! Dammit!” It was just as he feared—his brother couldn’t hear him! He couldn’t see him atop Victor’s head either (his golden-blond hair did match the cat’s fur). Seeing no alternative, Al thanked Victor for his assistance and began sliding down his vivid coat to the floor below.<br>\r\n<br>\r\nThe younger Elric brother had been minding his own business at home, doing his own studying (no one could imagine how much harder it was to turn pages when you were only a few inches tall), when he suddenly started to shrink again! Before he knew it, he was a mere centimeter tall! Worried his shrinking wasn’t over yet, Alphonse climbed up onto Victor and directed the enormous cat to Winry’s house. He had to get Ed’s attention before he got any smaller!<br>\r\n<br>\r\nAs soon as the itty-bitty teen arrived on flat, solid ground, he made a mad dash for the house’s opened entryway. Al felt like an intruding ant taking advantage of a carelessly unshut door as he crossed over onto the hardwood floor of his childhood friend’s kitchen. Almost immediately, the miniscule blond’s shod feet slapped against moist ground and he caught a whiff of something rank in the air. Pausing and looking around, Alphonse realized he was standing in a vast footprint of fragrant sweat! As he plugged his nose, Ed’s little brother could only imagine how copiously his brother’s foot must be sweating to produce such a track. He did not need to imagine for much longer…<br>\r\n<br>\r\n*THOOM* *THOOM* *THOOM*<br>\r\n<br>\r\nThe wood beneath Alphonse’s feet shook and quaked to alert the smaller Elric that his sibling was on the move again. The young alchemist turned his head to witness his colossal brother turning the corner and begin stomping toward him; both of his feet, one of metal and the other of flesh and blood, creating similar THOOMs as they slapped against the floor. Al felt the air leave his lungs as he craned his neck back and gazed upon the enormous figure of the former State Alchemist. Ed had been a veritable giant ever since he first shrunk, but now…now the teenager of average height seemed to dwarf any building Alphonse had ever seen!<br>\r\n<br>\r\n“Brother! Look down!” cried the gnat of a 16-year-old, but Edward’s unobservant eyes of gold never graced the floor beneath him and he kept on marching forward. As the titanic blond was about to close the gap between him and his bug-sized relative...<br>\r\n<br>\r\nCan the Elric boy evade his elder brother's feet and avoid being a victim of unaware fratricide? Or will he be at the mercy beneath his (un)notice?</span></div></div>",
            "created":1604211660,
            "id":2932581,
            "title":"Alphonse"
        },
        "15421":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "Get Edward to notice him!",
                "Climb up for attention.(Edward or Furniture)"
            ],
            "content":"<div class=\"\"><div> <span>Al made a split-second decision and fled. He managed to throw himself out of the way just before Edward’s bare foot of flesh crashed down where he had been standing; hurtling him through the air in a powerful gust of wind. Lying on his back, the youth peered behind him and took in the factory-sized structure that was his big bro’s sweltering appendage. “T-too close…if I had hesitated for even a second more, I’d be dead right now!” That was the second time his brother had almost stepped on him! It almost made him miss the days he had towered over Ed as a suit of armor.<br>\r\n<br>\r\n“Here, hope you choke on it.” Edward said scornfully as he placed a bowl of milk in front of the gold cat. Victor happily meowed and began lapping up the refreshing dairy product. Whether it ever cared about its tiny passenger’s plight or not, the feline completely forgot about everything else save the bowl of creamy deliciousness in front of it. Meanwhile, Alphonse wasn’t going let something trivial like almost getting crushed stop him from getting Edward’s attention. As he approached the giant’s bare stomper, his boyish face cringed as it was subjected to the foul stench plaguing the air. He could see salty dewdrops trickling down the warm skin of his brother’s foot; soaking into the hardwood floor beneath it and polluting the surrounding air with a most unpleasant odor. What’s more, the foot was producing its own heat and Al could feel his face grow hotter and hotter with every step he took. Soon his sibling’s foot was within arm’s reach and Alphonse stared up the length of the trunk-like leg as it stretched up to the heavens...<br>\r\n<br>\r\nWhat should Alphonse next course of action be?</span></div></div>",
            "created":1604212380,
            "id":2932587,
            "title":"Successful evade impending death."
        },
        "154211":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "Dislodging the little Elric boy!",
                "With Al still trapped!"
            ],
            "content":"<div class=\"\"><div> <span>“If you can’t hear me…then maybe you’ll feel me!” Upon saying this, the teenage alchemist commenced an attack on his towering brother’s foot. He punched and kicked the hot flesh with everything he had, but the huger blond failed to take notice to any of the feeble blows. Without warning, Edward pivoted his foot and removed it from his pint-sized brother’s vision just as the latter threw a punch at empty air. His golden orbs drifted upward and he observed Ed placing his elephantine toes overhead before bringing them down upon his diminutive self. In that brief second, Alphonse’s mouth hung open in disbelief and he felt the hairs on the back of his neck stand up straight. “NO! Broth—!”<br>\r\n<br>\r\n*THUMP*<br>\r\n<br>\r\nThe long-haired colossus was totally oblivious as he turned around and smashed his little brother under his heavy power…partially because he had not. Tiny, helpless Alphonse had been tucked into the crevice between two of his bulbous toes. There, stuck between his beloved brother’s meaty hallux and neighboring digit, Al could merely squirm and attempt to yell over the earthshattering kabooms generated by the titan’s strides. Ed eventually returned to his seat at the kitchen table, but this didn’t do much to change Al’s dilemma. He remained trapped between Edward’s toes; writhing in the stifling heat and rancid scent of the man’s right foot.<br>\r\n<br>\r\n“E-Ed…h-help…! Get me…get me out of here…!” the centimeter-sized male pleaded, but his soft voice couldn’t reach Ed’s ears as the larger boy continued to read. In the several minutes that passed, the sweaty giant occasionally clenched his five toes. What was an absentminded action on his part was torture for Alphonse as the smaller of the two Elrics got his whole body quashed between the mammoth-sized, sweat-soaked digits of a superior male. The young, cute face of the miniaturized prodigy was squeezed into the moist, fleshy wall of Edward’s big toe and Al’s dizzy eyes rolled into the back of his skull with disgust. Just when the former, bodiless boy thought his torment would go on forever, Edward leaned his weight back until he was balancing the chair he sat on upon its two back legs. At the same time, he lifted both feet off the floor and propped them up onto the tabletop...</span></div></div>",
            "created":1604389200,
            "id":2933641,
            "title":"Get Edward to notice him!"
        },
        "1542111":{
            "author_id":"quagmire69",
            "author_name":"NinjaHound13",
            "choices":[
                "On the tabletop beneath them.",
                "Somewhere else on the (mostly) fleshy expanse of his Elder brother's body."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This action created enough momentum for Al to fall out from between the kicked backed behemoth’s toes and land...</span></div></span></div>",
            "created":1604389500,
            "id":2933643,
            "title":"Dislodging the little Elric boy!"
        },
        "1543":{
            "choices":[
                "Roy Mustang",
                "Scar",
                "More Guys!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these guys as shrinkies?</span></div></span></div>",
            "created":1326171600,
            "id":1256275,
            "title":"More FMA Shrinkies"
        },
        "15433":{
            "choices":[
                "Maes Hughes",
                "Envy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay these are your last two choices -_-.</span></div></span></div>",
            "created":1326171600,
            "id":1256276,
            "title":"More Guys!"
        },
        "154331":{
            "choices":[
                "Hughes Attempts to Get Ed's Attention",
                "Hughes Tries to Get Al's Attention"
            ],
            "content":"<div class=\"\"><div> <span>The Elric brothers were staying at the Hughes home, after practically being dragged there by Maes, who was currently sitting up early that morning having a cup of coffee before anyone else had awoke.<br>\r\n<br>\r\nMaes had of course heard of them, and of the taboo they committed in trying to bring their mother back to life. But he didn't pry, figuring the boys would have a hard enough time ahead of them already. Something had been growing on his mind lately, he needed to visit the archive room at HQ. Leaving a note on the table, he put on his work uniform and left.<br>\r\n<br>\r\n***Central HQ Archive Room***<br>\r\n<br>\r\n\"Liore, these endless uprisings, Philosophers Stone, human sacrifices, and the outright genocide of the Ishvalan people...\" Lieutenant Colonel Hughes muttered to himself as he circled each point on the map. When each point was connected, it became something so horrifying that Hughes couldn't have begun to imagine it in his wildest nightmares. <br>\r\n<br>\r\n\"This means.....how could this even happen!? Who could've orchestrated something as terrible as this? I've gotta tell the Fuhrer right away!\" <br>\r\n<br>\r\nThe open door to the archive room closed, and the figure of a woman stood between him and the only exit. <br>\r\n<br>\r\n\"Hello Lieutenant Colonel, its nice to meet you. Well...hello really isn't the word I'm looking for.\" The woman said in her seductive voice. <br>\r\n<br>\r\nMaes saw the Ouroboros tattoo centered above her breasts. <br>\r\n<br>\r\n\"Cool tattoo.\" Maes pulled one of his push knives from his sleeve and threw it just as the woman's elongated claws pierced through his shoulder, throwing him against the wall <br>\r\nLust jerked her claws out from Hughes' shoulder, and aimed for his head, \"Enough!\" a tall man from the shadows held up his hand and Lust's deadly blades stopped inches from Maes' neck. <br>\r\n<br>\r\nA tall black man emerged from the shadows and Lust backed away, retracting her claws. \"Captain Fokker? Don't tell me you're involved with this!?\" <br>\r\n<br>\r\n\"Hm? Oh I'm sorry, I'm still incognito aren't I? Hehe, just a sec.\" <br>\r\n<br>\r\nRed light shone everywhere about the room and soon Fokker was gone and before Maes stood a skinny boy with long black hair with a greenish tint to it. <br>\r\n<br>\r\n\"Father wants us to do things a little differently this time, he's found a new use for the Philosopher's Stone!\" Envy held up a vial full of red liquid, he uncorked it and held the struggling and wide eyed Maes down. \"This'll only hurt a lot. Hehehehe!\" Envy laughed as he poured the solidifying stone into Maes' wound. <br>\r\n<br>\r\nMaes Hughes felt an excruciating pain for a little over a minute, and then blacked out.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nHughes rubbed his eyes and yawned, thinking the entire previous occurrence was nothing but a bizarre dream. That was when his vision began to clear and he saw where he was. He was in fact, on the floor of the train at the feet of Alphonse and Edward Elric as they rode through the night toward Winry's house. He began to overhear bits of their conversation, \"Its really sad about Lieutenant Colonel Hughes disappearance isn't it Ed?\" <br>\r\n<br>\r\n\"Yeah, I hope they find him safe soon.\" <br>\r\n<br>\r\nHughes couldn't believe it, how long had he been out?! His family must be worried sick! \"First things first,\" Hughes told himself, \"I have to get these two's attention.\"</span></div></div>",
            "created":1326171600,
            "id":1256321,
            "title":"Maes Hughes' Disappearance"
        },
        "155":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Yu-Gi-Oh! (Any Series)",
                "Eyeshield 21",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some more anime choices for you!</span></div></span></div>",
            "created":1326171600,
            "id":1256284,
            "title":"More Anime"
        },
        "1551":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Yu-Gi-Oh!",
                "Yu-Gi-Oh! GX",
                "Yu-Gi-Oh! 5Ds or Yu-Gi-Oh! Zexal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which series do you want to go with?</span></div></span></div>",
            "created":1326171600,
            "id":1256285,
            "title":"Yu-Gi-Oh! (Any Series)"
        },
        "15511":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Yeah!",
                "No Way!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Joey shrinks?</span></div></span></div>",
            "created":1326171600,
            "id":1256296,
            "title":"Joey?"
        },
        "155111":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "A teenager's bedroom, filled with Dinosaur stuff. (Rex Raptor's Room)",
                "The interior of some fishing ship (Mako Tsunami's Boat)"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't believe I lost...\" Joey spoke as he fell to his knees in front of a hooded figure. The figure grinned mischievously underneath his hood, \"You lost a shadow game, so your soul is forfeit to me. But wait... how interesting you are. I might let you keep your soul and do something else with you.\" The hooded figure walks closer to Joey as he starts to get sleepy and eventually loses consciousness. Joey dreams about his loss and about that mysterious hooded figure who, in the dream, looked absolutely gigantic in size! The hooded duelist raises a foot over Joey before...<br>\r\n<br>\r\n\"AHHHH!!\" Joey screams as he wakes up with a start. He gets a pain in his head, \"Ow... that hurt...\" It is only then that he looks at his surroundings, \"Where... am I?\"<br>\r\n<br>\r\nHis surroundings looked like...</span></div></div>",
            "created":1326171600,
            "id":1256303,
            "title":"The \"Shrink\" Card"
        },
        "1551111":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "The sock near the door.",
                "The underwear nearby."
            ],
            "content":"<div class=\"\"><div> <span>Joey found himself standing on a plank of a hardwood floor, staring up at his surroundings. On the far side of the room was a bed with dinosaur print on it. There were models of Pterodactyls hanging from the ceiling and T-Rex toys on the shelves, acting as bookends for magazines and books on the subject. It even had a trophy on it that read \"Dueling Championship Runner-Up\". To a perceptive person, it would be obvious that Joey was standing in Rex Raptor's room. But to Joey, it was some random kid's room. Suddenly, there was what felt like an earthquake. A small glass of water on top of a desk nearby started rippling with each tremor. Joey needed to hide somewhere, but there was a very limited number of places for him to hide. Near the door was a sock that was obviously worn before. Closer to where he was laid a pair of obviously used underwear.<br>\r\n<br>\r\nWhere would Joey run to?</span></div></div>",
            "created":1326171600,
            "id":1256310,
            "title":"Rex Raptor's Room!"
        },
        "15511112":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "...a pair of giant balls.",
                "...a massive butt."
            ],
            "content":"<div class=\"\"><div> <span>Joey had only seconds to act. He didn’t have time to understand what happened to him; only that he had somehow ended up in the room of a giant! He had seen giant monster films before; this earthquake he felt wasn’t being caused by seismic waves, it was being caused by giant footsteps! Most likely they belonged to whoever’s room this was and Joey didn’t want to be out in the open when that door opened. Joey wasn’t taking into account his pathetically small size, however. Even if he stayed where he was he probably wouldn’t be noticed right away. Then again, Joey wasn’t thinking very calmly right now, shown more apparent when he hops into the nearby pair of used underwear! Sure, it was closer than the sock, but still…it was a pair of used underwear!<br>\r\n<br>\r\n“Ugh, already regretting this decision.” Joey mumbled to himself as he plugged his nose to keep out the rank smell of the used undergarment. The ant sized teen was hidden among the folds of the white fabric, but it smelled so bad that Joey wondered if he had the time to give the sock a try instead. That plan was quickly shot down when the door to the bedroom swung open; triggering Joey to quickly lay down on his stomach and keep perfectly still. <br>\r\n<br>\r\nEnter Rex Raptor; the Dinosaur duelist. Rex had just come from the shower; his brown and purple hair still a little damp. His torso, which was not as muscular as the taller Joey’s but still toned, also glistened with wetness. The teenage duelist was wearing nothing but a towel around his waste, and upon entering the privacy of his room and closing the door he let the towel fall to the floor. The now nude giant proceeded to his dresser; stepping right over Joey and his hiding place. The frightened little man glanced up and saw the huge shadow of the giant pass over him. It was just his silhouette, but Joey could already tell how massive he was compared to himself. Once at the dresser Rex started fishing out some clean clothes to wear and tossed them onto his bed. When he reached his underwear draw, however…<br>\r\n<br>\r\n“Shit, out of underwear.” Rex cursed under his breath; his voice too low for Joey to hear and identify him. The long haired duelist spun around and gave his room a quick glance-around. His purple-blue eyes locked onto Joey’s hiding spot. It was the same underwear he was wearing before hopping into the shower. “It’ll have to do.” The naked teen stomped over to the underwear and, without knowing of its little passenger, slipped his bare and moist feet into them. This startled Joey, who only saw two walls of flesh appear within his dingy and stained hiding place. <br>\r\n<br>\r\n“Did he already find me?!” Joey wondered out loud as he tried to scramble out of the underwear. It was no use, however, as Rex had already reached down and gripped the rim of the undergarment. He swiftly pulled up; the underwear riding up his legs and speeding toward his groin. Joey’s hysterical screams went unheard as he looked up and saw…</span></div></div>",
            "created":1328504400,
            "id":1272167,
            "title":"Bad Hiding Spot #104"
        },
        "155112":{
            "author_id":"jeff77779",
            "author_name":"h",
            "choices":[
                "Heart of the cards!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the main protagonist of yugioh? (Yugi muto)</span></div></span></div>",
            "created":1599532740,
            "id":2899241,
            "title":"No Way!"
        },
        "1552":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Sena",
                "Monta",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character do you want to shrink?</span></div></span></div>",
            "created":1326171600,
            "id":1256311,
            "title":"Eyeshield 21"
        },
        "15521":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Monta",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The sun was setting. Practice was just getting over when a familiar voice shouted, \"Hey, Eyeshield! Get over here for a minute, will ya?\" It was the sound of the demonic quarterback himself, Hiruma Yoichi. Sena, known by his fans as Eyeshield, ran towards Hiruma and followed him into the quarterback's personal office. As soon as Sena walked in the doors, Hiruma slammed the door shut and locked it, \"Now that the football season is over until next fall, I've got some special endurance training just for you!\"<br>\r\n<br>\r\nSena blinked. He was incredibly afraid of what Hiruma would propose as a part of his training, but Hiruma was never wrong. It was then that the demonic quarterback pulled out a vial of strange, glowing liquid, \"Drink this.\" Sena looked at it, \"Uhh... what is it?\" Hiruma grinned widely, \"That's a secret. Just drink it.\"<br>\r\n<br>\r\nFearing the quarterback, he nodded and drank the contents of the vial. Hiruma could only laugh as he watched Sena shrink down until he was only an inch tall, \"Now then, my little buggy Eyeshield, you're gonna be getting close to one of your fellow teammates. VERY close. Your training is to live out your entire summer inside of the clothing of this particular teammate. Food and drink shouldn't be a problem, but you will constantly have to keep on the move in order to survive the perils of being an insect. And because I'm so generous, I'll let you choose which teammate you get to stay with.\" All of a sudden, Hiruma pops off one of his football cleats and, placing Sena on the ground, places his foot on top of the little running back, \"HOWEVER! If you should leave your assigned teammate OR your assigned teammate finds out that you've been shrunken down, I'll take you for myself.\" Hiruma applies pressure to Sena's body under his smelly foot, \"And trust me, my feet are the absolute least of your worries, GOT IT?\"<br>\r\n<br>\r\nSena screams out \"I GOT IT, I GOT IT! PLEASE LET ME GO!\"<br>\r\n<br>\r\nHiruma removes his foot from Sena and slams it next to him, \"Good, now I made sure everyone else would be gone for a few minutes longer, so you'll have some time to choose whose clothes you'll be inhabiting for your entire summer.\" Sena gulped and then made his decision. \"I want to stay with...\"</span></div></div>",
            "created":1326171600,
            "id":1256322,
            "title":"Hiruma Strikes Again!"
        },
        "155211":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Sock",
                "Underwear"
            ],
            "content":"<div class=\"\"><div> <span>\"YA-HA! If you really want to be in that monkey's clothing the entire summer, that's your prerogative. Though considering the amount of trees he must climb, I'd make sure to have a good handhold, if I were you.\" Hiruma taunted the tiny Sena as he picked him up and carried him to Monta's locker, \"Now remember. Either you stay inside monkey-boy's clothes with him completely unaware, or you're my little toy for the entire summer, and I WILL know if you escape. Got it?\"<br>\r\n<br>\r\n\"...I understand...\" Sena sighed, defeated.<br>\r\n<br>\r\nHiruma grinned and rummaged through Monta's clothes, pulling out a sock and a pair of underwear, \"Now then, do you want to go in the monkey's sock, with his horrible foot odor, creepy dexterity, and possible chance of being a smear on his sole? Or do you want to go into his underwear, his most private of places? I wonder if you'd want to get to know your best friend THAT well. Oh, and as long as you stay in his clothes, I don't care if you want to change back and forth. Feel free to explore all aspects of that monkeyboy that you want.\"<br>\r\n<br>\r\nWhat article of Monta's clothing will Sena start with?</span></div></div>",
            "created":1326171600,
            "id":1256327,
            "title":"Monta"
        },
        "1552111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Monta heads straight home.",
                "Monta takes a detour. "
            ],
            "content":"<div class=\"\"><div> <span>“His sock, eh?” Hiruma replied in an almost disappointed tone. “What’s the matter? Too afraid to get that close to your buddy?” Hiruma chuckled mockingly at Sena. “Oh well, not my problem. You have all summer to find yourself in there anyway! That is, assuming you don’t get crushed on the way home!” The demonic teen cackled evilly before tossing the underwear back into the locker. Before the tiny running back could even think about changing his answer, Hiruma held him above the sock’s opening with his slender fingers and dropped him inside. Sena itty-bitty Sena screamed as he fell into the white sock; barely hitting the bottom before he was also tossed into the pile of clothes within Monta’s locker. The spiky haired blond was about to shut the locker door when Sena shouted at him from within the sock. His voice was so soft and muffled at that size that no one would of usually heard him; but Hiruma had the advantage of knowing the tiny high schooler’s predicament. <br>\r\n<br>\r\n“Wait, Hiruma! Isn’t this…isn’t this really dangerous?!” Sena shouted as he pressed himself against the cotton wall that separated him and the one who had put him in this situation. “What if Monta really does crush me?!”<br>\r\n<br>\r\n“Huh? That’s a fucking stupid question.” Hiruma answered with a look as if Sena had just asked him what color the sky was. “If you get crushed then you get crushed; simple as that! No one will ever know a thing and I’ll just tell them you quit and moved to another country or something. Anyway, good luck Eyeshield, you’ll need it.” Hiruma chuckled one last time before slamming the locker shut; consuming Sena in darkness. The shrunken male sat there in the slightly musky sock and shook nervously. He wanted to believe the quarterback wouldn’t really put him in such a dangerous position, but he knew the opposite was totally fitting for his personality. Sena had no choice but to tackle this challenge head on and come out of it stronger than ever! The petit athlete nodded to himself and clenched his fists; preparing himself for what was about to happen. <br>\r\n<br>\r\nHe didn’t have to wait long at all. Mere minutes after Hiruma had left him the sound of a stampede started outside. From experience Sena knew it was the sound of his teammates stomping into the locker room. Sena could make out booming chatter far away, but was unable to tell which voices belonged to who. Soon the chatter was accompanied by the rummaging of clothes as the Deimon Devil Bats changed out of their sweaty, dirty uniforms. This reminded Sena that he was still in his football gear, minus the helmet. <br>\r\n<br>\r\n“Maybe it’ll give me a little more protection.” Sena said to himself as he tapped his hard shoulder pads. Still, he wasn’t very enthusiastic about spending the entire summer in them.<br>\r\n<br>\r\n“Hey, Hiruma, where’s Sena?” came a loud, clear voice that Sena quickly recognized as Monta’s. His theory was quickly confirmed as the locker opened and the inside was flooded with light. Sena couldn’t see his friend through the thick material of the sock, but he could make out a very monkey-like shadow. Monta’s gargantuan hands snatched up articles of clothing one by one as he put them on; seemingly saving his socks for last. <br>\r\n<br>\r\n“He’s probably on a jet to Italy by now! I set him up with a very special training program; don’t expect to see him at all this summer.” came Hiruma’s response, followed by a snicker. <br>\r\n<br>\r\n“What?! No way!” replied the skilled receiver as he grabbed his socks out of the locker. Sena yelped and grabbed handfuls of his white, dingy prison  to keep him from fumbling around inside. Raimon sat down on a bench and tugged his left sock on; followed by his right. The shrunken, spiky haired boy watched as Monta’s big, plump toes appeared at the top of the sock. They were quickly joined by the rest of his huge foot and Sena’s eyes widened at the sheer size of what was coming down toward him. He had time to wonder if perhaps he was biting off more than he could chew before the sweaty, tanned sole of his best friend slammed into him. The wind was knocked out of tiny Sena’s lungs as he was securely pinned between the sock and Monta’s steamy hot foot. In seconds the monkey boy slipped on his sneakers as well and stood up; turning Sena’s groans of discomfort into groans of agony as unbelievable weight was put on his miniature form. “I was really looking forward to hanging out with him! This sucks MAX!” Monta pouted before saying goodbye to Kurita and the others and heading out the door. Once Raimon was gone Hiruma couldn’t help but grin devilishly. Little did the energetic monkey know Sena would be hanging out with him all summer long. </span></div></div>",
            "created":1333342800,
            "id":1308373,
            "title":"The Beginning of a Long (or very Short) Summer"
        },
        "15521112":{
            "author_id":"goku1337",
            "author_name":"Jonouchi",
            "choices":[
                "Kengo Mizumachi, Lineman of the Kyoshin Poseidons!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Monta was on the road home, practically stomping his feet in disappointment, \"This really sucks! I wanted to hang out with Sena this summer! We we're gonna finally hit the beach!\" With each step, Monta's feet started to build up more and more oily, musky sweat only to be absorbed by his best friend and unaware insole, Sena. Sena was having a very hard time breathing. Even though Monta's sneaker was breathable, the foot odor blocked any chance of Sena getting any fresh air. Not to mention that his prison was moving up and down in a somewhat rapid motion, making him feel slightly ill. Sena wished he wasn't tricked by Hiruma into this situation, <i>I'm not sure I'm going to last the entire summer like this. But if I let Monta know I'm in here, Hiruma will keep me like this forever!</i><br>\r\n<br>\r\nSuddenly, a loud blaring noise comes from Monta's pocket, <b>*Kanjita you ni yattetai na, taishitamon ja nai ze right now! Kankiwamatte kazashita my hands, kanshou babe be survivor!*</b> Monta pulled out his cell phone and answered it glumly, \"Hello?\" The voice on the other line spoke, but it was hard to hear to everyone except Monta, \"Oh hey! I just found out Sena was going to be training overseas, so I won't be able to hang out with him. Really sucks!\" Then the voice spoke again and Monta's eyes lit up and he started to blush a little, \"H-hehehe, I guess we could do that instead, I didn't think about that! J-just remember. It's a secret! If anyone on the team found out, especially Hiruma, both of our lives would be over!\" The voice spoke once more, with Monta's grin widening and his face turning even redder, \"Then I'll see you then, babe!\"<br>\r\n<br>\r\nAs Monta hung up the phone, he squatted down and did a backflip in pure happiness, \"Turnabout MAX! This is gonna be so awesome! While Sena's off training, I get to go hang out with the person of my dreams!\" As Monta does this backflip, Sena slides across Monta's slippery sole and ends up between his best friend's toes upside-down, his face buried in the underside of Monta's toes. Monta then starts sprinting towards his destination, a nice, secluded spot that even Hiruma might not know about. After waiting for ten minutes, Monta hears footsteps from behind him and he turns around. Seeing the person coming towards him, he starts grinning widely, \"It's so awesome to see you again, babe! We hardly never get to see eachother anymore!\"<br>\r\n<br>\r\nWho is this person that has stolen the heart of Sena's best (and biggest) friend?</span></div></div>",
            "created":1357621200,
            "id":1504547,
            "title":"Monta takes a detour. "
        },
        "1553":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "Pokemon",
                "Digimon",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Any of these?</span></div></span></div>",
            "created":1326776400,
            "id":1260597,
            "title":"More"
        },
        "15531":{
            "author_id":"keyblade",
            "author_name":"Dr. Shrink",
            "choices":[
                "Ash",
                "Max",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's tiny?</span></div></span></div>",
            "created":1411102800,
            "id":1858730,
            "title":"Pokemon"
        },
        "155312":{
            "author_id":"keyblade",
            "author_name":"Dr. Shrink",
            "choices":[
                "Max found himself shrunk and stuck to Ash",
                "Max found himself shrunk and inside a dark place",
                "Max woke up before Ash but with Ash on top of Max"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure we can do this here Ash?\" Max asked as he got under the covers with with his best friend Ash.<br>\r\n<br>\r\n<br>\r\n\"Don't worry about it Max. My mom is fast asleep, and Pikachu is with her too. So we have the whole night to ourselves, alright?\" Ash said as he kissed Max's forehead and brought Max in close.<br>\r\n<br>\r\n<br>\r\n\"Alright. Then let's do this.\" Then Max rolled on top of Ash and started kissing him. Ash quickly returned the favor as he grabbed Max's ass and yanked him up and over Ash so he could lick Max's bare chest. Max moaned while this was going on and started stroking his dick up against Ash's chest. Then after a moment or two, Ash rotated Max so Max's dick was inside Ash's mouth and Ash's dick was in Max's mouth. Then they both proceeded to suck each other off while still moaning. This didn't last for very long when both of them at the same time came in each others mouths. The spray was so overwhelming that some of each others seed spilled out of their mouths. Then Max slowly rotated back above Ash's face and locked lips with him as they exchanged each others seed and saliva at the same time. Not long after that, they drank the mixture down in a single gulp and Max rested his head on Ash's chest as they both fell into a deep sleep.<br>\r\n<br>\r\n<br>\r\nThe next morning--</span></div></div>",
            "created":1411102800,
            "id":1858733,
            "title":"Max"
        },
        "1553121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "On Ash's butt",
                "On Ash's cock",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Max find himself shrunk?</span></div></span></div>",
            "created":1428382800,
            "id":1960504,
            "title":"Max found himself shrunk and stuck to Ash"
        },
        "15532":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "Yeah",
                "Another character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, how about Davis (from Season 2) to be shrunk?</span></div></span></div>",
            "created":1326776400,
            "id":1260601,
            "title":"Digimon"
        },
        "155321":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "Nothing; must of been his imagination. ",
                "A bug!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, quick, pass the ball over here!\" shouted Davis to his teammate as the opposition closed in on him. The guys were having another game that day, their team vs. TK's again, to whom Davis was ready to prove himself to the blonde (after having been defeated countless times by him before) once and for all. He wanted more than anything to win now. The boy quickly threw Davis the ball before the other team could steal it, and Davis caught it, dribbling it up toward the net, heart pounding. He was closing in on making the winning score, no one up front to stop him for once. He could imagine himself leaping into the air and straight down slam dunking the ball ever so gracefully into the net, impressing everyone in the stadium. At least, that's how he would've liked for it to have happened... had he not tripped on his suddenly undone shoelaces and fell face forward into the pole of the basketball net, knocking him clear unconscious, ball bouncing off in the opposite direction somewhere as everyone just stood there and stared in a confused daze. The last thing he remembered were people calling out his name, \"Davis!\" then everything going fuzzy and blank.<br>\r\n<br>\r\nNow he awoke groggily, a slight headache on him, sweat clinging in beads to his forehead. \"Wha...what happened?\" he asked to no one in particular, looking around to what appeared to be the familiar sight of the boy's locker room... only now 20 times bigger? \"Huh?\" he suddenly gawked aloud, looking around the now massive room and seemingly skyscraper tall lockers. \"Wha?? How-how did this happen?!\" he cried out, getting up from the floor and looking around frantically. He suddenly heard massive steps far off that were getting closer, nearing the corner where he was at. He eeped and quickly scurried beneath a bench like a little mouse, as he then watched two massive basketball shoe'd feet stomp past him, shaking the floor a bit beneath him like a mini earthquake. He couldn't believe this was happening. Everything was so large now... Could he be dreaming all of this? Anyway, his curiosity getting the better of him, he poked his little head out past the bench's leg and looked up to see that the giant shoes belonged to none other than TK himself. And it looked like the blonde-haired boy was talking on his cell phone. He listened... \"Yeah, I'm sure he'll be all right... It was just a minor concussion, they said... Yeah, I was shocked, honestly, though. It just happened all so quick...\" As he continued listening, he could obviously tell that the conversation was about him. He felt so embarrassed... tripping on his own shoelaces and knocking himself unconscious on the basketball net's pole. No one would ever let that down for him. And now to make matters even worse, he was only about 1 inch tall somehow. He cursed out loud to himself, as he continued to listen. TK was wrapping up the conversation with whoever he was talking to (probably Kari) and hung up. He then started to change back into his normal clothes that were in his locker there.<br>\r\n<br>\r\nDavis wanted to get his attention, but was slightly nervous at the same time... What would TK do when he found him? Possibly think he was a bug and squish him? He contemplated this as TK was taking off his shoes, then started reaching for his gym socks, just as Davis decided to move forward. As Davis crept up, an odd smell suddenly stung his nose like a wasp... He smelled the horrible stench of TK's sweaty barefeet slapping the ground, as the blonde-haired boy from above placed his shoes and socks into his gym bag. His feet on the ground, sweat visibly rolling down in streams off the pink, ripened skin from the hectic game. The Takaishi boy sighed, wiggling his lint-caked toes as he enjoyed the coolness of the floor on his hot soles. \"Aw man, TK, that's nasty!\" Davis shouted up to him. TK suddenly looked up, \"Huh?\" hearing the tiny voice as a little peep. \"I'm down here!\" Davis shouted again. TK just looked around cluelessly. Davis growled underneath his breath as he then began to approach the blonde's feet closer, much to his disgust, and got near enough to where he could actually touch the side of TK's foot. Reaching out, he did, as he began petting the steamy, sweaty flesh, which made him want to puke. Still, he hoped TK would feel it and notice him. TK, who had shrugged off the noises and was putting on his signature white \"Gilligan's\" hat, felt a tickling by his foot. He looked down and blinked, noticing that by his foot what looked like to be...</span></div></div>",
            "created":1326776400,
            "id":1260670,
            "title":"Davis' \"Small\" Incident"
        },
        "1553211":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "Put on the pair of socks",
                "Go bare in his shoes and just keep the socks stuffed in his bag"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh... must of been my imagination,\" uttered TK, as, while he was bent down peering, one of his fresh socks fell from the open gym bag hefted on his shoulders and landed on top of Davis like a thick blanket. Davis scrambled around in the sudden fabric, mouthing off nonsensically out of spite and frustration, just as TK reached down to pick it up. He then found himself entangled in the web-like cloth and was actually sent tumbling down to the very bottom of the sock, where the toes would go, as the whole thing was lifted up toward TK's face. Thank God it was fresh at least, thought Davis.. TK then looked down at his feet and decided to...</span></div></div>",
            "created":1326862800,
            "id":1261115,
            "title":"Seeing Things?"
        },
        "15532111":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "Home",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>...put on the pair of socks. Davis, who was fumbling around at the bottom of the footwear, suddenly noticed light was escaping from his fuzzy prison. He looked up to see five sweaty gargantuan toes wriggling their way in through the opening of the sock. In uttermost horror, he cried out, \"TK, I SWEAR, IF I EVER GET BACK TO NORMAL, I'M GONNA-MMMPH!\" He was cut off by having his entire body shoved in between the crevice between TK's big and second toe. Light was then completely shut off and TK wiggled his greasy toes that held Davis's frame between them like a plaything, sweat molding around his face and plastering his body that was held firmly to the skin, the massive digits perspiring within the stingy article of clothing. Microscopic droplets of sweat formed beads from the sweat glands that began to secrete them, due to the rising heat of the horrible environment. TK, from the outside, made sure his toes felt nice and comfy as he wiggled them and smiled, then placed his feet into his usual pair of shoes, giving them a nice kick to make sure they were nice and tight. Satisfied, he began walking. Now things were really getting hot and dark in the sock, as sweat was literally glazing over Davis's entire form and soaking into his clothes and bleaching his hair; Davis would gasp for breath, only to have his mouth filled with the salty fluid.<br>\r\n<br>\r\nHe felt sick to his stomach and was about to throw up all over TK's toes, as the motion of TK walking and stomping his feet was also helping with that, but then, due to all the slippery sweat that was buttering up his inch-tall frame, he slid downward even moreso until his whole body was completely buried and actually hugging the flesh in between TK's big and second toe, where a large pocket of toe jam coated along the sides and center of it, consisting of sweat, lint, dead skin cells, and just plain caught up gunk made up of who knows what.. Davis was really freaking out now, as he was literally becoming concealed in this nasty grime of junk and filth, the cheesy-like substance pasting up his sweat-soaked clothes nicely and entrenching his arms within as he would try and pull away. He reached out to the sides of him in a vain attempt to reel himself out by using the sides of TK's toes for support, but the glossy sweat that had built up and run along the skin made it slick and his hands slid off of them. The whool inside and around the foot was becoming heavier and thicker with perspiration, as it had been soaking it up, and the heat was only continually rising within. Davis was getting so hot now, he had started to take off his shirt, just to relieve himself if only even a little bit of the terrible heat. His body was shining in the darkness from both TK's sweat and his own, with the creamy-like toe filling encasing the lower-half of his body and abdomen densely. He was panting hard, his nauseousness beginning to fade, oddly, even after having just ingested entire globs of sweat and crud. He just coughed and hacked a bit, though, feeling his chest heave in and out, as he had stopped fighting and just lay motionless in the dark now, completely tired out. The room itself had stopped moving, 'cept for the occasional toe wiggle and flex here and there, as Davis had now guessed that TK was in a classroom, sitting down at a desk. After that, though, he would be heading home, which would mean he would be walking it, as TK never took the bus... Davis groaned just thinking about it. He held out his shirt in front of him and wrung it out of the salty sweat, watching it poor down from the fabric like a faucet. He couldn't believe a boy like TK, whom he had always thought to be of uttermost hygiene when compared to everyone else in the school, would ever be capable of all of \"this\" that he just gone through. He didn't think TK would care enough to pamper his feet or anything, but even so, this was just ridiculous... And after waiting a little while longer in the same position he was in, he then felt his whole beginning to shift once again as the faint sound of the school bell going off could be heard. \"Great... Just great,\" Davis thought. So here was TK heading now?</span></div></div>",
            "created":1327208400,
            "id":1263404,
            "title":"\"Socks\" to Be Davis"
        },
        "155321111":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "...was crawling out of the discarded sock to freedom.",
                "...was still trapped between T.K.'s toes!"
            ],
            "content":"<div class=\"\"><div> <span>After say goodbye to his friends T.K. gathered up his things and made his way out of the school building. As he left the school gates he passed several kids boarding the busses. Just as Davis feared, the hat-wearing boy ignored them and continued on foot. In his right hand was his gym bag; filled with dirty and sweaty clothes that would need washing. Strapped to his shoulders was his backpack; filled with books and other accessories. With all the extra weight most people would jump for the bus; but not Takeru. T.K. enjoyed the exercise, plus there would be plenty of time for rest in his own home. As the blond opened up his cell phone and scrolled through his new emails and texts concerning Davis he was completely unaware that the very boy everyone was worried about was currently suffering inside his sock. <br>\r\n<br>\r\n“Ughh…damn you, T.K.” Davis mumbled to the towering giant above him as he felt the nauseousness return as soon as the giant DigiDestined made it to the sidewalk. Each step Takeru took made Davis’s entire world lift up and down…up and down…up and down. As the tiny, shrunken kid pressed himself against the filthy flesh he squeezed his eyes shut and used all his mental control to prevent him from getting sick. Sure, perhaps vomiting over the giant’s toes would get him to notice him, but it was more likely he would just cover himself in more filth than what already drenched his body! This situation was hellish already; no need to make it worse. <br>\r\n<br>\r\nFifteen minutes of walking later, Davis had pretty much gotten used to the stomach tossing motion of T.K.’s footfalls. He hadn’t, however, gotten used to the foul odor that surrounded him. Nor had he gotten used to the sweat and toe gunk that covered his body; several times he had almost gotten sick again because that disgusting stuff had made it into his mouth. Worse of all, however, was the heat. It was so ungodly hot inside his sock prison that his body shined with almost as much of his own sweat as Takeru’s. Davis’s bare, smooth chest rose up and down as he gasped for air. His vision was getting blurry (not that he could see much anyway) and his body was so tired. <br>\r\n<br>\r\n“Damn…I can’t keep my eyes open.” Davis said to himself; barely able to hear his own voice over the THOOMing being caused outside each time T.K. stomped down. His eyelids felt heavy and they slowly slid over his foggy eyes. Before losing consciousness Davis imagined himself dying in here…dying under the foot of his rival who would never know.  <br>\r\n<br>\r\n~~~<br>\r\n<br>\r\nA little while later Davis was awoken by the sound of a door being shut down where in the distance. For the first second upon opening his eyes Davis thought he had dreamed the whole thing; a weird nightmare brought on by a concussion. Then he looked at his sweat drenched chest and the peach colored toes that belonged to his unknowing captor and he snapped back to reality. He sighed, wishing he had stayed asleep, but then noticed something different. While it was still dark as night inside the sock; Davis could make out a little more of his surroundings. The increase in light could only mean that T.K. was taking his shoes off, which means he was finally home. If some god out there loved him at all he would soon take off his socks as well. While waiting for that moment Davis noticed his hands were empty; his shirt was missing. It must of slipped out of his hand while he slept and was now somewhere underneath T.K.’s huge foot. <br>\r\n<br>\r\n“I liked that shirt…” Davis complained to himself as T.K. left his shoes at the front door and made his way into his house. <br>\r\n<br>\r\n“Mom, I’m home!” T.K. called, but got no reply. It dawned on him that his mother sent him an email during lunch explaining how she wouldn’t be home when he got back. T.K. had only skimmed through the email and couldn’t remember where she had gone and for how long. No matter; it meant he had the entire place to himself! The first thing the blond did was head to his room and drop his gym bag and backpack. With those burdens gone T.K. sat on his bed and proceeded to strip his feet of their socks. Once both of his baked feet were free the young man leaned back and wiggled and flexed his toes. A sigh of comfort escaped his lips as he felt the cool air brush against his bare feet and between his toes. As he spread and clenched those sore toes he said to himself, “Maybe I should think about taking the bus every now and then. My feet would probably thank me, haha.” <br>\r\n<br>\r\nAs T.K. relaxed, Davis…</span></div></div>",
            "created":1328504400,
            "id":1272065,
            "title":"The Trek Home"
        },
        "1553211112":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "The two continue their little game for a while longer.",
                "T.K. decides to go get a drink/snack."
            ],
            "content":"<div class=\"\"><div> <span>Davis gasped loudly, finally being able to breathe in some fresh air after having been trapped within his blonde rival's steamy, rotten socks for whoever knows how long, though yet, much to his discontent and horror, he was still glued in between the youngest Takaishi boy's toes from all the sticky, slowly drying sweat built up in there! He was really starting to get frustrated, as he then began batting the sides of T.K.'s two biggest toes (the ones he was trapped within) with his arms, but in a once again vain attempt to get noticed, as T.K., just like before, did not feel anything the inch-tall boy did, much thanks to his very now diminished stature and thanks to all the sweat and gunk that had accumulated deep within those toes, acting almost as a barrier, which protected the skin from such tiny feels as the ones Davis had made. Takeru sighed, still wiggling his toes and feeling the cool air run in between them. He could see how shiny his feet were with sweat and little flecks of graying lint decorating the tops and bottoms of his soles, with huge mounds of them wedged up between his thin toes. Just how they looked every time he had gotten home after Basketball days, he thought. As he wiggled and flexed his toes there, Davis was getting the whole show of it, up close and personal. He felt as if he was in a washing machine, with the gargantuan mammoth toes ramming into his sides and rubbing all over and along his body, coating him in more perspiration and dead skin cells. Heaps of toe jam and sock fuzz stuffing into his face and sliding all around his naked chest, greasing the small boy up from head to toe, as he looked up in anger (and a curious bit of envy) and cursed once more at the the giant blonde-haired, blue-eyed teen from above. <br>\r\n<br>\r\nAfter about another minuet of this treatment, T.K. finally swung over his legs up on the bed and layed his head back on the pillow, taking off his white hat and lazily tossing it over the side of his bed. With his whole body laying flat now, his feet were sat propped up on their bare heels, and Davis, who had been coughing up slimy crud and wiping off more of T.K.'s perspiration and his own off of his face, looked up and signed a bit to himself in relief. Takeru had finally settled down now and was just laying there in bed, his eyes closed as he breathed softly in and out. Davis, all sweaty and trembling, looked down from his perch from between the Takaishi boy's toes, ironically hugging on to the second toe for dear life. It looked like a long way down to him, but if he could slide himself down the slightly slanted top of the foot easily, he should be okay, he thought to himself. As he was about to place one reluctant foot on some flesh below, he suddenly heard an obnoxiously high-pitched voice calling out. \"T.K.!! T.K.!!!\" Oh no, Davis realized... It was Patamon, the blonde-haired boy's digimon partner. Patamon came flying into the room and landed on T.K.'s chest. \"Hi, T.K.!\" Patamon chirped happily. Takeru opened his eyes and smiled softly at his little friend, \"Hey, Patamon...\" \"So, how was your day at school?\" the orange creature asked, his big blue eyes shining into his partner's with enthusiasm. \"Well, Davis got hurt pretty badly today in our basketball match, actually... He got a minor concussion after running into the basketball pole on accident.\" \"Wow, really? How'd he manage that?\" \"Well, he actually tripped over his own shoelaces and did it,\" T.K. said, chuckling a bit at the thought. \"Well, I hope Veemon isn't too worried about him, then...\" \"He'll be just fine. He should be back within one day tops, maybe. It was just minor, really.\" T.K. said, stroking the soft fur on his digimon's back. Davis, listening to the whole conversation, only wished it could've been true... Little did Takeru and everyone else know, including his own family, that he was only one inch tall now and captive to this blonde-haired teen's toes, and probably never to return to normal size again! He just wanted to cry thinking about it, but in his mind, even at this point, he still had trouble even registering all of this to be real/reality...<br>\r\n<br>\r\n\"So other than what happened to Davis, did you have a nice day?\" Patamon asked, enjoying the warm strokes on his back that his partner was giving to him. \"Yeah, I'm just really tired out right now and my feet are killing me...\" T.K. said, sighing. \"Hmm...\" Patamon looked over at the Takaishi boy's feet at the foot of the bed and waddled up to them. He then smelt the foul air around them and his little face grimaced. \"Pee yew, T.K., you should really wash your stinky feetsies now!\" the orange-furred creature giggled. T.K. grinned mischievously at this, \"Hey, how about instead of you acting like my mother and telling me what to do, you massage them for me?\" the boy chuckled, lifting his foot up a bit (the one with Davis still in between the toes) and bringing it over to the bat-winged animal. \"Hey, get your smelly piggies away from me!\" the digimon laughed jokingly, plowing his little hands into T.K.'s sweaty sole, trying to push it away. \"Ah, that feels good, keep doing that,\" the blonde remarked playfully, laughing to himself as well and trying to push his bare foot even closer to the little digimon's face, in a fun manner. Patamon laughed, falling down flat against the bed as the sole had pushed him off his feet; he then used his little legs to try and kick it away. \"You can't make me!\" he squealed delightfully, giggling like a little kid. As the two played this little game innocently with each other, Davis, who had now once again felt like he was being thrown back and forth and all about, felt sick and nauseated. \"Ugh... What did I do to deserve this?\" he groaned, stifling himself from throwing up. What happens next?</span></div></div>",
            "created":1328590800,
            "id":1272401,
            "title":"Still Trapped"
        },
        "15532111122":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Davis notices the softened toe jam and attempts an escape.",
                "T.K.'s foot jolts up and sends Davis flying into the air!"
            ],
            "content":"<div class=\"\"><div> <span> Davis groaned in sheer disgust as T.K.’s foot moved around atop Patamon. His face started to take on a green hue as he did his best to hold back getting sick. Just when he thought he couldn’t take anymore the movements finally stopped. The shrunken Japanese teen panted between his rival’s toes as the giant feet came to a rest on the bedroom floor. Through blurry vision he could make out T.K. touching his stomach high above him. <br>\r\n<br>\r\n“I could go for a snack,” T.K. said to Patamon. “I didn’t have a lot of lunch, after all.”<br>\r\n<br>\r\n“What?” Patamon flipped himself off his back and looked at the larger human. “But, T.K., it’s not snack time yet! You know your mom doesn’t like it when you sneak snacks; you’ll get fat!” The small, winged Digimon puffed up his cheeks in an angry way.<br>\r\n<br>\r\n“Aww, come on, Patamon.” T.K. replied with a chuckle as he stood up and looked down at his partner with his hands on his hips. “Mom isn’t here right now, and if you don’t tell her I’ll give you some~!”<br>\r\n<br>\r\n“…really?” Patamon’s eyes lit up with joy. “Alright, fine! Just this once!”<br>\r\n<br>\r\n“Atta boy.” Takeru smiled and walked out of his room. Down below, Davis grimaced that his rest was over and once again endured the constant up and down movements as the giant blond walked through his home. With nothing else to do the grimy, sweaty teen just stared up at the titan that loomed above him. His eyes were filled with anger and envy as he glared upon the titanic blond. Why did this have to happen to him? Not once did he ever feel inferior to T.K., but now he could hardly call himself an equal. HE should be the one walking around his house while a small and helpless T.K. suffered between his toes. HE deserved to be the bigger one; this was just too unfair. <br>\r\n<br>\r\n“Ah man…this is just too much.” Davis complained as he closed his eyes so he didn’t have to look at his huge captor. “I could really go for a snack myself right about now…and maybe a cool drink.” The red head wiped some sweat from his forehead; unsure if it belonged to him or T.K. anymore. <br>\r\n<br>\r\nOnce in the kitchen T.K. grabbed himself a bag of popcorn and tossed it into the microwave. While the bag was popping the DigiDestined grabbed a bottle of water from the refrigerator. He took a few gulps from it before sighing contently and placing the bottle on the kitchen counter. The young boy then stood in front of the microwave and watched the popcorn bag inflate. <br>\r\n<br>\r\n“I hear popcorn!” came Patamon’s voice before he leaped onto the counter.<br>\r\n<br>\r\n“Hey, be careful!” T.K. exclaimed, but it was too late. The Digimon’s chubby body bumped into the water bottle and tipped it. T.K. managed to stop it from completely spilling over, but a small amount splashed onto his bare foot. <br>\r\n<br>\r\n“Oops, sorry.” Patamon apologized with a frown.<br>\r\n<br>\r\n“It’s okay, I don’t think any got on the floor.” the Digimon’s partner replied as he gave Patamon a pat. Unknown to either of them, that small bit of water had fallen right onto Davis and utterly soaked his half naked body. At first the shrunken teenager shuddered at the chilly liquid, but quickly became relaxed as it cooled his baked form. <br>\r\n<br>\r\n“Well, I suppose that’s one wish granted.” Davis said to himself as he licked some water off his lips. What the little, wet teen didn’t know was now only did the spilt water soak his body, but it also wet the area between T.K.’s toes. The crusty toe gunk that held him firmly in place begun to soften. Before he could realize this, however, the microwave buzzer went off above him and T.K. was once again on the move with a bag of fresh popcorn in one hand and a bottle of water in the other. <br>\r\n<br>\r\n“Hey, T.K., if we have popcorn does that mean…?” Patamon started to ask as he flew next to his slim partner.<br>\r\n<br>\r\n“Yup! What do you say about watching a movie?” Takeru asked as he watched Patamon smile gleefully and land on his head of blond hair. <br>\r\n<br>\r\n“That sounds fun! What are we gonna watch? A funny movie?” Patamon looked down at his partner’s youthful face with his big blue eyes. T.K. smirked and returned the gaze.<br>\r\n<br>\r\n“Actually, I borrowed a horror film from Matt a few days ago. How about we watch that?”<br>\r\n<br>\r\n“A-A what?” Patamon covered his eyes with his bat-like wings. “T.K., you know I don’t like scary movies…”<br>\r\n<br>\r\n“Don’t be such a baby, Patamon. I heard Gabumon couldn’t make it through the entire film. Don’t you want to prove you’re braver than him?”<br>\r\n<br>\r\n“He couldn’t? Hmmm…” The little Digimon’s wings returned to their normal positions and a smirk appeared on his cute face. “Alright, I’ll do it! I can’t wait to see the look on Gabumon’s face, hehe.” <br>\r\n<br>\r\nWith that settled the duo got set up in the living room. Both seated themselves on the couch in front of the television. Takeru clicked on the TV and DVD player before opening up the popcorn and relaxing back with his Digimon friend. Meanwhile, Davis also relaxed in a less comfortable position, thankful that T.K. had stopped moving. Since he was watching a movie he would hopefully sit still for the next hour or two and give Davis some time to think up an escape plan. The giant occasionally rubbing his toes together and squeezing his little form between those musky toes wasn’t helping, however…</span></div></div>",
            "created":1330837200,
            "id":1288983,
            "title":"Snack and Movie Time"
        },
        "155321111222":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "choices":[
                "\"Ah, what's the worst that could happen?\"",
                "\"I should just try and climb down from the couch and make my escape now...\""
            ],
            "content":"<div class=\"\"><div> <span>T.K.'s foot suddenly jolted up and sent Davis free-flying through the air... Davis was still shocked from the unexpected throw like that when he had landed deep into a sea of green (and what appeared to be made of a cotton or fabric of some sort) softness. As Davis then lay there motionlessly on his back and staring up at the ceiling, wide-eyed with horror and his heart audibly thumping loudly through his chest, he finally got up (albeit shakily) and saw that Takeru had just lifted up his feet to put them on a pillow. Just that single act alone had launched him up in the air like that, he thought... That really diminished what little was left of his ego there. Luckily, though, he had landed on something soft, so he just sighed to himself in relief of that and then began scanning the area around him... He had obviously landed on T.K.'s belly, he realized, what with the greenness of the usual shirt the boy would wear all the time, and with the odd \"organic\" noises he could make out with his keen little ears coming from deep below the material he was perched upon there. He heard T.K.'s body gurgling and growling, as if almost letting the tiny human know that the giant boy he was on top of was indeed alive, perhaps.<br>\r\n<br>\r\nAs Takeru from far back was chewing and swallowing his popcorn by the handful, wet and strenuous gulps could also be made out from afar by Davis, listening and then turning to watch the food pass down the blond boy's throat in a probably large, mashed up quantity, given by the size of the descending lump that was traveling downward through the boy's chest, making its way right to where inch-tall form was sitting over. Davis could feel the ground below him rising higher and higher with the more the teen he was on top of consumed and could even feel the muscles below him work to contract over and help process the meal being digested and made into nutrients underneath the fleshy outward exterior. He almost shuddered a bit at the thought, realizing just how easily he could now fit inside his rival's gut at the size he was and help to become part of his body as well, but shook it off to remember that he, too, was hungry, just as his own stomach so noisily let him know. He was glad to have gotten a nice sip of that water from before (thanks to Patamon's shenanigans), but now after that, he wanted something to eat a little of at least to go along with it. He looked on past T.K.'s chest, watching the mammoth hand of the massive digidestined raise what would be a ton of popcorn to him above his mouth and dumping it in carelessly and slobbily, just as any teenage boy who wouldn't have particularly cared about his neatness there would. And thanks to that bit of recklessness, Davis felt his heart drop when a kernel unnoticeably dropped from between the blond's fingers and tumbled on downward to his chest. Davis gulped, feeling himself beginning to salivate as he looked onward, realizing that this was his perfect chance. Even at this size, he knew he had to get something eventually to eat to sustain himself... So as he thought it out there a bit for a minuet or so, he finally decided and said aloud to himself...</span></div></div>",
            "created":1330923600,
            "id":1289760,
            "title":"\"Pop\" Goes the Davis"
        },
        "1553211112221":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Davis is swallowed down to T.K.'s stomach.",
                "Davis is somehow saved."
            ],
            "content":"<div class=\"\"><div> <span>“Ah, what’s the worst that could happen?” Davis said out loud while smiling to himself. He hoped, in the back of his mind, that those weren’t his famous last words. The growling sounds coming from his bare stomach told him he wouldn’t last much longer without some kind of food. So what if he managed to climb down to the floor? He would probably collapse from hunger before ending up underneath T.K.’s foot the next time he got up! “Don’t worry, stomach, you’ll have your food soon!” Davis told his belly as he placed a hand against it. He focused his eyes on that single, delicious looking popcorn kernel before beginning his dash toward it. Meanwhile, the giant blond would continue his movie watching, unaware of the tiny trekking across his body.  <br>\r\n<br>\r\nAs Davis ran full speed toward his food, he occasionally looked up at the young DigiDestined’s face to see what he was doing. His eyes were always locked onto the television; a handful of popcorn occasionally being shoved into his mouth where it was chewed up loudly. Sometimes the handful would go to Patamon instead; who would happily munch on the snack food. Sadly, no more loose kernels fell from the teen’s hand. <br>\r\n<br>\r\nIt took longer for the inch sized DigiDestined to get to the kernel than he would of liked. As the young teen stood on his rival’s chest, he could feel it raise and lower with each breath. It was like standing on a living hill. Since he was so close to T.K.’s face now, the sounds of the giant chewing, slurping, and swallowing were almost deafening to him. If Davis didn’t know he was atop his friend, he would of thought these sounds came from some sort of devouring Digimon. Davis was entranced by it all before his hungry eyes fell upon the popcorn kernel a few feet away. Davis licked his lips and drool dripped down his chin as he approached the steamy, warm piece of food.<br>\r\n<br>\r\n“Oooh yeah. Come to Davis~” the shrunken teen mumbled as he picked up the crunchy snack of buttery goodness. At a size bigger than his head, this single kernel of popcorn was like an entire meal to him! “This is gonna be so good!” Davis licked his lips one last time before plunging his face into the white kernel. The tiny boy nibbled on it a bit before swallowing and making a loud sound of content. His face was covered in melted butter and white dust, but he barely stopped to breath before going back for another bite.<br>\r\n<br>\r\nUnbeknownst to him, T.K. had happened to glance at his chest and spot the fallen popcorn kernel. The glance only lasted a millisecond before his eyes returned to the TV screen. Then, without bothering to look down, T.K. pinched the popcorn kernel between his fingers. By the time Davis noticed him and the kernel get pinched between those two finger pads it was too late. His first thought was that T.K. had finally noticed him; that this nightmare would soon be over. Those hopes came crashing down when T.K. brought Davis to his mouth and parted his lips. The red haired boy’s face was struck with absolute horror as he gazed into the dark cavern of his friend’s mouth; strings of saliva connecting his teeth together. Davis had just enough time to begin a shriek before T.K. thoughtlessly tossed him inside. <br>\r\n<br>\r\n“No, no, no, no, NO!” Davis chanted as he landed on T.K.’s huge, wet tongue. He still clung to the popcorn kernel as it was flicked to the right side of T.K.’s mouth; right under a white molar. Davis’s body seemed to move itself as he instantly let go of the kernel and rolled off the teeth just as T.K. clamped down and decimated the popcorn kernel. If Davis had been a moment slower it would have been him being ground up into paste by those pearly whites.<br>\r\n<br>\r\n“Gotta get out gotta get out!” Davis repeated in a panic as he landed back on the slick tongue and looked around. “There’s gotta be a way out of here!” The athletic teen got to his feet (which sank into the soft tongue of his rival) and tried his best to wobble toward where he was tossed in. The lips were already closed, but Davis wasn’t known for giving up.<br>\r\n<br>\r\nAlas, even if T.K.’s mouth had been wide open, Davis had no chance of escape. It barely took any effort at all on T.K.’s part to chew up that single kernel of popcorn, so once it was reduced to a fine paste it was tossed back onto the tongue and then flicked to the back of the throat; Davis included. <br>\r\n<br>\r\n“Damn it, NO! Stop, T.K.! Don’t swallow me!!” Davis screamed as loud as he could, but his screams were utterly drowned out by a single, powerful sound. <br>\r\n<br>\r\n*GULP*</span></div></div>",
            "created":1333429200,
            "id":1308469,
            "title":"\"Ah, what's the worst that could happen...\""
        },
        "15532111122211":{
            "author_id":"kingboo10",
            "author_name":"KingBoo10",
            "content":"<div class=\"\"><div> <span>The little red-haired boy was readily tossed back by the motioning of the tongue, along with mashed up popcorn bits, back toward the very end of the cavernous room he was in. Davis' vision was blurred in pink, as he was sent in headfirst into the opening of the pharynx, which greedily opened up to allow his inch-tall body, along with the popcorn, in. The uvula, dangling above almost tauntingly, rose and let the back of the throat expand to slimily swallow him and the grounded yellow mush up. The last bit of light Davis saw before being swallowed was it coming out slightly from between TK's lips and teeth, which were just beginning to part again to accept another handful of popcorn in, having just about swallowed the batch (and him) in. Davis being saliva-ridden and all made him slick and was easily thrusted and slid downward, with the popcorn paste keeping him company by surrounding him on the start of this journey, and he could feel the pharynx closing behind his feet; hundreds of fleshy, wet muscles then grasping at him rigorously and shoving him down forth, to where it was almost painful for him getting swallowed.<br>\r\n<br>\r\nAnyway, it all happened so fast that Davis' mind actually went blank. In one moment he was in the jaws of his friend and fellow digidestined, standing on top of the tongue and trying to run up along it, looking to escape. Then within a matter of milliseconds later, he had been pushed back instantaneously and gulped down like that. He didn't even have time to register it or think at all. He just sort of understood it all from a physical viewpoint, being tossed around and about and back and forth all so suddenly, and now spiraling downward to the belly of the beast below. He felt his body, arms, legs, and everything being constricted downward in a snake-like motion. His body passing down through TK's throat, with it visibly from the outside creating a larger-than-before lump that was going down slightly slower than normal, due to him still being decently-sized for an actual single swallow. TK even felt it a bit after having just swallowed the petty digidestined, unbeknownst to him, and placed his fingers up to his throat, drumming it along to feel the large bulge being effortlessly, yet slightly painfully, dragged down. He swallowed again, so as to help to push down the uncomfortable mass quicker and gasped for air after, relieved to feel his throat empty out. He then looked down and patted the walls of his chest with the back of his fist, so as to make sure there wouldn't any further obstructions. \"Must've swallowed a seed or something...\" the blond-haired boy thought to himself, then continued his focus on the movie, not giving it another thought.<br>\r\n<br>\r\nPoor Davis was struggling and trying to grasp at the sides of the esophagus with his arms, so as to maybe slow the process down some, but the rhythmic flow was just to strong, and the sliminess of the constricting tube also hindered him from doing so. Saliva-drenched popcorn muck was being forced into his face on the way down, rubbing up along his sides and mixing beside his bare body and clothes, staining it with buttery, saliva-y tang. He tried to even open his eyes, but the popcorn around him would prevent him from doing so, being shuffled along with him. Even with his eyes closed, though, he could tell that it was getting darker and darker as he passed on downward, as well as the climate itself changing, getting hotter and hotter as he went in. He passed by the larynx, which closed so as not to allow him or the popcorn make its way into the lungs, and then passed by the heart, which he could hear the beating of through the alive walls. Though after having passed the heart and hearing its beats fade away into the outside world, the sound of gurgles, gargles, and growling was erupting closer and closer from the depths below.<br>\r\n<br>\r\nAs his head reached the very end of the esophagus in his short-lived journey, he felt a ring of harder flesh, which was the cardiac orifice, open up to accept and squeeze his body through, again in a snake-like motion, along with the popcorn bits, with the muscles in the back pushing his legs and feet in after him and shoving him down forth. He was just lazily and greedily dumped onto the flabby, fleshy stomach floor, being treated as no more than another piece of meat for Takeru's body to process. He instantly got up from the slimy, shallow-with-bile and popcorn mush-covered ground, disgusted and absolutely horrified. He wiped the popcorn stuff off his eyes and opened them up... completely pitch black, though he could vaguely make out the shining of slimy mucus on some of the walls around him, in which he could also make out tiny ridges along the stomach lining, which were to help to break down food particles mechanically, once the digestion process got going. Luckily for the tiny boy inside this belly, though, the stomach had just now been receiving content and being filled with food (which Davis was just so rudely reminded of, as the cardiac orifice above his head opened up again to empty out more popcorn grime on top of him), so it wasn't in the process just yet. Though Davis knew he had to react fast and quick.<br>\r\n<br>\r\nFeeling himself start to tear up, as the full realization of having just been entirely swallowed alive, by his own dear friend (and yet, rival) for that matter, was further sinking in. He could feel the vicinity around him, smell the decaying scent of popcorn and faded aromas of past foods ingested at earlier times, and hear the horrible, wet, slushy, organic noises echoing around him, within the room and outside of the room, even hearing blood flow around the stomach. It all really sent him into an instinctive, primal-driven madness to escape, just as any animal would have in that given situation. With all his instincts telling him to survive, he ran up to the stomach walls, shoes splashing in the bile and unidentified mixture of juices below, and began banging on them with all his might, crying out, \"TAKERU, NO! You gotta let me out! Please!!\" he screamed at the top of his voice, even using TK's full name, \"Let me out!!!\" Takeru from the outside, however, simply felt almost a \"bubbling\" coming from within his belly, in which he just merely shrugged it off with much thought. He even placed his hand on his stomach afterward, feeling it and rubbing it, in unison of all the delicious popcorn he had just consumed. Davis felt TK's hand place against the wall from the outside and was even pushed back a bit from the knock-back. He was beginning to sweat profusely from the humidity within the youngest Takaishi boy's tummy and even began panting from it, too, but also from having used up a lot of what little energy he had left in his small, now unstable body (also from not having eaten much of anything to eat at all as well).<br>\r\n<br>\r\nAs he stood there, shivering in complete exasperation and eyes widened with grief in finding it hard to fully comprehend the current role he served, which was to end his life as Takeru's snack, inescapable memories suddenly starting flooding to him. He remembered the first time he had ever even met Takeru, in which the blond's first words to him were: \"You look familiar\" (having thought of him as a Tai look-a-like back then), and he remembered how the rivalry between them even all started. It was mainly because of Kari, the girl he liked. He then starting feeling small waves of the fluid sunk below his feet start to splash up against the sides of his legs and him. He looked around the room, noticing a subtle change within the darkness of the mucus-coated organ. Piles of grinded popcorn were being motioned back and forth, and Davis could feel himself being brought into the movement as well. Digestive peristaltic contractions were beginning, which were essentially to help break down the food that was about. Davis tried to maintain his stance, but was then thrown into the waters with a splash. He tried to get up, gasping and pleaing for help, but all to no avail.<br>\r\n<br>\r\nGastric glands lining the walls began secreting the hydrochloric acid and enzymes, along with mucus to lubricate and protect the stomach walls themselves, that would help to break down the food in the room into the liquid below, in which Davis began feeling a slight tingling on his body, especially along his chest and back (as he was not wearing a shirt anymore). He couldn't even find himself being able to get up anymore, due to lack of energy and the actual toxic atmosphere around him, physically weakening him more and more by the moment. Piles of popcorn being flown around in the cramped room like a washing machine, along with the flow of stomach juices, mixing it all together in a big, soup-like mixture. Davis' eyes were beginning to slowly close in on him, as the tossing and turning of the digestive process within the belly itself was alone lethal to his frail, delicate frame. Realizing there was no escape, he lost all will to continue and only sighed softly now. If only Takeru had known, he thought. Still, at least he was giving up his life for a friend, even if it wasn't much he was giving... Perhaps a tiny bit of energy more than what Takeru would've gained without him in the popcorn, but he still accepted it as it was. Finally letting nature take its course and closing his eyes, he feel into a deep, deep sleep, as he and the food would be soon mixed into the bath of acid, bile, etc., and, over time, developed into chyme, which would later pass through TK's small intestine.<br>\r\n<br>\r\nTakeru, from the outside, continued to watch his movie, a hand etched over his flat belly, which gurgled noisily to the food it was processing. TK felt a bubble rise up to his throat and he burped loudly. Patamon looked up and threw a kernel at him. \"Hey, that's gross!\" Patamon snickered. TK laughed, \"Sorry, must've been something I ate...\"</span></div></div>",
            "created":1333602000,
            "id":1309569,
            "title":"The End of Goggle Boy"
        },
        "15533":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Lots of guys in Reborn!",
                "Another anime."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How the hell could I have forgotten about Reborn?!</span></div></span></div>",
            "created":1327813200,
            "id":1267968,
            "title":"Katekyō Hitman Reborn! "
        },
        "155331":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "No-Good-Tsuna gets even smaller!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We start off with the main character and 10th boss of the Vongola Family. </span></div></span></div>",
            "created":1345438800,
            "id":1409208,
            "title":" Tsunayoshi Sawada"
        },
        "1553312":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Now he's 100% micro!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He's 3/4 Italian, 1/4 Japanese, and 100% the Tenth's Right-Hand Man!</span></div></span></div>",
            "created":1345438800,
            "id":1409209,
            "title":"Hayato Gokudera "
        },
        "15533122":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Let's find out!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A fan of baseball and a skilled swordsman. Can this so called natural born hitman and #1 athlete survive being shrunken?</span></div></span></div>",
            "created":1345438800,
            "id":1409212,
            "title":"Takeshi Yamamoto"
        },
        "155331221":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Gokudera",
                "Ryohei"
            ],
            "content":"<div class=\"\"><div> <span>It was a bright and sunny day in the town of Namimori. The sky was clear, the birds were chirping, and the humidity was just right. All in all it was an overall excellent day to be alive. On this perfect day, Takeshi Yamamoto walked down the sidewalk with a big smile on his face. The black haired teen was dressed in a white buttoned-up shirt over a plain red t-shirt, a pair of blue jeans held up by a black belt, and a pair of black sandals. Slung over his left shoulder was his backpack; a wooden baseball bat poking out of it. The middle schooler was having a pretty decent day; he had aced two tests at school and his baseball team had won a game by an impressive margin. As he headed for Tsuna’s house to hang out with his friends, he wondered how this day could get any better. <br>\r\n<br>\r\nLittle did he know, his great day was about to do a one eighty and go right down the gutter. <br>\r\n<br>\r\n“Hmm? What’s that?” Yamamoto suddenly mumbled after taking a sip of milk from a plastic bottle in his right hand. To his left, across the street, was a group of three high school students talking in an alleyway. Two of them seemed to be grouped around the third, but Yamamoto didn’t have a good line of sight to see why.<br>\r\n<br>\r\n“Dude, careful where you point that! It’s a gun, you know!” one of them “whispered”, though Yamamoto could hear him perfectly. <br>\r\n<br>\r\n“Is it even loaded? Why was it just lying on the ground here?” another one asked.<br>\r\n<br>\r\n“How should I know? I doubt it’s even real…I mean look it at!” responded the third person. Upon overhearing their conversation, Yamamoto considered facing the trio of older boys. Judging by their rambling, one of them was holding a gun and that’s NOT something one should be carrying on the streets. However, when two of the young men stepped away from the gun holder, the Rain Ring Guardian’s expression quickly changed into a goofy smile. The “gun” the three were looking at was a shiny red and decorated with yellow bulbs and wires. It didn’t take perfect vision to realize it was just a toy.<br>\r\n<br>\r\n“Heh, a little old to be playing with toy guns…” Yamamoto said under his breath before chuckling and continuing his walk to Tsuna’s residence. After taking just two steps, however, the trigger on the gun was pushed and it fired. A glowing red bullet, but still a very real bullet, was shot out of the gun’s barrel and hit the fourteen year-old right in the side of the head. His bottle of milk fell to the ground and spilt just as Yamamoto smacked into the fence he was walking by and slumped to the ground; apparently dead.<br>\r\n<br>\r\n“Oh shit! I think you just killed that guy, dude!” one of the older teens cried before he broke out into a run. His two friends followed in a similar panic; leaving both the red gun and Yamamoto behind. No one else was around and thus no one bore witness to what happened next. The wound in Yamamoto’s head glowed crimson and the glow spread around his entire being. Once his entire unconscious body was glowing, it started to reduce in size. Smaller and smaller the young teenager shrank until the glow faded and he was only a mere centimeter in height; barely an insect. <br>\r\n<br>\r\n“W-What happened…?” Yamamoto mumbled to himself as he awoke moments later, sitting up and touching the place he had felt a bullet hit. When he looked at his palm, however, he saw no blood at all. “I swore I got shot…what…?” The baseball nut’s brown eyes widened in shock when he got a look around. No longer was he standing on a sidewalk, but a landscape of concrete! The chain fence next to him rose for miles into the sky and the blades of grass the poked out of the chipped concrete loomed over him like trees. As the shrunken Vongola was still getting his fill of the breathtaking sight, his ears picked up the sound of rushing water. Looking straight ahead, Takeshi spotted his now massive (and empty) bottle of milk a ways away. The cold, white liquid was still leaking out of it and created a small trail of milk to a crack in the sidewalk. To the speck-sized Yamamoto, however, the trail seemed like a river and the crack a ditch he would need to leap over to cross. <br>\r\n<br>\r\n“Wow…I’m REALLY tiny.” The Japanese boy chuckled and scratched the back of his head. “This could be a problem…at least no one’s around.” Soon after saying those words, he had jinxed them. The concrete dust (looked more like pebbles to him) started to hop up and down as slight tremors were sent through the ground. Yamamoto’s brown orbs gazed into the distance and he spotted a figure approaching him. They were still far in the distance according to the athlete’s perspective, but they were quickly approaching and would be on top of him in under a minute. Most importantly, this figure was… </span></div></div>",
            "created":1345438800,
            "id":1409213,
            "title":"A Great Day to Shrink"
        },
        "1553312212":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Ryohei is heading home.",
                "Ryohei is heading somewhere else. "
            ],
            "content":"<div class=\"\"><div> <span> Ryohei Sasagawa, the 10th Vongola Sun Guardian and upperclassman to Yamamoto and his friends, strolled down the sidewalk. The approaching teen appeared to be having a good day as well as he waltzed along in his tan V-neck shirt and black jeans. Buried in his ears was a pair of headphones jacked into an iPod hidden in his pocket. The middle school student appeared very carefree; his eyes partially closed as his lips mouthed the lyrics to the song he was listening to. Occasionally he would even voice his favorite lines.<br>\r\n<br>\r\n“Knock ‘em down, Mess ‘em up! Send them packing with your trump!” Ryohei chanted as he stomped his white sneakers against the ground to the beat and swung his bandaged hands in front of him as if fighting someone. <br>\r\n<br>\r\n“It’s Senpai! What a coincidence!” Yamamoto exclaimed, happy to see a familer face…even though that familer face was now a giant to him. Ryohei was walking in the opposite direction Yamamoto had been going; the two of them probably would have passed each other if the young baseball player hadn’t shrunk, but now Ryohei had no idea he was even there. “SENPAI! DOWN HERE!” Yamamoto shouted as loud as he could as he waved his arms over his head. The larger Guardian took no notice, however, and just kept on walking toward the shrunken Rain Guardian. The tiny boy continued to shout, but his cries slowly trailed off into silence. He had stopped not only because his efforts were proving futile, but every second he wasted brought Ryohei closer and closer to him. The centimeter-tall Yamamoto started craning his neck back as he realized how unbelievably huge his upperclassman really was. <br>\r\n<br>\r\nThe gray haired male was like a titan pulled straight out of a Greek myth. He towered larger than Yamamoto like some kind of higher being and the smaller male couldn’t help but feel a little intimidated by the approaching behemoth. His white sneakers sent tremors through the sidewalk and made the tiny, younger boy wobble. These were just his normal footsteps too! Every now and then the muscular boxer would stomp his feet in unison with the beat of his music and send even stronger quakes through the concrete; quakes that only someone as itty-bitty as Yamamoto could feel. The last mighty stomp sent Yamamoto off his balance and he fell onto his rump. <br>\r\n<br>\r\n“Ah…wow, it’s like Senpai isn’t even a human being anymore!” Yamamoto noted as he rubbed his butt through his jeans. A moment later one of Ryohei’s massive shoes came down on Yamamoto’s empty milk bottle; crushing it flat without the fifteen year-old noticing. The black haired micro winced at the loud sound of crunching plastic and made note not to end up underneath one of those lethal stompers. However, as he thought this, he failed to realize this action meant the looming giant was just a couple steps away from him! When he DID realize the living mountain was dangerously close, he was just one step away. <br>\r\n<br>\r\n“Uh-oh!” shouted Takeshi as he jumped to his feet and raced toward the left. He was much too late, however, and the giant of a boy took a step that placed his gargantuan foot directly over Yamamoto. The swordsman’s pupils dilated as he gazed up at the dirty trends of Ryohei’s shoe quickly coming down on him! “NO! Senpai, don’t step on-!” Yamamoto, his usually calm voice full of fear, wasn’t able to finish the sentence before Ryohei’s foot came down with a deafening THOOM. Yamamoto’s tiny form disappeared underneath the colossal foot, apparently crushed flat. <br>\r\n<br>\r\n“Yeah~ Yeah~ Smash ‘em up good!” the energetic teen sang just as he unknowingly stepped on his fellow Vongola. The boxer snapped his fingers with his right hand and punched the air with his left. As that white shoe picked up again, one would think the bottom sported a new stain, but this was not the case. The shrunken teenager was still very much alive; his miniscule form having been caught between the trends of Ryohei’s shoe and plastered into a glob of pink gum. <br>\r\n<br>\r\n“T-That was a little too close for comfort…” the shaken up teen admitted as he watched the ground rapidly zoom away as Ryohei raised his foot and then speed toward him as the foot touched down. Each time Yamamoto’s ears popped from the loud boom of the footstep and each time his handsome face came inches from being smeared into he concrete. The athlete tried to keep his cool and not move too much; he didn’t want to get dislodged from the gum at the wrong time and really end up smashed to death. For now all he could do was wait motionlessly for his chance to get free...</span></div></div>",
            "created":1345438800,
            "id":1409280,
            "title":"Enter the Champ"
        },
        "15533122121":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "The one on the left.",
                "The one on the right."
            ],
            "content":"<div class=\"\"><div> <span>While a little shaken up and dazed after his close encounter with death, Yamamoto was relatively unharmed. That wasn’t to say his pride didn’t sting a little bit, however. He was the tall, Number 1 athlete at school and a fairly popular kid, and yet here he was stuck between the shoe trends of another guy like a piece of lint. All around him was the smell of burnt rubber from Ryohei’s shoes stomping down on the warm concrete so much. The constant up and down motion of the foot was beginning to make the black haired teen nauseous as well. <br>\r\n<br>\r\n“Ugh…Senpai…*THOOM*…if you could…*THOOM*…stop soon, that’d be great…*THOOM*…hehe.” Yamamoto mumbled, knowing full well Ryohei wouldn’t be hearing him.<br>\r\n<br>\r\nThe tiny swordsman’s wish was granted after another five minutes of walking when the gray haired boxer arrived at the front door to his house. Upon entering, Ryohei popped out his earphones and stuffed them into his pocket with his iPod. He then took a seat on the single, small step in front of the entrance and started prying off one of his shoes. The shrunken Yamamoto’s entire world shook as Ryohei gripped his shoe with his strong hands and pulled it off; flexing his socked toes once they were free. The Vongola then raised his shoe to his face and inspected the bottom of it.<br>\r\n<br>\r\n“Ha! I knew I stepped on a few things...to the extreme!” Ryohei exclaimed as his huge black orbs homed in on Yamamoto and the pink gum. The much, much smaller teen was taken by surprise when the humongous, manly face of the older male took up his entire vision.  Yamamoto’s body vibrated when Ryohei spoke so close to him and his mere breath pushed him further into the gum. <br>\r\n<br>\r\n“S-Senpai! I’m glad you noticed me!” Yamamoto shouted as he smiled thankfully. “You almost stepped on me like a bug back there; that would have been messy…hehe.” The Japanese boy chuckled, but if Ryohei had heard him he showed no signs of it. Instead the titan of a male took a quick moment to glance over the rest of his shoe before his impossibly huge, muscular index finger appeared. Yamamoto watched as Ryohei started using his fingernail to dig out the dirty piece of gum. He gazed up at the nail, looking like a huge ceiling to him, and assumed Ryohei was helping him free. That assumption was quickly tossed out the window when the giant middle schooler plucked the gum out and, without a second glance, flicked it away like the bothersome trash it was. He then proceeded to take off his other sneaker and examined it for any stuck objects as we. Soon he was picking out the squashed corpses of a few bugs that weren’t as fortunate as Yamamoto. <br>\r\n<br>\r\nSpeaking of Yamamoto, the shrunken boy was currently zipping through the air like a jet plane. He fully expected to go splat against a wall or something, but as luck would have it his body became unstuck from the sticky gum in midair. He then fell down a short distance before landing in a forest of carpet tufts. The teen hissed in pain a little as he stood up, clutching his arm which had suffered a minor rug burn. <br>\r\n<br>\r\n“Another close one…this is kind of dangerous.” Yamamoto stated with another one of his laughs. As the centimeter tall boy gazed around the tall carpet fibers around him he quickly felt a series of familer quakes. Looking up, Yamamoto watched through his brown eyes as the towering, godly form of Ryohei passed him. Luckily the small teen wasn’t in his path this time. “Looks like I’m in Ryohei’s house now…” Yamamoto suddenly realized he felt a lot lighter. Looking behind him, the Rain Ring Guardian discovered it was due to his lack of a backpack. “Crap! That had my favorite bat in it…and my homework too! Damn…” Yamamoto sighed and took a quick glance around. As expected, his bag wasn’t anywhere nearby. It was probably still stuck to that piece of gum and had thus been carried off somewhere else in this maze of a rug. In other words, Yamamoto wasn’t going to be seeing it again… “This day’s starting to go downhill…I should find Yamamoto and get back to normal size before it gets worse!”<br>\r\n<br>\r\nWith his objective clear, to gain the titanic Ryohei’s attention, Yamamoto started trekking through the rug; heading in the direction he had witness Ryohei go. What would have taken a normal person like Ryohei a few seconds to cross took Yamamoto about an hour! By time he finally pushed himself out of the rug maze and out into a hall of some sort, he was short on breath. <br>\r\n<br>\r\n“Everything’s…a chore at this size.” mumbled the spiky haired teenager as he touched his knees and took a moment to catch his breath. “At least it’s a good workout~” Taking a deep breath, Yamamoto surveyed over his new surroundings and made note of two nearby doors that were open. Ryohei might have been beyond one of them, but they were across from each other and it’d be another long trek to either of them. “I guess I’ll have to pick one. I hope I’m right…”</span></div></div>",
            "created":1345525200,
            "id":1410017,
            "title":"Home Sweet Home"
        },
        "155331221212":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "...toward the toilet.",
                "...toward the tub."
            ],
            "content":"<div class=\"\"><div> <span>Yamamoto stood there for a moment to think. His gut told him to go with the right door and so to the right he ran. One would have to know the tiny Yamamoto was there to notice his speck-sized body dash along the wooden floor. Several minutes passed and Yamamoto was still running toward the open door; still only halfway there. Not wanting to miss Ryohei if he was right, the athletic teen pushed his leg muscles to the limit as he ran even faster toward his destination. Within several more minutes he finally arrived in front of the massive entry way; panting like a dog and looking at the ground while his palms rested on his knees.<br>\r\n<br>\r\n“I sure hope this is Senpai’s bedroom…” Yamamoto whispered to himself, figuring that would be the only room Ryohei would spend so much time in. When the shrunken baseball player recovered and looked up, the hope in his face seemed to dissipate. It was not Ryohei’s room, but a bathroom; an empty bathroom to boot. “Figures…” Yamamoto sighed and wiped some sweat off his forehead. For some reason the bathroom door was wide open and the light inside turned on. Perhaps Ryohei had made a quick stop in it while he was busy trekking through the rug or maybe someone else in the house had left it open. Speaking of someone else, Yamamoto hadn’t seen or heard anyone but Ryohei. There were no signs of his sister, Kyoko, or their parents anywhere. Perhaps they were somewhere else in the house or not even home…<br>\r\n<br>\r\n“I guess I have no choice but to search the house for someone.” Yamamoto explained to himself as he turned around, intending on taking a peek into the opened door across from him first. This door was only open a crack, but it was more than enough for Yamamoto’s small size to enter through. Before he could take a single step, however, the door suddenly swung open all the way and someone stepped out. It was, of course, Ryohei, but something was different this time. At some point since he got home, Ryohei had discarded his V-neck shirt and now walked around the house bare chested. Perhaps he just found it more comfortable or he had just been in the middle of an exercise routine. The towering teen’s incredibly toned and muscular torso didn’t sport a drop of sweat, however, so either that guess was wrong or he hadn’t yet broken a sweat. What Yamamoto DID know for sure, however, was that the massive boxer was once again stomping his way. <br>\r\n<br>\r\n“SENPAI! SENPAAAAAI!” shouted the young jock with all his vocal power, hoping the giant would hear him without those headphones in his ears. Unfortunately, the teenager was just too puny for his voice to reach all the way up to the larger male’s ears. Those socked feet continued to stomp toward the bathroom; each footstep hinting at the heavy power Yamamoto would be caught under if one of those feet landed on him. With a face full of worry he tried to dodge again, but this time it would appear he had no need to do so. The 15 year-old titan passed right over the 14 year-old, Yamamoto almost falling backwards when he tried to crane his neck far enough to keep his eyes focused on the giant’s face. “Hey, wait up!” Yamamoto called as he ran after the moving, shirtless mountain of a boy. Just then one of Ryohei’s hands pushed on the open door to close it behind him. Yamamoto’s eyes bulged when he saw the huge, wooden frame of the door speeding toward him. Thinking fast the miniscule swordsman fell to his stomach and pressed himself flat against the cold floor; the door passing harmlessly over him. It was yet another close call, however, as Yamamoto felt the door touch the tip of his hair as it sped past him. <br>\r\n<br>\r\nOnce he was out of danger for the moment, the pint-sized Guardian stood to his feet and watched the bronze god that was the Sun Ring Guardian walk further away from him. His bathroom was average in size; sporting a tiled floor, a sink below a mirror, a toilet next to it, and a bathtub across from both. As the oblivious giant passed the mirror he came to a stop and looked into it with his black orbs.<br>\r\n<br>\r\n“Looking good, to the extreme!” Ryohei exclaimed as he examined his youthful face in the mirror. He then faced it completely and flexed both his arms; his biceps peaking like small hills of pure power. A wide grin formed on the musclehead’s face as he continued to pose in front of the mirror. His tiny guest could just laugh and rub the back of his hair.<br>\r\n<br>\r\n“Hehe…I wish he would pay as much attention to me as he did his body.” the black haired youth stated as he broke out into another run. As the shrunken athlete struggled to get to Ryohei, the titan spent an entire minute checking on the condition of almost every muscle in his upper body. When he was in the process of flexing his back, realization dawned on his face.<br>\r\n<br>\r\n“Oops! I almost forgot why I came in here! EXTREME distraction!” Ryohei bellowed with laughter befor reaching down and unzipping his black jeans. Yamamoto watched from the floor below as Ryohei then grabbed his jeans by the rim and tugged them down with his boxers in tow. The smaller teen’s mouth fell open when Ryohei’s bare, firm ass was revealed. He had seen plenty of naked guys in the locker room, but this was the first time one of them towered over him like an Adonis! The titanic fighter was just bigger than him in every way possible; the lack of clothes further showing this. A blush of embarrassment appeared on Yamamoto’s face, but he shook it away and kept on jogging. This was no time to be intimidated by the nude giant; he needed to get Ryohei’s attention no matter what!<br>\r\n<br>\r\n“I hope Senpai doesn’t get the wrong idea when he finds me...” mumbled the speck of a boy. Suddenly, Ryohei started to move… </span></div></div>",
            "created":1345525200,
            "id":1410054,
            "title":"Looking up at a God of Boxing"
        },
        "1553312212121":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "Yamamoto is caught underneath the toilet paper.",
                "Yamamoto manages to avoid the toilet paper."
            ],
            "content":"<div class=\"\"><div> <span>With his jeans and boxers looped around his ankles, Ryohei shuffled himself over to the nearby toilet. Far on the tiled floor below, Yamamoto watched as the titanic boxer lifted the seat and parked his bare rump upon the toiled with a thump. The young baseball player’s eyes immediately widened with recognition and shock while Ryohei swiveled his ass into the toilet seat for comfort. <br>\r\n<br>\r\n“Oh no…he’s gonna…” As if on cue, the sound of a loud fart blasted through the bathroom like a foghorn. Following this was a short delay and then the sound of something big and solid dropping into water underneath the naked Ryohei. Yamamoto’s mouth twitched and his face grew pale as a few smaller splashes could be heard after this. The shrunken Rain Guardian stopped dead in his tracks and glanced back at the huge door behind him; perhaps he could get Ryohei’s attention at a…different time?<br>\r\n<br>\r\nNo, it was much too late for that. By the time he made it back to the door and slipped underneath the crack at the bottom, Ryohei would have been finished already. Sighing, the black haired teen looked back up at his relaxed buddy as he sat upon his milky white throne. <br>\r\n<br>\r\n“Ugh…I’ll have to apologize to Senpai for witnessing this until the end of time.” Yamamoto told himself with a groan. His face made an expression that showed he was NOT looking forward to that before he once again took off running. While he didn’t like being in the bathroom while Ryohei was taking a shit, he couldn’t lose this opportunity to earn the gray haired male’s notice! <br>\r\n<br>\r\n“Shouldn’t have had all that pizza for dinner last night!” exclaimed the Sun Guardian as he touched his chiseled abdominals with one hand. With a grunt the teenager released another wet log of fresh waste into the toilet. “It got me really packed…to the extreme!” <br>\r\n<br>\r\nIt took about a minute for tiny Yamamoto to make it all the way to Ryohei’s socked foot. That time was filled with the sounds of the older giant grunting and releasing bombshell after bombshell of his digested supper into the toilet bowl. Yamamoto kept his head down as he ran and tried to ignore the gut-wrenching sounds coming from the huge male. When he finally arrived below the seated titan and next to his right foot, the smaller boy gazed up at it like a massive structure of white cotton. Occasionally it would move as Ryohei casually curled his toes within the warm sock. Not wasting any time, Yamamoto began bashing his fists into Ryohei’s foot, hoping the giant would feel them. <br>\r\n<br>\r\n“Senpai! Down here, Senpai!” cried the shrunken lad as he looked up at the looming god of a boy. All he witnessed the giant do was grab his knees and grunt through his teeth as another thick log of scat was pushed out from between his muscled cheeks. A rumbling fart came with this one and it all made Yamamoto turn green with repulsion. “I know you’re…busy, Senpai, but PLEASE LOOK DOWN!” cried the middle schooler as he punched with all his strength. His feeble fists couldn’t even make it past the white barrier around Ryohei’s foot, however. <br>\r\n<br>\r\nUp above, the Sun Ring holder flexed his sphincter a bit and upon noticing the pain in his lower abdomen was gone concluded his business was finished. He reached an arm to his left to grab a few sheets of toilet paper, but in his hurry he accidentally yanked too hard and like a white snake the toilet paper started coming off the roll. <br>\r\n<br>\r\n“Damn it!” Ryohei exclaimed as he stopped the spinning cardboard roll with a hand, but by then a fair amount of toilet paper had fallen to the ground around his feet. “Great…Kyoko hates it when I waste toilet paper too. She’ll be EXTREMELY angry for sure!”<br>\r\n<br>\r\nMeanwhile, Yamamoto buried his fist into the soft cotton of Ryohei’s sock once more before grumbling in defeat. After all his effort, Ryohei still hadn’t discovered his centimeter sized body right next to his foot. It was very disheartening…<br>\r\n<br>\r\n“Hmm…maybe if I tried challenging him to a boxing match?” The teen pondered as he scratched his smooth chin. All of a sudden he heard Ryohei curse above him and looked up just in time to see the falling toilet paper descending toward him. Now, it was just toilet paper, so Yamamoto didn’t appear that worried. Even at his reduced size where the thin paper would be heavier, it was still nothing that could hurt him. Therefore he didn’t put a whole lot of effort into trying to avoid the white paper; he merely jogged to the side while keeping his brown eyes on the plummeting sheets. </span></div></div>",
            "created":1345611600,
            "id":1410855,
            "title":"Bathroom Break"
        },
        "15533122121211":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "choices":[
                "He was still trapped in Ryohei's butt.",
                "He was dropped into the toilet too."
            ],
            "content":"<div class=\"\"><div> <span>Yamamoto wasn’t able to escape in time; in a second his miniscule body was buried underneath the white toilet paper. As expected, at his size even mere toilet paper was enough to weigh him down slightly. At first it was just a minor annoyance as the young athlete struggled underneath the heavy paper and slowly made his way toward freedom. However, the minor trouble soon turned life threatening when the towering, nude form of Ryohei stood up and reach down for the fallen rope of thin paper. Yamamoto wasn’t sure what was going on at first as his speck of an existence was bundled up with the toilet paper and lifted up in Ryohei’s large hands. The giant used both his hands to compress the paper into a single, packed lump. As he held the toilet paper in his hand, he was completely unaware of the itty-bitty Yamamoto trapped within its folds somewhere on the outer edge.<br>\r\n<br>\r\n“W-What?” Yamamoto mumbled as the world stopped spinning around him. The sudden movement of being picked up and rolled around in Ryohei’s hands had disoriented and he was just now figuring out he was trapped in a handful of toilet paper. “U-Uhhm…S-Senpai?” Yamamoto tried to look around for Ryohei’s face, but all he could make out were parts of the titan’s gargantuan body as the boxer started moving the toilet paper. Then, as Ryohei moved the bundle of clean paper behind him, Yamamoto saw the landscape that was the older teen’s bare ass. His brown eyes widened as he watched Ryohei’s muscular cheeks part a little like the opening of a canyon. Then the gray haired giant shoved the handful of paper forward…<br>\r\n<br>\r\nYamamoto was at a loss for words. Just seconds ago he was within fresh air and perfectly fine, but then Ryohei had thrust the toilet paper between his cheeks and started to wipe. Instantly Yamamoto’s shrunken form was pressed against a dirty, ungodly smelling wall within Ryohei’s ass and the giant started rubbing the ball of paper up and down and all around his anus. The baseball player’s eyes rolled into the back of his head as the smell of pure shit invaded his nose and his body was being covered in just that. He opened his mouth to scream, but that proved to be a massive mistake. At that moment his face was pushed against the scat covered wall of flesh and his lips kissed it. The young mafia member’s face turned pale and tears started to stream down from his eyes. <br>\r\n<br>\r\n“S-Senpai…” Yamamoto whispered as if he could reach the giant from deep within his behind. Ryohei merely whistled to himself and twisted the toilet paper between his cheeks, hoping to clean out as much of last night’s supper as possible. Soon the once white ball of paper was stained brown and the little passenger it carried was bound firmly to it. His carefree outlook on this whole shrunken situation seemed to evaporate as all he wanted now was to be back to normal. Anything would be better than enduring this absolute humiliating torture; even fighting ten Squalos and ten Genkishis! <br>\r\n<br>\r\nAfter what must have seemed like hours to poor Yamamoto, Ryohei gave his ass one last firm wipe before taking the bundle of toilet paper out. Before it got too far away, however, the teenage giant lifted his leg a bit and unleashed one last mighty fart. This time Yamamoto didn’t just hear it; its eggy stench forced its way up his nose and he silently screamed within the toxic air. None the wiser to his fellow Guardian’s misery, Ryohei casually dropped the paper into the toilet and pulled his boxers and jeans back up to his waist. As for Yamamoto…</span></div></div>",
            "created":1345957200,
            "id":1414179,
            "title":"When Luck Turns Crappy"
        },
        "155331221212112":{
            "author_id":"dark_lord666",
            "author_name":"Dark_Lord",
            "content":"<div class=\"\"><div> <span>Due to being weighed down with all of Ryohei’s leftover crap, the ball of toilet paper made an audible splash as it hit the water. Slowly it softened in the water and became a soggy, filthy lump on its surface. Yamamoto was trapped on the part of the lump that faced up at Ryohei and he struggled weakly against his sticky, brownish prison. <br>\r\n<br>\r\n“SENPAI!” Yamamoto shouted as he shivered due to the cold toilet water. He tried to free himself from the toilet paper, but his tiny and weak body was sealed to the wet paper by tons of wet and dry waste. It was the most disgusting thing Yamamoto had ever had to endure and he couldn’t help but weep a bit at his sorrowful state. Unknown to him, it was about to get loads worse…<br>\r\n<br>\r\n“Oops, think I forgot something…to the extreme!” came Ryohei’s loud voice above. The black haired baseball player gazed up at the looming, shirtless titan as he gripped his crotch and squeezed it through his black jeans. Yamamoto’s face was the exact opposite of Ryohei’s, a wide grin, as the larger male reached into his still-unzipped pants and yanked out his cock. It was soft in his big hand, but Yamamoto could tell Ryohei possessed impressive girth. That’s not what he was thinking about at the moment, however! He was far more concerned about what the gray haired boy was planning to do with that thick member. <br>\r\n<br>\r\nAs if to answer his question, Ryohei’s cock slit seemed to open wide like a black eye. A second later, a torrent of yellow piss erupted forth from the huge penis and descended into the toilet bowl. For the boxer it was a normal, uninteresting action, but for Yamamoto it was so much more. The golden stream hit the clump of toilet paper and Yamamoto dead on like a fire hose. The sheer force of the urine knocked Yamamoto free of the toilet paper and blasted him away. The young teen landed far near the edge of the toilet bowl; sinking into the filthy water a bit. He held his breath and upon recovering from his daze, a result of being hit with such a powerful force and sent flying, swam to the surface. Yamamoto gasped for air upon emerging, but the air within the toilet was anything but fresh and he found himself cough and hacking up a storm.<br>\r\n<br>\r\n“This…can’t be happening.” the brown haired Rain Guardian mumbled between coughs as he watched what was going on in the distance. Ryohei was still totally unaware of his presence; the muscle-bound titan just looked down into the toilet while he pissed on the ball of toilet paper. The acidic, hot liquid quickly turned the lump of paper yellow and it grew soft and moldy. Yamamoto also noticed the water he floated in was starting to turn warmer as a murky yellow color was added to its dirty brown. <br>\r\n<br>\r\n“I-I gotta get out of here. Now!” Yamamoto told himself as he started swimming to the nearby edge; a massive wall of marble to him. Once he reached it, the ant-sized male tried to scale up it, but it was a useless attempt. The sides of the toilet were just too smooth and moist for Yamamoto to get any kind of grip. After clawing at the smooth white fruitlessly for a few seconds, the Japanese teen heard Ryohei’s urinating start to slow down. The mighty stream of liquid gold became a trickle until just a few drops fell into the bowl. After this Ryohei let out an audible sigh and tucked his penis back into his jeans; zipping them up. With his business concluded, Yamamoto knew of only one thing that could happen next…<br>\r\n<br>\r\n“SENPAI, NO!” the shrunken teen screamed up from his murky, cesspool of a prison. “D-Don’t flush! I don’t wanna die like this!!” Tears streamed down the Guardian’s cheeks as he realized the humiliating, revolting fate that awaited him. He, like anyone else, did not desire such an end and thus he screamed and cried. The calm, easygoing Yamamoto seemed like a distant memory as the athlete sniveled and shouted while he choked on the fumes that surrounded him. “P-Please…!”<br>\r\n<br>\r\nWithout even looking into the bowl while Yamamoto cried his heart out, Ryohei dropped the toilet seat with a loud THUMP and engulfed Yamamoto in hellish, rank darkness. He waited there for what seemed like forever; listening to his own frantic breathing. Then it happened: the deafening roaring. Yamamoto screamed, but the terrible roaring all around him masked all hints of his voice. The normally calm waters inside the toilet quickly became a whirlpool and Yamamoto, despite his best efforts to swim against the current, was easily dragged screaming underneath the waters. A moment later the contents of the toilet disappeared down the drain and the bowl filled with crystal clear water…as if nothing had happened. <br>\r\n<br>\r\nThe tiny teenage swordsman covered his mouth and nose with his hands as his helpless form was swept through the pipes underneath Ryohei’s house. All around him was the awful concoction of Ryohei’s liquefied shit and his urine. He knew that if he opened his mouth it would be the end, but the hell ride seemed to go on forever!  Yamamoto’s face turned blue and he could no longer hold his breath. His mouth opened with a gasp and instantly Ryohei’s bodily wastes poured into his lungs. It was a slow and agonizing demise; the smell and taste of utter crap being the last thing Yamamoto ever sensed. Eventually the unfortunate, shrunken victim drowned within the filth of the bigger, superior man; his eyes turning completely white as his lifeless body was pulled down into the sewers with the rest of the insignificant crap.<br>\r\n<br>\r\nBack in the bathroom, Ryohei whistled to himself as he stepped in front of the sink and washed his hands really good. Once they were dried off he gave his reflection a bright smile and a thumbs-up before making his way out of the bathroom to continue this perfect day. Never did the young boxer realize he had sent Yamamoto and his own perfect day down the gutter…literally. </span></div></div>",
            "created":1345957200,
            "id":1414181,
            "title":"A Piss-Poor Conclusion"
        },
        "155332":{
            "choices":[
                "gon",
                "killua"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about guys from hunter x hunter</span></div></span></div>",
            "created":1460437200,
            "id":2131969,
            "title":"hunter x hunter"
        },
        "1553322":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Hunter x Hunter",
                "Another anime"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you still want to go with Hunter X Hunter or another Anime</span></div></span></div>",
            "created":1499576400,
            "id":2350138,
            "title":"Hunter X Hunter Or something else"
        },
        "15533222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes, let's go to MAR",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about MAR Marchen Awakens Romance ? Plenty of guys there</span></div></span></div>",
            "created":1499576400,
            "id":2350139,
            "title":"Mar Marchen Awakens Romance"
        },
        "155332222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes, let's go ",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Death Note?</span></div></span></div>",
            "created":1499576400,
            "id":2350140,
            "title":"Death Note?"
        },
        "1553322222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes please!",
                "No, another Anime"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How could this not be an option yet!?! <br>\r\n<br>\r\nHow about Inuyasha ?</span></div></span></div>",
            "created":1499576400,
            "id":2350141,
            "title":"Inuyasha"
        },
        "15533222222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "Yes!",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the world of Pokemon</span></div></span></div>",
            "created":1499576400,
            "id":2350142,
            "title":"Pokemon?"
        },
        "155332222222":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "My Hero Academia ",
                "Servamp ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more.<br>\r\n<br>\r\nMy Hero Academia, many heroes await that might see the world from a bug's view.<br>\r\n<br>\r\nServamp, dealing with vampires all while tiny.</span></div></span></div>",
            "created":1583117520,
            "id":2795380,
            "title":"Motto"
        },
        "1553322222221":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Izuku Midoriya",
                "Katsuki Bakugou",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which young man goes through a shift in size?</span></div></span></div>",
            "created":1583117700,
            "id":2795382,
            "title":"My Hero Academia "
        },
        "15533222222211":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Bakugou",
                "Todoroki ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>Izuku smiled as he jogged up towards the large gates of U.A, feeling rejuvenated for from his training yesterday. He had trained in using more of One For All, managing to get a good amount without any of his bones breaking.<br>\r\n<br>\r\nStill a comment made by Bakugou was stuck in his head. The blond was being his usual aggressive self and called Izuku an insect. It didn't bother Izuku but rather stayed stuck in his head for some reason, as if telling him something about to come.<br>\r\n<br>\r\n\"Ah come on that's ridiculous, Kacchan was just being his usual self!\", Izuku grinned as he prepared to enter school.<br>\r\n<br>\r\nMeanwhile hidden away was a mysterious figure shrouded in darkness. Putting a hand to his earpiece the man spoke. \"I see the mosshead, you sure you want me to use my quirk now?\"<br>\r\n<br>\r\nA familar raspy voice came through the device, it was that of Tomura Shigaraki. \"Yes hurry up, i want you to capture him! Bring him here so that i can crush him and All Might's hope!\"<br>\r\n<br>\r\nThe figure sighed. \"Alright i get it, I'll be back in 20.\", turning off the earpiece, the dark figure pointed his finger at Izuku's form about to turn into U.A.<br>\r\n<br>\r\nA small concentrated beam shot out and flew towards the student. Izuku gasped as he felt light headed all of a sudden and fell forward, feeling as if the world was shifting. The figure sighed as he was successfully, however he cursed as another figure approached the gate.<br>\r\n<br>\r\n\"Shit i can't blow my cover, and if the boss doesn't get to crush him then I'm dust!\"<br>\r\n<br>\r\nIzuku groaned as he opened his eyes, still feeling dizzy from his fall. However immediately something was wrong as the ground felt different, as if the material was more...close up.<br>\r\n<br>\r\nHaving his vision clear, Izuku gasped in shock as looming into the sky was the gate to U.A looking as big as a bridge. <br>\r\n<br>\r\n\"W-why is that so huge?! Or did i shrink?\", Izuku mumbled in terror at the sudden shift in his size, was it a quirk, a dream?<br>\r\n<br>\r\nBefore he could panic more the ground began to shake, not like an earthquake but like that of...steps.<br>\r\n<br>\r\nA shadow soon covered Izuku and the greenette looked in both fear and awe as looming over was...</span></div></div>",
            "created":1583119020,
            "id":2795389,
            "title":"Izuku Midoriya"
        }
    },
    "info":{
        "author_id":"dark_lord666",
        "author_name":"Dark_Lord",
        "brief_description":"Anime guys are shrunken and their closest friends are none the wiser. ",
        "created":1325732040,
        "description":"<td align=\"left\" class=\"norm\">Anime is littered with many different characters. Most of these characters are heroes destined for great things. They believe they’ll survive every obstacle, beat the bad guys, and save the day. However, what if they were faced with their “biggest” challenge yet: Shrinking? Would these Big Damn Heroes still come out on top when they’re the size of ants? Or do their true destinies take place on the bottom of someone’s foot? It’s all up to you…<br>\r\n<br>\r\n~~Rules~~<br>\r\n<br>\r\n1. This is strictly a male/male interactive. No girls can shrink and no girls can interact with the shrunken character(s). They can still be there, but keep them away from the shrinkies. If you don’t like it go find a GTS interactive. There’s plenty of them here. <br>\r\n<br>\r\n2. This is a completely unaware interactive. This means the shrunken character(s) can never be found or noticed by the giants (unless they are mistaken for bugs, in which case go crazy). <br>\r\n<br>\r\n3. The shrunken characters in this interactive are REALLY tiny. Do not make them any more than an inch tall. We want to make the chances of them getting help as close to zero as possible. &gt;:3<br>\r\n<br>\r\n4. All chapters (save for choice chapters) must be of decent length (at least a paragraph) and have good grammar. Any chapter that looks too short or looks like it was written by some who’s never heard of punctuation will be deleted. I’m not gonna spell check your additions. <br>\r\n<br>\r\n5. This is an anime only interactive. As long as there’s an anime (or manga) of it, you can add it here. Do not add any characters from the real world or “Western Anime” like Ben 10 or Avatar. <br>\r\n<br>\r\n6. <b>VERY IMPORTANT: Choice Chapters</b> Choice chapters are important. They’re how all the plotlines begin. However, do not flood the interactive with them. After choosing who the “lucky” shrinkie is gonna be, do not take five chapters to decide who the first giant they encounter is. Also, and this is even more important, do not add ONLY choice chapters. After adding one or more choice chapters you must then add a REAL chapter to the interactive; either to one of your own choice chapters or anywhere else in the interactive. If I see someone has added a choice chapter, but not a real chapter and several hours have passed I will delete the choice chapter. <br>\r\n<br>\r\nAnd that’s it. As long as you follow the above rules you may add anything else to the interactive. Almost everything is allowed; even stuff like hard vore, bathroom stuff, and sexual stuff. You can make the shrinkies find a way to return to normal…or give them a very humiliating demise. &gt;:3</td>",
        "id":1838159,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604389500,
        "modified":1604389500,
        "pretty_title":"Beneath his Notice"
    }
}