{
    "chapters":{
        "1":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "Onto the rubbery track to run a few laps",
                "Over to the throwing pits ",
                "Use the bathroom ",
                "The spectator stands to sit"
            ],
            "content":"<div class=\"\"><div> <span>Today was the first Track practice of the year. There was a meeting yesterday where the coaches told us what we would need to bring for practice each day. Looking around the room, I saw a lot of the popular athletes standing in their cliches.<br>\r\n<br>\r\nYou’ve got Jake, a super talented mile runner with a jawline made of steel. His light, short brown hair brings out the blue in his eyes, making every girl he looks at swoon. His body is actually quite hairy, mostly on his back leading down to his firm butt.<br>\r\n<br>\r\nThen there is Josh. He has the fastest 100m time in the school. He’s got a lot of muscle, mainly in his legs and butt. His hair is dark brown with a hint of curl in it. He is a friendly guy and wouldn’t never hurt a fly. He can get a little disgusting from what you’ve heard around school.<br>\r\n<br>\r\nCan't forget the state winning thrower, Julien. Julien is a short, stocky guy. Being Dutch, he’s got creamy tan colored skin and a light accent. Years of working out has made his body toned. He’s got impressive features, but his most viewed at is what he is packing in back. He’s got a giant bubble butt that seems to strain every kind of pants he wears.<br>\r\n<br>\r\nEven the coaches were studs back in their day.<br>\r\nYou, on the other hand, are not an athlete at all. Both your parents were stars in their prime, but you weren’t lucky enough to gain that trait. You are only doing track because your parents wanted you to do a sport. Seeing all theses star athletes broke your confidence a little bit, but you still decided to try. And here you are, walking with your bag over to the rubber track. It’s black surface reflecting brightly due to the intense sunlight. This was always the hottest part of the day.<br>\r\nTaking a look around, you notice that only a few people were at the track, just a handful of coaches and students getting ready. You set your bag down and take a deep breath. Here we go.<br>\r\n<br>\r\nWhere do you head first?<br>\r\n</span></div></div>",
            "created":1539839400,
            "id":2565238,
            "title":"Practice"
        },
        "11":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "A giant short-clad ass coming right for you!",
                "The bottom of a running shoe!",
                "One of the coaches is setting down his bag!",
                "A group of athletes running their warmup lap!"
            ],
            "content":"<div class=\"\"><div> <span>The track was spongy, yet firm underneath your running shoes. You decided that it would be good to do some warm-up laps before everyone else came. Might as well try and get a head start since you know you will be far behind. Before you started, your mouth was dry so you decided to take a drink from your water bottle. Now you were expecting the tasteless water to flow into your mouth, but you were met with this bitter, sour taste in your mouth. <br>\r\n<br>\r\n“Ew okay I knew my mom was going to put some energy thing into my water, but I didn’t think it was going to taste that disgusting,” you said as you set the now empty water bottle by your bag. The odd tasting drink now settled inside your stomach making you feel a little queasy. You decided it was time to start running and started with a little jog.<br>\r\n<br>\r\nAround one and a half laps around the track, the queasiness inside your stomach had turned into knot of pain. You felt like you were going to puke from the pain as your vision slowly started to fade to black. The last thing you saw was some of the coaches and athletes off in the distance. Completely unaware of your presence. <br>\r\n<br>\r\nYou wake up you the sun shining brightly up above. Standing up, you look around at your surroundings. Everything is blackened like rubber with hills and mountains. “Oh no where am I? What the hell happened?” You day in fear not recognizing where you were. Soon enough the ground begins to shake as a shadow looms over you.<br>\r\n<br>\r\nLooking up you see...</span></div></div>",
            "created":1541631720,
            "id":2574565,
            "title":"Rubber world"
        },
        "111":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "You ended up smothered by his cheek",
                "Ended up right between his cheeks in his deep crack",
                "Made it right behind hm"
            ],
            "content":"<div class=\"\"><div> <span>A shadow soon forms above you. Looking up you see a tight wall of gray. Two huge mounds begin to stretch as they grow in size. Your eyes are wide as you can’t yet comprehend what is coming right for you before it is too late. One of the athletes has decided to take a seat on the track to stretch. Unaware of the small human being right underneath them.<br>\r\n<br>\r\nJake was basking in the sunlight. The heat making his nether regions a bit too warm as he scratches idle at his happy trail. Jake always liked to wear a size smaller in shorts to show off his tight ass around back. The gray shorts already stretched from trying to contain his bubble butt. Deciding to take a seat to stretch he found a nice spot and sat down slowly. His joints were feeling a little stiff today. Unaware of the bug man in his path. Jake our his legs out in front of him and clenched his butt muscles to get the most out of the stretch. <br>\r\n<br>\r\nAs for you...<br>\r\n<br>\r\n</span></div></div>",
            "created":1543467540,
            "id":2583261,
            "title":"A giant short-clad ass coming right for you!"
        },
        "112":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "Stay stuck to the shoe",
                "Unstuck and fall onto the track",
                "Flung off the shoe"
            ],
            "content":"<div class=\"\"><div> <span>Time begins to slow down to a crawl as the giant sole of a running shoe comes down on top of you. The tread underneath has been worn down with a year of use. Rocks, gum, and other undistinguishable things trapped under the shoe.<br>\r\n<br>\r\nAnd just like that the shoe came down on top of you. The air is pressed out from your lungs as your body is compressed. You thought that this was the end, but your body seems to have taken on a more plastic consistency. Your body was now stuck in the tread of one of your teammates. Unaware of what unfollowed undearnesth him.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1544322300,
            "id":2587401,
            "title":"The bottom of a running shoe!"
        },
        "13":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "The smell of piss and a large basin. ",
                "Foul liquids fill your senses. You are in the toilet!",
                "Right on the floor of the Portapotty with discarded toilet paper and piss stains",
                "Right on the warm, filthy seat"
            ],
            "content":"<div class=\"\"><div> <span>Your stomach made a slight grumble. Looks like you need to use the restroom! While looking around the track you noticed there was only one bathroom...and it was a Portapotty. Portapottys always smelled disgusting inside and were just dirty all around, but nature was calling and you had to answer.<br>\r\n<br>\r\nWalking up to the large, green shack-like structure, you can already smell the chemicals. It was a mixture of what ever they put in these things along with human waste. You pull on the handle and quickly head inside. Not wanting to stay In here long. To distracted to realize you left the door unlocked. <br>\r\n<br>\r\nSitting down in the seat you try and release the pressure that was built inside you. Getting nothing but some spurts of air you decide that is was just nerves. You pull up your pants and are reaching for the handle when your head becomes foggy. Your vision begins to blur as your legs give out. The last thing you remeber is the feeling of falling.<br>\r\n<br>\r\nWhere did you land?</span></div></div>",
            "created":1542898080,
            "id":2580575,
            "title":"Use the bathroom "
        },
        "131":{
            "author_id":"chriskrgn",
            "author_name":"CKwriter2006",
            "choices":[
                "A teammate walks in",
                "A spectator walks in",
                "Someone else walks in"
            ],
            "content":"<div class=\"\"><div> <span>You finally wake up from blacking out. You look around trying to figure out where you were. The smell of urine filled your nostrils. A few drops of liquid were spread out around you. You looked up and noticed where you were. You remembered you were in the port o potty. Suddenly light floods in as....<br>\r\n.</span></div></div>",
            "created":1542899700,
            "id":2580582,
            "title":"The smell of piss and a large basin. "
        },
        "1311":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "Swept away with the piss own the tube ",
                "Grab ahold of divot and hold on",
                "Try and make it onto his dick"
            ],
            "content":"<div class=\"\"><div> <span>Your mind reacts slowly to what has happened to you. The gray siding ride high above you almost like you are in a canyon. The smell of piss is strong as the ground beneath you is wet. The thought hits you hard:<br>\r\n<br>\r\nYou were stuck inside the basin of the urinal.<br>\r\n<br>\r\n“No wait how did this happen? I can’t possibly be this small?! This has to be a dream, no a nightmare,” your voice getting high with fear. Your situation worsens as off in the distance the handle begins to turn.<br>\r\n<br>\r\nWhat you see makes you fall to your knees. In walks Josh of giant proportions. His hair is hidden by a baseball cap. His face has a few unkept stubbles as he is wearing long gray sweatpants and a red long sleeve. Your heart skips a beat as he walks over to the basin and pulls down the front of his pants.<br>\r\n<br>\r\nJosh’s hands fiddle with the waist band as he pulls it down, revealing his massive member. The giant dick dwarfed you and made you feel like a speck compared to Josh. In fact, you were just a speck. Nothing more the a piece of dust to aim at. Josh doesn’t even look as he leans his head back and releases...</span></div></div>",
            "created":1542932040,
            "id":2580725,
            "title":"A teammate walks in"
        },
        "13112":{
            "author_id":"chriskrgn",
            "author_name":"CKwriter2006",
            "choices":[
                "You wait until Josh finishes",
                "You ventured out while he's still peeing",
                "The urine sweeps you up again",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Your giant teammate was about to take a well needed piss unaware you were in the urinal. You look up as the giant penis looks above you. Before you know it urine begins to pour from Josh's rod. You watch as a giant tidal wave of urine starts to bear towards you. You don't have much time to get out of the way as you are swept up by the tidal wave. As you are being swept along you notice a divot in the basin and dive into as the urine continues to sweep over you. The divot makes the urine miss you completely as you try to figure your way out.</span></div></div>",
            "created":1542932460,
            "id":2580726,
            "title":"Grab ahold of divot and hold on"
        },
        "131124":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "You are staring directly at his gaping piss slit",
                "His movement made you slide down to his gigantic balls",
                "It’s warmup time. Prepare to get hot and sweaty"
            ],
            "content":"<div class=\"\"><div> <span>The divot was the only thing protecting you from being washed down the dark tube into the pile of human waste waiting at the bottom. Josh’s stream seem to be never ending with the force ten times that of a firehouse. One wrong move and you were gone for good. Josh has no idea one of his teammate was experiencing this traumatic experience.<br>\r\n<br>\r\nWhile josh was looking around the Portapotty, he got an itch on the back of his neck. Reaching up to scratch it, he left on hand on his hip and his dick unattended. What Josh didn’t realize would happen is that his dick was no longer being supported and started to drop down. The tiny teammate was not prepared for what came next.<br>\r\n<br>\r\nThe dick head slightly touched the basin of the urinal, inevitably, the small divot porting part. Your eyes went wide as the pink head crashed into you. It’s spongy, yet sticky, surfaces adhered you to it. Josh quickly felt the cold basin and went back to holding his dick.<br>\r\n<br>\r\nShaking the droplets of piss as the stream subsided. Josh quickly tucked his member away, long with an unwilling passenger...</span></div></div>",
            "created":1542988320,
            "id":2580956,
            "title":"Something else happens"
        },
        "1311241":{
            "author_id":"chriskrgn",
            "author_name":"CKwriter2006",
            "choices":[
                "Josh's race starts",
                "Josh sits down",
                "Josh stretches",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You finally feel the weight being lifted off you as Josh finished. As he lifted his rod up you were carried along with it. You screamed as Josh started tucking away unaware of the passenger going along for the ride. Darkness enveloped you as Josh closed his underwear. You finally got your bearings and when you turned around you were staring right at the gaping hole of Josh's penis. It was huge. Suddenly Josh started walking and you are thrown on Josh's tip.</span></div></div>",
            "created":1542988620,
            "id":2580958,
            "title":"You are staring directly at his gaping piss slit"
        },
        "133":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "A teammate",
                "A spectator",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>After passing out you finally wake up with a headache and confused to what just happened. But you begin to get a look at your new surroundings and you are surprised at what you see. All around you was what looked like large white tents but stained with either something brown or yellow and the ground was hard and smelled completely awful. After a few minutes of looking around you suddenly remembered what you were doing before passing out. You were going to the bathroom, which means you had shrunk and are now on the floor of the portapotty. You also figure out that the white tents were actually pieces of toilet paper and the smell was of dry urine, you estimate that you're no bigger than a speck in size. Before you try to figure out what to do now the door to the portapotty opens up and light floods in, but the silhouette of someone entering appears and starts coming in. After your eyes adjust you see that it's..</span></div></div>",
            "created":1543439580,
            "id":2583128,
            "title":"The floor of the Portapotty"
        },
        "1332":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Pee (you hitch a ride on one of his sandal clad feet)",
                "Poop (you hitch a ride on his shorts when they are around his ankles)",
                "Masturbate (you decide to hide youself under some discarded toilet paper)"
            ],
            "content":"<div class=\"\"><div> <span>You had no time to act as an Indian man steps into the portapotty unaware that it was already occupied by someone speck sized. As the man enters his sandal clad foot almost lands on you but instead created a small push of air that knocked you off your feet. When he fully gets inside the portapotty you see that he is wearing khaki shorts and a striped t-shirt, meaning that he is a spectator and not a teammate. None the less you need his help and you need a way to hitch a ride on him. So it was probably best to see what business he needs to take care of first before planning your next move. The man closes the door and locks it, he then starts unzipping his shorts getting ready to..</span></div></div>",
            "created":1543525680,
            "id":2583680,
            "title":"A spectator"
        },
        "13323":{
            "author_id":"digitalcham",
            "author_name":"Charcoal",
            "choices":[
                "He looks and sees some toilet paper on the ground to clean himself with",
                "Stands up and aims his load at the discarded toilet paper",
                "Grabs you and the discarded toilet paper and throws it into the toilet"
            ],
            "content":"<div class=\"\"><div> <span>The giant man towers above you as he starts to unzip his pants. As he pulls down his underwear you can clearly see why he came into the bathroom. His giant hard dick bounces out. A small drop of precum is flung from his dick in your direction. You run, barely avoiding it as you hide over by some discarded toilet paper. The Indian man now takes a seat on the portapotty and begins to stroke his cock. You can hear his soft moans and you try and cover your ears. You can’t believe you are trapped in this bathroom with a giant dude jacking off!! And he has no idea about you. You are even more disgusted that a man would actually do this at a public place! Around ten minutes later it seems he is reaching his climax. Unaware of a tiny witness watching him pleasure himself.</span></div></div>",
            "created":1544976840,
            "id":2589729,
            "title":"Masturbate (you decide to hide youself under so..."
        },
        "14":{
            "author_id":"chriskrgn",
            "author_name":"CKwriter2006",
            "choices":[
                "Josh",
                "Jake",
                "A rival track participant",
                "Your dad",
                "Another spectator "
            ],
            "content":"<div class=\"\"><div> <span>You are early for the meet and decide to wait on the bleachers for the team to arrive. You make it over to the bleachers and sit down. Next thing you know you pass out. When you wake up you notice something is wrong. The bleacher are huge. You had shrunk to a mere speck on the bleachers.  A shadow appears above you as you see.....sitting down</span></div></div>",
            "created":1543106460,
            "id":2581549,
            "title":"The spectator stands to sit"
        }
    },
    "info":{
        "author_id":"digitalcham",
        "author_name":"Charcoal",
        "brief_description":"Shrunk at track practice",
        "created":1536086100,
        "description":"<td align=\"left\" class=\"norm\"><b>Gift Points will be given for chapters added</b><br>\r\n<br>\r\nIt’s that time of the year when Track season rolls around! Unlucky for you when a turn of events leads to you shrinking with all these giant athletes! What’s going to happen?<br>\r\n<br>\r\nRules:<br>\r\nAbsolutely no interactions with female characters.<br>\r\n<br>\r\nThe main character can't be killed.<br>\r\n<br>\r\nTry not to end a story line right away, keep it going.<br>\r\n<br>\r\nNo few word entries! Try to write out at least a paragraph and use spellcheck. If not, the entry will be deleted.</td>",
        "id":2168169,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1544976840,
        "modified":1544976840,
        "pretty_title":"Track Practice"
    }
}