{
    "chapters":{
        "1":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "A small chain of heavily-forested islands just off the coast",
                "The flat marshland, speckled with eerie, dilapidated buildings ",
                "Lumiose City, a circular metropolis bustling with people and pokemon",
                "A snow-covered mountain range dotted with caves, mines, and volcanoes",
                "The dry and dusty Badlands, home to a few power plants"
            ],
            "content":"<div class=\"\"><div> <span>\"Wahoo!\" Skyla squeals with delight, flying her tiny biplane over the rolling hills and lusty plains of the Kalos region. It was true what they said about the area's beauty - surely, it was a sight for sore eyes, after hours upon hours of flying over bland blue seas. <br>\r\n<br>\r\nShe instinctively reaches for her belt, expecting to feel her pokeballs resting against her hip, wanting them to enjoy the view, too. She felt nothing, and quickly remembered that the esteemed professor Sycamore, upon hearing about her planned visit, had asked her not to bring any of her Pokemon, fearing they might damage Kalos's ecosystem or something, blah blah blah...<br>\r\n<br>\r\nSkyla didn't really care, but she had complied. Technically, she <i>was</i> here to make a delivery - a small package nestled between her thighs, addressed to one Ms. Malva. But while she was here, it wouldn't hurt to go sightseeing first, right? The only question was, where to first?<br>\r\n<br>\r\n</span></div></div>",
            "created":1386438600,
            "id":1704527,
            "title":"A new journey begins?"
        },
        "11":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Skyla dives straight into the warm, inviting waters",
                "She walks along the sandy coast for a bit",
                "She remembers she brought her scuba gear, and opts for deep-sea diving",
                "She strolls under the canopy of trees",
                "She climbs the tallest tree she can find to get a better view of the area"
            ],
            "content":"<div class=\"\"><div> <span>Despite having flown over boring, flat miles of ocean for hours to arrive in Kalos, Skyla can't deny that the islands dotting the coast are too appealing to pass up. The water seems brighter, and the leaves on the trees seem vibrant and clean, even from her high altitude.<br>\r\n<br>\r\nIn her excitement to explore, the red-headed gym leader angles her plane at a sharp angle, nearly nose-diving towards her destination. At the last moment, she tugs on the controls, and her small biplane levels out, the aircraft coasting on its wheels for several hundred feet before rolling to a stop. Eager to be on her way, Skyla leaps out of her seat and starts adventuring, the propellor on her plane still spinning.<br>\r\n<br>\r\nHer destination?</span></div></div>",
            "created":1386439740,
            "id":1704537,
            "title":"A small chain of heavily-forested islands just ..."
        },
        "12":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Skyla wades through the thigh-deep mud",
                "She sticks mostly to dry ground, exploring the dense underbrush",
                "She finds herself in a strange place with enormous mushrooms",
                "She takes refuge from the humidity in an abandoned shack",
                "She decides she doesn't like it here after all, and returns to her plane"
            ],
            "content":"<div class=\"\"><div> <span>Residents of Kalos might call the swampy area north of Lumiose City an ugly, unpleasant place, a scar on the face of the entire region. And while the dull brown and green colors didn't do much for Skyla, there simply wasn't much like this back home in the Unova region. She had to check it out!<br>\r\n<br>\r\nIn her excitement to explore, the red-headed gym leader angles her plane at a sharp angle, nearly nose-diving towards her destination. At the last moment, she tugs on the controls, and her small biplane levels out, the aircraft coasting on its wheels for several hundred feet before rolling to a stop. Eager to be on her way, Skyla leaps out of her seat and starts adventuring, the propellor on her plane still spinning.<br>\r\n<br>\r\nHer destination?</span></div></div>",
            "created":1386440760,
            "id":1704542,
            "title":"The flat marshland, speckled with eerie, dilapi..."
        },
        "121":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "Goodra",
                "Gourgeist",
                "Random dude"
            ],
            "content":"<div class=\"\"><div> <span>Walking around the mud sounds boring plus it would take longer to explore. Skyla goes into the mud she feels icky at first but got used to it. Weird thing is that as she went along it got harder to move. \"This is odd why is it soooo hard to....MOVE!\" She then fell deeper into the mud and couldn't move, she was stuck. As she was trying to escape a figure approaches. Skyla looks up and sees a... </span></div></div>",
            "created":1387137600,
            "id":1708064,
            "title":"Walking through mud"
        },
        "1211":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Helps Skyla out of the mud!",
                "Opens wide...",
                "Sits on her?"
            ],
            "content":"<div class=\"\"><div> <span>Waist-deep in mud, Skyla can only look down in terror as she slowly sinks into the ground itself. Is this how it ends? A free trainer of the skies, doomed to die buried in earth? Skyla wasn't immune to the irony of it. <br>\r\n<br>\r\nAs she stares down at the thick mud, slowly approaching eye level, a white splotch splashes on the ground in front of her, and she feels something warm and gooey on her scalp. Looking upwards, she only now realizes that a large gooey creature had been standing just behind her. It bore a grin on its face that seemed more prankish than reassuring.<br>\r\n<br>\r\nThe Goodra...</span></div></div>",
            "created":1387356060,
            "id":1709680,
            "title":"Goodra"
        },
        "12111":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "Pushed Skyla into his body",
                "Put her down"
            ],
            "content":"<div class=\"\"><div> <span>The Goodra procceds to pick up Skyla out of the mud having no trouble lifting her up!<br>\r\n\"Oh thank you so much. Your such a awesome pokemon\" <br>\r\nThe Goodra then starts to hug her. \" I heard pokemon like you are into hugging but never thought it would happen to me\"<br>\r\nSkyla wasn't sure but since it saved her might as well go along. Goodra then...</span></div></div>",
            "created":1387414380,
            "id":1710000,
            "title":"Lucky Save...."
        },
        "121111":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "She becomes trapped in an air-bubble 'stomach' inside.",
                "Goodra's body is made of solid slime."
            ],
            "content":"<div class=\"\"><div> <span>\"Hehe...\" Skyla laughs nervously, cheek pressed against the warm body of goo. \"Uh, not to be rude, but you can stop hugging me now...\"<br>\r\n<br>\r\n\"Dra?\" The gooey dragon coos, licking at Skyla's face as it presses her against itself harder. <br>\r\n<br>\r\n\"T-that's not what I mea-mmph!\" Skyla is cut off as a mouthful of goo lands on her tongue, filling her mouth with a bland taste. She tries to pull away, but her face seems firmly lodged in the stuff. She casts a pleading glance upwards towards the gentle dragon's face, only to see him give her a naughty look while making a sound like snickering.<br>\r\n<br>\r\nSkyla slowly sinks into the Goodra's body until only her cute rump remains visible from the outside. But what's going to happen to her?</span></div></div>",
            "created":1387420140,
            "id":1710038,
            "title":"Pushed Skyla into his body"
        },
        "1211111":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Yes, the slime has oxygen in it.",
                "No, Skyla drowns in slime."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Can she breathe in there?</span></div></span></div>",
            "created":1387420140,
            "id":1710039,
            "title":"She becomes trapped in an air-bubble 'stoma..."
        },
        "12111111":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>The rest of Skyla's body disappeared into the Goodra's gooey body. She was deposited into a small space which must be it's stomach, surprisingly she can breathe normally in here and it actually smells decently good. Skyla was madly struggling to get out <br>\r\nOutside the Goodra was giggling at her attempts of escaping and proceeded to rub his belly, it expanded half the size it was before and Goodra was extremely content with it's catch, to think a human would go through the mud without proper gear, you have to be desperate to this!<br>\r\nWhat happens next?<br>\r\n  </span></div></div>",
            "created":1387496880,
            "id":1710337,
            "title":"Slimy Air"
        },
        "121111111":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Goodra has a pleasant nap.",
                "Goodra has a sadistic idea~"
            ],
            "content":"<div class=\"\"><div> <span>\"L-lemme out!\" Skyla squeals, kicking and squirming against her gooey prison. Hot trails of slime oozed and dripped around her, gurgling and sizzling as they slowly melted her clothes off. She presses outward with her hands, but gets nothing but warm slime between her fingers.<br>\r\n<br>\r\nThe goodra murrs at her struggles, his fat gut bouncing and bobbing as Skyla squirms. He casually rolls onto his back, his liquid-like body not sinking into the mud despite his added weight. With his tongue lolled out, her closes his eyes, ready to rest off his most recent meal. </span></div></div>",
            "created":1387501320,
            "id":1710373,
            "title":"Continue"
        },
        "1211111111":{
            "author_id":"comp234",
            "author_name":"Harry",
            "content":"<div class=\"\"><div> <span>Skyla was pounding at the walls as hard as she could hoping to stir her captor, but her actions stop when she heard Goodra sleeping.<br>\r\n He had a smile when she was struggling but it turned into a frown, he then lifted his hand and punched his gut. Skyla then returned to struggling <br>\r\nMaking the Goodra smile again he shifted onto his back and rubbed his belly. Skyla was starting to lose energy very fast, every movement just made more hot ooze seep through the walls and onto her already covered skin. <br>\r\nIn about 10 minutes Skyla gave up she wasn't getting out and moving made it worse, she was a cute and delicious meal to Goodra <br>\r\nShe too fell asleep as the goo filled the stomach digesting her body.<br>\r\nNext morning Goodra woke up and smiled deviously, another easy prey to add to his already massive belly and he didn't have to do much to get her!  Goodra walked off somewhere to find trainers too eat. </span></div></div>",
            "created":1387506840,
            "id":1710409,
            "title":"A Gooey End"
        },
        "1213":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "Eat her",
                "play with her",
                "stand next to her"
            ],
            "content":"<div class=\"\"><div> <span>Skyla raises her hand and closes her eyes in a hope that someone or a pokemon saves her but just as all hope was lost she felt a rope on her fingers! She quickly opens her eyes and sees a hiker with a Aurorus next to him pulling on the rope. She made it out of the mud, a big sigh of relief came out of Skyla.<br>\r\n\"Thank you for saving me\" Skyla saw the hiker was well packed, probably on a big journey.<br>\r\n\"Oh it's nothing may I ask why you were in the mud it's not safe without proper equipment\" The hiker was concerned<br>\r\n\"I-I just wanted to explore\" Skyla looked down sad. The hiker sighed and walked up to her<br>\r\n\"I'm just telling you cause it's pretty obvious you aren't from Kalos other wise you wouldn't be in the mud\"<br>\r\n\"Whats so dangerous about it?\" Skyla was interested but scared to know  <br>\r\n\"There's recently been reports of pokemon eating trainers that are lost or stuck in the mud, there's a certain Goodra that started this whole thing and lots of trainers fell victim to him, you should be glad that didn't happen\" the hiker smiled then he shot up<br>\r\n\"Oh no I forgot I had something to do at my place!\" the hiker ran back in forth <br>\r\n\"What is it!\" <br>\r\n\"Not enough time please look after my Aurorus while I'm gone everything you need is in this bag, Bye!\" and just like that he was gone. <br>\r\nSkyla scratched her head in confusion, it's weird he would leave his pokemon behind <br>\r\nAurorus saw it's trainer run, it then looked down toward Skyla who was opening pocket's to see what's inside the bag.<br>\r\nWhat should Aurorus do with Skyla?</span></div></div>",
            "created":1387929840,
            "id":1713140,
            "title":"Random rope appears!"
        },
        "13":{
            "author_id":"uninspiredname",
            "author_name":"Rathe",
            "choices":[
                "Skyla's pockets are weighing down her plane. Shopping spree!",
                "She gets lost in a labyrinth of grimy back alleys",
                "Being a flying-type trainer, she feels at home on the rooftops",
                "She visits an eye-catching, bright-red cafe, \"Cafe Lysandre\"",
                "She asks a random person on the street for advice"
            ],
            "content":"<div class=\"\"><div> <span>Skyla, feeling indecisive, settles on the first thing she sees - which is, naturally, the enormous city right in the middle of the Kalos region. Seeing a flat area nearby that would suffice as a landing strip, she almost feels like her decision is being made for her!<br>\r\n<br>\r\nIn her excitement to explore, the red-headed gym leader angles her plane at a sharp angle, nearly nose-diving towards her destination. At the last moment, she tugs on the controls, and her small biplane levels out, the aircraft coasting on its wheels for several hundred feet before rolling to a stop. Eager to be on her way, Skyla leaps out of her seat and starts adventuring, the propellor on her plane still spinning.<br>\r\n<br>\r\nHer destination?</span></div></div>",
            "created":1386441900,
            "id":1704551,
            "title":"Lumiose City, a circular metropolis bustling wi..."
        },
        "14":{
            "author_id":"comp234",
            "author_name":"Harry",
            "choices":[
                "go in the snow mountain",
                "go to the volcano",
                "go into the mines"
            ],
            "content":"<div class=\"\"><div> <span>the first thing that caught Skyla's eyes was a mountain covered in snow that looked so pretty and also fun to explore. She got off her plane and saw the mouth of the cave. it looked dark in there, she turned her head to see a volcano that wasnt all that far off, probably can walk there <br>\r\nalso was a mine, mostly likely abandoned. where should she go? </span></div></div>",
            "created":1388634480,
            "id":1719436,
            "title":"A snow-covered mountain range dotted with caves..."
        }
    },
    "info":{
        "author_id":"uninspiredname",
        "author_name":"Rathe",
        "brief_description":"The female gym leader from Black/White(2) makes an irresistible treat for hungry Pokemon~",
        "created":1386436500,
        "description":"<td align=\"left\" class=\"norm\">For those of you who don't know her already, meet Skyla:<br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://bulbapedia.bulbagarden.net/wiki/Skyla\" target=\"_blank\">http://bulbapedia.bulbagarden.net/wiki/Skyla</a><br>\r\n<br>\r\nNothing grandiose here, just a vore story I'll update in my spare time. Feel free to add to it, should you feel inclined!<br>\r\n<br>\r\nAs far as rules go, there aren't really any. The only thing I ask is that you keep Skyla as prey, and leave the eating to the Pokemon.<br>\r\n<br>\r\n<b>Shout-out to my anonymous GP donator. You're amazing, whoever you are!<br>\r\n</b><br>\r\nEnjoy~</td>",
        "id":1965974,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1388634480,
        "modified":1388634480,
        "pretty_title":"Pokemon Vore: Skyla Vs Kalos"
    }
}