{
    "chapters":{
        "1":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "Head towards the couch.",
                "Run into another room."
            ],
            "content":"<div class=\"\"><div> <span>Where am I? How did I even get here? The last thing I remember was walking around town and then.....nothing. Woah, everything is so big! what kind of a place is this! Am I still dreaming? When did I even go to sleep? Agh, no reason to worry about this right now I probably am dreaming. Lets see, where do I go? It looks like I'm in a living room, but everything is huge.</span></div></div>",
            "created":1367384400,
            "id":1582533,
            "title":"Waking Up"
        },
        "11":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She see's you",
                "She doesn't see you"
            ],
            "content":"<div class=\"\"><div> <span>The couch looks like a good place to be. Why not, might as well relax in this dream. I've never been so aware before while dreaming. I think I read about this online, it was called lucid dreaming. I always heard stories about people training to be able to do something like this. Hah! I didn't even have to try!<br>\r\n<br>\r\nAlright here's the couch, it is absolutely massive. Looks like I can climb up using some of the fibers since they're so huge. I must be like 1 inch tall at most. This is taking forever and I'm getting worn out for some reason even though this is a dream. Price to pay I guess for being lucid.<br>\r\n<br>\r\nPhew! Finally made it, and in record time it only took 40 minutes. I should train to be a rock climber when I wake up. Wait, what is this a dream earthquake? No, that's footsteps, guess I'm not alone in this dream. This should be interesting. <br>\r\n<br>\r\nHey I recognize her! That's Megan! I guess my mind knows I have a crush on her real bad. I wonder if dream Megan will notice me.</span></div></div>",
            "created":1367384400,
            "id":1582539,
            "title":"Head towards the couch."
        },
        "111":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She wants to help",
                "She has other plans"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"There's no way a bug can look that similar to a person. What are you? Wait a second, I know you!\"<br>\r\n<br>\r\nOh yeah she can see me all right, wonder what she's gonna do?</span></div></span></div>",
            "created":1368686460,
            "id":1590889,
            "title":"She see's you"
        },
        "1112":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She picks you up",
                "She throws you on the floor.",
                "She sits down on top of you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No one really knows you're here, so no one would....well....know what could possibly happen to you.\"<br>\r\n<br>\r\nWhat is she talking about?</span></div></span></div>",
            "created":1368686580,
            "id":1590890,
            "title":"She has other plans"
        },
        "11121":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She enjoys the rest of her snack",
                "She has a new plan"
            ],
            "content":"<div class=\"\"><div> <span>\"I was actually just about to go out for lunch, but it looks like I can stay in today and have a little snack\"<br>\r\n<br>\r\nWell this doesn't sound good, good thing this is only a dream.<br>\r\n<br>\r\n\"I'll start at the legs\"<br>\r\n<br>\r\nSounds hot AWWWHHAA she bit my leg off! This is actually painful! Maybe this isn't a dream.</span></div></div>",
            "created":1368686700,
            "id":1590892,
            "title":"She picks you up"
        },
        "111211":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "content":"<div class=\"\"><div> <span>Okay, no, this isn't a dream. WAIT A SECOND! IF THIS ISN'T A DREAM THEN I'M REALLY BEING EATEN RIGHT NOW!<br>\r\n<br>\r\nCRAZY BITCH LET ME GO!<br>\r\n<br>\r\n\"You're not bad, wish I had more tiny people. Crunchy leg.\"<br>\r\n<br>\r\nNoooo! She's about to put the rest of me into that death trap! <br>\r\n<br>\r\nEwwww, it's slimy and warm in here, I can't move her tongue keeps pushing me. No! Please just chew me don;t swallow he whole!<br>\r\n<br>\r\n\"Down you go!\"<br>\r\n<br>\r\nAHHHHH *splash!* Ouch! Stomach acid is really strong, this is going to kill me!  I can barely even breath in here.<br>\r\n<br>\r\n<b>After 45 minutes your drift off into the afterlife inside of the belly of your crush. If only you realized it wasn't a dream sooner</b><br>\r\n<br>\r\n</span></div></div>",
            "created":1368687060,
            "id":1590893,
            "title":"She enjoys the rest of her snack"
        },
        "111212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "You do it - she's your crush, after all",
                "You don't want to do it",
                "You don't want to do it, but you do it anyway because you're scared"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Actually, my feet ache! Think you can rub them for me?</span></div></span></div>",
            "created":1403559540,
            "id":1816552,
            "title":"She has a new plan"
        },
        "1112121":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "somehow she is pleased",
                "you are doing it wrong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megan's already big feet were even bigger now. She was a \"modest\" size 12 and half but that just made her more appealing.<br>\r\nYou decide to rub those the best you could but it was like trying to rub a big wall...</span></div></span></div>",
            "created":1517455800,
            "id":2447744,
            "title":"You do it - she's your crush, after all"
        },
        "11122":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Play cat and mouse",
                "Get you to work on my feet!"
            ],
            "content":"<div class=\"\"><div> <span>You are suddenly falling down towards the carpet.  You become entirely disoriented as you tumble through the air, and land painfully on the ground.  Thankfully its carpet, so though you're bruised, you are still alive.  As you get your bearings, you notice a rank, musky smell around you.  As you look up you see two towering monoliths rising into the sky.  It wasn't until you looked from side to side that you realized you had landed right between her legs.  She was wearing a pair of well used converse sneakers, which seemed rather worn down.  You see her head hovering over you from high above as she checked on you, and smirked.  \"That's right, no one even knows you're here now.  I suppose I could have a bit of fun, and no one would ever be the wiser.  Good thing, too.  I have been looking for ways to burn off some steam.\"  You gag as the smell intensifies.  You looked to either side and see that she was kicking off her shoes to reveal her bare feet.  Dirt caked her soles, gathered from the ratty insoles of her Converse sneakers over the years.  Her toes flexed as he looked at you with anticipation.  \"How about we...\"</span></div></div>",
            "created":1433523660,
            "id":1988178,
            "title":"Down You Go"
        },
        "11123":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "She fart",
                "She starts watching television."
            ],
            "content":"<div class=\"\"><div> <span>Megan sits on you, you look scared for a giant butt approaching, you think it's just a dream. Even then you shout: No !!! PUFFFFFF. An immense pressure flattens you and kneads like paper, your whole body is sore and motionless. That's when you realize: It's not a dream, Socorro !!!! It was very hot and stuffy, I could not breathe. Megan then</span></div></div>",
            "created":1491481380,
            "id":2300641,
            "title":"She sits down on top of you"
        },
        "112":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She gets up",
                "She stays seated"
            ],
            "content":"<div class=\"\"><div> <span>Looks like she can't see me. Oh well, I guess I can't control my dream. She's grabbing a remote it looks like, and she's heading right towards me. I guess she's going to watch TV.<br>\r\n<br>\r\nOh crap, she's right above me. I swear if she sits on me.....wait a second. I'm dreaming! This is going to be great! Bring on the booty!<br>\r\n<br>\r\nOomph! Ok this isn't as pleasant as I had hoped. This is actually really painful, ow. I can't feel anything anymore, this dream is becoming too real for me right now. yeah, I can't take this it's time to wake up. Come on......wake up! I'm starting to think this isn't a dream anymore.</span></div></div>",
            "created":1367384400,
            "id":1582543,
            "title":"She doesn't see you"
        },
        "1121":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "Follow her",
                "Stay on the couch"
            ],
            "content":"<div class=\"\"><div> <span>Oh sweet fresh air! Sorta.....well it's better than what I was breathing. She's finally up, and now that I'm pretty positive this isn't a dream anymore I really need to figure out what's going on here. Looks like she's going into the other room, maybe I should follow her and try to get her attention.</span></div></div>",
            "created":1367547240,
            "id":1583145,
            "title":"She gets up"
        },
        "11211":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She sees you",
                "She doesn't see you"
            ],
            "content":"<div class=\"\"><div> <span>Yeah I really need to see if she can help me, but I need to be careful and make sure she doesn't hurt me again. So how should I go about getting off of this couch? Pretty high up but since the floor is carpeted I think I can survive the fall.<br>\r\n<br>\r\nYep! Made it! Not even slightly injured, now to try to catch up to her. Looks like she went into the kitchen, probably getting a snack. Ok there's a table here I can try and climb up on to get her attention. It's better than being on the floor where she can step on me.<br>\r\n<br>\r\nGetting up on top of this tale is pretty difficult, harder than getting up the couch. I could jump over to that chair over there, but I'm not risking that again after my last experience.<br>\r\n<br>\r\nMade it, now to get her attention. I'll just wave my arms and jump. hopefully she'll see me.</span></div></div>",
            "created":1367547540,
            "id":1583146,
            "title":"Follow her"
        },
        "112112":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She Sits the Bowl Down and Goes Away",
                "She Sits Down With the Bowl and Begins Eating"
            ],
            "content":"<div class=\"\"><div> <span>Crap! She can't see me and it looks like she's almost done making..... whatever she's making. Looks like macaroni and cheese.....looks good. Bah! I cant think about food right now I have to get her attention! <br>\r\n<br>\r\n*CLANK* AHH! She almost sat the bowl right on top of me! Ok, my stomach is growling and I really need my energy to keep going so I guess I could take a bite or two of her mac and cheese. now to climb the bowl, never thought how much climbing insects have to do to get where they want....ugh.<br>\r\n<br>\r\nOWWW it's hot! Really hot! This was a bad idea. I gotta get out of here I can't even eat this it's so hot. Uh oh...crap. She's picked up the bowl and looks like she's going back to the couch. I can't stay in here! She'll eat me!<br>\r\n<br>\r\nHow did I ever think I could get out of a bowl!</span></div></div>",
            "created":1367547900,
            "id":1583148,
            "title":"She doesn't see you"
        },
        "1121122":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "Hop on the fork",
                "Stay still"
            ],
            "content":"<div class=\"\"><div> <span>Oh crap crap crap! She's about to start eating and I don't think she realizes I'm in here. I just have to get her attention some how. Ok, this could be risky but I think the only way she'll notice me is if I hop on to her fork when she's eating and jump on to her face. How could she not notice her food jumping at her?<br>\r\n<br>\r\n</span></div></div>",
            "created":1367548020,
            "id":1583149,
            "title":"She Sits Down With the Bowl and Begins Eating"
        },
        "11211221":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She gets you",
                "You get out of the way."
            ],
            "content":"<div class=\"\"><div> <span>I really see no other option right now since I'll be getting on her fork one or another. I'll give it a shot....but if I fail. No, I can't think about that.<br>\r\n<br>\r\nOk, I got on! Now to jump on to her face HAH! made it! Just in time too, one second later I would have been chewed to bits. I'm right above her lip so I should be able to.... oh no, I think she noticed me but she still thinks I'm food! Here comes her tongue!</span></div></div>",
            "created":1367548200,
            "id":1583150,
            "title":"Hop on the fork"
        },
        "112112211":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "Bang on the walls of her stomach",
                "Move around as much as you can"
            ],
            "content":"<div class=\"\"><div> <span>Nooooo! This can't be happening right now! Her tongue, I can't get off of it! I'm sticking to her saliva! Oh no! NO! NO! NOOO!<br>\r\n<br>\r\nIt's so wet and dark I can't see AHH! her teeth! They'r so big! They almost got me! If I can hide under her tongue maybe she won't notice me. Nope she knows! I'm the only thing in here now she can certainly feel me! I'm just that little piece of food stuck in her mouth now.<br>\r\n<br>\r\nI can't even move, her saliva is so thick and it's all over me. I can feel her tongue pushing me back, I still can't see anything though. UGHH! AHHHHH! NO SHE SWALLOWED ME!!!<br>\r\n<br>\r\nHer muscles are forcing me down into her stomach! There's no going back now! <br>\r\n<br>\r\n*SPLASH* Ewwwww, it's so disgusting in here. It's hot and the stench is unbearable, everything she ate and AHH OWW! Stomach acid! It burns really bad! i can;t stay in here much longer I'll be dead within minutes the way her stomach is starting to churn! <br>\r\n<br>\r\nMy only chance is to try and make her throw me up! I have to try!<br>\r\n<br>\r\n</span></div></div>",
            "created":1367548560,
            "id":1583153,
            "title":"She gets you"
        },
        "1121122111":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "content":"<div class=\"\"><div> <span>If I hit her stomach maybe she will get sick and throw me up. Come on! Throw up dammit! COME ON!<br>\r\n<br>\r\nIt's no use, nothings going to change she cant even feel me in here. I might as well just accept my fate, never though it would end like this.<br>\r\n<br>\r\n-After another 30 minutes you get completely digested by her stomach acids. Megan lets out a little burp after she's finished her snack, never knowing the secret ingredient, you.-</span></div></div>",
            "created":1367548860,
            "id":1583160,
            "title":"Bang on the walls of her stomach"
        },
        "1122":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "choices":[
                "She readjusts herself",
                "She gets up"
            ],
            "content":"<div class=\"\"><div> <span>This is certainly not a dream. This is actually happening right now. The pain, smell, pressure, everything. I can feel everything, not a dream. I....I can't believe this. How, how could this happen? I can't move, there's no way out. I think....I think this might be the end.</span></div></div>",
            "created":1367384400,
            "id":1582545,
            "title":"She stays seated"
        },
        "11221":{
            "author_id":"bonebrood",
            "author_name":"BoneB",
            "content":"<div class=\"\"><div> <span>AGH!!!! She's twisting! This is excruciating! Please stop this Megan! Please!<br>\r\n<br>\r\nShe can't hear me and I can;t get her attention. She just keeps twisting her butt, trying to get comfortable while I'm here dying.<br>\r\n<br>\r\n*POP* AGH!!!AAH!! My bones! She broke something! Everything hurts so much! I'm losing air too, I can't stay under her much longer! <br>\r\n<br>\r\n-Megan finally stands up and sits right back down on the couch to get more comfortable, ending your life with the extreme amount of pressure. She never notices you and you forever stay a little red stain on her couch. If only you had realized it wasn't a dream sooner.-</span></div></div>",
            "created":1367384400,
            "id":1582548,
            "title":"She readjusts herself"
        }
    },
    "info":{
        "author_id":"bonebrood",
        "author_name":"BoneB",
        "brief_description":"An interactive story following the journey of  shrunken man.",
        "created":1367459520,
        "description":"<td align=\"left\" class=\"norm\">feel free to add to the story in whatever way you please. Just keep it PG-13!</td>",
        "id":1931456,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1517455800,
        "modified":1517455800,
        "pretty_title":"Small Decisions"
    }
}