{
    "chapters":{
        "1":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "I'm planning to attend U.A",
                "I'm the only one with this quirk in my family",
                "My Dad is a Pro-Hero",
                "I'm moving to Japan ",
                "I'm a villian in training"
            ],
            "content":"<div class=\"\"><div> <span>In the present day, humans all around the world had developed super human abilities. These powers are called quirks, and they ranged from strong to weak. <br>\r\n<br>\r\nYour quirk was one that affected your life and has not done much in aiding your desire to be a hero. The power you posses allows you to shrink your body down to the size of a bug, along with it comes durability and the power to regenerate.<br>\r\n<br>\r\nThis just gave bullies and even cruel adults more of an excuse to torture you when shrunk.<br>\r\n<br>\r\n●●●●●●●●●●●●●●●●●<br>\r\n<br>\r\nNow then in this super human world, what exact role do you play with your quirk?</span></div></div>",
            "created":1533099600,
            "id":2527550,
            "title":"Your Quirk"
        },
        "11":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "In junior high",
                "At Katsuki's",
                "At Izuku's ",
                "Offering some worship for pay",
                "At home"
            ],
            "content":"<div class=\"\"><div> <span>Tetsuya Hima was someone small, who could have a big presence. With a shrinking quirk and a loud personality it was to be expected.<br>\r\n<br>\r\nThe boy grew up with one parent, due to adoption. His father Ginku was a tank of a man, being 6'8 and having very large muscles with a tuff of blond hair on top. Most of his memories with Ginku involved him nuzzled between his pecs or laying on any part of his body. Sometimes beneath his firm glutes, which his father claims is accidental despite humming in pleasure when Tetsuya is shoved in between his cheeks.<br>\r\n<br>\r\nGrowing up in this lifestyle has shifted Tetsuya's personality. He has a... let's not call it an addiction but a obsession with muscled males. This is what propelled his relationship with Izuku Midoriya and Katsuki Bakugou. <br>\r\n<br>\r\nWhile his father was for the most part cautious around him, Bakugou didn't waste a second in letting Tetsuya know who's boss. From stomping, sitting, and squeezing him the ash blond didn't spare any relief when Tetsuya used his quirk, and the tiny loved every second of it. <br>\r\n<br>\r\nThe tiny boy had masochist tendencies and having a cocky and explosive bully torment him was a dream come true. Tetsuya had tried to get Izuku involved but the freckled boy always became flustered and refused.<br>\r\n<br>\r\nTetsuya wished he could make a career in heroics using his quirk. Bakugou had said he should offer his services for pay, saying \"anyone would pay a fuckton of cash to feel someone beneath them!\"<br>\r\n<br>\r\nGetting a spot in U.A was a chance to make this possible. Graduating would give him all the credit he needed to start a business in catering to that desire. It put a stupid grin on his face, imagining himself worshipping All Might or maybe being dominated by Endeavor. <br>\r\n<br>\r\nHe would get into U.A. All those fantasies would come true.<br>\r\n<br>\r\n°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°° °<br>\r\nSo where is Tetsuya now?</span></div></div>",
            "created":1538110800,
            "id":2555360,
            "title":"I'm planning to attend U.A"
        },
        "114":{
            "choices":[
                "A Pro Hero",
                "A Student",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it?</span></div></span></div>",
            "created":1541912400,
            "id":2576431,
            "title":"Offering some worship for pay"
        },
        "1142":{
            "author_id":"zachy2018",
            "author_name":"CountDugula",
            "choices":[
                "Izuku!",
                "Kirishima!",
                "Kaminari!"
            ],
            "content":"<div class=\"\"><div> <span>Tetsuya Hima was officially a U.A. student..and currently employed after school-hours by said establishment. It was a dream job really, he got paid to make the tired students and faculty 'feel good'. Massages, spa treatments, letting the giants take out their stresses and frustrations out on a helpless tiny. Yup! The tiny-quirk user couldn't have been happier with the set up.<br>\r\n<br>\r\nIt had been a bit of a chore going through the necessary paperwork to set an unused room up as basically a 'Massage Parlor with Benefit's. But in Tetsuya's opinion that was all worth it in the end, what's a hand cramp or two when you get to service studs and hot students!?<br>\r\n<br>\r\nWhen they chose their hero names in class one day, Tetsuya received enthusiastic applause when he revealed his hero name of 'Doctor Feelgood'. <br>\r\n<br>\r\n\"Huh....like the song.\" Jiro caught on to the reference...obviously.<br>\r\n<br>\r\nNow, it was Tetsuya's favorite part of the day...AFTER school! <br>\r\n<br>\r\nThe Heights Alliance dorms now allowed for Tetsuya to make 'house calls' too! Nothing like being dominated in an environment where the giant was comfortable.<br>\r\n<br>\r\nIn fact, he was making one of them just now! The normal sized lad had a dorm room of course, but he was usually so busy with requests for service that he wasn't really in there much other than to sleep. <br>\r\n<br>\r\nLooking at a list, Tetsuya hummed. \"Let's see...tonight is Denki Kaminari, Eijiro Kirishima aaand....whoa...Izuku Midoriya?\" <br>\r\n<br>\r\nIzuku had never made an appointment with Tetsuya, much to the boy's disappointment...the kid was just waay too shy. <br>\r\n<br>\r\nMaybe the greenette had had a particularly rough day or something?<br>\r\n<br>\r\n\"Talk about a dream come true..his feet are HUGE and he's worked himself up a killer bod!\" Tetsuya drooled a bit.<br>\r\n<br>\r\nBut who to see first..?</span></div></div>",
            "created":1559358000,
            "id":2667332,
            "title":"U.A.'s Dr. Feelgood"
        },
        "11421":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "A nice foot rub",
                "A round of stomping ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Tetsuya happy strolled through the halls of the dorms, feeling giddy and blessed that his shy childhood made a appointment with him.<br>\r\n<br>\r\nIzuku Midoriya was meanwhile sitting on his bed, nervously swaying his socked feet back and forth. Tetsuya would be arriving soon and the boy would be before his large feet tiny.<br>\r\n<br>\r\nHe had been training all week, jogging every morning had made his plump soles feel rather sore. Izuku had remembered Bakugou bragging about how good it felt to have their childhood friend beneath him, so finally putting aside his embarrassment Izuku booked a House call with Tetsuya.<br>\r\n<br>\r\n\"Oh no I should change my socks!\", Izuku suddenly stood up as he thought of the damp cloth holding his sweaty feet.<br>\r\n<br>\r\nIt was too late however as a knock came from Izuku's door. The freckled boy tried to shake off his flush as he walked and heard squishing sounds from his soles. Opening the door, Izuku found Tetsuya with starry eyes as he greeted him.<br>\r\n<br>\r\n\"You called~\", Tetsuya grinned as he strolled in.<br>\r\n<br>\r\nIzuku began mumbling. \"T-tetsuya I think I'm fine actually! I wouldn't want you to smell my feet...\"<br>\r\n<br>\r\nTurning around, Izuku gasped in surprise as he couldn't find his friend. What he didn't know was that Tetsuya had already shrunk and was looking up in awe at the looming Izuku.<br>\r\n<br>\r\nHe eagerly drooled as the ground shook under the large socked feet, the bittersweet hit his nostrils and he grinned as the giant foot hovered over. <br>\r\n<br>\r\n<b>SMOOSH</b><br>\r\n<br>\r\nTetsuya giggled as the plump damp sole squished him to the ground. He knew Izuku would try and cancel his appointment so he was going sneak him stepping on him.<br>\r\n<br>\r\nThe tiny grinned as the chessy foot put all of its plump weight on him. The next step is getting Izuku to let him pamper the soles unclothed. But first, Izuku had to find him.<br>\r\n<br>\r\nIzuku was beyond confused as he walked around his room looking for Tetsuya. The boy probably shrunk and hit like always, but Izuku couldn't spot any scurrying figures. <br>\r\n<br>\r\n\"Wait....oh shoot!\", Izuku flexed his squishy soles and sure enough he felt a pebble like object imbedded in, shaped like a human body.<br>\r\n<br>\r\nQuickly sitting on his bed, Izuku put his hand on his knee and sure enough he spotted Tetsuya grinning widely as he was pressed into his smelly sole.<br>\r\n<br>\r\n\"Ah Tetsuya I'm sorry!\", Izuku quickly pulled Tetsuya out held him in his cuffed palms.<br>\r\n<br>\r\nThe tiny however held up a finger. \"That wasn't accidental Izuku, tell me how did I feel under there?\"<br>\r\n<br>\r\nIzuku blushed and looked away. \"I um no...it did feel nice stepping on you...\"<br>\r\n<br>\r\nTetsuya grinned. \"That's it! Now onto step 2, I want you to release though mighty feet!\" <br>\r\n<br>\r\nThe giant sighed as he couldn't help but feel incline to do the action. Setting Tetsuya on his firm thigh, Izuku reached down and grabbed the hems of his socks.<br>\r\n<br>\r\nTetsuya watched in amazement as it took some effort to peel the stinky socks of the large feet. A chessy odor soon came off of the large feet.<br>\r\n<br>\r\nIzuku smiled slightly through his blush. \"S-sorry about the smell, I didn't think of washing up before your visit.\"<br>\r\n<br>\r\nThe tiny shook his head and started sliding down the sweatpant clad leg feeling the toned muscle beneath. Tetsuya hummed as he walked around and looked up at the towering plump soles.<br>\r\n<br>\r\n\"These are some good feet Izuku, and I know how we can help you relax!\"<br>\r\n<br>\r\nWhat was first?</span></div></div>",
            "created":1559360580,
            "id":2667349,
            "title":"Izuku!"
        },
        "115":{
            "choices":[
                "Izuku",
                "Bakugo",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Tetsuya was at his house, watching TV as he sat with a bored look on his face.<br>\r\n<br>\r\n\"Man, what I wouldn't do to be servicing some giant hunk right now...\" He sighed, imagining a hot giant looming above him, with his bare toes wiggling above his small form.<br>\r\n<br>\r\nTetsuya smirked and was getting lost in his fantasies when his doorbell rang.<br>\r\n<br>\r\n\"Ugh, who could that be?\" He asked, slightly annoyed that his daydream had been interrupted.<br>\r\n<br>\r\nOpening the door, it was...</span></div></div>",
            "created":1539925200,
            "id":2566024,
            "title":"At home"
        },
        "1152":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "\"You give me a footrub.\"",
                "\"You worship my body.\"",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Opening the door, Tetsuya's eyes widened as he saw it was his friend (and go to giant) Katsuki Bakugo.<br>\r\n<br>\r\n\"Oh hey Katsuki!\", he enthusiastically greeted.<br>\r\n<br>\r\nBakugo had on a cocky grin as he saw his friend (and favorite worshipper). \"What's up bug?\"<br>\r\n<br>\r\nTetsuya on the outside simply grinned, but on the inside his thoughts were screaming. 'AH! THANK YOU KAMI-SAMA!'<br>\r\n<br>\r\nHe invited his friend in and closed the door behind him. Just as Tetsuya turned around, a hand landed next to his head on the door. Bakugo leaned closed to his body with a toothy smirk on his face. The heat from his body made Tetsuya start to shake.<br>\r\n<br>\r\n\"Ya know bug, i think you look really good small.\", Bakugo brought his lips to his friend's ear. \"Shrink for me would ya?\"<br>\r\n<br>\r\nA deep blush covered his face as Tetsuya nodded. The boy began to dwindle in size, watching the familiar site of someone's body towering over you. He finally stopped at an inch between Bakugo large socked feet. The blond squatted down and grinned cocky. \"Hn, just the size that i like!\"<br>\r\n<br>\r\nBakugo reached down and wrapped Tetsuya in a fist, before standing up. The salty smell of Bakugo's palm sweat inflitrated his nose, Testuya eagerly sniffed it as it was one of the many smells he was honored with.<br>\r\n<br>\r\nThe blond walked over to his couch, picking up the remote before sitting down. Bakugo looked down at Tetsuya with that hot smirk.<br>\r\n<br>\r\n\"So bug, how about......</span></div></div>",
            "created":1540011600,
            "id":2566420,
            "title":"His Favorite Giant"
        },
        "1153":{
            "choices":[
                "Tenya",
                "Kirishima",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could be visiting?</span></div></span></div>",
            "created":1540011600,
            "id":2566484,
            "title":"Someone else"
        },
        "12":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Midoriya ",
                "Todoroki ",
                "Bakugou",
                "Kirishima ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>Most quirks were passed down from parent to child. Sometimes they received one power, but in rare cases the child inherits both quirks.<br>\r\n<br>\r\nYou were considered an oddity as your quirk had no relation to your parents what's so ever. Most would assume it came from a distant relative, while others believed it may have been a curse.<br>\r\n<br>\r\nNow then, what is your surname? What family do you belong too?</span></div></div>",
            "created":1533099600,
            "id":2527552,
            "title":"I'm the only one with this quirk in my family"
        },
        "121":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "In junior high",
                "In U.A high school",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Izumi Midoriya, younger twin brother to Izuku Midoriya.<br>\r\n<br>\r\nYou were very close to your family. You and Izuku were inseparable and would play together, saving your mother from \"villians\". The both of you couldn't wait to get your quirks, and it was you who first developed it.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~<br>\r\nIzuku opened his eyes before sitting up and rubbing them. Getting out of bed, he walked over to his brother's bed. \"Izumi wake up we have to get ready for school.\"<br>\r\n<br>\r\nPulling back the covers, Izuku found you but was shocked. In the center of your bed you slept curled up. At one inch tall! <br>\r\n<br>\r\nWaking up to your brother, now a giant. You immediately began to freak out, and it took a few minutes to calm down. You later were brought to the doctor to confirm that you shrinking was your quirk. <br>\r\n<br>\r\nAlthough excited, you soon realized your quirk wasn't something to be happy about. It was hard to control your power as sneezing, being surprised, and even day dreaming activated your quirk. Due to this, Izuku often accompanied you wherever you went.<br>\r\n<br>\r\nYou felt guilty having this quirk, when you found out Izuku was quirkless. You wondered why you had this power and your brother got nothing.<br>\r\n~~~~~~~~~~~~~~~~~~~~~<br>\r\nYou can still remember the worst day of your life. It began when you told Izuku to go on ahead of you to school. When you arrived at school, you sneezed causing your quirk to activate.<br>\r\n<br>\r\nThis caused you to arrive at class late. Luckily your teacher spotted you, but scolded you for being late. You sat on Izuku's desk the rest of the period and by the end he had to use the restroom. While gone, Bakugou the bully of you and your brother decide to give you some \"punishment\" for your tardiness. He put you on his seat and sat on you, crushing your body beneath his muscular cheeks.<br>\r\n<br>\r\nEventually he released you, but not before passing a little gas and smirking while thanking you for \"being a good cushion\". <br>\r\n<br>\r\nYou soon regained size and was able to walk home with your brother, but couldn't get the feeling and smell of Bakugou's ass out of your head.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nNow then, where exactly are you?</span></div></div>",
            "created":1533186000,
            "id":2527953,
            "title":"Midoriya "
        },
        "1212":{
            "author_id":"zachy2018",
            "author_name":"CountDugula",
            "choices":[
                "Skip ahead to their first day!",
                "Time to celebrate!",
                "Something else happens?"
            ],
            "content":"<div class=\"\"><div> <span><b>\"No, I honestly don't think you can be a hero without a quirk.\"</b> All-Might's words still rang in Izuku's head as he held his notebook and sniffled. Izumi and Izuku had been saved by the #1 hero All-Might from the sludge villain, and Izuku being the fanboy he was...hitched a ride with All-Might as the hero leaped through the air...Izumi hanging on for dear life to his older brother's messy hair.<br>\r\n<br>\r\nSeeing All-Might reduced to the frail skinny form was a shocker for sure, but it was nothing compared to how his older brother had his hopes shot down by his idol.<br>\r\n<br>\r\nNow, Izuku was wiping away tears with a look of devastation on his face, Izumi sitting on his head at a tiny size..unsure of what to say except offer encouragement. <br>\r\n<br>\r\n\"You know...there's nothing that really says you CAN'T become a hero without a quirk. It's just..there's never been a pro hero without one...you could be the first quirkless pro hero!\" Izumi tried to say cheerfully, not getting a response from his older brother.<br>\r\n<br>\r\n\"Come ooon! You're smart! You could get-\" <br>\r\n<br>\r\nThat was when an explosion was heard around the street corner...and Izuku and Izumi's life changed forever.<br>\r\n<br>\r\n<i>Some time after the U.A. Entrance Exam...</i><br>\r\n<br>\r\nIzumi hadn't been slouching around while his older brother was moving junk on the beach and undergoing brutal training and study to inherit One for All. Izumi had started working out and slowly learning how to meditate and focus to prevent at least some of the unintended shrinking.<br>\r\n<br>\r\nThe shrinking still happened unintentionally sometimes..but the amount of times (such as if he sneezed or daydreamed or anything) that happened was cut drastically. <br>\r\n<br>\r\nIzumi had always been rather durable at a tiny size, how else would he endure such punishment from bullies? But thanks to intense training, he had begun to develop a sort of enhanced strength at a tiny size as well!<br>\r\n<br>\r\nThis made the Entrance Exam for U.A. a hell of a lot more approachable. Izumi currently sat next to Izuku at the dinner table with their mother. Izumi knew that Izuku was starting to lose hope after not hearing from All-Might for so long combined with him blowing the exam.<br>\r\n<br>\r\n\"Izuku? Snap out of it sweetie..\" Inko Midoriya said worriedly about her eldest son. Izuku had been staring at a fish for the past few minutes blankly.<br>\r\n<br>\r\n\"Oh! Sorry...\" Izuku said, but it was clear to Inko and Izumi Midoriya that he wasn't really 'there' so to speak.<br>\r\n<br>\r\nLater, Izuku and Izumi were sitting together on the couch...Izuku looked extremely down in the dumps. \"Y'know...you won't know for sure until your results come in.\" Izumi said. \"Neither of us will....\"<br>\r\n<br>\r\nThe door suddenly burst open and their mother said in a panicked tone: \"T-they're here! Your test results from U.A.!\" She waved an envelope in their faces.<br>\r\n<br>\r\nIzuku and Izumi took the letter to their room and shut the door, their mother paced nervously out in the hall. <br>\r\n<br>\r\nIzuku was staring at the envelope for the longest time, before Izumi spoke up. \"Listen...no matter what happens...we can't give up.\" Izumi nodded firmly at his older brother.<br>\r\n<br>\r\nOpening the envelope, a sort of disc fell out and projected an image of All-Might onto the Midoriya bros. wall! <br>\r\n<br>\r\nAll-Might explained how Izuku passed due to something known as 'Rescue' points...even though he got 0 on combat.<br>\r\n<br>\r\nIzumi got 42 combat points and 0 rescue. Both boys eyes were wide, Izuku's were overflowing with happy tears as All-Might in the recording said: \"You both have made it! Welcome to U.A.!\" </span></div></div>",
            "created":1538802000,
            "id":2560070,
            "title":"In U.A high school"
        },
        "12122":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "At U.A",
                "Meeting with All Might ",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>The two brothers embraced each other, silently enjoying the moment. Izuku's tears continued to fall and Izumi couldn't deny his eyes watered up as well.<br>\r\n<br>\r\nThe younger Midoriya smiled at his brother as they pulled apart. \"Well..we did it.\"<br>\r\n<br>\r\n\"Yeah we did.\"<br>\r\n<br>\r\n\"You know what? Let's celebrate! We're going to U.A and we outta spend our last junior high days full out!\", Izumi said pumping a fist.<br>\r\n<br>\r\nIzuku smiled at his twin's behavior. \"O...ok, I get it. Let's have some fun!\"<br>\r\n<br>\r\n~~~~~~~~~~~~~~~~~~~~<br>\r\nThe fun however, turned out to be the two of them eating some treats thier mom made, while watching the latest hero news. They didn't really have any friends to hang out with (God knows what Bakugo would do, hearing that thier going to U.A).<br>\r\n<br>\r\n\"Hmmm hey Izuku I wanna show you something.\", Izumi said suddenly.<br>\r\n<br>\r\n\"Yeah what is..Izumi?\", Izuku started asking only to stop when his brother suddenly shrank down and stood between his socked feet.<br>\r\n<br>\r\n\"I've been wanting to show you my training and give an example!\" Izuku blinked confused at his tiny brother.<br>\r\n<br>\r\n\"Izuku, I want you to step on me.\"<br>\r\n<br>\r\n\".....eh...EH!\", Izuku yelled surprised at the request. \"W..why would you want me to do that!?\"<br>\r\n<br>\r\nIzumi didn't falter. \"I've trained my strength and body. I'm not only more durable but stronger! I promise I'll be fine, just do it this once please.\"<br>\r\n<br>\r\nIzuku was flustered, but eventually gulped and nooded. The older Midoriya stood up, towering over his brother like a mountain. With a nod from Izumi, Izuku lifted up his right socked footed hovered it over his brother.<br>\r\n<br>\r\nSlowly, Izuku brought his foot down and waited to feel a lump from below. However, his foot stopped suddenly from reaching the floor. Izuku's eyes widened as he realized Izumi was holding his foot up!<br>\r\n<br>\r\nWith a triumphant grin, Izumi lifted his currently giant brother up. Izuku soon stumbled back and fell into his butt with a yelp. He smiled as Izumi grew back and pulled him up.<br>\r\n<br>\r\n\"Wow! So you can retain your strength even at that size?\", Izuku went off on his mumbling as he examined Izumi's quirk. The younger Midoriya simply smiled at his brother's behavior.<br>\r\n<br>\r\nYep this was a nice celebration.<br>\r\n~~~~~~~~~~~~~~~~~~~~~<br>\r\nNow then were are the siblings now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1538974800,
            "id":2560801,
            "title":"Time to celebrate!"
        },
        "121222":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "\"I will see you at U.A!\"",
                "\"How about a little training?\"",
                "Reader's choice "
            ],
            "content":"<div class=\"\"><div> <span>Izuku let out a relieved sigh once he finished his workout.<br>\r\n<br>\r\n\"Ah great work young Midoriya!\", the voice of the frail man he now knew as All Might said approaching.<br>\r\n<br>\r\nIzuku smiled, he had gotten stronger and got into U.A! He a Izumi were both going to be heroes.<br>\r\n<br>\r\nIzuku fondly thought of his brother. Before he received the quirk his brother encouraged him non-stop. He even took the blows from Kacchan, agreeing to shrink for him if Izuku was left alone. Izumi deserved something, for all the encouragement and hours spend in his childhood friend's shoe.<br>\r\n<br>\r\n\"All Might.....could I ask for a small favor?\"<br>\r\n~~~~~~~~~~~~~~~~~~~~~~<br>\r\n\"Izuku it's early, and on top of that a free day!\"<br>\r\n<br>\r\nIzumi dragged his feet as he followed his brother. The sun was just rising and normally the younger twin would still be asleep.<br>\r\n<br>\r\n\"Well you asked about my trainer so I decied to show you!\", Izuku yelled excited as they approached the beach.<br>\r\n<br>\r\nThe twins walked onto the now cleared beach and looked around. \"Huh, could've sworn this place was a dump. So who's this trainer doing suppose to be?\"<br>\r\n<br>\r\n\"Why me of course!\"<br>\r\n<br>\r\nThe familiar voice struck Izumi as he turned around to find the towering stature of All Might! The hero was dressed a coat for the cold weather, but that didn't lessen Izumi's shock.<br>\r\n<br>\r\nJust as the hero approached, the younger twin vanished. The hero looked in confusion as Izuku remained unfazed.<br>\r\n<br>\r\n\"Ah! Sorry...that happens if he get's too excited.\", Izuku rushed as he bent down to pick up his brother.<br>\r\n<br>\r\nOn the ground, Izumi looked up in awe. All Might was now truly a titan of peace, stretching into the heavens with that bright smile. His brother scooped him up and held him out to the number one hero.<br>\r\n<br>\r\n\"Y-ou were training Izuku?!\"<br>\r\n<br>\r\nAll Might let out a deep laugh as he held his palm out to Izuku's. Hesitantly, Izumi walked onto the much larger palm, seeming like a speck in the hero's hand.<br>\r\n<br>\r\n\"Indeed I have! Your brother has displayed the qualities that make a hero. I therefore have decided to help Young Midorya Izuku become strong!\",The hero called out as He brought the tiny to his striking eyes.<br>\r\n<br>\r\n\"I...see.\", Izumi said slowly as he was handed back to his brother.<br>\r\n<br>\r\n\"I was asked by your brother to meet with you. He said you've helped him and that he wanted to repay you, and so he asked me reveal the secret of his training with you!\"<br>\r\n<br>\r\nIzumi looked up at Izuku. The two brothers smiled sincerely at each other.<br>\r\n<br>\r\n\"So then, young Midoriyas......<br>\r\n</span></div></div>",
            "created":1539752400,
            "id":2564818,
            "title":"Meeting with All Might "
        },
        "122":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Try to talk with Shoto",
                "Talk to your father",
                "Go out"
            ],
            "content":"<div class=\"\"><div> <span>The name Todoroki was known by many. All for the same reason. The father Enji Todoroki, was the #2 Pro-Hero. Although a hero, he had motives different then All Might.The man wanted to father a child that was powerful enough to one day surpass All Might.<br>\r\n<br>\r\nThe first child he fathered was you. Your name was Sunō Todoroki and unlike the children that followed, you showed no ice or fire quirk. This was discovered when at age five a servent showed you to Enji, shrunk down to an inch. Rather then comfort you, he grunted and walked away. The next thing he told you was that there would be another sibling.<br>\r\n<br>\r\nAlthough excited, you soon picked up on the reason for the continued arrival of your siblings after your father grunted in disappointment at your third sibling. By the time you turned thirteen the last sibling was born and named Shouta. <br>\r\n<br>\r\nYou spent a lot of time with Shouta as he grew up. You were unable to play with your other siblings, as your quirk activated easily and you wouldn't grow back for some time. Still you liked playing with your brother. You'd shrink down and he \"rescue\" you from his stuffed animals.<br>\r\n<br>\r\nOne day all that changed.<br>\r\n<br>\r\nYou were sitting in Shouta's cupped Palms, listening to him excitingly talk about heroes. Suddenly the door opened and your father walked in. \"Shouto. It's time to train.\"<br>\r\n<br>\r\nYour brother sighed, before placing you gently on the floor. Shouta walked out the door, and just as Enji was about to follow you called out. \"Father!\"<br>\r\n<br>\r\nEnji looked down at you. His eyebrows furrowed as he gave a grunt in response. <br>\r\n<br>\r\n\"Your working Shouta to hard he needs to-\"<br>\r\n<br>\r\nYou were cut off as Enji clenched his teeth and fists. You were shocked as he lifted his slippered foot above your body and stomped down. You cried out in pain as you felt your bones crack. To add insult to injury, Enji lifted his heel up and began grind the front of his shoe. As if he wanted to hear the breaking of your bones.<br>\r\n<br>\r\nFinally lifting his stomper off you, your bones began to heal and shift back to it's original form. Enji folded his arms over his chest and seem to smirk down at you.<br>\r\n<br>\r\n\"Shouta needs to focus on training. Not be bothered by a bug that I should've crushed years ago!\", Enji roared down at you before turning and slamming the door behind him<br>\r\n•••••••••••••••••••••••••â €¢•••••••••••••••••<br>\r\nSince that day, you've been separated from Shouta. You spend your days alone, watching your brother return to his room tired and more stoic. <br>\r\n<br>\r\nWhenever you tried to approach him, your father would catch you and deliver punishment. This included spending the afternoon in his boot and even using you as a seat cushion.<br>\r\n<br>\r\nNow you were living in your broken family, unsure of how everyone would live the rest of their lives. Your siblings were in college, and Shouta was going to U.A high school.<br>\r\n<br>\r\nYou decide to....</span></div></div>",
            "created":1533099600,
            "id":2527578,
            "title":"Todoroki "
        },
        "1221":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Talked about U.A",
                "Heard Enji at the door",
                "Decided to do their own training "
            ],
            "content":"<div class=\"\"><div> <span>Endeavor was out on hero business, Sunō figured now would the best time to try and talk to Shoto. <br>\r\n<br>\r\nOn the way to Shoto's Room, Sunō came across his brother Natsuo. \"Hey Nii-San.\"<br>\r\n<br>\r\n\"Hey Nat-Kun.\" <br>\r\n<br>\r\n\"Where are you going?\", Natsuo asked.<br>\r\n<br>\r\n\"........i'm going to see Shoto.\"<br>\r\n<br>\r\nNatsuo's eyes widened. \"Nii-San, don't you remember what HE did last time?!\". <br>\r\n<br>\r\nSunõ griminced, his punishment last time was Enji sitting on his shrunken form throughout dinner. He ignored your cries and even bounced a few times, subjecting everyone to the sound of your crunching bones. \"I don't care, he can crush me as much as he wants. I want to see my brother!\"<br>\r\n<br>\r\nNatsuo reluctantly nodded, before wishing him luck. Sunõ made his way to the familar door, and taking a breath knocked on the door.<br>\r\n<br>\r\n\"Come in\", a stoic voice called from within. Sunõ prepared himself before entering the room. Walking into the tatami room, he found Shoto sitting at his desk. As the half and half haired boy looked at his brother, he seemed surprised.<br>\r\n<br>\r\n\"Sunõ-kun, what are you doing here?\", Shoto asked in confusion. \"You know HE doesn't like you getting near me.\"<br>\r\n<br>\r\n\"Father is out on business. I took the chance and here I am.\" Walking over to the bed next to the desk, Sunõ sat down smiling at his brother. Shoto held onto his expressionless face. <br>\r\n<br>\r\n\"So you've been excepted into U.A?\"<br>\r\n<br>\r\nNodding, Shoto brought his head down to his lap. \"I got in through a recommendation. I'm going to become a hero, and I'll achieve this using my right side.\" Looking up back up, Shoto was shocked to fight his brother gone.<br>\r\n<br>\r\n\"I'll be rooting for you then!\"<br>\r\n<br>\r\nLooking down Shoto saw Sunõ shrunk between his slippered feet, smiling and waving up at him. \"Sunõ-Kun?\"<br>\r\n<br>\r\n\"You got into U.A! I figured the least I could do was make you the BIG brother!\"<br>\r\n<br>\r\nShoto gave a rare smile before reaching down and cupping Sunõ in his palms, and bringing him to his face. <br>\r\n<br>\r\n\"Thanks. I'm.....glad I got to talk to you again.\" Sunõ walked up to his brother's giant face and embraced his nose. Feeling the familar warmth. <br>\r\n<br>\r\nShoto closed his eyes, enjoying the tender moment. It been so long since he could hang out and talk with Sunõ. All thier Brief meetings ended the same, Enji grabbed Sunõ and all Shoto heard was the loud thumping of his father stomping the floor.<br>\r\n<br>\r\n<br>\r\nSoon they separated and......</span></div></div>",
            "created":1533358800,
            "id":2529127,
            "title":"Try to talk with Shoto"
        },
        "123":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Kaito was applying too",
                "Kaito was going to sneak in",
                "Kaito had a deal with the school"
            ],
            "content":"<div class=\"\"><div> <span>Sibling rivalry couldn't even begin to describe Kaito and Katsuki Bakugou.<br>\r\n<br>\r\nBeing a year older, Katsuki always would speak for his brother and lash out at anyone who got too close. This showed when at age five, when his quirk manifested. He was angry at seeing Kaito an inch tall sitting in Deku's bushy hair smiling. Though this couldn't be helped as he and Izuku became good friends.<br>\r\n<br>\r\nStill as they grew older, Katsuki devolped the typical older sibling bullying. Though with a shrinking quirk and Katsuki being himself, this went to the extreme.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~<br>\r\nPFFFFFFT!<br>\r\n<br>\r\n\"GAH! Katsuki get ofmmmf!\", Kaito's yells were muffled as his brother clenched his ass cheeks.<br>\r\n<br>\r\n\"Ha! What's wrong Kaito I thought you liked spicy curry?\", Katsuki smirked as he squeezed his inch tall brother between his muscular glutes.<br>\r\n<br>\r\nKaito could barely move as the cheeks vibrated and blasted him with more hot, smelly air.<br>\r\n<br>\r\nKatsuki continued to bounce and release gas, silencing his brother and enjoying his pathetic squirming. Finally with one last loud fart. Kaito gave up, and quite literally kissed his brother's ass.<br>\r\n<br>\r\nKatsuki gave a cocky grin triumply at his butt. \"That's right, know your place bug.\"<br>\r\n<br>\r\nKatsuki leaned back, putting his hands behind his head and casually dropping gas on his brother.<br>\r\n<br>\r\n\"I'm still expecting that foot rub later.\"<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nDespite This, Katsuki did still show a secret caring side to his brother.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nKatsuki layed on the couch watching TV. Kaito layed shrunken on his abs, feeling the warm skin and hearing the gurgles from his brother's stomach.<br>\r\n<br>\r\n\"Ne Kaito.\", Katsuki suddenly called.<br>\r\n<br>\r\n\"Huh yeah\"<br>\r\n<br>\r\nKatsuki looked down at his brother with a serious look. \"Don't become a hero.\"<br>\r\n<br>\r\nKaito blinked surprise. \"W-what are you talking about Katsuki?\" <br>\r\n<br>\r\n\"I don't want a damn villian hurting you out there. Becoming a hero isnt a bright future for you.\" <br>\r\n<br>\r\n\"But I can regenerate....i'll be ok.\"<br>\r\n<br>\r\nKatsuki gave an annoyed grunt. \"What the hell do you think a villian will do when he sees you not die? He's gonna fucking lock you up and do weird shit!\"<br>\r\n<br>\r\nKaito brought his face down to his brother's stomach. He hadn't thought of that, he'd figure he and Katsuki would be heroes together.<br>\r\n<br>\r\nHe suddenly felt a large smooth surface rub his head. Looking up, Katsuki was using his thumb to ruffle his hair. He had a calmer look on his face, which was rare.<br>\r\n<br>\r\n\"Look just promise me. I don't want you to get into danger.\"<br>\r\n<br>\r\n\"Ok...i won't become a hero.\"<br>\r\n<br>\r\nNodding his head, Katsuki suddenly smirked. \"Good, now lighten up or I'll sit on ya again!\"<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nKaito went on with his life. Katsuki and Izuku were going to try to get into U.A, while he would be going to normal high school.<br>\r\n<br>\r\nHowever, little did Katsuki know.....</span></div></div>",
            "created":1534741200,
            "id":2536089,
            "title":"Bakugou"
        },
        "124":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Sleeping",
                "At School",
                "Somewhere Else"
            ],
            "content":"<div class=\"\"><div> <span>Hato Kirishima was in a literal sense, a giant.<br>\r\n<br>\r\nThe twenty year old was 7’0, almost as tall as All Might. In addition he had an impressive set of muscles including a six pack and large pecs. His dyed red hair reached his elbows and was usually tied back in a ponytail. <br>\r\n<br>\r\nThe man was the older brother to Eijirou Kirishima, who was practically stuck to his side. Eijirou admired his older brother, wanting to be as strong and manly as him to protect others like he did. Whenever bullies picked on him, Hato would loom over them with a glare and threatened to “crush them” if they didn’t leave Eijirou alone. As Eijirou entered junior high the both of them worked out together, and Hato even dyed his hair red too.<br>\r\n<br>\r\nDespite this, in a ironic twist Hato’s quirk contradicts his appearance as it let’s him shrink. Even with this quirk, Eijirou still admired his brother and continued to work out with him. If anything more routines were created.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nEijirou huffed as he did sit ups, sweat dripped from his body and his muscles pumped. As he worked out, a voice called from between his pecs.<br>\r\n<br>\r\n“Come on Eijirou! You couldn’t crush a grape with this pressure!”<br>\r\n<br>\r\n“Ok Nii-San!”. Eijirou yelled as he increased his speed, pumping his muscles more. Hato simply grinned as the warm pecs squeezed him more. He could take a lot of damage and come out unscathed. This included getting accidentally stomped by his father and pumped by his brother.<br>\r\n<br>\r\n“Alright! Your becoming more manly by the second!”, Hato yelled out.<br>\r\n<br>\r\nEijirou beamed. Hearing his brother’s compliments was one of the best feelings ever.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nDespite Hato's strength, he didn’t consider becoming a Pro-Hero. Being strong couldn’t do much against a powerful quirk, and shrinking wouldn’t give him any advantage. His future came to him when he got an offer to teach at U.A.<br>\r\n<br>\r\nNow in the present, where is Hato?</span></div></div>",
            "created":1533704400,
            "id":2530880,
            "title":"Kirishima "
        },
        "1241":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Hato shrinking",
                "Hato showing off a new trick",
                "A normal workout"
            ],
            "content":"<div class=\"\"><div> <span>The sun rose, starting the day of two brothers. Hato was lying in his bed, with his feet hanging off by a foot. Being big came with some disadvantages such as him being longer then his bed and having to duck in order to enter rooms. <br>\r\n<br>\r\nGetting up and rubbing his eyes, Hato pulled his covers off showing his muscled top and sweatpant clad legs. Pulling his hair back in a bun, he exited his room to his brother's.<br>\r\n<br>\r\nEijirou was still sleeping, having a familar dream. The dream where Hato was an actual titan and Eijirou was a mere speck. He would look up in awe as his brother's firm rear was coming down on him, all while Hato grinned and said to \"use his quirk to the extreme!\"<br>\r\n<br>\r\nHe soon woke up as his brother shook him awake. Opening his eyes, Hato was smiling and telling him to come get breakfest. As Hato walked away, Eijirou couldn't help but wish the dream was real. He got to be a giant to Hato, and wishes it could be the other way around.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nThe two brothers ate breakfast, and prepared for the day. Training would go in a random order, sometimes they jogged but other times they started with some pull ups. Hato would shrink at random and test Eijirou's strength, which included his bicep pumps and stomping force.<br>\r\n<br>\r\nStill, thier workout started by.........</span></div></div>",
            "created":1534050000,
            "id":2532223,
            "title":"Sleeping"
        },
        "12412":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Grinning (he wants to go along with it)",
                "Frowning (he seems hesitant)",
                "Smirking (he's feeling a little mischievous)"
            ],
            "content":"<div class=\"\"><div> <span>The two brothers entered thier workout room. Eijirou was dressed in a pair of gym shorts and a black tank top, while Hato had on a pair of sweats and a red under armor shirt. <br>\r\n<br>\r\n\"So I'm thinking...we can start with weights!\", Eijirou called before he started to walk to the dumbells.<br>\r\n<br>\r\n\"Eijirou wait a sec\", Hato called out causing his brother to stop at his deep voice. \"Huh? What is it Nii-san?\"<br>\r\n<br>\r\nHato grinned before walking over and placing a hand on Eijirou's head. The spiky head blushed slightly at this childish action. \"I've got a surprise for you. I need you to keep your eyes closed ok?\"<br>\r\n<br>\r\nNodding, Eijirou shut his eyes. He suddenly felt a tingling over his body, despite this he kept his eyes closed. Finally the tingling stopped.<br>\r\n<br>\r\n\"Alright open up!\", Hato's voice was much louder and seem to come from much higher then usual. <br>\r\n<br>\r\nOpening his eyes, Eijirou adjusted his eyesight. However once everything was clear, the red head was shocked.<br>\r\n<br>\r\nHato was stretching into the sky like a true giant. The giants size 30 feet sat on both sides of Eijirou and looking up his saw his brother's muscles expanding from his body and the his face peering over his pecs down at him.<br>\r\n<br>\r\n\"Nii-san wha...?\"<br>\r\n<br>\r\nHato chuckled and placed his hands on his hips. \"I know right!? I found out I could shrink more then just myself!\" <br>\r\n<br>\r\nEijirou while in shock, was gleeful. His dream came true! Hato was a real giant and he was a mere ant to him. All the dreams of Hato sitting, stepping, and pumping on him could be a reality!<br>\r\n<br>\r\nEijirou focus was back on his brother, as he squatted and made his muscles pump and bring his large bulge into view.<br>\r\n<br>\r\n\"Alright then how about I grow you back? I'm sure you wouldn't want to be the tiny brother.\", Eijirou watched as his brother's palm approached.<br>\r\n<br>\r\n\"Wait Nii-san!\", Eijirou yelled causing Hato to remove his hand in confusion.<br>\r\n<br>\r\n\"Can...i stay this size?\"<br>\r\n<br>\r\nHato raised an eyebrow in confusion. \"What are talking about Eijirou?\"<br>\r\n<br>\r\n\"I'm always the one who get's to be the giant, I want to be little during our workout and see you're manly form fill my sky!\", Eijirou passionately explained clenching a fist to his chest. <br>\r\n<br>\r\nLooking up he saw Hato........</span></div></div>",
            "created":1534741200,
            "id":2536062,
            "title":"Hato showing off a new trick"
        },
        "1242":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Hands were raised",
                "No one raised thier hand",
                "A teacher suddenly entered "
            ],
            "content":"<div class=\"\"><div> <span>Hato stood at the gates of U.A, the school he would be teaching at stood before the large man in all it's glory. Preparing for this job had been a challenge.<br>\r\n<br>\r\nFirst obstacle, keeping this all a secret from Eijirou. Hato both wanted to surprise him and make the class seem fair. The principal had given him the name Kise to use for his fist few weeks, he'd give his true name once it was shown he wouldn't be biased towards his brother.<br>\r\n<br>\r\nSecond obstacle, dressing appropriate for the job. Most of Hato's wardrobe consisted of workout clothes, since it was hard to find regular clothes that don't rip with one flex. Luckily a blond and boney stranger had helped him find formal wear, saying he had a friend who was large like him. Still it didn't stop the clothes from looking like they were painted on his muscles, and to finish he had his red hair in a low ponytail.<br>\r\n<br>\r\nTaking a deep breath the giant began to walk to his class. \"I've got this, I gotta be a man for Eijirou!\"<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nThe class of 1-A sat chatting amongst themselves, waiting for thier new teacher. The students had been informed that on certain days they would have a hybrid class called Heroic Fitness. <br>\r\n<br>\r\nThe chatter stopped once they heard the door. \"Sorry to keep you all waiting!\", a deep voice called entering the room. The class looked slightly surprised as a red headed muscle head walked to the front, with the top of his desk going below his waist. One red headed student had his jaw hanging as he saw who the teacher was.<br>\r\n<br>\r\n\"My name is Mr.Kise and I'll be teaching you all!\", Hato said grinning, immediately making some stare at his familar sharp teeth.<br>\r\n<br>\r\n\"Now my job is to help you heroes get into to grove of physical activity, make you ready to go out and use your energy to the fullest!\", Hato passionately explained clenching a fist. Now everyone was sensing something familar about the giant. <br>\r\n<br>\r\n\"Now then, for my first lesson we'll be getting active!\", Hato yelled as he pointed at the door.<br>\r\n<br>\r\n\"HUH!\", the class yelled surprised they were starting so early. Eijirou however had not yelled as he was staring at the teacher in confusion.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nThe class was stumped. This was a fitness class, yet they were inside a room that had no workout equipment whatsoever. There was a platform with what appeared to be a miniature city and a TV screen in front.<br>\r\n<br>\r\n\"Kise-sensei! May I please ask what the purpose of this city is?\", a boy with glasses said while robotically moving his arms.<br>\r\n<br>\r\nHato grinned. \"This city right here, is where you're working out!\". The class became more confused. \"Here let me explain. Hey umm you could you come over here?\". Hato said pointing at a green haired, freckled boy. <br>\r\n<br>\r\nThe boy known as Midoriya came forward, a little nervous as his head just went above Hato's waist. The giant placed a large palm on his student's head, making him immediately flustered. \"Don't worry, this will only be for a little.\". Before Midoriya could ask what he meant, the boy suddenly vanished before his classmates eyes. The students gasped in shock at the sudden disappearance of thier classmate. Hato however stayed calm and squated down and was shown picking something up before standing, with his palm opened.<br>\r\n<br>\r\n\"What the hell did you do to Deku!\", an angry blond yelled at Hato.<br>\r\n<br>\r\nThe giant merely smiled before taking out his phone and turning on the TV. On the TV through his phone it should Hato's large palm, there was a dot in middle. However, upon zooming in the class widened thier eyes as they saw it was actually Midoriya looking up in fear! <br>\r\n<br>\r\n\"My quirk allows me to shrink myself and others down to miniscule sizes. This city will be roamed by you all at this size.\", the class couldn't believe it. Being shrunk down wasn't with the information they received!<br>\r\n<br>\r\n\"I'll explain the rest in a sec, but first let's get this little guy back to normal.\", crouching down then standing up again, in the second following Midoriya appeared resized. After a pat on the head, he walked back to the group with a light blush, Eijirou frowned slightly. He was the only one who gets head pats from Hato.<br>\r\n<br>\r\n\"Now, what would a tiny city be complete without? A giant monster to terrize it! Unfortunately I didn't bring a reptile costume with me\". A few students laughed at the reference.<br>\r\n<br>\r\n\"Ok you'll be put into teams of five, your goal is too get to one of the checkpoints at the outskirts of the city. Meanwhile, the monster will be rampaging without a quirk and you have to avoid it. You'll be sent to a random location so the giant can't win right away. You also will have a deterrent band, these will help protect you if any rubble or a foot lands on you.\"<br>\r\n<br>\r\nThe class took in the task. Running from a giant while shrunk. Hato then looked through his phone.<br>\r\n<br>\r\n\"Alright then, the first team is Kaminari, Hagakure, Hanta, Midoriya, and Ashido.\"<br>\r\n<br>\r\nWalking up to form a line, the team was given thier red deterrent bands. While Midoriya was worryingly mumbling, Ashido was bouncing with excitement.<br>\r\n<br>\r\n\"So we have our team, now all we need is our giant. So who's up for it!\", Hato excitingly asked.<br>\r\n<br>\r\nNo one raised thier hand however. Some where thinking \"it be too awkward\", others thought \"I wouldn't be a good giant\". And then there was one thinking \"heh, I could crush Deku like the pebble he is!\"<br>\r\n<br>\r\n\"If no one volunteers, then i'll have to do it myself.\", Hato said folding his strong arms.<br>\r\n<br>\r\nThe team began to sweat nervously. It was no secret that Hato seem to have immense strength and energy. There's no way he'd go easy.<br>\r\n<br>\r\nAfter a few seconds......</span></div></div>",
            "created":1535259600,
            "id":2539360,
            "title":"At School"
        },
        "12421":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Todoroki",
                "Bakugou",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Eventually, after a few seconds hands began to rise up. Hato looked over them, recognizing the faces that were volunteering.<br>\r\n<br>\r\nThere was Todoroki, who held onto his stoic face.<br>\r\n<br>\r\nBakugou, who had a wicked smirk on his face.<br>\r\n<br>\r\nIida, who had a troubled yet determined face.<br>\r\n<br>\r\nMashirao, who had a pleasant smile.<br>\r\n<br>\r\nRikido, who was giving a goofy grin with his thick lips.<br>\r\n<br>\r\nHato rubbed his chin, contemplating who to pick. The giant needed to be willing to act villainous. He decided to pick.......<br>\r\n<br>\r\n</span></div></div>",
            "created":1535950800,
            "id":2542515,
            "title":"Hands were raised"
        },
        "125":{
            "author_id":"jayguy",
            "author_name":"Jayguy",
            "choices":[
                "Tokoyami ",
                "Aoyama",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You belonged to the family of...</span></div></span></div>",
            "created":1533790800,
            "id":2531255,
            "title":"Other "
        },
        "1253":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Iida ",
                "Shoji ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your surname is....</span></div></span></div>",
            "created":1535173200,
            "id":2538741,
            "title":"Other"
        },
        "12531":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "With Tenya",
                "At home",
                "Out at town"
            ],
            "content":"<div class=\"\"><div> <span>Coming from a family known for thier superheroes, and not having the same quirk was a real downer for Tadashi Iida.<br>\r\n<br>\r\nAlthough he was one of the few individuals to manifest a quirk at birth, it wasn't much to gloat about. When he was born, the docter looked shocked as he held the speck of a newborn in his palm.<br>\r\n<br>\r\nTadashi's quirk was being an inch tall. Alongside this was the ability to regenerate from live threatening wounds. While his family still loved and supported him, he couldn't help but feel left out.<br>\r\n<br>\r\nHis two brothers cared for him very much. Though Tenya was more overbearing as Tensei's superhero career took off.<br>\r\n<br>\r\nTenya took his role as Tadashi's big brother seriously. He carried him almost everywhere, and even bathed with him just in case Tadashi forget how to swim. Whenever he jogged, Tenya had Tadashi nuzzeled up between his pecs. The little brother didnt mind much, sinking into the large muscles and hearing Tenya's heartbeat.<br>\r\n<br>\r\nStill with his overprotective attitude, Tenya didnt want anything happening to Tadashi.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\n\"No Tadashi\", a stern voice called out.<br>\r\n<br>\r\n\"Ah, come on nii-san.\"<br>\r\n<br>\r\nTenya loomed over his brother sitting on the nightstand. The elder Iida had his arms folded over his strong chest as he gazed sternly at his speck of a brother.<br>\r\n<br>\r\n\"You know how dangerous it could be! Others won't take mercy and I don't want you applying for any hero course.\"<br>\r\n<br>\r\nTadashi eventually gave up. He wanted to become a hero, but at this size it seemed impossible. He may just have to watch as both his brothers continue the family legacy.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nNow, where is Tadashi right now?</span></div></div>",
            "created":1536037200,
            "id":2542905,
            "title":"Iida "
        },
        "125311":{
            "choices":[
                "Squashed into Tenya's Armpit",
                "Squished Between Tenya's Pecs"
            ],
            "content":"<div class=\"\"><div> <span>Tenya was sitting at his desk studying with Tadashi safety in his shirt pocket. The elder boy yawned loudly, making Tadashi's ears ring from the booming sound.<br>\r\n<br>\r\n\"It's getting pretty late, we should get some sleep.\" Tenya said as he used two fingers to take Tadashi out of his pocket.<br>\r\n<br>\r\n\"Yeah, I'm getting tired too... do you think I could sleep in my room tonight?\" Tadashi asked with a hopeful look.<br>\r\n<br>\r\n\"You know that sleeping all alone at that size in a huge bed with no one else around is too dangerous.\" Tenya sighed.<br>\r\n<br>\r\n\"Fiiine...\" Tadashi groaned.<br>\r\n<br>\r\nWhile Tadashi appreciated Tenya's protection, sometimes it was a bit much, he couldn't do anything on his own.<br>\r\n<br>\r\nTenya placed Tadashi on the desk and slipped his shirt off. Tadashi looked up at his older brother, he looked so strong compared to his one inch sibling, it made Tadashi a bit jealous. <br>\r\n<br>\r\n\"I'll be right back, I'll let you be alone for a minute while I brush my teeth, be careful!\" Tenya placed Tadashi on the bed and left the room. <br>\r\n<br>\r\nTadashi laid on the bed and sighed, if only he could have an entire bed like this to himself, even for one night. A few minutes later, Tenya walked back into the room and walked towards the bed, yawning again and stretching his arms up. <br>\r\n<br>\r\nTenya didn't notice a cord on the floor, and ended up tripping over it, making him fall on the bed... right where Tadashi was laying down.<br>\r\n<br>\r\nWhere did the younger Iida end up? </span></div></div>",
            "created":1538110800,
            "id":2555346,
            "title":"With Tenya"
        },
        "1253111":{
            "choices":[
                "Tenya felt something in his armpit",
                "Tenya walked around the house to look for Tadashi",
                "Something else happened "
            ],
            "content":"<div class=\"\"><div> <span>Tadashi saw Iida falling over, but he couldn't move out of the way fast enough. Tadashi looked up to see Iida's massive armpit coming towards him before Iida made contact with the bed, squashing the tiny male between the bed and armpit.<br>\r\n<br>\r\nIida quickly got up, leaving Tadashi pressed into his pit. Unaware of where Tadashi had gone, Iida put his muscular arm to the side, trapping Tadashi in between two walls of warm, musky skin. <br>\r\n<br>\r\n\"Hm? Where did you go Tadashi?\" Iida looked around.<br>\r\n<br>\r\nIida looked on the bed, on the floor, even under his feet, but he couldn't find him.... <br>\r\n<br>\r\nEventually, </span></div></div>",
            "created":1538197200,
            "id":2556298,
            "title":"Squashed into Tenya's Armpit"
        },
        "12531111":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Help cheer up Tenya",
                "Suggest they go to sleep",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Tenya was beginning to panic, he couldn’t find his little brother! Even if he could regenerate, Tenya didn’t want to put Tadashi in an unpleasant situation.<br>\r\n<br>\r\nIn the midst of his panic, Tenya felt a tingle in his armpit. At first he was going to dismiss it as a itch, but focused as the tingling felt more like squirming.<br>\r\n<br>\r\nLifting up his strong right arm, Tenya’s eyes widened as he saw his brother tangled up in his short armpit hairs. Quickly but gently, he pulled Tadashi out of his armpit before placing him on his bed. Tenya fell onto his knees and began to rapidly bow.<br>\r\n<br>\r\n“I’m so sorry Tadashi! I didn’t mean for you to end up there!”<br>\r\n<br>\r\nTadashi just blinked, adjusting to the fresh air. He looked at his brother and sighed. Truth be told this wasn’t the first time something like this happened, still whenever he got into a situation like this Tenya would always panic.<br>\r\n<br>\r\n“Nii-san it’s ok.”<br>\r\n<br>\r\nTenya stopped his bowing before looking up with a sad gaze. “I can’t believe this happened. What hero can’t even protect his brother?”<br>\r\n<br>\r\nTadashi frowned, he should cheer up Tenya. He was going to try and get into U.A and being sad wasn’t going to help.<br>\r\n<br>\r\nThe younger Iida decided to........</span></div></div>",
            "created":1538197200,
            "id":2556716,
            "title":"Tenya felt something in his armpit"
        },
        "125311112":{
            "choices":[
                "Tenya was waking him up for something.",
                "Tenya was rolling over.",
                "Tadashi was sliding out from between Tenya's pecs."
            ],
            "content":"<div class=\"\"><div> <span>\"Look, it's okay accidents happen, we should get some sleep.\" Tadashi said.<br>\r\n<br>\r\nTenya smiled a bit before picking Tadashi up and laying on the bed. Tenya placed Tadashi in between his pecs, the younger Iida surrounded by his older brother's massive muscles. Sometimes he couldn't even believe that Tenya was his older brother, considering how tiny he was compared to him.<br>\r\n<br>\r\n\"Goodnight Tadashi, sleep well.\" Tenya said before turning the lights off and pulling the sheets up to his chest. Tenya fell asleep quickly, and Tadashi fell asleep soon after.<br>\r\n<br>\r\nThe younger boy was awakened after a few hours, due to....</span></div></div>",
            "created":1538197200,
            "id":2556734,
            "title":"Suggest they go to sleep"
        },
        "125312":{
            "author_id":"phoenix2",
            "author_name":"phoenix2",
            "choices":[
                "Tadashi got his attention. ",
                "Tenya stepped on Tadashi by accident. ",
                "Something else happened. "
            ],
            "content":"<div class=\"\"><div> <span>Tadashi groaned as his stomach rumbled, he had already climed onto the bed that he and his older brother shared, and now he would have to climb back down and make his way to the kitchen. The younger Iida made it down the side of the bed and wiped his brow before walking toward the door.<br>\r\n<br>\r\nThe door suddenly opened and Tenya walked in, the handsome giant had no shoes or socks on and he wore his black tank top as he began to walk to the bed. <br>\r\n<br>\r\n\"Tadashi, where did you go? I'm about to go on my run.\" Tenya was about to take one step forward when... </span></div></div>",
            "created":1548724440,
            "id":2609106,
            "title":"At home"
        },
        "1253122":{
            "author_id":"phoenix2",
            "author_name":"phoenix2",
            "choices":[
                "Between Tenya's pecs",
                "Somewhere else... "
            ],
            "content":"<div class=\"\"><div> <span>Tadashi tried to warn Tenya that he was about to step on him... but he didn't hear him in time. Tenya stepped forward and Tadashi was squished into the soft sole of his elder brother's foot.<br>\r\n<br>\r\n\"Mmfgh!\" Tadashi cried out, however Tenya didn't seem to notice.<br>\r\n<br>\r\n\"Tadashi?\" Tenya looked around, every time he walked Tadashi was pressed against the foot.<br>\r\n<br>\r\nEventually, Tenya felt something beneath his foot and took a look, only to see his tiny brother stuck face first on the bottom.<br>\r\n<br>\r\n\"Tadashi!\" Tenya peeled Tadashi off of his foot and held him up to his face \"I'm so sorry!\"<br>\r\n<br>\r\n\"I'm used to it...\" Tadashi sighed.<br>\r\n<br>\r\n\"What did I tell you about walking around on the floor? It's dangerous! You should have stayed on the bed.\" Tenya said sternly, almost like a strict father.<br>\r\n<br>\r\n\"I know, I just wanted some food.\" Tadashi said as Tenya straightened his glasses. <br>\r\n<br>\r\n\"It's my responsibility to take care of you, I can't have you running around all the time. You're always getting into these situations, I just think it would be best if you stay with me all the time.\" Tenya said. \"But now I'm going on my run, I'll keep you tucked away nice and safe.\"<br>\r\n<br>\r\nWhere did he end up? </span></div></div>",
            "created":1548751380,
            "id":2609249,
            "title":"Squished"
        },
        "13":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "All Might ",
                "Eraserhead",
                "Present Mic",
                "Vlad King",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>As children we all look up to our parents, for you this was a daily occurrence due to your quirk.<br>\r\n<br>\r\nAlthough shrinking caused trouble for you and your dad, not to mention has placed the two of you in a lot of awkward situations. Your father raised you and inspired the dream to become a hero just like him.<br>\r\n<br>\r\nYour dad was a Pro-Hero, his job was to save people and teach them about heroism. <br>\r\n<br>\r\nNow then, what hero is your father?</span></div></div>",
            "created":1533099600,
            "id":2527553,
            "title":"My Dad is a Pro-Hero"
        },
        "131":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "In junior high",
                "In U.A high school",
                "Out with your dad"
            ],
            "content":"<div class=\"\"><div> <span>Your father was the #1 hero and symbol of peace Toshinori Yagi, known to the public as All Might.<br>\r\n<br>\r\nYou had been a child of his early marriage. However, your mother had died during labor. Leaving you and your father alone. Despite this, Yagi raised you to the best of his effort, giving you care and teaching you about being a hero.<br>\r\n<br>\r\nBeing born quirkless and given his power, you didn't inherited Yagi's quirk. You did recieve your mother's quirk of shrinking. This was discovered when your father felt tingling on his hand, and was surprised to find you one inch and swinging from his fingers. <br>\r\n<br>\r\nYou discovered your regeneration in the worst way possible. When you were fifteen, you shrank down and ran around the living room. All Might soon walked in, still wearing his hero costume. You called out, but he couldn't hear you. All you could do was gaze up as All Might's white sole filled your sky and came down.<br>\r\n<br>\r\nYagi immediately noticed the crunch when he stepped down. Raising his boot, he gazed horrified at your flattened body. However, after a few seconds your body reformed and you looked back up at your father just as confused as him.<br>\r\n<br>\r\nYagi began to pay more attention when walking around. Though that didn't stop him from finding you beneath his foot, butt, and chest. Although most of these were your doing, since you got a thrill out of being crushed.<br>\r\n<br>\r\nNow then, as the son of the #1 hero. Where exactly are you.</span></div></div>",
            "created":1533358800,
            "id":2528792,
            "title":"All Might "
        },
        "1313":{
            "author_id":"calvin1703",
            "author_name":"calvin",
            "choices":[
                "you were pretending to be asleep"
            ],
            "content":"<div class=\"\"><div> <span>your dad had come to wake you up but after knocking several times he decided to enter. All might approached your bed and slowly pulled your blankets back and he grew a smile. you were asleep on your bed at one tall. you had a habit of activating your quirk in your sleep. Carefully he picked you up held you in his palm as he made his way to his room. it was still quite early and the two of you had trained late into the previous night. Yagi himself was still nodding off as he made his way to his bed. his bed was very large considering how he was always in his hero form so he put you on one side of the bed and laid down far enough away from you so that he wouldn't accidentally roll over on you despite the fact that it wouldn't kill you. he laid on his back watching you, you had always looked so adorable in your small form and you being asleep only made you look more sweet. he slowly closed his eyes and fell asleep.</span></div></div>",
            "created":1543122000,
            "id":2581828,
            "title":"Out with your dad"
        },
        "13131":{
            "author_id":"calvin1703",
            "author_name":"calvin",
            "choices":[
                "All might thinks he is dreaming"
            ],
            "content":"<div class=\"\"><div> <span>It  had been several minutes since your dad, All Might, had stopped moving. You open one of your eyes to see if he had gone back to sleep. his giant chest rose and fell with each breath he took. you jumped up feeling confident that he was asleep. you ran  up to his sleeping form and a smile grew on your face. ever since you found out that you couldn't die in your shrunken form you have been addicted to exploring your dads body. but today was the first day that you were doing this while he was asleep. usually he would let you explore his hair or let you climb his arms but you had been craving something else. you climbed his side and went to the middle of his stomach. you then began to head for his crotch. once you made it to your fathers briefs you started to shimmy your way between the waist band and his skin. once inside your eyes lit up and you slowly made your way down into the jungle of blonde hair. <br>\r\n<br>\r\nyagi was half asleep when he felt a disturbance in his crotch. he unconsciously began to scratch his pubic hair through his briefs. his fingers pushed you down against his hairy skin as you were sent up and down his jungle. you eventually managed to escape his grasp. you were having fun but you didnt come here for a hairy bouncy castle. before you was the monolith that you had come from many years ago. you made your way onto his shaft with your arms and legs wrapped around it as best as they could. your bliss was short lived as the ceiling was pulled away and light was shown upon you. looking up you see your dad looking right at you but he still looks half asleep. </span></div></div>",
            "created":1543188900,
            "id":2581981,
            "title":"you were pretending to be asleep"
        },
        "131311":{
            "author_id":"calvin1703",
            "author_name":"calvin",
            "choices":[
                "mouth"
            ],
            "content":"<div class=\"\"><div> <span>all might was looking down at you for a few moments before his famous large hero smile appeared on his face. he and your mother used to have very fun nights together in which your mother would use her quirk and the feeling you were giving him formed his half sleepy mind into thinking he was dreaming of a previous time. ''HOW IVE WAITED FOR THIS MOMENT FOR SO LONG HAHAHAHA'' his voice was booming like thunder over you louder than you were used to. before you could move you were trapped against his already erect penis as he began to stroke it with you in his hand. for your father it was a great time. he missed the roleplays he did with your mother were he pretended to be a giant. but for you on the other hand it was a nightmare. you had wanted to just get a good look at his penis but this was too much. his moaning far above you was deafening. you didn't even realize that he had gotten up and began to slowly make his way to the shower in his bathroom. <br>\r\n<br>\r\nAll Might turned the shower on and let the hot water fall around him as he continued to jerk his member faster and tighter. first your limbs began to snap and then you couldn't even breath because of how tightly you were being pushed up against his dick. you were crying for your father to stop right as you were squashed into him. not even a moment later you reformed.this is when he pushed you up towards the head of his dick and forcefully used his thumb to push your head into his slit. you were screaming and trying to push yourself out but you were no match for his thumb. ''OH HERE IT COMES OPEN UP'' he called from above. from deep inside him juices began to rise and shoot into your face. you swallowed several mouthfuls before he pulled you away to cover you head to toe with his spray. he was holding you away from the water of the shower so then you would stay ''seasoned''. you were curled up in a ball on his palm when you noticed he was lifting you towards his...</span></div></div>",
            "created":1543190100,
            "id":2581991,
            "title":"All might thinks he is dreaming"
        },
        "1313111":{
            "author_id":"calvin1703",
            "author_name":"calvin",
            "content":"<div class=\"\"><div> <span>you were lifted above his head, you looked down at your fate that was his mouth. All might gave off a mighty laugh before pinching you between his thumb and index finger and lowered you to his mouth that housed his awaiting muscle known as his tongue. you tumbled into his mouth and were shut in darkness as he closed his mouth. All might was already hard again and began to pump himself. you were jostled in all directions inside of his mouth before his tongue pressed you up to the roof of his mouth. he was smiling, you were screaming, he was being pleasured, you were being tortured, he was having the time of his life, you were hoping that your life would end.<br>\r\n<br>\r\nas if all might could read your mind he decided to send you on a final trip. he rolled you in his mouth for a while before pushing you back towards his throat. your limp body sprung to life as you realized what was about to happen. you tired to push your way through his meat tight mouth but sadly you were no match for him. he simply swatted you with his tongue until you could barely move. at that moment he came hard and his orgasm caused him to swallow. you weakly tried to stop yourself but it was a fruitless attempt as you were effortlessly pushed down the number 1 pro heroes throat and into his stomach. the acid began to burn you immediately as you wished to become knocked out from the pain.</span></div></div>",
            "created":1543190880,
            "id":2582008,
            "title":"mouth"
        },
        "132":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "At school with Aizawa",
                "Training ",
                "Out at town"
            ],
            "content":"<div class=\"\"><div> <span>Shouto Aizawa, known to few as the underground hero Eraserhead.<br>\r\n<br>\r\nYou had been the result of a one night stand. Your mother passed away at birth, and Aizawa was the only person who could have fathered you. So he took you in, and your father-son bond grew stronger as you aged.<br>\r\n<br>\r\nThe quirk you had came from your mother's side. Shrinking and regeneration.<br>\r\n<br>\r\nIt was an odd case when your dad used erasure. If you were shrunk, you couldn't grow back intill he restored your quirk.<br>\r\n<br>\r\n~~~~~~~~~~~~~~~~~~~~~~<br>\r\nAs you grew older, Aizawa began to train you. Some involved combat training, while others had you using your quirk.<br>\r\n<br>\r\nIt was like a super version of capture the flag. You'd shrink down and have to collect the flag from across the room, all while hiding from your dad. The first few tries ended with you being stomped into the floor by your father's socked foot. Punishments for failure had you being strapped to his foot all night.<br>\r\n<br>\r\nStill you adored you're dad. From his cool fighting to his attitude. Also how at night you would shrink and sleep on his chest.<br>\r\n<br>\r\nNow where are you? </span></div></div>",
            "created":1535000400,
            "id":2537697,
            "title":"Eraserhead"
        },
        "1323":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Seem to hear you",
                "Began to reach for you",
                "Got annoyed "
            ],
            "content":"<div class=\"\"><div> <span>Aizawa was on his way to the training camp where his class would be spending their summer now that final exams finished. He was going to check to make sure everything was ready and that the Wild Wild Pussycats were prepared. He left you home and told you he'd be back soon.<br>\r\n<br>\r\nLittle did he know, you weren't home.<br>\r\n<br>\r\nYou had smuggled away in your dad's pocket as you wanted to see what his class's activites were like since you were homeschooled. Soon your father exited his vechile and walked towards the camp, you climbed out of his pocket and saw his scruffy face high in the sky. <br>\r\n<br>\r\nCarefully climbing down the pant trouser to the boot, you jumped to the ground and felt the ground shake as his boots stomped the ground. Aizawa's giant body soon walked out of your view. Now alone, you grinned.<br>\r\n<br>\r\n\"Dad said his students were gonna train hard. I should follow his example!\"<br>\r\n<br>\r\nYou focus your energy. Recently you discovered there was more to your quirk then just being small, you could actually shrink smaller. While it didn't look like much, you soon shrank to a 1/2 inch tall. It was even harder to notice you now.<br>\r\n<br>\r\nThe ground began to shake again, more intensely now that your basically a speck. Looking behind you there was a new giant walking nearby. It was a kid wearing a red hat with horns over black hair and boots that shook the ground. <br>\r\n<br>\r\nThe kid was boringly looking through a magnifying glass. Soon he casted a shadow over you as he spotted you with his magnifying glass. His large eyes squinted.<br>\r\n<br>\r\n\"Huh, what kinda bug is this?<br>\r\n<br>\r\nYou grew a little nervous. \"WAIT, I'm not a bug!\"<br>\r\n<br>\r\nThe kid's eyes narrowed as Kota...</span></div></div>",
            "created":1553666340,
            "id":2635469,
            "title":"Out at town"
        },
        "13233":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Kota gets a stomp on you",
                "You managed to jump on top of the boot",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kota scoffed as he rose the magnifying glass higher to let the sun blast you. \"Grr..your squeaking sounds annoying!\"<br>\r\n<br>\r\nYou shut your eyes as the intense light hit you. You panted as you felt the heat largely largely rising, you needed to get out of the way of the concentrated light or you'd be toast!<br>\r\n<br>\r\nKota followed your fleeing body with the optical tool. Grumbling in annoyance as he couldn't cook you alive with the sun. Of course you were a puny bug to him, Kota didn't know you were a tiny human.<br>\r\n<br>\r\nThe black haired boy got fed up before tossing the magnifying glass away. Kota stood up and casted a shadow over you, you gained hope thinking he finally spotted a human. That wasn't the case.<br>\r\n<br>\r\nKota huffed and rose on of his big boots while clenching his fists. \"I don't need to cook you when I can just squish you!\"<br>\r\n<br>\r\nThe sole of the boot covered the giant kid's face and you quickly jumped out of the way of the stomper. Kota narrowed his eyes and swiveled his boot, gaining a confused look at the lack of a crunch.<br>\r\n<br>\r\nSeeing you next to the stomper, Kota growled and lifted up his boot again. \"Stay still and get crushed!\"<br>\r\n<br>\r\nYou thankfully didn't listen and kept dodging the large boot's killing stomp, getting more tired and making Kota more steamed.<br>\r\n<br>\r\nSoon...</span></div></div>",
            "created":1555033680,
            "id":2643734,
            "title":"A Giant's Kid's Annoyance "
        },
        "132331":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Survived!",
                "Got crushed!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After dodging another stomp, you tried to rethink your strategy. Right now Kota only saw you as a bug and wouldn't stop assaulting the ground intill you were squished.<br>\r\n<br>\r\nThinking hard you decided on a new tactic, desperate to escape. You were about the size of a small beetle and maybe if you were smaller you could get out of getting splattered on the kid's boots.<br>\r\n<br>\r\nHowever, just as you were about to shrink further Kota had an idea too. The kid with the hat wanted to squash the bug no matter what. Swishing his cheeks, Kota spit out a flop of spit at the bug that had stopped. He swore that the insect looked smaller when the glob hit it, Kota huffed as he nodded and once again lifted his boot.<br>\r\n<br>\r\nYou were thrown to the ground, you squirmed in shock as you were covered in a wet substance. This substance was like...salvia! Wait then the kid...<br>\r\n<br>\r\nA shadow covered you and looking up you saw Kota holding one of his boots over you while narrowing his eyes. The white boot sole was littered with dirt and the flattened corpses of bugs fallen victim to Kota's annoyed crushing feet.<br>\r\n<br>\r\n\"Hhmh! Now you can't run anymore! Now stay there and get crushed puny bug!\"<br>\r\n<br>\r\nKota rose his foot higher, now that you were trapped he wanted to squash you extra hard and grind you into dust.<br>\r\n<br>\r\nYou tried yelling up as the spit held you down like glue. \"WAIT, kid I'm not a bug!\"<br>\r\n<br>\r\nThis didn't reach Kota's ears and the boot came down with crushing intent and speed.<br>\r\n<br>\r\nYou... </span></div></div>",
            "created":1555636560,
            "id":2646550,
            "title":"Kota's Stomps "
        },
        "1323311":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Continue 1",
                "Continue 2",
                "Continue 3"
            ],
            "content":"<div class=\"\"><div> <span>Kota hummed as he nodded and started grinding his boot into the ground. There was a crunching noise that the kid believed to be you. The gravel showed the semi circle created by Kota enjoying the crushing of the pesky bug. After a good minute of crunching, Kota spotted the magnifying glass he'd thrown and started walking over to retrieve it.<br>\r\n<br>\r\nAs the boot was lifted up if one looked closely at the wet glob in the ridge of the boot sole, they would see a squirming speck. In the glob of spit you had shrunken again due to shock and were now swimming in the pool of salvia. The crunching before had been due to the already crushed bugs being grinded even more. <br>\r\n<br>\r\nBeyond the spit glob you were trapped in, you saw two canyon like walls on either side of the sudden light. You felt pale as you realized that those walls were actually the ridges of Kota's boot. The light started to darken as Kota stepped down on all the tinies beneath his boot.<br>\r\n<br>\r\nKota picked up the magnifying glass, sighing in relief at the lack of cracks. He start walking away still unaware that the bug he supposedly crushed was still alive and squirming under his boot sole. <br>\r\n<br>\r\nYou were still swimming as the glob rippled with each of the giant steps. You needed to think, you were smaller then ever and trapped in the groves of a kid's boot. The boot rose again and you decided to act as the light hit again.</span></div></div>",
            "created":1555639440,
            "id":2646572,
            "title":"Survived But Trapped"
        },
        "13233111":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Continue 1",
                "Continue 2",
                "Continue 3"
            ],
            "content":"<div class=\"\"><div> <span>As Kota's large stomper lifted from the ground, you finally burst out from the gloppy of spit. You take in as much air as possible and looked down in shock as beyond the canyon of the boots ridges was the ground approaching!<br>\r\n<br>\r\nYou were safe as the boots sole hit the ground, accompanied by the crunches of ready flattened insects. <br>\r\n<br>\r\nTaking a deep breath you hopped down to the earthy ground, there were gaps of light as the ridges supported the boot. It was best to act quickly before Kota started walking again.<br>\r\n<br>\r\nAs you rushed out from beneath the boot you looked up to see Kota using his magnifying glass again. The boy was now ginormous, bigger then a mountain.<br>\r\n<br>\r\nThis was bad, in order to shrink furthur you needed to save energy. You'd have to wait intill you were rested enough to grow back to a inch tall.<br>\r\n<br>\r\nKota was crouching down while looking through the grass, his boot stood over like a building. Maybe if you climbed th giant you could reach his face and show him your a human.</span></div></div>",
            "created":1556698860,
            "id":2653056,
            "title":"Continue 1"
        },
        "133":{
            "author_id":"phoenix2",
            "author_name":"phoenix2",
            "choices":[
                "At Home With Your Father",
                "Getting Ready to Go to Sleep",
                "Training With Your Father"
            ],
            "content":"<div class=\"\"><div> <span>You were the son of Hizashi Yamada, also known as Present Mic. You were the result of a one night stand, and your father took you in after you were born.... at only one inch tall.<br>\r\n<br>\r\nWith your quirk, you had extremely high durability and couldn't be crushed, as well as enhanced agility, but you still wished you could be a successful pro hero like your father. <br>\r\n<br>\r\nYou often ended up getting into odd situations with your father, whether it being accidentally stepped on by him, or sat on. You shared the same bed as him due to you being so small, and sometimes he would accidentally roll over onto you and pin you between his body and the mattress. <br>\r\n<br>\r\nDespite your father constantly squishing you by accident, he cared about you and often trained you to help you become stronger and maybe one day fulfil your dream of becoming a hero.<br>\r\n<br>\r\nWhere were you now? </span></div></div>",
            "created":1550997960,
            "id":2622262,
            "title":"Present Mic"
        },
        "14":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Midoriya ",
                "Bakugou",
                "Todoroki ",
                "Aizawa",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>Your name is Mark Johnson, a transfer student from America.<br>\r\n<br>\r\nGrowing up, Mark always faced bullying because of his quirk. Most was done by Richt, a tall, well muscled adult with shaggy brown hair held back by a white bandana. A lot of torture consists of him squeezing mark beteeen his muscles or simply stomping on the tiny.<br>\r\n<br>\r\nWhat Mark didn't have in power, he made up with in intelligence. He was the only one in his school to pass the Foreign Heroics exam, naming the quirk laws for over ten countries. In return for his perfect grade, he was offered a spot in a exchange program with Japan. <br>\r\n<br>\r\nThe news excited Mark, not only for a chance to see and live in a different culture. But also, it looked like there would be some nice people. He had received a welcome video from the hero All Might himself, saying that he was teaching at the school he would be attending and couldn't wait to see him.<br>\r\n<br>\r\nLuckily, there was a quirk user with the ability to implant knowledge into someone's head. So with a sudden know for Japanese and Kanji, Mark was ready to go.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nArriving in Musutafu by plane to Japan, Mark walked through the airport to the person who would be escorting him. <br>\r\n<br>\r\nHe had been told that someone from 1-A would be picking him up. Eventually, he saw someone holding a sign with his name written in English. <br>\r\n<br>\r\nBased on the pictures he seen, the person who came to pick up Mark was....<br>\r\n</span></div></div>",
            "created":1535778000,
            "id":2541493,
            "title":"I'm moving to Japan "
        },
        "142":{
            "choices":[
                "Bakugou toyed with Mark on the way back.",
                "Bakugou stuffed Mark into his shoe.",
                "Bakugo trapped Mark underneath his armpit."
            ],
            "content":"<div class=\"\"><div> <span>\"That must be Bakugou!\" Mark said to himself before walking up to him.<br>\r\n<br>\r\nBakugou didn't notice Mark, so Mark began to yell up at the giant hero in training.<br>\r\n<br>\r\n\"Hey! Down here! It's me, Mark!\" He shouted.<br>\r\n<br>\r\nBakugou raised his eyebrow and looked down at Mark.<br>\r\n<br>\r\n\"Huh? Don't tell me that YOU'RE the transfer student... what a joke.\" Bakugou glared down at Mark before snatching him up in between his fingers \"There's no way that you'll ever be a hero, bug.\" He said coldly.<br>\r\n<br>\r\n\"U-Uh... sorry, I'll be a great hero someday, just watch!\" Mark nervously tried to get on Bakugou's good side, but it obviously wasn't working.<br>\r\n<br>\r\n\"Yeah right, I might as well just crush you right now, it would save you the pain of being rejected. Besides, that's what any villain would do to you...\" Bakugou smirked evilly. \"Or I could take you with me and let everyone watch you get humiliated by a REAL hero.\"</span></div></div>",
            "created":1538197200,
            "id":2556512,
            "title":"Bakugou"
        },
        "144":{
            "author_id":"phoenix2",
            "author_name":"phoenix2",
            "choices":[
                "Had an evil looking smirk on his face. ",
                "Tucked Mark away somewhere. ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mark saw Aizawa standing there and ran over to him, avoiding giant feet as he rushed through a crowd.<br>\r\n<br>\r\n\"Nice to meet you, I'm Mark!\"<br>\r\n<br>\r\nAizawa looked down as he heard the squeaky voice, his eyes widened as he spotted the tiny wannabe hero.<br>\r\n<br>\r\n\"The rumors were true, you really are small... this should be interesting.\" Aizawa scooped Mark up in his giant hand and... </span></div></div>",
            "created":1548723900,
            "id":2609094,
            "title":"Aizawa"
        },
        "145":{
            "choices":[
                "Tenya",
                "Kirishima",
                "Neither, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could it be?</span></div></span></div>",
            "created":1540011600,
            "id":2566072,
            "title":"Other "
        },
        "1451":{
            "choices":[
                "Between his pecs",
                "In his back pocket",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Mark saw Tenya holding a sign, and walked over to him excitedly. Tenya didn't notice the small male, so Mark yelled up at him.<br>\r\n<br>\r\n\"Hey! It's me, Mark!\" He shouted.<br>\r\n<br>\r\nTenya glanced down at Mark, surprised that the new transfer student was so tiny.<br>\r\n<br>\r\n\"Tenya Iida, nice to meet you Mark.\" Tenya greeted him normally before reaching down and wrapping his fingers carefully around Mark's small body.<br>\r\n<br>\r\n\"I'm really excited to go to U.A!\" Mark said cheerfully \"Hope the students like me and don't think I'm weird or anything..\" He chuckled nervously.<br>\r\n<br>\r\n\"Hmm, you are very small, might be best to avoid the more arrogant heroes.\" Tenya sighed, no doubt thinking about Bakugo as he said that.<br>\r\n<br>\r\nMark gulped \"Well, at least if I have friends they can protect me.\" He said.<br>\r\n<br>\r\nTenya nodded \"Now, where should I put you on my way back? Don't want to lose you.' He thought out loud before deciding to tuck Mark...</span></div></div>",
            "created":1540011600,
            "id":2566078,
            "title":"Tenya"
        },
        "14511":{
            "author_id":"phoenix2",
            "author_name":"phoenix2",
            "choices":[
                "Tenya Arrived at UA",
                "Something Else Happened Along the Way"
            ],
            "content":"<div class=\"\"><div> <span>Tenya was wearing a tight shirt, he grabbed the collar and stretched it out before tucking Mark in between his pecs.<br>\r\n<br>\r\n\"I think this will be a safe place for you, you could fall out of a pocket.\" Tenya pushed his glasses up.<br>\r\n<br>\r\nMark was hugged by the gigantic muscles, not that he minded.<br>\r\n<br>\r\n\"You are really muscular... I can't believe that we're the same age.\" Mark blushed, embarrassed at how small and weak he must have looked in between the buff pecs.<br>\r\n<br>\r\n\"Everyone has their strengths and weaknesses, just because you're small doesn't mean you're weak.\" Tenya said as Mark smiled at the comment. </span></div></div>",
            "created":1550998620,
            "id":2622270,
            "title":"Between his pecs"
        },
        "1453":{
            "choices":[
                "All Might",
                "Eraserhead",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1540011600,
            "id":2566548,
            "title":"Neither, someone else"
        },
        "14531":{
            "choices":[
                "All Might takes Mark to UA",
                "All Might decides to spend some time getting to know Mark. ",
                "He does something else with Mark. "
            ],
            "content":"<div class=\"\"><div> <span>Mark's eyes widened as he saw the muscular symbol of peace himself, All Might! People where surrounding him and taking pictures, causing Mark to have to avoid giant feet from trampling him as he got closer to All Might. <br>\r\n<br>\r\n\"Hey All Might! It's me-\" Mark was cut off as one man in sandals accidentally stepped on him.<br>\r\n<br>\r\n\"All Might! Give me an autograph!\" The man said enthusiastically, however Mark was stuck underneath the sole of the sandal.<br>\r\n<br>\r\n\"Of course!\" All Might grinned \"If you don't mind getting off of my little friend under your sandal.\"<br>\r\n<br>\r\n\"Huh?\" The man looked confused before he checked the bottoms of his sandals to see Mark stuck to one of them. \"Oops! Sorry...\" He took him off of the sandal and handed him to All Might.<br>\r\n<br>\r\nAll Might took Mark in his fist and sat him on his muscular chest. Mark was in awe at the mounds of muscle underneath him as All Might signed a piece of paper for the man. <br>\r\n<br>\r\n\"I must go now, I have business to attend to!\" All Might announced as the swarming crowd sighed disappointedly before walking off.<br>\r\n<br>\r\nAll Might looked down at Mark.<br>\r\n<br>\r\n\"Hello Young Mark! I am here!\" All Might said heroically.<br>\r\n<br>\r\nMark was bounced up and down on the pecs as the giant man spoke. <br>\r\n<br>\r\n\"H-Hi, I didn't expect it to be you that came to pick me up!\" Mark chuckled.<br>\r\n<br>\r\n\"But of course! Once I heard of your quirk I had to see it first hand! You truly are as small as they said you were, quite adorable!\" All Might grinned, like usual, as Mark blushed at the comment.<br>\r\n<br>\r\n\"Uh.. thanks! So, what now?\" Mark asked. </span></div></div>",
            "created":1540011600,
            "id":2566555,
            "title":"All Might"
        },
        "15":{
            "author_id":"craft9",
            "author_name":"creator9",
            "choices":[
                "Tomura Shigaraki ",
                "Dabi",
                "Muscular ",
                "Stain",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kowa and Chizome Akaguro were two brothers that were similar, yet very different.<br>\r\n<br>\r\nChizome's quirk allowed him to stun people by ingesting thier blood. Meanwhile Kowa had the ability to shrink to a inch tall and regenerate from wounds.<br>\r\n<br>\r\nAt a young age, Kowa realized that his chances of becoming a hero were slim. So he decided to attend normal high school and encourage Chizome to go to hero school. However, the boy didn't expect his brother to drop out saying the \"other student's resolve disgusted me\".<br>\r\n<br>\r\nChizome began to train and while it seem to just be fitness, Kowa became worried when his brother started to practice using blades. He told Kowa how many heroes were fake, and a new society needed to surface. The boy was confused by his brother's ranting and couldn't follow it. He eventually would in the worst way possible.<br>\r\n<br>\r\nAs Kowa finished up high school, tragedy struck. Thier parents died in a accident cause by a villian. Even after the villian was caught, the \"hero\" took in the praise not paying attention to those hurt. As Kowa cried in his brother's embrace, he finally understood.<br>\r\n<br>\r\nThere were fake heroes, and he would rid the world of them.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nDespite the supposed uselessness of his quirk, Kowa found it had many uses. By touching something he was able to shrink it down with him. This wasn't just limited to inanimate objects. <br>\r\n<br>\r\nAfter a good portion of time training, Kowa was ready to join his brother on a mission. By now Chizome had gone through a change. He had a more muscular built and lacked a nose, but Kowa didn't care. Him and Stain wouldn't be stopped.<br>\r\n<br>\r\nThe mission was simple. Kowa rushed at the \"hero\", and just as he was about to be hit he vanished. The\"hero\"then noticed a tingling on his neck, when suddenly he dwindled down to a inch tall. The \"hero\" watched confused as Kowa smirked and hopped away as a large shadow covered the area. The \"hero\" then looked up in horror as Stain loomed over him, boot raised and hands clenched. He couldn't even cry out as the steel-toed sole came down and crushed the \"hero\" into paste. Stain then gave his boot a good swivivel to spread the blood before grabbing Kowa and escaping.<br>\r\n<br>\r\nThis continued on for a good while, but eventually it changed. Kowa decided they needed allies and thought joining the League of Villians could help. Chizome on the other hand refused, saying thier ideals weren't the same. This lead to a fall out with the brothers and they decided to go different paths.<br>\r\n<br>\r\nDespite the tension, Kowa still gave a hug and good luck to his brother. As he left he swore he good hear a faint \"be careful\" behind him.<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\nKowa walked up to the alleyway door. Behind it was the bar where he would join The League of Villians.<br>\r\n<br>\r\n\"Hey you gonna go in or what?\"<br>\r\n<br>\r\nKowa jumped at the sudden voice, before turning around.<br>\r\n<br>\r\nThis person was.......</span></div></div>",
            "created":1534741200,
            "id":2536038,
            "title":"I'm a villian in training"
        }
    },
    "info":{
        "author_id":"craft9",
        "author_name":"creator9",
        "brief_description":"Enter the world of My Hero Academia, with a literal small quirk.",
        "created":1533104100,
        "description":"<td align=\"left\" class=\"norm\">Hey everyone! <br>\r\n<br>\r\nSo I'm back with another interactive. This one is going to focus entirely on the anime My Hero Academia!<br>\r\n<br>\r\nI was inspired to to this because.<br>\r\n<br>\r\n1, I have been posting BNHA chapters to the Giant World of Anime made by the macro anime senpai Darklord665.<br>\r\n<br>\r\n2, I have been gifted a basic membership by an anonymous user, which I am grateful for. I just want to make the most of it.<br>\r\n<br>\r\nThe overall basis of this interactive is that the main character has a quirk which allows them to shrink to an inch tall. The character can go by \"you\" or can be given a name. <br>\r\n<br>\r\nThis will somewhat resemble the Micro Storylines interactive, in the sense that I'll give a few options of how to start the story. For example, one option could have the character be moving to Japan. But another could have him related to a character.<br>\r\n<br>\r\nThe character can do more then just shrink. If you want to extend the quirk then go on ahead. <br>\r\n<br>\r\nNow then onto the rules <br>\r\n<br>\r\n- Keep all interactions M/M. Female characters can appear, but keep the heavy interaction to men.<br>\r\n<br>\r\n- Fetishes are allowed, though please refrain from scat  and piss. <br>\r\n<br>\r\n- if you add a choice please try to add to it. If you add a chapter, please try to add at least a paragraph.<br>\r\n<br>\r\n<br>\r\nNow then, read on and go PLUS ULTRA!<br>\r\n<br>\r\n</td>",
        "id":2165046,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1559360580,
        "modified":1559360580,
        "pretty_title":"The Small Hero"
    }
}