{
    "chapters":{
        "1":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "All girls school",
                "All boys school",
                "Co-ed school",
                "other somehow not mentioned?",
                "List #2"
            ],
            "content":"<div class=\"\"><div> <span>You've just been enrolled into Diaper Academy, where, big surprise, every single student wears diapers. With certain exceptions, all of the students are treated as their normal age, but there are very few bathrooms (used only by teachers and staff), and for the most part, all older students are expected to change themselves. <br>\r\n<br>\r\nNow, you've just moved into your new dorm room, you've got a fresh diaper on, and now it's time for your first day of classes to begin! But there's just one little problem:<br>\r\n<br>\r\n<br>\r\nWhat kind of school are you attending?</span></div></div>",
            "created":1347339600,
            "id":1425523,
            "title":"Let the padding begin"
        },
        "11":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Elementary School",
                "Middle School",
                "High School",
                "College",
                "Other somehow not listed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, what age group are you in?</span></div></span></div>",
            "created":1347339600,
            "id":1425528,
            "title":"All girls school"
        },
        "111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "You like diapers",
                "You're incontinent ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, one last question before your padded adventure can begin: Why are you in a diapered school?</span></div></span></div>",
            "created":1347339600,
            "id":1425529,
            "title":"Elementary School"
        },
        "1111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "All students wore short-skirted uniforms",
                "Students were to wear nothing at all except for a diaper",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Ever since you got out of diapers, you secretly wanted back into them, hiding them in your room, and wearing and using them behind your parents' backs. Near the end of 3rd grade, your mom accidentally walked in on you peeing in one, and you thought you were totally screwed, but instead, she just accepted that you liked diapers. <br>\r\n<br>\r\n\"Surprise!\" Your mom told you two months later during the second month of summer vacation. She showed you a pamphlet emblazened with the words;<br>\r\n<br>\r\n\"Diaper Academy?\" You blinked. You weren't sure whether to feel embarassed or happy by this. <br>\r\n<br>\r\n\"A school where every single student is put in diapers.\" Your mom said. \"I thought you would love it.\" <br>\r\n<br>\r\n\"Thanks, mom.\" You gave her a little kiss on the cheek. <br>\r\n<br>\r\nAnd so, another two months later, your mom dropped you off at the obscure all-girl diaper school, where you were directed to your new dorm, where you possessions were placed at your bed, same as your roommate, and you were directed to the start of school orientation, which revealed the student dresscode; </span></div></div>",
            "created":1347512400,
            "id":1426623,
            "title":"You like diapers"
        },
        "11112":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Manga reader Yuki. \"\"See your as dim as ever Ash.\" Sadi in a playfully try tone.",
                "Girl crazy Irish Lily \" Hey cutie miss me?\" Give a smack on Ashley's naked butt."
            ],
            "content":"<div class=\"\"><div> <span> (To see these characters look up Loli camp.)Young Ashley Williams had seen that all the students were to wear nothing but a diaper. This was nothing new to her, since she had been at a diaper camp last summer. She made it so her clothes were quickly removed. However she had forgotten to put on her diaper, leaving her nude. Rather then humiliate herself further she went to what looked like a bathroom, but it rather being a changing station. There was a bit of a line, which caused the poor girl to cover her private parts and blush.<br>\r\nShe was tapped on the shoulder, the girl turned around to find an old friend of her's from camp. As for who that was well it was none other then good old....</span></div></div>",
            "created":1356757200,
            "id":1497355,
            "title":"Students were to wear nothing at all except for..."
        },
        "111122":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Classes in session",
                "Ashley reunites with the old gang"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey cutie. Miss me?\" Ashley then felt a light smack and groping of her naked butt.<br>\r\n<br>\r\n\"Lilly?\" She blushed. <br>\r\n<br>\r\n\"I missed your cute butt so much.\" Lilly giggled. \"Rachel and Yuki are here too.\"<br>\r\n<br>\r\n\"Really?\" Ashley smiled, though privately wishing it was one of them who greeted her, rather than girl-crazy Lilly. \"And Ms. Vicky?\"<br>\r\n<br>\r\n\"Yup. She's one of our teachers.\" Lilly grinned, still rubbing Ashley's rear. <br>\r\n<br>\r\nFinally, the line shortened, and Ashely managed to get a changing station to herself, grabbing a fresh diaper from the provided bin and padding up. She had almost forgotten how good it felt being in nothing but a diaper.</span></div></div>",
            "created":1356757200,
            "id":1497362,
            "title":"Girl crazy Irish Lily \" Hey cutie miss me?&..."
        },
        "1111221":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "History (With Lily's blind uncle Mr. Conner as the teacher.)",
                "Sex class with Ms.Vickey."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So with Lily in most of her classes which one did she start out with?</span></div></span></div>",
            "created":1356757200,
            "id":1497365,
            "title":"Classes in session"
        },
        "11112211":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Poop in the diaper",
                "Hold it a bit longer"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On the way to history, Ashely's stomach starts to cramp and let's out a wet fart. She realizes she has to poop. She walks further and let's out another wet fart. What does she do?</span></div></span></div>",
            "created":1449723600,
            "id":2072820,
            "title":"On the way to history..."
        },
        "111122111":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "The one next to Jasmine.",
                "The one next to Brianna."
            ],
            "content":"<div class=\"\"><div> <span>She comes to a complete stop, grunts, then pushes as hard as she can. Her bowels empty and her diaper bulges, she continues to poop and the diaper keeps getting bigger and after five minutes she finally finishes pooping but ends up peeing her diaper from all that pushing and after 3 more minutes she is finally done and heads to class. When she gets there she has to pick between 2 spots. Which does she pick?</span></div></div>",
            "created":1449723600,
            "id":2072824,
            "title":"Messy girl..."
        },
        "1111221112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Go get there diapers changed?",
                "Go hang out somewhere?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley sits at the desk near Brianna. \"Hello, my name is Brianna!!\" she says and Ashley responds with \"Hey, my name is Ashley!!\". Then Brianna gets a whiff of Ashley's messy accident, \"Holy, you made a big load!\" whispered Brianna. \"Yeah I know, I really had to go before class and just let it go\" says Ashley. \"I know what you mean, but it's normal here so don't feel embarrassed\" says Brianna in a happy voice. \"Thanks\" says Ashley. Class starts and about 15 minutes later the teacher has to go get the photocopies, so we are left alone. \"Hey Ashley, do you need to poop? Because I do, REALLY BAD!!!\" says Brianna. \"Yeah i do too. Not as much but i guess the same as before I got to class. Let's just relax and let it out, ok?\" says Ashley. \"Ok\" says Brianna and they both lift their butts of the seats a bit and they start to push as hard as they can. Bulges were obvious on both of their diapers, especially Ashley's since she took a big dump before class. After 5 minutes Ashley is done but Brianna isn't and 2 12 minutes later, Brianna finishes with a bigger bulge then Ashley's but suddenly they both start to pee and after 2 minutes they both finish. Surprisingly, Ashley's diaper didn't leak and she felt relieved but she heard the Teacher saying there were extra diapers for people who really needed it so she went up and took one and put over her messy diaper. \"Just in case we go again!!\" says Ashley and just in time too, cause she gives out a wet fart and poops even more and after a minute, she is done. The Teacher finally returns and class goes on. After class they head out and they try to decide what to do next.</span></div></div>",
            "created":1449723600,
            "id":2072849,
            "title":"New friend Brianna!!!"
        },
        "111122112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "The seat next to Brianna",
                "The seat next to Jasmine"
            ],
            "content":"<div class=\"\"><div> <span>Ashley decides to hold it and head to class but lets out wet farts on the way. When you get to class you cramp up and lean forward but nothing happens but you let out another wet fart and a little bit of diarrhea slip into her diaper . So there are 2 seats to choose from. Which do you choose?</span></div></div>",
            "created":1449723600,
            "id":2072878,
            "title":"On to class!!"
        },
        "1111221121":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Go get there diapers changed? ",
                "Go hang out somewhere? "
            ],
            "content":"<div class=\"\"><div> <span>Ashley sits at the desk near Brianna. \"Hello, my name is Brianna!!\" she says and Ashley responds with \"Hey, my name is Ashley!!\". Then Brianna gets a peek at Ashley's desperation to go, \"Holy, you look like you need to badly!\" whispered Brianna. \"Yeah i do but i am fine\" says Ashley. \"I know what you mean\" says Brianna in a happy voice. \"Thanks\" says Ashley. Class starts and about 15 minutes later the teacher has to go get the photocopies, so we are left alone. \"Hey Ashley, do you need to poop? Because I do, REALLY BAD!!!\" says Brianna. \"Yeah i do too. Can't hold mine much longer. Let's just relax and let it out, ok?\" says Ashley. \"Ok\" says Brianna. \"Hold on\" says Ashley cause she heard the Teacher saying there were extra diapers for people who really needed it so she went up and took one and put over her diaper. \"Ok i a ready\" says Ashley and they both lift their butts of the seats a bit and they start to push as hard as they can. Bulges were obvious on both of their diapers, especially Ashley's since she took a big dump before class. After 5 minutes Ashley and Brianna continue pooping with big bulges coming out of their diapers and 2 12 minutes later, Brianna finishes with a slightly smaller bulge then Ashley's but suddenly they both start to pee and after 2 minutes, Brianna finishes but Ashley is going full force and 1 12 minutes later Ashley finally finishes. Surprisingly, Ashley's diaper didn't leak and she felt relieved but suddenly she gives out another wet fart and poops even more and after a minute, she is done. The Teacher finally returns and class goes on. After class they head out and they try to decide what to do next.</span></div></div>",
            "created":1449723600,
            "id":2072884,
            "title":"The seat next to Brianna"
        },
        "11112211211":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "\"Hey there, how's it going?\" *Let's out a wet fart\"?",
                "\"How's your condition?\" *Pees her diaper in complete KARMA*?"
            ],
            "content":"<div class=\"\"><div> <span>(Before the chapter starts, there were mistakes like when Ashley took a dump before class was a mistake so ignore that and the title is \"New friend Brianna!!\"!! Enjoy!!)<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- -------------------------------------------------------------------------------- --<br>\r\n<br>\r\nThey go to the changing line where they feel each others diapered butts and the mess they have made Brianna spanks Ashley on her cute butt and Ashley does it back. \"Man you have a cute butt\" says Brianna. \"Thanks, yours is too\" replied Ashley. \"Thanks\" says Brianna as she continues to play with Ashley's cute diapered butt and you can tell she was enjoying it and Ashley let it happen as she was playing with Brianna's diapered bum and as they were enjoying it, they also messed there diapers again in the process. While they were there Yuki is walking by the line to get to class when Ashley and Brianna notice the big bulge in Yuki's diaper and they get her to come over to ask her is she needed to be changed and she said no she would be fine. \"Who's this?\" Yuki asked. \"This is Brianna, we are friends now and we are just going to get our diapers change\". \"Neat\" Yuki replied as she walked away in her messy diaper that sagged back and forth and as Ashley spanked Yuki's butt, Ashley and Brianna heared a loud fart coming from Yuki and the sound of diarrhea going into her diaper. \"Wow, she isn't bothered by it at all!!\" says Brianna. \"I know!!\" replied Ashley. Finally, they get there diapers changed and they now decide to go back to the dorm cause Brianna is actually new and was going to be place in our dorm along with Yutaka, a tiny, shy, frail little girl with urinary incontinence who just arrived today as well as Brianna. They return to the dorm to see Ms.Vicky with the other new roommate Yutaka, Ashley and Brianna go up to her and Ashley tells her...</span></div></div>",
            "created":1449723600,
            "id":2072896,
            "title":"Diaper changed and new roommates!!!"
        },
        "111122112111":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Yutaka?",
                "Brianna?"
            ],
            "content":"<div class=\"\"><div> <span>...\"Hey there, how's it going?\" she says. \"G-g-good...\" Yutaka replies as she heard a wet fart come from Ashley. \"I just changed...\" says Ashley. \"It's ok...At least i am not alone in my predicament, at least others wear diapers\" says Yutaka. \"Yeah...\" replies Ashley as she hears an unmistakable sound of peeing that is coming from Yutaka but not only that, Ashley began to poop in her diaper and after 2 minutes, both of them were done and Ms.Vicky offered to clean us up. During the night, Ashley caught the stomach flu and got up at 1:00 AM in pain and she kept having diarrhea in her diaper and every hour the same would happen every hour, but at 3:30 AM she took a thicker diaper and put it over her really messy one and continued pooping in her diaper. She also vomited at least 3 times during the night and at 4:00 AM, it got worse. Ashley was leaning on her bed side pooping her diaper for nearly an hour while putting on more layers of diapers to avoid leaking. 5:00 AM hit and she is still going. She is in a lot of pain and is having so much diarrhea. She kept farting and pooping it was ridiculous. Finally at 5:45 AM she stopped and able to go back to sleep. 9:00 AM she woke up a little tired but mostly awake and walked to the counter where Brianna saw the MASSIVE load Ashley had made. \"Holy, what happened?!\" said Brianna. \"Stomach Flu..\" replied Ashley as she explained her story while peeing twice and pooping 3 times during it and she still doesn't feel well. \"I will change when i feel better...I am going to put another layer an go back to bed\" said Ashley. \"Ok, feel better soon alright?\" said Brianna. \"Thanks\" replied Ashley. She headed for the pile of diapers and slapped another one over her messy butt and she headed to her bed pooping again in the process and goes back to sleep. The next morning, someone wakes Ashley up. Who is it?</span></div></div>",
            "created":1449723600,
            "id":2072902,
            "title":"Nighttime terror..."
        },
        "1111221121111":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Health Class w/ Ms.Catherine",
                "Gym Class w/ Ms.Tiffany"
            ],
            "content":"<div class=\"\"><div> <span>\"H-h-hello? I see the massive mess you made, you wanna get changed with me?\" asked Yutaka. Ashley replies \"Sure\" as she pooped one last time and it was huge that lasted 5 minutes which made Yutaka pee in her diaper and after Ashley and Yutaka were done, Ashley was feeling a lot better with 6 layers of diapers on her she goes and gets changed with Yutaka and then they go shower together. \"This is nice isn't it?\" asked Ashley. \"Yeah\" said Yutaka. When they finish showering, what's next?</span></div></div>",
            "created":1449723600,
            "id":2072913,
            "title":"Fun with Yutaka!!"
        },
        "11112211211112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Yes?",
                "No?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley and Yutaka go to gym class and they were the first ones there, after they got into their gym clothes, they all huddled up in the middle of the gym to explain the rules of Dodge ball. Then the game started, Ashley and Yutaka were on the same team and won 3/5 games which made their team the winners. After gym, there diapers were wet and they bump into Ms.Vicky who said that this Saturday, she will hold a big game of Truth or Dare for Halloween and she invites both of you, along with Brianna. Do you go?</span></div></div>",
            "created":1453093200,
            "id":2091011,
            "title":"Dodge ball..."
        },
        "111122112111121":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><div> <span>It's Saturday night and Ashley, Yutaka and Brianna arrive where 7 more people are there. \"Welcome to the big game of truth or dare!! Rule, do each dare and answer each truth and you move on but here is the catch, if you chicken out, you are to eat a bowl of oatmeal laced with laxatives, not too much though. Their is no winner, it's just to see if you can endure the dares, there are cards with truth being one pile and dares on the other pile. Pick one of the cards that your adversary wants and read it to her, if she chickens out, well, you know the punishment and also, you won't be changed until either the next dare that makes you do something with the diaper, or till the game ends!! Understand? Also,i will be wearing a diaper for this game to make this fair\". They all understand and get their diapers changed before the game begins and it starts with Ashley. Truth or Dare?</span></div></div>",
            "created":1453093200,
            "id":2091019,
            "title":"Truth or Dare...."
        },
        "1111221121111212":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Do it?",
                "Chicken out?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"The dare is...wear at least 3 layers of diapers for the rest of the game...\"</span></div></span></div>",
            "created":1453093200,
            "id":2091020,
            "title":"Dare?"
        },
        "11112211211112121":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley puts on 2 more diapers to make it 3 and sits back down. The others get their turn and Yutaka got a dare to pee in her diaper which is not hard for her and we got Brianna who chickened out on one that said put balloons full of Alka-Seltzer in her diaper and try not to pop it which meant she had to eat lax-laced oatmeal. It was Ashley's turn. Truth or Dare?</span></div></div>",
            "created":1453093200,
            "id":2091022,
            "title":"Truth or Dare?"
        },
        "111122112111121212":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Do it?",
                "Chicken out?"
            ],
            "content":"<div class=\"\"><div> <span>\"Give yourself an enema and hold it for 10 minutes, each time you fail, you eat a bowl of lax-laced oatmeal and you can change when you fail 3 times and when you succeed you must keep the diaper you messed in if you failed less then 3 times on and you remember your last dare, don't you? Also says here that if you chicken out on this one, you must eat 3 bowls of lax-laced oatmeal.\" says Ms.Vicky.</span></div></div>",
            "created":1453093200,
            "id":2091026,
            "title":"Dare?"
        },
        "1111221121111212121":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley gets the enemas and start putting them in, she tries first time and failed after 6 minutes and she messes her diaper, it took her 13 tries after the first one to do it and that means she is stuck with a messy diaper and 14 bowls of lax-laced oatmeal. Her stomach growls and she fills her diaper again cause of the enema.<br>\r\nTurns go by and its hers again. Truth or Dare?</span></div></div>",
            "created":1453093200,
            "id":2091030,
            "title":"Enema frenzy!!"
        },
        "11112211211112121211":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Yes (Lie)",
                "No (Truth)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Truth, were you forced into diapers?\" Ms.Vicky</span></div></span></div>",
            "created":1453093200,
            "id":2091037,
            "title":"Easy..."
        },
        "111122112111121212112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ashley's stomach growls and the urge to go hit you, but it isn't too bad but Brianna had a messy diaper and her next turn felt like forever but her turn arrived. Truth or Dare?</span></div></span></div>",
            "created":1453093200,
            "id":2091038,
            "title":"Worsening stomach"
        },
        "1111221121111212121122":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Do it?",
                "Chicken out?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Drink 10 ounces of water...\" said Ms.Vicky.</span></div></span></div>",
            "created":1453093200,
            "id":2091039,
            "title":"Water...."
        },
        "11112211211112121211221":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ashley drank the water and waited for her turn, Yutaka's diaper was messy and wet and also, Ms.Vicky's. Truth or Dare?</span></div></span></div>",
            "created":1453093200,
            "id":2091040,
            "title":"Chug away!!"
        },
        "111122112111121212112211":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Yes (Lie)",
                "No (Truth)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Truth, Does any of your family members also wears diapers\" says Ms.Vicky.</span></div></span></div>",
            "created":1453093200,
            "id":2091041,
            "title":"Siblings"
        },
        "1111221121111212121122112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley starts releasing wet farts and finally let's go as she starts to mess heavily in her diaper from all that laxatives. She holds out on the game till she is done which took an hour and 10 minutes to finish and the 7 minutes to pee, luckily her diaper held it all, cause they were 3 layers of 70% extra leakage protection diapers, but her diaper was bulging big time, more then everyone else. She comes back to the game and it's her turn. Truth or Dare?</span></div></div>",
            "created":1453093200,
            "id":2091044,
            "title":"No longer...."
        },
        "11112211211112121211221122":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Do it?",
                "Chicken out!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"This dare, is simple, just take 5 enemas but since you just had that happens I will shorten it to 3!\" Said Ms.Vicky.</span></div></span></div>",
            "created":1458363600,
            "id":2119803,
            "title":"Dare?"
        },
        "111122112111121212112211221":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"This is gonna suck...\" Thought Ashley and she puts in 3 enemas which make her stomach growl BIG TIME!! Turns go by and everyone is now in a messy diaper and your holding in the enema, your turn comes again. Truth or Dare?</span></div></span></div>",
            "created":1458363600,
            "id":2119805,
            "title":"Do it?"
        },
        "1111221121111212121122112211":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Yes (Lie)",
                "No (Truth)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Ok, truth, if you had the choice to get out of diapers, would you take it?\" Ms.Vicked asked.</span></div></span></div>",
            "created":1458363600,
            "id":2119806,
            "title":"Truth?"
        },
        "11112211211112121211221122112":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Truth?",
                "Dare?"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh that's nice!\" Says Ms.Vicky. When Ashley decides to answer, a big wet fart emerges and you mess her diapers again, this time it leaks and Ms.Vicky says to add more layers cause she cannot break any rules, so Ashley puts on 3 more layers and finishes messing her diapers which took 15 minutes. Turns go by and the final round emerges after your next turn, so 2 rounds remaining and it is now your turn! Truth or Dare?</span></div></div>",
            "created":1458363600,
            "id":2119810,
            "title":"Let loose"
        },
        "1111221122":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Go get there diapers changed?",
                "Go hang out somewhere?"
            ],
            "content":"<div class=\"\"><div> <span>Ashley sits at the desk near Jasmine. \"Hello, my name is Jasmine!!\" she says and Ashley responds with \"Hey, my name is Ashley!!\". Then Jasmine gets a peek at Ashley's desperation to go, \"Holy, you look like you need to badly!\" whispered Jasmine. \"Yeah i do but i am fine\" says Ashley. \"I know what you mean\" says Jasmine in a happy voice. \"Thanks\" says Ashley. Class starts and about 15 minutes later the teacher has to go get the photocopies, so we are left alone. \"Hey Ashley, do you need to poop? Because I do, REALLY BAD!!!\" says Jasmine. \"Yeah i do too. Can't hold mine much longer. Let's just relax and let it out, ok?\" says Ashley. \"Ok\" says Jasmine. \"Hold on\" says Ashley cause she heard the Teacher saying there were extra diapers for people who really needed it so she went up and took one and put over her diaper. \"Ok i a ready\" says Ashley and they both lift their butts of the seats a bit and they start to push as hard as they can. Bulges were obvious on both of their diapers, especially Ashley's since she held it in. After 5 minutes Ashley and Jasmine continue pooping with big bulges coming out of their diapers and 2 12 minutes later, Jasmine finishes with a slightly smaller bulge then Ashley's but suddenly they both start to pee and after 2 minutes, Jasmine finishes but Ashley is going full force and 1 12 minutes later Ashley finally finishes. Surprisingly, Ashley's diaper didn't leak and she felt relieved but suddenly she gives out another wet fart and poops even more and after a minute, she is done. The Teacher finally returns and class goes on. After class they head out and they try to decide what to do next.</span></div></div>",
            "created":1449723600,
            "id":2072887,
            "title":"New friend Jasmine!!!"
        },
        "11112212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"Can I have three volunteers strip for me?\"",
                "\"I'd like you all to look at 'this.'\" (Her vagina)"
            ],
            "content":"<div class=\"\"><div> <span>It was enough of a pleasant surprise to meet up with her old diaper camp bunkmates again, but when they started started sex ed class, only to find their teacher to be Ms. Vicky, their counselor. Even more surprising that the large-breasted woman started undressing after introducing herself to the class.<br>\r\n<br>\r\n\"This year, all you girls will be learning sex ed from me,\" Vicky continued in her introduction. \"I won't be needing any clothes for this month, because we'll be learning all about female physiology.\"<br>\r\n<br>\r\n\"My favorite.\" Lilly grinned enthusiastically, eyes on Vicky's huge tits as she rubbed her nether regions through her diaper.<br>\r\n<br>\r\n\"Now then, before we begin our first lesson....\" Vicky went on.</span></div></div>",
            "created":1357362000,
            "id":1502609,
            "title":"Sex class with Ms.Vickey."
        },
        "111122121":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Lily is the first to pick.",
                "Zoe is the first to pick."
            ],
            "content":"<div class=\"\"><div> <span>\"No I'll need three volunteers to strip for me, before class can start.\" Ms.Vicky said.<br>\r\n<br>\r\nAshley could have sworn Lily gained super powers, as she was all the way in front of the class nude. <br>\r\n<br>\r\n\"Well that's one.\" The teacher said laughing.<br>\r\n<br>\r\nAnother girl came forward, this time it was a young black girl, smiling, as she tossed her now wet diaper on the floor, showing off her nude body.<br>\r\n<br>\r\n\"Zoe, thank you very much.\" The teacher sad.<br>\r\n<br>\r\nShe just smiled.<br>\r\n<br>\r\nThe teacher waited for another girl to come up, yet no one was really willing.<br>\r\n<br>\r\n\"I guess I'll just have to pick a girl at random.\" Ms.Vicky stated.<br>\r\n<br>\r\nShe then checked her class roster and found.<br>\r\n<br>\r\nAbby, would you please come here?\" She asked.<br>\r\n<br>\r\nAshley, Rachel, and Yuki took a breath of relief, thanking God, they didn't have to come up.<br>\r\n<br>\r\nThey found a black haired looking goth girl with a smile and a spiked dog collar on her neck.<br>\r\n<br>\r\nShe took of her diaper, and went to the front of the class.<br>\r\n<br>\r\n<br>\r\n\"I see your wearing a chocker Abby, that's very good. Because today's class is going to be about the BDSM kink. Now the three girls who came up willing are going to be the top, or Dom, while the three girls they pick are going to be the sub, or slave Granted they aren't allowed to hurt anyone class, but whoever they pick will have listen to them or they will fail the class.\" She explained.<br>\r\n</span></div></div>",
            "created":1357621200,
            "id":1504558,
            "title":"\"Can I have three volunteers strip for me?&..."
        },
        "1111221211":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Yuki",
                "Ashley"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait... 'whoever they pick?'\" Ashley thought, knowing exactly where this might be going.<br>\r\n<br>\r\n\"Lilly, you pick first.\" Vicky proceeded. Lilly put on her typical naughty kitty face as she scanned the class, knowing exactly who she'd pick....</span></div></div>",
            "created":1357621200,
            "id":1504559,
            "title":"Lily is the first to pick."
        },
        "11112212112":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Zoe, Abby grab your pick",
                "Put them on her Lily."
            ],
            "content":"<div class=\"\"><div> <span>While Lily was going to pick Yuki, the four eyed girl had given her a glare, that had scared the heck out of her.<br>\r\nShe then turn to Ashley, making the blonde glup.<br>\r\n<br>\r\n\"Don;t worry cutie, be good for me and i'll be good for you.\" She whispered.<br>\r\n<br>\r\nAshley had no choice now, she followed her friend to the front of the class.<br>\r\n<br>\r\nMs.Vicky then pulled out a box, and opened it. It had rope, handcuffs, gags, collars, leashes, masks, sex toys, paddles, and outfits<br>\r\n<br>\r\n\"Lily, keep whatever you want to use on your sub.\" Ms.Vickey said.<br>\r\n<br>\r\nLily grabbed a paddlem a pink ball gag, a pink collar, a matching pink leash, and a straight jacket.<br>\r\n<br>\r\n\"Good, now...</span></div></div>",
            "created":1357621200,
            "id":1504566,
            "title":"Ashley"
        },
        "111122121121":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Zoe",
                "Lilly"
            ],
            "content":"<div class=\"\"><div> <span>Zoe picked out a dildo, two pairs of handcuffs, and an ass spreader, while Abby simply chose a strap-on.<br>\r\n<br>\r\n\"Interesting choices...\" Vicky nodded, though someone surprised these two didn't choose more items. \"Alright now, who's going first?</span></div></div>",
            "created":1358139600,
            "id":1508442,
            "title":"Zoe, Abby grab your pick"
        },
        "111122121122":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"We'll get to that later\"",
                "Because she's not the sub; YOU are!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hoped that I would.\" Lilly smiled enthusiastically as she put the collar on Ashely, before she started resisting.<br>\r\n<br>\r\n\"Ashely, none of that!\" Vicky spoke up. \"This is part of class. If you resist, things will get much worse for you.\" <br>\r\n<br>\r\n\"Sorry ma'am.\" Ashely stopped immediately. She REALLY didn't want Lilly to put the other things on her, but she knew from experience at camp better than to defy Ms. Vicky. <br>\r\n<br>\r\n\"Ms. Vicky? I have a question.\" Lilly spoke up, almost ready to put the rest of the bondage gear onto Ashely. \"If Ashley's my sub here, how come I have to be the one naked?\"</span></div></div>",
            "created":1361941200,
            "id":1540427,
            "title":"Put them on her Lily."
        },
        "1111221211221":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Ashely's thought:\"This isn't too bad, I'd rather have her brother as my dom!",
                "Ms. Vicky: Now for the others."
            ],
            "content":"<div class=\"\"><div> <span>\"We'll get to that later. Now dress up your sub, take note class at how they control their sub.\" Ms.Vicky stated.<br>\r\n<br>\r\n<br>\r\nLily had she started to put on Ashley's straight  jacket. Making her arms useless. <br>\r\n<br>\r\n'What a good girl you are.\" Lily said petting her like a dog. <br>\r\n<br>\r\nShe the attached the leash to Ashely's collar.<br>\r\n<br>\r\nAsh did her best do not do anything in spite of her dom's wandering hands.<br>\r\n<br>\r\n\"Okay now open up!\" Lily ordered.<br>\r\n<br>\r\nAsh huffed as she opened her mouth. The ball gag went in and  was strapped in tight.<br>\r\n<br>\r\nAfter that..</span></div></div>",
            "created":1361941200,
            "id":1540580,
            "title":"\"We'll get to that later\""
        },
        "11112212112211":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "couldn't resist the temptation, removed the gag, and gave Ashley the order.",
                "somehow managed to resist the urge."
            ],
            "content":"<div class=\"\"><div> <span>Ashely's thought:\"This isn't too bad, I'd rather have her brother as my dom!\"<br>\r\n<br>\r\nUnfortunately  Ms. Vicky interrupted her thoughts by saying with a unmistakable grin \"Lily now is the time to answer your question. The sub needs to wear a diaper for practical reasons, since it would destroy the sexual atmosphere if the dom had to clean up the accidents of the sub, as well as because it highlights the superiority of the Dom, if only the sub is diapered and finally the dom wants to be naked, so that the sub is able to please her if ordered so. If you remove Ashley's gag I am sure some ideas will come to your mind.\"<br>\r\n<br>\r\nLily couldn't believe her luck, Ms. Vicky just gave her the consent to order Ashley to lick her pussy. On one hand she doesn't want to miss this once in a lifetime opportunity, but on the other hand she knew that it would probably end their friendship for good. In the end she </span></div></div>",
            "created":1361941200,
            "id":1540642,
            "title":"Ashely's thought:\"This isn't too ba..."
        },
        "111122121122112":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "She need to wear the Collar and leash.",
                "Had extra homework."
            ],
            "content":"<div class=\"\"><div> <span>Lily thought about the tempting idea but Ashely's pleading eyes, and being catholic her shoulder angel was showing up.<br>\r\n<br>\r\n\"Lily this is your friend, and you know she doesn't like like that, don't force her to do something that's not in her.\" The angel said.<br>\r\n<br>\r\nSuddenly a tiny devil girl showed up.<br>\r\n<br>\r\n\"Oh get lost Tinker Bell! Go for it kid, make her your bitch, it's in the class, you might get extra credit!\" The devl girl said.<br>\r\n<br>\r\n\"How are you calling Tinker Bell you hussy!?\" The Angel said pushing her.<br>\r\n<br>\r\n\"Oh a wise ass huh!\" The two started to fight/<br>\r\n<br>\r\nLily said.<br>\r\n<br>\r\n'I'll save that for another girl.\" Lily said.<br>\r\n<br>\r\nclass kept going until the end. Ashely was free..but</span></div></div>",
            "created":1361941200,
            "id":1540690,
            "title":"somehow managed to resist the urge."
        },
        "1111221211221121":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Ashley gives in, because Ms. only want to help her.",
                "She resists."
            ],
            "content":"<div class=\"\"><div> <span>Just as the gang was going to left the class room, Ms. Vicky walked to them and said \"Ashley I hope I didn't scared you too much, I just planted these ideas into Lily's mind to show the class the most important rule that every dom needs to follow, which is not to missuse the control that (s)he has over the sub. You see Lily thought that she had the once in a lifetime opportunity to force you to do something that you  wouldnt never doon your own free will, and  she made the right decision of course I had stopped her if she had made the wrong decision. But unfortuneately I can't let you off of the hook, as easily as the two subs. You have to wear the collar and leash for the rest of the day.\"<br>\r\n<br>\r\n\"But Madam that is unfair, why I am the only that has to do that?\" Ashley argued.<br>\r\n<br>\r\n\"Ashley it is very simple, you are the only one who clearly enjoyed being the sub, even though you would probably prefer to be the sub of a male dom. But since this isn't a option here at this school, you wouldn't continue to practice being the sub, by yourself, but since you want to be the best sub possible for someone else, Lily here will make sure that you improve your required skills, she already proved that you can trust her. Well Ashley, do  you accept this order, or need I to punish you?\"</span></div></div>",
            "created":1362027600,
            "id":1541037,
            "title":"She need to wear the Collar and leash."
        },
        "11112212112211211":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "The girls talked of home.",
                "Heard someone being bullied."
            ],
            "content":"<div class=\"\"><div> <span>\"Ok fine.\" Ashley pouts.<br>\r\n<br>\r\nThe collar and leash were put on Ashely once again.<br>\r\n<br>\r\nHowever before Lily could grab i, Yuki punched her in the face and grabbed it before Ms.Vicky could see it.<br>\r\n<br>\r\nIt was lunch already. Yuki and Lily were aurging with one another.<br>\r\n<br>\r\n\"Your sick, you that?!\" Yiku hissed.<br>\r\n<br>\r\n\"What, I didn't touch her.\" Lily said.<br>\r\n<br>\r\n\"You were going too!\" Yuki said.<br>\r\n<br>\r\n<br>\r\n\"Guys lets not fight.\" Rachel begged.<br>\r\n<br>\r\n<br>\r\n\"So how was going back home?\" Ashely said trying to avoid a fight.</span></div></div>",
            "created":1362027600,
            "id":1541103,
            "title":"Ashley gives in, because Ms. only want to help ..."
        },
        "111122121122112111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Ashely decides to trust Lily.",
                "Ashley is still sceptical about Lily's intentions."
            ],
            "content":"<div class=\"\"><div> <span>\"Ashley you don't need to be shy about it, I  already know that you want to be my brother's sub and that you therefore want to know if he is still interested and unattached. And yes, to both, he even misses you more than he misses me. Just tell Yuki that she should hand the leash to me, so that I can make sure that you are ready for my brother by time I manage to arrange a opportunity for you two love birds to spend a weekend together, just like Ms. Vicky told me to.\" Lily reasons.<br>\r\n<br>\r\nYuki looked at Ashley concerned and asked \"Ashley are you really sure, about that, I know you have a crush on her brother, but is he really worth that?\"<br>\r\n</span></div></div>",
            "created":1362027600,
            "id":1541162,
            "title":"The girls talked of home."
        },
        "1111221211221121111":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "The next day. PE",
                "Dinner time"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...It would be nice to see James again.\" Ashely said.<br>\r\n<br>\r\n'Yuki give her my leash please.\" She asked.<br>\r\n<br>\r\n Yuki eyed Lily and Rachel nooded.<br>\r\n<br>\r\nThey handed it over to the red head.<br>\r\n<br>\r\nLater at their dorm.<br>\r\n<br>\r\n<br>\r\nRachel was sucking on a pacifier gag. With Yuki colaring her with a leash.<br>\r\n\"It's our homework nothing more.\" Yuki said.<br>\r\n<br>\r\n</span></div></div>",
            "created":1362027600,
            "id":1541280,
            "title":"Ashely decides to trust Lily."
        },
        "1111221211221122":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Ashley decided to do the kiss-test, because she didn't saw any harm in it.",
                "Ashley was too afraid of the result, to agree to Lily's deal."
            ],
            "content":"<div class=\"\"><div> <span>Ms Vicky gave Ashley and the two other subs the homework to write an essay about how they felt about being dominated during the class, while the doms had to give a oral presentation the next day, and Ashely was very glad that she didn't had to admit in front of the whole class. As the gang walked to their next class Ashley in Lily's ears \"Thank you very much Lily, for resisting the urge.\"<br>\r\n<br>\r\n\"Don't mention it, because now that I know that you enjoy being the sub,  and there is no point denying it I saw that look in your eyes, I don't know if I can turn down the next opportunity as well. You see Ashely the main reason why this is so hard for me, is because there is still a chance that you return my feelings, but that you aren't aware of it yet. To be honest I wasn't born girl crazy, until my best friend back then kissed me a few years, I thought I was as boy crazy as Rachel, Yuki and you.\"<br>\r\n<br>\r\n\"Wait Lily are you asking me to kiss you to prove that I am not into girls.\" Ashley interrupted her.<br>\r\n<br>\r\n\"Just think about it, no matter what the kiss-test shows you can only win, either it shows that you aren't into girls, which would make it easier for me to move on, and then I could bring myself to arrange it so that you can be my brother's sub on the weekends, and if it should show the contrary you could be my sub, every night.\" Lily explained.</span></div></div>",
            "created":1361941200,
            "id":1540793,
            "title":"had extra homework."
        },
        "11112212112211222":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Don't you need a change?",
                "Where is Rachel?"
            ],
            "content":"<div class=\"\"><div> <span>\"Um, how about no.\" Ashely said.<br>\r\n<br>\r\n\"Okay suit yourself.\" Lily said<br>\r\n<br>\r\n<br>\r\nYuki was reading Hellsing in the dorm after all the classes went.<br>\r\n<br>\r\n<br>\r\nAshley and Lily looked at her and said.<br>\r\n<br>\r\n</span></div></div>",
            "created":1362027600,
            "id":1541276,
            "title":"Ashley was too afraid of the result, to agree t..."
        },
        "111122121122112221":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"You girls are getting a new roommate.\"",
                "\"It's naked time!\"",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Yuki's superpuff diaper was, true to its brand name, extremely puffed out in the front, dyed bright yellow from almost a full day's worth of wettings, a little more puff showing as she pushed some more out of her.<br>\r\n<br>\r\n\"Nope. I'm good.\" Yuki answered casually, not taking her eyes away from her manga. \"Gotta love superpuffs.\"<br>\r\n<br>\r\n\"Oookay...\" Lilly muttered. \"How about you, Ashely? You look like you might be on the verge of leaking...\"<br>\r\n<br>\r\n\"No one's falling for that twice, Lilly.\" Ashely laughed, procuring her own change.<br>\r\n<br>\r\n\"Damn!\" Lilly muttered. <br>\r\n<br>\r\n\"Everyone settling?\" Vicky came into the room, checking on her former campers, current students.<br>\r\n<br>\r\n\"Yes, ma'am.\" Ashely nodded, stripping off her used diaper for a fresh one.<br>\r\n<br>\r\n\"Yep.\" Rachel answered, returning from her shower, showing no sense of modesty as she walked out in her birthday suit.<br>\r\n<br>\r\n\"Mm.\" Yuki grunted.<br>\r\n<br>\r\n\"You betcha.\" Lilly agreed. <br>\r\n<br>\r\n\"Good. Because......\" </span></div></div>",
            "created":1364274000,
            "id":1558431,
            "title":"Don't you need a change?"
        },
        "1111221211221122211":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Yutaka, a tiny, shy, frail little girl with urinary incontinence ",
                "more options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"....A new girl's been assigned to your room.\"<br>\r\n<br>\r\n\"Really?\" Rachel blinked, drying her hair with a towel. \"Who?\"</span></div></span></div>",
            "created":1364274000,
            "id":1558433,
            "title":"\"You girls are getting a new roommate.\""
        },
        "11112212112211222111":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "\"How are you?",
                "You okay?"
            ],
            "content":"<div class=\"\"><div> <span>Ms.Vicky showed a tiny, shy, frail looking,  i mean to the point where you could blow on her and she's fly away asain girl wearing a pamper diaper. Her hair was black and short.however she hid behind the older woman when the other girls tired to look at her.<br>\r\n<br>\r\n\"No, no it's okay sweet heart they aren't going to hurt you. Girls this is Yutaka, she's your new roommate, now I want you to be extra nice to her understand?\" Ms.Vicky asked.<br>\r\n<br>\r\n\"Yes ma'am they all said as she left.<br>\r\n<br>\r\nYutaka looked at them all.<br>\r\n<br>\r\n<br>\r\n\"Hi.\" Rachel said.<br>\r\n<br>\r\n\"Don't worry no one is going to hurt you okay?\" Yuki stated.<br>\r\n<br>\r\n<br>\r\nYutaka didn't say anything but went closer to Yuki.<br>\r\n<br>\r\n\"Aw you two look so cute.\" Lily said.<br>\r\n<br>\r\n\"Can it.\" Yuki said blushing.<br>\r\n<br>\r\nAshely smiled.<br>\r\n<br>\r\n\"So Yutaka<br>\r\n<br>\r\n</span></div></div>",
            "created":1365742800,
            "id":1570333,
            "title":"Yutaka, a tiny, shy, frail little girl with uri..."
        },
        "111122121122112221111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "take a bath",
                "have a change"
            ],
            "content":"<div class=\"\"><div> <span>\"Um... I'm doing okay...\" Yutaka answered meekly, shivering slightly as she fidgeted nervously. \"It's... a bit cold isn't it?\"<br>\r\n<br>\r\n\"You're just used to wearing more over your diaper, is all.\" Rachel grinned, not bothering to get changed, laying naked on her bed.<br>\r\n<br>\r\n\"So, why are you diapered, little Cutie?\" Lilly asked playfully.<br>\r\n<br>\r\n\"Don't even think about it.\" Yuki muttered warningly.<br>\r\n<br>\r\n\"My bladder doesn't work properly.\" Yutaka blushed uncomfortably. \"Um.... I hope we can all be friends.\"<br>\r\n<br>\r\n\"We might be more than just friends.\" Lilly smirked. \"I'm \"Lilly, by the way. Just ask me, and ill gladly change your cute little nappy whenever you want.\"<br>\r\n<br>\r\n\"I'm glad.\" Yutaka smiled. <br>\r\n<br>\r\n\"Don't let her.\" Yuki whispered. \"She'll just try to take advantage of you.\"<br>\r\n<br>\r\nI would never...!\" Lilly gasped in mock-indignance.<br>\r\n<br>\r\n\"Sure, just like you didn't take advantage of Ashley when she needed a change.\" Rachel laughed.<br>\r\n<br>\r\n\"I took up her offer to give me a change when we were in the woods, and I ended up going the rest of the hike naked.\" Ashley told Yutaka.<br>\r\n<br>\r\n\"Oh.....\" their new roommate blushed madly, telling the others she would probably die of embarassment if that happened to her. \"Um.... I need to....\"  <br>\r\n<br>\r\n  </span></div></div>",
            "created":1365742800,
            "id":1570526,
            "title":"\"How are you?"
        },
        "1111221211221122211111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "shyly accepted Yuki's offer.",
                "decided to ask another of her roommates. "
            ],
            "content":"<div class=\"\"><div> <span>\"Oh.....\" their new roommate blushed madly, telling the others she would probably die of embarassment if that happened to her. \"Um.... I need to.. take a bath.\"<br>\r\n<br>\r\nJust then a unmistakeable smell filled the air and Yutaka blushed deeply, before Lilly had the chance to react, Yuki quickly walked over to Yutaka took her hand and whispered into her ear. \"Don't worry Yuta, we all use our diapers, for that too. How about we both take a nice comfortable bath together, don't be afraid I am not like Lilly, besides we both probably look very similar down there, despite the size difference.\" <br>\r\n<br>\r\nYutaka </span></div></div>",
            "created":1365742800,
            "id":1570556,
            "title":"take a bath"
        },
        "11112212112211222111111":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "...It started as a  punishment.",
                "I'd rather not talk about it."
            ],
            "content":"<div class=\"\"><div> <span>Yutaka smiled and said.<br>\r\n<br>\r\n\"Okay,\" she said.<br>\r\n<br>\r\nThe two girls went into the bath. Yuki took off her glasses not to get them wet as they started to clean themselves.<br>\r\n<br>\r\n\"Aw, they'd make a cute couple.\" Lily said.<br>\r\n<br>\r\n\"A couple of what?\" Ashely asked.<br>\r\n<br>\r\nThe three then got started on their homework.<br>\r\n<br>\r\nMeanwhile in the bath. Yuki and Yutaka were cleaning each other.<br>\r\n<br>\r\n\"So Yuki why are you here?<br>\r\n</span></div></div>",
            "created":1365915600,
            "id":1571719,
            "title":"shyly accepted Yuki's offer."
        },
        "111122121122112221111111":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "more about the other girls?\"",
                "what is wrong with Lilly?"
            ],
            "content":"<div class=\"\"><div> <span>\"... It started as a punishment. I have a rather small bladder, it is not very bad, I just have to use the bathroom a little more often than other girls. I know that my storry sounds stupid but, one day I got tired of having to interrupt reading my favorite mangas so often, to use the bathroom, that I bought diapers in my size and wore them whenever I had the house for myself. Needless to say, I was caught, and my parents sent my to a summer camp for diapered girls, they appartenly thought that would make me stop wearing diapers, but it only had the contrary effect. By the way that was where I first met the girls and Ms. Vicky. As my parents found out that their plan backfired they decided to sent me here. We never talked about it, but I guess they more or less accept it now. I just hope that you don't think for me as a weirdo now.\" Yuki answered lightly worried.<br>\r\n<br>\r\n\"Well I can't say that I can fully understand it, but maybe that is just because I am so small that I have to wear the real baby diapers, while you others can wear the more grown-up ones.\"  Yutaka said jokingly.<br>\r\n<br>\r\n\"But seriously, you are a nice person, and I am glad that you are here. And you clearly know what you want, and there is nothing wrong with that, in fact I think it's quiete impressive. But enough about that for now, why don't you tell </span></div></div>",
            "created":1366002000,
            "id":1572231,
            "title":"...It started as a  punishment."
        },
        "1111221211221122211111111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Yes",
                "No (Wants to stay in the tub with Yuki longer)"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay.\" Yuki nodded after both girls finished cleaning their nether regions, getting into the steaming hot bath. \"Well, Rachel I don't really know about; she seems more like she'd be happy wearing nothing at all more than diapers. She seems to really like them, though. Same with Ashely, she came into the diapered community out of curiosity, found herself here to stay.\"<br>\r\n<br>\r\n\"And Lilly?\" Yutaka asked.<br>\r\n<br>\r\n\"From what I've been told, she has a weak bladder, but I'm not entirely sure if that's right.\" Yuki answered. \"It seems more like she has a fetish than anything.\"<br>\r\n<br>\r\n\"Oh...\" Yutaka muttered, a little gloomily.<br>\r\n<br>\r\n\"What is it?\" Yuki blinked.<br>\r\n<br>\r\n\"Well... you're all in diapers because you want to.\" Yutaka sighed. \"But I need to be diapered all the time.\"<br>\r\n<br>\r\n\"Hey, hey, don't feel bad.\" Yuki assured the frail kid gently. \"There are a LOT of people here like you who need to be diapered. And I even know some who are completely incontinent; you know, the kind that can't risk being undiapered for more than 30 seconds without...\" Yuki broke off upon being disgusted by the thought.<br>\r\n<br>\r\n\"Thanks, Yuki-neechan.\" Yutaka giggled affectionately.<br>\r\n<br>\r\n\"'Neechan?'\" Yuki blinked. Then she remembered that they were both, indeed, of Japanese descent. \"Okay, Yuu-chan, are you ready for bed then?\"</span></div></div>",
            "created":1366002000,
            "id":1572483,
            "title":"more about the other girls?\""
        },
        "11112212112211222111111111":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Gym class",
                "History class."
            ],
            "content":"<div class=\"\"><div> <span>Yutaka yawned and smiled.<br>\r\n<br>\r\n\"Yes, i'm ready now.\" She said.<br>\r\n<br>\r\nYuki helped Yutaka into a fresh diaper before put her to bed, before padding herself and settling in for the night.<br>\r\n<br>\r\nAshely was already asleep, as was Rachel, whom Vicky had thrown a cover on top of, to cover up her complete nudity, while Yuki had to kick Lily to make her go to bed.<br>\r\n<br>\r\nThe next day starts out with....</span></div></div>",
            "created":1366088400,
            "id":1572947,
            "title":"Yes"
        },
        "111122121122112221111111111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Nudity!",
                "Students will have to wear Gym Diapers"
            ],
            "content":"<div class=\"\"><div> <span>'\"Gym diapers???'\" Ashely blurted the next morning as the class got ready for gym class, looking at a large package labeled 'gym diapers'.<br>\r\n<br>\r\n\"Yeah. Basically, they're to allow for less hindered movement so that we're less restricted for gym class.\" Rachel explained, discarding her own diaper. The gym diapers were essentially pull-ups, which were considerably thinner than the normal ones used in the school. \"This school usually runs PE courses with all its students naked, though.\"<br>\r\n<br>\r\n\"Naked??!\" Ashely and Yutaka blurted together, both blushing furiously.<br>\r\n<br>\r\n\"We won't have to go today naked, will we?\" Ashely asked.<br>\r\n<br>\r\n </span></div></div>",
            "created":1366088400,
            "id":1573060,
            "title":"Gym class"
        },
        "1111221211221122211111111112":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Lilly and Yuki start fighting.",
                "Ms. Vicky is able to solve the situation peacefully."
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry I walked into Ms. Vicky after breakfast and she explained to me, that the gym diapers are only used if at least one student in the class needs to wear diapers all the time. Thanks to Yukata-chan we don't have to be naked during PE, because it would be to embarrassing for her if she were the only one diapered.\" Yuki explained in a calming voice while patting Yutaka's head gently.<br>\r\n<br>\r\n\"Such a pity, this was the first time that I was really looking forward  to PE. class.\" Lilly declared visible disappointed.<br>\r\n<br>\r\n\"Stop that nonsense Lilly. As Yutaka-chans Neechan it is my duty to protect her from such perverts as you.\" Yuki yelled furiously.<br>\r\n (I don't know if Neechan is right because I don't know who of the Japanese girls is actually the older one.)<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1366088400,
            "id":1573079,
            "title":"Students will have to wear Gym Diapers"
        },
        "11112212112211222111111111121":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Pool time",
                "baseball"
            ],
            "content":"<div class=\"\"><div> <span>Lily and Yuki then start to the beat the heck out of one another in a rather cartoony fashion. <br>\r\n<br>\r\nAshely, Rachel, and Yutaka just watched as Ms.Vicky came and forced them to break it up.<br>\r\n<br>\r\nMs.Vickey went outside with the two, while the others in the class started to do warm ups.<br>\r\n<br>\r\nAfter that, it was...</span></div></div>",
            "created":1366088400,
            "id":1573085,
            "title":"Lilly and Yuki start fighting."
        },
        "111122121122112221111111111212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"There are, but we'll get to those later, when they come up.\"",
                "\"Would you like for me to share them with you now?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Baseball?\" Ashely repeated as Ms. Vicky announced their activity for the day. Knowing all the craziness this academy and the diaper community had to offer, it seemed a little suspicious that they were just going to be playing regular baseball. <br>\r\n<br>\r\n\"Yes, you're familiar with the rules, aren't you?\" Ms. Vicky asked.<br>\r\n<br>\r\n\"Of course.\" Ashely nodded. \"But... is this really just normal baseball? What's the catch?\"<br>\r\n<br>\r\n\"A ball, of course.\" Vicky answered jokingly. <br>\r\n<br>\r\n\"There are different rules to this game, aren't there?\" Ashely pressed, knowing there had to be something crazy for this game.<br>\r\n<br>\r\n\"Well yes.\" Vicky nodded. \"First, every team that gets an 'out' will have to drink a full bottle of this.\" She showed Ashely a bottle of what seemed like normal water.<br>\r\n<br>\r\n\"Water?\" She blinked.<br>\r\n<br>\r\n\"It's a little something we teachers like to call 'potty juice.'\" Vicky giggled. \"A drink that goes from your throat to your bladder very, very fast. A full bottle's worth is enough to make a gym diaper leak.... quite a lot. Which says something, considering that gym diapers are far more absorbent than they look.<br>\r\n<br>\r\n\"Any other rules I should know about?\" Ashely asked warily.</span></div></div>",
            "created":1366088400,
            "id":1573150,
            "title":"baseball"
        },
        "111122121122112221111111112":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Ashely fighting a few bullies with a fake chainsaw and boom stick.",
                "Rachel being spanked by a few girls."
            ],
            "content":"<div class=\"\"><div> <span>Ashely and Rachel were busy with art class, while Yuki, Lily, and Yutaka were in history class. Mr. Irish (No really that's his last name. I kid you people not.)<br>\r\n The teacher had done his best to make history come alive for hie students, and it got them all wanting to learn more. Yuki and Lily mostly. Yuki cause she actually cared about what the teacher was talking about. As for Lily, the teacher was actually her uncle. hell he even spoke in the same irish accent.  The bell rang so the three left class. Yutaka left to go change, with Yuki coming with. Lily wanted she her uncle again.<br>\r\n<br>\r\nAs Yuki and Yutaka made it to the changing line, they could hear a couple of girls fighting. <br>\r\n<br>\r\n\"What's that?\" Yutaka asked worried.<br>\r\n<br>\r\n\"You stay here, I'll check it out.\" Yuki said.<br>\r\n<br>\r\nYuki looked around to find....<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1367211600,
            "id":1581016,
            "title":"History class."
        },
        "1111221211221122211111111122":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"No! Help!\" (Rachel's being punished/bullied)",
                "Yes! Oooh, Yes! (Being pleasured)"
            ],
            "content":"<div class=\"\"><div> <span>\"The hell?!\" Yuki almost blurted, watching as several girls spanked Rachel on her bare ass, Rachel crying out with each smack, though whether out of pain or pleasure, she couldn't tell.<br>\r\n<br>\r\n\"Um... Rach? You okay?\" Yuki blinked.</span></div></div>",
            "created":1367816400,
            "id":1585653,
            "title":"Rachel being spanked by a few girls."
        },
        "11112212112211222111111111221":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Joined the others",
                "Was put in  detention/  "
            ],
            "content":"<div class=\"\"><div> <span>\"No! Help!\" Rachel cried.<br>\r\n<br>\r\nYuki then narrowed her eyes looked at the girls.<br>\r\n<br>\r\nThen channeled her inner Shizuo and started to beat the shit out of the other girls.<br>\r\n<br>\r\n<br>\r\nGiving Rachel some to to get away.<br>\r\n<br>\r\n<br>\r\nAs the other girls ran away Yuki stopped herself.<br>\r\n<br>\r\nshe then..<br>\r\n<br>\r\n</span></div></div>",
            "created":1367989200,
            "id":1586457,
            "title":"\"No! Help!\" (Rachel's being punishe..."
        },
        "111122121122112221111111112212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "switch",
                "paddle"
            ],
            "content":"<div class=\"\"><div> <span>\"Ms. Edogawa, do you know why you're in detention?\" The disciplinary correction teacher, Ms. Gaudens asked Yuki strictly moments later.<br>\r\n<br>\r\n\"No. I told you, I was only helping my friend...\" Yuki defended herself.<br>\r\n<br>\r\n\"Your friend was being punished for dresscode violation!\" Ms. Gaudens snapped. \"So, for disrupting correctional action and extreme behavior, I'm going to give you Grade 3 punishment!\"<br>\r\n<br>\r\n\"Grade 3?\" Yuki repeated.<br>\r\n<br>\r\n\"Yes, Edogawa. You see, I have 5 levels of punishment, and your behavior has earned you Grade 3. Each Grade gives you that many number of punishments, meaning you're getting three progressive punishments for your insolence.\" Ms. Gaudens clarified. \"First,\" She ripped off Yuki's diaper, and proceeded to strike her bare butt with a....</span></div></div>",
            "created":1368766800,
            "id":1591912,
            "title":"Was put in  detention/  "
        },
        "1111221211221122211111111122121":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "3 days",
                "A full week"
            ],
            "content":"<div class=\"\"><div> <span>A sharp whistle sounded, before Yuki cried out loudly with agony as she was whipped on the bare butt with a switch, which struck her again and again 20 times. By the time they were finished, Yuki's ass was covered in long, thin, stinging red marks.<br>\r\n<br>\r\n\"Second,\" Ms. Gaudens continued, ignoring pleads for mercy as she wet a finger with gel, before sticking it all the way up Yuki's anus. She then inserted a device into her butt, replacing her finger, which in turn inserted a thick supository into her rectum, Yuki now sobbing for the pain to stop.<br>\r\n<br>\r\n\"And third.\" Ms. Gaudens concluded, pulling out a pair of pink footie-pajamas, forcing Yuki into them. \"Alright, Edogawa, we're done here.\" Yuki raised an eyebrow, having a moment of perplesion, before asking.<br>\r\n<br>\r\n\"Um... Ms. Gaudens? What's so punishing about these?\" She gave the collar of her footies a tug. Sure, they were hot and uncomfortable, but nothing nearly as bad as having an oversized pill shoved up her butt... or being whipped on said butt.<br>\r\n<br>\r\n\"They can't be removed, except by staff, and even then, only under certain circumstances.\" Ms. Gaudens explained. \"Additionally, they will give you a light shock every time your body begins to show signs of aggression. This should teach you to misbehave, Edogawa.\"<br>\r\n<br>\r\n\"How long will I have to wear these?\" Yuki sighed, already uncomfortable with them.<br>\r\n<br>\r\n\"For as long as the urinary incontinence pill lasts; about....\"</span></div></div>",
            "created":1368766800,
            "id":1591919,
            "title":"switch"
        },
        "11112212112211222111111111221211":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Ms.Vicky",
                "Ashely."
            ],
            "content":"<div class=\"\"><div> <span>\"About 3 days.\" Ms. Gaudens stated.<br>\r\n<br>\r\nYuki thought to herself.<br>\r\n<br>\r\n\"Well...as long as Lily doesn't do anything to bug me....Oh crap!\" Yuki thought.<br>\r\n<br>\r\n\"Now please leave.\" Ms. Gaudens ordered.<br>\r\n<br>\r\nYuki was happy to do so.<br>\r\n<br>\r\n<br>\r\nYuki then could see Rachel was waiting for her.<br>\r\n<br>\r\n\"I'm really sorry Yuki.\" Rachel said.<br>\r\n<br>\r\n\"Whatever Rach.<br>\r\n<br>\r\n<br>\r\n\"So what's with the footies?\" The girl asked.<br>\r\n<br>\r\n\"Punishment.\" Yuki explained.<br>\r\n<br>\r\nThe two girl ran into. </span></div></div>",
            "created":1369890000,
            "id":1600004,
            "title":"3 days"
        },
        "111122121122112221111111112212111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Lilly got on Yuki's nerves again",
                "The footies wouldn't come off when it was bath time"
            ],
            "content":"<div class=\"\"><div> <span>\"I really hoped she wouldn't use the footies.\" Ms. Vicky sighed irritably. \"Honestly, Gaudens, you're so cruel...\" She muttered as she escorted her girls back to the dorms. <br>\r\n<br>\r\n\"Ms. Vicky, Get this thing off! I don't think I deserve this... Ouch!\" Yuki growled, winching as she was shocked. <br>\r\n<br>\r\n\"Sorry about this, Yuki, but I can't do anything about this. I do agree that you were a bit out of line with your actions, but the shock footies...? Gaudens, you bitch...\"<br>\r\n<br>\r\n\"You have the key though, don't you?\" Yuki sighed, lowering her voice. \"Can't you just let me leave it off in the dorm?\"<br>\r\n<br>\r\n\"I wish, but the key only lets me remove it 3 times a day; two for diaper changes, and one for bathing.\" Ms. Vicky shook her head regrettingly. <br>\r\n<br>\r\n\"Tonight's bath with Yutaka's going to be soooooo good.\" Yuki sighed, already uncomfortable with the heat of her new clothes.<br>\r\n<br>\r\nHowever, that night.....</span></div></div>",
            "created":1369976400,
            "id":1600979,
            "title":"Ms.Vicky"
        },
        "1111221211221122211111111122121111":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Ashely and Jeeny (James..disguised as a girl so they could date.)",
                "Ms. Vicky."
            ],
            "content":"<div class=\"\"><div> <span>As Yuki went into the dorm. She could see Yutaka being bound and gagged on the bed.<br>\r\n<br>\r\nLily.was grinning from ear to ear.<br>\r\n<br>\r\n\"Alright pumpkin, make a wish!\" Lily stated.<br>\r\n<br>\r\n\"YOU BITCH!\" Yuki roared as she pinned Lily down to the ground.<br>\r\n<br>\r\n\"I have to do this for homework!\" Lily whinnied.<br>\r\n<br>\r\n<br>\r\n\"I don't care, you don't touch-AHHHHH!\" Yuki yelled as she was being shocked.<br>\r\n<br>\r\nWho came in the door was </span></div></div>",
            "created":1369976400,
            "id":1601012,
            "title":"Lilly got on Yuki's nerves again"
        },
        "11112212112211222111111111221211112":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "repremanded Lilly for doing things to Yutaka",
                "repremanded Yuki for interfering with Lilly's homework"
            ],
            "content":"<div class=\"\"><div> <span>\"What's going on here?\" Ms. Vicky sighed, coming into the familiar scene of Yuki and Lilly fighting.<br>\r\n<br>\r\n\"Effing Lilly's doing sick things to Yutaka, ouch! You don't do something like that to her OWW! And get this gawdarn thing off ARGH!!!\" Yuki screamed through occasional jolts.<br>\r\n<br>\r\n\"It's alright, Neechan.\" Yutaka fidgeted her fingers. \"I let her...\"<br>\r\n<br>\r\n\"Don't defend Lilly.\" Yuki sighed exasperatedly, swatting the perverted groper away, and earning her another little jolt, this one making her wet herself quite a bit.<br>\r\n<br>\r\n<br>\r\nMs. Vicky......  </span></div></div>",
            "created":1369976400,
            "id":1601016,
            "title":"Ms. Vicky."
        },
        "111122121122112221111111112212111121":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "James and Lily caught up.",
                "Ashely asked what happened."
            ],
            "content":"<div class=\"\"><div> <span>Ms. Vicky grabbed Lily knowing she was lying.<br>\r\n<br>\r\nShe set her down on her knee.<br>\r\n<br>\r\nThen while undoing her diaper she gave Lily a harsh, and hard 25 smacks on her butt.<br>\r\n<br>\r\nYuki was grinning at the sight of this, while covering the smaller girl's eyes.<br>\r\n<br>\r\nAshely, Rachel, and a fully dressed James came into the dorm to vist Lily, however they said nothing and watched with Yuki.<br>\r\n<br>\r\n<br>\r\nMs. Vicky  finally undid the footie and collar for Yuki.<br>\r\n<br>\r\nThe two japanese girls went to take their bath while/<br>\r\n<br>\r\n</span></div></div>",
            "created":1369976400,
            "id":1601022,
            "title":"repremanded Lilly for doing things to Yutaka"
        },
        "1111221211221122211111111122121111212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "bathtime was over, and Yuki was forced back into her footies",
                "washing themselves up again"
            ],
            "content":"<div class=\"\"><div> <span>\"Yuki's being punished right now.\" Vicky answered Ashely's question, sighing. \"Much too harshly, I might add...\"<br>\r\n<br>\r\n<br>\r\n\"Oh MAN it feels so good to be out of that stupid thing.\" Yuki sighed. Nudity had never felt so liberating as it did right now as she sat naked with Yutaka in the bathroom.<br>\r\n<br>\r\n\"Thank you for helping me back there, Neechan.\" Yutaka smiled as Yuki washed her back.<br>\r\n<br>\r\n\"Don't mention it.\" Yuki grinned, pulling Yutaka close, the feeling of her bare skin against her own was so soothing and pleasant for her.<br>\r\n<br>\r\n\"Neechan? I feel something really warm against my back. What is that?\" Yutaka asked, Yuki feeling a little bit embarrassed; she was peeing on her favorite girl in the world!<br>\r\n<br>\r\n\"Sorry.\" She apologized sheepishly. \"Part of my punishment; I'm urinarily incontinent right now.\"<br>\r\n<br>\r\n\"Just like me!\" Yutaka smiled, turning to give Yuki a big, happy hug. <br>\r\n<br>\r\n\"Yep. Just like you...\" Yuki grinned as urine now escaped Yutaka's bladder, showering her leg. Both of them laughed joyfully, before.... </span></div></div>",
            "created":1373346000,
            "id":1625497,
            "title":"Ashely asked what happened."
        },
        "11112212112211222111111111221211112122":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Dramma",
                "Art."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The two got back into the bath and start to wash themselves again, yuki drew out the bath time as much as possable.<br>\r\n<br>\r\nThe next class they had was</span></div></span></div>",
            "created":1383714000,
            "id":1690501,
            "title":"washing themselves up again"
        },
        "11112212112211222112":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Maylu a fowl mouthed girl in diaper punishment, and tape over her mouth",
                "Tabby a girl forced to come her by her mother so don't bug her."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Two more girl might be.</span></div></span></div>",
            "created":1364360400,
            "id":1558807,
            "title":"more options"
        },
        "111122121122112221122":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"I require sustinence from you\" ",
                "\"I should have you punished for your earlier incompitence\""
            ],
            "content":"<div class=\"\"><div> <span>\"Girls, this is Tabby.\" Vicky introduced, stepping aside for a girl with very extravagant clothes, a young woman in a maid's dress following right behind her. \"Say hello, Tabby.\"<br>\r\n<br>\r\n\"Hi.\" Tabby grunted before gesturing to her maid to place her bags down at the foot of her bed.<br>\r\n<br>\r\n\"Now Tabby, I don't know if you've been told, but...\"<br>\r\n<br>\r\n\"Yeah, stuck in a diaper here, I know.\" Tabby sighed. \"Clara?\"<br>\r\n<br>\r\n\"Yes, master.\" The maid nodded, a British accent audible in her voice. She stripped her mistress of her shirt and skirt, but Tabby stopped her. <br>\r\n<br>\r\n\"Clara, there are peasants here. Don't allow them to lay eyes on me.\" Tabby ordered. <br>\r\n<br>\r\n\"Yes, master.\" Clara bowed, taking blankets from some of the beds, and wrapping them around one of the bottom bunks like curtains. \"Please, come inside so that I may change you now, master.\" She said.<br>\r\n<br>\r\n\"Very well.\" Tabby sighed, climbing into the bed, where her maid continued her changing.<br>\r\n<br>\r\n\"You know, Tabby. This school only allows diapers to be worn by students.\" Vicky stated. \"We will all see you naked at some point or another...\"<br>\r\n<br>\r\n\"My mistress does not want you to see her be changed.\" Clara stated bluntly, poking her head out of the blanket curtains, before diving back in, where the crinkling of a diaper unfolding could be heard.<br>\r\n<br>\r\n\"Damn! Clara! That's too cold!!\" Tabby squealed from inside.<br>\r\n<br>\r\n\"I apologize, master. I did not realize our wet wipes had gotten cold so quickly.\"<br>\r\n<br>\r\n\"That's because you didn't warm them this morning! I told you...!\"<br>\r\n<br>\r\n\"I'm sorry, master. Would you prefer the regular or thick kind?\"<br>\r\n<br>\r\n\"Thick.\"<br>\r\n<br>\r\n\"Very well, my mistress.\"<br>\r\n<br>\r\n\"Is that even allowed?\" Ashely asked. \"For her to bring her maid here?\"<br>\r\n<br>\r\n\"Yes, some students are permitted to assign a regular assistant to themselves while on campus.\" Vicky nodded. \"Tabby is quite fond of Clara, so she has assigned her to be her assistant for her time here.\"<br>\r\n<br>\r\n\"This is completely demeaning.\" Tabby huffed as she stepped out of the canopy, donned in a very thick diaper with gold and pink prints. <br>\r\n<br>\r\n\"I'm afraid it can't be helped, master.\" Clara bowed apologetically. \"Shall I sleep along with you?\"<br>\r\n<br>\r\n\"Yes. The bottom bunk belongs to you, Clara.\" Tabby stated. \"I will take my leave to the top. But first...\" </span></div></div>",
            "created":1383886800,
            "id":1691463,
            "title":"Tabby a girl forced to come her by her mother s..."
        },
        "1111221211221122211222":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Class warfare",
                "Vickey breaks them up, and Tabby she can't punish Clara."
            ],
            "content":"<div class=\"\"><div> <span>\"I should have you punished for your earlier incompetence.\" Tabby muttered. Clara bowed her head.<br>\r\n<br>\r\nAshely then frown and glared at the new girl.<br>\r\n<br>\r\n\"Hey hold on, you can just punish someone, you little brat!\" Ashely yelled.<br>\r\n<br>\r\nTabby just glared back Ashely.<br>\r\n<br>\r\n\"I can do whatever I damn well please, peasant!\" Tabby snapped<br>\r\n<br>\r\n<br>\r\n\"What are you from the middle ages? Who even talks like that any more?\" Ashely yelled.<br>\r\n<br>\r\n\"You dare mock me!\" Tabby yelled.<br>\r\n<br>\r\n\"Ohh I'll do more then!\" Ashely yelled back.<br>\r\n<br>\r\n\"Should we do someting?\" Rachel asked.<br>\r\n<br>\r\n\"Are you kidding I'm hoping a cat fight starts.\" Lily said Yuki who was rolling her eyes.<br>\r\n<br>\r\n What happens next</span></div></div>",
            "created":1386478800,
            "id":1704963,
            "title":"\"I should have you punished for your earlie..."
        },
        "11112212112211222112222":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "\"Then go ahead, but don't be too harsh with her.\"",
                "\"Then I will handle that.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Girls, stop!\" Vicky ordered firmly, grabbing both girls by the back of their diapers and pulling them apart. \"No fighting!\"<br>\r\n<br>\r\n\"Clara cannot show such incompitence towards me. By my family's rules, she is to be punished!\" Tabby insisted.<br>\r\n<br>\r\n\"By MY rules,\" Vicky stated. \"Nobody is allowed to punish anybody else except for me. If anyone is to punish Clara, then it is me.\" She then untapped both girls' diapers. \"And speaking of punishment, both you girls need good spankings for your behaviors!\" She threw Ashely over the knee first, spanking her ass until it was bright red, and her spankings for Tabby were double those of Ashely's.<br>\r\n<br>\r\n\"I was just going to spank and diaper her for her mistakes!\" Tabby was saying as Vicky wrapped up her punishments.<br>\r\n<br>\r\nVicky sighed as she let the rich girl off her knee and rediapered her, replying...</span></div></div>",
            "created":1386478800,
            "id":1705033,
            "title":"Vickey breaks them up, and Tabby she can't ..."
        },
        "111122121122112221122222":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Dinner time.",
                "Play time."
            ],
            "content":"<div class=\"\"><div> <span>\"Then I will handle it.\" Vicky said.<br>\r\n<br>\r\n\"Very good ma'am.\" Clara said.<br>\r\n<br>\r\n\"What?\" Ashely muttered. Tabby mearly stuck out her tongue out at her.<br>\r\n<br>\r\nAshley was about to deck her with Rachel, Yuki and Lily kept her from doing it.<br>\r\n<br>\r\nVickey's then spanked Claria and then diapered her under the maid outfit.</span></div></div>",
            "created":1386478800,
            "id":1705040,
            "title":"\"Then I will handle that.\""
        },
        "1111221211221122211222221":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Vicky let Tabby off with a strict warning",
                "Vicky gave Tabby a spanking",
                "Vicky gave Tabby a punishment much more serious"
            ],
            "content":"<div class=\"\"><div> <span>\"Who wants milk first?\" Vicky offered, taking out her breasts. \"Tabby? How about you?\"<br>\r\n<br>\r\n\"Sorry, but I'm a proper lady.\" Tabby snubbed. <br>\r\n<br>\r\n\"And a proper lady needs ample nourishment.\" Vicky smiled. \"There's nothing more nourishing than breast milk.\"<br>\r\n<br>\r\n\"I only accept milk from the most healthy of breasts. Not from some common cow.\" Tabby stated in a snooty voice. \"Clara?\"<br>\r\n<br>\r\n\"As you wish, mistress.\" Clara bowed her head, opening her shirt to allow Tabby to suckle from her. <br>\r\n<br>\r\n\"E-excuse me??!\" Vicky growled, buttoning her shirt back up. \"'Common cow?'\"</span></div></div>",
            "created":1400043600,
            "id":1796178,
            "title":"Dinner time."
        },
        "1111221211221122212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Personalized diaper fitting",
                "Physical examination",
                "something else?"
            ],
            "content":"<div class=\"\"><div> <span>\"Naked time!\" Vicky said, giggling as she saw that half of her girls were already naked.<br>\r\n<br>\r\n\"Uh?\" Ashley blinked just as she reached for a fresh diaper to change into.<br>\r\n<br>\r\n\"Yuki, Lilly, get 'em off.\" Vicky prompted the two girls with remaining clothes.<br>\r\n<br>\r\n\"Okay, but... why?\" Yuki blinked, bookmarking her manga before stripping off her superpuff. <br>\r\n<br>\r\n\"Because, as it's your first night here, there's something important you four girls need to do. And you can't be clothed for it.\"<br>\r\n<br>\r\n\"What's that?\" Ashely asked.</span></div></div>",
            "created":1412917200,
            "id":1869783,
            "title":"\"It's naked time!\""
        },
        "1111222":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "saw Rachel being bullied.",
                "Lily got a text from her brother James at his normal school."
            ],
            "content":"<div class=\"\"><div> <span>\"So, you wanna see them?\" Lily asked.<br>\r\n<br>\r\n\"Um, don't we have class soon?\" Ash asked.<br>\r\n<br>\r\n\"Nah, not for another hour or so. Come on!\" Lily said dragging her friend with her.<br>\r\n<br>\r\nThe two found Yiku reading one of her Manga books. This one was Naruto.<br>\r\n<br>\r\n\"Hey Yuki!\" Lily said.<br>\r\n<br>\r\nThe japanese girl said nothing Lilly then got the an idea. She quickly groped the front of Yuki's diaper, feeling her up.<br>\r\n<br>\r\nThat got Yuki to kick the girl right n the face!<br>\r\n<br>\r\n<br>\r\n\"Don't ever do that to me again! She roared.<br>\r\n<br>\r\n\"Well it worked didn't it?\" Lily said.<br>\r\n<br>\r\n\"Oh hey Ash.\" Yuki said.<br>\r\n<br>\r\n\"Hi.\" Ashley said.<br>\r\n<br>\r\nNow before the three could catch up they </span></div></div>",
            "created":1356757200,
            "id":1497374,
            "title":"Ashley reunites with the old gang"
        },
        "11112222":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Health/Sex Education",
                "P.E."
            ],
            "content":"<div class=\"\"><div> <span>\"Where's Rachel?\" Ashley asked.<br>\r\n<br>\r\n\"I think she might still be in line.\" Lilly shrugged. \"That's another cute butt I've been begging to grope again!\" Just then, she gave a gasp of ecstasy as her crotch gave a noticeable vibration.<br>\r\n<br>\r\n<br>\r\n\"Um... you okay?\" Ashley blinked.<br>\r\n<br>\r\n\"She's going to do something really weird.\" Yuki muttered.<br>\r\n<br>\r\n\"Just got a text.\" Lilly answered casually, pulling a cellphone from inside her diaper to check the text she just received.<br>\r\n<br>\r\n\"How did I know.\" Yuki rolled her eyes.<br>\r\n<br>\r\n\"Wouldn't that be dangerous? To either you or the phone?\" Ashley asked, recalling that Lilly was diapered due to a weak bladder.<br>\r\n<br>\r\n\"Nope. Totally waterproof.\" Lilly giggled. \"Anyway, that was just my brother. Turns out he can't quite catch a break; stuck in a boring, normal school, and that same gay kid from camp is still bugging him. Hey, Ash, c'mere!\" <br>\r\n<br>\r\n\"Wha...?\" Ashley blurted before having Lilly's hand be shoved down her diaper, the lesbian in turn putting Ashley's hand down her padding and taking advantage of the moment of surprise Ashley experienced to kiss her on the cheek. The girl-crazed girl then snapped a picture of the craziness on her cell before sending a reply text to her brother. <br>\r\n<br>\r\n\"Told him I reunited with my summer honey.\" Lilly teased.<br>\r\n<br>\r\n\"Same old Lilly.\" Rachel laughed as she came onto the scene.<br>\r\n<br>\r\n\"Well, isn't this a familiar scene.\" a familiar voice giggled, and Ashley turned, for her face to bounce into some very familiar boobs. <br>\r\n<br>\r\n\"Ms. Vicky!\" She smiled. <br>\r\n<br>\r\n\"Hey, Ash.\" Vicky grinned at her old cabin. \"Class is almost about to start. Are you girls ready?\"<br>\r\n<br>\r\n\"Sure am.\" Ashely nodded. \"What do you teach ma'am?\"</span></div></div>",
            "created":1356843600,
            "id":1497785,
            "title":"Lily got a text from her brother James at his n..."
        },
        "111122221":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>\"I teach Health and Sex Education. And I doubt that you four had a proper breakfast. So if you promise not tell the other students about it, since they would get jealous, now you can appease your hunger.\"<br>\r\n<br>\r\nWere the four girls hungry?</span></div></div>",
            "created":1356843600,
            "id":1497821,
            "title":"Health/Sex Education"
        },
        "1111222211":{
            "author_id":"aerosmith2",
            "author_name":"Youngest Led Zepplin Fan",
            "choices":[
                "Rachel and Ashley",
                "Yuki and Lilly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I know I am Mam.\" Ashley said and the other 3 nodded in agreement so Vicky took her shirt off and said \"Who's first?\"</span></div></span></div>",
            "created":1359694800,
            "id":1522035,
            "title":"Yes."
        },
        "11112222111":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "free day",
                "water sports"
            ],
            "content":"<div class=\"\"><div> <span>Rachel and Ashely each took a breast, and began to suck on the respective nipple, drinking the sweet milk that flowed into their mouths. Once they were both full, they wiped their mouths with satisfaction.<br>\r\n<br>\r\n\"Ah! I forgot how delicious that milk can be!\" Ashely smiled delightedly. \"Thank you, ma'am.\"<br>\r\n<br>\r\n\"I'm glad you enjoyed it,\" Vicky grinned, \"Because today, we're doing something special for P.E.\"</span></div></div>",
            "created":1361509200,
            "id":1537112,
            "title":"Rachel and Ashley"
        },
        "1112":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Meeting other girls and women with incontinence",
                "You weren't told about your anal virginity will be taken bareback",
                "Experiencing elementary school"
            ],
            "content":"<div class=\"\"><div> <span>Being 6 year old and unable to hold your bladder. It has been in your family blood. Your mommy and your two sisters were usually leaking piss despite being 42 years old, 21 years old and 3 years old respectively.<br>\r\nThe women of Teenneesson family were always diapered because of their incontinence and urine production. So all of them attended Diaper Academy since elementary until college.<br>\r\nDiaper academy left their students just in diapers, no other clothes were allowed except for pacifiers, buttplugs, mittens and accessories, girls were barefoot and topless for their entire courses. Only the female teachers were allowed to wear clothes besides their diapers, and they were usually infantile and ruffled, yet none of them wore any shoes making them to walk in dirty socks all the time.<br>\r\n<br>\r\n\"Waaah, why can't I join my big sis\" cried your 3 year old sister in her soggy diapers as she saw you being diapered and mittened \"I want to go to the academy too...\"<br>\r\n<br>\r\n\"Annie, you can't, you're still in the daycare\" said Sophia, your mom, she had her dyed jet black hair in pigtails, green heels and a green blouse complimented with purple satin underwear but no bottoms leaving her soggy blue diaper exposed. \"But Mary is graduating soon so we could play with her instead\"<br>\r\n<br>\r\nMom took your body and put you into the car. You arrived at the academy already soggy, but the car smelling like girl pee was nothing new... What was new was...</span></div></div>",
            "created":1553105580,
            "id":2632738,
            "title":"You're incontinent "
        },
        "1113":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Punishment",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now what other reasons could you enroll at this school?</span></div></span></div>",
            "created":1353733200,
            "id":1474543,
            "title":"other"
        },
        "11131":{
            "choices":[
                "History ",
                "Math "
            ],
            "content":"<div class=\"\"><div> <span>Your name was Alice Sinclair. You were five years old and ready fro Elementary School, unfortunately, this wasn't what you had in mind. You were the only daughter of Patrick Sinclair and you didn't deserve to have this punishment! Your family was incredibly wealthy and that meant you were better than everyone else.Still, your father had the gall to put you in a school where everyone still wears diapers?! The only reason he was doing this was to \"teach you a lesson\" or something about being nicer to your baby brother. <br>\r\n<br>\r\nYou wore a red blazer with a matching skirt and black maryjanes. The school dress code forbid its students to wear panties, so you were forced to use diapers. Even worse, this was the only building for miles and it didn't have any bathrooms since they all wore diapers. Still, you'd show your father, even if you had to hold it in all day! The first class was...</span></div></div>",
            "created":1441602000,
            "id":2031211,
            "title":"Punishment"
        },
        "112":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "They're all incontinent",
                "They all like wearing diapers",
                "They're being punished"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why do the girls who go to this school wear diapers?</span></div></span></div>",
            "created":1437541200,
            "id":2011241,
            "title":"Middle School"
        },
        "1121":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Diane",
                "Mei",
                "Christine"
            ],
            "content":"<div class=\"\"><div> <span>The school is full of incontinent awkward middle-school age girls. They're encouraged to try and make it to a toilet if they can but generally the girls need diapers at all times.<br>\r\n<br>\r\n3 Main characters to choose from, all 3 are good friends and know each other. They love to hang out during and after school.<br>\r\n<br>\r\nDiane- Very pale skin with shoulder length blonde hair. Long legs, she's awkwardly tall for her age and is very sensitive about her looks. She has breasts, but they're small and not fully developed yet. Generous and helpful when there's a problem, but she's not very smart when it comes to her classes, and is known for being a bit on the lazy side.<br>\r\n<br>\r\nMei- Asian girl, long black hair. Short, skinny, hasn't got any breasts yet. She's bad at math, much to her classmate's amusement, but she's pretty good at every other subject. Mei likes to stay up all night watching TV when her parents think she's up all night studying. She didn't have any friends before going to Diaper Academy, so she's not used to suddenly being in a decent crowd. Most likely to do something stupid or embarrassing on accident.<br>\r\n<br>\r\nChristine- Long red hair, slightly taller than Mei, but not by much. Budding breasts, she has a healthy look to her. Christine is warm, friendly, and popular. She can fit in with almost anyone. She's also a loudmouth and a bit of a class clown. She's terrible at every subject, and only barely scrapes by with her grades. Everybody likes her, though, even if she can be annoying at times.</span></div></div>",
            "created":1465275600,
            "id":2160568,
            "title":"They're all incontinent"
        },
        "11212":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "School uniform, duh! (skirt, blouse)",
                "Nothing, students wear only diapers here"
            ],
            "content":"<div class=\"\"><div> <span>Mei stretched her arms as she got out of her shower in her room. A yawn escaped her mouth as she reached for a towel, still a little bit sleepy this morning after watching TV all night. Quickly, Mei dried off and fixed her hair in the mirror. She got out her diaper and supplies, applying a good amount of baby oil (the slimy feeling on her crotch and butt made her feel naughty but it felt good) and some powder. Mei taped herself up and took a look in the mirror again. She smiled.<br>\r\n\"Looking good, Mei! Looking good!\" She said.<br>\r\n<br>\r\nWhat else does Mei wear to class?</span></div></div>",
            "created":1465275600,
            "id":2160582,
            "title":"Mei"
        },
        "112121":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "This was English class, and she had failed the last test",
                "Mei had a crush on someone in the room"
            ],
            "content":"<div class=\"\"><div> <span>Mei got into her school uniform and started brushing her hair. She heard her roommate, Diane, a tall and slightly awkward blonde girl, getting ready in the other room.<br>\r\n\"You doing okay over there?\" Mei called out.<br>\r\n\"Y... Yeah. Just fumbling a little.\" Diane called back.<br>\r\nDiane was tripping over herself while getting her socks on.<br>\r\nSoon Mei was ready, wearing the Diaper Academy white blouse and blue skirt. It showed a little more leg than a lot of girls were comfortable with, and a strong breeze could reveal any of the girl's diapers. Most of the girls hated the uniform, but Mei thought it made her look pretty cute.<br>\r\n\"Come, on Diane!\" She said.<br>\r\nThe Asian girl grabbed her tall roommate and left the dorm to get to class.<br>\r\n<br>\r\nMei giggled as they walked the hall.<br>\r\n\"What? What's so funny?\" Diane asked.<br>\r\n\"Your shoes are on the wrong feet.\" Mei said.<br>\r\nDiane looked down. She was indeed walking funny and her shoes were mixed up.<br>\r\n\"Oh snap!\" Diane shouted.<br>\r\nShe quickly fixed her shoes.<br>\r\n<br>\r\nThe two of them went to their home room class where they sat next to their best friend, Christine, a cute red haired girl.<br>\r\n\"Hey, Diane! He, Mei! Good morning!\" Christine said.<br>\r\nDiane just smiled and sat down, but Mei gave Christine a big hug.<br>\r\n\"Doing great, Christine! Doing great!\" Mei said.<br>\r\nMei didn't show it, but she was getting slightly nervous. Why?</span></div></div>",
            "created":1465534800,
            "id":2162100,
            "title":"School uniform, duh! (skirt, blouse)"
        },
        "1121212":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Her teacher",
                "Another student"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was Mei secretly in love with?</span></div></span></div>",
            "created":1465534800,
            "id":2162101,
            "title":"Mei had a crush on someone in the room"
        },
        "11212122":{
            "author_id":"park500",
            "author_name":"nope",
            "choices":[
                "Natalie was interested in Mei",
                "Natalie thought she was being strange/ was looking at someone else"
            ],
            "content":"<div class=\"\"><div> <span>Mei couldn't keep her eyes of Natalie the girl next door, both in her personality and in a literal sense since her room was right next to Mei's, in fact their beds were against the same wall so much so that should their be a excess of noise for any reason the girl on the other side should be able to make it out, as Mei found out the past few weeks.<br>\r\n<br>\r\nYou see the problem with having something that you have hidden your whole life such as bedwetting, be not only known but shared with those around you tends to make it very easy to form a bond, and when diaper changes and being there for when there's a leak or something and basically having someones back and being able to sympathies like no one you've known, and than throwing into the mix puberty and developing sexuality, it shouldn't be a surprise that relationships where not to uncommon, and whilst the school did have rules that prohibited such relationships, there where very rarely enforced, often only if one of the people you shared with complained or if it was having a substantial impact on your education.<br>\r\n<br>\r\nWhat was a little more uncommon however, although given the factors it shouldn't have been such a surprise, was the exact nature of the relationships, whilst most where simply somebody to cuddle and make out with, as was fairly normal in most schools (barring the same sex nature that an all girl school provided) was the rarer, although not uncommon dynamics, more specifically that some girls would adopt a more caregiver attitude whilst others would adopt a more regressed mentality, and whilst the school was a little more strict at discouraging these sort of relationships it still had the mentality of so long as its not effecting anyone else than we are going to ignore it, although there where a lot more against displays of this nature in public.<br>\r\n<br>\r\nWhich is where you come in, as it was pretty widely known that Natalie's two room mates, Emma and Sophia, had been in such a relationship with Emma being the caregiver or as they liked to be known Mommy and Baby Girl respectively, they had been getting more and more intimate as the weeks went on, and ever so slowly Natalie had been intrigued enough to join in, the past few nights you had heard more than enough to get an idea of just how intimate those nights got, and had done little since but fantasies about joining in.<br>\r\n<br>\r\nTwo days ago Mei had come out to hear Diane and Christine talking about the noise from next door, being far to flustered about it, especially since they had playfully teased you more than once about the way you looked at Natalie, who couldn't fault you for finding her attractive, you decided to stay in your room and and eavesdrop overhearing that Natalie whilst into it felt more of a third wheel to Emma and Sophia, and had mentioned that she was thinking about finding someone for herself.<br>\r\n<br>\r\nThe past days had been spent running through thoughts of how to ask her about it, especially now that she had noticed Natalie had been stealing her own glances towards Mei when she thought that she wasn't looking...although she couldn't help think that it might have been in response to Mei's constant gazing and blushing.</span></div></div>",
            "created":1531912560,
            "id":2521455,
            "title":"Another student"
        },
        "112121221":{
            "author_id":"park500",
            "author_name":"nope",
            "choices":[
                "It's just a question about who your doing your assigment with",
                "The teacher noticed what you where doing"
            ],
            "content":"<div class=\"\"><div> <span>After much blushing and pretending to be very interested in the poster behind Natalie when ever she thought Natalie had noticed her, and she noted that Natalie had pulled just as many awkward...and obvious manoeuvers at herself, that she was confident that Natalie had been looking at her in much the same manner as she had been looking at Natalie.<br>\r\n<br>\r\nAs the teacher droned on about something she wasn't even remotely paying attention to she watched as Natalie writing a note which as you watched she folded into what looked from where you where to be a flower that she placed on the corner of her desk, before she turned and this time made no effort to pretend to not be looking as she gazed directly into your eyes an enormous blush ruining what could have otherwise come across as a very confident and seductive expression, you found yourself unable to hold her gaze for long and blushing just as badly averted your gaze, only to feel a warmth to rival your faces in your crotch as you realised you where wetting yourself but you knew you where feeling something else down there as well, you brought yourself to glance back at her before losing the battle of wills and once more turning away only moments later.<br>\r\n<br>\r\nEmbarrassed beyond anything you had felt before, especially since apparently this girl who you know has more than a few admirers, for some reason finds you to be attractive, you could feel your heart beating in your chest like nothing ever before, as you cover your face with your hands to hide your growing smile, you lower your head to the desk and nestle your head between your elbow on the desk as you peak above it towards her once more, she turns her head in your direction once more as she notices you looking out of the corner of her eye and smiles, this time pulling it off with only a minimal blush, as she managers to pull of the seductive look much better this time, as she turns her body better to face you, resting her chin on the palm of her hand.<br>\r\n<br>\r\nYou can't help but take her body in, from her breasts that you can't help feel envious over...whilst at the same time wanting to touch, and rest against, you take in her hips which just like her bust seem a touch more developed than someone her age should have, you look at her toned legs, finding you can't help but squeeze your legs together as you do so, barley resisting the desire to put a hand on your diaper, your efforts are short lived as you notice her legs part slightly to reveal a wet diaper...one that as you watch only gets wetter, when you manage to take your eyes from her body to see her face again, her expression matches what you imagine yours must look like, her desire and lust painted almost as much as her embarrassment as she turns back into her desk, you watch as very slowly and deliberately her legs close and open, close and open, close and open, you watch as her hand moves into her lap, and feel yours doing the same... <br>\r\n<br>\r\nWhen your thoughts are interrupted as you hear the teacher call your name \"...earth to Mei? I asked you a question\"</span></div></div>",
            "created":1531914780,
            "id":2521459,
            "title":"Natalie was interested in Mei"
        },
        "112122":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Diane",
                "Christine"
            ],
            "content":"<div class=\"\"><div> <span>Having the girls around in only diapers made it easier to change them, and since all the students and teachers were girls anyway, nobody minded being seen like that. Mei walked outside her dorm and went down the hall to her classroom. Most of the other students were already there, and there were two spots still available to sit. One was near her friend Diane, a tall, pale, and somewhat awkward blonde haired girl that Mei hung out with. The other open desk was next to her friend Christine, a popular, talkative redhead.<br>\r\n<br>\r\nWhich friend does Mei sit next to today?</span></div></div>",
            "created":1466053200,
            "id":2165244,
            "title":"Nothing, students wear only diapers here"
        },
        "11213":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Christy wears the skirt and blouse uniform",
                "Christy sees if she can get away with going to class in just a diaper"
            ],
            "content":"<div class=\"\"><div> <span>Christy woke up in her dorm room, yawning and stretching. She sat up in bed and glanced at the clock.<br>\r\n\"Oh, nice. Plenty of time before classes start.\" She said.<br>\r\nShe looked over at her roommates. Diane, her taller, blonde roommate, was still asleep and still in her pajamas. Mei, her other friend, was already awake and in the changing room, getting cleaned up and diapered by an attendant.<br>\r\n<br>\r\nChristy looked down to her diaper, the only article of clothing she was wearing (she didn't like the school's PJ's and preferred to sleep nearly naked). It was clear she had both wet and messed herself in her sleep. Christy sighed.<br>\r\n\"Well, somebody needs to change me, I guess.\" She said to herself.<br>\r\nThe drowsy red-head went to the changing room, where the attendant was finishing up with her Asian friend Mei. The attendant was a nice lady who had known the girls since last years.<br>\r\n\"Oh, Christy, you're up. Give me a second and I'll be ready.\" The attendant said.<br>\r\nShe finished taping up Mei's diaper and helped the young girl off the changing table. Mei ran off to finish getting ready for the day.<br>\r\n<br>\r\nNow it was Christy's turn. She hopped up on the changing table and closed her eyes so her attendant could do her thing. Quickly, the attendant untaped the diaper.<br>\r\n\"Oh, that's a lot...\" The attendant lady said.<br>\r\nChristy tried not to be too embarrassed. She had in fact messed this one pretty good. Quickly, her dirty diaper was disposed of, and she was cleaned with wet wipes. Soon, she was slathered with baby oil and powdered up.<br>\r\n\"All right, almost finished.\" The attendant said.<br>\r\nShe taped up Christy's diaper and, making sure the legs were nice and secure to prevent leakage, helped her off the changing table.<br>\r\n\"Thank you.\" Christy said, smiling.<br>\r\n\"Not a problem, sweetie.\" The attendant said.<br>\r\nChristy went to brush her hair a little bit and have a quick snack before class started. She didn't really like the school's breakfast menu, so she just ate snacks beforehand. Mei walked by, already dressed in the school uniform: a short skirt and blouse. Her diaper was entirely visible.<br>\r\n\"What? You're not dressed yet? Come on, class starts soon!\" Mei said.<br>\r\nChristy looked over at Diane, who was just now waking up.<br>\r\n\"Eh, you're rushing too much, Mei. Look, Diane's barely awake. We've got time.\" She said.<br>\r\n\"Well, at least get dressed. You can't just lounge around naked all day. Come on, let's go!\" Mei said, going out the door.<br>\r\n<br>\r\nChristy looked down at her pale bare skin. The idea of going out to class in just a diaper did occur to her, at first as a joke in her mind, but she never really liked the school uniforms anyway. They weren't really all that comfortable, and pretty much all the students had seen each other naked before anyway... and it was nothing but girls here... Suddenly it didn't seem like such a joke to her.</span></div></div>",
            "created":1475557200,
            "id":2218898,
            "title":"Christine"
        },
        "112132":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Ms. Miller ignored Christy",
                "Ms. Miller forces Christy to put some clothes on"
            ],
            "content":"<div class=\"\"><div> <span>Christy finished her snack. She stood up, took a deep breath, and decided to walk to class in just her diaper. The other girls in the hallways did stare at her.<br>\r\n\"What's she doing, going out like that?\" One girl said.<br>\r\n\"Doesn't she know she's, like, almost naked?\" Another whispered.<br>\r\nBut not everyone was so judgmental. In fact, a lot of her classmates seemed to ignore her completely.<br>\r\n<br>\r\nFinally, Christy got to class. She reached in her desk, took out her books and pencils, and got ready. Mei, who was already sitting at the desk next to her, glared.<br>\r\n\"What do you think you're doing? You're... you're breasts are out!\" Mei said, flabbergasted.<br>\r\nChristy laughed. It felt nice for someone to even acknowledge her budding breasts at all.<br>\r\n\"Well, nobody's stopped me yet. What if it's fun to go to class like this?\" Christy said.<br>\r\n\"But it's in the dress code! Everyone has to use the uniform! you're going to get in trouble!\" Mei said, almost panicking.<br>\r\nChristy laughed again.<br>\r\n\"Ah, that stupid dress code is overrated.\" She said.<br>\r\n<br>\r\nSoon, the teacher, Ms. Miller came in.</span></div></div>",
            "created":1475707620,
            "id":2219435,
            "title":"Christy sees if she can get away with it"
        },
        "1123":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Eight year old hellspawn Helen",
                "Twelve year old brat Bianca",
                "Fourteen year old rebel Rosa"
            ],
            "content":"<div class=\"\"><div> <span>Alice was a twelve year old girl with shoulder length brown hair. She was quite cute, and in the midst of puberty. She had already had her first period, and had small budding breasts. She had a young looking face, and short but slender legs. She wasn't very tall, but tried to keep a somewhat athletic shape.<br>\r\n<br>\r\nAlice was also a very bad girl. She tended to get bored easily and did destructive things for fun. She was only twelve and she had already been expelled from her normal school for trying to set the bathrooms on fire and throwing a punch at the principal. Her parents were furious with her, and sent her away to The Academy, a school for misbehaving girls aged 6 to 14. Alice didn't know what to expect, other than the fact that the building was large and prison-like, with almost no windows. There was a pair of female guards armed with tazers at the door when her parents went to drop her off. As her Mom took Alice out of the car, one of the guards put Alice in handcuffs.<br>\r\n\"Is this really necessary?\" Alice said.<br>\r\n\"Shut up. It's standard procedure.\" The Guard said. She had a nametag saying \"Campus Police: Officer Carmen Martinez\".<br>\r\nMom looked Alice in the eye before she left.<br>\r\n\"You better shape up after this, Alice.\" She said.<br>\r\nAlice said nothing, only glaring at herm other for taking her to the kind of place that would put her in handcuffs.<br>\r\n<br>\r\nAlice was led into the building to a locker room. There were several other girls in there, all of them undressing. A couple of guards were there watching them and confiscating anything they had on them.<br>\r\n\"Strip naked. Come on.\" Officer Martinez said.<br>\r\n\"Fine, whatever.\" Alice said. She quickly took off all of her clothes and handed them to Officer Martinez. She didn't have any sort of contraband on her. No cigarettes (Alice didn't smoke, although some of the rougher girls here did), no knives, no nothing. Just a wallet and a couple of packs of gum. Officer Martinez took out small hose and poured some white stuff on Alice's naked body, being careful not to get any on the girl's head. It burned a little.<br>\r\n\"What the hell was that?\" Alice asked, indignantly.<br>\r\n\"Can the attitude, kid. It's depilatory. It kills your hair forever, never growing back. No body hair allowed. Now wash it off.\" Officer Martinez said.<br>\r\n<br>\r\nAlice reluctantly went to the showers and rinsed the white cream off of her. Sure enough, the few tiny wisps of pubic hair she had all came right out. She felt a little sad seeing it gone. It would never grow back.<br>\r\n<br>\r\nOnce Alice was clean and dried off, she led the still naked girl down the hall to stand in a long line full of other naked girls. Alice was a little self conscious of her nudity at first, but after a few minutes she grew bored and ceased to care. She asked the girl in front of her, an older girl, about 14 with large, full breasts,<br>\r\n\"Hey, what are we standing in line for?\"<br>\r\n\"Diapers. First day they make you stand in line and have an orientation assembly.\" The older girl said.<br>\r\nAlice's blood ran cold.<br>\r\n\"You... You're kidding, right?\" Alice said.<br>\r\n\"Nope. It's some bullshit about trying to humiliate you to make you act right. I've seen it all before. I've been here since I was nine, I know. They feed you laxatives in the cafeteria so you crap yourself all the time and bathrooms are off limits to students.\" Theo der girl said.<br>\r\n\"Well, this sucks. When can I get my uniform, anyway. It's kinda cold in here and I'm freezing my butt off.\" Alice said.<br>\r\nThe older girl laughed. \"Uniform? kid, the diaper IS the uniform. That's all you get to wear.\"<br>\r\n<br>\r\nAfter a while, Alice got to the front of the line where a nurse quickly powdered her and taped up a thick diaper. Alice, as well as all the other girls, didn't so much walk as they did waddle through the halls now. After that she was taken to the auditorium where the principal, a tall stately but aging woman, droned on bout stuff. Alice really couldn't care less about what she was saying. She was already bored and thinking if there was anything she could set on fire nearby. She fantasized about burning the whole school to the ground.<br>\r\n<br>\r\nAlice was awakened from her violent daydream when the assembly ended and she had to go back to her dorm room. She followed the map to room 625, where she found her bed and study area. There was also a diaper changing room, and no bathroom. Showers were communal and toilets were for teachers and staff only. Alice would have to poop and pee in her diapers now.<br>\r\n<br>\r\nAs Alice looked over the room, a sense of sinking despair came over her.<br>\r\n\"What have I gotten myself into?\" She said to herself, looking down at her nearly nude body and thick diaper. Then, suddenly, her roommate arrived.<br>\r\n<br>\r\nHer roommate was...</span></div></div>",
            "created":1437541200,
            "id":2011250,
            "title":"They're being punished"
        },
        "11233":{
            "author_id":"matisse",
            "author_name":"Matisse",
            "choices":[
                "Alice waits for something to happen",
                "Alice shows Rosa she's tougher than she looks"
            ],
            "content":"<div class=\"\"><div> <span>A medium size and medium height girl with long red hair entered in the room. She seems two years older than Alice. She was crying and was rubbing her diapered bottom. She didn’t even looked at Alice: she threw herself over one of the two beds, on her tummy. She hid her face in the cushion, continuing to cry.<br>\r\nAlice noticed that her skin, the part of the backside not covered by the diaper, was red.<br>\r\n“Umh, hi.” Alice introduced herself “I’m Alice, your new roommate. Are you okay?”<br>\r\n“No, idiot, I’m not!” the other girl suddenly shouted “I’m not crying because I’m having fun! Fuck this school and that stupid dorm mother!”<br>\r\nAlice was an easy prey for anger: she began to shout “Hey, you don’t have to speak to me like that! Look at me!”<br>\r\nThe red haired girl looked at her indeed, but with a stare so intense that made Alice falter.<br>\r\n“Do you think you’re though? This school will break you!” she exclaimed “Just few girls keep their spirit, here. I’m one of them. But you? I already saw many like you! You’ll be their obedient little angel in two days!”<br>\r\n“Just because they keep us in diapers? Don’t be ridiculous.” Alice replied.<br>\r\nThe girl made a grin, and pointed at her backside saying “Do you see these marks? These are the signs of the spanking I just got.”<br>\r\nAlice looked at her with wide eyes, and said “Are you kidding me?”<br>\r\n“No, I’m not.” she replied “In this school, students are spanked. And believe me: we are spanked HARD. Man, this will make the maintenance sting even more.”<br>\r\n“Maintenance?” Alice asked, don’t understanding.<br>\r\n“If you misbehave you get a punishment spanking, but regardless of your behaviour you’ll get a maintenance spanking every night before going to bed.” the girl explained, with a grin “Yes, you understood it correctly: we are spanked every night, it doesn’t matter if we deserve it or not.”<br>\r\nAlice looked at the girl, and she was forced to admit to herself that she admired her willpower. She asked to her “What’s your name?”<br>\r\n“Rosa.” she simply said “I’m a rebel. We will see how will you behave.”<br>\r\nAnd with these words, she returned to hide her face in the cushion.</span></div></div>",
            "created":1561106820,
            "id":2676590,
            "title":"Meeting with Rosa"
        },
        "113":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "you like diapers",
                "curiousity",
                "other reasons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So why are you at this diaper school?</span></div></span></div>",
            "created":1355720400,
            "id":1490261,
            "title":"High School"
        },
        "1131":{
            "choices":[
                "Hold it in",
                "Just let it go"
            ],
            "content":"<div class=\"\"><div> <span>You have arrived here as a punishment for your violence in school, the nurse there puts the shunt in your bowel/bladder muscles and puts you in fresh diaper, she gives you shorts and a t-shirt and you head for the playroom. Before you sit down you feel your bladder and your bowels full!!</span></div></div>",
            "created":1437282000,
            "id":2009998,
            "title":"The Punishment"
        },
        "11311":{
            "choices":[
                "Hide in shame",
                "Let it go and keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try for 5 minutes but at no avail....you have wet and messed your diaper. What next?</span></div></span></div>",
            "created":1438405200,
            "id":2015287,
            "title":"5 Minutes Later..."
        },
        "113112":{
            "choices":[
                "Accept",
                "Decline"
            ],
            "content":"<div class=\"\"><div> <span>You keep walking until someone, come along and smells the mess. \"Holy that smells!! Well, it could be worse then mine...\" The girl says in complete sadness. You say probably and the 2 of you get in a long conversation where you both mess your diaper twice. An hour later, you both go to get your diapers changed and get back. The girl says that her name is Amy and you say yours. 3 hours later, 10 minutes before bedtime, you have messed your diapers 3 times while Amy has messed 6 times. She then asks you if you want to be your friend...</span></div></div>",
            "created":1438405200,
            "id":2015290,
            "title":"Your new friend..."
        },
        "1131121":{
            "choices":[
                "Try to get some sleep",
                "Bare the pain for the entire day"
            ],
            "content":"<div class=\"\"><div> <span>She is happy and you 2 will become the best of friends!! That night, your stomach starts to hurt and you have to go badly, you end up having explosive diarrhea 3 times now and it just keeps going!! The nurse come and gives you 2 thick diapers that she has put on you so you don't leak!! The next morning it still hurts and you have messed 15 times last night!!! Luckily you haven't leaked and the nurse comes and says to stay while she changes you!! After she changes you into 2 new thick diapers, she says that you stay in your crib!! She gives you ginger ale and you drink it. After you finished you start to wet your diaper for 7 minutes then have explosive diarrhea and your stomach hurts again. What should you do now?</span></div></div>",
            "created":1440392400,
            "id":2024958,
            "title":"The stomach flu..."
        },
        "11312":{
            "choices":[
                "Accept",
                "Decline"
            ],
            "content":"<div class=\"\"><div> <span>You just let it all go and felt a little bit good, but the girl next to you noticed what you did and starts a conversation about it. In the middle of the conversation, you both mess your diapers. She says her name is Jenny and you say your name. 1 hour later, you guys get your diapers changed and you guys go back to the playroom. 3 hours later you guys messed 5 times and Jenny asks to be your friend...</span></div></div>",
            "created":1438405200,
            "id":2015292,
            "title":"Your new friend...."
        },
        "113121":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Hold it in?",
                "Just release the enema?"
            ],
            "content":"<div class=\"\"><div> <span>You go to the changing room where the nurse gives you an enema so you don't have to go while changing!!! You mess your already messed diaper and she finally changes you!!! But she gives you another enema for some reason she won't tell you!!! Later you hold it in! What should you do?</span></div></div>",
            "created":1442811600,
            "id":2037931,
            "title":"Getting Changed...."
        },
        "1131212":{
            "author_id":"nancy12646",
            "author_name":"Wise",
            "choices":[
                "Jenny and you mess your diapers?",
                "Jenny and you go to class?"
            ],
            "content":"<div class=\"\"><div> <span>You just release the whole enema which takes you 5 minutes to do and the nurse says its so you are actually done going so you don't go right after. You agree with it and go to the play area where Jenny is waiting. She asks you what took so long and you say she had to have an enema to make sure i don't go right after i get changed. She nods and you guys hang out. What happens next?</span></div></div>",
            "created":1449723600,
            "id":2072906,
            "title":"Hang"
        },
        "1133":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "You are incontient.",
                "You started having accidents again.",
                "Even more reasons."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of the reasons below.</span></div></span></div>",
            "created":1355806800,
            "id":1490408,
            "title":"other reasons"
        },
        "11333":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Your parents decided to punish you.",
                "Your parents decided to keep you in diapers for some reason."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are the last two options.</span></div></span></div>",
            "created":1355806800,
            "id":1490414,
            "title":"Even more reasons."
        },
        "115":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "diaper academy for girls of all ages",
                "motherhood academy",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a school for diapered girls of ALL ages and grades?<br>\r\n<br>\r\nOr how about an academy that teaches girls and women of all ages about motherhood?</span></div></span></div>",
            "created":1352696400,
            "id":1466529,
            "title":"Other somehow not listed"
        },
        "1152":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Would Be Mother",
                "Volunteer Child",
                "Teacher"
            ],
            "content":"<div class=\"\"><div> <span>The motherhood Academy is a school made to teach girls and women of all ages about the essence of motherhood.<br>\r\n<br>\r\nThere are two kinds of students at this school: Would-Be Mothers, who learn to carry and care for children, and Volunteer Children, who are to wear diapers at all times, and to serve as demonstration subjects for these Would-Be Mothers, among other duties. <br>\r\n<br>\r\nAs a Would-Be Mother: You will learn everything about being a mother, from carrying and giving birth, to feeding and tending, to caring for children.<br>\r\n<br>\r\nAs a Volunteer Child: You will need to submit to the whims of the teachers and Would-Be Mothers; they won't be able to learn any of these things without you. You will need to be diapered at all times, behave according to the teacher's orders, and become accustomed to babying and whatever other strange teaching methods this academy has to offer.<br>\r\n<br>\r\n(Note: Just because you're a 'mother' doesn't mean you need to be older than your 'child,' and vice-versa) </span></div></div>",
            "created":1352696400,
            "id":1466537,
            "title":"motherhood academy"
        },
        "11521":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Elementary School age",
                "older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So then, how old are you?</span></div></span></div>",
            "created":1352696400,
            "id":1466538,
            "title":"Would Be Mother"
        },
        "115212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Middle School age",
                "older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(Why are there not more choices per chapter?)</span></div></span></div>",
            "created":1352696400,
            "id":1466539,
            "title":"older"
        },
        "1152122":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "High School Age",
                "College Age"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, then?</span></div></span></div>",
            "created":1352696400,
            "id":1466541,
            "title":"older"
        },
        "11522":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Elementary school age",
                "older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what's your age?</span></div></span></div>",
            "created":1352696400,
            "id":1466543,
            "title":"Volunteer Child"
        },
        "115221":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "A teen",
                "An adult"
            ],
            "content":"<div class=\"\"><div> <span>You are Cheryl, age 8, and you've been called upon to volunteer for the Motherhood Academy. You are to assist your partner, a would-be mother, so that she's ready to care for a real child of her own.<br>\r\n<br>\r\n <br>\r\n<br>\r\nToday is the first day of lessons at the Motherhood Academy, and Cheryl, as well as many other elementary school-age children like her, are standing opposite the would-be mothers wearing absolutely nothing, not even the diapers most are required to wear at all times. Why? Because lessons where diapers and clothing are required haven't started yet. <br>\r\n<br>\r\n\"Alright, now today, would-be mothers,\" The teacher, a middle-aged woman with glasses and very large bosoms. \"Before classes may begin, you will be required to chose your volunteer child. This child will serve as your assistant, and is to be treated as you would treat any of your actual future children.\"<br>\r\n<br>\r\nThe next few minutes passed by as mature teens and young adults picked out their child for the next semester. Cheryl was chosen by....</span></div></div>",
            "created":1356584400,
            "id":1496114,
            "title":"Elementary school age"
        },
        "1152212":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Bearing and giving birth to children",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were chosen by a 20 year old girl named Victoria, and once other children were picked out, the teacher continued,<br>\r\n<br>\r\n\"Has everyone decided who they're going with? Good. Then on to our first lesson....\"</span></div></span></div>",
            "created":1356584400,
            "id":1496118,
            "title":"An adult"
        },
        "11522121":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "5 months",
                "2 months"
            ],
            "content":"<div class=\"\"><div> <span>\"...Um, Ms. Martin?\" Victoria raised her hand. \"How exactly are we supposed to learn about that without actually being impregnated?\"<br>\r\n<br>\r\n\"You aren't.\" The teacher answered simply. \"That is why your volunteer child will be placed in your womb for the duration of this lesson.\"<br>\r\n<br>\r\n<br>\r\n\"WHAT???!!\" Children and grown-ups alike blurted at this statement. <br>\r\n<br>\r\n\"One by one, each child will be regressed into an ovum, and placed within the womb of their respective mother.\" The teacher clarified. Cheryl grew very frightened, not at all liking where this idea was going. \"Allow me to demonstrate with Victoria and Cheryl. <br>\r\n<br>\r\nThe teacher led the class into what seemed to be an operating room, where Victoria stripped off all of her clothes, put on a hospital gown, and layed back on the operating table, where she gulped nervously as a clamp was placed in her vagina, spreading it wide open, and a strange tube was inserted into her, making her moan with discomfort. <br>\r\n<br>\r\n\"Next, Cheryl, step over onto this plate here.\" The teacher instructed. Cheryl obeyed reluctantly, and flinched as a glass tank emerged around her. Her nerves then began to truly rack as strange fluids flooded the tank, leaving her in a state of fright until she began to shrink, and shrink, and shrink, until she appeared to be no more. \"Injection.\" The teacher continued, and the tank was flushed clear, much of the fluids entering Victoria's reproductive system, the young adult shivering uncomfortably as the fluids shot right into her womb.<br>\r\n<br>\r\n\"What did you do to her??!\" She asked fearfully.<br>\r\n<br>\r\n\"You are now pregnant, Victoria, with Cheryl.\" The teacher answered. \"But fear not; the point of this was to train you so as to care for a real child that you will be pregnant with.\"<br>\r\n<br>\r\n\"Will she be alright?\"<br>\r\n<br>\r\n\"As long as you properly maintain your body, yes. However, since a full 9 month session would be too long for the year, Cheryl will instead be matured again to be birthed in...\"</span></div></div>",
            "created":1356584400,
            "id":1496129,
            "title":"Bearing and giving birth to children"
        },
        "115222":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Middle School age",
                "older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>middle school age? Or older?</span></div></span></div>",
            "created":1352696400,
            "id":1466545,
            "title":"older"
        },
        "1152222":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "High School age",
                "College age"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then?</span></div></span></div>",
            "created":1352696400,
            "id":1466547,
            "title":"older"
        },
        "11522222":{
            "author_id":"paperbritt",
            "author_name":"PaddedBman",
            "choices":[
                "Yes, lets go with Michelle!",
                "No, let's use someone else. "
            ],
            "content":"<div class=\"\"><div> <span>You are 19 year old girl named Michelle, a tall and somewhat muscular girl with curly black hair, and you've been forced to into a volunteer child role because you signed up for classes late.<br>\r\n<br>\r\nIs this character alright with you?<br>\r\n</span></div></div>",
            "created":1554201960,
            "id":2638477,
            "title":"College age"
        },
        "115222221":{
            "author_id":"paperbritt",
            "author_name":"PaddedBman",
            "choices":[
                "Stephanie",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>All the volunteer daughters, including you, were standing side by side totally naked as the teacher was handing out assigned mothers. The mothers and daughters were chosen by random, to remove any chance of bias from the decision. The other girls were trying to cover their breasts and privates, but you stand there with your hands on your hips, showing off your toned body that you've worked so hard to maintain all your life. <br>\r\n<br>\r\nThe teacher, Mrs. Fontane hands you a piece of paper with your mothers name on it and you are all instructed to meet with you mother in the next room. There you will be issued your \"uniforms\" by your mothers. You go through the door and discover your mother is...<br>\r\n<br>\r\n&gt;Stephanie: A short blond girl who, despite her being the same age as you, looked and acted like a bratty middle or elementary schooler<br>\r\n&gt;someone else</span></div></div>",
            "created":1554202500,
            "id":2638486,
            "title":"Yes, lets go with Michelle!"
        },
        "1152222211":{
            "author_id":"paperbritt",
            "author_name":"PaddedBman",
            "choices":[
                "A chanding mat with diapering supplies and no other clothing",
                "A pink, frilly, childish dress"
            ],
            "content":"<div class=\"\"><div> <span>You walked through the door and check your piece of paper. You looked at the mothers, other college girl who were wearing nothing but hospital gowns with nametags on. At first, you see no one with your mothers name, \"Stephanie\", but you look down lower and finally see her. She was a scrawny little thing with bright blonde pigtails, bubblegum pink lipstick, and heavy pink glitter eye shadow. If it wasn't for her admittedly impressive breasts you'd have assumed she was an actual child. <br>\r\n<br>\r\n\"You Michelle?\" she asked in a condescending tone\" \"Uh yeah, that's me.\" you said, still somewhat confused if this runt was ACTUALLY going to pretend to be your mother for the next semester. She looks you up and down and circles around you, eyeing you like a piece of meat. \"I wanted someone cuter, but I guess you'll do.\" she says with an air of disappointment in her voice. You almost clock her, but hold back, knowing you'll get in severe trouble.<br>\r\n<br>\r\n\"Alright little baby Michelle, let's get you changed and back home!\" she shrieks. Her voice goes from disappointment to shrill mocking. She leads you to the other side of the room, where you find.......</span></div></div>",
            "created":1554203340,
            "id":2638497,
            "title":"Stephanie"
        },
        "12":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Elementary",
                "Middle",
                "High",
                "College",
                "Other somehow not listed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which school?</span></div></span></div>",
            "created":1347339600,
            "id":1425600,
            "title":"All boys school"
        },
        "121":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "\"Yes, help me please\"",
                "\"No, i can do it alone\""
            ],
            "content":"<div class=\"\"><div> <span>Ben was a 11 year old boy was brought by his parents to the academy. Ben don´t wandt it,<br>\r\nbut he has no choice. As he got out of the car, he saw many other boy´s. Then he hear his parent´s<br>\r\n\"Here, your suitcase. Good bye.\". A minute later, he stand alone at the entrance of the academy.<br>\r\nSad, he looked after them. Than he heard a voice \"Hello, you must be Ben.\". The young boy look to a<br>\r\nother boy \"My Name is Simon. I´m a trust student. Come with me, i show you your room.\".<br>\r\nBen follow Simon around the grounds. He saw many boy´s. He was surprised. Some of the boys wore diapers.<br>\r\nIn other cases he was able to bind under the pants. As he look to Simon´s pants, he saw that he wore diapers<br>\r\ntoo. As the 16 year old bo open Ben his door, the younger saw on his bed some diapers \"What? Do your wandt<br>\r\nthat i to wear diapers?\" he ask \"Yes, that that here is a diaper Academy.\" he reassured Ben and take on<br>\r\nof the diaper´s \"For you as new student, there are extra thick and padded diapers. You will feel comfortable in it.<br>\r\nWhen you wandt, i can help you to put the diaper´s on.\". Ben look to Simon \"</span></div></div>",
            "created":1366520400,
            "id":1575955,
            "title":"Elementary"
        },
        "1211":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "Just a shirt, that did nothing to hide his diaper",
                "a onsie, customary for first years",
                "Nothing. No students were ANYTHING but diapers at this school"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright.\" Ben agreed reluctantly. <br>\r\n<br>\r\nSimon pulled off Ben's pants and underwear, before also pulling off his shirt, leaving the new boy naked, before sitting him on the bed. There, he lathered the boy's nether regions with baby lotion, taking extra care to rub down him cock, before powdering him, and diapering him up, before sitting him back up, and giving him a pat on the butt, some of the powder escaping the back of his diaper. <br>\r\n<br>\r\n\"Guess I better get into uniform too.\" Simon muttered, stripping off his own clothes, very quickly swapping his wet diaper for a new one.<br>\r\n<br>\r\n\"Whoa. Where'd you learn to change so fast like that?\" Ben asked. <br>\r\n<br>\r\n\"Years of experience.\" Simon replied. \"By the way, here's your uniform.\" He gave Ben....</span></div></div>",
            "created":1370235600,
            "id":1602944,
            "title":"\"Yes, help me please\""
        },
        "12111":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "He did it quietly in class",
                "He went with him into an extra room"
            ],
            "content":"<div class=\"\"><div> <span>He handed in a shirt with the school emblem on it. Ben put it on and waited for a pair of pants, but Simon gave him no but went to the door, \"What? That's it?\" asked the younger and the trust student nodded, \"Sure. Only in winter we wear more., but now we have summer temperatures and beautiful.\" Ben looked unsure about the others. Simon took him by the hand and smiled, \"Come, Today I come with you the whole day.\".<br>\r\n<br>\r\nSimon went to school with Ben. As they entered the classroom Ben saw lots of other boys his age. Clothed only with shirt and diapers. Yet the boy felt a little uncomfortable. During class, he felt a pressure in and looked at Simon, who was sitting next to him, \"Simon, I ...\" However, he was caught, not weitersprechen.Der Older looked up at him, \"Is your diaper wet?\" he asked quietly, but shook head. Simon ran a hand between his legs and felt that hard. He smiled and said \"I'll help you.\".</span></div></div>",
            "created":1370235600,
            "id":1603141,
            "title":"Just a shirt, that did nothing to hide his diaper"
        },
        "121112":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "No ",
                "Yes (The D Club arrives, and Ben's first meeting begins)"
            ],
            "content":"<div class=\"\"><div> <span>\"What are we doing here?\" Ben asked as Simon led him into an empty room after class had ended; a study hall, by the looks of it.<br>\r\n<br>\r\n\"You'll see.\" Simon grinned. He sat down, prompting Ben to sit in his lap. <br>\r\n<br>\r\n\"Okay... now what?\" Ben asked, concernedly. <br>\r\n<br>\r\n\"Now... we have a bit of fun.\" Simon grinned. He untapped Ben's diaper, pushing the front open, exposing his hardened cock and looking over the boy's shoulder to see it. \"Well! I think you'd fit right in.\"<br>\r\n<br>\r\n\"Fit in where...? Eh?\" Ben asked, surprised as Simon reached around front and stroked his dick with enthusiasm. \"What are you doing?\"<br>\r\n<br>\r\n\"Helping you out.\" Simon replied simply. \"Have you ever masturbated before?\"<br>\r\n<br>\r\n\"Master-what??\"<br>\r\n<br>\r\n\"Guess not. Well, you'll like where this leads. Trust me.\" Simon assured him. He got out of the chair, Ben sitting in his place, and Simon, pulling the first year boy's shirt off, sucked the boy's cock with his mouth. Ben gripped the edges of the chair; while he thought what was happening was very dirty, he couldn't deny that he enjoyed it, that that he wanted to see where Simon was going with this. <br>\r\n<br>\r\nFinally, Ben ejaculated for the first time, spraying Simon's face while also giving him a little taste of cum.<br>\r\n<br>\r\n\"Well? Did you like it?\" He asked. Ben, a little worn by his orgasm, simply nodded. \"I'm glad. Because I'm actually part of a whole club devoted to this kind of thing. You wanna join?\"</span></div></div>",
            "created":1389848400,
            "id":1728628,
            "title":"He went with him into an extra room"
        },
        "1211122":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "rub Bens chock",
                "spol Bens hole"
            ],
            "content":"<div class=\"\"><div> <span>After Ben's first experience led him Simon through the building. It was break so they had time . In a cozy room both finally arrived. Simon smiled at Ben and took him by the hand, led him into the room <br>\r\n<br>\r\n\" welcome Ben. If I may imagine. These are Max, Travis and Jason.\" asked Simon before the 3 other guys. Ben looked at each of them. Also, they only wore t-shirt and diapers. The oldest of them , Travis, also seemed to be a little older than Simon . Ben guessed him to be 15 Then he looked up at Jason, who probably was the same age as Simon. The youngest of them, Max, was the same age as Ben. Simon pulled him closer to them then, \"This is Ben.\" Simon asked him to \"He wants to join with us.\" Travis looked at Ben something and smiled <br>\r\n<br>\r\n\"We always welcome new members. Actually, there are more of us, but the others are busy with school.\" Travis looked at Ben something \"Sweet you see yes from.\" he said, grinning as Ben blushed it . Then he looked at Max, <br>\r\n<br>\r\n\"Well as long as you're also not yet here Ben. Soon, we wanted to make your initiation ritual. Währe As though thou do it with Ben, then you are both full members.\" Even Max blushed slightly and looked at Simon and Travis. <br>\r\n<br>\r\n\"What have you imagined?\" he asked. Travis thought about it and saw to a cabinet. He opened it, \"<br>\r\n<br>\r\nHow about we show them how much fun you can have with diapers. \" He said, taking out a tub of gel. With that he went to Ben and handed it to him, \"Take as much of it as you like and rub you down with it.\" He said. Ben hesitated, but then took the Tub. He made a big pile on his hand and then drove it into his diaper, rubbing his penis and testicles completely. Shortly afterwards, he felt something, a pleasant warmth spread in his abdomen. Then Travis went to Max and he also took a lot of the gel and rubbed himself with it. Then came the three older side. Max walked over to Ben and smiled at him <br>\r\n<br>\r\n\"What are you doing?\" Ben asked, and then felt the hands of the other on his chest <br>\r\n<br>\r\n\"Relax.\" he said, kissing Ben softly on the lips. This startled a moment, then, however, felt relaxed and let himself fall. Max grabbed Ben's hips and pressed it to his own. The members of the two boys were now hard and stiff, formed two large dents in diapers. This they rubbed against each other and felt like everything was still intensive through the gel. Shortly after, Ben wall on the soft carpet again and Max, who seemed to convey him to the seventh heaven. A hand picked Max and licked his fingers. Ben wondered what he was up to. he...</span></div></div>",
            "created":1389934800,
            "id":1728930,
            "title":"Yes (The D Club arrives, and Ben's first me..."
        },
        "122":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "6th",
                "7th",
                "8th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay you're a middle schooler what grade?</span></div></span></div>",
            "created":1475603220,
            "id":2218912,
            "title":"Middle"
        },
        "1221":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Your Roommate ",
                "The upperclassmen "
            ],
            "content":"<div class=\"\"><div> <span>You're an 11 soon to be 12 year old boy who's name is Mike. Your school was a weird one. Every kid has to wear diapers, and every kid under the age of 13 wasn't allowed to change himself. They were assigned to an upper classmen that would change them. \"I hope he gets here soon.\" You mutter. Your messy diaper is getting uncomfortable. You hear a knock at the door. You turn your face to the door wondering who it is. It opens and it was...</span></div></div>",
            "created":1475607060,
            "id":2218938,
            "title":"6th"
        },
        "12212":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Have Todd read you a story",
                "Just go to bed."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, are you Mike?\" The teen asks trying not to show how tired he was. The high schoolers always have a lot more work than the middle schoolers. They also aren't quite as filled with energy like the younger kids. \"Yeah, nice to meet you!\" You greet energetically! \"I'm Todd Jay.\" He replies shaking your hand. \"So, did you need a diaper change or anything?\" He asked ackwardly. It's pretty clear he doesn't do this often. \"Yeah, I pooped.\" You confirm, taking your pj bottoms off. You were pretty used to the whole diaper thing. Your parents diapered you for the past few weeks, so you'd be used to wearing them at school.<br>\r\n<br>\r\nHe sighs in annoyance, not at you but at his situation. \"Alright, just try to lie still for me, okay bud.\" He orders getting a diaper from a neat stack in the closet. You obey him and lie as still as you can. He tosses a diaper on the bed, then grabs a package of wipes, and a bottle of powder. He untapes your diaper and starts to wipe your butt and your privates. <br>\r\n<br>\r\n\"So how old are you?\" You ask not liking silence much, especially during a diaper change. \"I'm 15, how old are you?\" Todd replies humoring you. \"Eleven, I'm almost twelve though! My birthday is in two weeks!\" You chirp. \"Oh that's cool, my birthday is in a couple months. December 13th\" He says as he finishes changingyou. He even helps put your pj bottoms back on. <br>\r\n<br>\r\n\"I can put my own pants on.\" You protest and pout lightly. \"Sorry, I'm used to changing my little brother. He's two, so I have to put his clothes on for him and change his diapers.\" He apologized sheepishly. \"It's alright, but why don't your parents do that stuff?\" You reply curiously. \"They do when their home from work and stuff, but I have to pick him up from daycare in the summer and take care of him until they get home.\" He explains patiently.<br>\r\n<br>\r\n \"Anyway, did you want me to read you a story and tuck you in?\" He asks as he knew for most of the kids in your grade, this was the first time they've been away from home. You think for a minute. You do kinda miss your parents, maybe a story would help? What do you decide?<br>\r\n</span></div></div>",
            "created":1475626320,
            "id":2219100,
            "title":"The upperclassmen"
        },
        "122121":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Your roommate ",
                "Todd"
            ],
            "content":"<div class=\"\"><div> <span>\"Umm, if it's not a big deal to you, I guess, I wouldn't mind if you read a story.\" You reply shyly. You don't want to force a Todd into anything. \"Yeah it's sure no problem.\" He says as he sits on your bed. \"Thanks.\" You thank him and hug him. He looks surprised at the hug but not upset. \"Like I said, not a problem!\" He chuckles returning the hug. <br>\r\n<br>\r\n\"Alright here we go, Once upon a time there was..\" He starts and you begin to listen with rapt attention. He continues \"Three bears, a papa bear, a momma bear, and a baby bear...\" You keep listening excitedly. This is your favorite story and you love it every times someone reads it you. It's the only little kid story you haven't out-grown yet. \" He goes on with the story \"There was also a little girl named Goldie Locks. <br>\r\n<br>\r\nShe was walking in the woods when...\" You can hear him continuing the story, but your eyelids grow too heavy and sleep begins to call louder and louder. \"Why don't you go to bed? I'll tell you the rest tomorrow.\" He suggests chuckling. \"M'kay.\" You mange to murmur out before falling asleep.<br>\r\n<br>\r\nYou wake up early the next day at 8:00 in the morning. \"Mike wake up.\" You hear someone say as they shake your shoulder. Who was it?<br>\r\n</span></div></div>",
            "created":1475628720,
            "id":2219109,
            "title":"Have Todd read you a story"
        },
        "1221212":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Let him wash you",
                "Insist that you can bathe yourself."
            ],
            "content":"<div class=\"\"><div> <span>\"Huh, what's up?\" You ask groggily. \"You gotta get up for school.\" Todd replied. \"Oh, darn.\" You yawn disappointedly. \"Come on, use your diaper, so I can help get you ready for school.\" He ordered seemingly in a rush. \"It's already wet.\" You reply feeling the outside of your diaper. \"Alright go get washed up.\" He says, pointing his thumb to the bathroom. You nod and sleepily make your way to the bathroom. He follows you in, likely to make sure you don't fall asleep while in there.<br>\r\n<br>\r\n You take your jammies off and rip off your diaper, throwing it in the trash. Meanwhile, Todd turns on the faucet for the hot water for your bath. And pours the bubbles in for you. While the tub is filling, you brush your teeth. You take your time, as your classes don't start 'till 9.<br>\r\n<br>\r\n\"Alright it's ready.\" He states leading you to the tub. You step in and immediately relax into the hot bubbly water. Todd grabs a rag soaks it isn't the water and was about to start washing you. \"Todd, I'm a little sleepy, but I can wash myself!\" You protest grabbing his wrist. \"I need to make sure you get every place clean. If you look really dirty, I get the blame.\" He argues not backing down. What do you?</span></div></div>",
            "created":1475637780,
            "id":2219161,
            "title":"Todd"
        },
        "13":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "Elementary School",
                "Middle School",
                "High School",
                "College",
                "Other somehow not listed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, what age group are you in?</span></div></span></div>",
            "created":1347339600,
            "id":1425595,
            "title":"Co-ed school"
        },
        "131":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "you like diapers",
                "you are innocent",
                "your parents brought you here"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so, why are you here?</span></div></span></div>",
            "created":1372136400,
            "id":1617613,
            "title":"Elementary School"
        },
        "1311":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "boy",
                "girl",
                "special"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>boy or girl?<br>\r\nOr somethin special?</span></div></span></div>",
            "created":1372136400,
            "id":1617615,
            "title":"you like diapers"
        },
        "13113":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "Was also a boy with breasts.",
                "Was a girl with a chock"
            ],
            "content":"<div class=\"\"><div> <span>As the young Jaimie even with 10 still loved to wear diapers were looking for him a special school his parents . They thought it was not bad that he liked to wear diapers. However, their goal with the school was also something else . This school not only boys and girls went liked the diapers or needed , but also what were special. So it was with Jaimie . He was a handsome , fair-haired boy. However, it differed little from other guys, what had made him hard in his previous school time. Where in his diaper his young manhood was hidden , showed under his T -shirt otherwise. He had breasts and not exactly small . His parents brought him to the school. In secreteriat all formalities were cleared and eventually a trust student was called in which Jaimie should bring to his room. After he had said goodbye to his parents, he looked to the trusted student , who spoke to him , \"Hi, you're the new you?\" he heard the friendly voice and was surprised when he saw that the students ...</span></div></div>",
            "created":1389934800,
            "id":1728966,
            "title":"special"
        },
        "1312":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "boy",
                "girl",
                "other idea?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>boy or girl?<br>\r\nor other idea?</span></div></span></div>",
            "created":1372136400,
            "id":1617617,
            "title":"you are innocent"
        },
        "13123":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "his sister",
                "the teachter"
            ],
            "content":"<div class=\"\"><div> <span>Julie and her twin brother Julien went on a diaper school because they needed it. So they were not bullied by her classmates, her parents sent her to this school. Both were 12 and Julie during the wear of the diapers had no problems Julien had some problems with it. He was the unangehm and sometimes he had other problems than just a feuche diapers. Julie helped her brother as best she could. Since they were not even one week at school, Julien had even more trouble than usual, although he knew that all wore diapers at this school, and he also saw it in the pants, he felt bad. On her fourth day of school they had sports in the morning except for a t-shirt and diapers, the students had nothing. Julen not dared to leave the locker room. His sister was with him and tried to encourage him, <br>\r\n<br>\r\n\"Come on, here we all are.\". Julien looked at as the twenty year old gym teacher came to them. Julien swallowed hard as he saw only a diaper and a t-shirt also it. <br>\r\n<br>\r\n\"Are there problems? Must be changed your diaper boy,\" she said and Julien noticed how his diaper was wet. Silently he nodded, \"Okay come to the changing room.\" Julie looked at the teacher. <br>\r\n<br>\r\n\"I can help him. Perhaps he is enjoyable., Or Julien?\". The boy decided to</span></div></div>",
            "created":1372136400,
            "id":1617633,
            "title":"other idea?"
        },
        "1313":{
            "author_id":"katarus",
            "author_name":"Searo",
            "choices":[
                "boy",
                "girl",
                "other idea"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>boy or girl<br>\r\nor other idea?</span></div></span></div>",
            "created":1372136400,
            "id":1617618,
            "title":"your parents brought you here"
        },
        "13131":{
            "choices":[
                "Go in your diaper",
                "Ask your teacher for help"
            ],
            "content":"<div class=\"\"><div> <span>Your mother just dropped you off at a school that you don't even know the name to. You are dark and confused, your name is Daniel. You just moved here, and needed a school. Your parents dropped you off here.<br>\r\n<br>\r\nNow, you walk into school. There is other kids, and a stench that is weird. A older boy walks up to you.<br>\r\n<br>\r\n\"You must be Daniel.\" The older kid says.<br>\r\n<br>\r\n\"Yes... i am\" You say shyly.<br>\r\n<br>\r\n\"Oh come on! Lets get you started on the right track before you get unconfortable. Follow me!\"<br>\r\n<br>\r\n<br>\r\nYou follow this man to a long hallway, and he says \" So this is the Diaper Acadamy, you must wear a diaper all the time now.\"<br>\r\n<br>\r\n\"What!?\" You say, deeply confused. Your parents knew about this too.<br>\r\n<br>\r\n\"Well, never mind that: This is your diaper room, if you feel like you need a change or are a new student, you would come here.\"<br>\r\n<br>\r\n\" Okay... \" still deeply confused.<br>\r\n<br>\r\n\"Come on in, lets get your first diaper on.\"<br>\r\n<br>\r\nYou walk into this room, and see this long table. \"Hop up\" he says.<br>\r\n<br>\r\nYou get onto the table with the stool provided.<br>\r\n<br>\r\n\" Now relax, this will only take a minute. \" he says as he pushes you down slowly.<br>\r\n<br>\r\nHe undresses you all the way down to your bum, and quickly puts some powder on you and diapers you up.<br>\r\n<br>\r\nThen he redresses you and the man says, \"You are all set!\"<br>\r\n<br>\r\n<br>\r\nNow lets walk to your classroom. <br>\r\n<br>\r\nYou go into your classroom, and you meet a teacher named \"Mrs. Harper\"<br>\r\n<br>\r\nyou find a seat and sit down.<br>\r\n<br>\r\nA few minutes into the class you suddenly feel the urge to go.<br>\r\n<br>\r\nWhat should you do?</span></div></div>",
            "created":1384318800,
            "id":1693843,
            "title":"boy - The start"
        },
        "132":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "They are incontinent",
                "They love wearing diapers",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why do the pubescent boys and girls of this co-ed middle school wear diapers?</span></div></span></div>",
            "created":1440478800,
            "id":2025223,
            "title":"Middle School"
        },
        "1323":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "They are being punished",
                "It's part of some ridiculous tradition that's lost all meaning",
                "No reason. Everyone acts like middle schoolers in diapers is totally normal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A few other options</span></div></span></div>",
            "created":1440478800,
            "id":2025230,
            "title":"Other"
        },
        "13231":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to Aneurysm Hills Correction School, a place where boys and girls did something bad or whose parents hate them go to get humiliated and degraded while they learn basic school curriculum. Students are usually kept in diapers and very little other clothing. Being that they are going through puberty there is often a sexual element to their torment as well.<br>\r\n<br>\r\nIs the main character going to be boy or a girl?</span></div></div>",
            "created":1533449640,
            "id":2529250,
            "title":"They are being punished"
        },
        "132312":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Continue with Kara",
                "Different Girl for main character"
            ],
            "content":"<div class=\"\"><div> <span>First option for main character is Kara. She's small, weak and got sent to Aneurysm Hills for stealing money out of her mom's purse all the time. She's got long but somewhat messy blonde hair, very small developing breasts, blue eyes, and extremely pale skin, like she hasn't been outside in a year. She's quite skinny with her ribs visible when she doesn't have anything covering her chest, which is almost always now that she's in a Diaper Humiliation Academy. Kara's body hair was surgically removed for hygiene reasons (like most students) and has small scars near her genitals and on her legs.<br>\r\n<br>\r\nProceed with Kara?</span></div></div>",
            "created":1533450180,
            "id":2529255,
            "title":"Girl"
        },
        "13233":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><div> <span>In a world not so diffrent from our own, everyone under the age of 18 wore diapers. In the year 2000 the average age for potty traning was about 2.5 to 3 years old, with occasional accidents happening at 4 or 5. In 2005 parents were getting distracted by work and the problems of the world. The average age for potty training kids increased to about 4 or 5 years old with the occasional accidents at 6 or 7 years old. The fact is, kids in kindergarten started wearing pull ups and even diapers to school more and more often. By 2008 it was getting rare to see a kid younger than 9 not wearing diapers or pull ups. <br>\r\n<br>\r\n  <br>\r\nBy 2020 it was almost impossible to see middle schoolers not wearing pull ups, and more and more were starting wearing diapers full time. In fact parents decided to start teaching their kids to change themselves ataround twelve years old. Now finally in 2035 almost all high school students were in diapers full time. At this point, if you weren't wearing diapers full time in middle school you wre considered a prodigy. Now onto our main is it a boy or a girl.</span></div></div>",
            "created":1447909200,
            "id":2064330,
            "title":"No reason. Everyone acts like middle schoolers ..."
        },
        "132331":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "6th",
                "7th or 8th"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, our main character is a boy. What grade is he in?</span></div></span></div>",
            "created":1447909200,
            "id":2064331,
            "title":"Boy"
        },
        "1323311":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "To hang out",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Second person P.O.V<br>\r\nYou are 11 years old. Your name is Will Nikes, you stood around 4ft 7. You had dirty blond hair with brown eyes. Currently you were sitting in last period/math class, you were wearing a cloth diaper with plastic pantsover them, over your diaper were your jeans, and of course you were wearing a t-shirt. You felt a slight pressure in your bowels, and without a thought released a large load in you're diaper. You saw several other kids in your class with a glazed look in their eyes, they were quite obviously using their diapers. Finally the bell rung, you practially ran out of the room. As soon as you were you were out of their, you felt a tap on the shoulder. It was your friend Brian. He was slighlty taller than you, with black hair and grey eyes. What does he want?</span></div></div>",
            "created":1447909200,
            "id":2064347,
            "title":"6th"
        },
        "13233112":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "To change you",
                "Other still"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could he want?</span></div></span></div>",
            "created":1447995600,
            "id":2064466,
            "title":"Other"
        },
        "132331121":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Tom, do you mind if I change you?\" Brian asked a little uncomfortable. You blushed and asked \"why\". \"Well, you know how I'm turning 11 next week, well my mom says that I'll be old enough to change my little brother, and umm I wanted some experience changing diapers.\" \"Oh\" you replied a little suprised.<br>\r\nDo you let him change you?</span></div></div>",
            "created":1447995600,
            "id":2064468,
            "title":"To change you"
        },
        "1323311211":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Yes, he did great",
                "No, he completly botched it"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright\" you agreed somewhat reluctantly. You followed him to the changing area, and lied down on a table squishing the poo against you rear. Brian took a deep breath, then he took your pants off, unpinned your diaper, lifted you by your ankles  and started to wipe you down. You Tried your hardest not to squirm as the cold wipes touched your rear end.  He removed the poopy diaper from under you, slid a clean one under you, powdered your privates, pinned the new diaper on, and finally slid on the plastic pants. He sealed the dirty diaper in an aor tight bag, and put it in your disper bag, while you inspected his work. \"Did I do well?\" He asked hopeful</span></div></div>",
            "created":1447995600,
            "id":2064485,
            "title":"Yes"
        },
        "13233112111":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, you did great!\" You exclaimed suprised at how well he changed you. He did it almost as well as your mom does. \"Maybe you can change me instead of doing it myself!\" You were only half joking, Brian was really good at changing you, and you techincally weren't suppose to know how to change yourself until you were twelve this july.  Brian was turning twelve next week, and at school everyone twelve and up was allowed to change the younger kids. Does he accept your offer?</span></div></div>",
            "created":1447995600,
            "id":2064488,
            "title":"Yes, he did great"
        },
        "132331121111":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure thing\" Brian said smiling, \"Thanks alot\" you replied smiling. You pulled your jeans up, and started to walk home. You lived about 2 blocks from school so you usually walked home. The walk home was uneventful and when you got home, you walked through the front door.<br>\r\n<br>\r\nWas anybody home?</span></div></div>",
            "created":1447995600,
            "id":2064534,
            "title":"Yes"
        },
        "1323311211111":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Your older brother/ sister",
                "Your parents"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who Was home?</span></div></span></div>",
            "created":1447995600,
            "id":2064535,
            "title":"Yes"
        },
        "13233112111111":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Brother",
                "Sister"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it your brother or sister?</span></div></span></div>",
            "created":1447995600,
            "id":2064537,
            "title":"Your older brother/ sister"
        },
        "132331121111111":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey kiddo, did ya need a change\" Your brother said smiling at you. You grinned up at him, he was 17 years old about 5'9 , with messy dark hair and brown eyes. He was in pull ups in the morning but needed diapers at bed time. \"Nah, I got changed at school. Thanks anyway though\" you replied to his earlier question. \"Alright\" he nodded. \"Mom said I needed to give you a bath, since were going to Granpa's soon.\" He looked at you for a second and asked\" Can you do it yourself, or do you need help.\" <br>\r\nA part of you wanted to immediately say that you could, but another part was worried you'd miss a spot or two. Will you try it yourself?</span></div></div>",
            "created":1447995600,
            "id":2064542,
            "title":"Brother"
        },
        "1323311211111112":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Wet",
                "Messy"
            ],
            "content":"<div class=\"\"><div> <span>\"I think, I'll need help\" Alex( your brother) sighed but nodded, and he went upstairs and started the bath and put the bubbles in. You followed him and started to undress. Apparently, you were going to slow for his liking, he took off your shirt and pants, and before you knew it he had unpinned your diaper.. The tub filled quickly, and you sat down gently. Alex gave you a couple minutes to relax in the warm water before he started to clean you. After about 5 minutes, he grabbed a wash cloth, and started gently cleaning you starting from your face, to your legs and privates. After that he pulled the drain, toweled you off he re-pinned your clean diaper on and dressed you in a pair of drees pants and a polo shirt. He went into his room changed his pull up, as your bath took a little longer than he thought. He came out 20 minutes later. During that time you had to use your diaper. <br>\r\n<br>\r\n   When he came out, he was wearing essentially the same thing as you were, except his shirt was dark green instead of light blue. On his shoulder was a bag filled with spare pull ups, diapers, and changing supplies. He got down on his knee, pulled your pants down and checked your diaper. You were...</span></div></div>",
            "created":1447995600,
            "id":2064557,
            "title":"No"
        },
        "13233112111111121":{
            "author_id":"heaven719",
            "author_name":"Majestic moose",
            "choices":[
                "Messy",
                "Wet"
            ],
            "content":"<div class=\"\"><div> <span>During the time your brother was changing, you had unknowingly wet yourself. Your brother looked a little annoyed at having to change you but without complaint he lied you down on floor, unpinned your diaper, and in an instant you had a new diaper pinned on. He washed his hands as you pulled your pants back up. You followed him out to his car, and got in the back seat and buckled yourself into your booster seat. You were only 4'7 and you needed to be atleast 4'9 to not sit in a booster seat. You quickly fell asleep. About an hour later you woke, and you were in your brother's arms being carried into your Granpa's house. It also seemed you had an accident while you were sleeping. Were you wet or messy?</span></div></div>",
            "created":1447995600,
            "id":2064772,
            "title":"Wet"
        },
        "132332":{
            "author_id":"karlmarx700",
            "author_name":"karlmarx700",
            "choices":[
                "Nikki",
                "Ashley"
            ],
            "content":"<div class=\"\"><div> <span>2 characters to choose from!<br>\r\n<br>\r\nNikki: 6th grade, short for her age. Blonde hair. Slow bloomer, hasn't really started puberty yet. Not very popular, but generally happy. Like animals and is in the school band.<br>\r\n<br>\r\nAshley: 8th grade, normal height and development. Black hair, she's into sports. She's popular, she a cheerleader, and has a light tan. Very prideful, but overall a fun person.<br>\r\n<br>\r\nWhich one will the story be about?</span></div></div>",
            "created":1448600400,
            "id":2067345,
            "title":"Girl: 2 characters to choose from"
        },
        "133":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Your parents forced you.",
                "The government forced you.",
                "...benefits."
            ],
            "content":"<div class=\"\"><div> <span>You sighed, staring at the scene before you as you stood before the gates of the Diapered Academy. As mandated, you wore a plain diaper covering your crotch. Just hours earlier, you were in normal underwear and jeans. Now, you had to walk almost half-naked with a diaper.<br>\r\n<br>\r\nHow did it come to this?<br>\r\n<br>\r\nWell, to be honest, you didn't choose to go to this school. Why would anyone choose to go to this school? The only reason you were here was because...</span></div></div>",
            "created":1412571600,
            "id":1867505,
            "title":"High School"
        },
        "1331":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "...your mother was a high school teacher here.",
                "...your father was the principal.",
                "...your parents felt that this was going to be a good experience. (How?!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You had no choice to come to this school because of your parents. Was this punishment for something you've done? No, not really...even if it did feel or seem like that. The real reason was because...</span></div></span></div>",
            "created":1412571600,
            "id":1867507,
            "title":"Your parents forced you."
        },
        "13311":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "...it gets worse. The academy requires students to live on campus for 4 years.",
                "...at the very least, you didn't have to wear diapers full-time."
            ],
            "content":"<div class=\"\"><div> <span>The biggest influence of your fate was because of your mother, Jane. For whatever reason, she was a high school teacher and what more, she's been here for four years and actually enjoys teaching the students here.<br>\r\n<br>\r\nThe biggest aspect that made you upset was that she never once told you she was teaching a bunch of diapered high school students. Sure, you knew she was a teacher, but you couldn't even imagine she was involved with a school like this.<br>\r\n<br>\r\nOf course, your father agreed and also knew the details of your mother's work. How was it that nobody ever told you?</span></div></div>",
            "created":1412571600,
            "id":1867508,
            "title":"...your mother was a high school teacher here."
        },
        "133111":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "...only boys have to wear diapers. Girls apparently come here as partners.",
                "...everyone had to wear diapers...aside from faculty of course."
            ],
            "content":"<div class=\"\"><div> <span>...and it only gets worse. You had to stay on-campus for four years until you graduated. It gave you shivers, but there was no use in trying to resist what was going to come. Even if you ran away, you weren't where to go. Your mother had already enrolled you and running away meant that if you were caught, you could be escorted back here.<br>\r\n<br>\r\n...well, it was a co-ed school. There was apparently approximately a thousand students here, boys and girls. You weren't going to be the only one is misery, right?<br>\r\n<br>\r\nWell...</span></div></div>",
            "created":1412571600,
            "id":1867510,
            "title":"...it gets worse. The academy requires students..."
        },
        "1331111":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "It was your mother!",
                "It was a stranger...a busty stranger who was in the middle of changing."
            ],
            "content":"<div class=\"\"><div> <span>To correct yourself, it would be only you and potential other boys who would share each other's misery. Girls apparently came here to be roommates and partners for the diapered students. While that may seem weird, apparently they were given a lot of benefits. As to the details of those benefits, you didn't know and neither of your parents felt it necessary to disclose that sort of information.<br>\r\n<br>\r\nSo, even with common sense to have a girls dorm and a boys dorm, this school apparently shuns that sort of separation. In a dorm room, each boy should have a girl roommate. There wasn't any specifics with regards to why this academy has such policies. More importantly, was that dangerous?<br>\r\n<br>\r\nYou sighed. You were stalling, but you knew that it was pointless to do so. With a luggage behind you, your feet reluctantly moved as you walked through the gate. Your eyes widened as you stared at such an unbelievable scene.<br>\r\n<br>\r\nHigh school boys walked around the campus with nothing but a pair of diapers on. There were also girls who looked normal, wearing an official uniform. Majority of them were walking with a diapered student, some holding hands, and...<br>\r\n<br>\r\nYour eyes widened and your jaw nearly dropped. You nearly missed the sigh, but one of the girls out of the many who were walking with their partner was actually carrying a diapered boy! The diapered student had his legs locked around the girl's waistline while she had one hand under his bottom and the other around his back, easily carrying him without a care in the world. You could see freshman boys who was nearly shocked as you were.<br>\r\n<br>\r\nOthers, however, turned a blind eye to it and walked on, ignoring the sight. It appeared most of those students were sophmores or higher!<br>\r\n<br>\r\nYou felt your legs shaking. This really seemed unreal, like some kind of weird dream. Taking a deep breath, you decided not to think about why that diapered guy was allowing his...girlfriend...or caretaker carry him like that.<br>\r\n<br>\r\nAll the rest of the girls seemed to be chatting with their male partners as if nothing was wrong. At the very least, it looked normal...aside from the fact that almost every guy except freshmans had a girl beside them and that they were diapered.<br>\r\n<br>\r\nDeciding you should really get to your dorm room and settle in before your school would start, you tried to remain calm. This was all too weird. Maybe attempting to escape wasn't such a bad idea.<br>\r\n<br>\r\nWhen you reached your dorm room that you were assigned, you were already beet red. Having to walk in diapers in front of everyone, faculty, and peers brought an infinite amount of shame. It didn't matter if it was acceptable in this school, it was still damn embarrassing.<br>\r\n<br>\r\nWith a key in your hand, you shakily unlocked the door and entered your dorm room. The first thing you immediately notice was how spacious the room was. Before you could examine it closely, your eyes locked to someone in your room.</span></div></div>",
            "created":1412571600,
            "id":1867519,
            "title":"Unbelievable"
        },
        "13311111":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Follow Jane around the school.",
                "Rest for a little while."
            ],
            "content":"<div class=\"\"><div> <span>You gasped. As soon as you pushed your door open, you <a class=\"duLink\" rel=\"nofollow\" href=\"http://www.esacademic.com/pictures/eswiki/68/Denise_Milani.jpg\">mother</a>  <a title=\"New Window\" href=\"http://www.esacademic.com/pictures/eswiki/68/Denise_Milani.jpg\" rel=\"nofollow\" target=\"_blank\"><img style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a> appeared, about to leave the room.<br>\r\n<br>\r\n\"M-mom?\"<br>\r\n<br>\r\nJane gave a happy gasp as she smiled. \"Oh, sweetie! I didn't expect you to get to your dorm room so quickly! Don't worry, I got everything ready for you.\"<br>\r\n<br>\r\nYou took a moment to readjust yourself. It felt odd to be standing half-naked in front of your mother, but she didn't appear to even flinch on the sight. Of course, she was a teacher here, so she was used to it. Speaking of which, it appeared she was off-duty as she was wearing some rather casual clothes.<br>\r\n<br>\r\nTaking your eyes off your mother and peaking into your dorm room, you saw a simple room with a few drawers, two desks, and a...queen sized bed? You knew that a female student would be living with you, but to be up close in the same bed was...<br>\r\n<br>\r\n\"U-uhm...w-who is going to be my roommate?\" you asked, afraid of the answer.<br>\r\n<br>\r\nJane blinked and the chuckled. \"Sweetie, I'll be living with you from now on!\"<br>\r\n<br>\r\nYou almost chocked, leaning forward and almost tripping. You caught yourself by holding onto the sides of the door entrance.<br>\r\n<br>\r\n\"W-what?!\"<br>\r\n<br>\r\nJane was understandably confused at your disbelief. Furrowing her eyebrows, she frowned at you.<br>\r\n<br>\r\n\"What's the problem? Would you rather have a stranger that wasn't close to you?\"<br>\r\n<br>\r\nYou shook your head, stammering a bit as you tried to accumulate your thoughts. \"N-no, I just...I mean, I thought this was a dorm for students?\"<br>\r\n<br>\r\nJane could understand your confusion now and she gently squeezed your arm in comfort. \"Normally, yes...but since you are my son, the principal made special exemption. Honestly, I can't bare the thought of having my son being held by another girl.\"<br>\r\n<br>\r\nAh...so that was it. Of course, your mother was a bit over-protective of you. It was a bit too much for you and...honestly, as much as you felt bad for admitting it, your mother was a MILF. You were able to hold off any weird feelings as you grew older, but you were all too much aware how pretty and...endowed your mother was compared to most girls.<br>\r\n<br>\r\nNo...this was bad. Did this mean you were going to spend your next four years alongside your mother?!<br>\r\n<br>\r\nTaking a deep breath, you straightened yourself out. \"I...uhm...I just wish I knew about this. God, this is all so messed up...\"<br>\r\n<br>\r\nJane frowned and put her hands on her hips. \"Sweetie, we already talked about this. We felt this is the best for you...\"<br>\r\n<br>\r\nYou felt yourself tightened. Growling, you were unable to help but snap back. \"...and how is this a good thing? I feel like a fucking baby, surrounded by more babies! Now, I'm apparently going to sleep with my own mother without any privacy!\"<br>\r\n<br>\r\nJane wasn't pleased with my language, but she maintained her comforting voice. \"Sweetie, listen to me. I know this all seems strange, but teaching here, I found there is so much...love and comfort emanating through the students and teachers than any other school. This place is one of the top schools in the country for a reason!\"<br>\r\n<br>\r\nJane paused, her eyes softening and she gazed at me. \"...and plus, I've been really thinking about our relationship and how far apart we were. It opened my eyes how we're closer to stranger than actual family.\"<br>\r\n<br>\r\nYou couldn't help but groan and put a hand to your face. \"Mom, you're being overly-conscious. You were fine and I'm grateful to you and dad for raising me. You really...didn't have to make me go through with all of this crap.\"<br>\r\n<br>\r\nJane thought otherwise. Still frowning, she gripped your arm tighter.<br>\r\n<br>\r\n\"Are you sure? Tell me, when was the last time we hugged each other?\" she asked.<br>\r\n<br>\r\n\"Oh my god, you are not serious.\"<br>\r\n<br>\r\nJane bit her lip, saddened how dismissive you were. \"I'm serious, baby...\"'<br>\r\n<br>\r\nYou sighed and thought. It really had been a long time. You couldn't even remember when the last time you hugged her. Staring at her a little, your gaze lowered to her large breasts that stuck out. Then, you remembered why you stopped.<br>\r\n<br>\r\nQuickly focusing your gaze to your mother's eyes while blushing a little, you sighed. \"I can't even remember...\"<br>\r\n<br>\r\nJane was glad that you at least admitted to the problem, even if it was part of it. \"See? When I'm home on break, I...I almost never see you. You would always be around your friends and when I ask you if want to tag along with me, you always refuse.\"<br>\r\n<br>\r\nBy now, Jane was crying a little and other males in diapers couldn't help but pass by, a little concerned. A lot of them knew your mother and some of them stared at you angrily. It was a little surprising to be honest...was your mother a popular teacher? You could imagine why.<br>\r\n<br>\r\nSighing, there was only one thing to do and you suck up and wrapped your arms around her. You could feel her large breasts squishing against your chest and jiggling in place as she breathed. You shifted your legs uncomfortably and tried to focus on other things. Jane sniffled and wrapped her arms around your back, pulling you tightly in.<br>\r\n<br>\r\nShe breathed into your naked chest and you shivered, receiving goosebumps as a result. You cursed as you felt yourself grow a little stiff. This was not how a son should react to their mother, but you were naked and she had a body that you could only fantasize about. It was not easy growing up through puberty around her, but it seems your unintentional cold-shoulder was responsible for the position you were in.<br>\r\n<br>\r\nAfter a minute, Jane pulled back, smiling as she cleared the tears away from her eyes. \"Thank you baby. I...I shouldn't have gotten so emotional.\"<br>\r\n<br>\r\nYou glanced away, curling your lips. \"No, I'm sorry...I was being an asshole. Still, I'm...not liking any of this at all.\"<br>\r\n<br>\r\nJane smiled and nodded. \"I know baby, most first-years have the same feeling, but I'm hoping that...we can mend our relationship. Can you at least commit to that and this school?\"<br>\r\n<br>\r\nYou really didn't have a choice and plus, your mother was guilting you.<br>\r\n<br>\r\nSighing, you nodded and Jane was happy with the response.<br>\r\n<br>\r\n\"Now then, I have to talk with some teachers. Since tomorrow is the first day, a lot of planning and logistics are happening. I know! Why don't you come with me and I can show you around...or would you rather stay here and rest? I know that you might be tired,\" she asked.</span></div></div>",
            "created":1437282000,
            "id":2010052,
            "title":"It was your mother!"
        },
        "133111112":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Go to bed and try to sleep, hoping the diapered tent will deflate.",
                "Relieve yourself in the bathroom before falling asleep."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to rest, if you don't mind,\" you answer.<br>\r\n<br>\r\nJane hums and leans forward to peck you on the cheek. Once more, jealous students who know Mrs. Jane and pass by, glare at you, wishing that they had someone as sweet as Jane to live with them. Honestly, the attention isn't something you wanted, but you couldn't put a wall between you and your mother.<br>\r\n<br>\r\n\"Alright then, sweetie. I'll be back later. Go get some rest, okay?\"<br>\r\n<br>\r\nShe left and you feel yourself sighing deeply. Entering your room, you hear something quite shocking in the room next to you.<br>\r\n<br>\r\n\"Ah ah! Yes, that's it baby! Cum for mommy!\"<br>\r\n<br>\r\nYou slowly widen your eyes and clasp your hand over your mouth as you hear bed creaking noises and grunts from between a male and female student in the room over. Of course, this is bound to happen when you mix boys and girls together, but what's more shocking is that there this had to be going on for a while and surely other students could hear the noises that are being made as well. Isn't there a rule that forbids this kind of sexual relationship?<br>\r\n<br>\r\n\"Ah!\"<br>\r\n<br>\r\nYou hear the caretaker orgasm and the creaking slowly die down. All you hear both of them panting and then smaller moans. They seem to be completely into their role as caretaker and baby, even if it's completely unnecessary. You won't deny it's hot, but since you are going to be living with your REAL mother, it makes you feel uneasy. Of course, there is no way that's going to happen as it would be wrong, but hearing noises around you is going to be a real pain in the butt.<br>\r\n<br>\r\nLooking down, you see that you got a hard-on from listening. You curse yourself and wondered what you should do.</span></div></div>",
            "created":1465275600,
            "id":2160374,
            "title":"State between the girls and boys."
        },
        "1331112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Jackets and long pants for boys; blouses and short skirts for girls",
                "The students wear nothing at ALL but diapers"
            ],
            "content":"<div class=\"\"><div> <span>You take comfort in the fact that you are not the only one who will be thickly padded. All the students of the school are required to wear diapers when on campus grounds. That includes girls as well as boys. There is plenty of embarrassment and discomfort to go around.<br>\r\n<br>\r\nAll the same, you cannot help but feel anxious. Wearing diapers almost every day for four years... it makes you queasy. Aside from that, you'll be facing all the same issues a freshman from a normal high school faces: leaving a good first impression, handling the transition from middle school, making new friends, and - most notably - dealing with your growing hormones.<br>\r\n<br>\r\nOh, well; you will deal with those things as they come along. You take in a deep breath and open the main entrance of the school. In the front area, there are dozens of other students. You notice their apparel straightaway; everyone is following the dress code.</span></div></div>",
            "created":1414818000,
            "id":1880338,
            "title":"...everyone had to wear diapers...aside from fa..."
        },
        "13311122":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "You head to your dorm",
                "You head to the registration office"
            ],
            "content":"<div class=\"\"><div> <span>All the students are clad in nothing but thick white disposable diapers. You had known about this bizarre dress code in advance, and you tried your hardest to get used to the concept of this. Still, nothing could have prepared you for the sight of scores of teenagers walking around with just their backpacks and diapers.<br>\r\n<br>\r\nAs you make your way through the quad, you observe the surrounding activities. The freshmen girls seem very self-conscious about being topless in public. Completely understandable, as they are at the age where women's breasts develop. However, the sophomore, junior, and senior girls seem indifferent to having their cleavage exposed. If anything, they seem relaxed and content. They must be used to this kind of exposure.<br>\r\n<br>\r\nThe freshmen boys seem somewhat tense as well. For them, it is more a matter of hurt pride and humiliation. But like their female classmates, the male sophomore, junior, and senior students have no problem being diapered and naked in public. They actually appear to be taking advantage of this to show off in front of their female counterparts.<br>\r\n<br>\r\nYou lightly sigh, grip your backpack over your shoulder, and proceed through the front courtyard.<br>\r\n<br>\r\nAs you advance further into the campus grounds, you wonder how this school came to exist in the first place. Who could have come up with the idea of having over a thousand teenagers parading around inside and outside together in the very first garments they wore after birth? Even more bizarre was that diapers were all they were allowed to wear.<br>\r\n<br>\r\nThere were a couple exceptions to this. In the winter months, you would be permitted to wear clothes, and whenever you left the campus grounds to visit the town, you were allowed to wear clothes over your diapers. However, as long as you attended the school, you were required to wear diapers everywhere you went, and they had to be completely visible when the weather was warm.<br>\r\n<br>\r\nDespite the seemingly perverted dress code, this school had a better standing than most of the other high schools in the country. The dropout rate was surprisingly low, and the graduation rate was astoundingly high. There had never been a scandal, or an instance of rape or sexual harassment in the Academy's history. Only students, teachers, and relatives of either were allowed entrance. The perimeter was guarded night and day by reliable police officers who were employed exclusively by the school. They never let in anyone who seemed up to no good.<br>\r\n<br>\r\nYou do take some comfort in this knowledge. As you walk, you shrug and mutter under your breath \"Maybe this won't be so bad after all.\"</span></div></div>",
            "created":1414818000,
            "id":1880349,
            "title":"The students wear nothing at ALL but diapers"
        },
        "133111221":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "The room is empty",
                "There is a cute diapered freshman girl unpacking"
            ],
            "content":"<div class=\"\"><div> <span>Seeing as how your parents already handled the paperwork for your admission to the school, you figure you can wait until the assembly to check in. Plus, you'd like to take a look at your dorm before orientation. And, of course, you'd like to get inside and to someplace private as soon as humanly possible. Regardless of whether or not your schoolmates are dressed the same way, you feel as though all eyes are on you.<br>\r\n<br>\r\nYou walk towards the dormitories. To be precise, you waddle there, given the thickness of your diapers. The bulky material does limit your speed, but it does not impede your range of movement too much.<br>\r\n<br>\r\nAs you head towards the dormitories, you recall what you read about the campus living arrangements. Every student who attended the university was assigned a single roommate. You are alright with sharing a room with another individual, but you are a little perplexed by the unusual rule. This particular rule is that there are no same-sex roommates. That's right; every student has to room with a member of the opposite sex.<br>\r\n<br>\r\nThis would be strange enough in an ordinary high school. But at an Academy with such an abnormal dress code... you are nothing short of stunned by this prospect. You read that the faculty upheld this policy as a measure to help the student body grow accustomed to wearing diapers in public. While this did make sense, it still did not do much to alleviate the extreme feeling of awkwardness of being almost totally naked in a private place in front of a member of the opposite sex.<br>\r\n<br>\r\nYou quickly remind yourself that the upperclassmen seemed comfortable with their attire. If that was the case, they must be alright with the living arrangements. You figure that if they could deal with it, you could do.<br>\r\n<br>\r\nOn your way to the dorms, you wonder what your partner will be like. You just hope she won't be mistrustful or wary of guys. Otherwise, this will be a long year.<br>\r\n<br>\r\nYou soon arrive at the dormitories and sign in at the front desk. The clerk gives you your key and room number, and welcomes you to the university village. You thank her appreciatively. As you walk past her desk, she sneaks a few pats at your diapered bottom. This causes you to blush deep red, and her to giggle in amusement.<br>\r\n<br>\r\nYou take the elevator to the fourth floor where your room is. You make your way down the hall until you arrive at your assigned room number. Then you unlock the door and step inside. Right away, you notice</span></div></div>",
            "created":1414818000,
            "id":1880363,
            "title":"You head to your dorm"
        },
        "1332":{
            "author_id":"kullul",
            "author_name":"Lullu",
            "choices":[
                "Only the girls would wear nothing but diapers, the boys got off scott free.",
                "The boys get off scott free, and also control the girls.",
                "The boys are clothed, in control, and middle school and grades school girls join"
            ],
            "content":"<div class=\"\"><div> <span>\" One Zuri Shamnti, African American. 14 year old female. Ward of the state. A short girl with long hair, and dark skin, wearing nothing by a plain white diaper, and nothing else.This girl had been forced to be part of this school, by her foster care after being kicked out of four middle schools due to bad behavior. It was this or military school, and Zuri wanted no part of that. Her books and equipment had been paid for, however she had found out from before hand that she would be stuck inside the school for four years. However things for Zuri would get worse for her since she saw that.</span></div></div>",
            "created":1414990800,
            "id":1881085,
            "title":"The government forced you."
        },
        "1333":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "compensated dating center",
                "diaper testing facility ",
                "regression daycare"
            ],
            "content":"<div class=\"\"><div> <span>Truth be told, though the school you were enrolled in is indeed a high school, that's only half the story.<br>\r\n<br>\r\nFact is, your parents sent you here because it granted them some substantial personal benefits... at your expense. What does that mean? Well, first off, it means that you're forced to be diapered the entire time you attend this 'school.' Additionally, it means that while this is a school by day, by night, it's a.....</span></div></div>",
            "created":1416200400,
            "id":1888190,
            "title":"...benefits."
        },
        "13331":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "boy",
                "girl"
            ],
            "content":"<div class=\"\"><div> <span>I know what you're thinking; \"What do you mean by \"compensated dating?\" <br>\r\n<br>\r\nBasically, you're placed under the care of a paying client, and you have to give them companionship and if you're unlucky (or lucky?), sexual favors. In exchange, your family is paid quite handsomely. <br>\r\n<br>\r\nAnd you have to be diapered the whole time. Good luck, bud!<br>\r\n<br>\r\nSo then, are you a boy? Or a girl?</span></div></div>",
            "created":1416200400,
            "id":1888192,
            "title":"compensated dating center"
        },
        "13332":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "boy",
                "girl"
            ],
            "content":"<div class=\"\"><div> <span>After school hours, your duty, from 6pm to 1am, is to serve as a test subject for the Infantitan diaper company and the diapers they produce.<br>\r\n<br>\r\nAnd these are no ordinary diapers, either! Not only are they fitted for an older teen such as yourself, but several of them have some odd functions you wouldn't imagine on typical baby garments (one has to wonder if they're even being made for babies...).<br>\r\n<br>\r\nYou're in for one strange and wild night every night from now on! <br>\r\n<br>\r\nBut one question: Are you a boy? or a girl?</span></div></div>",
            "created":1416200400,
            "id":1888197,
            "title":"diaper testing facility "
        },
        "13333":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "guy",
                "girl"
            ],
            "content":"<div class=\"\"><div> <span>At this school, you're a young adult by day, but a young child by night!<br>\r\n<br>\r\nDon't ask how, but whoever runs this school has the uncanny technology to regress the human body into the picture of one's youth! Though, this technology is imperfect; your bladder control is regressed too, even further than the rest of your body, and the first few regressions, your muscular system is weakened as well in your regressed form.<br>\r\n<br>\r\nThat's not all though (what, you didn't think you were being regressed for nothing, did you?). You're also going to be thrown in daycare, and left in the hands of loving women... be they loving, lustful, or sadistic.<br>\r\n<br>\r\nWhatever the case, are you a guy or girl?</span></div></div>",
            "created":1416200400,
            "id":1888199,
            "title":"regression daycare"
        },
        "15":{
            "author_id":"garlock",
            "author_name":"starlock",
            "choices":[
                "All girls school",
                "All boys school",
                "Co-ed School",
                "Other school somehow not mentioned?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's try this again; what diaper academy do you currently attend?</span></div></span></div>",
            "created":1347339600,
            "id":1425525,
            "title":"To add some extra story value"
        },
        "152":{
            "choices":[
                "Elementary School Books",
                "Middle School Books",
                "High School Books"
            ],
            "content":"<div class=\"\"><div> <span>Glancing around your dorm room, you pull on your trouser's over top of your diaper, and look in your backpack. It's your first day of schooling, and at the moment you even have your two-person dorm room all to yourself, but you were excited to get a roommate in the next few days. <br>\r\n<br>\r\nNow you just needed to make sure you had everything you needed for your classes!</span></div></div>",
            "created":1388725200,
            "id":1721067,
            "title":"Dorm Room Grade"
        },
        "1521":{
            "choices":[
                "The door suddenly swings open, another 8yo charging in!",
                "Open the door and head to home room.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Smiling brightly Kevin zips up his multi-colored backpack, the eight-year-old eager to start his first class in the special Elementary Grades of the Diaper Academy. Tugging his bright blue shirt down slightly the young boy glanced down at his trouser's, blushing slightly at the noticeable diaper bulge that no one could possibly miss. <br>\r\n<br>\r\nHe wasn't embarrassed for wearing the diaper, in fact he loved the feeling of the warm snug padding wrapped tight around him. It was why he'd begged his Mommy and Daddy to send him to the Academy, because he loved diapers so much, and here students were required to wear them everyday at all times, twenty-four seven. There was even a live-in dorm, and though older students changed themselves, younger students were allowed to ask older students or teachers to change them...and it made Kevin smile.<br>\r\n<br>\r\n\"I better get to class,\" he said with a bright smile, heading over to the dorm-room door.</span></div></div>",
            "created":1388725200,
            "id":1721070,
            "title":"First Day Excitment"
        }
    },
    "info":{
        "author_id":"garlock",
        "author_name":"starlock",
        "brief_description":"For whatever reason, you've been enrolled in a school where everyone is to be padded.",
        "created":1347412680,
        "description":"<td align=\"left\" class=\"norm\">Whether it's an elementary, middle, high school, or college, you've been enrolled in Diaper Academy; a school where all students are required to be diapered at all times while on campus. <br>\r\n<br>\r\nImportant Guidelines:<br>\r\n<br>\r\n1) No blood, gore, death, or excessive violence.<br>\r\n2) Nudity and sexuality is not required, but welcomed.<br>\r\n3) This school is NOT meant to be a punishment, unless directly stated that said character is here as a form of punishment. <br>\r\n4) All student characters MUST be diapered. (Duh)<br>\r\n5) No full-time babying, if it can be helped. (Babying entails treating one as an infant, making them play in a playpen/with baby toys, etc, making character wear baby clothes; onesies, pacifiers, bibs, etc, feeding baby food, forcing character to crawl, use and be spoken to in babytalk) <br>\r\n6) No furry.<br>\r\n7) Please try to use proper grammar, spelling, and punctuation. Also, please try to write at least two lines per chapter, unless a choice chapter was intended.<br>\r\n8) Just have fun.<br>\r\n<br>\r\n<br>\r\n100 additions as of 11/3/14! Here's to 100 more! :)</td>",
        "id":1890958,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1561106820,
        "modified":1561106820,
        "pretty_title":"Diaper Academy"
    }
}