{
    "chapters":{
        "1":{
            "author_id":"amramir1014",
            "author_name":"Little a",
            "choices":[
                "Your wife laughs at you, then gets mad",
                "Your wife cuddles, you and reveals her secret"
            ],
            "content":"<div class=\"\"><div> <span>It is your wedding night. Your anxious new wife is laying there on the bed.  She is nervous because she has not been fully open with you about her feelings.  But you have your secret too.  You slowly undress in the bathroom to present your body to your new wife expecting the worst.  You wonder why you did not tell her before now.  How will she react?  When you see yourself in the mirror you are reminded of your secret as you have been every morning for 25 years.  Your micro penis is hidden in the folds of your balls.  Even as you walk out into the bedroom and see your naked wife, your little penis barely pokes out his head.  You get in the bed quickly, and cover up.  But it is too late, your wife has seen it!</span></div></div>",
            "created":1588965180,
            "id":2832340,
            "title":"The Truth is Revealed"
        },
        "11":{
            "author_id":"amramir1014",
            "author_name":"Little a",
            "choices":[
                "Your new wife keeps HER secret safe",
                "Your new wife REVEALS her secret"
            ],
            "content":"<div class=\"\"><div> <span>Your worse fears are realized when your wife eyes your little manhood and almost laughs out loud!  Initially she gets mad, thinking of how limited your sex life will be, and how you probably will not be able to give her children.  Children?  Then she remembers HER secret, and her attitude changes.</span></div></div>",
            "created":1588965600,
            "id":2832341,
            "title":"Your wife laughs at you, then gets mad"
        },
        "111":{
            "author_id":"amramir1014",
            "author_name":"Little a",
            "choices":[
                "Months pass and your wife is happy",
                "Your new life starts the next morning"
            ],
            "content":"<div class=\"\"><div> <span>Your wife is relieved that your little manhood has allowed her to keep her secret.  In just seconds she ponders what she will do - she will not tell you that she is a very dominant woman, nor that she is happiest humiliating the men in her life. She will not reveal that she was attracted to you because of your boyish looks and childlike demeanor.  She will not tell you that her greatest fantasy is to have a husband who is dependent on her in every way.  If she could have her way she would keep you all to herself as a little CHILD.  You, on the other hand, are struggling to bring out your manhood - you want to dominate the relationship as the man should. So it is both relieving and frightening that your new wife reaches for you and pulls your head to her breast.  Without a word, she comforts you, all the while her mind is racing.  How could she have been so lucky to have gotten a husband like you!  You don’t know it now, but your life is about to change. </span></div></div>",
            "created":1588966800,
            "id":2832353,
            "title":"Your new wife keeps HER secret safe"
        },
        "1111":{
            "author_id":"amramir1014",
            "author_name":"Little a",
            "choices":[
                "One night she runs you a bath instead of your usual shower",
                "One day important mail arrives"
            ],
            "content":"<div class=\"\"><div> <span>Time passes,  Your marriage is good,  Your wonderful wife makes you these great smoothies at night and even puts great music on every night for you to listen to.  Nothing is ever said about your little penis,  You try sex but your manhood is never enough,  You can only make her orgasm with her “special toys”,  You are just happy that she seems to love you anyway,  Little do you know that your life is about to change forever!</span></div></div>",
            "created":1589086860,
            "id":2833326,
            "title":"Months pass and your wife is happy"
        }
    },
    "info":{
        "author_id":"amramir1014",
        "author_name":"Little a",
        "brief_description":"A man is Humiliated as he is regressed in to a little boy by his new wife.",
        "created":1588964340,
        "description":"<td align=\"left\" class=\"norm\">The wedding is over, and you made it through it but the truth has yet to be revealed.  Your new wife does not know the secret you have been carrying around with you for 25 years.  It is your wedding night, you can’t hide it anymore.</td>",
        "id":2221443,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589086860,
        "modified":1589086860,
        "pretty_title":"Becoming a Little Boy is Humiliating"
    }
}