{
    "chapters":{
        "1":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "A student here",
                "a lunchlady",
                "The headmaster with the receptionist",
                "A couple of prefects with the school guards.",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Matt had just started school at Fat School for Boys. It was an all boy’s school for weight loss. At least that’s what he thinks its for. He knows it’ll basically be like a fat camp, except for school.<br>\r\n<br>\r\nThen he starts walking down the halls. He sees a lot of pictures of famous morbidly obese people in history, even those who are immobile by fat. He then sees a lot of lunch ladies who are severely overweight carrying huge dinners that could feed a whole fat camp, twice, with leftovers.<br>\r\n<br>\r\nThen he heard someone speaking behind him. Who was it???</span></div></div>",
            "created":1257915600,
            "id":790604,
            "title":"Welcome to the School of Fat"
        },
        "11":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "A chubby boy",
                "An overweight boy",
                "An obese boy",
                "A morbidly obese boy",
                "A bedridden, immobile boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel both excited &amp; nervous as you hear two boys talking. You move up closer to hear what they’re saying. Then you decide to eavesdrop on them. But what do they look like?</span></div></span></div>",
            "created":1258088400,
            "id":791088,
            "title":"Meeting Your First Friend, Or First Foe"
        },
        "113":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...for a lunch?\"",
                "...to my secret room?\"",
                "...to the school gym?\""
            ],
            "content":"<div class=\"\"><div> <span>What you can see is they look obese and you cannot believe they’re so young in their fat form which you ask yourself how did they manage to get so fat up to about between 350  and 400 pounds.  But you couldn’t help but look at them and a boy standing close to where you were has a most attractive and bigger weight then another boy is.  He wears a very tight white s-shirt, navy sweatpants and white sneakers but whatever he wears it on, makes a good attractive look of the boy’s size and you can maybe try and talk to him.  Again you were half excited and half nervous because you’re only new to school and nobody you known from your old school came along with you so it is the first of many for you so maybe try and get along to this place very well until you get to known them all soon.<br>\r\n<br>\r\nSo you try to compose yourself from nerves when someone came to you from behind and asks you.  “Hey, you’re new to this place aren’t you?”<br>\r\n<br>\r\nThat made you jumped and when you turned around to see who this person was, it was a boy you got your eye on him and he gave you a smile so he tries to make you feel welcome to this place.  You couldn’t but looking at the size of this lad.  He looked like the same age as you but maybe younger, already his neck sank in with triple chins; his belly is so big that his t-shirt couldn’t cover it in and is exposed right in front of you with his belly hung over his sweatpants.  His hips were so wide if you can put two skinny people together, even his thighs and his butt made it look big that can clash together and jiggly every step he takes, despite being slow but still mobile at least.  <br>\r\n<br>\r\nA boy giggled and asks him by placing his right hand of your shoulder.  “Are you alright?”<br>\r\n<br>\r\n“Oh, sorry..I..err…”  You couldn’t think what you can say next but a boy understands and says.  “Don’t worry; every new boy knows it’s a nervy place to meet when it’s their first day like you.”<br>\r\n<br>\r\n“Yeah it sure does.”  You replied<br>\r\n<br>\r\n“So let me introduce to myself.  My name's Cameron McGowan, but you call me Camie as it is my nickname and you are?”  Camie asked for your name.<br>\r\n<br>\r\n“My name's Matt Walker and it’s a pleasure to meet you Camie.”  You said in your introduction to your new friend.”<br>\r\n<br>\r\n“And it’s a pleasure to meet you too and I hope you’re enjoy the school where there’s nothing more than getting ourselves fatter.”  Said Camie as he shakes your hand like he’s giving you welcome to this place before he asks.  “Say, why don’t you come along with me...</span></div></div>",
            "created":1375160400,
            "id":1637121,
            "title":"Meet an Obese Friend"
        },
        "1131":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "big, big doors, which opened automatically as they approached.",
                "and inside were lots of fat guys chowing down!"
            ],
            "content":"<div class=\"\"><div> <span>“And it’s a pleasure to meet you too, and I hope you enjoy our school, where there’s nothing more important than getting fatter,” said Camie.  He shakes your hand like he’s welcoming to this place, then he asks, “Say, why don’t you come along with me for lunch?\"<br>\r\n<br>\r\n\"Sure,\" you reply.  \"I'm Mike, I'm new, I'm in grade 7.  Look, can I ask, I though this school would be like the fat camp my folks sent me to last summer, but you and everybody else are fat!  And there's posters of fat guys and junk. Isn't this a fat loss school?\"<br>\r\n<br>\r\n\"Oh no,\" replied Camie, \"every boy here is trying to gain weight.  Fat is good, fat is phat, dontcha know?\" he added in a funny accent.<br>\r\n<br>\r\nShortly, they were at the doors of the cafeteria...</span></div></div>",
            "created":1535489100,
            "id":2540099,
            "title":"...for a lunch?\""
        },
        "11311":{
            "author_id":"fat_hiker",
            "author_name":"fat_hiker",
            "choices":[
                "50 pounds",
                "85 pounds!"
            ],
            "content":"<div class=\"\"><div> <span>Shortly, Camie and Mike were at the doors of the cafeteria... big, big doors, which opened automatically as they approached.<br>\r\n<br>\r\n\"Cool, automatic doors!\" Mike remarked, as Camie led him through. <br>\r\n<br>\r\nInside the cafeteria, Mike sees a serving window, but also steam tables and other food stations.<br>\r\n<br>\r\n\"I'm going to like this place!\" Mike says happily.  \"So much food!\"<br>\r\n<br>\r\n\"Yeah, the food is great here,\" replies Camie, \"and everybody gains. Last year, I put on...</span></div></div>",
            "created":1577130420,
            "id":2763662,
            "title":"Everything to aid the gain"
        },
        "1132":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...I would sit on your face?\"",
                "...you can feed me?\"",
                "...we can play video games for a while?\""
            ],
            "content":"<div class=\"\"><div> <span>You went confused when your new friend asks him to come along to his secret place and it is strange that anyone in school had a room on its own. But since he asks you to go there, you decided to go along and see what’s this secret looks like.<br>\r\n<br>\r\n“Sure, I’ll go with you.”  You replied with a nod on your chubby head.<br>\r\n<br>\r\n“Great, now you just follow me and I’ll show you where my place is.”  Camie told him and he waddled off to lead the way so you followed him to where he’s going to.<br>\r\n<br>\r\nThe weird thing around here is in face many people including boys, yourself and many teachers you see them past are all fat and you feel like you’re one of them when you could get to Camie’s weight sometime soon.  When you walked behind him since you get to know the place well, he couldn’t help but stare at the size of his gigantic butt that it look like two watermelons clashing together and it jiggled every step by step as he takes and you takes your eyes of it.<br>\r\n<br>\r\n“Well, here we are!”  Said Camie as the two of you made it to the secret place, but you looked around and there were nothing more than a bunch of lockers in a corridor.<br>\r\n<br>\r\n“Oh, I almost forgot, as you can see you think it’s just those lockers we get to put our stuff in.  But I’m telling ya, it’s not.  Watch this!”<br>\r\n<br>\r\nCamie then twisting a code lock in his own locker and in a few seconds, he opened it which as you can see there are three lockers fitted into a door and he let you in first before him entered the place so that he can lock the door safe without anyone interfering.  Your first impression was only one you can say and that was “wow”.  You couldn’t believe what you’re seeing.  A room full of food counters, pool tables, video game and even his bed he’s gotten and you think how lucky did he get those stuff and how did he get a secret room than anyone else.  You even looked at Camie when you sat down on the floor and stare at his big rear, he takes off his sweatpants which he unveiled his big white briefs and you couldn’t think but wow, how big his butt is and you kept staring it until he turned around waddling towards you and stood there in front of you with a smile.<br>\r\n<br>\r\n“So, what do you think of my place then?”  Camie asked.<br>\r\n<br>\r\n“Yeah, it’s great and..yo..you’re wearing briefs.”  You said as you wouldn’t help but admitting anything you saw.”<br>\r\n<br>\r\n“Oh, sorry about that; I normally take my sweatpants off when I’m here so yeah.  But I have to tell that you don’t tell anyone about this place.”  Camie warns you but you asked why before he explains.<br>\r\n<br>\r\n“Because the school principal giving me this room since I am a most valuable student around this place and if I did told them about this, they’re moan about it and pleading to get their own secret room.  You’re the only one I know you can trust me on this and even more, you can even stay with me at night times.<br>\r\n<br>\r\n“Are you sure about this Camie?”  You asked.<br>\r\n<br>\r\n“Sure, I’m trying to give you a warm welcome and I can help making you fatter just like me.”  Camie says as a promise he will do anything for you to get more beef on your body.<br>\r\n<br>\r\n“Uh, yeah okay, I promise I won’t tell anyone about this place.”  You promised in your words.<br>\r\n<br>\r\n“Great!”  Camie in his delightful word and then he asks him.  Now you’re new here and you sit on the floor against the wall, would you mind if...</span></div></div>",
            "created":1375160400,
            "id":1637124,
            "title":"To The Secret Room!"
        },
        "11322":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "huge portions of french fries",
                "Loads of hotdogs"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright then!\"  You accepted Camie's favour before you asks him again.  \"So where would I get the food from Camie?\"<br>\r\n<br>\r\n\"It goes through the vents and you can actually get them anytime whatever you want to eat and boy am I starving.\"  Camie says as he places his hands on his plump belly and gives it a jiggle that made you distracted, but you were later shake it off and delivers the food to Camie before he sits on the floor with him.<br>\r\n<br>\r\n\"Here you go Camie, would you like me to feed you through your mouth?\"  You asked.<br>\r\n<br>\r\n\"Sure, why not?  I'm always get someone to feed me with my hands full.\"  Camie replied with a smile before his stomach starts rumbling again and it was time to eat.<br>\r\n<br>\r\nYou begin to rub Camie's belly to calm it down or otherwise let him go hunger again as he starts off with a simple snack he likes before moving to his main course and that was his chocolate bars which he placed them for his collection and then feeds it when he wanted to.  Of course there were no food restrictions since this is the Fat School for Boys and you understand that you could be one of them and there was no denial in any case whatsoever.  But this  is all about what it feels like and it's as he thought of known that Camie was here to help gaining you weight but he wanted to give this example how much you do like the fatness and what you will become in the near future and it starts here.<br>\r\n<br>\r\nSo for a benefit of a hungry fat 12 year old kid, you ripped out the warp of the first chocolate bar before he sends it Camie's mouth already opened for him to bite it off and he did just that.  Finished the first one and continued the second one and another until you feed him up to 25 bars before you began to rub his belly again to make him more hunger and for his next course.<br>\r\n<br>\r\n\"You feeling hungry again big boy eh?\"  You asked with a smirk towards Camie who was full but hungry still.<br>\r\n<br>\r\n\"Yeah, you bet!  Bring anything you see in there and feed me more.\"  Camie demanded and you did what he asked for when he see's _______ shooting out from the food vents.</span></div></div>",
            "created":1389243600,
            "id":1724480,
            "title":"...you can feed me?\""
        },
        "114":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Class",
                "Lunch",
                "Other Choices"
            ],
            "content":"<div class=\"\"><div> <span>It’s a morbidly obese boy who seems to be enjoying himself on a huge bag of potato chips. He sees you &amp; introduces himself, “Hey I’m Jake. Jake Olsen, though everybody here calls me Jake Junkfood.” You didn’t hear a single syllable of what he said, because you were so transfixed by his body, his huge potbelly, his thunder thighs, his big butt, his hugely chubby cheeks/chins with no neck, &amp; the coup de grace was his boy boobs that were the size of watermelons.<br>\r\n<br>\r\n“You wanna touch it. Okay.” Then he strangely hugs you &amp; you feel slightly crushed under his weight. The next thing you know you hear the bell. “Whoa I didn’t know it was that time already. Well I guess it’s time to get to…<br>\r\n</span></div></div>",
            "created":1258779600,
            "id":794675,
            "title":"Jake Junkfood"
        },
        "1141":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Cooking or HIstory",
                "Science or Math",
                "Other Choices Not Shown Here"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What class?</span></div></span></div>",
            "created":1433459460,
            "id":1987864,
            "title":"Class"
        },
        "1143":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "An Elevator in Plain Sight",
                "A Moving Floor Leading to an Escalator",
                "A Massive Warehouse-Sized Room With Strange Mountain Climbing Equipment "
            ],
            "content":"<div class=\"\"><div> <span>\"The Sexual Relief Club.\" the what?!?!? Sexual Relief Club, you make it sound like sex is something people are allowed to do here whenever they want.<br>\r\n<br>\r\n\"What kind of club is that???\" Mike asks with confusion.<br>\r\n<br>\r\n\"We get to be fed, fattened, &amp; in some cases we get to fuck our skinnier classmates as initiation rituals. Don't worry new kid you'll love it, by the way what's your name?<br>\r\n<br>\r\n\"Umm Mike, Mike Manson\" Then Jake takes Mike's hand in his humongous hams, I mean mitts, I mean hands &amp; leads him slowly &amp; ponderously down the hall to...</span></div></div>",
            "created":1407733200,
            "id":1840361,
            "title":"Sexual Relief Club"
        },
        "11433":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Yes (No Need For Forceful Persuasion=Aphrodisiacs+Smexy Time)",
                "No (Hypnosis, Bondage, & Rape comes next)"
            ],
            "content":"<div class=\"\"><div> <span>There in a massive warehouse-sized room was the strangest set of equipment like some twisted fun fat fucking gymnasium. In one corner there were were massive boys at least 1,000 lb.  being lifted carefully off the ground &amp; wedged into the wall again where a small child about my age was being fucked by the immobile yet moving fat boy. Behind him there were three teenagers trying to penetrate the big guy's ass fat &amp; humping his back fat, while above there was a tube going into the immobile fatty's mouth attached by mask to suckle or possibly be force-fed by. Similar situations were occurring with different sexual positions using chairs, couches, beds. straps &amp; tubes for every boy to eat from this massive fat of clear yet golden fluid like nectar &amp; ambrosia, or honey &amp; maple syrup mixed together leaking from tubes &amp; masks from the ceiling. It was freaky &amp; disturbing, but also strangely erotic &amp; enlightening. \"What is this place Jake???\" Mike asks in awe &amp; amazement.<br>\r\n<br>\r\n\"This is our fat feeding &amp; fat fucking playground. We can have sexual relief &amp; be stuffed in a variety of ways &amp; be fed by our fellow club members. It's awesome. This is how we live &amp; you'l get to start off here as well. Hey Andre, Calan, Mack, lets 'initiate our new friend here. You ready to be initiated. You'll be the bottom for all of us as you get fucked in all orifices; from that tiny, shapeless ass; to that puny pudgy belly &amp; of course you'll blowjob us. So are you ready to be iniitated &amp; be a part of the Sexual Relief Club!!!” Jake shouts in a deep baritone…<br>\r\n<br>\r\nWhat is Mike’s answer???</span></div></div>",
            "created":1407733200,
            "id":1840385,
            "title":"A Massive Warehouse-Sized Room With Strange Mou..."
        },
        "114331":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Instant Fat Gain+Shota Orgy Playground",
                "2 & ½ Weeks of Bloating+Ultra-Relaxation Therapy"
            ],
            "content":"<div class=\"\"><div> <span>“Yes. I want to be a part of the Sexual Relief Club!!!” Mike shouts.<br>\r\n<br>\r\n“Great. Now strip down completely, you won’t need your clothes anymore where you’re going.” Jake Junkfood ordered.<br>\r\n<br>\r\n“Okay” Mike stripped himself down to nothing.<br>\r\n<br>\r\n“Good. Now we have BIG ambitions for you Blubber Butt, &amp; we want to plow right through them. So before we begin, we need lay down some understanding here. One, you are going to start off as a bottom or omega in the hierarchy of obese orgies. Two, you’ll most likely never leave this school grounds ever again because the only equipment strong enough to move you and care for you is right here. Three, you’ll be fed almost 24/7, when you’re not being fucked through certain orifices. &amp; four, your feeding is going to be so accelerated, that you’ll need a whole new room underneath the campus grounds to fit you. Got it Mike.” Jake explained.<br>\r\n<br>\r\n“Got it, but how will I be fed to be so huge in such a short amount of time?” Mike asked.<br>\r\n<br>\r\n“That’s easy Mike. We’ll explain as we take you there” Jake led Mike through a long winding labyrinth of tunnels that would eventually come out to a massive cavern that looked like it could fit the entire Sexual Relief Club’s current-sized members 100x over, and still be comfortable with all the machinery operating inside of the parameters. In the center of the cavern was an artificial, medium-sized lake filled with some sort of thick, opaque, orange goo. The goo seemed to be vibrating “Okay Johnny, ready for the new recruit.”<br>\r\n<br>\r\n“Ready!!!” came a deep blaring voice over a P.A. system in the background. “In 5, 4, 3, 2, 1, Get Gaining.” Then with startling waddling speed, the immobile boys bungeed down from the ceiling, picked me up on the way down, then dunked me in the goo butt first. Then, a needle &amp; tubes combination went into my belly button. Attached to the needle &amp; tubes was a small, but oh so flexible but sticky vibrating mat which was placed around my navel &amp; underbelly.<br>\r\n<br>\r\nNext, powerful piston looking shaft which tapered to just barely fit in my tight &amp; tiny asshole was directed up until I felt it touch my urethra. Next, a long suction cup &amp; tube like devices were being attached to my penis, along with a thin clasp for my scrotum to keep me from cumming. After that, a stretchy looking mask was attached to my nose, ears, eyes, and mouth. The mask’s eyes were blocked out; protected my ears from hearing anything (while also keeping them dry); and it disconnected my nasal breathing from my oral breathing, as a funnel and tube was placed deep inside my esophagus. After that, a series of concave vibrating pads were attached to his nipples with tentacles that also had vibrating pads attached, extending across his torso. After which, a series of metallic orbs were rolled into my stomach. They aligned themselves like they were magnets once gently inside Mike’s stomach, &amp; release metal coils to make a ring<br>\r\n<br>\r\nNext, the masks showed me a livestream of the four immobile fat boys suspended from bungee cords from the ceiling. The boys were panting, hot, &amp; sweaty. An HUD at the corner of my mask’s screen showing their hunger levels, weight in pounds, &amp; fat to muscle ratio. They were almost completely starved by the 100% on the unger levels diagram meant anything. It showed that they were each at varying degrees of super immobility by fat, from 3700 lb, to 6400 lb. The ratios of Fat to Muscle was pretty low for all four them, it went (from fat percentage to muscle percentage) like 71% to 7%, or 87% to 9%.<br>\r\n<br>\r\nThe screen eventually split into two screens, from top-to-bottom. The bottom screen showed the boys being starve, while the top screen showed silos full of the foods they would be stuffed with. The food was cold milk (full fat of course), liquid chocolate syrup (containing assorted other melted chocolate products), caramel (with extra sugar &amp; lipids), &amp; concentrated honey (both natural &amp; artificial). Each silo were equal to their bodily volume in appearance but was perhaps much more condensed &amp; would sate them for a while.<br>\r\n<br>\r\nThat’s when Mike realized that the food wasn’t for them. IT was meant for him. He would gain what they would eat for a normal meal without chemical alterations. The question is, how would it go from their stomachs to his. That’s where the ring made from the four metal orbs came in, those rings were also inside of the immobile boys bellies and they would transfer the excess of what they ate into a portal to enter Mike’s empty stomach. Finally, the feeding began and as the hunger levels rapidly dropped to 0% on all of the immobile boys, Mike’ stomach rapidly inflated into a boulder like globe worthy of the Pillars of Gibraltar. As Mike was fed, he could feel his stomach stretch out to accommodate the food &amp; barely hold it in without exploding. The orange goo must have stretchy flesh-alleviating properties which spread outside-in. Or maybe the food becomes healthier for the body’s growth, but still fattening as it traverses through the dimension in-between to get to the other portal.<br>\r\n<br>\r\nOne thing is for certain, Mike is in heaven because at the same time as his feeding, the vibrating pads on his belly, boobs, &amp; FUPA start to vibrate &amp; rub his body down, caressing it with a gluttonous glory that speaks volumes of ecstasy &amp; euphoria. To top it off a healthy but aromatic aphrodisiac gas was pumped into his nose making every touch of machinery &amp; pound of fat gained like a sensual paradise. Mike’s headphones kept playing relaxing &amp; melodius music to go with the symphony of churns &amp; gurgles of his stomach. Finally, Mike was given a bird’s-eye-view of his gains from above the lake’ surface which was uploaded into his mask, just minutes after the super immobile boys started eating their hearts out, to keep things interesting. He could see himself now not just because of the goggles, but because the lake was becoming translucent enough to determine the shape &amp; texture of Mike’s body as it exploded outward in volume &amp; girth.<br>\r\n<br>\r\nBut what happens next… Does Mike stay bloated for a long time, say 2 ½ weeks due to his relatively small stomach to undo the bloating effect that could not be overwritten? Or does the fat pile on instantly &amp; immediately cake Mike’s form to begin filling out the private lake of orange goo? Your choice.<br>\r\n</span></div></div>",
            "created":1508474520,
            "id":2403771,
            "title":"Mike Says Yes=Aphrodisiacs Gains, Then Shota Sex"
        },
        "114332":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Clothes/Furniture",
                "Sex Toys/Feeding Fat Tanks"
            ],
            "content":"<div class=\"\"><div> <span>\"Nooo!!! I want to get fat, but not be someone's sex toy. I got to get out of here!!!\" Mike responds heading for the door when it's blocked by an obstruction, an obese obstruction that was dangling from the bungee chords up on the ceilng that lowered itself down like some suspended super-sized spider that was too heavy &amp; dense to move around &amp; it was the only entrance. Then the other boys, fat &amp; fit, mobile &amp; immobile, all lurched onward towards me in some sort of trance like some angry mob of rioters or a hungry pack of zombies. The smaller boys manhandled &amp; ripped my clothes off even my undies till I was bare &amp; blubbery with those thin but strong hands while I was straddled in the Vitruvian man position on my back with my the crown of my head facing the groin of the immobile obese boy obstructing the door. Then the fatter but still mobile teenage boys (around 200-400 lb.) were pinning down my arms &amp; legs with their bellies, butts, &amp; boobs without the bungees leaving my body to feel like I'm being crushed by soft, buttery, blubber bowling balls, no more like boulders.<br>\r\n<br>\r\nThen came Jake Junkfood &amp; the others who were still in a trance of sorts &amp; speaking monotonously. \"You should have accepted our deal to get fat &amp; immobile to have smexy time with us. Now you will decorate our Reject Halls as an immobilized but big &amp; durable_____. Now prepare to be petrified...</span></div></div>",
            "created":1407733200,
            "id":1840390,
            "title":"No-->Hypnosis, Bondage, & Rape Comes Next"
        },
        "1143321":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Clothes",
                "Furniture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So will Mike become immobile fat boy clothes for outside occasions??? Or will he become LA-Z Boy Immobile Fat Furniture for them to slay down &amp; sleep on? The choice is up to you...</span></div></span></div>",
            "created":1407991440,
            "id":1841179,
            "title":"Mike Becomes Immobile Fat-Boy Clothes/Furniture"
        },
        "11433212":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Love-Seat Couch: 1,200 ft wide, 1,000 ft. long, 8 ft. high",
                "Waterbed: 1,000 ft. wide, 800 ft. long, 10 ft. high."
            ],
            "content":"<div class=\"\"><div> <span>\"You're going to become our soft, squishy, living, but immobile fat boy furniture, FOREVER!!!!\" Jake rumbled.<br>\r\n<br>\r\n\"Nnnoooo!!!!!\" Mike screams.<br>\r\n<br>\r\n\"Time for the body control process. We have special powers we can use against you... For one as long as we make skin-to-skin contact we can force your body to do whatever we want to do within science's limits by releasing payloads of pheromones. &amp; since we're huge &amp; theres more of us on top of you, you'll get transformed pretty quickly.\" It was true, as Jake was speaking, Mike's body was already loosing its firmness &amp; strength without gaining weight or eating, but he was still conscious enough to perceive everything that is happening. After his body loosened into rubber-like material, the boys stretched him out to match 1/2 the length &amp; width of the Sexual Relief Club's warehouse stretched out into a long &amp; thin body carpet. \"All right now comes the fun part. We keep this special inflation fluid for this kind of occasion so we can inflate our enemies &amp; reject club members into massive bed form, but it can also be molded by our body control powers. The tubes will be filling you up from not one, not two, but all three major sexual orifices, the belly button, the butt, &amp; the mouth. You'll be given special medicine that'll keep you from cumming so long as you get injected with this stuff. So now, you'll only be allowed to cum once a month when the servant boys have to empty &amp; clean you out. &amp; each time you'll get bigger &amp; bigger for us to lay down &amp; fuck you with. So now prepare to be filled.<br>\r\n<br>\r\nThe tubes came from the ceiling &amp; while the boys used their body control powers to levitate him into laying down position with ass up &amp; ready for abuse. They put the tubes in his orifices easily, now he was inflated with the force of a dam breaking. All that liquid inflation was already working leaving his extremities about the size of a doll in comparison to the rest of his gargantuan body which was turning into the world's largest _____.</span></div></div>",
            "created":1407992520,
            "id":1841184,
            "title":"Mini-Mike-->Furniture"
        },
        "115":{
            "author_id":"lilhikariboy",
            "author_name":"Sho",
            "choices":[
                "He notices you and motions you in.",
                "He doesn't notice you and you go in anyway.",
                "A bell rings and he notices you."
            ],
            "content":"<div class=\"\"><div> <span>You see an older boy roll around the corner and give you one of those \"What's up?\" nods.  He looks pretty fat to be at a weight loss school, but he might be new too.  You turn your head to watch him roll down the hall in a mobile bed, seeing his wide, fat belly jiggling in his tight uniform shirt.  You swallow and can't help being amazed, but shake your head clear.<br>\r\n<br>\r\nThere's the sound of crunching, followed by a loud, moist slap, and then a belch so huge it rivals your big Uncle Marty's!  Intrigued, you go around the corner that the boy you just saw came around and see a set of double doors that are wide open.  Inside the doors is the biggest, fattest kid you've ever seen!  He looks to be around 17 like the boy who walked past you, but is so enormous it seems impossible.<br>\r\n<br>\r\nHis face was enormously bloated and covered in crumbs and sauces.  His chest were two hugely fat, sagging pecs on top of a belly that looked like it could fit a car in it.  His arms looked bigger around than your waist and his hands were huge!  You could see some of his legs and they too looked like they could smother you easily.  His butt is spread out behind him far and wide.<br>\r\n<br>\r\nHe shovels in a huge handful of chips, crunching loudly and messily.  He slaps his fat hand to his belly and wipes the grease off on it and then heaves out another belch that you can feel in your chest.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1265259600,
            "id":830350,
            "title":"A bedridden, immobile boy"
        },
        "1151":{
            "author_id":"fruffles",
            "author_name":"Shangas",
            "choices":[
                "\"Feed me until I beg for mercy\". (check \"Obese Jr. High\" at Writing.com)",
                "\"Oily belly rub\". (check out WG story \"It's Time for Your Shake\")",
                "\"have sex w/ me\" (maybe oral sex involved, check out \"Ultimate Fat-Kid Fantasy\")"
            ],
            "content":"<div class=\"\"><div> <span>You head inside when he looks up and sees you staring at his massive body. <br>\r\n<br>\r\n\"Hey!\" he calls out, \"I haven't seen you here before!\" <br>\r\n<br>\r\n\"I just started, my name's Matt!\" you say. <br>\r\n\"Yeah?\" the older boy says, \"How old are you?\" <br>\r\n\"Nearly thirteen\". <br>\r\n\"How fat are you?\"<br>\r\n\"About 220 pounds...\"<br>\r\n\"Cool...\" the boy says. \"You look cool\". <br>\r\n<br>\r\n\"Thanks,\" you say, \"Who are you?\"<br>\r\n<br>\r\n\"Lard-ass,\" he said. <br>\r\n\"Huh?\"<br>\r\n\"Lance,\" the boy says, \"But I like lard-ass better. So you got a dormitory here at the school yet?\" <br>\r\n\"Not really, no,\" you say. \"How old are you?\"<br>\r\n\"Sixteen!\" the boy says. He reaches for a huge burger the size of a football and bites into it! Melted cheese and grease squishes out the other side and splatters onto his belly. He stuffs the entire burger into his mouth. <br>\r\n<br>\r\n\"Igg uu doonk hagg a woom, uu can sheep wigg me!\" he says through the huge mouthful of bread, meat and cheese. He gulps the burger down, guzzles down a Supersized Coke and belches disgustingly loudly. <br>\r\n<br>\r\n\"Um...okay,\" you say. \"My bags are in the hall...\"<br>\r\n\"Bring 'em in!\" Lardass tells you. \"There's a bed over there,\" he points to a bed in the far corner of his huge room, \"You can sleep there. You can be my room-mate and helper. If you do stuff for me, I\"ll look after you,\" he says. He rubs his huge hands over his belly, scooping up ketchup, mustard, crumbs, grease and oil that had splattered onto his belly and licked the mess greedily off his arms and hands. You can feel your dick getting hard just staring at this one-boy slobby eating-machine! <br>\r\n<br>\r\n\"Okay!\" you say, and rush out to get your bags. As you drag them inside, another boy smiles at you. <br>\r\n<br>\r\n\"So,\" he says, \"You're Lardass's new plaything, huh?\" he says. <br>\r\n\"Huh?\" you ask. <br>\r\n\"Whoever rooms it with butter-butt has to look after him. You better LOVE fat to move in with him!\" the boy says. You ignore him and head inside and close the doors. <br>\r\n<br>\r\n\"How much do you weigh?\" you ask Lance. <br>\r\n<br>\r\n\"I'm nearly a TON now, dude!\" Lance says, \"My eatin's been outta control since I was born! I fucking LOVE being fat! And you're gonna make me fatter, capiche?\" <br>\r\n\"Sure!\" you say, \"I'll feed you whatever you like!\"<br>\r\n\"Awesome...\" the huge boy says, \"But that ain't all you gotta do. You gotta wash me, you gotta suck my dick off and give me belly rubs too. I can't do that myself so that's your job\". <br>\r\n<br>\r\n\"Wait how can you take care of me if you're an immobile fat boy slob who moves around in a mobile bed? I want to be fat too, not just a feeder, so how can I get fatter while taking care of you? &amp; how are you still so healthy despite your super morbid obesity?<br>\r\n<br>\r\n\"I have robotic tentacles here to do a lot of things I can't do anymore. But as for sex, feeding, &amp; cleaning, well I prefer a human touch to that. So you understand. As for health, I have a special monthly medicine I hav I go to the bathroom using a septic tank underneath my mattress &amp; my nutrients &amp; special cure gets pumped in through IV's in the back of my arms, armpits, thighs, calves, &amp; spine. As for you getting fatter, I'll give you a feeding machine which'll feed you when you go to be or are in the room so that you can get fatter most of the time. So do you wanna be roommates, best friends, &amp; gay FA feeder feedee lovers?\"<br>\r\n<br>\r\n\"Okay...\" you say. \"Starting when?\"<br>\r\n<br>\r\n\"Now!\" Lance says. \"I need you to...\"</span></div></div>",
            "created":1291611600,
            "id":1009830,
            "title":"He notices you and motions you in."
        },
        "11511":{
            "author_id":"fruffles",
            "author_name":"Shangas",
            "choices":[
                "Sugared Lard. ",
                "Vanilla Ice Cream. "
            ],
            "content":"<div class=\"\"><div> <span>\"How do I do that?\" you ask. <br>\r\n<br>\r\nLardass Lance smirked. <br>\r\n<br>\r\n\"I'll make it easy for you,\" he said. \"When I get real hungry I don't have time for no pesky chewing. So whatever you get me needs to be really soft and liquidy\". <br>\r\n<br>\r\n\"Oh,\" you say. \"Okay, I guess that isn't too hard...But what do you eat?\" <br>\r\n<br>\r\n\"The cooks know what I like to eat,\" said Lance. \"Just go down to the kitchens and tell them Lance is hungry. They'll show you what to do\". <br>\r\n<br>\r\nYou shrug, leave the room and head down a corridor and then down an elevator to the level that says 'KITCHENS'. Probably not to your surprise, an entire floor of the school is devoted to food! You pop out into what looks like a 'lobby' with a table and chair there and a bell on the table and a card next to it that says \"RING FOR SERVICE\". <br>\r\n<br>\r\nYou pick up the brass bell and ring it several times, loudly. A plump, white-dressed lunchlady waddles towards you through an enormous pair of swing-doors. <br>\r\n<br>\r\nShe stops short and surveys you. <br>\r\n<br>\r\n\"New student, huh?\" she asks. You nod. <br>\r\n<br>\r\n\"Well what are you doing down here, then?\" she looks at a clock between the two elevator-shafts behind you. \"Lunch isn't ready yet!\" <br>\r\n<br>\r\n\"Um, Lance sent me down,\" you say, \"...and he says he wants his lunch now...and that you'd know what he'd want and that...I should leave it to you\", you say. <br>\r\n<br>\r\n\"Ohhh...\" said the lunchlady. \"I see...\" <br>\r\n<br>\r\nShe nodded. <br>\r\n<br>\r\n\"Alright,\" she said, softening a bit, \"Come on! This way!\" <br>\r\n<br>\r\nThe lunchlady leads you through one set of the several pairs of swing-doors that lead to the different kitchens on this level of the school. <br>\r\n<br>\r\n\"Take two of those!\" she says, pointing to the corner of a huge storage-room. <br>\r\n<br>\r\nYou stare. <br>\r\n<br>\r\nTwo of 'those' were a pair of enormous, plastic wheeled carts, each one the size of a dumpster! You grab them and then realise that they can couple together like railroad carriages. Linking two carts together, you follow the lunchlady to another room! <br>\r\n<br>\r\n\"Alright!\" she said, clapping her hands, \"We need to fill both these here tubs, full of what's in these silos!\" <br>\r\n<br>\r\nYou stare upwards at a towering set of dozens of steel silos. You notice that the silos are organised according to what their contents are. <br>\r\n<br>\r\n\"So what does Lance like to eat?\" you ask, nervously. <br>\r\n<br>\r\n\"Lance? That big blimp?\" the lunchlady asked, and laughed, \"Oh he'll be fine with....this, usually!\" she pointed to a huge silo. You stare up to read the noticeboard hanging on it, that reads... <br>\r\n<br>\r\n</span></div></div>",
            "created":1298091600,
            "id":1056903,
            "title":"\"Feed me until I beg for mercy\". (check..."
        },
        "11513":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "101 or 411 (mouth or throat)",
                "911 (ass or bellybutton)"
            ],
            "content":"<div class=\"\"><div> <span>There he was &amp; I was ready to blow him. Where the dick was, I had no idea. It took a few minutes but I finally found it &amp; there were two rubbery structures, like the rubber on tires, which held up a small chamber big enough for your head to squeeze into &amp; it also had a mask-like object which only goes over your nose &amp; mouth &amp; his rod was like a stiff serpent, 15x harder than the rest of Lard-ass’s body which made it equivalent to steel with a ball sack that held what appeared to be sperm the size of bowling balls in a huge bag the size of a body bag, only no body. &amp; the pre-cum already flowing outwards from the sack which was loosening bit by bit from lack of pressure into a pipe which probably went under the bed into the septic tank. You were both shocked &amp; hard at the same time &amp; you were ready to blow this bad boy straight down your throat &amp; into your stomach. Before you did that though there was a device with instructions, a control pad that asks for numeric instructions to stimulate pleasure &amp; deal with health needs. There were several codes for this blow job. It says:<br>\r\n“<i>Ask robot to attach breathing &amp; the arms will help deal with sexual pain &amp; pleasure through arms &amp; pain-number gas in mask, then by repeat 3-digit-password, &amp; it'll activate the robot arms which will take you back out to the top of my gut when you’re done. If you have any questions, say code blue  &amp; we’ll be on videochat. Here are the codes.<br>\r\n101=blowjob in just mouth,.<br>\r\n411=blowjob in throat like a tube feeding device, &amp; finally<br>\r\n911=fuck job straight into stomach through asshole or bellybutton.</i><br>\r\nYou were surprised there were so many lardfully lustful options to this ludicrous lever. Then it began. You typed in…<br>\r\n</span></div></div>",
            "created":1306213200,
            "id":1111938,
            "title":"How to Jack-Off Lardass"
        },
        "115132":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Ass",
                "Bellybutton"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you choose 911. But which orifice is Lardass's dick going through, your ass, or your belly button?</span></div></span></div>",
            "created":1309237200,
            "id":1136734,
            "title":"the ass or bellybutton"
        },
        "1151321":{
            "author_id":"fruffles",
            "author_name":"Shangas",
            "choices":[
                "Switch to Lardass's view... ",
                "Stay with your view... "
            ],
            "content":"<div class=\"\"><div> <span>Trapped under Lardass's huge form, you find yourself almost completely immobilsed. Then you feel something thick, wet and soft press against your buttcrack. Suddenly, a pair of mechanical arms hold you by the shoulders so you can't squirm away! Then, without warning, you feel Lardass thrust into you. A huge, bloated battering-ram! You grit your teeth as suddenly the enormous fat dongle is shoved up your ass! You gasp in shock as you feel its powerful, painful entrance, disbelieving of its immense girth and length! You start hyperventilating as the huge fat boy's dick is slowly shoved in and out of your puny interior, giving him pleasure and giving you nothing but agonising pain! You had no idea that something like this was even possible! You gasp and struggle and let out screams of agony as Lardass enjoys his fun.... </span></div></div>",
            "created":1309237200,
            "id":1136754,
            "title":"Ass"
        },
        "13":{
            "author_id":"gahbbr",
            "author_name":"gahbbr",
            "choices":[
                "a bit chubby",
                "fat",
                "obese",
                "huge",
                "a giant"
            ],
            "content":"<div class=\"\"><div> <span>“Remember Headmaster Jones, we have a new student joining us today.” said a cheery voice from behind.<br>\r\n<br>\r\n“Ah, yes. Michael wasn’t it?” replied a deep voice.<br>\r\n<br>\r\n“Yes, Michael Robertson. In fact there he is now.”<br>\r\n<br>\r\nTurning around you see that the female speaker is a pleasantly plump, middle aged woman with brown hair. While the male speaker, Headmaster Jones, was…</span></div></div>",
            "created":1289883600,
            "id":995104,
            "title":"The headmaster with the receptionist"
        },
        "134":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Meet Prefect & Roommate (Including \"Big\" Benjamin Jones)",
                "Sign the Behavior Contract (Strange Terms of Service Once Signed on Dotted Line)",
                "Health Evaluation (Strange Science Serums/Injections)"
            ],
            "content":"<div class=\"\"><div> <span>Headmaster Jones was huge. He was the law and order in this institution and clearly he liked his job based on that sneaky smirk on his face. To compare body weight with Mr. Jones would only have one comparison, a hippopotamus in size, but unlike hippopotami, about 11/12 of his body weight was fat so it was clear he wasn’t going anywhere fast, or anywhere with his own two legs at all for that matter.as Matt had seen a mechanical wheelchair move underneath him. Hugo Jones’ moons were more like udders on a cow that probably would have swayed off to the side if they weren’t kept in such a tight space such as his tight business suit. Most prominent was his gut which was as round as over-inflated beach ball but with the fluidity of gelatin, plus you could his shirt riding up revealing an outie bellybutton the size &amp; thickness of a well penis. His ginormous sausage arms with mutton mitts were about as thick as the flippers of a baby whale, with deep indents for the nails and folds over the knuckles. which despite growing so quickly had smooth stretch mark less skin as they slowly typed away on a computer meant for a giant of a man. “Aww Michael Richardson. I’ve heard good things about you. Now welcome to the Father’s of Tommorrow School for Boys or as it is affectionately called by students, the FAT School for Boys.” he chuckled jiggling his paunch like santa clause, or in English, a bowl full of jelly. “Now we have a few conditions for you once you enter this institute. We’ll need you to be introduced to your prefect &amp; roommates, one of which is my oldest son “Big” Benjamin Jones. You’ll need to sign some paperwork which in layman’s terms means you shall follow the school rules to the letter. And you shall head to the school nurse when we are finished for an examination. So which would you rather do first? Meet your prefect and my son, sign the behavior contract, or head to the school nurse. It’s your choice…</span></div></div>",
            "created":1419708180,
            "id":1908044,
            "title":"Heasdmaster Hugo “Huge” Jones"
        },
        "1343":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "An Explosion is Heard from Outside of the Headphones, Nurses Reaction",
                "Binds are Attached to All Parts of Michael’s Body, Ready for Hypnosis",
                "Something is Rubbed Onto Michael’s Skin, Paralyzing Him"
            ],
            "content":"<div class=\"\"><div> <span>“I’d like to have my health evaluated first. Might as well get the checkup over with so I can go to the next activity.” Michael responded.<br>\r\n<br>\r\n“Excellent!!!” Headmaster Jones shouted which jiggled his entire body from the ground up, particularly his cheeks, chins, boobs, &amp; belly. Headmaster Jones responded pushing an intercom button as he spoke into it “Nurse Phelps, your next patient is ready for you. Uh huh. Yes, well of course you ready for a checkup with a new student, that’s why I hired you straight out of medical school, so you could get some experience Celeste. Good now off with you Mr. Richardson.” He shooed Michael out of his office. Michael was preparing for yet another health evaluation and headed down the halls. When Headmaster Jones was sure that Michael was gone, he sealed the doors &amp; windows, plus all the air vents so he could speak to someone in private on his computer. “Yes Gordon, I know how important this student is to us, but please wait so I can have him properly prepared for his role, not to mention let my son have a little fun with him.”<br>\r\n<br>\r\nA deep yet raspy voice was yelling from the desktop, “Fine!!!! Do what you want with him for all i care, but no sexual activities period, protected or otherwise, we need him a virgin to test our new product and prepare for mass shipment. Understood” Gordon the mysterious voice ordered from his employee.<br>\r\n<br>\r\n“Yes of course Gordon.” Headmaster Jones nervously replied, while flooding his suit with sweat from nervousness, combined with his ginormous weight, he was already hot enough as is &amp; needed to check up on something important. “I’ll make sure he is still a virgin until you are done with him, then he belongs to my son Benjamin to do with as he pleases.” He smiled cruelly.<br>\r\n—————————————————————————â €”—————————————————————————— ————————<br>\r\nMeanwhile at the other side of the institute, Michael was waddling along when he got the strangest premonition that something bad was going to happen, but he shrugged it off. When he arrived at the Nurse’s Office, he trepidatiously knocked at the door &amp; he was ushered in by a male orderly. “All right young man, ready for your evaluation. This won’t hurt a bit.” He smiled quite genuinely.<br>\r\n<br>\r\n“Okay.” Then Michael trotted onward till he met a young chubby female nurse who was most like Nurse Phelps. “Awww, aren’t you just precious, come now young man, we need you to look through these optometry machines to test your eye sight first of all while testing your sense of hearing with these headphones. Understood.” Michael nodded, though internally he was curious as to why they would test both his sense of sight &amp; sound at once. He put on the equipment while they strapped in his head as he sat down on a chair, then the strangest thing happens…</span></div></div>",
            "created":1419709860,
            "id":1908050,
            "title":"Health Evaluation=Maybe Mad Science at Play"
        },
        "13432":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Michael’s P.O.V.",
                "Dr. Stroke’s P.O.V."
            ],
            "content":"<div class=\"\"><div> <span>Binds begin to attach themseves to all parts of Michael's body, as he is prepared for hypnosis &amp; personality rewriting.  \"Wait what's going on??? Why am I being bound to this chair?!?!?! What do you people want?\" Michael screams for answers.<br>\r\n<br>\r\n\"Ohhh, don't worry young man\" Nurse Phelps responds. \"The doctor will be here soon to help guide you on your new size-journey. But since you're resisting, we need to enact our newest proper performance policy to make sure you cooperate with all future instructions... 'Dr. Simon Stroke please report to the nurse's office for immediate treatment on our new student’.” Then in the room came Dr. Stroke.<br>\r\n<br>\r\n“Perfect I can’t wait to reeducate this boy into Fat School For Boys. Now then we shall start by placing these sensors on his forehead\" Dr. Stroke giggled quite maniacally. He attached a head band sensor to show his brainwave readings and detect truth &amp; lies based on his actions. \"Then we begin the subliminal brainwashing to make him a desperate uke in need of food &amp; penetrative sex\" Dr. Stroke then inserted a flash drive into the console and activated it. Whose perspective do we go to now... Michael's or Dr. Stroke's as he reprograms Michael's mind by watching him suffer.</span></div></div>",
            "created":1419740040,
            "id":1908249,
            "title":"Binds for Blubber-Based Bondage"
        },
        "14":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Prefects=600 lb.; Guards=800 lb.",
                "Prefects=800 lb.; Guards=1000 lb.",
                "Prefects=1000 lb.; Guards=1100 lb.",
                "Prefects=1200 lb.; Guards=1300 lb.",
                "Prefects=1400 lb.; Guards=1500 lb."
            ],
            "content":"<div class=\"\"><div> <span>These prefects were huge, about the size of a small walrus each, &amp; it seemed they were in really advanced wheelchairs. The only things bigger than the prefects were the  school guards, who were clearly bigger, stronger, &amp; faster than an entire team of fat football players &amp; a 1,000 lb. sumo wrestler. Their bodies were almost spherical, bu the question is, how much do they weigh?</span></div></div>",
            "created":1342587600,
            "id":1382130,
            "title":"A couple of prefects with the school guards."
        },
        "143":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "your room assignments & your classwork achievement",
                "feeders-in-training & GAY sexual rituals.",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>You walked up to the blubbery behemoths &amp; tap them on the butt, since it's the only body part you could reach. \"Um, excuse me.\" They turn around &amp; you see two smiling blubbery blonde prefects &amp; the guards were clearly African-American, but they weren't starving or deprived.<br>\r\n<br>\r\n\"Hey you must be Mike. I'm Devin, &amp; this is my brother Duke.\" The wider blonde prefect responded. \"We are in charge of...</span></div></div>",
            "created":1342587600,
            "id":1382162,
            "title":"Prefects=1000 lb.; Guards=1100 lb."
        },
        "1433":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "\"Specialized\" Student Training (Submissive student+Dominant Prefects)",
                "Eating Competition (Liquid Inflation Bloat or Vore)",
                "Prefects+Guards=More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Specialized Student Training to get a \"Special Job\" after graduating secondary school (secret fetish mixed with fat, but is primarily a dominance over submissive thing, with main character being submissive)? What could that entitle?<br>\r\n</span></div></span></div>",
            "created":1428393840,
            "id":1960252,
            "title":"Other choices for Prefects & Guards"
        },
        "14331":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "“Play time!” ABDL Mental Regression ",
                "Milking+Sex Time"
            ],
            "content":"<div class=\"\"><div> <span>“What kind of ‘specialized’ training?” Mike asks curiously, not knowing what he was in for.<br>\r\n<br>\r\n“You’ll see. But first we need you to come with us to the classroom.” the first prefect responded. “By the way, my name is Casey.”<br>\r\n<br>\r\n“I’m Josh.” Said the second prefect.<br>\r\n<br>\r\n“I’m Wilson.” introduced the first guard.<br>\r\n<br>\r\n“I’m Koda.” greeted the second guard.<br>\r\n<br>\r\n“Now that that’s all settled. We need you to get ready for your training. So come with us.” Casey prompted, and Mike followed him down a long winding corridor to a steel door with a fingerprint scanner. Casey placed his ginormous left mitt on the scanner, though how he did it with turning around is anyone’s guess, and the door opened into a waiting room. They waddled on into the waiting room where they met a plump male receptionist. who looked almost bored with his day job as he flipped through a magazine. “Appointment for 9:00 with Professor Bigglesworth.”<br>\r\n<br>\r\n“Let’s see.” the receptionist responded flatly. As he typed up something into the computer. “Yes he’s available, but make it quick. Professor Bigglesworth has many other students to teach today.” he responded flatly again.<br>\r\n<br>\r\n“Excellent. Now Mike before we commence we need you to get undressed completely and eat this pill because we are doing medical testing for a powerful new drug…” Casey responded while Mike gasped and his eyes bulged out in disbelief. “Don’t worry Mike the drug’s been tested on humans before many times. It’s safe, harmless, humane, and the treatment you get will be most pleasant with your cooperation of course.”<br>\r\n<br>\r\n“But what does the drug do?” Mike asked.<br>\r\n<br>\r\n“It will help you feel better about yourself and transform your body into what you want it to be.” Wilson responded leaving Mike puzzled.<br>\r\n<br>\r\n“Just trust us little buddy, you’ll love every second of this or your money back. Now c’mon Mike” Josh pleaded, and Mike got undressed quite sheepishly, and ate the pill. The next thing Mike knew was complete darkness and drowsiness.<br>\r\n<br>\r\n“Hits the reluctant ones hard every time.” Koda tut-tutted. “Now to bind him up for…</span></div></div>",
            "created":1447119360,
            "id":2059166,
            "title":"“Specialized” Student Training"
        },
        "15":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "A couple of teachers",
                "The school nurse",
                "The gym teacher/sports coach",
                "The librarian",
                "or more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some other choices:</span></div></span></div>",
            "created":1257915600,
            "id":790612,
            "title":"More faculty than you thought"
        },
        "151":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Home Economics",
                "Math & Sciences",
                "Creative Arts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great so what kind of teachers are they? Home Economics, Math &amp; Sciences, or Creative Arts?</span></div></span></div>",
            "created":1414468440,
            "id":1878574,
            "title":"A Couple of Teachers"
        },
        "1512":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Pre-Algebra",
                "Biology",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great so which kind is it Pre-Algebra, Biology, or more choices.</span></div></span></div>",
            "created":1417391580,
            "id":1896021,
            "title":"Math & Science Teachers"
        },
        "155":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "A few visiting parents w/kids (skinny to obese)",
                "Post-Graduate Alumni (visiting perhaps, remember they are huge)",
                "School Club Members on Parade (anywhere from fat to morbidly obese)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how about these choices (last ones).</span></div></span></div>",
            "created":1354165200,
            "id":1478449,
            "title":"Or more choices"
        },
        "1551":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "An Obese Boy (Mobile, but Slow with Walker)",
                "A Morbidly Obese Boy (moves in wheelchair)",
                "3. An Extremely Obese Boy (Moves by Mobile Bed)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There were a few visiting parents (probably hoping to enlist their fat kids in this school), with fat kids varying from slightly chubby, to morbidly obese. You went up to them &amp; talked to...</span></div></span></div>",
            "created":1354942800,
            "id":1484281,
            "title":"A few visiting parents w/kids (skinny to obese)"
        },
        "1552":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Obese ",
                "Morbidly Obese",
                "Super Obese"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great so graduating classes from the high school division. How big are the Alumni? Are they Obese, Morbidly Obese, or Super Obese? Mobile or otherwise will be described after you choose the chapters. So which size are they?</span></div></span></div>",
            "created":1412040540,
            "id":1864098,
            "title":"Post-Graduate Alumni (Visiting/Staying Here)"
        },
        "15523":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Mobile",
                "Immobile"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Great so are they mobile or not?</span></div></span></div>",
            "created":1412041560,
            "id":1864106,
            "title":"Super Obese Alumni"
        }
    },
    "info":{
        "author_id":"creater1",
        "author_name":"Cre8r 1",
        "brief_description":"Mike had always been fat. Now he would have fat kinship at his new school",
        "created":1257919860,
        "description":"<td align=\"left\" class=\"norm\">Mike has always been fat. He weighs about 220 lb. of fat at only 12 years old, almost 13, right about when school starts. Now his parents say he’s going to a “special school” where he’ll fit in. What he doesn’t know is that soon, he’ll be “fitting in” to a much bigger picture.<br>\r\n<br>\r\nPlease add chapters if you are a FA, feeder, or WG fan. I’m trying to take my idea off of Bigman’s Obesity School for Boys interactive story. I thank you Bigman for your inspiration. I hope to see chapters up once I add several storylines soon.<br>\r\n<br>\r\nHere are some rules:<br>\r\n<br>\r\n#1: there can be sci-fi or magic to cause weight gain, but keep it to a maximum gaining of 100 pounds in a month to keep it level.<br>\r\n<br>\r\n#2: explain just a tad bit of what's happening during sex, IF YOU ARE GOING TO MENTION IT AT ALL.<br>\r\n<br>\r\n#3: be sure to add school activities relating to fat &amp; weight gain if you want to add a storyline<br>\r\n<br>\r\n#4: the teachers are also fat, &amp; every student here is gay so make with that &amp; add to the story.<br>\r\n<br>\r\n#5: if your chapter has bad spelling/grammar or breaks 2 or more of these rules, I reserve the right to edit or delete that chapter.<br>\r\n<br>\r\nOther than that go wild. </td>",
        "id":1617254,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1577130420,
        "modified":1577130420,
        "pretty_title":"Fat School for Boys"
    }
}