{
    "chapters":{
        "1":{
            "author_id":"nackvixen",
            "author_name":"NackVixen",
            "choices":[
                "You are an ex-athlete male dragon tired of the demanding life style.",
                "You are a skinny non-descript male fox with eyes drawn to those wobbles",
                "You are a tubby female rat, you've always had problems overeating.",
                "You are a single mother skunk, your family has moved on, time for something new",
                "You are a non-binary tubby rabbit, looking for the place where you belong. "
            ],
            "content":"<div class=\"\"><div> <span>          You had to leave town. You packed your meager belongings, took what money you had, bought a train ticket and left. The train ride was casual, watching the trees and plains go by. People murmured around you, worked on laptops and phones. A baby cried. You spent most of the time thinking about what you were going to do. <br>\r\n<br>\r\n          You had no job prospects, no family to speak of. You just needed to leave and GO. As if something were dragging at you to move on. A lot of people do that now a days, it's not weird. <br>\r\n<br>\r\n          Somewhere along the line, you got out on to the train platform. You don't remember getting out on the train platform, but you have your bag, and you are in the middle of a city. The train was already leaving, moving off, leaving you to recover from your daze. The city is like a sprawling suburb. Few buildings are higher than two stories. The train station has a single gate out of it, no parking lot, no stand, no ticket counter. Just a place for people to get off the train and leave. Before that weighs too heavily on your brain, a new thought intrudes. Everything smells like sugar and fresh dough.<br>\r\n<br>\r\n          You glance up towards the sign over the gate. 'Welcome to Zaftig City.' Outside of that gate, the smells come from what you can see are multiple food shops. Every other building seems to be a food shop of some type. Bakeries of every sort are common, but there are American eateries, sushi bars, noodle joints, barbecue places. Among them are the other buildings that are customary, tailor shops, barber shops, appliance repair. The street has very few cars for such a large city, but the first trolley passes by and you are stunned.<br>\r\n<br>\r\n          Save for a single meerkat, no one on the trolley must be lighter than six hundred pounds. Stunning more is that they have a tendency to chat! A more friendly casual atmosphere than the train cars back home. A horse on the back is entirely shirtless, wearing only a massive pair of shorts. He takes up the entire width of the trolley, his belly spreading on the floor of the trolley, soft flab rippling with every bump of the trolley. He lifts a heavy arm from a sack, taking a candied apple up to his mouth, his muzzle comically small against his fat cheeks as he pushes in the treat, chewing it in a single bite. <br>\r\n<br>\r\n          You turn back towards the train station. It is a single platform, with no time table, no ticket counter. You turn back towards the enticing smells of the city and the waddling citizens taking up much of the double wide sidewalks.</span></div></div>",
            "created":1542154440,
            "id":2577429,
            "title":"Welcome to Zaftig City"
        },
        "12":{
            "author_id":"nackvixen",
            "author_name":"NackVixen",
            "choices":[
                "Better find someplace to stay.",
                "Better find someplace to eat.",
                "Better find a job.",
                "Better find a drink, there is a bar down that way.",
                "Maaaybe we could hang out with Foster more. Just for now."
            ],
            "content":"<div class=\"\"><div> <span>\tThe fox stuck his hand in his pocket and wheeled his luggage down the sidewalk. Something here made his stomach flutter. He had to work to keep his eyes forward and put all his concentration on walking straight. This reminded him of the west coast beaches. Dress code here was on the light side, with it being a warm summer day. Furs wore loose clothing, wide dresses or easy shirts. If someone had a few buttons of their shirt from the bottom left open, no one seemed to mind. It only served to let out the gut that every seemed to have and let it out free in the air. <br>\r\n <br>\r\n\tHe turned his head to look into a shop, eyes widening as he realized it was some sort of soft serve restaurant. But the furs in the restaurant were lying back on benches, tubes in their mouths, bellies swelling in time with steady gulps of their ice cream. He craned his neck around to get a look when he hit something. A wall of soft red, smooth, scaled, warm. He pressed his hand down into it to explore. Soft and doughy. gulp.<br>\r\n <br>\r\n\tThe dragon chuckled, a heavy breathy chuckle, the weight of adipose on his body deepening his voice. The bench he sat on was clearly made for someone of enormous size, made of concrete but all the sharp edges replaced with outward curves. Probably so that the dragon's six foot wide rump didn't pinch when it spread out over the sides of the bench. He was another one of those shirtless types, his stomach a vast ball of thick dough in front of him, belly scales a glimmering gold, with bright red scales on the roll laden sides. He turned his head, smiling, making fat cheeks and thick neck bunch. \"Just got into town?\"<br>\r\n\t<br>\r\n\tFox finally jumped back, trying to compose himself, \"Yea, sorry, uh. Just got into town. Never been to a place with an ice cream shop like THAT.\" He turned his head back, causing the dragon to chuckle knowingly.<br>\r\n\t<br>\r\n\t\"Don't worry about it. You get used to it. I don't like ice cream that much, myself. I'm a meat guy.\" The fox turned around just in time to see the dragon's tubby paw slap down on his belly, making the fat ball shake. A knowing grin to match that earlier chuckle rode up onto his face. \"I'm Foster.\" He stuck out that tubby paw and leaned out, seeing as he had enough fat in most directions to keep a handshake unlikely. As Fox grasped the fat paw, Foster used his other to fish out his phone and a touch pen. Fox, surprised, pulled out his own. He had no new outside messages. In fact, nothing from outside seemed to get in here. Instead of trending tweets being movie stars he remembered, it was that someone just broke the new record for most food in a single sitting.<br>\r\n <br>\r\n\t\"Just follow the New Arrival app. You will find yourself getting settled pretty easy, people here are all warm and friendly. Too friendly, sometimes, but then again, they don't go around diving head first into people's stomachs.\" Fox turned red at the ears and looked down at his phone as Foster continued. \"Come and see me again when you settle in.\" The tone was friendly, but Fox could feel the 'and I'll let you do it again' under the words as he marched off, eyes glued to his phone for his own safety.</span></div></div>",
            "created":1542155880,
            "id":2577446,
            "title":"You are a skinny non-descript male fox with eye..."
        }
    },
    "info":{
        "author_id":"nackvixen",
        "author_name":"NackVixen",
        "brief_description":"A Remake, where furs go to discover their love of weight and food.",
        "created":1542153300,
        "description":"<td align=\"left\" class=\"norm\">Zaftig City is a hidden place. You can't go to Zaftig City, you can't leave Zaftig City. But those who make it to Zaftig City are those who are intended to be there and few want to leave, or even can. Powered by strange forces, people who find their way to this city are, whether they know it or not, attracted to size. Girth, width, weight, heft. The majority of the city is overweight beyond any normal standard, but the entire city caters to that life style, with large clothes, large amounts of food, and wide doorways. <br>\r\n<br>\r\nSome are more insistent than others at introducing you to your lurking love of weight. You wouldn't be here if you didn't secretly love it.<br>\r\n<br>\r\nBACK IN THE DAY, this was a writing for those who simply enjoyed weight for weight, without any hooks or need for canon characters. Zaftig City is rated R. Descriptions of nudity are fine, references to sex are fine. But we are going to keep things light.<br>\r\nNo vore, scat, watersports, slob, sweat, gas stuff, underage, bad ends(snuff, popping), descriptions of sex, overt violence, rape, heavy BDSM elements.<br>\r\nNo gender swapping characters.<br>\r\nIt's fine if a character ends up a food disposal, but remember, if they came to Zaftig City, it's probably because they wanted it. <br>\r\nPlease spell check and grammar check. I will be actively moderating.</td>",
        "id":2174582,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1542155880,
        "modified":1542155880,
        "pretty_title":"Zaftig City"
    }
}