{
    "chapters":{
        "1":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Lorenzo huffed, crossing his arms. “As a ghost, I wanna leech off you, Adrian.”<br>\r\n<br>\r\nIn case it wasn’t obvious, my friend Lorenzo here is a ghost. Tragically, he died when a drunk driver swerved down a residential road and splattered his body against the pavement. I thank God every day that those legends of ghosts appearing as their corpses aren’t true.<br>\r\n<br>\r\nNow that he’s dead, there isn’t much that Lorenzo can do. He can’t eat, sleep, or do any of the fun things he liked to do in life. So he just kinda hangs around me since we were best friends.<br>\r\n<br>\r\nI raise an eyebrow. “And how can you enjoy anything money can give if you are essentially air?”<br>\r\n<br>\r\nThis is an old conversation. I come from old money and have invested it pretty well until now. Lorenzo, being my best friend, feels that I work too hard and that I (we) should enjoy it more together and live a life of luxury–well, an undead life of luxury for him.<br>\r\n<br>\r\nLorenzo pauses, biting his lip thoughtfully. “Uh…. I’ll enjoy the /knowledge/ that if I was still alive, I would be rolling in riches.” He smiled triumphantly.<br>\r\n<br>\r\nI stare at him. “Wouldn’t that be….” Sighing, I shake my head. “Nevermind. Besides, I don’t help freeloaders.” A slight grin creases my face.<br>\r\n<br>\r\nLorenzo narrows his eyes. “No? Don’t you?” With a sudden spring, he jumps onto my back, hooking his arms around my neck. “I’m a ghost now! You’ll do as I say!”<br>\r\n<br>\r\n“H-hey! Get off!” I start shivering as I reach for him. “You’re freezing cold!”<br>\r\n<br>\r\nHe holds on tighter. “But….. I’m sooooooo….coooold…..” he giggles playfully.<br>\r\n<br>\r\nI swipe at him arm, phasing through it. “Let go! I’ll catch a cold!”<br>\r\n<br>\r\nHe shivers mockingly. “You’re so warm……. Just a bit longer….”<br>\r\n<br>\r\n“No! Go hug a blanket!” As I try to shake him off, I catch my foot and stumble backwards against a wall.<br>\r\n<br>\r\n“Oof!” He lets go as she is pushed through the wall. “What the – How rude!”<br>\r\n<br>\r\nI huff, pulling away. “Serves you right!” I make my way towards the fireplace, my arms wrapped around me as I continue shivering.<br>\r\n<br>\r\nLorenzo settles to the floor, crossing him arms and huffing in turn. “I was cold!”<br>\r\n<br>\r\n“Then wrap yourself in a blanket!” Muttering loudly to myself about the rudeness of ghosts, I start a fire.<br>\r\n<br>\r\nI feel him sidle up next to me. “…Can’t pick it up….”<br>\r\n<br>\r\nInching away, I focus on the fire. “Use your ghost…powers…and you know…” I shrug helplessly. “Pick it up.”<br>\r\n<br>\r\nLorenzo sniffles loudly, going for sympathy. “But I don’t know how to. I’m a new ghost!”<br>\r\n<br>\r\nI turn and stoop, picking up said blanket. “Hold still.” I lift it and try to drape it over him, watching as it phases through her.<br>\r\n<br>\r\nHe watches it too before turning to stare at me sadly. “See?”<br>\r\n<br>\r\n“…Hmm…” I lift the blanket up again to examine it. “How /would/ a ghost lift up a sheet? Living people can do it physically… So maybe…”<br>\r\n<br>\r\nLorenzo eyes me dubiously, catching my meaning. “Well, I can give it a try, I guess…” He leaned forward and began staring intently at the blanket.<br>\r\n<br>\r\nAfter a few moments, I look around self-consciously. “Should I drop it…?” Starts as the blanket shifts slightly.<br>\r\n<br>\r\nLorenzo immediately perks up. “Look! Look, look! I’m doing it! I’m moving it with my mind!”<br>\r\n<br>\r\nI can’t help but be impressed. “Y-you are!” I grin. “That’s–”<br>\r\n<br>\r\nA ghostly head pokes through the blanket. “–Not him.”<br>\r\n<br>\r\nLorenzo shrieks and leaps away from the blankets–and straight through me. “HELP!!! IT’S A GHOST!!!”<br>\r\n<br>\r\nI involuntary shiver as he dives through me, droping the blanket.<br>\r\n<br>\r\nThe ghost falls with it. “Ooph!…” It floats back up through the floor, carrying the blanket with it. “What’s the big idea?”<br>\r\n<br>\r\nLorenzo peeks at the ghost from behind me. “…Who’re you?”<br>\r\n<br>\r\nMy curiosity and overall irritation wrestled across my face. Curiosity won. “And why are you in my blanket?”<br>\r\n<br>\r\nMuch to my annoyance, the ghost looks beyond me towards Lorenzo. “‘Ello, sir.” Pointedly ignoring me, he asks, “Would you happen to be the new ghost in these parts?”<br>\r\n<br>\r\nMy friend nodded shyly. “Very new. Just joined.” Feeling braver, he stepped out from around me. “Nice to meet you, mister!”<br>\r\n<br>\r\nThe ghost smiles and holds a hand. “I’m Sean. It’s nice to meet you too.”<br>\r\n<br>\r\nLorenzo, shaking his hand, smiles. “Lorenzo.” He beams and gestures at me. “And this is Adrian!”<br>\r\n<br>\r\nSean gives me a contemptuous look. “Oh… Is he the one you’re haunting?” He smiles again at him.<br>\r\n<br>\r\nI narrow my eyes, repressing an indignant huff.<br>\r\n<br>\r\n“Well…. Yes, I suppose we can call it that.” He grins, casually slinging an arm around my shoulders. “Isn’t he adorable?”<br>\r\n<br>\r\nI glare disdainfully at him. “I’ll have you know–”<br>\r\n<br>\r\nSean swoops forward, looking me up and down. “Eh. He’s okay. What have you done so far to him?”<br>\r\n<br>\r\nLorenzo tilts his head to one side curiously. “What do you mean?” He looks back at me. “What am I supposed to do?”<br>\r\n<br>\r\nUnable to help myself, I mutter a few things about him being annoying as a ghost.<br>\r\n<br>\r\nSean taps chin, considering us. “Well… There’s hallucinations, throwing stuff… Uh.. Voices…And possession.” He starts to grin a bit.<br>\r\n<br>\r\nNot liking where this is going, my eyes widened in alarm as I protested. “Those are all a bit much, don’t you think?”<br>\r\n<br>\r\nLorenzo frowns thoughtfully. “They do sound fun….” He gives a dejected sigh. “But alas, I don’t know how to do any of that.”<br>\r\n<br>\r\nSean’s smile grows. “That’s why I’m here. I wanted to see if you needed any help learning the basics.” He floats closer. “I know most of the tricks. Standard possessions, for example, involve floating in.”<br>\r\n<br>\r\nLorenzo’s eyes shine as I try to back away discreetly. “Really?” His smile vanishes. “Will possession hurt him?”<br>\r\n<br>\r\nSean laughs, patting his shoulder. “Only his pride if anything. Need a demonstration?”<br>\r\n<br>\r\nLorenzo assumes his child-at-an-amusement-park expression as he turns to face me. “Oh, Adrian, you don’t mind, do you?”<br>\r\n<br>\r\nI flinch and turn to glare. “Of course I do! I’m not a puppet!” Afraid, I make a dash for the door.<br>\r\n<br>\r\nSean negligently waves his hand, slamming the door shut. He turns to Lorenzo and grins. “Ready?”<br>\r\n<br>\r\nI back away, finding myself cornered between the wall and door. “H-hey now…”<br>\r\n<br>\r\nLorenzo glides over to me, smiling reassuringly. “Relax. Sean said it wouldn’t hurt!” He dove into my chest.<br>\r\n<br>\r\nI gasp as a cold feeling wells up and spreads through my body. I lurch forward, shivering uncontrollably, before falling back against the wall. After a few moments, Lorenzo’s head pops out of my chest.<br>\r\n<br>\r\n“Seeeean!” he whines. “It’s not working.<br>\r\n<br>\r\nSean floats to the side. \"Of course it didn’t. You didn’t wait to hear how it works!” He sighs. “Now, I should tell you a few things.” Speaking to him, he settles a hand on my shoulder.<br>\r\n<br>\r\nI shudder as Lorenzo suddenly pops out, sending me to the floor, gasping. “N-no…no more…”<br>\r\n<br>\r\nSean ignores me. “Three things.” He holds up his hand, counting off. “Size difference, will, and method.”<br>\r\n<br>\r\nLorenzo glances at me before turning to him. “Will and method I kinda understand, but size difference… How bad can that possibly be?”<br>\r\n<br>\r\nSean leans an arm on him casually. “Well, when you possess someone, you essentially put your ghostly form in them, right? If the body is too big, it’s harder to control–though roomier, if you know what I mean. The opposite is true for a smaller body.”<br>\r\n<br>\r\nLorenzo experimentally dips his foot into my leg. “Okay, I suppose that makes sense. But how do you stay inside?”<br>\r\n<br>\r\nSean grins. “That’s where method comes in. First is oral. Observe.” Dropping the blanket to reveal his rounder form, he dived forward into my gasping mouth.<br>\r\n<br>\r\nI flail on the ground, trying desperately to push him off. He surges forward, entering me in gulps. I choke, my muffled screams dying away as the last of him slips inside. I pant on the ground, holding my bulging stomach and feeling incredibly full as Sean’s bulk shifts around inside me. I groan, grabbing my head as he moves up.<br>\r\n<br>\r\nLorenzo comes forward as I sit up. “… Adrian?”<br>\r\n<br>\r\nSean forms a grin and pats my slightly inflated belly. “Nope.”<br>\r\n<br>\r\nLorenzo stares, in awe. “It worked.”<br>\r\n<br>\r\nHe nods once. “That is oral. It’s good for a quick, quiet possession.” Raising a hand, he begins tracing a path down my chest and onto my quivering stomach. “Huh. It’s not too bad in here.” He gives a cheeky grin. “I might have to come back.”<br>\r\n<br>\r\nHe begins shaking and falls back. My body deflates, spasming as he floats out in a long strand. I groan as I come to, my arms and legs splayed out on the floor.<br>\r\n<br>\r\nSean turns towards Lorenzo. “You can use any orifice to possess. Anus, ear, nose, penis–each has its own benefit. Then there is phasing.”<br>\r\n<br>\r\nLorenzo looms over me before looking back. “Is that what I did?”<br>\r\n<br>\r\nSean nods again. “Exactly. Phasing is the fastest mode of entry, but it involves a battle of wills.”<br>\r\n<br>\r\nLorenzo thinks this over. “…Is that why I failed?”<br>\r\n<br>\r\nSean floats over to me. “Yes. You didn’t know how to exert your will over his, so you just ended up making him cold.” His grin turns mischievous. “Before that though, let me show you my favorite method.”</span></div></div>",
            "created":1602267660,
            "id":2918132,
            "title":"Prologue"
        },
        "11":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Arching an eyebrow, Lorenzo hovered slightly above us. “Oh?”<br>\r\n<br>\r\n“Watch carefully.~” Without warning, Sean launched himself onto my crotch.<br>\r\n<br>\r\nI gasp, sitting up as he lands. “Oof! Hey–what are you–No!” I scream as Sean undoes my jeans. I try to slap his ghostly hands away, but am unable to connect with him. As I scramble back, Sean keeps pace before finally darting into my boxer flap. I cringe, falling onto my back as I feel his cool ectoplasm surround and begin sliding into my dick.<br>\r\n<br>\r\nI spasm as I feel him begin to pool in my stomach, my dick becoming hard around his ghostly form. I moan, feeling incredibly full as he begins traveling up my chest. I thrust my hips once as his tail slips in and moan again, settling on the ground. A dreamy smile spreads across my face as I sit up.<br>\r\n<br>\r\nChuckling, Sean runs a hand down my belly onto my boxers, rubbing it briskly. “Ah, definitely my favorite.”<br>\r\n<br>\r\nLorenzo stares with wide eyes. “…Don’t think I can do that.”<br>\r\n<br>\r\nHe rolls his shoulders in a shrug. “Maybe one day.” He reaches into my boxers.<br>\r\n<br>\r\nAdrian clears his throat. “Um, Sean? Right here.”<br>\r\n<br>\r\nHe flashes him an amused smile. “Very well then.” He lays back and takes a deep breath. Spasming, my stomach inflates as I regain control. I groan in discomfort, turning myself over onto my hands and knees. A hand appears out of my ass, pulling the boxers low. I clench, in pain, as I feel Sean’s grinning head pop out.<br>\r\n<br>\r\nHe waves cheerfully. “Had to try each hole as least once.” He slowly emerges, wiggling for emphasis as his tail is sucked out.<br>\r\n<br>\r\nPanting, I try to fix my pants, feeling incredibly violated.<br>\r\n<br>\r\nMy friend narrows his eyes. “Back to the topic at hand… oral possession isn’t will-based?”<br>\r\n<br>\r\n“Not as much. It’s like putting on a costume and moving it–phasing is entering his spirit. Observe.” He grinned down at me.<br>\r\n<br>\r\nI stared up in horror. “Oh no<br>\r\n<br>\r\nOh, God–” I scrabble back. “Please, no–”<br>\r\n<br>\r\nSean lunged forwad, phasing into my chest. I scream, writhing on the ground as I fight for control. All throughout my body, pieces of Sean pop out as he tries to settle in. I claw at my chest and hold my stomach as I feel him move. His face pops out through mine as my back arches. I thrust my hips as I feel him fill me. I feel him click into place as my body relaxes. His face is sucked back into mine as I smirk. I feel bloated. Full, but kinda numb. Rising, I stretch out. “Ah, much better.” I look at Lorenzo. “Phasing also let’s us stay in longer.”<br>\r\n<br>\r\nLorenzo nodded eagerly. “Okay! I want to try!”<br>\r\n<br>\r\nI shrug my shoulders, resting my hands on my stomach. “Hmm…In a bit.” My hands trailed lower. “Oh my.~” A seductive smile forms on my lips as I move to caress my own rear. “Not bad. Not bad at all…~”<br>\r\n<br>\r\n“Seeeean!” Lorenzo whined. “I want a turn!”<br>\r\n<br>\r\nI wink at him, feeling myself grow hard. “Call me 'Adrian.’”<br>\r\n<br>\r\nHe stares. “….” Finally, he cuddles up to me with a wheedling tone. “Please, Adrian?”<br>\r\n<br>\r\nSean has me nod.<br>\r\n<br>\r\nNodding once, I take a deep breath and tilt my head up. Suddenly, my back arches and I feel the large ghost begin to squeeze out. Slowly, parts of him begin to pop out, causing my limbs to flail as he squirms out. With a final push, I feel him detach from my chest and finally get fired out. Gasping and in control again, I stumble back against the wall. Lorenzo quickly follows me, intent to possess me himself.<br>\r\n<br>\r\nI groan, half begging. “Please… Don’t…”<br>\r\n<br>\r\nSean then follows him as Lorenzo tentatively slides his arm into my chest. I moan involuntarily again, feeling not only completely drained from Sean’s playing with my body, but by the next invasion I’m about to suffer. Sean reaches forward and guides his arms in, patiently coaching him.<br>\r\n<br>\r\n“First, you have to align it the best you can…” Lorenzo nods as he adjusts, pressing his back against me. “Then focus on your memories of being solid yourself. How it felt to move your arm and so forth.”<br>\r\n<br>\r\nLorenzo closes his eyes. “How it felt to be solid……..” I watched as he slowly sunk the rest of his body to align with mine. I feel him fill my chest.<br>\r\n<br>\r\nWith a sudden surge of effort, I thrash about. “No! Stop!” I stumble away from the wall as my body goes starts to go numb.<br>\r\n<br>\r\nSean watches critically, circling around me as I struggle against my friend. “Now finish aligning and seize control!”<br>\r\n<br>\r\nLorenzo hesitates as I dry sob from the pressure and pain, spasming in place. He pops his head and shoulders out of my chest. “No, maybe I shouldn’t….. Are you sure it won’t hurt him?”<br>\r\n<br>\r\nSean waves his hand negligently. “It doesn’t cause pain.” He places a hand on his shoulder reassuringly. “It just isn’t a pleasant feeling, I bet.” He grinned and pushed him back in. I fall back against the wall as Lorenzo darts around in my body and tries to settle in.<br>\r\n<br>\r\nAs Lorenzo slows his movement to shifting around, he tries to move my right hand, but cannot. “What’s wrong?”<br>\r\n<br>\r\nSean eyes us. “Hmm… He’s a bit big… You might be too small. If that’s the case, you’ll have trouble aligning properly. Pop your head out.”<br>\r\n<br>\r\nLorenzo obeys, phasing out of my chest. “What now?”<br>\r\n<br>\r\nSean grabs my shoulder and motions towards his own chest. “Breathe. Suck up as much air as possible to expand yourself.” He demonstrated, inflating as his mouth performed a powerful sucking motion. “It’s good for a small bit.”<br>\r\n<br>\r\nLorenzo concentrates as begins to inhale. Slowly, as he gulped air, he began to expand. As he did, he got the hang of it and expanded faster.<br>\r\n<br>\r\nSean let go, impressed. Immediately, I arched my back and fell backwards repeatedly into the wall, trembling and gasping. “So–” I clenched my teeth from the enormous pressure building up inside of me. “–Tight!”<br>\r\n<br>\r\nSatisfied, Lorenzo dove back in. Sean, looming over, looked nearly as happy. “Focus on what moving feels like! You’re nearly there!”<br>\r\n<br>\r\nLorenzo begins to match his breaths with mine, aligning himself to my body’s rhythms. “Relax, Adrian!” He giggled out in my voice. “I wouldn’t hurt you– you know that, right?”<br>\r\n<br>\r\nI feel my breathing begin to slowly be forced to match his. In my last moments of control, I mumble something very uncomplimentary as my consciousness is pushed below his.<br>\r\n<br>\r\nSean inspects me. “….Well?”<br>\r\n<br>\r\nLorenzo awkwardly pulls us up. “I… Adrian…? Sean, where’s Adrian?” He touches my face. “I can’t feel him anywhere.”<br>\r\n<br>\r\nSean grins. “Look in the mirror and you’ll see.” He grabs my arm and pulls me towards a door. “There’s a bathroom in here with a mirror.”<br>\r\n<br>\r\nAdrian stumbles after him. “Wait– this body is so…. Difficult….. To walk in…!” He collides with the door. “Ow!”<br>\r\n<br>\r\nSean stops and gives him a sheepish smile. “Sorry. Forgot you were new at this.” He steadies him. “So! How’s it feel?”<br>\r\n<br>\r\nLorenzo balances himself. “A bit better.” He forms a grin back. “So, where is he exactly?”<br>\r\n<br>\r\nSean gestures vaguely at my body. “Somewhere in there…” He looks him up and down. “I should warn you that you can’t possess someone forever. He’ll push you out eventually, unfortunately.” Opening the door, he bows. “Ready to see your new face?”<br>\r\n<br>\r\n“Oh, that’s good!” His grin turns mischievous. “That means I can just take him back, right?” He pauses. “He’s not just not speaking to me, right?” He catches sight of the mirror and gives a teasing smile. “Won’t I just look exactly like him?”<br>\r\n<br>\r\nSean shakes his head with a smile. “No, you just overpowered his spirit. He’s…asleep, I suppose.” He winks. “And it is /your/ face now. Not his.”<br>\r\n<br>\r\nHe touches my face lightly. “I look so… Different.”<br>\r\n<br>\r\nSean settles on the counter. “And now you’re solid again. He wiggles his eyebrows. \"Still cold?”<br>\r\n<br>\r\nLorenzo wraps his new arms around my chest. “I’m so sorry, Adrian.” He practically moaned in my voice. “But now I’m so, so warm.”<br>\r\n<br>\r\nSean flits through the open door and stares at the clock. “So….What will you do now?” He glances back at him. “I’d say you have about six hours before he pushes you out.”<br>\r\n<br>\r\n“Well…. what do you suggest? You’re the one who showed me the ropes!”<br>\r\n<br>\r\nHe gives a light shrug. “I’d have fun being solid again. Do whatever you feel like. Eat junk food, embarrass your host, bathe–the list goes on.”<br>\r\n<br>\r\nMy eyes widen as Lorenzo is scandalized. “/Bathe/!?”<br>\r\n<br>\r\nHis grin reforms. “Fun, right? Sex is even better.” He stops and gives him a slow look up and down. “Of course, if you don’t want to, I just might.”<br>\r\n<br>\r\nLorenzo admires his new self in the mirror. “I can’t say I’m not curious about certain things.”<br>\r\n<br>\r\nSean looks around suggestively. “Well,” he drawls, closing the door. “You /are/ in a bathroom.”<br>\r\n<br>\r\nHe pulls at my shirt collar and looks down. “…. Huh.” Pulling it off, he raises my hands to grope my pecs. “This….is mine now, right?” My hands trail down my stomach… He snaps to attention. “No, I shouldn’t.”<br>\r\n<br>\r\nSean settles on the counter again. “What could it hurt? It’s not like he’ll remember any of this.”<br>\r\n<br>\r\nLorenzo trails my hands further along to my crotch. “…True…” He looks at Sean. “Nothing at all?”<br>\r\n<br>\r\nSean, watching him lustily, nods. “Nothing.” He drifts closer. “I can see why you chose him. On such close inspection, he’s kinda cute.”<br>\r\n<br>\r\nLorenzo starts, looks up, and backs away. “Uh…Sean? It’s me in here, remember.\"</span></div></div>",
            "created":1602268140,
            "id":2918134,
            "title":"Continue"
        },
        "111":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Another lesson",
                "Make Sean leave",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Sean cuddles up against his stolen chest. “And?”<br>\r\n<br>\r\nLorenzo gulps audibly. “I-I should go explore.” He tries to push past him.<br>\r\n<br>\r\n“Not so fast.” Grips my arm and throws me back against the wall, pinning my body. “Not yet. I’m about to teach you the greatest thing about possession: pushing the host body to the limit.” He grins and begins to suck in air, inflating into a much larger ghost. “Let’s see how that body handles me now.”<br>\r\n<br>\r\nLorenzo tries to pull away. “H-hey! Stop!”<br>\r\n<br>\r\n“No.” With that final word, he pushes my body to the ground. “Let me show you how to have fun.” He dives and slowly sinks into my body, inflating and stretching it to its max as he enters. As he does, Lorenzo’s consciousness is shouldered aside and I feel myself begin to wake up.<br>\r\n<br>\r\nLorenzo starts thrashing about in me. “Stop! He’s supposed to be mine!”<br>\r\n<br>\r\nSean grins. “So? First rule of ghosts–possession is 9/10ths of the law!” With a light jump, he plunges all the way in.<br>\r\n<br>\r\nLorenzo, still in control, arches my back, gasping; he squirms as Sean stretches and maneuvers inside me, before settling with a sagging look.<br>\r\n<br>\r\nA grin appears on my face. “Not bad.” I groan, stretching. “Kinda tight with two of us though.” I pat my inflated stomach, giggling. “How fun!” I feel Sean run my hands over my body slowly, feeling each inflated muscle respond to his delicate touch; eventually he moves from my chest to my stomach and immediately opens my pants. “Feel that? That’s the electric sensation of a body pushed to its absolute limits.”<br>\r\n<br>\r\nHe’s right. As he plays with member through my tight underwear, both Lorenzo and I feel an overwhelming wave of pleasure rock my body wherever he touches it.<br>\r\n<br>\r\nLorenzo, still fighting, turns my head aside and makes a face halfway between horror and lust. “What are you doing?!”<br>\r\n<br>\r\nSean turns it back. “Having some fun.” He reaches in and grabs my rapidly rising cock. “Huh. Good size.” He immediately begin pumping it, an ecstatic look of rapture printed on my face.<br>\r\n<br>\r\nLorenzo moans with him. “O-o-oh! I….” He has me grip my side as they start thrusting. “I didn’t think…”<br>\r\n<br>\r\nMy grin widens. “Privileges of stealing bodies.” I feel him match his thrusts to Lorenzo’s, raising my hips high above the floor. He continues to pump, going faster as the pleasure intensifies.<br>\r\n<br>\r\nLorenzo breathes heavily as he feels the pressure in my groin increase. “Oooooh…”<br>\r\n<br>\r\nI feel my mouth open wide. “Almost….There….” They thrust once more as he shouts, my dick erupting. “YES! YEEEES!” They continue pumping as it continues to go. “Ugh!” They twist my body violently as it slowly settles down. “Yes….”<br>\r\n<br>\r\nWith a contented sigh, they lay back and look down at my cum-covered self. “Well worth it…” As my head is thrown back, Sean squeezes out, carrying Lorenzo with him.<br>\r\n<br>\r\nI blink, groaning as I retake control. My body, after being stretched by two ghosts, feels loose and aching. I look around groggily and stare at my pants. I pale with horror, remembering what happened.<br>\r\n<br>\r\nLorenzo clears his throat. “Adrian, about this–”<br>\r\n<br>\r\nMy eyes roll back and I collapse, completely unconscious. Sean raises his eyebrows, a grin forming. “How about another lesson?”</span></div></div>",
            "created":1602268380,
            "id":2918136,
            "title":"Continue"
        },
        "1111":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Mind control",
                "Readers choice",
                "More ideas"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of lesson ?</span></div></span></div>",
            "created":1602268500,
            "id":2918137,
            "title":"Another lesson"
        },
        "11112":{
            "author_id":"cheese111",
            "author_name":"cheese111",
            "choices":[
                "Lorenzo wants to experiment more with his shapeshifting power",
                "The girls get frisky with Adrian",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>“Well, what do you think of shapeshifting?”<br>\r\n<br>\r\nLorenzo blinked in confusion. “Like magic?”<br>\r\n<br>\r\nSean laughed. “Heh, not entirely false. But you’re a ghost, so let’s be honest here, things have already started getting a little magical, no? I mean, you literally just possessed your friend. It’s not that big a step from there.”<br>\r\n<br>\r\n“F… For you maybe…” I slowly rise from having fainted. I wince as I hold my stomach, feeling a little nauseous from the double possession a few minutes ago. Even with them out of me, my body feels weird. Like it wasn’t quite human anymore.<br>\r\n<br>\r\n“Okay, shapeshifting is a bit like possessing. You just adjust your body to look like somebody else’s  in the same way you try to fill in whatever body you’d try to posses. Here, let me show you what I mean.”<br>\r\n<br>\r\nMy vision was still blurry, but even I noticed the glow Sean was now emitting. I sat up, watching the strange lights dancing before me. Just before things got blinding the light started to fade, revealing some substantial changes to Sean’s body. Lorenzo floated just beside, his slack-jawed expression matching my own.<br>\r\n<br>\r\nSean had transformed into a beautiful woman. His shaggy ghostly haircut doubled in length and turned bright purple. It certainly caught my eye. And from there things only got better. Her top covered the essentials and very little beyond them, leaving a generous volume of her midriff exposed. It was a soft shade of white with cute little frills on the underside. Below it was a short faded blue skirt paired with a shiny black leather belt.<br>\r\n<br>\r\n“See, it’s that easy.” Sean said proudly, now speaking in a feminine voice. “This is my girlfriend. Or well, used to be before I went and died and all that.”<br>\r\n<br>\r\n“You’re one lucky bastard.” Lorenzo mumbled, nodding along. He was as impressed by her beauty as he was in Sean’s ability to transform himself into her. The illusion was so strong that he wouldn’t have guessed it was a ghost shapeshifting had he not seen the process with his own two eyes.<br>\r\n<br>\r\nI watched with a mixture of fear and awe as she slowly stepped closer. The rhythmic tapping of those blue short boots echoed in my ears. Dangling from her ears was an impressive set of earrings. A glimmering silver chain leading down into clear opal rods reaching almost down to her shoulders and shining with a nigh impossible luster. Her gaze was firmly affixed to mine when her eyes suddenly darted down. At this point the realization sank in that neither of these ghosts had bothered to do up my pants after their previous little adventure in my body. My cock was out for her to see and like myself it was happy with what I saw. I quickly put my hands on it to cover my shame, but she just giggled.<br>\r\n<br>\r\n“It’s okay, it’s nothing I haven’t seen already. And let’s be honest, I’d be more insulted if you weren’t turned on by this.” She gave her butt a seductive little slap and kept closing in. Her strut was interrupted by Lorenzo.<br>\r\n<br>\r\n“Whoah… You look sooooo real.” He drifts closer, touching Sean’s arm. “Can you teach me to do that?”<br>\r\n<br>\r\nShe looks over to the enamored ghost and gives a shrug. “I mean, sure. There’s not much more to it than what I already said. Just picture who you want to be…” He paused, waiting for Lorenzo to make his pick. When the other ghost nodded he continue. “And now try to reshape your body to match it. Go on, give it a try. I know you can do it.”<br>\r\n<br>\r\nBolstered by Sean’s encouragement Lorenzo soon began to glow more brightly. I averted my eyes this time, mostly as a precaution and to stop myself from drooling all over Sean’s appearance. But when I looked back my eyes nearly bulged out of my skull.<br>\r\n<br>\r\nJust as I thought Sean looked amazingly hot as his girlfriend, Lorenzo managed to take it a step further. Predictably he’d selected his ex. She was incredibly shy, never saying more than a word to everyone but him, but even I couldn’t deny that she was very pleasant to look at.<br>\r\n<br>\r\n“Oh… oh wow.” She muttered, looking down at herself. She wore a jet black dress, fairly wide and laden with intricate detailwork. Subtle flourishes and frills helped elevate an otherwise macabre looking dress into something far more elegant. The gothic motif carried on with the rest of her clothes. A small white shirt offered a collar’s worth of sharp contrast with the dress and her hair was adorned with a black headband. Plugged into her ears were two tiny buds per side, one sun and a moon, both carefully sculpted from obsidian.<br>\r\n<br>\r\nI watched her attention turn to me. This was the first time I’d seen her actively smile at me. She was normally very reserved to put it mildly. But something seemed off about this. No sooner had the thought entered my mind as Lorenzo began to flicker in and out of his new appearance.<br>\r\n<br>\r\n“Just hang in there. You’ve got this.” Sean said calmly, encouraging Lorenzo to keep going. It’s apparently not as easy as it looks. Lorenzo was swapping into all kinds of different outfits at random, from houte couture to literal clown suits. But with a little push from the other ghost your friend managed to regain control over his new look. Her eyes turned to me. She always had that adorable disarming expression. But the words coming out of her mouth carried a tone that sounded decidedly less harmless.<br>\r\n<br>\r\n“Well then… what do we have here…” </span></div></div>",
            "created":1603314600,
            "id":2926414,
            "title":"Shapeshifting"
        },
        "111121":{
            "author_id":"cheese111",
            "author_name":"cheese111",
            "choices":[
                "Enough foreplay, Lorenzo wants to get intimate",
                "Sean's been inspired with a few ideas of his own",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>“Heh, how about we give him a little show?” Lorenzo mused to Sean. The other ghost seemed on board, but he wasn’t quite anticipating the kind of show Lorenzo had in mind.  She gave her skinny sides one last twirl before concentrating on a different outfit.<br>\r\n<br>\r\n“I gotta say Sean, this whole shapeshifting thing is amazing. Let me try on a few different things.” <br>\r\n<br>\r\nSean was taken aback a little. Lorenzo did see his friend just lying there with his cock out? It was a scene just begging for some attention. But instead he seemed more interested in putting on a fashion show. Eh, Adrian wasn’t going anywhere.<br>\r\n<br>\r\nI sat back in disbelief watching Lorenzo master his new ability with such incredible ease. He swapped outfits like he’d done this all his life. He found himself in a far more formal affair. A dark purple vest covering a light purple vest. It even had a little tie. A yellow sash around her waist formed a neat barrier between the vest and her skirt. The skirt carried the same color and relative plain-ness of the vest that made the whole ensemble look like a playful jab at stiff corporate wear. Her headband took on a distinct red shade and the two buttons in her ear leaked down and transformed into a pair of finely cut ruby hearts dangling from her ears. They shimmered almost distractingly much, drawing attention to themselves.<br>\r\n<br>\r\n“You know, she probably wouldn’t ever tell you herself, but behind closed door my ex was quite fond of you. I reckon you’d make a cute couple.” Lorenzo added, his words sounding a little unusual coming out of his ex’s mouth with her voice. I tried to go along with this crazy train, but it was all a bit much. It didn’t help that I barely got the time to appreciate his outfit before he was changing it up again.<br>\r\n<br>\r\nLorenzo braced himself. This was the absolute most favorite thing he’d ever seen his ex wear. It seemed almost inappropriate to try and repeat that dazzling showcase, but he was nothing if not bold. The neatly pressed vest and shirt merged together into a white top. It flowed seamlessly down into a short skirt, the waist covered in a wide pink band. It was not a subtle display, but all the more alluring for it. It was made of something that carried the subtle luster of fine silk. It lacked in all details, but the simple shape made all the more powerful a statement with it. And it did a wonderful job of highlighting her slim figure.<br>\r\n<br>\r\nBelow the skirt were a set of leggings in the same stark shade of pink, a white stripe running down the side. The fit her legs so perfectly it was like the fabric was simply painted onto them. Not a crease or fold to be seen. It was a breathtaking sight to behold.<br>\r\n<br>\r\nThe last and most poignant difference were the earrings. At first glance nothing had changed. They were still ruby hearts. But they had doubled in size and somehow managed to find an all new level of radiance. But where they were a bit overbearing on the formal wear, they fit along with this bold outfit like a dream. It was difficult to not gawk and drool like a caveman at the wondrous sight before you.</span></div></div>",
            "created":1603329120,
            "id":2926556,
            "title":"Lorenzo puts on a fashion show"
        }
    },
    "info":{
        "author_id":"johneden64",
        "author_name":"That_One_Guy3",
        "brief_description":"Your recently dead friend acquires some training",
        "created":1602267000,
        "description":"<td align=\"left\" class=\"norm\">Your name is Adrian your best friend Lorenzo recently passed away and has been staying with you ever since hanging around until one day you both meet a ghost named Sean with a lot of miles who has a thing or two to teach Lorenzo.</td>",
        "id":2234609,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603329120,
        "modified":1603329120,
        "pretty_title":"A ghostly possession story"
    }
}