{
    "chapters":{
        "1":{
            "author_id":"archerman",
            "author_name":"d",
            "choices":[
                "Ulrich",
                "Odd",
                "Jeremy",
                "Some other boy...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will gain weight?</span></div></span></div>",
            "created":1166677200,
            "id":367152,
            "title":"Who?"
        },
        "11":{
            "author_id":"archerman",
            "author_name":"d",
            "choices":[
                "For Yumi",
                "Overeating",
                "Super Computer Srewup(wg in virtual world)",
                "Too Skinny",
                "Someting else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why will Ulrich gain?</span></div></span></div>",
            "created":1170738000,
            "id":379962,
            "title":"Why?"
        },
        "112":{
            "author_id":"archerman",
            "author_name":"d",
            "choices":[
                "takes Kiwii for a walk...",
                "goes to get breakfast..."
            ],
            "content":"<div class=\"\"><div> <span>Ulrich woke up to the loud barking of his roomate's dog.<br>\r\n<br>\r\n     \"Kiwii....SHUTUP!\"<br>\r\n<br>\r\n   This would have woken Odd but he was out of town and Ulrich was watching Kiwii.<br>\r\n<br>\r\n   \"Kiwii......what do want now?\"he said,having been listening to the dogs barking all night. Just then Kiwii brought over his leash.<br>\r\n<br>\r\n    \"Oh...is that all,\"Ulrich said slipping on some pants.Pausing soon after to admire his six-pack abs and ripped pecks,\"that I can handle.\"<br>\r\n<br>\r\n  Ulrich slipped on his white shirt then put his his green,unbutton dress shirt over that. Suddenly,his stomatch growled, he</span></div></div>",
            "created":1170738000,
            "id":379965,
            "title":"The Walk"
        },
        "1121":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Odd's fantasy and Hervé's remark",
                "Start pigging out"
            ],
            "content":"<div class=\"\"><div> <span>Ulrich walked with Kiwi and Odd when Ulrich's stomach growled as it never had before.<br>\r\nHe grabbed a drink of coke and had a little drink but was still hungry. Ulrich headed over to the vending machine and grabbed a bag of chips. He started chowing down on them immediately. Odd laughed at the hungry Ulrich but noticed something about Ulrich. He noticed Ulrich's belly while he munched on the chips. Ulrich always had the best body in school due to his athletic's practise. However over the past few months he used most of his time in his room watching TV than in the practise. This new life wasn't good for Ulrich's body.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507038,
            "title":"takes Kiwii for a walk and has a snack"
        },
        "11211":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "2 wekks later still eating"
            ],
            "content":"<div class=\"\"><div> <span>Odd looked him thinking at Ulrich's jeans looked very tight around the waist. Ulrich's belly had thicken alot into a large bulging belly. He actually kind of liked it. <br>\r\n<br>\r\nUlrich had finished up the chips and approched Odd. As they hugged, Sissi and Hervé soon approched. <br>\r\n<br>\r\nHrvé said \"Nice gut, Ulrich!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507041,
            "title":"Odd's fantasy and Hervé's remark"
        },
        "12":{
            "author_id":"archerman",
            "author_name":"d",
            "choices":[
                "He's tired of being skinny....",
                "Xana attack....",
                "Super Computer Srewup(wg in virtual world)",
                "Bet with Ulrich...",
                "Readers Choice..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>           <br>\r\n<br>\r\n            Why will he gain?</span></div></span></div>",
            "created":1176526800,
            "id":398761,
            "title":"Why?"
        },
        "122":{
            "author_id":"archerman",
            "author_name":"d",
            "choices":[
                "A bigger Jeremy walks in....",
                "A shadowy figure zaps both boys..."
            ],
            "content":"<div class=\"\"><div> <span>    It had been a very dull day for Odd. He had decided to skip classes for the day and Ulrich did the same. The two had basically ate,talked,and watched T.V. all day.<br>\r\n       <br>\r\n        Odd was in great shape and showed it off by wearing tight clothes.Ulrich had put on a couple of pounds but you couldn't tell as long as he had his shirt on.....which he had taken off because it was hot and the boys AC was busted. <br>\r\n<br>\r\n       They were talking and watching the tube when suddenly.........</span></div></div>",
            "created":1176526800,
            "id":398763,
            "title":"The Attack"
        },
        "1222":{
            "author_id":"reedj2003",
            "author_name":"Zion Crayson",
            "choices":[
                "The boys gain quickly",
                "The boys gain gradually (Slow Gain)",
                "Other (More choices here)"
            ],
            "content":"<div class=\"\"><div> <span>They were talking and watching TV when suddenly a dark figure appears from inside and zaps Ulrich and Odd.  As nothing happens immediately they just shrug it off as nothing major.  However, the boys would learn things aren't always as they seem, as something diabolical (and/or exciting) was about to happen...</span></div></div>",
            "created":1203656400,
            "id":501316,
            "title":"The Dark One Strikes..."
        },
        "12223":{
            "author_id":"reedj2003",
            "author_name":"Zion Crayson",
            "choices":[
                "Ulrich gains faster than Odd",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Seeking to mix things up?  Then here you go!</span></div></span></div>",
            "created":1203656400,
            "id":501317,
            "title":"Shall it be a mix?"
        },
        "122232":{
            "author_id":"reedj2003",
            "author_name":"Zion Crayson",
            "choices":[
                "Odd gains faster than Ulrich",
                "Other (Surprise Me)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another mix if you're not satisfied with the previous one...</span></div></span></div>",
            "created":1203656400,
            "id":501319,
            "title":"Another choice..."
        },
        "125":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "decided to finish up studying. ",
                "decided to get something to eat. "
            ],
            "content":"<div class=\"\"><div> <span>Odd was in the libaray studying for a test that he had coming up. He had to pass this test or he could get kicked off the athletic team. <br>\r\n<br>\r\nThen Ulrich came in reading a magazine and sit down next to Odd. <br>\r\n<br>\r\n\"Hey man, you ready for the test\" Ulrich asked.<br>\r\n<br>\r\n\"No, i'm in deep trouble, if i fail this test then i'm off the team\" Odd said angrily at himself.<br>\r\n<br>\r\n\"Just cheat\" Ulrich said.<br>\r\n<br>\r\n\"Man i can't, i want to get it the right way\" Odd said as Yumi came in with a bottle of water.<br>\r\n<br>\r\n\"Want a drink\" Yumi asked Ulrich. <br>\r\n<br>\r\n\"Yeah sure\" Ulrich said taking a drink.\"Ah good water, this will help my diet\" .<br>\r\n<br>\r\n\"Yeah man, you've gained some weight in the past month\" Odd to Ulrich.<br>\r\n<br>\r\n\"9 pounds\" Ulrich said.<br>\r\n<br>\r\n\"The coach is going to kill you\" Odd warned.<br>\r\n<br>\r\nUlrich drank some more of the water and then got up.<br>\r\n<br>\r\n\"That's why i'm on a diet, i've already lost 3 pounds\" Troy said taking anthor drink.<br>\r\n<br>\r\nUlrich and Yumi then left and Odd.....<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507047,
            "title":"Studying"
        },
        "1251":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "One month later"
            ],
            "content":"<div class=\"\"><div> <span>Taking a deep breath as he closed his textbook, Odd tried to calm himself. <br>\r\n<br>\r\nHe had been studying for a while now, but Chemistry had never been one of his better subjects. In his opinion, it really didn't matter whether the abbreviation for Aluminum was Al or La. It was all basically the same junk anyway. <br>\r\n<br>\r\nAs he headed out of the library to return his books to his locker, Odd promised himself that he would try to study again later. Right now, it just wasn't working. <br>\r\n<br>\r\nOpening his locker, Odd was suddenly bombarded by a wave of papers as they flew past his face to gently flutter down onto the floor.<br>\r\n<br>\r\nOdd grimaced.<br>\r\n<br>\r\nThat was another thing he needed to add to his To Do List: Clean out his locker before whatever was growing inside became sentient enough to attack and/or devour him. <br>\r\n<br>\r\nReaching down to pick up the agressive papers, Odd frowned yet again. A few of them were flyers advertising past games, dances, school events and the like. The majority, however, were tests, papers, and assignments he had gotten back from his classes; all of them sporting less than stellar marks. <br>\r\n<br>\r\nAnd yet he had been managing to get by in his other classes, if only barely. Such was why it was imperative he passed his next Chemistry exam on Friday; in reality, his Chemistry Midterm. He had to get at least a high C on it if he wanted to stay in the team. <br>\r\n<br>\r\nGrumbling as he stuffed the offending papers back into his locker, Odd shoved thoughts of cleaning it and of Chemistry away. Glancing at one of the digital clocks that lined the hallway, Odd noticed that the period, a study period for himself, would soon be over and lunch would begin. <br>\r\n<br>\r\n'If I head to the cafeteria now, I'll proably be able to get a good spot in the line.' Odd thought to himself as he began to stroll towards Cadic Acadamy's cafeteria. <br>\r\n<br>\r\nBrightening up all of sudden, Odd remembered that today was also Tuesday, the cafeteria served fried chicken, one of his favorite dishes. <br>\r\n<br>\r\nAs if in response to his thoughts, Odds stomach growled and his pace quickened slightly. Patting it as if to assure it that it would soon be fed, Odd felt a spark of pride at the fact that athletic had kept his body in peak condition. <br>\r\n<br>\r\nWith barely an ounce of fat to be found, in fact, Odd would go as far to say that, if Ulrich was Cadic Acadamy 's king in the looks department, he would be first in line for succession of that throne. <br>\r\n<br>\r\n'And that may be sooner than he thinks!' Odd though and mentally chuckled as he remembered how Ulrich had put on nearly ten pounds in a month. <br>\r\n<br>\r\nTo be honest, Odd was curious as to what had facilitated Ulrich's recent weight gain. One would think that the Coach, would have monitered Ulrich's food intake and exercise at home. <br>\r\n<br>\r\nOf course, Ulrich had been a bit more active socially lately, going to parties and such, and he had been visiting Yumi's family a lot recently too. Of Japanese descent, or so Odd thought, Yumi's family probably had a good deal of rich recipes at their disposal. <br>\r\n<br>\r\nUlrich seemed to be handling the situation well, though, if he had really lost three pounds like he had said earlier. But honestly, Odd questioned that statement. <br>\r\n<br>\r\nAbout a week ago, he and Ulrich had went over to the community recreation center to shoot a few hoops in one of the indoor courts, since even in Califronia, the air had a chilly nip to it this time of year. As they both began to get rather hot after a few minutes, and the indoor courts tended to stay stuffy, they had decided to pull off their t-shirts to cool off. <br>\r\n<br>\r\nAnd as Ulrich swiveled around on the cement, his movements just a tad more sluggish than usual, Odd had noticed that his friend's abs had practically become invisible under a miniscule, yet noticeable, layer of fat. Additionally, as the team was changing back into their normal clothes after practice one day, Odd had noticed Ulrich having a bit of trouble buttoning his jeans. A problem his friend probably wouldn't have if the jeans he wore weren't fairly tight to begin with. Though Odd really shouldn't speak on that fact; he wore tight jeans himself. <br>\r\n<br>\r\nSimply put; it didn't look like Ulrich was losing weight, but then again, Odd was probably thinking too much into his friend's weight to begin with. <br>\r\n<br>\r\nPushing the doors to the cafeteria open, Odd caught sight of Ulrich sitting at their usual table with Yumi, vigorously tearing apart a chicken breast. Yumi, on Ulrich's left, was chuckling slightly at her boyfriend's appetite. <br>\r\n<br>\r\n'Or maybe not...' Odd thought to himself, his own stomach clawing at his insides as he got in line for some chicken of his own. <br>\r\n<br>\r\nOdd, who had been on the verge of sleep when the date of his Chemistry final had been told to the class, however, didn't realize that his Chemistry Midterm was actually tomorrow, instead of on Friday...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507050,
            "title":"The Melancholy of Odd Della Robbia "
        },
        "12511":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Eat ice cream",
                "Back to school on Monday"
            ],
            "content":"<div class=\"\"><div> <span>Glaring at the talk show currently on his television, Odd frowned and grabbed yet another handful of doritos and stuffing them into his mouth. Readjusting himself in the leather recliner in his living room, he began to channel surf once again.<br>\r\n<br>\r\nHe had never before felt so stupid in his life. <br>\r\n<br>\r\nHis Chemistry Midterm, which he had thought to have been on Friday of that week one month ago, had actually been on Wednesday.<br>\r\n<br>\r\nImagine his shock and horror as his Chemistry teacher had passed out the exam. He had spent fifteen minutes of the class just staring at the paper in outrgiht ramification. And while, once he managed to get over his shock, did try his utmost on the test, the result was inevitable. <br>\r\n<br>\r\nHe failed, coming only a few points short of passing. <br>\r\n<br>\r\nThough even if he had gotten those few extra points, the result would have only been a low D, a far cry away from the high C he had needed. <br>\r\n<br>\r\nAnd thus, while the Coach had despised having to do so, he had had to kick Odd off of the team.  <br>\r\n<br>\r\nWhat's worse, having been shaken up by his release from the team, Odd had been too despondent to properly stuady for the midterms in his other classes, garnering lackluster marks in the rest of his classes as well. <br>\r\n<br>\r\nDisgusted with himself, Odd had become more withdrawn, and began staying inside surfing the net, but mostly watching television on even the sunniest of Saturdays, though those were becoming more and more infrequent with the arrival of Winter and Christmas break.<br>\r\n<br>\r\nNow the holidays had come and gone, and Odd was loathe to return to school after the break of nearly a month on Monday, the day after tomorrow. <br>\r\n<br>\r\nRaising an eyebrow as he heard the doorbell ring, Odd sighed before heaving himseld up to go see who was disturbing him on such a wonderful day to b lazy. He wasn't exactly presentable in a crumb-covered tank top and his boxers, but oh well. <br>\r\n<br>\r\nLooking through the peephole in his front door, Odd found his visitor to be none other than Ulrich, clad in jeans and a light jacket appropriaye for the nippyness outside.<br>\r\n<br>\r\nOpening the door to let his friend in, Odd shivered as the cold air rushed in as well, wrapping itself around his bare legs. <br>\r\n<br>\r\n\"Hey Ulrich.\" Odd muttered boredly as he quickly shut the door, \"What brings you here today? How'd your break go?\" <br>\r\n<br>\r\n\"Nothing really, my break went well. Just though I'd drop by. Thought you might wanna run or jump?\" Ulrich asked as he walked over to find a seat on the leather sofa in the room, brushing away a few plastic twinkies wrappers in doing so. <br>\r\n<br>\r\nOdd snorted. <br>\r\n<br>\r\n\"Why would I want to shoot some hoops? I'm not on team.\" Odd said, as Ulrich sighed. \"We've been over this Ulrich; I'm done with athletic.\"<br>\r\n<br>\r\n\" But you were managing before! You do bad on one Chemistry test and you fall apart!\" Ulrich attempted, \"You could still make it back onto the team if you applied yourself.\"<br>\r\n<br>\r\nOdd shrugged.<br>\r\n<br>\r\n\"I don't know so much about that. I failed that midterm hardcore. I'd have to make an A in Chemistry from now on to get the high C average to play on the team.\" Odd reasoned, flopping back down into his recliner and returning to munching his chips, \"And that's just not gonna happen.\"<br>\r\n<br>\r\n\"Well...you could get a tutor or something! How about Jeremy, or Yumi. Any of them would help you if you asked.\" Ulrich fired back. <br>\r\n<br>\r\n\"Yeah, right.\"<br>\r\n<br>\r\nSighing dejectedly, Odd held his face in his hands. <br>\r\n<br>\r\n\"I'm only trying to help, man.\" Ulrich said after a pause, \"I mean, look at yourself! You're wasting away!\" <br>\r\n<br>\r\nUlrich got up from his spot on the sofa to yank his friend up out of the recliner he was cradled in to guide him over to a mirror hung on one of the walls and then fluidly pulled Odd's tank top over his head and off. <br>\r\n<br>\r\n\"And by wasting away I mean getting fat.\" Ulrich remarked as he gave his friend's stomach a few good pats.<br>\r\n<br>\r\nOdd sighed as he looked at his reflection in the mirror. It wasn't as if he didn't know. <br>\r\n<br>\r\nOdd's less active lifestyle following his departure from the athletic team, in addition to the fattening foods that had been around him over the holidays, hadn't been good for Odd's body.<br>\r\n<br>\r\nIn fact, Odd had noted one morning as he stepped onto the scales after his shower, he had even outmatched Ulrich; his friend had gained nine pounds in a month, whereas Odd's body had seen an amazing fifteen pound growth. <br>\r\n<br>\r\nLooking at himself in the mirror, Odd saw for the first time what those fifteen pounds had done to him. His arms and legs, once contoured, now appeared slightly flabby, only vestiges of the muscles that were once there. His face, one angled, not had a bit of a puffed look to it, and Odd had discovered one morning that, if he tilted his face a certain way, he had a double chin, if only a slight one.<br>\r\n<br>\r\nUlrich turned Odd so the two then were able to see a side profile, and Odd grimaced.<br>\r\n<br>\r\nHis rear had grown as well, straining the fabric of his boxers where the fabric had once hung loosely. Odd had already abandoned the underwear that had been snug on him to begin with as he knew, now, they would be uncomfortably tight.<br>\r\n<br>\r\nAnd of course, their was his stomach. His abs, which he had bragged of only a month prior, had vanished. Now they would only appear if Odd tried his utmost when flexing. In their place, a wall of fat threatened to cascade over his boxers; Chad was on the verge of developing a beginner's belly.<br>\r\n<br>\r\nShrugging Ulrich off, Odd gave his friend a reproachful look.<br>\r\n<br>\r\n\"At least I don't need a bra yet.\" Odd muttered somehwat sarcastically, \"And you're one to lecture somebody about their weight.\" <br>\r\n<br>\r\nBefore Ulrich could stop him, Odd had lifted up the bottom of Ulrich's shirt, clicking his tongue at the layer of fat that pushed over Ulrich's jeans slightly. <br>\r\n<br>\r\n\"So what happened to your diet, Ulrich?\" Odd asked cunningly, noticing that his friend seemed to be in a new pair of jeans as well.<br>\r\n<br>\r\nUlrich had continued to talk about his diet for the remainder over the past month, but as Odd expected, no one had seen any pounds melting away. And yet, after Odd had been kicked off of the team, that issue becoming the top priority for their circle of friends, Ulrich had talked about his diet less and less. Apparently, it had been put onto the back burner. <br>\r\n<br>\r\n\"I'm working on it...\" Ulrich muttered agitated, pulling his shirt back down, \"Yumi's grandmother is the best cook you'll ever meet. And the woman won't let you leave the table without having seconds, and prefers it if you have thirds!\"<br>\r\n<br>\r\nOdd raised his eyebrows.<br>\r\n<br>\r\n\"And how exactly is Yumi not the size of an elephant?\" he asked. <br>\r\n<br>\r\nUlrich shrugged.<br>\r\n<br>\r\n\"Girls. You know how they are about watching what they eat. You should see her uncle - he's humongous.\" Ulrich replied with wide eyes as Odd returned to his recliner for the second time. <br>\r\n<br>\r\n\"Heh. Well, good luck with THAT then. Being surrounded by rich dishes all the time must be why you're putting on the pounds. I noticed you're wearing new jeans. Move up to size 34's?\" Odd taunted, offering Ulrich some chips as the brunette returned to his seat on the sofa. <br>\r\n<br>\r\nSurprising Odd by taking a generous handful, Ulrich frowned. <br>\r\n<br>\r\n\"You noticed huh? My 32s were constricting me just a bit too much for my liking these days.\" Ulrich offered, \"But you're bound to have moved up a size too there, Shamoo.\" <br>\r\n<br>\r\nOdd reached over to take a drink from a soda sitting on an end table next to his recliner before replying.<br>\r\n<br>\r\n\"Ahh...good stuff...and probably, yeah. Except I've been at home ever since the break started, so I've just been walking around in my underwear.\" Odd said as Ulrich made a face. <br>\r\n<br>\r\n\"Dude, gross.\" Ulrich said, shuddering slightly, \"But seriously though, what are we going to do? We're both getting fat.\"<br>\r\n<br>\r\nOdd shrugged and nodded.<br>\r\n<br>\r\n\"Yep. We're not exactly svelte anymore.\" <br>\r\n<br>\r\n\"And here I thought I wouldn't be getting fat until my thirties...\" Ulrich said with a sigh.<br>\r\n<br>\r\n\"Hey. You're still on the team, at least.\" Odd replied.<br>\r\n<br>\r\n\"Yes, but you're not having at least two portions of rich food shoved down your throat every time you go visit your girlfriend, are you?\" <br>\r\n<br>\r\nOdd's shoulders slumped. <br>\r\n<br>\r\n\"I don't have a girlfriend at the moment, so no.\" Chad said morosely.<br>\r\n<br>\r\n\"Why?\" Ulrich asked, slightly surprised. <br>\r\n<br>\r\nOdd shook his head. <br>\r\n<br>\r\n\"I WAS too devoted to basketball.\" Odd said blandly, crumbling up the chip bag and getting up as the last of the chips entered his mouth. \"I think I'll have some ice cream now. Want some?\" <br>\r\n<br>\r\nUlrich could only shake his head sadly, but found himself saying yes anyway. Ice cream sounded good right now. <br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507055,
            "title":"One month later"
        },
        "125111":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Next Monday"
            ],
            "content":"<div class=\"\"><div> <span>As Odd and Ulrich walked through the front entrance to the Mega Mall, Odd immediately stopped dead in his tracks. His eyes staring at a poster advertising a new bakery. It featured a ginormous slice of triple chocolate layer cake drowned in hot fudge and topped off with a castle of whipped cream, a cherry on top, and two scoops of vanilla ice cream on the side: <br>\r\n<br>\r\n\"Come try the new, mouthwatering Triple Chocolate Monster,\" it read. Odd began drooling over this delicious dessert and Ulrich pulled him away from the side.<br>\r\n<br>\r\n\"Odd hungry,\" Odd said in a caveman-like voice.<br>\r\n<br>\r\n\"No, seriously? Because me too!\" Ulrich said.<br>\r\n<br>\r\n\"Let's go. We have to try it.\"<br>\r\n<br>\r\nOdd set off for the store, located just around the corner and a few shops down. The moment they entered the store, he ran up to the counter and asked, <br>\r\n<br>\r\n\"Can I get a Triple Chocolate Monster?\"<br>\r\n<br>\r\nUlrich joined Odd at the front counter.<br>\r\n<br>\r\n\"Make it two Triple Chocolate Monsters,\" Ulrich told the rotund baker.<br>\r\n<br>\r\n\"Two!?\" the man questioned them again.<br>\r\n<br>\r\n\"Yes, two,\" Ulrich told him slowly, holding up two fingers.<br>\r\n<br>\r\n\"Ok, that'll be $13.45.\"<br>\r\n<br>\r\nOdd took out a ten and Ulrich took out a pile of coins and laid them on the counter. He began to count them, but Odd gave him a look and Ulrich stopped.<br>\r\n<br>\r\n\"I'll just pay,\" Odd told him, taking out four ones. The baker kindly, yet slightly confused, accepted the money and handed Odd the change.<br>\r\n<br>\r\n\"Thanks,\" Ulrich said.<br>\r\n<br>\r\nFive minutes later, the man returned to the counter with two very large pieces of cake drowned in fudge and whip cream, each with a neatly placed cherry on the top of each.<br>\r\n<br>\r\n\"Thank you,\" Odd told the man, and they both sat down at a table for two with their desserts. Immediately, they dug in.<br>\r\n<br>\r\nThe moment the chocolate touched Odd's taste buds, he was in heaven. In fifteen minutes, Ulrich and Odd were both finished with their morning desserts. Their stomachs were bloated. <br>\r\n<br>\r\n\"A Triple Chocolate Monster,\" Odd said, beginning to stand up. \"Are you feeling alright?\"<br>\r\n<br>\r\nUlrich replied with a loud burp and then, <br>\r\n<br>\r\n\"Are you kidding? I'm having the time of my life! I've never splurged like that before! I never knew eating junk food would be so much fun! <br>\r\n</span></div></div>",
            "created":1205337420,
            "id":507954,
            "title":"Ice cream"
        },
        "1252":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "5 pounds",
                "10 pounds"
            ],
            "content":"<div class=\"\"><div> <span>Odd decided to go get something to eat. Odd wanted something small because Ulrich wasn't the only one who had gained weight. Odd decided to stop in the bathroom on his way to the cafteria. He stood in front of the mirror and lifted up his shirt, showing 2 inches of fat hanging over his pants. He patted his belly as he looked at it. <br>\r\n<br>\r\n\"I must have gained 15 pounds over the past months\" He said upset.<br>\r\n<br>\r\nJeremy then came into the bathroom, he had also gained weight over the past few months.<br>\r\n<br>\r\nJeremy had gained...</span></div></div>",
            "created":1205038800,
            "id":507111,
            "title":"Odd fatter"
        },
        "12521":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Jeremy",
                "Cafeteria"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy had only gained 5 pounds over the past few months. Jeremy was talking on the phone as he entered the bathroom. He soon finished talking and turned to Odd. <br>\r\n<br>\r\n\"Oh hi Odd, so i see that someone been slacking off on his exercise\" Jeremy said.<br>\r\n<br>\r\n\"Whatever\" Odd said in an angry way.<br>\r\n<br>\r\n\"What, i was talking about Ulrich\" Jeremy said.<br>\r\n<br>\r\n\"Oh yeah, he has\" Odd said relived \"Well I got to go, see ya Jeremy\" <br>\r\n<br>\r\n\"Odd , could you come in my room after school please?\" asked Jeremy.<br>\r\n<br>\r\n\"Yeah!\"<br>\r\n<br>\r\nOdd left the bathroom and headed down the hallway.<br>\r\n</span></div></div>",
            "created":1205038800,
            "id":507114,
            "title":"5 pounds"
        },
        "13":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Next day",
                "Another burgers for him"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy and Aielita had arrived at Mcdonalds to eat. All she wanted was a salad and a diet coke. Jeremy though got a big mac, large fries, and a large coke. <br>\r\n<br>\r\n\"Jezz Jeremy stop eating so much\" Aielita said as Jeremy stopped to get ketchup. <br>\r\n<br>\r\n\"Whatever\" he said as they headed toward a seat.<br>\r\n<br>\r\nAs they are eating, they decide to read the list of the classification of the class<br>\r\n<br>\r\n\"Lets hope this is it Jeremy\" said Aielita as she crossed her fingers.<br>\r\n<br>\r\nThey read it together and Aielita <br>\r\n<br>\r\n \"I'm the 1st for the girls\" Aielita said to Jeremy who was still a the top of the page. He saw his name next Ulrich and Odd!! It was impossible!!<br>\r\n<br>\r\n\"How could I be after them ?!\" said Jeremy who look like he's about to cry. <br>\r\n<br>\r\n\"Jeremy I'm sorry\" Said Aielita. <br>\r\n<br>\r\nJeremy started eating his burger without stopping. Then he started on the chips. He ate it all in about 2 minutes. He went to the register and ordered 3 burgers and 5 large chips. <br>\r\n<br>\r\n\"Jeremy stop eating, or you'll get fat\" Said Aielita.<br>\r\n<br>\r\n \"But I can't stop eating\" Replied Jeremy.</span></div></div>",
            "created":1205038800,
            "id":507134,
            "title":"Bad news for Jeremy"
        },
        "131":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Afterschool",
                "Next day"
            ],
            "content":"<div class=\"\"><div> <span>The next day, Odd was ready to go to school but had to wait for his friend Jeremy. <br>\r\n<br>\r\n\"Come on or we'll be late\" shouted Odd. <br>\r\n<br>\r\nThere was no answer so he decided to go see what was keeping Jeremy so long. He walked into his room and saw's him eating a large piece of chocalate cake. He was sat with his knees crossed on the bet with a piece of paper infront of him which had more cake on it.<br>\r\n<br>\r\n\"What are you doing?\" asked Odd. <br>\r\n<br>\r\nHe looked at him with a sad face and chocalate all around his mouth. <br>\r\n<br>\r\n\"I don't feel like going to school today\" replied Jeremy. <br>\r\n<br>\r\nOdd knew this was because of his depression over the bad classification. Nobody had no idea Jeremy planned of staying in his bedroom. Odd thought of what would happen if he fattened up his friend Jeremy. He ran to the closest shop and bought lots of fatty junk food. He ran back home an put all the food in Jeremy's room. <br>\r\n<br>\r\n\"What is this for?\" asked Jeremy. <br>\r\n<br>\r\n\"I thought you might get hungry during the day so I got you lots of food.\" <br>\r\n<br>\r\nJeremy walked over to the food and had a closer look. He was wearing pajama's that were mean to be very baggy. However Jeremy's thighs were slightly stretching the bottoms out an the top is now tucked around his belly. Odd told him that he'll just said to the teachers, he was ill. He went to school and Jeremy wa alone in his bedroom with a large suply of food.<br>\r\n</span></div></div>",
            "created":1205125200,
            "id":507372,
            "title":"Bunking off school"
        },
        "1311":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Jeremy decides to fatten up Odd along with himself "
            ],
            "content":"<div class=\"\"><div> <span>Jeremy continued to gorge and brood over this horrible classification. Then he thought about Odd who was before him, who was better than him on this stupid list. This just wasn't fair. And he was slim, he had a great body. If he was fat too his life wouldn't be so bad. At least he would have a fat friend and they could be losers together.</span></div></div>",
            "created":1205125200,
            "id":507377,
            "title":"Jeremy Broods"
        },
        "13111":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "And yet it does get much better! ",
                "Suddenly it all gets worse. "
            ],
            "content":"<div class=\"\"><div> <span>He then walked in his room clad only in his tightie-whities. Jeremy went with his bloated belly giggling along the way laid down on the couch and flipped on the television.<br>\r\n<br>\r\n\"Ahh....This is the life...\" said Jeremy. Then he heard his stomach give off a loud groan. It had been at least an hour since breakfast, and now he was hungry again. He though to himself that he could always get something from the food that Odd bought.<br>\r\n<br>\r\nAt this point in time Jeremy's agenda was 'be lazy' and 'get something to eat'. <br>\r\n<br>\r\nJeremy looked around he laid his eyes on the inviting and vulnerable fridge. So, to comply and meet both of his needs he figured he would participate in a simple yet satisfying fridge raid. <br>\r\n<br>\r\n15 minutes later Jeremy was sitting on his butt in the middle of the floor with a donut in one hand and a cheeseburger in the other. The fridge door was wide open and the cold air was blowing through Jeremy's golden hair.<br>\r\n<br>\r\n\"Wow, I don't think things could get much better than this!\" He thought. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1205211600,
            "id":507695,
            "title":"Living the life"
        },
        "131111":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Chocolate milk",
                "Chocolate Sundae"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy finished off all of the food in his hands. As he was searching through the selves, he notices a three-pack of chocolate syrup that his fiend, Odd, had bought a few hours ago.<br>\r\n<br>\r\n\"Sweet!\" yelled Jeremy.<br>\r\n<br>\r\nHe then ripped off the cap of one of the bottles. Jeremy held the bottle over his head and began squezzing the syrup into his mouth with both hands. This went on for a few minutes. Every once in a while his hand would slip and cause a stream of chocolate to run from his mouth, down his bare chest and stopped on his rounded stomach.<br>\r\n<br>\r\nOnce he was done, he grabbed the second bottle of syrup. Instead of pouring into his mouth, he instead started sucking on it like a bottle. With his free hand, he rubbed his distended stomach, smearing the chocolate all over his belly. Jeremy finished the bottle with a sigh.<br>\r\n<br>\r\nHe was about to grab the last bottle when he noticed that there was a gallon of milk it in the fridge.<br>\r\n<br>\r\n\"I could always make that into chocolate milk...\" But then he opened the freezer door and found a cartion of ice cream. \"But then again I could always make that into an ice cream sundae....\"<br>\r\n</span></div></div>",
            "created":1205211600,
            "id":507697,
            "title":"The Sweet Life"
        },
        "1311111":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "He felt sick",
                "He wanted to get cleaned up"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy decided that he wanted to make some chocolate milk. He grabbed the gallon of whole milk, poured in the enitre bottle of chocolate syrup, and shook it up. After a minute, it was ready. Jeremy began to chug the chocolate milk. A few minutes later, the entire gallon was gone. Jeremy felt stuffed like he never had in he entire life. He looked down at his belly, it was so large that he can hardly see his toes. <br>\r\n<br>\r\nJeremy then felt very tired. He closed the fridge door and laid down on the kitchen floor, rubbing his belly until he fell asleep.<br>\r\n</span></div></div>",
            "created":1205211600,
            "id":507699,
            "title":"Chugging"
        },
        "13111112":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Jeremy gets hungry again",
                "Odd walks in"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy awoke a few hours later. The first thing that he did was rub his still bloated belly. He noticed that his belly was sticky due to the chocolate syrup that he drank some time ago. <br>\r\n<br>\r\n\"I better go get myself cleaned up...\" Jeremy though. <br>\r\n<br>\r\nHe was lying on his back, and tried to get up by sitting up. His chunky belly make it very hard for him to move. So instead he rolled onto his belly and pushed himself up. As he was doing this, he heard several fibers in his underware goan due to the pressure his butt was producing. <br>\r\n<br>\r\nOnce he was up, he walked over to the bathroom and started to run a bath.<br>\r\n<br>\r\n\"There's nothing better than a hot bath...\" he though. <br>\r\n<br>\r\nBut then he got and idea. He pulled the container of ice cream out of the freezer, grabbed a spoon out of the drawer, and took it back into the bathroom.<br>\r\n<br>\r\nZack pulled his briefs off his widening waist and past his thickening thighs. He tossed them on the floor and slipped into the bathtub. He then grabbed the ice cream and started eating.<br>\r\n</span></div></div>",
            "created":1205211600,
            "id":507700,
            "title":"Better than a Bubble Bath"
        },
        "131111122":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Give in",
                "Resit temptation"
            ],
            "content":"<div class=\"\"><div> <span>After Jeremy had been soaking in the bath tub eating ice cream, he saw the door swing open. Odd let out a small yelp at the surprise at seeing his brother in the tub, however Jeremy hardly noticed. <br>\r\n<br>\r\n\"What are you doing?\" asked Odd.<br>\r\n<br>\r\n\"I'm eating ice cream in the bathtub.\"<br>\r\n<br>\r\n\"Is that what you did all day today? Sit on your bubble butt and stuff you face while watching cartoons?\"<br>\r\n<br>\r\n\"That's not true,\" replied Jeremy, scooping out a large chunk of ice cream. <br>\r\n<br>\r\n'Oh...right.\" said Odd. \"Oh yeah, I have something to give you.\" Odd handed Jeremy a package wrapped in pink tissue paper.<br>\r\n<br>\r\nJeremy ripped it open to find ten candy bars. <br>\r\n<br>\r\n\"Great!\" he said, \"I was out of ice cream...\" <br>\r\n<br>\r\nHe then put his spoon into the empty ice cream container and sent it floating around the bath tub. He then unwrapped two of the candy bars and started eating them, one in each hand.<br>\r\n<br>\r\n\"You're a pig...\" said Odd, eyenig the floating container.<br>\r\n<br>\r\n\"A pig with candy bars...\" said Jeremy, taking a couple of bites.<br>\r\n<br>\r\n\"You know, if you keep eating, you'll be the fat !\"<br>\r\n<br>\r\n\"Yeah, so you might just bloat up any day now.''<br>\r\n<br>\r\n\"No way.\" Odd said, slightly disgusted.<br>\r\n<br>\r\n\"I can see it,\" began Jeremy, \"You really want one of these delicous candy bars...\" He then picked up one of the candy bars and begam waving it in front of Odd. \"I know you want it....\"<br>\r\n</span></div></div>",
            "created":1205266260,
            "id":507701,
            "title":"Ice Cream, Candy Bars"
        },
        "1311111221":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Odd agrees to the plan ",
                "Odd disagrees to the plan"
            ],
            "content":"<div class=\"\"><div> <span>Odd decides to give in and takes the candy bar. He unwrapped the chocolate and stuffed it into his mouth. Jeremy gave him four more and within in five minutes both Jeremy and Odd had finished their candy.<br>\r\n<br>\r\n\"Is there any food left in the fridge?\" asked Odd. <br>\r\n<br>\r\nThere might be some snacks left in there. As Odd headed off to the bedroom Jeremy got out off the tub and dried off. <br>\r\n<br>\r\nHaving eaten so much Jeremy's gut was hanging over his boxers as he came out of the bathroom and as he walked it started to jiggle.<br>\r\n<br>\r\n\"I think I need some new shorts because none of my old ones fit anymore.\"<br>\r\n<br>\r\n\"There might be a pair of shorts in my closet that were too big,\" said Odd.<br>\r\n<br>\r\nJeremy made his way to the closet and found the shorts. As he buttoned up the shorts Odd asked if they fit. <br>\r\n<br>\r\n\"Yeah but they're really tight!,\" said Jeremy.<br>\r\n<br>\r\nOdd said, \"Jeremy, you start get fat.\" <br>\r\n<br>\r\n\"That's why I can help you get fat like I am,\" said Jeremy.</span></div></div>",
            "created":1205266620,
            "id":507702,
            "title":"Good Candy"
        },
        "13111112211":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Odd  likes gaining! Gain more!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I guess that'll be easier than to try to make you lose weight\" Odd replied reluctantly<br>\r\n<br>\r\n\"That's the spirit! Now wait here!\" Jeremy said as he waddled out of the room, a few minutes later, he came back with many boxes of Donuts.<br>\r\n<br>\r\n\"Let's get started!\" Jeremy said \"Now get into the bathtub\" he ordered<br>\r\n<br>\r\n\"Why?\" Odd asked<br>\r\n<br>\r\n\"Because it was either put you in the bathtub or tie you up with rope, and since I have no rope, get in that bathtub!\" Jeremy ordered<br>\r\n<br>\r\n\"Ok, Ok, if it will make you shut up!\" Odd snapped as he went into the bathroom, stripped off his clothes and jumped into the bathtub.<br>\r\n<br>\r\nJeremy came in with two boxes of donuts and a funnel<br>\r\n<br>\r\n\"Jeremy, I hope your not going to do what I think you're going to do\" Odd warned but it was too late, Jeremy stuffed the funnel down Odd's mouth and started to fit donuts down the funnel, one by one.<br>\r\n<br>\r\n\"This is the best idea I've ever had!\" Jeremy said as he already emptied the first box.<br>\r\n<br>\r\nUnlike Jeremy, Odd's small stomach wasn't able to binge yet, so he was already full. He rubbed his swollen belly subconciously and groaned with pain.<br>\r\n<br>\r\nJeremy lifted up the second box and saw Odd's delema. He thought for a moment and realised that warm water can help expand Odd's belly.<br>\r\n<br>\r\n\"Odd, I've got an idea! Put your mouth to the faucet!\" Jeremy ordered<br>\r\n<br>\r\nOdd didn't know what was going on, but he took the funnel out, and put his mouth to the bathtub faucet. Suddenly, Jeremy turned the warm water on high, and Odd starts panicking.<br>\r\n<br>\r\n\"MMwaht mmmare mmyou doingmm??\" Odd mummbled<br>\r\n<br>\r\n\"Don't be a baby, look, it's already working!\" Jeremy exclaimed as he watched Odd's belly continue to expand. He put one hand on Odd's belly, and realised how soft it was.<br>\r\n<br>\r\n\"Whoa! You got to check this out! It's so bouncy!\" Jeremy said as he turned his head toward Odd. Then suddenly, he remembered that the water was still on! He quickly turned off the water so Odd can breath.<br>\r\n<br>\r\n\"Aw man, I'm really sorry! I forgot the water was still on!\" Jeremy apologised<br>\r\n<br>\r\nBut all Cody could do was pant and rub his belly, which now looked like a beach ball. </span></div></div>",
            "created":1205267340,
            "id":507705,
            "title":"Odd agrees to the plan"
        },
        "132":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "Met up with Ulrich",
                "Met up with Yumi"
            ],
            "content":"<div class=\"\"><div> <span>He ate  other Bic Mac after that.<br>\r\n<br>\r\nAfter they get done eating they headed school. At the school Jeremy headed up stairs and admired his face in the mirror. <br>\r\n<br>\r\n\"After your done looking at your self, want to come to the gym with me\" Odd asked.<br>\r\n<br>\r\n\"Yeah maybe, when you leaving\" Jeremy said to his friend. He did his final pose and then turned to him.<br>\r\n<br>\r\n\"Well i need to put on my gym clothes,\" Odd said as Jeremy smiled.<br>\r\n<br>\r\n\"Sure OK\" Jeremy said.<br>\r\n<br>\r\nOdd went to get dressed as Jeremy got his sunglasses and some money. He headed downstairs to see his friends sitting in the cafeteria. <br>\r\n<br>\r\n\"Where you going\" Hervé said to him.<br>\r\n<br>\r\n\"To the gym to keep this sculpted body ripped\"  Jeremy said as Hervé laughed.<br>\r\n<br>\r\n\"What\" Jeremy asked as he sat down and ate some of the food that was on the table. <br>\r\n<br>\r\n\"Nothing, it's just you like food to much to have a sculpted body\" Hervé said poking Jeremy gut.<br>\r\n<br>\r\n\"Well i have been eating a little more than I should be lately\" Jeremy said blushing.<br>\r\n<br>\r\n\"Yeah you should be going to Fat Camp\" Odd teased as he entered in the cafeteria.<br>\r\n<br>\r\n\"Whatever, well see ya, were going\" Jeremy said as they went to the gym. <br>\r\n<br>\r\nWhen they both arrived at the gym they saw very sculpted built people and Jeremy felt a little embrassed by his bigger paunch. It jiggled as he made his way to the treadmill.<br>\r\n</span></div></div>",
            "created":1205125200,
            "id":507382,
            "title":"Sculpted or Not"
        },
        "1321":{
            "author_id":"charloof15",
            "author_name":"charlo",
            "choices":[
                "The Bet"
            ],
            "content":"<div class=\"\"><div> <span>Jeremy heard a familiar voice, it's was Ulrich. Jeremy didn't know that he was here. Ulrich was with his girlfriend Yumi. On the treadmill...they were working out when Ulrich lifted his shirt to wipe the sweat off his face...Ulrich had a flat tight stomach while Jeremy was round and pudgy...then he said :<br>\r\n<br>\r\n\" Guys, tell the truth. Have I gained weight\" and lifted his shirt.His belly was soft and round. Yumi felt it and said :<br>\r\n<br>\r\n\" Yeah you have,but its cute.\"<br>\r\n<br>\r\n'Hey Jeremy' said Ulrich 'been packing on a bit have ya?'<br>\r\n<br>\r\n\"Just a little. I could lose this weight no problem.\"<br>\r\n<br>\r\n\"Don't worry i've gained a little weight aswell.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1205125200,
            "id":507386,
            "title":"Met up with a bigger Ulrich at the gym"
        },
        "14":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "The kids do it",
                "he pigs out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jim is gonna get huge but first you gotta decide how</span></div></span></div>",
            "created":1208824140,
            "id":522694,
            "title":"Jim"
        },
        "141":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "They stopafter awhile",
                "They let him explode",
                "Jim gets tickled"
            ],
            "content":"<div class=\"\"><div> <span>Jim finally had them. He watched the last one, who was Jeremy, scramble down the sewers he thought about his next move. After deciding to follow them down, he  notices a bit of a squeeze between his abdomen and the edge. But thinks nothing of it and continues down the long tunnel. At the end, he glances around looking for Jeremy, but he is nowhere to be seen.<br>\r\n\"Hello Jimbo,\" a voice said behind him. Jim turned and  immediately Odd and Ulrich are pinning his arms down with Yumi struggling with his thrashing legs. After a tousle, Jim is unable to move. The kids carry him over to a bench, where Jeremy ties Jim's arms behind him under the bench. Jim, who is now gagged, tries yelling as His feet are bound together. \"Jim,\" started Yumi, \"You fell for it\" Jim's angry face became confused. \"We tricked you into following us so we could capture you. We were tired of you sneaking around and decided to make sure you would be quiet.\"<br>\r\n\"NEVER!\" Jim countered through his gag.<br>\r\n\"Very well,\" Odd cooed from the corner, \"Guess we'll have to do it our way.\" Jim turned his Ulrich wheeling a large tank over towards him.<br>\r\n\"Well if your gonna squeal we gotta make sure you can never leave this building.\"<br>\r\nJim's gag was removed and a long tube was feed down his throat. He struggled, but it was useless.<br>\r\nYumi taunted him, \"Noticed you could hardly fit down here with that beer belly of yours, so we're gonna pump it up so you can't fit.\"<br>\r\nJim was frantic now, Ulrich flipped a switch and Odd turned a valve and they all watched as their gym teacher's red zip up shirt strained even more than it had before. Jeremy patted Jim's spherical belly and laughed.<br>\r\n\"See you son Jumbo Jimbo!\"</span></div></div>",
            "created":1209068580,
            "id":523644,
            "title":"The kids do it"
        },
        "1411":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "Jim tries to escape",
                "Jim gets blimped again",
                "Jim turns the tables"
            ],
            "content":"<div class=\"\"><div> <span>After a laugh at their expanding gym teacher the kids unstrap Jim.<br>\r\n\"I'm gonna kill ya,\" he bellows lurching at Jeremy. Jeremy easily side steps sending the bloated Jim flying onto the floor on his pudding inflated gut. \"Ooooooooooooh,\" he moans as the pressure of his packet gut sack combined with the force of hitting the floor added up. The kids laughed cruelly and climbed up the ladder.<br>\r\n\"We'll be back to feed ya Jim,\" Odd assured before slapping his balloon of a teachers belly, which jiggled in response. Jim moaned again in pain.</span></div></div>",
            "created":1209154500,
            "id":524025,
            "title":"Jumbo Jimbo"
        },
        "14111":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "The kids come back and fin him",
                "somebody else finds him"
            ],
            "content":"<div class=\"\"><div> <span>Jim looked up the ladder to his freedom. How stupid were the kids holding him. He could easily just climb out and escape. He Put one hand on the railing and stepped up with his first foot. He turned and went to put his left hand on the railing, but his big red belly bounced off the ladder before his hand could make it. Jim attempted to maneuver around his gut and finally managed to get both hands off the ladder, his belly pressed into it, but he was on the road to freedom. After a tiring climb, Jim removed the sewer cover and proceeded to climb out. But, just as the kids told him it would his belly would not fit. He pushed and pulled but he could not get his belly out. His legs slipped off of the ladder, Jim braced himself for a big fall, but instead his belly held him. He was stuck in the ground, his belly wedged into a sewer access hold. Jim had nothing left to do but rest his scruffy head on his belly and dangle his feet now until somebody came to pry his gut out, plus he'd probably get pumped for trying to escape.</span></div></div>",
            "created":1209691440,
            "id":526823,
            "title":"Jimbo his gut and a pathetic escape attempt"
        },
        "141111":{
            "choices":[
                "more belly than he can see past",
                "someone rubbing his belly"
            ],
            "content":"<div class=\"\"><div> <span>Jim looks up to see Odd giggling and taunting him. \"gotta problem tubs\"<br>\r\n<br>\r\nHe then feels someone grab his ankle from below and pull him down. His belly slips free of it's comical hold and Jim quickly gets his foot on the ladder. Odd climbs down with him and he finds himself alone with Ulrich and Odd. <br>\r\n<br>\r\n\"Normally, treats are used as a reward,\" Ulrich taunts walking toward him with a cart full of ice cream and pie, \"but I'm sure this'll teach you a lesson.\" Before he knows it, Jim is pinned. Aielita begins to shovel pie into Jim's mouth. Odd slaps his belly and laughs as Jim expands before their eyes. Jim's eyes begin to water from the pressure. And then BURST!<br>\r\n<br>\r\nJim manages to get his arms away to feel his belly to see if he has popped. He then realizes that his jacket has finnally given out. His arms are quickly forced back down and tied this time.<br>\r\n<br>\r\n\"keep trying to get out and those sweat pants will bust faster than you know it.\"<br>\r\n<br>\r\n\"Please!\" Jim begged, \"I won't say a thing, just let me go!\"<br>\r\n<br>\r\nUlrich placed a hand on Jim's firm, stuffed gut. \"People are gonna wonder where you were and how this happened. And we are etter safe than sorry.\"<br>\r\n<br>\r\n\"PLEASE I'LL EVE-FOMNOMUGHNOMUGH\" Jim was interrupted with more food being forced into his taught body. He feels incredible pressure building up. The kids let up with the feeding after an hour. Jim is sweating and panting with exahustion. He then falls passes out, preparing to sleep off his unwanted feast, like a big fat bear in hibernation.</span></div></div>",
            "created":1275971700,
            "id":896207,
            "title":"The kids come back and fin him"
        },
        "14112":{
            "choices":[
                "Jim gets deflated (burping)",
                "Jim is left in blimp form"
            ],
            "content":"<div class=\"\"><div> <span>Jim slowly woke up. The restraints pulled him back down and he rembere the situation he was in. He then saw a long tube in his mouth. He looked up to see Yumi leaning against what was clearly a helium tank. Behind her was a pile of several more. She gave him an evil smile and turn the valve. Jim felt his mouth and throat fill up with air. He struggled to get his arms free but it was useless.<br>\r\n<br>\r\nJim gave up trying to escape once e felt the pressure his his belly. He looked up to see it rise like dough. His body suddenly felt lighter. Jim, while contemplating the odd sensation, felt Yumi untie his legs. He kicked around his feet but only managed to knock over the bench he was strapped to. Landing on his sore, inflating gut. It blew up bigger, pushing him and the bench to the side. The pressure in his belly got more and more intense, he tried to beg Yumi to stop but the tube only allowed muffled sounds.<br>\r\n<br>\r\nYumi cut the restraints from his arms. He went to pull the tube from his mouth, but his arms flew up, as did his legs. He was in the position of a person doing jumping jacks, legs parted and arms up and out, now unable to move any limbs.<br>\r\n<br>\r\nHe began to think to himself, \"how could this get any worse?\" when his shirt popped off. Jim then lifted off the ground. He was nothing but a fat, shirtless, helpless balloon who could do nothing but squirm a little bit.<br>\r\n<br>\r\nHis arms and legs all jutted out from his massive balloon belly, which was so big two people couldn't wrap their arms around him. Yumi finally stopped blowing him up and tied a rope around one of his big feet. She pulled him down lower and felt his taught belly. Jim could only moan in response.</span></div></div>",
            "created":1277828040,
            "id":908543,
            "title":"Jim gets blimped again"
        },
        "1412":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>no death remember</span></div></span></div>",
            "created":1209154080,
            "id":524022,
            "title":"oops"
        },
        "1413":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "Jim gets pumped again",
                "Jim tries to escape",
                "Jim's gets a bath"
            ],
            "content":"<div class=\"\"><div> <span>Odd pressed another button and Ulrich turned another valve as Yumi removed Jim's pudding tube. \"Uuuuuuuuhhhhhhhhhhggggggggg.\" He moaned rubbing his belly, which stuck out even more noticeably. Yumi, Ulrich, and Odd all had left when Jim remembered that Jeremy was still with him. Jeremy stood over Jim, who was still helplessly tied with his arms behind him and his legs together. Jeremy slapped it and laughed, \"So the gym teacher who has always called me out of shape now has a little paunch, NO, more of a paunch. Pretty funny eh?\"<br>\r\nJim shouted, \"It was enough to inflate me, now you have to humiliate me with my jumbo barrel belly?\"<br>\r\n\"Oh Jim, you don't think its funny?\" Jeremy removed Jim's large brown shoes.<br>\r\nJim watched, scared and curious. Jeremy placed a hand on each size 15 foot. Jim gasped.<br>\r\nJeremy started rubbing Jim's feet like a mad man. \"Is it funny now chunky?\", Jim thrashed, but he could barely move. After Jim's smelly feet, Jeremy moved up to Jim's arm pits. Jim tried to shout but only belly laughs emitted. Jeremy ran his finger under Jim's chin in a fast, tickling way. Jim couldn't stop. He was sweating uncontrollably and beginning to cry. \"YEAH, IT IS PRETTY FUNNY, HUH FATSO?\" Jim given the chance now to speak, only barked.<br>\r\n\"Let me outta here and I won't crush you.\"<br>\r\n\"With this?\" Jeremy stuck a finger in Jim's soft middle section. Jim's expression turned somehow even angrier, at least until Jeremy began aggressively poking his belly. Jim, who was laughing up a sweat again, was once again rendered helpless to the tickling. Upon leaving, Jeremy put the gag back on Jim, gave him a short little belly jiggle, and put Jim's shoes in his backpack. \"People are gonna be looking for you, so I'm tossing your stinkbug shoes in the river, maybe people will get the hint you're not going to be returning.</span></div></div>",
            "created":1209155760,
            "id":524031,
            "title":"Jim gets tickled"
        },
        "14132":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "Jim is caught by the kids",
                "Somebody else finds Jim"
            ],
            "content":"<div class=\"\"><div> <span>Jim looked up the ladder to his freedom. How stupid were the kids holding him. He could easily just climb out and escape. He Put one hand on the railing and stepped up with his first foot. He turned and went to put his left hand on the railing, but his big red belly bounced off the ladder before his hand could make it. Jim attempted to maneuver around his gut and finally managed to get both hands off the ladder, his belly pressed into it, but he was on the road to freedom. After a tiring climb, Jim removed the sewer cover and proceeded to climb out. But, just as the kids told him it would his belly would not fit. He pushed and pulled but he could not get his belly out. His legs slipped off of the ladder, Jim braced himself for a big fall, but instead his belly held him. He was stuck in the ground, his belly wedged into a sewer access hold. Jim had nothing left to do but rest his scruffy head on his belly and dangle his feet now until somebody came to pry his gut out, plus he'd probably get pumped for trying to escape.</span></div></div>",
            "created":1209841080,
            "id":527613,
            "title":"Jim tries to escape"
        },
        "14133":{
            "author_id":"tickleustomie",
            "author_name":"tickleustomie",
            "choices":[
                "A rotund gym teacher trying to escape",
                "Jim trying to pump himself up fatter"
            ],
            "content":"<div class=\"\"><div> <span>The next day, the lyoko heroes returned. \"Ugh,\" groaned Odd, \"What is that smell?\" All eyes turned to the sleeping Jim, who was still sweaty from Jeremy's tickle session and shoeless.<br>\r\n\"Well somebody's gotta hose em down,\" Yumi continued for Odd.<br>\r\nJim snored. Ulrich turned around to see all his friends touching their noses. \"Ugh.\"<br>\r\nJim work up, untied. Ulrich spoke to him abruptly, Jim, i gotta give you a bath, if you struggle or try to get away we're gonna have to pump you up again. Jim realized now that they we're in a \"tub\" and his arms were tied behind him. Ulrich scrubbed Jim's big build. From his scruffy face to his chest, to his still buff arms, to his belly, which stuck out like an exercise ball, down to his lower belly to his..........Ulrich skipped that part.....and continued to the large feet at the end of the man mountain. \"There all clean.\" Ulrich looked up to see-</span></div></div>",
            "created":1209419580,
            "id":525261,
            "title":"Rub a dub dub"
        },
        "142":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "he breaks his leg",
                "the kids motivate him to pig out",
                "xana possession"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>why does he pig out?</span></div></span></div>",
            "created":1270545900,
            "id":863216,
            "title":"he pigs out"
        }
    },
    "info":{
        "author_id":"archerman",
        "author_name":"d",
        "brief_description":"Fatten the boys from Code Lyoko!",
        "created":1166743380,
        "description":"<td align=\"left\" class=\"norm\">Rules: No making the characters immoble! No gay/lesbian stuff! Fatten the boys ONLY! No sex! No Death! Not alot of violence!<br>\r\nCharacters: <br>\r\nUlrich:He is teen boy of medium build.He is extremly atheletic (plays soccer),but he doesn't get good grades..He has short brown hair and semi-tan skin.He always wears a white shirt with a green dress shirt (always unbuttoned) over it. Feel free to fatten him!<br>\r\n<br>\r\nOdd:He has blonde hair(always in a single spike)with purple in the middle.He describes himself as \"I'm not scranny ,I'm svelt.\"He doesn't get very good grades either,and always dresses in purple.The girls love and he has a good appetite. Fatten him too!<br>\r\n<br>\r\nJeremy:He is a complete genius with blonde hair (in bowlcut style)and glasses.He is a basic computer geek and always wheres a blue sweatshirt with blue dress pants.Fatten him!<br>\r\n<br>\r\nYumi:She is japanese,has that beautiful Asian girl look about her, and always wears black.She and Ulrich have crushes on each other,but are afraid to admit it.She can gain 10 lbs. maximum.<br>\r\n<br>\r\nAielita:She camefrom the virtual world of Lyoko,has pink hair, and small build.Her and Jeremy like eachother and have adimited it to one another! She can gain 10 lbs. maxium.<br>\r\n<br>\r\nSissy:Sissy is a snobby girl with long black hair and blue eyes.Her father is the principal and she loves Ulrich but he hates her.<br>\r\n<br>\r\nSetting:<br>\r\nCadic Acadamy (somewhere in the U.S.)it is a bording school and Ulrich,Odd,Jeremy,Aielita,and Sissy live their.Yumi lives with her parents down the street.The school has every thing a normal school has and a park with many trees.The Town:Has everything a normal city-town has:mall,movie theatar,resturants,fast-food joints,ect.<br>\r\n<br>\r\nHave Fun With the Story!</td>",
        "id":1193042,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1277828040,
        "modified":1277828040,
        "pretty_title":"Fat Male Code Lyoko"
    }
}