{
    "chapters":{
        "1":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "A Mountain Area.",
                "A Forest.",
                "A Field.",
                "An Island.",
                "Outside a City."
            ],
            "content":"<div class=\"\"><div> <span>\"Uuugggghhhhh\" You groan as you lie down, your eyes glued shut. You knew you shouldn't have stayed up so late partying. But of course, the alcohol I'm your head convinced you otherwise. <br>\r\n<br>\r\nYou are Daniel Redock, a 22 year old college student. You may not have the best grades, but what you lack in smarts, you make up for in personality. You are a bit popular on campus, but you are still interested in Japanese culture and media, mostly manga, anime, and video games. This doesn't stop you from having a good time though.<br>\r\n<br>\r\nLast night you were invited to a party, and though you can't remember much, you know a lot of beer was involved. Your head pounds at the hangover you have.<br>\r\n<br>\r\nYou manage to peak open your eyes, but can't make anything out. You push a hand down and feel a bit of dirt beneath you. You place a hand on your head, trying to suppress the throbbing headache. \"God what a night.\" <br>\r\n<br>\r\nIt was then you looked up as your eyes regained focus......</span></div></div>",
            "created":1360645200,
            "id":1530673,
            "title":"A Rude Awakening."
        },
        "11":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Go inside the Cave",
                "Go down the Mountain."
            ],
            "content":"<div class=\"\"><div> <span>You see a sheer drop almost directly in front of you. Your slow reaction starts working, and you slowly back up. As you back up, you see a rocky floor beneath you, and soon your back hits a wall of hard rock. You start looking around as your vision clears, and you realize you are high on top of a mountain. The solid rock behind you props you up as you sit and look around. After a long time of waiting, the hangover subsides, and you manage to stand up. <br>\r\n<br>\r\nYou look at yourself. You still have the same T-Shirt and Jeans you wore to the party, both a bit ripped. Your shoes seem intact. You take a few steps on the path and soon your body works fine.<br>\r\n<br>\r\nYou look around and see the path you are on is high on the mountain. You start walking down the path at a slow speed. Questions about how you got here and what happened last night ring through your head. After a few minutes of traveling down you see what looks to be a large opening in the mountain. The cave had a chilling air surrounding it. \"Maybe I should rest a bit. Wouldn't hurt to recover in there. On the other hand, though, I need to find out where I am.\" You ponder for a second. You then decide to......</span></div></div>",
            "created":1360645200,
            "id":1530683,
            "title":"A Mountain Area."
        },
        "111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "A Hydreigon Woman",
                "A Gabite Teen Girl",
                "A Little Axew Girl"
            ],
            "content":"<div class=\"\"><div> <span>You decide to rest until your body works normally. You peak inside the cave. The walls were smooth; very few stalactites and stalagmites protruded from the roof or floor. The damp floor was a bit slippery, but you manage to keep balance as you walk inside.<br>\r\n<br>\r\nYou find a good indention in the wall, one big enough to lay in. You sit down and you dread out your legs, soon falling asleep.<br>\r\n<br>\r\nAfter a few hours you start to wake up, but you notice something is off. You feel a weight on your legs. Not morning weight, but as if something was sitting on them. Your eyes open and when they focus, you see...... </span></div></div>",
            "created":1360645200,
            "id":1530690,
            "title":"Cave Diving"
        },
        "1111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Go to a Town.",
                "Stay with Carmen."
            ],
            "content":"<div class=\"\"><div> <span>You see a pair of feet standing on your legs. These feet were unlike any you had seen before, mostly because they were dark blue. You slowly look up and your eyes widen: A blue woman was standing on you. <br>\r\n<br>\r\nYour eyes scan the woman in fear. Her skin seemed to be covered in scales, varying in colors from blue, black, and purple. She had markings of black and purple around her body, and six black appendages stuck out of her back. She had slender legs that led up to a seemingly plump ass, and her stomach was neat and slender. Her arms were crossed in front of her massive breasts, to which you seemed to stare at. You shake your head a bit as you look at her face. She had a mixure of black and purple hair. A fang poked out of her growling mouth, an her red eyes gleamed. She had a stern look on her face. Her hands were tucked into her arms.<br>\r\n<br>\r\nYou shake a bit and try to force up a smile. \"He---Hello.\" You manage to spurt out.<br>\r\n<br>\r\nShe grit her teeth and let out a growl. \"Who are you, and what are you doing in my cave?!?\" <br>\r\n<br>\r\nYou gulp. She had an intimidating voice. \"Well......uh.....I just.....thought I'd rest here......I don't exactly.....know where I am....\" <br>\r\n<br>\r\n\"A lost traveler taking refuge?\" She glared. \"I don't like trespassers.....I'd ought to just-\" <br>\r\n<br>\r\nShe stopped suddenly. She leaned in closer as her eyes scanned your body. You look into her purple eyes in fear. She blinks a bit.<br>\r\n<br>\r\n\"You.....are you......a male?\" She suddenly asked.<br>\r\n<br>\r\nNow it was your turn to blink. \"Uh...yeah. I'm definitely a guy.\" <br>\r\n<br>\r\nShe looks at you more, then she slowly uncrossed her arms. Your eyes get even wider as you see what appears to be two snake-like heads attached to where her hands should be attached. The heads stare at you mindlessly. <br>\r\n<br>\r\nYou shove even more. What was this? You had never seen a blue, purple and black woman with snake-heads for hands. <br>\r\n<br>\r\nHer three heads continued to examine you. \"And....you are a human?\"<br>\r\n<br>\r\n\"Y-yes.....I...I am a human.\"<br>\r\n<br>\r\nShe stands up again and gets off of your legs. \"It has been a long time since a male has been here.\"<br>\r\n<br>\r\nYou eye her with questioning look. \"Huh? Long time since a guy has been in your cave?\"<br>\r\n<br>\r\nShe shakes her heads. \"No. Since a man has been in this world\" She then bows. \"I apologize for my behavior. I'm am Carmen, the Hydreigon.\"<br>\r\n<br>\r\nYou look at her in disbelief. \"What? A Hydreigon? That Dragon Pokemon? But....\"<br>\r\n<br>\r\nShe smirks. \"Pokemon don't exist? The last human said the same thing. While it is true that Pokemon are more animalistic in your world, in this world, we exist like humans.\"<br>\r\n<br>\r\nHe nods, staring to put together the similarities of a Hydreigon and Carmen. \"Well.....you said it's been a long time since a male has been here. Aren't there any male Pokemon?\"<br>\r\n<br>\r\nAgain, she shook her heads. \"All the males wiped each other out. It was an instinct no one could suppress.\"<br>\r\n<br>\r\nYou start feeling a bit guilty for playing a game that had several creatures fighting each other after hearing that. \"So.....what is this place?\"<br>\r\n<br>\r\nCarmen smiled and picked you up with one of her mouths. You shiver a bit, but you feel a bit calmer. She leads you out of the cave. \"This is what you call 'The Pokemon World.'<br>\r\n<br>\r\nIf there was any moment in your life that was straight out of a movie, it was now. The sun shone across the massive forest that expanded in front of you. You couldn't see any wildlife, though. But just the beauty of the scene made you smile.<br>\r\n<br>\r\nCarmen turned to you. \"Now, what is your name?\"<br>\r\n<br>\r\nYou turn back to her, still a bit nervous. \"Daniel. I'm Daniel.\"<br>\r\n<br>\r\n\"Ok, Daniel. I would like to provide my services, if I can. I can fly you to the nearest town, if you want. Or if you still feel tired, I'll be happy to share my cave.....\"<br>\r\n</span></div></div>",
            "created":1360645200,
            "id":1530715,
            "title":"Three Heads means Three Times the Trouble."
        },
        "11111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "A Pichu Girl greets you.",
                "An Mankey Girl runs over you."
            ],
            "content":"<div class=\"\"><div> <span>\"I'd very much like to see a town.\" You nod your head. \"Maybe it'll help me know exactly where I am.\"<br>\r\n<br>\r\nCarmen smiled. \"Ok then. I know just the place!\" She has her other two mouths grab your arms and she extends her wing like appendages. \"Here we go!\"<br>\r\n<br>\r\nCarmen started levitating off the ground. You rise and feel a bit nervous, but her two heads grabbed your arms like clamps. You turn around and see her tail swaying in the wind as you two start moving. You then feel something on top of your head. You look up, and two walls cover your eyes a bit. Her breasts were resting on your head, and you blushed a little. <br>\r\n<br>\r\nThe fly was a bit quiet. You didn't want to distract Carmen while she was focused on keeping airborn. You decide to look down and out. You had just reached the edge of the forest, and you see some small figures running around in the fields. They were too far away to be seen clearly, but you could make out the forms of girls. You look outwards and see a rolling field expanding before you, and , in the distance, was a city-like settlement. \"Is that it?\" You ask.<br>\r\n<br>\r\n\"Yes. That's one of the biggest settlements in this region.\" Carmen looked staight forward as she talked, making it a bit difficult to hear. \"That's where I go daily to meet with friends. I was on my way when I found you in my cave.\"<br>\r\n<br>\r\n\"Sorry to keep you.\" You made a shy smile as you get closer to the city.<br>\r\n<br>\r\nThe two of you started to descend as you near the city. Carmen sets you down and lands right outside the city. \"This way.\" She motions for you to follow her.<br>\r\n<br>\r\nAs you two are about to enter the city......</span></div></div>",
            "created":1360645200,
            "id":1530794,
            "title":"Go to a Town."
        },
        "111112":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Take the Alleyway",
                "Go to the House"
            ],
            "content":"<div class=\"\"><div> <span>You hear a small noise in the air. It then grew louder very quickly, and before you realise it was coming from behind you.....BAM! You are knocked off your feet. You land facedown and you here Carmen shout. \"Daniel!\"<br>\r\n<br>\r\nYou push yourself up, but rather than dirt beneath your hands, you feel something furry. You press down and you feel that the furry object below you is soft. It was then you look and notice that you are in the same position many otaku boys found themselves in in anime: hand resting on the breasts of a young girl. <br>\r\n<br>\r\nAs soon as you realise this, you retract your hands and back away quickly. The girl picked herself up and rubbed her head. \"Ow.....sorry about that.\"<br>\r\n<br>\r\nAs you studder to apologize, you look over the girls body. She looked human, a lot more human than Carmen. Her skin was peach colored and covered in fur. Her hands and feet had a shade of brown, and behind her she had a long tail. Her ears were pointed a bit, and her eyebrows were a bit on the thick side. You try to but a Pokemon where she is. \"N-No. I'm sorry.....uh....Mankey girl?\"<br>\r\n<br>\r\nShe opens her eyes and looks at you. \"Hm? Yeah, I'm a Mankey. My name is Tina.\" She smiled. \"And it was my fault. I ran into you.\"<br>\r\n<br>\r\n\"Um...well....ok....\"<br>\r\n<br>\r\nTina looked at you more carefully \"Hmm......what are you? I've never seen a Pokemon like you before.\"<br>\r\n<br>\r\nThis is where Carmen stepped in. \"He isn't a Pokemon. He is human.\"<br>\r\n<br>\r\nTina's eyes shot open. \"Human? He's a human?!?\" Her shouts seemed to go on forever.<br>\r\n<br>\r\nAnd that shout brought the attention of several Pokegirls nearby. You try to recognize some, but the number soon grew so much that you were a bit scared. You back away a bitas the crowd grew, each Pokegirl staring at you with smiles on their faces. Carmen places a head on your shoulder. \"We need to go...\"<br>\r\n<br>\r\nOne girl moved from the front of the group towards you.<br>\r\n<br>\r\nAnd chaos was released. The crowd charged.<br>\r\n<br>\r\n\"NOW!\" Carmen grasped you and Tina and started flying into the city. A few bird Pokegirls gave chase, but Carmen wove through the city. Only one Pokegirl kept up: what looked to be a Staraptor girl.<br>\r\n<br>\r\n\"I can get us to the house I was going to....but we may need another place instead.\"<br>\r\n<br>\r\nYou look around, hoping to find a sanctuary. You see coming up is an alleyway that you think may lose the Staraptor girl......</span></div></div>",
            "created":1360645200,
            "id":1530816,
            "title":"Crash and Thrash"
        },
        "1111121":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Sludge falls on her.",
                "Something in the dumpster grabs her."
            ],
            "content":"<div class=\"\"><div> <span>\"There! There's an alleyway. We can lose her in there!\"<br>\r\n<br>\r\nCarmen nodded and she circled around and dashed for the alley. The Staraptor gave chase, but Carmen didn't go through the alleyway completely; she had used the shadows to hide behind a dumpster. The Staraptor flew on, trying to find the runaway trio.<br>\r\n<br>\r\nCarmen sighed. \"That was close.\" She then sniffed the air and covered her nose with a mouth. \"Forgot we landed near a dumpster.\"<br>\r\n<br>\r\nYou nod and look at Tina, who was shaking. \"What was that all about?\"<br>\r\n<br>\r\n\"It's been a long time since I've seen a human!\" She reaches out and hugs you. <br>\r\n<br>\r\nYou blush a bit as she hugs you, but then you push her away. \"I just hope they don't find us. I don't want to get mobbed.\"<br>\r\n<br>\r\n\"Don't worry.\" Carmen assured. \"I'll keep you safe\" She then clenches her nose tighter. \"My Arceus, what is that stench?\"<br>\r\n<br>\r\nTina sniffed and turned green as she covered her nose too. \"It stinks!\"<br>\r\n<br>\r\nYou take a sniff and the immediately cover your nose. This powerful smell brought tears to your eyes. It was indescribable how horrible it was.<br>\r\n<br>\r\nTina's eyes grew wide, and then she passed out. Carmen still looked good, but then.......</span></div></div>",
            "created":1360645200,
            "id":1530856,
            "title":"Sticky Situation."
        },
        "11111211":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Carmen Defends You",
                "Muk Vore"
            ],
            "content":"<div class=\"\"><div> <span>Out of what seemed like nowhere, a squishing sound was heard. Next thing you know, Carmen's face is covered in a purple ooze. She flailed a bit trying to wipe it off, but then she fainted, overpowered by the smell.<br>\r\n<br>\r\n\"What the hell?!?\" You look around the alley. You then see a small manhole without a cover in the middle of the alley. Out of the manhole, a purple sludge seemed to be moving towards you. You scramble to back away but the alley was narrow and you couldn't move back. <br>\r\n<br>\r\nThe sludge started to grow, getting taller and wider underneath. As the sludge grew, parts of it protuded out, soon forming hands. The sludge continued to form, a a bit of a giggle could be heard over the squishing of the ooze. As you see this happening, you are paralyzed both by fear and of the stench the ooze seemed to have.<br>\r\n<br>\r\nThe sludge seemed to finally stop forming, and you look at it. The bottom half was a giant pool of sludge, formless. Then as it neared the top, it slimed down, forming what looked to be a midsection of a human. Even further up, you saw the top half of a girl made if the same slime beneath her. She had a smirk on her face. Her hair was not hair, but slime formed to look like it. She giggled a bit more as she saw your terrified face.<br>\r\n<br>\r\n\"Ah...so you are the new human here.\" She said in a slightly seductive voice.<br>\r\n<br>\r\nYou studded as you respond. \"Y-yeah.....and you?\"<br>\r\n<br>\r\n\"I'm Leslie. I'm a Muk.\" She smiled and her lower body inches forwards. \"You seem pretty scared without those other two.\"<br>\r\n<br>\r\n\"Well.....why did you...\"<br>\r\n<br>\r\n\"Oh, don't worry. They will wake up. How long it will take, I don't know.\" Her slime crawls onto your feet. \"But I just want you.\"<br>\r\n<br>\r\nYou scream a bit as she grabs you with her arms, pulling you waist deep into her slime.<br>\r\n<br>\r\n\"Now now,\" She said, wagging her finger. \"Lets enjoy this moment. I know I will......\"</span></div></div>",
            "created":1360645200,
            "id":1530869,
            "title":"Stuck in a Muk."
        },
        "111112111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Oral Vore",
                "Unbirth"
            ],
            "content":"<div class=\"\"><div> <span>You close your eyes, preparing for the worst the sludge bodied girl has for you.......when you hear a groan. You turn your head to see the Carmen's two heads swiping off the sludge, and Carmen blinks awake. The Hydreigon still had a pale look as she realised she was still covered in a bit of sludge, but her purple eyes burned with fury. She stood up and looked at both you and Leslie.<br>\r\n<br>\r\n\"Leslie, what the hell?!?\" Carmen spoke in a restrained tone.<br>\r\n<br>\r\nThe Muk girl let out a nervos laugh. \"Heyther.....Carmen....uh... I was just....passing by....and I heard about the human.....so....\"<br>\r\n<br>\r\nAll three of Carmen's heads glared at Leslie. \"You got ten seconds to crawl back into that sewer.\"<br>\r\n<br>\r\nLeslie gulped and let you go. You back away and start wiping the slime from your pants. The Muk slowly sank back into the manhole back into the sewers.<br>\r\n<br>\r\nCarmen's rage seemed burned out and she looked back at you. \"I'm so sorry you had to put up with her. She tends to do that to other Pokegirls as well.\"<br>\r\n<br>\r\nYou shake a bit as you reply. \"Um....how do you know her?\"<br>\r\n<br>\r\n\"Well....when we get to the destination, you'll find out.\" She picks up Tina, still unconscious. \"Let's go. And this time we won't have the chatter box to draw attention.\"<br>\r\n<br>\r\nYou nod and stand up, still wiping the Muk off of your lower half. \"But what if a Pokegirl sees me? They may draw attention.\"<br>\r\n<br>\r\n\"I got that covered.\" Carmen lays down Tina and picks you up, holding you in a bit of a cradled position. \"Just don't scream.\"<br>\r\n<br>\r\n\"Don't scream?\" Your eyes widen as she........</span></div></div>",
            "created":1360645200,
            "id":1531083,
            "title":"Carmen Defends You"
        },
        "1111121111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Tina is unconscious still.",
                "Tina saw half of the vore."
            ],
            "content":"<div class=\"\"><div> <span>Her to heads hold you as her mouth widens. You see her head seem to shift form and grow a bit, starting to resemble the Hydreigon you know and now somewhat fear. You gulp as you resist to scream and draw attention to you, although that is usually what you would want to do in this situation.<br>\r\n<br>\r\nCarmen's heads then slowly lift you up towards her giant mouth. You would shake, but her mouths restrain you. You feel her moist breath as you start entering her mouth. As instructed, you fight the urge to struggle.<br>\r\n<br>\r\nAs if by instinct, Carmen's tongue lashes out and licks your face. You cringe and close your eyes as the tongue coats you with saliva. You hear her start to moan a bit as she tastes you. The tongue seems to wrap around you and tug on you, wanting to taste more. Your shoulders enter her mouth and you start to hit her throat. The walls of her thoat seems to throb a bit, as if almost straining. <br>\r\n<br>\r\nYour waist soon enters and you feel her tongue brush up against your crotch. You somewhat look back and blush a bit as she licks your lower body. Your top half is now bending to go down her throat and you feel the damp walss squish around you.<br>\r\n<br>\r\nWhen she is done with your waist, she slurps up the rest of your body. You suddenly fall in Carmen's stomach. The fleshy walls surround you, and you try and gasp for air as you look around. The stomach was dark, but the walls seemed to glint a bit, letting you see your small moist prison. You the jump a bit as you hear a moan and you feel a small hand rub on the outside.<br>\r\n<br>\r\nCarmen smiles and rubs her stomach. \"Oh Daniel, I haven't eaten like that in a long time. You tasted really good.\"<br>\r\n<br>\r\nYou blush a bit. \"Um...Carmen? Don't forget the real reason I'm in here.\"<br>\r\n<br>\r\nCarmen shook her head and blushed a bit. \"S-sorry! But yes, This should protect you from other girls.At least they won't see you.\"<br>\r\n<br>\r\n\"That's true. Just promise me I'll get out of here when we get to.....wherever we are going.\"<br>\r\n<br>\r\nCarmen pats her stomach. \"Sure thing. Let's just get Tina and we'll go.\"<br>\r\n<br>\r\nShe turns to Tina......</span></div></div>",
            "created":1360645200,
            "id":1531107,
            "title":"Oral Vore"
        },
        "11111211111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "You reach the house.",
                "Carmen is stopped again."
            ],
            "content":"<div class=\"\"><div> <span>Tina still lay unconscious from the stench. The little Mankey was breathing slowly, her chest rising and falling as if she were asleep. Carmen looked down at the girl and shook her head. \"We better get you to the house.\" She picked up Tina with her heads in a cradled position and walked towards the end of the alleyway.<br>\r\n<br>\r\nAs she peeked out of the alleyway, she didn't see the massive crowd that had chased them earlier. The city seemed pretty normal as of now, with no frantic search party looking for the only male within miles. Carmen nodded and stepped out of the alleyway, walking alongside the sidewalk.<br>\r\n<br>\r\nIn her stomach, the flesh around you bounces a bit as she walks. The cramped space had gotten smaller as the extra weight of Tina squeezed you inside. You wonder where it is you are going, since Carmen never really told you about where she was headed. All you know is that she was on her way to visit some friends, and then you appeared. As the flesh moves around you, you feel a bit calm. This prison was comfortable, for a dragon girls's stomach. Then again, you wouldn't have known what it was like inside a stomach before this. Girls you meet on the street at home didn't eat humans, much less swallow them whole. <br>\r\n<br>\r\nYou start getting comfortable when the flesh stops moving, and you feel Carmen stop. You hear voice's outside:<br>\r\n<br>\r\n\"Hey Carmen. What happened to Tina? Get knocked out by a Pidgeot again?\"<br>\r\n<br>\r\n\"Well, not exactly. She was in the alleyway and a Muk knocked her out. But she's fine. Just got to get her back.\"<br>\r\n<br>\r\n\"Ok then.\" A pause followed, then you feel something poking the stomach. \"Wow, you must have been hungry. What did you do? Eat a whole Miltank?\"<br>\r\n<br>\r\n\"Oh....um....well I was feeling a bit hungry......so I....\" You feel a sweat drop as she starts trying to make up an answer. \"I ate a Tauros on my way here.\" She blurted out that last part. You continue to sweat as the voices pause again, then you hear a giggle.<br>\r\n<br>\r\n\"Ok then. Better not keep you. See you later.\"<br>\r\n<br>\r\n\"Bye.\" You let out a sigh and you hear Carmen do the same. \"That was close. Let's go.\" <br>\r\n<br>\r\nThe flesh starts moving around again as Carmen continues to walk......</span></div></div>",
            "created":1360904400,
            "id":1532669,
            "title":"To the Unknown Destination"
        },
        "111112111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Stopped by a girl.",
                "Mobbed by many girls."
            ],
            "content":"<div class=\"\"><div> <span>The rest of the walk continued without anyone else bumping into Carmen. Inside her you start to doze off as the warm flesh hugs your body. You smile, thinking it was a lot more comfortable than the rocks of the mountain.<br>\r\n<br>\r\nA few minutes pass and you feel Carmen stop again for a second, then you hear a door opening, then you feel her walk again. You wonder if you have made it to the destination when you start hearing more voices outside.<br>\r\n<br>\r\n\"Jesse? Have you seen Ms. Bliss?\"<br>\r\n<br>\r\n\"In the room in the back, Carmen. What's up\"<br>\r\n<br>\r\n\"It's just Tina again.\"<br>\r\n<br>\r\n\"Not surprised. And hey, have you heard about that human male? Do you think it's true?\" <br>\r\n<br>\r\n\"One sec. Let me get Tina taken care of.\"<br>\r\n<br>\r\nCarmen's stomach moved a bit as you start feeling Carmen walking through the building. You hear more doors open and close, then you hear a soft and sweet voice as Carmen stops.<br>\r\n<br>\r\n\"Carmen. So nice to see you today. What's the trouble.\"<br>\r\n<br>\r\n\"Tina ha a run in with a Muk stench. You got a bottle of Aromatheropy?\"<br>\r\n<br>\r\n\"Of course. Just sit tight.\"<br>\r\n<br>\r\nYou hear the clanging of glass for a few seconds, then you move a bit more, and a long pause follows. Soon, you hear a soft and familier moan, followed by the sound of Tina's voice.<br>\r\n<br>\r\n\"What....what happened?\"<br>\r\n<br>\r\n\"You were hit with a Muk stench.\" You hear Carmen respond. \"Just take it easy.\"<br>\r\n<br>\r\n\"Oh....ok.....but what about that human?\"<br>\r\n<br>\r\n\"Human?\" The character you believe to be Ms. Bliss chimed in. \"What about a human? I've heard rumors, but....\"<br>\r\n<br>\r\nCarmen sighed. \"One second. Give me some space.\"<br>\r\n<br>\r\nAs soon as she says that, you feel the walls of the stomach tighten and squeeze upward. You somewhat scream as you start going up into her throat and pretty soon you are spewed out of Carmen, laying face-up on the floor covered in Carmen's stomach fluids. As your eyes slowly blink open, you see Carmen and Tina, along with a new face. She had a light pink skin and frills around her body. She was well endowed with her breasts, but it was her extremely slender body that caught your attention. She also had a small pouch on her stomach, with a small white egg inside. You connect the dots in your head and realize that this Ms. Bliss is a Blissey.<br>\r\n<br>\r\nMs. Bliss spoke in a shaken tone. \"Oh my. So this is the human. And you ate him, Carmen?\"<br>\r\n<br>\r\nCarmen nervously smiled. \"He was gonna get mobbed by the citizens if I didn't.\"<br>\r\n<br>\r\n\"Alright then.....lets get him cleaned up\"<br>\r\n<br>\r\nCarmen smiled. \"Ok. I'll take him to the bath\"<br>\r\n<br>\r\nHer head pick you up in a cradled position. You smile lazily. \"Thanks.\"<br>\r\n<br>\r\nMs. Bliss smiles back. \"Think nothing of it, Mr.....\"<br>\r\n<br>\r\n\"Daniel Redock.\"<br>\r\n<br>\r\n\"Well, pleasure to meet you, Daniel. Carmen, get him clean, and Tina, pick out something for him to wear while his clothes are clean.\"<br>\r\n<br>\r\n\"Yes, ma'am\" Both replied, then they headed out the door.</span></div></div>",
            "created":1360904400,
            "id":1532738,
            "title":"Throw Up at the House"
        },
        "1111121111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "No one is inside.",
                "A group of Pokegirls are getting changed."
            ],
            "content":"<div class=\"\"><div> <span>You look around the halls as Carmen carries you. The walls were a shade of tan, and the doors along the hallways seemed to be personalized by different people. On one door you saw black feathers and stars, on another various seashells, and then one particular door that caught your eyes was the three heads of a Hydreigon glaring at the outside. <br>\r\n<br>\r\nYou gulp a bit, and as Carmen passed the room, she smiled. \"That's my room for when I stay here. It's not quite home, but with everyone else here, it's just as good.\" <br>\r\n<br>\r\nYou nod a bit. You feel the stomach juices slowly moving around your body with every step. You are a bit relieved to be out of the stomach, but a part of you misses the comfort it held. But you shake the thought off, thinking how a bed would be much better. <br>\r\n<br>\r\nAs you reach the end of the hall, though, a figure stands in the doorway. You look at the figure and your eyes widen at the sight if a lovely woman.<br>\r\n<br>\r\nThis woman was a bit taller than Carmen, and had a lighter shade of blue skin covering her. She had red eyes, but not as red as Carmen's, and silver hair. You look down and your jaw drops. She wore a small, silver chest plate that graciously cut off at her stomach, showing tons of midriff. But the armor was formed and cut off a bit at the top, showing the cleavage of her massive breasts. There was an ornate X that curved along the armor, emphasizing her bosom, which you believed to be bigger than Carmen's. You look down past her midriff and see a scanty pair of armor that looked like a pair of shorts. Her legs were long and slender. You examine her body, but soon your eyes wander back up to her breasts.<br>\r\n<br>\r\nCarmen sees this and shakes you a bit in her arms.<br>\r\n<br>\r\nThe woman smiled. \"Hello, Carmen. Nice to see you finally showed up.\" She leaned over a bit and looked at you. \"And who is this little guy?\"<br>\r\n<br>\r\nCarmen grunted a bit. \"None of your business, Gilda. Now if you excuse me, I gotta get Daniel to the baths.\" She tried to push through, but Gilda stepped in front if her. Your face is meet inches away from her stomach. You then look up and see the armor-clad breasts above you. You blush a bit.<br>\r\n<br>\r\n\"Aww....don't be like that, Carmen. I know you Hydreigon are feisty, but you don't have to be rude.\"<br>\r\n<br>\r\nCarmen scowled. \"And you Metagross are supposed to be smart enough to take a hint, but I guess that didn't come with you, now did it?\"<br>\r\n<br>\r\nGilda frowned. \"Fine then. Go and wash him up.\" She steps back and leans closer to you. \"I look forward to spending some time with him.\" She licks her lips, then walks away.<br>\r\n<br>\r\nCarmen continues to walk, a scowl on her face. You blush a bit. \"Friend of yours?\"<br>\r\n<br>\r\n\"Hardly. I don't want to talk about it.\" <br>\r\n<br>\r\n\"Ok then.\" You two continue walking, soon reaching a door.<br>\r\n<br>\r\n\"Here we are.\" Carmen opens the door.....<br>\r\n<br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532784,
            "title":"Enter Gilda, the Metagross"
        },
        "11111211111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "\"What is this House for?\"",
                "\"Who was that Metagross Girl?\""
            ],
            "content":"<div class=\"\"><div> <span>Carmen opened the door to find the bathroom empty. She sighed and entered, and you look around the room. It wasn't an average American bathroom. Much like in Japanese culture, there was a large bath that was seperate from a showing station. And this bath was large, you think it may have been able to hold the entire residency of the house.<br>\r\n<br>\r\nCarmen set you down in a seat and started running the bath, steam filling up the room as warm water flowed. You sigh a bit. This was the first modern day comfort you have had since you woke up in this world. You think of all the things you would be doing back in your world, but then sigh, still wondering how you got in this world in the first place. You blame the alcohol for imparing from the night before.<br>\r\n<br>\r\nCarmen turns to you. \"You may want to get out of those clothes.\"<br>\r\n<br>\r\nYou look down at yourself. Your clothes were soaked, and you wonder if they migh. Even be a bit dissolved. But you nod and take of your clothes, all but your underwear. Carmen tilts her head a bit. \"Why don't you take those off?\"<br>\r\n<br>\r\nYou look at her and your eyes widen. Her scales seemed to gleam from the steam's water, and you look at her naked body. All of this was enough to give you a boner. You blush a bit and try to cover it. \"Well....You are still here....\"<br>\r\n<br>\r\n\"And? I still see nothing wrong.\"<br>\r\n<br>\r\nYou gulp. \"It's just....where I come from, being naked in front of a woman is indecent.\"<br>\r\n<br>\r\n\"I assure you, it isn't indecent here. I don't mind.\" Carmen smiles reassuringly.<br>\r\n<br>\r\nYou blush more and your hands move down, slipping off your underwear. As you do, you desperately try and cover your member from Carmen's view.<br>\r\n<br>\r\nCarmen smiles as you both are completely naked. She turns off the water and smile. \"Here you go, Daniel.\"<br>\r\n<br>\r\nYou nod and walk to the bath, sighing in relief as you take a step into the warm water. It only takes you a few seconds to immerse yourself in the bath water. You close your eyes as you start to relax.<br>\r\n<br>\r\nThen you feel something soft press against your back. <br>\r\n<br>\r\nYour eyes shoot open as you turn your head. Carmen was behind you, rubbing a bar of soap on your back, her F-cup breasts pressing lightly against you. You blush. \"Wha....what are you doing?\"<br>\r\n<br>\r\n\"I'm washing your back for you. I don't want you to have and bacteria from my stomach.\" Carmen smiled as she continues to was you.<br>\r\n<br>\r\n\"Well....thank you.\" You look down at the water, blushing as the Hydreigon girl cleans your back. Then you turn around a bit. \"Carmen, can I ask you a question?\"<br>\r\n<br>\r\nCarmen nodded. \"Of course. What is on your mind?\"</span></div></div>",
            "created":1360990800,
            "id":1533091,
            "title":"A Bath and A Dragon"
        },
        "111112111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Tina walks in.",
                "She kisses you."
            ],
            "content":"<div class=\"\"><div> <span>\"What exactly is this house for? Don't you all have homes for yourselves?\"<br>\r\n<br>\r\nCarmen sighs a bit. \"You ready to listen to the story?\" You nod.<br>\r\n<br>\r\nShe started scrubbing your back again. \"As I said before, it has been years since the male Pokemon wiped each other out. Only females live in this world, and every so often, a human, like yourself, is brought here.\"<br>\r\n<br>\r\n\"Yeah. I remember.\"<br>\r\n<br>\r\n\"But we are starting to understand why. Without the male Pokemon, we aren't able to breed new generations of our species. Most of the latest generation have become adults. Tina is part of the latest, and she is already 20.\"<br>\r\n<br>\r\n\"Wow.....that must be rough.\"<br>\r\n<br>\r\nCarmen slowed down the scrubbing. \"Yes, but the worst of it was the anarchy that grows. Various Pokemon started rioting, and many give into animalistic instinct, eating what they catch. Other Pokemon lived in fear, not knowing if they might be another's lunch.\" She stopped the scurbbing. You turn around and see her looking down. \"One of those Pokemon was me.\"<br>\r\n<br>\r\nYou fully turn around and look at her. Her eyes were filled with sorrow, it seemed. You sit quietly as she continues.<br>\r\n<br>\r\n\"I was a Deino, and the last of the breed. Knowing this, I used to live in fear of being killed by a stronger Pokemon. One day, in my cave, a Conkeldurr girl attacked me. She was too strong for me, as I was only a child. It was the end for me.\" A tear streamed down her blue face. \"But then, out of no where, two girls stood in front of me, and faced the Conkeldurr. One was Ms. Bliss, the other her assistant, Ms. Wobb. Ms. Wobb fended off the Conkeldurr, and Ms. Bliss took me away, and sheltered me in this very house.\" <br>\r\n<br>\r\nTears were flowing from her eyes as she looked down. You try and place a hand on her shoulder, but a head snapped at you, and you quickly recall the hand. Carmen looks up at you, her eyes even more red. \"She took care of me and all the other girls in this house who didn't have enough power to survive on their own. This house has been my home away from home ever since. Us girls call it the House of Bliss.\"<br>\r\n<br>\r\nYou look into her eyes and nodded. \"I see. So Ms. Bliss kept you safe from the attackers here.\"<br>\r\n<br>\r\nCarmen nodded back. \"And ever since then I've tried my hardest to strengthen myself. I grew to a Zweilous and finally a Hydreigon. And now I don't fear anymore.\" She smiled, her lips quivering.<br>\r\n<br>\r\nYou smile back. \"That sounds great, Carmen.\"<br>\r\n<br>\r\nShe looks down. \"But as I've said, only every so often a human is brought here. And a lot of times they are eaten by the animalistic girls. I have never been able to speak with one.\" She looks back at you. \"Until you came along. I.....I felt something in you.....I couldn't just turn you loose...\" Her eyes water more and she moves closer, wraps her arms around you, and hugs you, sobbing.<br>\r\n<br>\r\nYou wrap your arms around her, hugging back. You feel your bodies touching each other, her breasts pressing against your chest. You rub her back in comfort. \"Carmen....please don't cry.....\" <br>\r\n<br>\r\nShe backs away a bit and looks at you, staring into your eyes.......</span></div></div>",
            "created":1361077200,
            "id":1533774,
            "title":"House Bliss and the Story of Carmen"
        },
        "1111121111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "It's Gilda",
                "It's Tina"
            ],
            "content":"<div class=\"\"><div> <span>You stare back into Carmen's eyes, your faces getting closer with each second. You slowly close your eyes and slowly pucker.....<br>\r\n<br>\r\nJust as Tina opened the door and walked in, cheerily smiling. \"Hi!\"<br>\r\n<br>\r\nYou open your eyes and look at Tina, Carmen doing the same. You two remain frozen in your spots, eyes glued to the Mankey girl. Tina giggled. \"Having fun, Carmen?\"<br>\r\n<br>\r\nCarmen's three heads glared at the Mankey, who was innocently smiling back. Carmen stood up, grabbed a towel, and started drying off as she stormed out of the bathroom. You notice as she does, her face is slightly red. You then look backto Tina, who was carrying a bundle of clothes for you.<br>\r\n<br>\r\n\"Uh....I'm guessing those clothes are for me?\"<br>\r\n<br>\r\nTina nodded. \"Yep. Hope they are okay. We don't make clothes for males too often, but we keep a couple around for if they start coming back.\"<br>\r\n<br>\r\nYou nod and turn around, shielding your member from her view. You slowly walk over to the towels and start drying off. \"Thanks, Tina.\"<br>\r\n<br>\r\n\"No prob! It's the least I could do, since we bumped into each other.\" <br>\r\n<br>\r\n\"Yeah, I guess so. Just let me cgange real quick.\"<br>\r\n<br>\r\n\"Ok, then.\" Tina cheerfuly left the bathroom.<br>\r\n<br>\r\nYou sigh and start getting dressed. You think about some of the people you have met so far. First was Carmen, who seems nice, but you've seen her only a bit mad. You've met Tina, who seemed cheerful no matter what happened. You thought more about Mankeis, knowing that in your world, Mankies were violence prone. But Tina didn't act like that. She didn't seem angry and intimidating, but rather kind and a bit scatterbrained. Then there was Ms. Bliss, who you didn't know too much about other than she took care of several girls who were weak.<br>\r\n<br>\r\nThen there was Gilda, the girl you met in the hallway. You can't help but wonder what history she and Carmen had. Clearly, they didn't like each other too much. Then your mind wanders to her body and they way she talked. You blush as you invision her armor that showed her body off, and the smile she gave you before she left. <br>\r\n<br>\r\nYou shake your head. \"Focus, Daniel. Just relax and think of what you need to do. You need to find a way back home.\"<br>\r\n<br>\r\nYou nod and walk to the bathroom door. As you do, you stop in front of a mirror and check out your clothes. You wore blue jeans and a green T-shirt. You shug and walk out of the door, just in time to see Ms. Bliss grab you and pull you away. A few seconds pass and she lets you go. You look in front of you and see a large group of girls sitting in front of you. You think back to the last time a group of girls were staring at you, considering they charged for you.<br>\r\n<br>\r\nYou look at the group and scan them. You can pick out most of the Pokemon species, most of them in their second or third evolution stage. You see Tina in the crowd, waving. You turn to your left and see Carmen, her face still a bit red, and nervously smiling. Then you look in the very back and see Gilda, smirking at you. <br>\r\n<br>\r\nMs. Bliss spoke. \"Now girls, I want you to make Mr. Daniel feel welcome here. He is the first human to have visited the house, and we want to make a good impression. Understood?\"<br>\r\n<br>\r\nThe group of girls nodded. You look in the back and see that Gilda is no longer there. Your eyebrow raises but you shake it off. You face the girls, nervously smiling. \"Thanks for your hospitality. I'm glad to be here.\"<br>\r\n<br>\r\nCarmen stepped forward and faced you. \"Daniel, as the Pokemon to find you and bring you here, I shall offer my services to protect you.\" She bows.<br>\r\n<br>\r\nYou blush a bit, remembering what had happened just a few minutes ago, but you smile. \"Thank you, Carmen.\"<br>\r\n<br>\r\nMs. Bliss smiled and clapped her hands. \"Ok, now. That's all. You girls go about your day.\" She turned and walked towards her door.<br>\r\n<br>\r\nIn your mind, as you see her walk to the door. '3........2........1.....' The door closes.<br>\r\n<br>\r\nAll hell brakes loose.<br>\r\n<br>\r\nThe girls made a mad dash for you, but unlike in the city, you can't fly away. Carmen stood in front of you, her heads hissing. The girls stopped the rush.<br>\r\n<br>\r\nYou sigh in relief, but feel a pair of hands grab him and pull him. You turn around....</span></div></div>",
            "created":1361077200,
            "id":1533912,
            "title":"Residents of the House of Bliss"
        },
        "11111211111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "She pushes you on the bed.",
                "Tina walks in again."
            ],
            "content":"<div class=\"\"><div> <span>You see Gilda, a seductive smile on her face. \"I don't think we have been properly introduced.\"<br>\r\n<br>\r\nCarmen turned around, and as she saw you and Gilda, her eyes glared. \"Take your hands off him!\"<br>\r\n<br>\r\nGilda glared back. \"Or what?\" She brought you closer to her, her armor pressing hard against your back.<br>\r\n<br>\r\nCarmen was about to reply, when suddenly, someone burst through the front door. You glance over, and you see a metalic silver girl run in towards Carmen. She had long legs and a slim body, her breazts barely a B-Cup, but she had metalic wings on her back. You deduce she is a Skarmory. Her eyes looked fear stricken.<br>\r\n<br>\r\n\"Carmen!\" She spoke almost with a screech. \"We have a problem in the mountains! Hariett is at it again!\"<br>\r\n<br>\r\nCarmen looked at the Skarmory girl and growled. \"That damn Nidoqueen never rests! I'll be right there.\"<br>\r\n<br>\r\nCarmen looked back at you and Gilda, growling. \"Looks like I have no choice. Gilda, keep Daniel safe until I get back. I swear, if he is hurt....\"<br>\r\n<br>\r\nGilda smiled. \"Don't you worry. I'll take good care of him. Just go and save your mountain.\"<br>\r\n<br>\r\nCarmen nodded and left the house with the Skarmory girl. You watch as ghe door shuts, and as if dior shutting was a signal, the girls advance on you again. Gilda glared intensely at the other girls. \"Don't you dare!\" <br>\r\n<br>\r\nThe girls backed off. Gilda continued the glare. \"As one if the oldest in this house, and because Carmen said so, Daniel is under my protection.So back off!\"<br>\r\n<br>\r\nThe girls recoiled back,and Gilda continued to hold you close. \"That's better. Now, if you'll excuse us.\" Gilda walked away into the hallway. She stopped at a door with three silver X's, which you assumed was her room.<br>\r\n<br>\r\n\"I'll get you nice and comfy, okay?\" She innocently smiled as she opened the door and the two of you enter.<br>\r\n<br>\r\nYou look around the room. It had light purple walls and a large bed in the middle. There was a bookshelf to the left with dozens of books, but other than that and a closet, nothing stood out quite as much as the bed.<br>\r\n<br>\r\nGilda lets you go, smiling. \"Welcome to my room.\" She shut the door. Then.....</span></div></div>",
            "created":1361250000,
            "id":1535289,
            "title":"The Second Bodyguard"
        },
        "111112111111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Unbirth",
                "Let You Go"
            ],
            "content":"<div class=\"\"><div> <span>\"Woah!\" <br>\r\n<br>\r\nYou are suddenly pushed down onto the bed hard. You turn on your back just in time to see Gilda bending over onto the bed, slowly crawling towards you. You blush as you look at her smiling face. You start backing up on the bed, your eyes slowly looking down at her armor. Her cleavage was showing through the opening in her armor, and your face gets even more red. <br>\r\n<br>\r\nGilda saw this, and and aura surrounds her armor. Suddenly, the armor clicks open and floats off her body, both the top and the bottom. The armor is laid down on the floor, and you look at it in awe. \"How did you do that?'<br>\r\n<br>\r\n\"I'm part Psychic, silly.\" She let out a childish giggle. Your eyes turn back to her, and you start nosebleeding. Her breasts were huge now without the constraining armor. They loosely hung in a sky blue bra, slightly bouncing as she continued to crawl. You crawl back more but soon you hit the back of the wall, sitting on the pillow at the head of the bed. Gilda smiled more, seeing that she had cornered you in her own bed. <br>\r\n<br>\r\n\"I don't think I've properly introduced myself. I'm Gilda.\" She slowly crawled up to you, her body slightly rubbing against you.<br>\r\n<br>\r\n\"Um...uh....hello....Gilda...\"<br>\r\n<br>\r\n\"Now that Carmen has given me her custody of you to me while she is away, I hope we get to know each other very well.\" She sat on your lap, her hypnotic breasts sitting right in front of your face.<br>\r\n<br>\r\n\"I....uh....\"<br>\r\n<br>\r\n\"A little shy, are we? Well, I'm very friendly. Just loosen up a bit and I'm sure we will get along great.<br>\r\n<br>\r\n\"She places a hand on your head and starts rubbing the back, slowly guiding you into her breats. An aura surrounds her bra as it is removed telekineticly and set aside. Your mind goes blank as she pulls your head into her breasts. You don't know wheter to be scared, embaressed, or comforted.<br>\r\n<br>\r\nGilda feels your member hardening and smiles. Rather than use her powers, her hands wander down to your pants and undo them. Almost greedily, she slides off your pants and underwear, then starts lightly stroking. \"Oh, I'm gonna have fun with this. How about I give you a bit of a taste of what I can do?\"<br>\r\n<br>\r\nYou blush severely as she slides down and hovers over your cock. she then places her hands on her breasts and wraps them around your member. You moan in pleasure as she slowly titty fucks you. Her breasts feel so soft around your hardened member.<br>\r\n<br>\r\nSoon she starts licking the tip, and after a few minutes you feel at your limit you close your eyes and moan.......but nothing happens. You are at the peak of your pleasure and yet you somehow are unable to cum. What was happening?<br>\r\n<br>\r\nGilda giggled, but not out loud. Her giggle seemed to ring inside your mind. \"Having fun with my mental block? I'm gonna push you to your limit.\"<br>\r\n<br>\r\nYou start wincing a bit in pain as she giggles tauntingly inside your head. She removes her breasts and starts sucking on your cock fully, giving you a blow job. You moan in pleasure and slight pain as she tortures you with this treatment. You feel like you are going to explode, but you can't release or fight Gilda's mental block.<br>\r\n<br>\r\nGilda let out one final suck, and suddenly you feel yourself exploding into her mouth, moaning as you finally conclude your long awaited release. Gilda swallows all she can but a pool of cum seeps out of her mouth onto the bed. She sits up and licks it off her face, smiling with glee..<br>\r\n<br>\r\n\"That was fun. Now......\"</span></div></div>",
            "created":1361394300,
            "id":1536103,
            "title":"Gilda's treatment"
        },
        "1111121111111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Carmen is there, and she is Pissed.",
                "Tina is there."
            ],
            "content":"<div class=\"\"><div> <span>Gilda smiled more as het brought you closer. \"Now time for you to make me feel good.\"<br>\r\n<br>\r\nYour eyes widen as you feel your body seemingly go numb. You look at your arms and see the same aura surrounding them. The same is with your legs. \"What? Why are you...\"<br>\r\n<br>\r\n\"It's just to keep you still for a bit. I want to enjoy this, and it will be a bit easier if I have my hands free.\"<br>\r\n<br>\r\n\"Free?\" You look down and her her hands slide down her panties, revealing her wet pussy. She sits up and starts rubbing it vigorously in front of you. You then get a major nosebleed as she spreads it wide, giggling. You gulp thinking this was gonna be the way you lose your virginaity: bonded and with a teaser.<br>\r\n<br>\r\nYou were far off.<br>\r\n<br>\r\nYou feel your body move and your head is turned towards her pussy, your arms straight by your sides and feet straight. Your body is pulled closer and your head presses into the pussy. You scream a bit as you are suddenly enveloped by the walls of the pussy, but they are muffled. Gilda laughs and moans as you start entering her. \"It's been so long since I felt this good.....keep it going.\"<br>\r\n<br>\r\nYou try to control your muscles, but you are helpless as you are slowly pushed inside the girl. You are past your shoulders when you feel your muscles return to your control, and you thrash on instinct. This does little to help, but outside you hear moans from Gilda.<br>\r\n<br>\r\nYou continue to struggle as your body slowly sinks further. When you reach your hips, you feel your member being stroked by Gilda's hand, and you let out a soft moan as you continue to kick. Soon your hips enter inside, and all that is left is your legs outside. Gilda uses a hand and tickles your feet, making them kick a bit faster. She moans one last time as she climaxes, fluids rushing past you. You squint as your body is covered with cum, and soon your legs join the rest of your body. <br>\r\n<br>\r\nGilda rubs a hand on her stomach. \"And that is that. Hope you've had fun.\" She stands up and puts her armor back on. You sit in her womb, the soft flesh a bit comforting, but your mind sticken with fear as you sit inside the Pokegirl who had just toyed with you.<br>\r\n<br>\r\nAfter she put on her armor, Gilda walks to her dorr and opens it......</span></div></div>",
            "created":1361477580,
            "id":1536705,
            "title":"Unbirth"
        },
        "11111211111111111111":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "At Gilda.",
                "At Hariett (the Nidoqueen girl mentioned in chapter 17)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is she pissed at?</span></div></span></div>",
            "created":1366728120,
            "id":1577091,
            "title":"Carmen is there, and she is Pissed."
        },
        "111112111111111111111":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Lashed out at Gilda (Catfight.....Pokemon style.)",
                "Takes you back to the bath."
            ],
            "content":"<div class=\"\"><div> <span>As Gilda opened the door, she was greeted by 3 pairs of familiar purple eyes, all looking angrily at her. You sat in her womb, comrpessed by the tight flesh, as you hear a familiar voice: Carmen's.<br>\r\n<br>\r\n\"Gilda.....WHAT THE HELL!?!?!?\"<br>\r\n<br>\r\nYou gulp. Carmen wasn't just mad.......she was fired up.<br>\r\n<br>\r\nGilda let out a soft giggle. \"Oh, whatever do you mean, Carmen?\"<br>\r\n<br>\r\n\"TAKE HIM OUT NOW!\"<br>\r\n<br>\r\n\"Aww. But he felt so good going in. I can't just let something so good-\"<br>\r\n<br>\r\n\"NOW!!!!\"<br>\r\n<br>\r\nAs soon as that final shout pounded your ears, even from inside the womb, the walls around you contracted, starting to push you out. You hear Gilda moaning in a bit of pain, as if giving real birth, and soon you move in the womb, seeing the light of the outside inf front of you.<br>\r\n<br>\r\nThen, with a final push, you are launched out of the womb and onto the floor, covered in juices again, this time vaginal. You look up and see the silver-haired Carmen, who wasn't looking back, but staring intently at Gilda.<br>\r\n<br>\r\nGilda pouted. \"There, happy?\"<br>\r\n<br>\r\n\"No, I'm not! You just took Daniel into your womb, probably with intensions of keeping him for yourself. You whore!\"<br>\r\n<br>\r\n\"Excuse me, but weren't you the on making everyone back off of him while you are being his 'bodyguard?' If you ask me, you aren't as pure as you lead on.\"<br>\r\n<br>\r\nAt this, Carmen blushed and glared. \"I am protecting him from wild Pokemon and the likes of you! Don't think I would stoop down to your level, metal for brains!\"<br>\r\n<br>\r\nGilda was now fired up. \"Just accept it. You like him and don't want any other girl to have him. I know you have three heads, but that brain of yours must have split up between them.\"<br>\r\n<br>\r\nCarmen grited her teeth, her head pulsing. \"I just got done teaching Harriet a lesson....I don't want to wreck the house fighting you.\"<br>\r\n<br>\r\n\"Oh, someone is scared.~\"<br>\r\n<br>\r\nAfter that, Carmen......</span></div></div>",
            "created":1367332380,
            "id":1581645,
            "title":"Rivalry"
        },
        "11111211111111111112":{
            "author_id":"bonecrusher98",
            "author_name":"Bone",
            "choices":[
                "Go see how Carmen is doing",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Hey I was wondering what was going on in there said Tina <br>\r\nOh I was just letting Daniel to sleep for a bit said Gilda<br>\r\nOk oh was your belly so large before said Tina <br>\r\nI haven't been working out an eating to much lately and what is this twenty question asked Gilda <br>\r\nNo I was just wondering said Tina and the she left </span></div></div>",
            "created":1466379000,
            "id":2166764,
            "title":"Tina is there."
        },
        "111112111111111111122":{
            "author_id":"bonecrusher98",
            "author_name":"Bone",
            "choices":[
                "9 months later",
                "Carmen come home and sees what happened"
            ],
            "content":"<div class=\"\"><div> <span>Daniel was wondering if Gilda would let him out and she said Gilda how long do you plan to keep me in here for.<br>\r\nFor about nine months I think<br>\r\nDaniel was about to ask why until a umbilical cord attached to him. <br>\r\nOh don't worry about who  you used to be because of us mettagross are part robotic your mind with restart it's self said Gilda <br>\r\nAs soon as she said that Daniel fell asleep</span></div></div>",
            "created":1467506880,
            "id":2174344,
            "title":"Inside the belly"
        },
        "1111121111111111111222":{
            "author_id":"bonecrusher98",
            "author_name":"Bone",
            "choices":[
                "9 months later",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>It took Carmen about a week to finish the Nidoqueen and come back to the house <br>\r\nSo where is Daniel ask Carmen <br>\r\nAs she was say that Gilda came from her room to see her  <br>\r\nWhy is you belly so large asked Carmen <br>\r\nOh it a baby of mine and I got her about a week  ago said Gilda <br>\r\nIs that Daniel cause if it is I'm going to get him back said Carmen<br>\r\nOh it is him but if you get him now it kill him said Gilda <br>\r\nI hate you so much said Carmen <br>\r\nAfter that she left the house and went back to her cave till next time </span></div></div>",
            "created":1467517020,
            "id":2174440,
            "title":"Carmen come home and sees what happened"
        },
        "12":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Vines wrap around you.",
                "You smell a sweet scent.",
                "You hear a rustling."
            ],
            "content":"<div class=\"\"><div> <span>You see a ton of green in your blurred vision, and little spots of sunlight. As you start regaining your vision, you see massive trees and various types of green plants. You push yourself up and your hand is engulfed in plant life beneath you. You slowly come to the conclusion that you are in a forest, maybe even in a jungle. You steadily pick yourself up as the hangover subsides. <br>\r\n<br>\r\nYou don't see any animal life in the area, and you somewhat count yourself lucky. You begin walking to the nearest tree to help yourself stand up as the hangover diminishes. <br>\r\n<br>\r\nAfter a few minutes you seem calm enough to walk normally. You start walking in the direction you were facing, knowing that if you go straight, there would be an end to the forest.<br>\r\n<br>\r\nAfter about half an hour you are still in the forest. You decide to sit down and catch your breath. Then.....</span></div></div>",
            "created":1360645200,
            "id":1530763,
            "title":"A Forest."
        },
        "121":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Eat",
                "Breast Vore",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>As you sit down, you notice a group of vines below your feet. The vines were sprawled across the forest floor, seemingly endless. You look around and you can't find definate matches to any vines, but you shake your head. Right now your main goal is to catch your breath. You lay down and start looking around the forest. Varoius amounts of plant life surround you, but you notice you have not seen any form of animals as you were walking. You ponder this, and then you feel something rubbing against your back. You look down to see a vine slowly moving beneath you. You raise an eyebrow and look to where the vine is leading, which is up a nearby tree. <br>\r\n<br>\r\nYou look back to the vine to see more vines had started to move. You look on the other side and see that the vines had poked out from underneath your back, and you can see their tips wiggling. You get nervous as the vines start sliding out of your back, getting longer. As soon as you realize what is happening, it is too late. The vines lash out and wrap around your body, squeezing tightly. You struggle as the vines crawl around your body, tightening as you do. You then are lifted up into the air, and moving torwards the end of the vines. you scream as you are pulled, and soon you reach the end, your eyes widening.<br>\r\n<br>\r\nConnected to the vines was a small, beautiful girl. she had a creamy skin color and rose red hair. You look at her torso, which dawned a perky pair of C-cup breasts. But underneath those, you shiver in fear. Her skin turned a plant green, and her lower body was that of a Venus Flytrap. The flytrap's mouth slowly opened, revealing its pink insides as if it were an actual mouth awaiting its food.<br>\r\n<br>\r\nYou scream some more, and as you do this, the vines pull you up to the little girl, who was giggling. \"Why, hello there. Aren't you just a delight.\" She had an innocent smile on her face that only filled you with more dread.<br>\r\n<br>\r\n\"W-what's going on? W-what are you?\"<br>\r\n<br>\r\n\"Typical humans. Same old questions. I'm honestly tired of answering, but I guess I should anyway.\" She tightend her grip on you, the force almost unbearable. \"The name's Celia. I'm a Carnivine.\"<br>\r\n<br>\r\nYou continue to look at her in horror. You know of Carnivines in the Pokemon world, but here you are, face to face with a Flytrap girl claiming to be one. \"That....that's impossible!\"<br>\r\n<br>\r\n\"Celia yawned. \"Same old answers too. You are boring me. Now, what shall I do with you?\" Her innocent smile turned into a grin.</span></div></div>",
            "created":1361250000,
            "id":1535276,
            "title":"The Playful Carnivine"
        },
        "122":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "Go up to the girls.",
                "Get the heck out of there."
            ],
            "content":"<div class=\"\"><div> <span>As you stop, your nose picks up a peculiar scent. It smelled sweet, like a bouquet of flowers. As if entranced, you slowly stand up and start walking again, following your nose to the scents direction. You seem to have enough movement control to avoid trees and bushes, but you stumble a bit.<br>\r\n<br>\r\nIn the distance, you now hear a strange sound. Giggling, along with an occasional melodic humming sound. You continues to follow the ever growing scent, and you smile as the sounds get closer. You soon the outside of a small clearing and you regain control of your body. Your eyes spot over a bush two figures moving. <br>\r\n<br>\r\nThe first was tall and slender, with a flower gracefully placed on her head. Her arms swayed delicately. The other was shorter, but she seemed just as graceful as the taller one. Two flowers protruded from her head, and she had a child like smile as she seemed to dance along side the other. Both were naked from the waist up, and both had a form of skirt: the shorter one had a skirt of Whats seemed like grass, the other had a skirt of large petals. <br>\r\n<br>\r\nIt was then you noticed that both of their skin colors were green. <br>\r\n<br>\r\nYou think to yourself what the best possible choice was: Either go up and make contact with the first living things you've seen or run for it....</span></div></div>",
            "created":1360645200,
            "id":1530776,
            "title":"Dancing Flowers"
        },
        "1221":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "Lily decides to have sex with you now.",
                "They wait and drag you to their private garden.",
                "Someone interrupts them!"
            ],
            "content":"<div class=\"\"><div> <span>As you watch the two figures continue to dance, you figured it'd probably be best to try to make contact with them. If they're dancing, that means they've got to have some form of sentience right? Besides, they're dancing is a bit hypnotizing. Not only because of the graceful movements, but both of these figures looked shockingly like women, both with noticeably sized cleavage (The taller one surprisingly having a smaller bust then the shorter one.) and it was a show in itself to see their breasts bounce as they danced. You stop for another moment and ponder the logic of your last thought, you're usually not one to think gutter thoughts, but you noticed that same scent wafting through the air again. Whatever it is that these \"girls\" are doing, it must be producing this weird smell that's hypnotizing you.<br>\r\n<br>\r\nYou quickly shake all the thoughts from your head and just concentrate on getting help as you slowly push your way through the brush. Both of the figures stop their dancing as they hear you rustling the bushes and stare with curiosity as you finally manage to stumble your way out of the bush. \"Uh... Hi there, can you two understand me?\" You nervously stutter as the two girls look at each other and look back at you, the smaller one was the first to speak out. \"Hi there! Yes we can understand you just fine!\" she said happily as she skipped over to you and began to inspect you. She was a lot taller in person then she looked from far away, her head coming to rest around your stomach area. You felt this strange girl tug at your pant leg while she spoke to you. \"You're a weird looking Pokemon! I've never seen or heard of something like you before!\" You gulped nervously as the girl hugged you tightly, she was a lot stronger then you thought she'd be! \"P-pokemon?!\" You yelp as you're squeezed harder. \"You have nice fur...\" the girl says as she rubs her face into your stomach. You quickly pull her away from you and back up a bit. \"You're kidding with me right? I'm not a Pokemon, I'm a human!\" You shout, which makes both of them gasp.<br>\r\n<br>\r\n\"A HUMAN?!\" The bigger woman shouts, however the smaller one quickly covers her mouth. \"SHH!\" The smaller one says as she scoots back towards you. \"You're a human huh? Are you a male?\" You look at the taller one crossing her hands behind her back as she digs her foot into the ground a bit and respond \"Yeah, last I checked I'm a guy.\" The smaller girl jumped a bit at this answer. \"Wow! A real live human! Well, I'm Violet and I'm a Bellossom! My parents thought naming me after a flower was cute I guess. And the big tall silent girl over there is Lily, she's a lilligant! And don't let the size difference fool you, I'm actually 3 years older then her!\" Violet says with a cute grin on her face as both of them walk up to you and curtsy.  \"Bellossom? Liligant? But those are Pokemon... And they don't exist!\" You say in disbelief as Violet giggles. \"Well here we are standing in front of you! And there are other Pokemon too! Although I've heard we look different from regular Pokemon. But we're not important here, YOU are!\" Violet says as she pushes you to the ground rather suddenly. \"M-me? Why am I so important?\" you question as you begin to crawl away from Violet. \"Humans don't exist in this world normally, and there are no more men either. They supposedly wiped each other out years ago. Every so often, human men appear in our world and it's first come first serve on who gets to mate with them!\" Violet says with enthusiasm as a pink cloud gushes from the flowers on top of her head and engulfs your own. You cough as your senses begin to dull a bit, and your body shifts to a more relaxed position. This is the same scent from before, only now it's even stronger! \"Uh... Violet don't you think you're being a bit mean? Maybe we don't have to force him to couple with us if he doesn't want to...\" Lily said in a soft voice as Violet turned to her and shot a bit of a glare. \"Aw c'mon! All guys love to get laid, it's just common sense! Besides, it's not like we're treating him like a slave or anything! He'll just live with us back at our private garden!\" Violet said as she hopped onto you and began to fiddle with your pants zipper. \"I get first dibs, then you can have him for round 2!\" Violet says as she finally unzips your pants and removes your underwear. She ogles at your penis a bit before lifting up her skirt, revealing a perfectly normal set of green legs underneath, along with a normal looking vagina too.<br>\r\n<br>\r\nWith the sweet scent completely blocking out your senses, you just lay on the ground enjoying the smells. Suddenly, you felt something lay on top of you as you look up to see Violet mounting you. She grinned at you playfully and traced a finger down your chest. \"So, how would you like to experience mating with a mature young lady like me?\" You manage to mumble something but she can't understand it and she just giggles at your intoxicated state. Violet finally stuck your penis into her vagina. \"Just enjoy the ride Mister!\" Violet said as she began to gyrate her hips in a manner similar to her dancing. She started off slowly and delicately as you began to harden, then she began to gyrate faster and faster. Both of you began to moan in ecstasy as you were drawing closer to an orgasm. \"Ah! This feels like ah nothing I've ever felt before...\"  Violet stutters as she gyrates at full speed, her breasts rubbing against your stomach and adding to the sexual experience. Finally, both of you orgasm and Violet collapses onto your chest, satisfied with her work. \"That was amazing.\" Violet said as she crawled up to your head and began kissing you all over your face.<br>\r\n<br>\r\n<br>\r\n\"Well....Lily....He's still under the effects of my sweet scent.... Wanna have a go at him here, or wait until we get back to the garden? That way we can get some rest...\" Violet says as she rests on top of you.</span></div></div>",
            "created":1384587660,
            "id":1694870,
            "title":"Flower Plower"
        },
        "123":{
            "choices":[
                "An Apple falling on your head!",
                "Someone or something approaching!",
                "Alternate Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As if on cue, you hear a faint rustling in a nearby bush. \"Huh? Who's there?\". Silence. You put your hand on your head. \"I must be imagining things...\"<br>\r\n<br>\r\nAs you sit there, your attentions shifts as you notice...</span></div></span></div>",
            "created":1379309040,
            "id":1663834,
            "title":"You hear a rustling."
        },
        "1232":{
            "author_id":"renamonplayer",
            "author_name":"eevee",
            "choices":[
                "Houndoom",
                "Espeon",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it going to be a houndoom or an espeon?</span></div></span></div>",
            "created":1518286740,
            "id":2451379,
            "title":"Someone or something approaching!"
        },
        "1233":{
            "author_id":"almost2922",
            "author_name":"Lucius",
            "choices":[
                "...Be crazy and investigate the crypt.",
                "Book it out of the graveyard as fast as you can!",
                "Your thoughts are interrupted as something grabs you from behind!"
            ],
            "content":"<div class=\"\"><div> <span>As you continue to look around to pinpoint the location of the rustling, your eye catches a light shining deeper into the forest. You quickly make your way to the light, pushing through all of the foliage until finally you manage to fight your way out of the forest entirely. However, when you exit the forest you find out that the light was nothing more then a candle sitting on a stone. You inspect the stone a bit more and find out that it's a tombstone!<br>\r\n<br>\r\nSeems as though you've stumbled into a graveyard in the middle of this forest. You began to walk through the graveyard to continue your trek through the forest, and as you walk you get the strange feeling that someone is watching you. But the feeling of being watched isn't the only thing you're feeling, you feel as though whatever's watching you is creeping it's way closer to you as well.<br>\r\n<br>\r\nAll of a sudden you hear the sound of a nearby crypt door creaking open, and see a light disappear inside of it.<br>\r\n<br>\r\nThis place is really starting to freak you out, but you decide to...</span></div></div>",
            "created":1384842600,
            "id":1696344,
            "title":"Grave Matters"
        },
        "13":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "A Dodrio Girl",
                "A Luxray",
                "A Growlithe Girl",
                "A Pidgeotto",
                "An Arbok Girl"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes are blinded by the sunlight as they peel open to look at a bright blue sky. You put a hand on your head as the light triggers your hangover severely. You sit up, your head pounding as you recover. You start looking around, seeing grass for miles as you come to the conclusion that you must have wandered into a field. However, this field was unfamiliar; behind you was a dense forest, with a mountain peaking out at the top. And in front of you, there seemed to be nothing but grass and a few trees as far as you could see.<br>\r\n<br>\r\nYou stumble to stand up, the effects of the hangover starting to wear off. Soon you gain enough mental strength to start walking. You head out to the field, not knowing what might lurk in the forest. You hope to keep walking until you find some kind of civilization.<br>\r\n<br>\r\nAbout an hour passes and still you are in the field. You don't know even how far you've gone, but you decide to rest on the grass a bit.<br>\r\n<br>\r\nBut then, you hear something directly behind you. You turn around and see.......</span></div></div>",
            "created":1361336400,
            "id":1535987,
            "title":"A Field."
        },
        "14":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "A Long White Body",
                "Glowing Red Lights",
                "A Shark Fin",
                "A Giant Blue Body",
                "Angry Eyes and A Giant Mouth"
            ],
            "content":"<div class=\"\"><div> <span>The dirt beneath your hands seems to be mixed with sand. You look up and see tropical trees above, with clear blue sky peaking through the leaves. You stumble a bit as you stand and try to regain balance. You feel a chilling wind blow and you stumble a bit more. You prop yourself up on a tree for a few minutes while you wait for the hangover to subside.<br>\r\n<br>\r\nYou see more light coming from a break in the trees, and after a few minutes of rest, you start walking in that direction. As the wind blows you smell salty water, and before your impaired thinking could deduce you whereabouts, you step out onto a sandy beach. As your mind recovers, you come to the conclusion that you are in some tropical area. You look out and see an ever expanding view of water. Nothing else in sight; no other landforms or signs of life could be detected. You decide to walk along the beach to see if you can find any civilization.<br>\r\n<br>\r\nAfter about half an hour you still are walking on the beach. You get a bit tired, and as you hang your head a bit, you see another set of footprints next to you. You look up and see the trail of other footprints continue as they curve along the beach. You decide to place your foot in one of the footprints, and sure enough, your feet match the imprint. Your now recovered brain realizes you are on an island.<br>\r\n<br>\r\nYou look out to the water and start to think the usual: what happened? How did I get here? How do I get off?<br>\r\n<br>\r\nYou then see something in the water. You can barely make it out, but something ripples the water and seems to be getting closer. You squint your eyes to try and make it out. Then, what you see is.........</span></div></div>",
            "created":1360731600,
            "id":1531304,
            "title":"An Island."
        },
        "145":{
            "author_id":"phazoid3",
            "author_name":"Phazoid",
            "choices":[
                "The Gyrados Becomes a Girl",
                "Eaten",
                "Something Saves You"
            ],
            "content":"<div class=\"\"><div> <span>There are very few things that a Pokemon Trainer really fear if it was a real life situation. One of the first things you learned from watching anime is that some Pokemon can get angry for reasons uncertain. The biggest fear you ever had was being confronted by a real life Gyrados. A giant rage-aholic monster that could send humans and smaller Pokemon running for the hills in the old days. So much pent up aggression from being a Magikarp that was suddenly unleashed as it evolves. <br>\r\n<br>\r\nYour worst fear was about to come true.<br>\r\n<br>\r\nYou look out into the water and a pair of glaring eyes have spotted you. You shake your head, thinking you were seeing things, but soon the eyes rose out of the water, revealing a giant fanged mouth. If your pants weren't moist from the waves splashing on them, they were now as you see the serpentine body rise from the water, the eyes of the beast locked onto you. <br>\r\n<br>\r\nYou stare back in absolute fear, your mind racing. You continually tell yourself that Gyrados's weren't real, but your eyes made out ever detail of the beast believable. <br>\r\n<br>\r\nThe Gyrados roared at you, the force making you flinch. Your feet slowly start moving like your brain tells them to, and you book it towards the land. The Gyrados lets out another roar as it fires a powerful stream of water at you. The blast lands beside you and the force knocks you off your feet.<br>\r\n<br>\r\nYou fall on the sand.Your body refuses to move, both paralyzed with fear and wrecked from the water blast. You manage to turn and see the beast slithering closer, it's body coming onto the sand. You cringe and close your eyes, preparing for the worst.....</span></div></div>",
            "created":1360731600,
            "id":1531307,
            "title":"A Pokemon Trainers First Nightmare"
        },
        "1451":{
            "author_id":"gunmun",
            "author_name":"gunmun",
            "choices":[
                "You help Gwen out",
                "Gwen loses patience and literally rips them off",
                "You push her away, It's going to fast."
            ],
            "content":"<div class=\"\"><div> <span>You cower in fear expecting to be vaporized or eaten instead you hear \"Wake up, I know I missed you.\" Said a demanding female voice. You hesitantly opened your eyes to see a cyan skinned girl glaring down at you with the same red eyes the gyarados looking at you with before. Her hair was greenish blue with two white strands running over her shoulders and to a pair large cream colored breasts. Said breasts  barely contained within a small bikini which matched her eyes. You forced yourself to look lower, following the cream color to a well toned stomach with visible abs. Her hips then flare dramatically out leading you to discover that instead of legs, the girl has the body of gyarados like a mermaid or, more appropriately, a naga, though it's only half the size it was coming out of the water. The spot where the human ends and the tail starts is covered by what looked like a cross between a red bikini bottom and a loincloth. \"Hey! Eyes up here!\" The girl suddenly shouted making your gaze shoot back up to her face.<br>\r\n<br>\r\n\"Now what's a weird looking pokemon like you doing on my island?\" she asked glaring looking ready to strike.<br>\r\n<br>\r\nYou stammer nervously \"I-I don't know, I just woke up here and I'm not a pokemon I'm a human.\"<br>\r\n<br>\r\nThe gyarados girl's face changes to one of surprise \"A human? A male human?\"<br>\r\n<br>\r\n\"Yeah last time I checked...\" You say to her.<br>\r\n<br>\r\n The gyarados smiled lustfully \"Well then looks like it's Gwen's lucky day, and yours too~\" She said reaching around her back.<br>\r\n\"What do you mean?\" you ask<br>\r\n\"Humans don't normally exist in this world, but ever since the all the males wiped each other out a human male taken from wherever you're from and randomly appears here.\" She gets the knot open and lets her bikini fall. \"And that human helps start the next generation.\" Her half cream and cyan E cup breasts wobble a bit before settling on her chest. She then undoes her bikini bottom and let it fall showing a surprisingly human like pussy in an indent when her human half mets the gyarados half.  By the time you comprehend what's going on she's already trying to undo your pants letting out a growl in frustration.</span></div></div>",
            "created":1466553060,
            "id":2168210,
            "title":"The Gyrados Becomes a Girl"
        },
        "14512":{
            "author_id":"gunmun",
            "author_name":"gunmun",
            "choices":[
                "She rides your mast.",
                "One of her friends interupt."
            ],
            "content":"<div class=\"\"><div> <span>You're just too stunned to do anything, one moment you were falling into bed after a party, the next you're on an island being attacked by a monster from a game, and now this monster is a girl(or part girl) and is trying to fuck you. Gwen snaps you out of your thoughts with a frustrated  grunt and just pulls hard on your pants, the fly rips open and tears down the crotch, ruining them. The gyarados naga looks down and sees your cock, tenting your pants. With a grins sher reached in a pulled out your manhood.<br>\r\n<br>\r\nGwen grins wider at your size \"Sweet Kyogre I hit the jackpot!\" She exclaimed and got down and started licking your manhood, her long serpent-like tongue coiling around your cock. \"mmm Sorry for the...hydro pump...by the way\" she said between licks. \"me and...my friends protect...these isles for...kyogre. Her blue orb\" at that her tongue moved down to lap at your balls. \"She doesn't say... for what but...it's really important to her.\"  Her tongue moves back up to your cock head and she tastes some of your precum \"Time for the main corse\" she said and wraps her tongue around your whole shaft before taking half of it into her mouth. <br>\r\n<br>\r\nYou've gotten blown by girls before but this was something else The tightness of Gwen's moth as she bobs up and down your cock combined with that coiling had you moaning in seconds, which made Gwen go faster and harder, her tognue slithering up and down your cock like a snake. You finally cum, shooting hot white cum into her throat. <br>\r\n<br>\r\n\"mmm\" the garados said pulling off your cock. \"So salty but so good~\" she said \"But now for the main course.\" she said rearing up on her tail, showing that glistening slit.</span></div></div>",
            "created":1479395280,
            "id":2238294,
            "title":"Gwen loses patience and literally rips them off"
        },
        "145122":{
            "author_id":"gunmun",
            "author_name":"gunmun",
            "choices":[
                "...let him deside~\"",
                "...Share him~\" (threesome~)"
            ],
            "content":"<div class=\"\"><div> <span>Right before the gyarados could from the beast with two backs with you she is interrupted by a voice calling \"Yo Gwen!\" The water naga turned and you both saw a sharpedo in the water \"You coming to the trade off and why are you in human form...nude\" She looks over and notices you \"Is that a...\" There was a glow under water before she moved onto the beach. <br>\r\n<br>\r\nUnlike Gwen she was an actual anthro with legs. Her head was like a sharpedo, obviously, With a snout and red eyes and black sclera.  Most of her body was a dark navy blue though on her forehead was a yellow cross. Her mouth, lined with sharp teeth was a blueish grey. There were three fins around her head too, one on top and two on the sides. Moving down her body, it was mostly the same dark navy but with line of the dark grey which started as a point between her cleavage but getting wider down her belly which looked like she was either pregnant or swallowed a bowling ball. Aside from that bulge the pokegirl looked to be in wonderful shape with clear athletic muscles including a nice tight, perfect rear. Your eyes once gain drift to her belly and she notices. \"hold on a sec\" she starts retching and coughs up a blue orb and places it in the sand her stomach returning to her figure, tight and athletic like the rest of her.<br>\r\n<br>\r\n\"So anyway...\" She stats wiping off her mouth \"Gwen's caught herself a human~\" she walks over, putting a sway in her step to make her C-cup breasts jiggle under her purple bikini \"and what a catch he is~\" She said eyeing your cock as the saliva covered member glistened in the (presumably) tropical sun.<br>\r\n<br>\r\nGwen growled \"Back off fishface, he's mine!\" she said angrily \"I found him, Yumi I get first shot!\"<br>\r\n<br>\r\nThe sharpedo was unfazed by the outburst \"Temper temper Gwen. and looks like you already got a shot off of him.\" she paused and sniffed \"I can even smell it.\" She said rubbing her thighs together and you notice a dark patch on her cyan blue blue bottoms<br>\r\n<br>\r\nGwen just grew more angry \"That wasn't sex, just foreplay!\"<br>\r\n<br>\r\nWanting to avoid a catfight, you finally speak up \"Um girls you don't have to fight over me.\"<br>\r\n<br>\r\n\"You back off too human!\" Gwen roared though seemed to regret it afterward<br>\r\n<br>\r\nNoticing this Yumi spoke \"Nah he's right don't want to get bloody before I trade off the blue orb. I got better way we can enjoy...\" Yumi left it handing motioning at you. <br>\r\n<br>\r\n\"Daniel, Daniel Redock\" you introduce yourself<br>\r\n<br>\r\n\"Daniel without fighting.\" She continued <br>\r\n\"I'm listening\" Gwen stated <br>\r\n\"We...</span></div></div>",
            "created":1479401820,
            "id":2238313,
            "title":"Cock blocked by shark tits."
        },
        "1451221":{
            "author_id":"gunmun",
            "author_name":"gunmun",
            "choices":[
                "Yumi",
                "Gwen"
            ],
            "content":"<div class=\"\"><div> <span>Gwen smirked  and nodded \"Fine~\" she said  coiling her tail behind herself and looking to you.<br>\r\n<br>\r\nYumi smirked and pulled off her swimsuit, letting her breasts wiggle free,  then pulled her bottoms down slowly, calling attention to her shapely legs. When done, she turned her back to you and looked over her shoulder at you. She spanked her ass, relaxing it so the slap rippled over the smooth feminine hills. <br>\r\n<br>\r\nNot wanting to be out done, Gwen placed her hands on her wide hips where her human half met her gyarados half, gyrating them while pushing out her chest. The gyrations making her breast wobble to the left and right.<br>\r\n<br>\r\nThe only question now is, which one gets hooked on your rod?<br>\r\n</span></div></div>",
            "created":1479406620,
            "id":2238339,
            "title":"The serpent or the shark?"
        }
    },
    "info":{
        "author_id":"phazoid3",
        "author_name":"Phazoid",
        "brief_description":"A land filled with Pokegirls, and you are the only male.",
        "created":1360683300,
        "description":"<td align=\"left\" class=\"norm\">I do NOT own anything if the Pokemon franchise, Nintendo, or anything in this story other than the personality of the characters. <br>\r\n<br>\r\nAdding to this story is encouraged. Please help the story grow. The main story is the longest, but please only add to chapters of the main story that have 1 choice lready filled.<br>\r\n<br>\r\n<br>\r\nDaniel Redock has found himself in the wilderness, only to later discover he has be put into a world filled with Humanoid Pokemon Girls. While exploring this world he catches the eyes of a few Pokegirls, being the first male they have seen in years. He is dragged to a house filled with gorgeous woman, and the story goes from there. How did Daniel get here? And why? You help create his adventure, whether he gets severely laid, or actually manages to get back home.<br>\r\n<br>\r\n<br>\r\nBasic rules and reg:<br>\r\n1: NO DYING! Not deaths will happen in this story.<br>\r\n2: You can use any of the 649 current Pokemon that can be portrayed as a girl. Ex: Kyogre and Groudon can be Girls, but Gallade cannot because he is a male only Pokemon.<br>\r\n3: Sex is allowed, even encouraged. Rape scenes will be reviewed for appropriateness.<br>\r\n4: Soft vore is allowed. But again, no dying. Oral, breast, and unbirth only.<br>\r\n5: Daniel must not leave until that storyline reaches at least 150 chapters. <br>\r\n6: Be creative and descriptive. What's the point of writing a scene if there is no visuals?<br>\r\n7: Bad grammar and spelling will not be tolerated. Be respectful of the story.<br>\r\n<br>\r\nRules shall be added depending on what I've forgot to put in.<br>\r\n<br>\r\nHave fun.<br>\r\n<br>\r\n</td>",
        "id":1918981,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1518286740,
        "modified":1518286740,
        "pretty_title":"Pokegirls: Into the Unknown"
    }
}