{
    "chapters":{
        "1":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "An individule",
                "A group"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Many ponies, many options, let's get started.</span></div></span></div>",
            "created":1520658000,
            "id":2462768,
            "title":"Standard choices"
        },
        "11":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "One of the Mane Six",
                "One of the Royals",
                "A Ponyville Resident",
                "One of the Crusaders",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start with some basic choices.</span></div></span></div>",
            "created":1520658000,
            "id":2462769,
            "title":"An individule"
        },
        "111":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Twilight Sparkle",
                "Rarity",
                "The next two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The central characters.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1520658000,
            "id":2462770,
            "title":"One of the Mane Six"
        },
        "1111":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "With wings",
                "Without wings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The magic master huh?<br>\r\n<br>\r\nWould you prefer her before or after the wings?<br>\r\n</span></div></span></div>",
            "created":1520658000,
            "id":2462771,
            "title":"Twilight Sparkle"
        },
        "11111":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Idea 1: Power goes right to the head, and gut",
                "Idea 2: Offerings for the Princess",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, let's get to the fun stuff.</span></div></span></div>",
            "created":1520658000,
            "id":2462772,
            "title":"With wings"
        },
        "111111":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "A new idea please"
            ],
            "content":"<div class=\"\"><div> <span>After becoming a princess Twilight learns just how much power she has both politically and magically. At first hesitant to abuse them, she soon comes to very much enjoy all the perks, her biggest indulgence being food. This combined with her normal routine of reading and nopony even so much as daring to tell the Princess she's getting a bit rounder leaves her rather weighty.<br>\r\n<br>\r\n</span></div></div>",
            "created":1520658000,
            "id":2462774,
            "title":"Idea 1: Power goes right to the head, and gut"
        },
        "1111111":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "She goes to get something in another room and gets stuck in a door",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>A few weeks ago if some pony had told Twilight that she would be a princess, she would never have believed you. Unless it was her future self, in which case she’d have an endless barrage of questions.<br>\r\n<br>\r\nBut now being a Princess felt second nature to her. At first, she had been embarrassed at the stares and crowds she had attracted, now she almost basked in it. She used to hesitate to receive the special favors offered to her, or even mention her position, now she embraced it. A lot of those favors were instant service or even free food at restaurants, which she was shy about accepting at first, but now eagerly devoured. Twilight had a modest appetite as a unicorn, but as an alicorn it grew every day, which had worried her at first but now she enjoyed it. She was sure she was getting bigger, and a growing pony needed her food.<br>\r\n<br>\r\nShe was currently laid out on her study floor, reading a thick spellbook while nibbling at another bowl of sweets Pinkie pie had prepared for her after a visit to Sugar Cube Corner. She reached over for another bite, only to find the bowl empty.<br>\r\n<br>\r\n“SPIIKKEEE!” Twilight shouted, louder than she had intended, but all the same the young dragon ran in frantically.<br>\r\n<br>\r\n“What is it thi- I mean what do you need?” He asked nervously. Twilight didn’t understand why Spike or her friends had been so nervous around her as of late, though she preferred this to Spike’s old lippyness.<br>\r\n<br>\r\nShe levitated the bowl into his hands.<br>\r\n<br>\r\n“Another refill please!”<br>\r\n<br>\r\n“Right away!” He ran off without a second thought.<br>\r\n<br>\r\nTwilight didn’t think much of this until she stood to leave the room</span></div></div>",
            "created":1521435600,
            "id":2466434,
            "title":"As heavy as your responsibilities. "
        },
        "11111111":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "1",
                "2",
                "3"
            ],
            "content":"<div class=\"\"><div> <span>Grunting from the effort of standing up Twilight's body jiggled slightly as she did so. <br>\r\n<br>\r\nAside from how suddenly it had come about, Twilight current softer form wasn't at all displeasing to look at. For now it was only a small gain, yet it was defffinitly noticeable, filling out her curves and overall giving a \"Fuller\" look. Her flanks had filled out as two inticing purple orbs sporting her slightly larger cutie marks, her face was the least affected but you could see some padding was added to her cheeks, her legs where a tad thicker and if you looked very closely a bit taller as well, and lastly was her biggest change, her tummy. It visibly hung from her body and would sway just a teensy bit when she walked, now two inches of flab protruding outwards from when it had been trim.<br>\r\n<br>\r\n\"I'm starting to really regret keeping a privet collection of books in my room.\"<br>\r\n<br>\r\nNow on her hooves, Twilight walked over to her staircase and ascended to her bedroom to retrieve a book she wanted to read. Reaching her room Twilight opened the door and went to walk in only to be stopped by something gripping her sides unexpectedly.<br>\r\n<br>\r\n\"OOF! What the-?!\"<br>\r\n<br>\r\nTwilight had gotten stuck in the doorframe by her stomach!<br>\r\n<br>\r\n\"Twilight?\"<br>\r\n<br>\r\nLooking behind her the best she could Twilight called out to Spike.<br>\r\n<br>\r\n\"I'm up here Spike, and I could use some help!\"<br>\r\n<br>\r\nThe next ten minutes where spent grunting, pulling, shoving, and applying butter until Twilight popped out with a heavy thud as she landed on the floor, Spike walking in behind her and cleaning his hands of excess butter.<br>\r\n<br>\r\n\"Ugh..thanks, Spike.\"<br>\r\n<br>\r\n\"Yeah, no problem...hey Twilight, there's something I'd like to ask you, just don't take it the worng way, okay?\"<br>\r\n<br>\r\nStanding up again Twilight looked at her little assistant questioningly.<br>\r\n<br>\r\n\"What is it Spike?\"<br>\r\n<br>\r\n\"Well...don't you think you're getting a little on the...heavy side? I mean, you DID just get stuck in a door.\"<br>\r\n<br>\r\nTwilight paused and thought about Spike's question for a moment before replying-<br>\r\n<br>\r\n1: \"Don't be silly Spike, it's getting close to winter so the door just shrunk is all!\" (Oblivious path)<br>\r\n<br>\r\n2: \"I'm growing into my role as Princess, if the door can't handle my alicorn growth spurt then we'll just have to get it widened to accommodate me.\" (Self-indulgent path)<br>\r\n<br>\r\n3: Something Else</span></div></div>",
            "created":1521435600,
            "id":2466702,
            "title":"She wants something from her room and gets stuck."
        },
        "111111111":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "A few days later",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't be silly Spike, it's getting close to winter so the door just shrunk is all!\"<br>\r\n<br>\r\nSpike stared blankly at her. How could someone so smart say something so stupid? He rolled his eyes.<br>\r\n<br>\r\n“Twilight you know the door frame hasn’t shrunken.”<br>\r\n<br>\r\nTwilight looked uncomfortable for a second, but stood steadfastly. <br>\r\n<br>\r\n“Really Spike it's nothing, things often shrivel up in the cold.”<br>\r\n<br>\r\nTo Spike’s disgust, Twilight was levitating or slurping up the leftover butter while she spoke.<br>\r\n<br>\r\nWalking over to the door frame Spike held out his claws. Even with his arms outstretched to their fullest he still had room to walk through the door.<br>\r\n<br>\r\n“See? I can easily get through the door frame and with a whole bunch of room left over.”<br>\r\n<br>\r\n“Well yeah but you’re a lot smaller than me. And I’ve grown lately.”<br>\r\n<br>\r\n<i>Wider you mean.</i> Spike thought though he dared not speak it.<br>\r\n<br>\r\n“Celestia could get through this door! Though I guess she’d have to duck cause her horn would scrape the top but.”<br>\r\n<br>\r\n“I told you I’m a lot bigger!”<br>\r\n<br>\r\nSpike couldn’t stay calm anymore.<br>\r\n<br>\r\n“You are not as tall as Celestia! You’re f-.”<br>\r\n<br>\r\nTwilight whirled around and stamped a hoof, crushing part of the floor.<br>\r\n<br>\r\n“I’m what?!” She glared at him and snorted like a bull.<br>\r\n<br>\r\nSpike backed away and held up his palms.<br>\r\n<br>\r\n“Uhh nothing.”<br>\r\n<br>\r\n“That’s what I thought.” Twilight walked away and headed down the stairs, each one creeking and groaning from the impact of her body. After only a few steps she decided she couldn’t be bothered anymore and disappeared in a purple flash.<br>\r\n<br>\r\nSpike was confused, she had come up here for something right? Then why had she just left all the sudden? Oh no... the confrontation must have put her in a bad mood, and lately whenever she was in a bad mood she would eat.<br>\r\n<br>\r\nSpike heard a loud thud as she materialized, presumably in the kitchen. Then he heard the familiar sound of cupboards being flung open and crunching, as Twilight presumably ate everything in sight. He listened with a mixture of dread and fascination. Twilight had acted this way before but her denial was getting more aggressive and her eating sessions were getting longer. Twilight was probably going to force him to do another food run tomorrow and he didn’t know if he’d be able to carry everything she wanted.<br>\r\n<br>\r\nAfter what felt like an eternity, Twilight teleported back into her room, the floor shaking as she appeared. Surrounding her in the usual purple fog were several bowls of candy and various pastry boxes, now seemingly in a better mood.<br>\r\n<br>\r\n“What are those?”<br>\r\n<br>\r\n“Just some light snacks.” She smiled. “Now where was I?”<br>\r\n<br>\r\nSpike couldn’t stand to watch any more of this and walked away. He thought about writing a letter to Celestia, but he was scared of how Twilight might react and Celestia was away from Canterlot on an important diplomatic mission. Still, with Twilight this deep in denial how bad would things get before she would be willing to listen?<br>\r\n<br>\r\n</span></div></div>",
            "created":1521522000,
            "id":2466870,
            "title":"A river in Egypt"
        },
        "11111112":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "1",
                "2",
                "3"
            ],
            "content":"<div class=\"\"><div> <span>1: \"Wait, why am I trying to leave anyway? I can just wait right here and keep reading until Spike brings me my food.\"<br>\r\n<br>\r\n2: \"I'm feeling a bit more peckish than I thought I would be, I'll go grab some more snacks so Spike won't take up time with two trips to bring them to me.\"<br>\r\n<br>\r\n3: Something Else</span></div></div>",
            "created":1521435600,
            "id":2466659,
            "title":"Something else"
        },
        "111112":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "A new idea please"
            ],
            "content":"<div class=\"\"><div> <span>Twilight is settling into her new life after becoming the newest Princess of Equestria when she get's a surprise at her front door, a pony bringing an offering of food for the new Princess! As it turns out, it's an old tradition that it's good luck to bring an offering of some kind to a princess, and one of the easiest and quickest offering to present is of course food! Twilight feeling a combination of obligation as Princess, appreciation for the kind offer, and plus Ponyvillians cooking just being plain good, took every offer given to her. And so the offerings keep coming and Twilight just keeps eating them, refusing to let Spike or her friends help her eat them as it would ruin the tradition in her opinion. But just how many offerings can she handle?</span></div></div>",
            "created":1520658000,
            "id":2462778,
            "title":"Idea 2: Offerings for the Princess"
        },
        "1111121":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "A few days later",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Twilight hadn’t been a Princess for long. She hadn't been sure how Ponyville would react, but she really wasn’t prepared for this.<br>\r\n<br>\r\nTwilight groaned as another knock came to her door. She had been prepared to tackle any duty required of her as a princess, but she never thought she’d have to face anything like this. Reluctantly she approached the door and forced a smile on her face.  At the door stood another group of ponies holding up another pastry basket. At the sight of Twilight, they bowed.<br>\r\n<br>\r\n“Hello, Princess Twilight! We bring you an offering!”<br>\r\n<br>\r\n“Yeah, I figure- Uh, I mean thanks, your offering is appreciated.” <br>\r\n<br>\r\nShe grasped the bundle of food and levitated it over with the others, having already accumulated a pile as high as Twilight herself and considerably wider. Her fake smile still on her face, Twilight waved at them as they left then closed the door. Spike was sitting nearby, watching the whole ordeal with bemusement.<br>\r\n<br>\r\n“Another one huh?”<br>\r\n<br>\r\n“Yeah...ever since I’ve become Princess ponies keep bringing them here. Apparently, it’s good luck to make an offering to a Princess and the easiest thing to offer a Princess is food.” <br>\r\n<br>\r\nTwilight sighed with exasperation. <br>\r\n<br>\r\n“And one of the duties of being a Princess is keeping up my public image. Though I have no idea who came up with the whole offering thing.”<br>\r\n<br>\r\nSpike smirked.<br>\r\n<br>\r\n“I’m guessing Celestia, there were probably times she visited Ponyville and it was a convenient way of scoring free food.”<br>\r\n<br>\r\n“That’s pretty cynical, but I guess it makes sense.”<br>\r\n<br>\r\n“<i>So</i>, what are you going to do with all of your “offerings”.” <br>\r\n<br>\r\nSpike actually made air quotes as he said that. <br>\r\n<br>\r\n“Give them away maybe?”<br>\r\n<br>\r\nTwilight checked the windows. As per usual crowds of ponies were gathered outside each one.<br>\r\n<br>\r\n“Hmm, I’m under constant surveillance, so I don’t think I could do that or get rid of them any other way. I’m sure its bad luck for me to get rid of them.”<br>\r\n<br>\r\n“Or knowing Celestia share any of them...”<br>\r\n<br>\r\n“Yeah.” <br>\r\n<br>\r\nTwilight sighed again, then took a deep breath. <br>\r\n<br>\r\n“Well I’m a Princess and I have a duty to do however bizarre…” <br>\r\n<br>\r\nShe levitated a bib from the kitchen, tied it around her neck, then walked towards the pile of baskets with a determined look on her face.</span></div></div>",
            "created":1521522000,
            "id":2467027,
            "title":"An offering (+ twenty) a day keeps the hunger away"
        },
        "11111211":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "1",
                "2",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>1: Twilight can't keep up with all the offerings, getting too full too fast, and hopes that asking Celestia and/or Luna for advice will help.<br>\r\n<br>\r\n2: Twilight is surprised to find that being an alicorn has given her a greater appetite, allowing her to manage the large quantities of food better than most would have, but it's still a lot of food...</span></div></div>",
            "created":1521692700,
            "id":2467606,
            "title":"A few days later"
        },
        "111112112":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "She gets through the next bunch",
                "She finally reaches her limit and can't eat anymore",
                "She's interrupted by something or someone"
            ],
            "content":"<div class=\"\"><div> <span>Twilight didn't know how she did it, but she got through all the offerings.  Maybe it had something to do with being an alicorn?<br>\r\n<br>\r\nThough she tried not to indulge in it in front of her, there were times Celestia had managed to put away a surprising amount. But then how did she manage to remain so thin?<br>\r\n<br>\r\nWhile she had put away an impossible amount of food, an amount she was sure was several times her own body mass, she had not managed to keep her thin figure, some of it going to her face, giving her, large, round cheeks, most of it going everywhere else, especially to her stomach making her much larger overall. Sprawled across her sitting room she felt like a land whale.<br>\r\n<br>\r\nIt was obvious to Twilight that she should be worried, but for some reason, she felt relaxed and content. With some effort she rolled over, causing the room to shake. She still wondered how she was even able to eat all that. <br>\r\n<br>\r\n(I guess there's still much about Alicorn biology I still don't know...)<br>\r\n<br>\r\nSpike walked in and recoiled at the sight of her.<br>\r\n<br>\r\n\"Woah Twilight!\" <br>\r\n<br>\r\nHe was momentarily speechless. <br>\r\n<br>\r\n\"Uhh...I don't think this was a good idea.\"<br>\r\n<br>\r\n\"Maybe.\" <br>\r\n<br>\r\nShe slowly shifted again. <br>\r\n<br>\r\n\"But I can still move and I guess Ponyville is happy.\" <br>\r\n<br>\r\nShe didn't want to admit she had started to enjoy it.<br>\r\n<br>\r\n\"Uhh...I didn't want to tell you this but while you were getting through that a whole bunch more came in.\"<br>\r\n<br>\r\n\"Oh that's fine.\" <br>\r\n<br>\r\nTwilight sounded calm. Spike wondered if she was about to have a breakdown, but the smile on her face seemed genuine. <br>\r\n<br>\r\n\"Well, I guess its time for seconds!\" <br>\r\n<br>\r\nHer horn shone, and a purple glow filled the hall as the new offerings came to her.<br>\r\n<br>\r\n\"Twilight  what are you doing?\"<br>\r\n<br>\r\n\"It's fine, I got this!\"</span></div></div>",
            "created":1521738060,
            "id":2467823,
            "title":"Bigger appetite, more offerings, larger Twilight."
        },
        "11112":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Idea 1: Celesta the overindulgent teacher",
                "Idea 2: A heavier life in Ponyville",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, lets get to the fun stuff.</span></div></span></div>",
            "created":1520658000,
            "id":2462779,
            "title":"Without wings"
        },
        "111121":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>After coming under the tutelage of Celestia, a young Twilight is delighted to find Celestia acting a lot like her mother, but even nicer! (But don't tell her real mother she said that!) In essence Celestia has developed a complex due to her fight with Luna, making her be overly caring towards others as to make sure they keep loving her, and with the ever too loveable little Twilight now being her student her affection is about to start pouring on quick, just like that extra pour of syrup on the pancakes she makes for her protégé every morning.</span></div></div>",
            "created":1520658000,
            "id":2462780,
            "title":"Idea 1: Celesta the overindulgent teacher"
        },
        "111122":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>After the defeat of Nightmare Moon and moving to Ponyville Twilight is finding just how obsessed with food the little farming town is. Farmers always pushing their goods when they can, festivals for just about everything imaginable, eating competitions of every variety, and just the general love for cooking was all new to the city born Twilight, though she isn't complaining. The foods all so much better than anything she could have in Canterlot, and it shows the longer she stays in the town. Her waistline takes a strong hit as she can't seem to drag herself away from whatever new recipe has been whipped up by one of the residents, not helped by the \"Bigger is Better\" attitude of the locals encouraging her new food intake.</span></div></div>",
            "created":1520658000,
            "id":2462786,
            "title":"Idea 2: A heavier life in Ponyville"
        },
        "1112":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "idea 1: Sweet Sisters Servings",
                "Idea 2: Rarity on the Rise",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The elite seamstress huh?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1520658000,
            "id":2462788,
            "title":"Rarity"
        },
        "11121":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Sweetie Belle has recently been highly interested in finally learning how to cook properly, no longer burning everything she cooks, juice included. And as it turns out she's a really good cook! With a whole new hobby to explore Sweetie goes on a cooking spree trying out recipes and experimenting, with Rarity all too ready to taste test every dish for her. When the constant eating starts to show on her body Rarity is eager to let Sweetie know that she can't be her taste tester anymore, but stops short every time when she sees the excitement to see her big sisters reaction to each new dish, and the meals aren't anything to sneeze at either. And so the fashionista swallows her pride and the next forkful of whatever scrumptious plateful of food Sweetie has prepared for her.</span></div></div>",
            "created":1520658000,
            "id":2462815,
            "title":"idea 1: Sweet Sisters Servings"
        },
        "11122":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>It was a hard choice and harder to pull off, but with a tearful farewell Rarity made the big move to Canterlot proper to start working fulltime as a true Fashionista! And it doesn't take long before business is booming, as word of her excellent work spreads fast across the elites of the rich city. Rarity finds herself both attending more parties and high-class hangouts as she is recognized more and more as an elite herself, and working less and less as more and more ponies of note are spending larger amounts of bits to have her design just a few dresses. As work gets easier and her time spent smooshing with her fellow Canterlotians her figure starts to soften. Can she keep her weight in control or perhaps spin it to her advantage?</span></div></div>",
            "created":1520830800,
            "id":2463435,
            "title":"Idea 2: Rarity on the Rise"
        },
        "1113":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Applejack",
                "Pinkie Pie",
                "The last Two"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Apples and Pies</span></div></span></div>",
            "created":1520830800,
            "id":2463439,
            "title":"The next two"
        },
        "11131":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Idea 1: Burgeoning Business",
                "Idea 2: Big Family, Big Farmer",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The apple farmer huh?</span></div></span></div>",
            "created":1520830800,
            "id":2463440,
            "title":"Applejack"
        },
        "111311":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "A new idea please"
            ],
            "content":"<div class=\"\"><div> <span>The combined fame of being an Element of harmony and close friend of the newest princess plus just plain good apples mean Sweet Apple Acres is doing better than ever. So well in fact that the Apples can't keep up with the demand by themselves anymore and so do the inevitable and start hiring farm hooves. Only a few at first, just enough to cover what the Apples couldn't, but as the farm get's busier they spend less time doing the dirty work and more time managing their new workers. Soon enough Applejack is the CEO of Sweet Apples Acres INC. No longer the hard working farm pony she once was, she now is the sharp-minded yet honest as ever head of the company, the switch from apple farming and bucking to paper signing and filing having a quite obvious effect on her waistline, which is only exacerbated by her ever attentive assistant, Happy Helper, a young and eager mare who's just excited to be working for such a big wig.</span></div></div>",
            "created":1520830800,
            "id":2463441,
            "title":"Idea 1: Burgeoning Business"
        },
        "111312":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes",
                "A new idea please"
            ],
            "content":"<div class=\"\"><div> <span>A farming family of big eaters that specialized in apples and every possible treat you could make from one meant finding a member of the Apple family that didn't have at least a small bit of pudge on them was a hard task. Applejack was a prime example of this as she had no reservations about eating as she pleased and being bigger than the average mare, but recently her friends have been noticing that her appetite has been pretty big recently, even for her, and its starting to show on her already plump frame. Her family on the other hand sees nothing wrong with and even encourages her \"Healthy\" appetite. Will her typically large workload help even out her weight or will she start to out eat even the most strenuous of exercises?</span></div></div>",
            "created":1520830800,
            "id":2463451,
            "title":"Idea 2: Big Family, Big Farmer"
        },
        "11132":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Idea 1: Phenomenal Phenomnomenons",
                "Idea 2: Metabolism Mess",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The pink party pony huh?<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1521522000,
            "id":2466996,
            "title":"Pinkie Pie"
        },
        "111321":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>(For reference this is based on a comic: <a rel=\"nofollow\" href=\"http://mlp.wikia.com/wiki/Friends_Forever_Issue_12\" target=\"_blank\">http://mlp.wikia.com/wiki/Friends_Foreve...</a>)<br>\r\n<br>\r\nNormally Pinkie Pie was allowed a year-long reprieve from the dreaded alure of the surgery treat know as Phenomenons provided by the sisters, Fawn Doo and Marcie Pan, but this year would be the start of many changes, none bigger than the ones that would come to Pinkie. This year the vendors would be setting up permanent shop in Ponyville, the small town being their best hot spot for selling treats, but more importantly was home of their <i>best</i> customer, Pinkie Pie. While they of course do their best to attract as many customers as they can, they focus especially on the poor pink pony as she seemed to have a bottomless bag of bits only matched by her hunger for phenomenons. Though reality eventually does in fact set in and Pinkie runs out of bits, but the sisters are far from done with her.<br>\r\n<br>\r\nIn lieu of bits they start offering the already fattened partier \"deals', she does things for them and she gets free phenomenons. At first simple things such as advertising for them, standing in front of their stand with a sign, and such other things, but as Pinkie gets bigger and her addiction deepens, the sisters demands become more explicit and demeaning. Dressing in enticing uniforms to lure in horny stallions, doing embarrassing promotional stunts like swimming in mud, and even having her perform very special \"personal favors\" for them all while she gets fatter. Through all if though Pinkie is content so long as she gets her fix.<br>\r\n<br>\r\nWill there ever be an end to the sisters depravity or Pinkie's weight?</span></div></div>",
            "created":1521522000,
            "id":2467004,
            "title":"Idea 1: Phenomenal Phenomenons"
        },
        "1113211":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "When the sisters first set up shop in Ponyville",
                "When Pinkie first runs out of bits and gets her first deal",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>From what point would you like to start in the story?</span></div></span></div>",
            "created":1521522000,
            "id":2467007,
            "title":" Go with this idea"
        },
        "111322":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Pinkie's metabolism has always been a thing of legend, consuming party cakes and legions of cupcakes only for it all to somehow melt away without so much as a pound landing on her frame. So legendary in fact that's it's captured Twilight's interest. Hoping to see if she could possibly help the medical world by learning how Pinkie's insane metabolism works and with Pinkie's approval begins experimenting on her. When one experiment is actually successful where Twilight is trying to see if she could transfer Pinkie's metabolism to another pony, things get out of hoof. Pinkie doesn't seem to care rather or not her body can manage her high intake of sweets, they're still going down the hatch, and soon enough the baker's going to look like a rising piece of dough herself. With the spell to transfer her metabolism back not working just how long can Pinkie's body go before even her monster metabolism won't be able to help her anymore?</span></div></div>",
            "created":1521522000,
            "id":2467008,
            "title":"Idea 2: Metabolism Mess"
        },
        "11133":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Rainbow Dash",
                "Fluttershy "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The last two of the main characters.</span></div></span></div>",
            "created":1521692940,
            "id":2467609,
            "title":"The last Two"
        },
        "111331":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Busted Ego",
                "Massive Mascot",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The brash speedster huh?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1521693480,
            "id":2467613,
            "title":"Rainbow Dash"
        },
        "1113311":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>There are very few things that are as dense as Rainbow Dash's ego, so what happens when it is completely destroyed? <br>\r\n<br>\r\nWhen a new Wonder Bolt recruit not only shows that they are capable of doing the fabled Sonic Rainbow just as Dash can but is also a much easier pony to work with in general as well, Rainbow soon finds herself being sidelined before being let go altogether after she has a fit of jealousy. Now in a solid state of depression, Rainbow stops training and working out altogether and instead buries her feelings in comfort food.</span></div></div>",
            "created":1521694440,
            "id":2467617,
            "title":"Busted Ego"
        },
        "1113312":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>After so long Rainbow was finally going to be part of the illustrious Wonder Bolts...as their mascot!<br>\r\n<br>\r\nWhile it wasn't quite what Rainbow had in mind she didn't care, it was just another step closer to reaching her dream, \"Getting her hoof in the door\" she thought. Plus she got to hang out with her idols while also enjoying all the same perks as they do! Anything a Wonderbolt got, she got too, and all she had to do was dance around a bit and do some warm-up stunts for the crowd before the actual show started.<br>\r\n<br>\r\nBut soon enough things start to add up, her little pre-show not measuring up anywhere near the amount of exercise she'd normally go through on her own, free food from concession stands and even restaurants occasionally, hanging around with the team at parties, and just in general getting all the niceties of being a Wonderbolt with less than a quarter of the work lead to Dash putting on some weight.<br>\r\n<br>\r\nBut she didn't notice, she was living the dream! Sure, she wasn't a full-blown bolt, but she got everything she wanted from being one, attention, hanging out with her heroes, and even still doing stunts, though for some reason even the simpler routine was starting to get a bit taxing and she wasn't sure why...</span></div></div>",
            "created":1521694380,
            "id":2467615,
            "title":"Massive Mascot"
        },
        "111332":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "From caretaker to being taken care of",
                "A flavor to beat the rest",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The shy animal lover huh?</span></div></span></div>",
            "created":1521695340,
            "id":2467627,
            "title":"Fluttershy "
        },
        "1113321":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>The animals of Equestria may still be animals, but they were certainly smarter than what you might find on earth, and one particular group were forming a plan.<br>\r\n<br>\r\nFluttershy had been taking care of animals tirelessly for as long as she had a cutie mark, and the animals thought it was about time to pay her back for all her trouble. For a whole month, the various animals indebted by her plan to pamper and spoil Fluttershy, doing everything she needed or wanted. She wouldn't have to lift a hoof for anything, any chore is taken care of, any whim granted, and not any stress what so ever befalling the meek pegasus.<br>\r\n<br>\r\nA month of being waited on day and night, just about anypony would get a bit softer in that time.</span></div></div>",
            "created":1521696060,
            "id":2467633,
            "title":"From caretaker to being taken care of"
        },
        "11133211":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "At the start of the month",
                "In the middle of the month",
                "Near the end of the month"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At what point do you want to start the story?</span></div></span></div>",
            "created":1521696180,
            "id":2467635,
            "title":" Go with this idea"
        },
        "1113322":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                " Go with this idea",
                "Try this, but with some changes",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Fluttershy's always been a healthy pony, eating only what she needed too and indulging herself very little, allowing her to maintain her slim figure despite her lack of exercise. <br>\r\n<br>\r\nThis changes however when Pinkie makes a new pastry that gets Fluttershy's taste buds to sing like none could before. Now she's making more and more trips to Sugar Cube Corner to feed her new craving, not helped by the fact that Pinkie has permission to discount treats fo her friends. Not one to have ever cared about her personal image outside of basic hygiene, her softening body goes unnoticed by her while Pinkie just finds it amusing and encourages her behavior.<br>\r\n<br>\r\n</span></div></div>",
            "created":1521696120,
            "id":2467634,
            "title":"A flavor to beat the rest"
        },
        "112":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Princess Celestia",
                "Princess Luna",
                "More Royalty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The highest ranking ponies.</span></div></span></div>",
            "created":1537431300,
            "id":2550221,
            "title":"One of the Royals"
        },
        "1121":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Luna's Power Play",
                "The Illusion Broken",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The sun ruler huh?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1537431540,
            "id":2550224,
            "title":"Princess Celestia"
        },
        "11211":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes ",
                "A new Idea please"
            ],
            "content":"<div class=\"\"><div> <span>Luna never truly gave up on her plan to take control of Equestria, just changed how she wanted to do it. The biggest change is that she no longer wanted to outright banish or otherwise harm her sister. The time they had spent together after her defeat by the Elements of Harmony had shown her that Celestia truly cared for her and it's not her fault how ponies view the night, but unfortunately if Luna wanted to rule the kingdom as she wanted that meant she still had to take her out of power. This is how she had come to her newest plan, fattening her sister until she's too big to properly do her duties. In her mind, it would be the least egregious way to claim sole rule while making sure her sister wasn't harmed, plus she could be more subtle this time. Encourage her to take that extra slice of cake, what harm could it do? An extra large meal after a long day of work made sense right? All of this supplemented by simple spells used on Celestia's food to increase her appetite while retaining every bit of fat in her food means that Luna's plan would be going great as Celestia poofed out. A few lies to assure her that she wasn't getting fat, rigging her mirrors to show her still thin, cracking down on anypony trying to tell Celestia she's getting big meant Luna's usurpation was guaranteed.<br>\r\n<br>\r\n</span></div></div>",
            "created":1537431600,
            "id":2550225,
            "title":"Luna's Power Play"
        },
        "11212":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Go with this idea",
                "Try this, but with some changes ",
                "A new Idea please"
            ],
            "content":"<div class=\"\"><div> <span>Celestia had always been bigger, not just in hight but in weight, it was just that nopony could possibly have seen it before.<br>\r\n<br>\r\nIn the very beginning as modern civilization was but a dream, eating all that you could for the added padding was viewed in a much more positive light, but of course times and ideals change and so too did the idea of what a healthy weight was for a pony, but Celestia couldn't let go of her figure, the rounded curves were a mark of pride for her and represented good harvest, plus she just liked the way she looked, so she found a way to hide her true from away from her subjects while still keeping it. It was a complex set of spells but it was worth being able to walk around looking thin as ever while actually being three-hundred pounds, though now the time was coming for the truth to be revealed. <br>\r\n<br>\r\nAnd all because she forgot to use a spell she had been using on a routine for over a thousand years.<br>\r\n<br>\r\nNow caught out in public with all her fluffy body for full display, how will Equestria react?</span></div></div>",
            "created":1537432200,
            "id":2550228,
            "title":"The Illusion Broken"
        },
        "1123":{
            "author_id":"iiiiii",
            "author_name":"g yjgj",
            "choices":[
                "Princess Cadence",
                "Flurry Heart",
                "Other Royalty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More ponies in power.</span></div></span></div>",
            "created":1537431360,
            "id":2550223,
            "title":"More Royalty"
        }
    },
    "info":{
        "author_id":"iiiiii",
        "author_name":"g yjgj",
        "brief_description":"You pick either to focus on a single pony or a group of them and choose how they gain.",
        "created":1520700660,
        "description":"<td align=\"left\" class=\"norm\">Fairly straightforward, pick your pony or a group of them and get to making them big. <br>\r\n<br>\r\nNo real limit on the way it happens so long as it leads to weight gain specifically.</td>",
        "id":2151804,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1537432200,
        "modified":1537432200,
        "pretty_title":"Equins in Excess (WG)"
    }
}