{
    "chapters":{
        "1":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Alison",
                "Kim",
                "Madison",
                "More girls",
                "Group weight gain"
            ],
            "content":"<div class=\"\"><div> <span>Let's do this!<br>\r\n<br>\r\nChosis<br>\r\n<br>\r\nAlison<br>\r\n5th grade<br>\r\nRealy Overweight<br>\r\nshort with brown hair<br>\r\nHas many friends ands loves fast food<br>\r\n<br>\r\nKim<br>\r\n4th grade<br>\r\nStarting to grow a belly<br>\r\nAverage height and blonde hair<br>\r\nEats anything on a plate<br>\r\n<br>\r\nMadison<br>\r\n3rd grade<br>\r\nSoft all over; in between normal and chubby<br>\r\nRecently moved to a town where the economy revolves around food<br>\r\nLoves Italian food</span></div></div>",
            "created":1260939600,
            "id":806332,
            "title":"Let's start!"
        },
        "11":{
            "author_id":"adom4",
            "author_name":"adom4",
            "choices":[
                "Alison",
                "Erika",
                "Anne",
                "Alice",
                "More girls"
            ],
            "content":"<div class=\"\"><div> <span>1) Alison (from previous chapter)<br>\r\n<br>\r\n2) Erika: 5th grade: fat, long blond hair, big sweet tooth, kind of clumsy, likes gardening.<br>\r\n<br>\r\n3) Anne: 5th grade: thin, long black hair, a vegetarian, rather timid, wants to be just like her immobile older sister (Cassandra), very obedient:<br>\r\n<br>\r\nCassandra: 12th grade, immobile for about 3 years, quit school because of her weight, a spoiled brat, eats pretty much anything, guides her sister Anne on how to get immobile like her.<br>\r\n<br>\r\n4) Alice: 5th grade, very obese, long black hair, only interested in food and nothing else, Alice pretty much has an endless stomach, doesn't seem to care about her weight, always seen with some kind of snack in her hand.</span></div></div>",
            "created":1288501200,
            "id":984440,
            "title":"More girls"
        },
        "111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "At Alison's house that weekend",
                "At school the following day",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alison and her battalion of friends were eating at one of the many fast food eateries in her communities. \"Hey Ali? Can I buy you another burger?\" One of Alison's friends, Cherry, asked. \"No way! I'm buying the next burger!\" Another friend, Tuesday, Exclaimed. \"Don't argue girls; you can both buy me burgers!\" Alison said. \"Can I also buy you a milkshake?\" asked Cherry. \"Sure thing.\" Alison answered. Both friends ran to the cashier. <br>\r\nAlison and the rest of her loyal disciples talked about fashion and celebrities while she was waiting for her next meal. This generosity wasn't uncommon for Alison. Alison had everything that everyone wanted: A huge wardrobe, tons of money, endless plates of gourmet food, and of corse, she was a good and loyal friend. Alison was also a plus-sized model. EVERYONE wanted to be Alison's best friend. They followed her, complemented her, and gave her gifts of iTunes gift cards, clothes, and Alison's personal favorite gift: food. Alison thought she should give back by taking her friends out to eat. Because of this, Alison and her friend's waistlines grew over time. Alison grew to be a \"big girl\" and every one of Alison's friends were at least chubby. Alison didn't mind this because her posse could go to more eateries and Alison hated skinny girls.</span></div></div>",
            "created":1334034000,
            "id":1312692,
            "title":"Alison"
        },
        "1111":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Her friends",
                "Her plus-sized model director",
                "A delivery for more food"
            ],
            "content":"<div class=\"\"><div> <span>This weekend, mark the first day of the summer break, which leads to Alison to finds some things to do, as much as eating either herself or friends, and plus-sized modeling is still her thing.  she got herself up later than usual, and slowly climbs out of her bed to give it a big stretch, although her pajamas have lifted, leaving her fat belly exposed for a bit, before dropping her arms out again.<br>\r\n<br>\r\nAlthough it was the first day of summer, Alison is excepting to someone to come and see her, whether few things in mind she loved doing.  So, she needed to get ready for that, and starts getting dressed as much as she can.  From her tight pajamas, to her white t-shirt, pink sweatpants, and white sneakers she had got on, she then headed downstairs and went towards the kitchen to have some breakfast, just to feast her up a bit.<br>\r\n<br>\r\n\"Now, what should I eat for breakfast?\"  Alison wondered, looking around to see what she was having.<br>\r\n<br>\r\nAlthough she didn't know who and what to do for her, she decided to have some cookies and emptied every single one of them from a huge bowl.  Although she has tons of money to but more of these, she felt satisfied and let it out a burp for good measure, and patted on her belly to jiggle.  Then, the doorbell rang through her ears.<br>\r\n<br>\r\n\"Oh, just in time!  I wonder who can be to see me?\"  Alison wondered with her excitement as she then went over towards the door, and opened to see who it was coming to see her?</span></div></div>",
            "created":1477803600,
            "id":2230509,
            "title":"On That Weekend"
        },
        "11112":{
            "author_id":"drifterboy88",
            "author_name":"Drifter boy",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Alison saw it was Kim, her director. “Alison, I have great news!” “What” asked Alison. Kim explained how Chubs, a local plus-size clothing chain, gave her a gig for their new stain-resistant bikini. Alison loved the idea. So they headed to Chub.<br>\r\n<br>\r\nAt Chub she got measured and she had to get a custom bikini due to her size. It was white to show the stains. They then went to the local beach to shoot. The first part was her in a normal bikini. They had her eat cherry ice cream and drip some on the bikini. It then showed the mother actress struggling to clean it. The second part was in the stain-resistant bikini. It showed her in the bikini eating cherry ice cream, except when it dripped it bounced right off and no stain was left. Then they had Alison say that it was very comfortable with it feeling like a nobody bikini.<br>\r\n<br>\r\nThe commercial was a hit. Parents lauded the bikini because they weren’t stained. Alison was also given an offer from Chub, 1 shooting a week but she had to gain 10 pounds a week. <br>\r\n<br>\r\n<br>\r\nDoes she accept?</span></div></div>",
            "created":1574485200,
            "id":2750747,
            "title":"beach time "
        },
        "1112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Alison tries to getting fatter so she can eat more",
                "Natalie invites Alison over",
                "One week later"
            ],
            "content":"<div class=\"\"><div> <span>Alison sat in math class the following day. Her teacher was writing down some rules about basic algebra on the whiteboard. The class also got a new student; she had long black hair that went all the way to her butt, a sophisticated look, and a chubby frame. She sat to the left of Alison. Alison's belly growled in hunger and she clutched it in agony. \"Owww, I had 8 pancakes and a candy bar for breakfast; how can I be hungry already?\" She thought to herself. She looked at the clock and found that it was still a half hour until lunch.<br>\r\n\"Anyone have food to spare?\" Alison whispered to the girls sitting around her. The girls quickly shuffled through their backpacks looking for food. \"I've got a jolly rancher.\" \"I've got a lollypop.\" \"I've got some crackers.\" Alison heard eager whispers from all around. Alison rolled her eyes. The new girl slowly reached into her backpack and pulled out a large bag. She took four doughnuts out of the bag. \"This should make your tummy happy. My mommy made them with extra chocolate glaze.\" The new girl whispered. She had a smooth voice enriched with a light touch of a French accent. Alison greedily consumed the pastries and whipped the crumbs off of her tight shirt. \"Thanks newbie. What's your name?\" Alison asked. \"Natalie Lebronx.\" The girl replied.<br>\r\nAt lunch, Alison served herself plenty of fatty foods and sat down with her usual group of friends. Around halfway into lunch, she saw Natalie looking for a table. Alison signaled for her friends to scootch over. \"Hey Natalie! Come sit next to me!\" Alison called out. \"Thank you for inviting me.\" Natalie said. Natilie took out another bag and emptied it's contents in front of Alison. Baked desserts of all types came put of the bag. \"You can have the rest of my lunch. My mom baked all of them so they are going to be delicious!\" Natalie said. \"I dunno.. I had more lunch than usual today so I'm kinda full.\" Alison replied. \"Don't worry about it! My mom always says that the bigger and fatter your belly is after you eat, the more you can eat next time! I guess that is why my mom eats so much.\" Natalie said.<br>\r\nWhen Alison finished, the bottom of her belly was hanging from her shirt. After school...</span></div></div>",
            "created":1334120400,
            "id":1313236,
            "title":"Natalie Lebronx"
        },
        "11123":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Alison stays the night",
                "A month later"
            ],
            "content":"<div class=\"\"><div> <span>A week past and Alison past 150 pounds. Alison was on her way to Natalie's house. She was told that her mother makes some of the most fattening French food. When there, Natalie opened the door and let Alison in. Alison took Natalie into the kitchen and introduced her to her mother.<br>\r\n<br>\r\nMrs. Lebronx was a skinny woman but had a nice hourglass figure. She smiled as she looked at Alison.<br>\r\n<br>\r\n\"So this is Alison?\" Mrs. Lebronx asked in a thick French accent.<br>\r\n<br>\r\n\"Yes she is.\" Natalie replied.<br>\r\n<br>\r\n\"She is a very big for some one her age. Hope she likes the sweats and food I made.\"<br>\r\n<br>\r\nMrs. Lebronx finished making the food and set the table. Alison looked at all the food and was hungry. Alison started to eat and loved the food Mrs. Lebronx made. When she finished all the food, Alison was still hungry. Natalie's mother made some more and kept baking more and more food until Alison was full. She rubbed her stuffed belly and moaned a bit in pain.<br>\r\n<br>\r\n\"Are you full already Alison?\" Mrs. Lebronx asked.<br>\r\n<br>\r\n\"Stuffed to burst.\" Alison said.<br>\r\n<br>\r\n\"What a shame, I wanted to keep feeding you until you reach 300 pounds.\"<br>\r\n<br>\r\nMrs. Lebronx helped the obese child to the living room and went back to the kitchen. Natalie came in and sat down next to her.<br>\r\n<br>\r\n\"How dose it feel to be so big?\" Natalie asked.<br>\r\n<br>\r\n\"It is nice to have all this fat. It is a nice natural insulator when its cold out. The disadvantage of it is that it is hard to move around and higher health problems.\" Alison said.<br>\r\n<br>\r\nNatalie's mother came back with some of her food. She looked at the girls and smiled. Alison knew she would burst but started to eat her food again. Natalie was hungry and started to eat it as well.</span></div></div>",
            "created":1400907600,
            "id":1801413,
            "title":"One week later"
        },
        "111232":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "...the plus-sized model shoot.",
                "...to school to see her friends.",
                "...come over to Natalie's house for more."
            ],
            "content":"<div class=\"\"><div> <span>It's been a month since Alison was been invited over to Natalie's house and offered to be fed by Mrs Lebronx to make herself fatter as she was expected.  Although she might had to get used to her constant feeding which is usual for her to eat in that time.  But that was at first, and soon managed to get on her pace and feeds whatever food she eats anytime she wish.<br>\r\n<br>\r\nThe morning came and there was some heavy thumping noise which had quite louder than it was before.  That course you could expect it was Alison by some distance, but she looked different than she was a month ago.  That's because she's now an obese 5th grader, and for an age like that is immense.<br>\r\n<br>\r\nBy the look of her size which her belly had hanged over her sweatpants and her butt and thighs are so large, when she sits down, it hanged over the edge of the chair whatever size it is in anything she could sit on.  She already checked up the bathroom scale which remarkably, it read 300lbs in weight and that's huge for an age like Alison in fairness.  No matter how big she gotten to, she was delighted and would be able to show off whatever she feels like it.<br>\r\n<br>\r\nIt was all thanks to Natalie and her mother to make that happen and surely she might not be done at this rate by her minds anytime soon.<br>\r\n<br>\r\n\"I may be a big girl alright, but I could always planning on getting fatter, no matter how fat I am.\"  Alison says in her thoughts.<br>\r\n<br>\r\nAs soon as she had finished her breakfast, she heads off and went over to...</span></div></div>",
            "created":1463461200,
            "id":2149642,
            "title":"A month since then"
        },
        "1112321":{
            "author_id":"tolkienboy",
            "author_name":"Chaser",
            "choices":[
                "She meets up with some friends to hang out.",
                "She goes home"
            ],
            "content":"<div class=\"\"><div> <span>Alison's plus sized modeling career skyrocketed as did her weight did. It help make her want to get even fatter. <br>\r\n<br>\r\nAlison one of ber favorites photo shoots was the bikini shoot as she got show off her lage belly to the world and play with it. Playing with her belly had be become one of her favorite things to do and had become one of her favorite things about being so fat.<br>\r\n<br>\r\n<br>\r\nHowever not everything was sunshine and rainbows. Alison also can under criticism of glorifying obesity. Which she admitted she was. She had fallen in love with being fat and what other to get fat and love it too. Still  in spite of all the criticism she had become quite then role model for fat girls everywhere.<br>\r\n<br>\r\n<br>\r\nShe was also working hard to get there to a plus size model runway. But that still not happening any time soon.<br>\r\n<br>\r\n<br>\r\nAfter the photos shot.</span></div></div>",
            "created":1550120400,
            "id":2617880,
            "title":"...the plus-sized model shoot."
        },
        "113":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "Excited, she never wanted to be a vegetarian.",
                "Sad, she loved her current diet.",
                "Didn't care, she just wants to follow her sisters roots."
            ],
            "content":"<div class=\"\"><div> <span>Anne is in Cassandra's room talking to her on how to become immobile. Cassandra said,\"Anne, the first thing you need to do to become immobile is to stop eating all vegetables, that means you need to stop being a vegetarian to be like me.\" Anne was</span></div></div>",
            "created":1469077200,
            "id":2184283,
            "title":"Anne"
        },
        "1132":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Anne accepts",
                "Anne declines and is force fed",
                "Anne declines and Cassandra yells for meat"
            ],
            "content":"<div class=\"\"><div> <span>\"If you want to be big and fat like me, you got to stop being a vegetarian Anne.\" <br>\r\n<br>\r\nAnne sighed. They've been over this before but Anne's diet was too ingrained in her life.<br>\r\n<br>\r\n\"This again?\" Anne sighed dropping into her sister's abundant flesh. Anne nestled herself into Cassandra's belly. Gazing upon the beautiful flesh, Anne bewitchingly fondled it. \"Oh why can't I have rolls like you sis? They're so soft and comforting.\"<br>\r\n<br>\r\nTo a shy girl like Anne, fat bodies appeared protective, being heavier than everyone else would make people less intimidating. Cassandra was huge and she had no problem talking to people. Her sister was so beautiful. Tantalizing waves of fat rolls, cushioned arms, colossal tits, enormous wobbly buttocks, stubby legs buried underneath her proud magnificent belly. Anne however, was small. Her lithe figure, boney arms, sticklike legs, flat waist, undersized breasts, all made her  meek and timid.<br>\r\n<br>\r\n\"You got to eat alot to become like me, Anne.\" <br>\r\n<br>\r\n\"But I just don't have the appetite that you have.\" Anne whined.<br>\r\n<br>\r\n\"No. You're just not trying hard enough.\" Cassandra said \"Mom! Bring me cake!\" Cassandra yelled.<br>\r\n<br>\r\nUp scuffled her subservient mother carting a huge cake. \"Oh sorry dear, you must be so hungry.\" apologized the quivering woman bowing her head as she left.<br>\r\n<br>\r\nCassandra sniffed the cake in approval before taking a huge slice.<br>\r\n<br>\r\n\"Okay Anne dig in.\" Cassandra ordered before taking a bite of cake.<br>\r\n<br>\r\n\"B-but I'm not particularly hungry right now.\" trembled Anne.<br>\r\n<br>\r\nCassandra gave her scrawny sister a grudging glare. \"Eat it.\"<br>\r\n<br>\r\n\"But-\"<br>\r\n<br>\r\n\"Eat it or else.\" Cassandra warned.<br>\r\n<br>\r\n</span></div></div>",
            "created":1574571600,
            "id":2751166,
            "title":"Sad, she loved her current diet."
        },
        "114":{
            "author_id":"imaperson",
            "author_name":"Bob_smith",
            "choices":[
                "risk it and get the cake ",
                "play it safe and eat from the stash ",
                "why not eat both?"
            ],
            "content":"<div class=\"\"><div> <span>Yesterday it was Alice's Birthday she has just turned 10 the party was very fun Alice hung out with all her friends, she got lots of presents and of course her all  time favourite thing in the world was  there food. <br>\r\nAlice could not stop eating last night where ever she would go she would have a giant handful of food with her and now Alice is paying for that last night she is in her room lying on her bed trying to nurse this big full stomach of hers that made her look like if she was overdue with twins. Alice didn't mind though she loves being fat, sudnelly Alice gets this all to firmiluar felling in her stomach, she is hungry Alice sits up in her bed and pats her huge gut  then she remberes that  there is a lot of left over birthday cake  in the fridge  Alice loves any type of Cake She licks her lips in hunger and starts to waddle downstairs to the kitchen  before she left she rembered that her Mum and dad are downstairs and if she got caught trying to bring the cake up stairs she would be grounded forever. Her parents don't like Alice being so fat and always eating junk food they have tryed to stop her before but they never could. Alice thinks to her self  \" Should I just risk it or  just eat from my secret stash in here?\"</span></div></div>",
            "created":1426654800,
            "id":1949945,
            "title":"Alice"
        },
        "1142":{
            "author_id":"minun333",
            "author_name":"Minunman",
            "choices":[
                "Figured she should dress up for school",
                "Head straight down to breakfast",
                "Alice's mom want's to talk to her"
            ],
            "content":"<div class=\"\"><div> <span>Well Alice did like that cake and want more, she didn't want to risk getting grounded or worse, forced to diet. So instead she headed to her closet to eat her food stash. She then took the bag out and looked at the food she store, Which contains many kinds of candys, cookies, and chips. Alice then sat on her bed and munched through her food fast like she hadn't eaten in forever. After a while even though she didn't feel full, she decided that would be enough food for tonight. So Alice then put her bag back, dispose her trash and went to her bed and get back to sleep.<br>\r\n<br>\r\nWhile Alice was sleeping, she was now dreaming of being in a place where there are a lot a treats everywhere and Alice was eating them all up. While eating, she became bigger and fatter with all the food she eats. A while later, she was feeling full with all of these food, and was now a huge immobile blob. Alice was very satisfied and while in her immobile state, she played her fat a bit, mostly jiggling her huge belly. She was feeling relaxed but then she was waking up, mostly due to her alarm clock. Alice then woke up and...... </span></div></div>",
            "created":1477803600,
            "id":2230519,
            "title":"play it safe and eat from the stash "
        },
        "11421":{
            "author_id":"minun333",
            "author_name":"Minunman",
            "choices":[
                "Clare ",
                "Derrick "
            ],
            "content":"<div class=\"\"><div> <span>Alice thought before she went down to eat that she should get dressed for school. She picked some clothes and put her clothes on. Alice looked at herself in the mirror and saw that her blue shirt was not covering her belly very well. She didn't mind it since she likes seeing her massive gut. The pants she wore fit but felt a bit snug on her. So after admiring her huge self and seeing what she wore, Alice waddled down to the kitchen to have breakfast.<br>\r\n<br>\r\nAlice reached the table and sat down with her tummy growling ready to eat. Even though Alice's parents didn't want their daughter eating so much, they served her many waffles with Alice eating every single one of them until she was satisfied. After her breakfast feast, Alice went out of the kitchen to get ready to go to school. <br>\r\n<br>\r\nWhile Alice was gone, her parents were having a conversation about Alice. \"What are we going to do with her?\" Alice's mom questioned \"Alice just keep wanting to eat and get bigger. We could limit her portions but we just want her to lose weight, not starve her to death.\" \"Well to be honest, I don't know.\" Alice's dad said. Then Alice called out \"Hey mom, we should get going.\" \"Coming Alice\" her mom said<br>\r\n<br>\r\nSo Alice and her mom drove to her school with Alice having a snack while driving and her mom worrying about Alice. Once they drove up, Alice got out and was going to be ready for school. But while getting to school, one of her friends showed up.</span></div></div>",
            "created":1482296400,
            "id":2252794,
            "title":"Figured she should dress up for school"
        },
        "115":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Gabi",
                "Hannah",
                "More girls"
            ],
            "content":"<div class=\"\"><div> <span>Gabi<br>\r\nBlack hair<br>\r\n2nd grade<br>\r\nSkinny<br>\r\nLOVES fast food and dessert food<br>\r\nMoving in with her older brother's house in LA for some reason<br>\r\n<br>\r\nHannah<br>\r\nLight brown hair<br>\r\n3rd grade<br>\r\nA little chubby<br>\r\nWill only eat dessert food<br>\r\nMoving in with a house full of fat and gaining girls of all ages (mainly ages 6 through 24)</span></div></div>",
            "created":1292907600,
            "id":1019373,
            "title":"More girls"
        },
        "1151":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Her parents were at a 14 month political convention",
                "Her parents died",
                "She wanted to live with her brother"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is Gabbi moving in with her brother?</span></div></span></div>",
            "created":1292907600,
            "id":1019375,
            "title":"Gabi"
        },
        "11511":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Call for some food",
                "Leave the phone alone"
            ],
            "content":"<div class=\"\"><div> <span>Gabi knocked on an apartment door in a extremely fancy apartment building in west Los Angeles. A tall handsome man awnsered the door. \"Hey kiddo!\" the man said. \"Hi James.\" Gabi said quietly with a grin. James was Gabi's 26 year old generous brother. He was Gabi's legal guardian for 14 months while their parents were at a political convention in Washington D.C. When Gabi came in, they both had a friendly chat. While they were chatting, Gabi examined the apartment; it was wonderful! James was also very rich, he owned a company. Although it wasn't huge, it was one of the the fastest growing companies in the U.S. James also laid out some rules, such as not being able to leave the appartment unless James was with her, and she can invite her friends over at any time with James permission, or that she had unlimited usage of his pool. James also knew that Gabiwas responsible, so she didn't need a babysitter. James started for the door to go to work untill Gabi spoke up. \"Wait! What about my food?\" Gabi asked. \"Call these numbers.\" James said handing her a business card with two phone numbers on it. \"Call this one from 6:00 A.M. to 2:00 P.M., and call this one from 2:00 P.M. till 6:00 A.M., they are two of my assisstants, they can pick up what ever you want from any joint around here, the food is on me.\" James left for work. Gabi smiled. She examined the phone.   </span></div></div>",
            "created":1292907600,
            "id":1019390,
            "title":"Ultimate Benefit "
        },
        "115111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Fast food feast",
                "Just desserts binge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of food?</span></div></span></div>",
            "created":1292907600,
            "id":1019392,
            "title":"Call for some food"
        },
        "1151111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "He didn't mind",
                "He liked Gabi's new belly"
            ],
            "content":"<div class=\"\"><div> <span>Since it was around noon, Gabi called the first number, and ordered a massive meal from McDonalds. McDonalds was Gabi's favorite. When she was younger, all she wanted to do is to eat hamburgers all day, and that's still all she wanted to do, but she never got the chance because her parents cared about her health very much. Ten minutes later, James' assisstant arrived at the appartment with Gabi's food. It took the assistent four trips to make it back with all of Gabi's food. When all of Gabi's food arrived, and she wad alone, she started to dig in. She stuffed all the unhealthy food she could into her mouth. She was in hamburger heaven. Around halfway through her stuffing, she felt fat and stuffed. She looked at her belly, it was bulging a small bit out of her tank top, but ignored it and kept on stuffing her slightly bigger belly. When she was done, at 6:30, every part of herself was bigger. her butt was wider, her young breasts were a bit more pronounced, and of course, her belly was bigger. She saw that wrappers and bags littered the floor. She let out a burp and a cute giggle. She rubbed her belly while eating some of the last French fries. James then walked in.</span></div></div>",
            "created":1292907600,
            "id":1019413,
            "title":"Fast food feast"
        },
        "11511111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Eat the dessert herself",
                "Call some friends over"
            ],
            "content":"<div class=\"\"><div> <span>James walked through the apartment door and saw Gabi laying on the couch. \"Hey kiddo.\" James said. \"Hey, [burp] James.\" Gabi replied. \"Gabi, I'm going to a get-together with some of my clients tonight and I won't be back till around 11:30, I just came back for a coat.\" James explained. Gabi grunted in approval. James headed for the door. \"Oh, one last thing.\" James said. \"I called for my assistant to get some dessert for you, he's at Dairy Queen right now, give him a call.\" James kissed Gabi goodbye and walked out the door.<br>\r\nGabi called James' night assistant for a huge dessert to complement her fast food feast. Fifteen minutes after the call, the assistant carried the many cups of dessert to the appartment surprisingly in only two trips. The assistant then rushed very quickly pback to his car for some reason.</span></div></div>",
            "created":1298005200,
            "id":1055936,
            "title":"He didn't mind"
        },
        "115111111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "The next morning",
                "Gabi's dream"
            ],
            "content":"<div class=\"\"><div> <span>Gabi started to shove spoonfuls of ice cream into her mouth. Even though she was still a bit full from her stuffing earlier that day, she still wanted to finish all the cups of ice cream. By the time she finished all the cups, it was late and Gabi fell asleep on the couch. When James came home, he found Gabi sleeping, so he carried her to her bed.</span></div></div>",
            "created":1298350800,
            "id":1058597,
            "title":"Eat the dessert herself"
        },
        "1151111111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "One week later",
                "One month later"
            ],
            "content":"<div class=\"\"><div> <span>When Gabi woke up in the morning the first thing that came to mind was food. She had no interest about her fatter belly or how she got to her bed after she fell asleep on the couch. She marched right into the kitchen and saw an entire cake on the counter. Gabi put the entire platter on her lap and started eating it with her bare hands. It the cake made an unsurprisingly mess on Gabi. She made a quick chane into a tanktop and short-shorts. Because of the tightness of the short-shorts, it gave her a small muffin top.<br>\r\nTen minutes later James came through the entryway with a mcdonalds breakfast for Gabi. \"Hey kiddo, sorry I wasn't home. I must have had one too many sips last night. I got you some breakfast.\" James said. Gabi quickly grabbed it and started chowing down. The breakfast consisted of French toast, hash browns, and some burgers and fries. \"It looks like someone is hungry!\" James teased. In a matter of minutes the breakfast was devoured into Gabi's softer belly. \"Keep that up and someone is going to get chubby!\". James teased. With half a cheeseburger in one hand and French fries in the other, she stuck both hands into her mouth and- TING! The button flew off her short-shorts. </span></div></div>",
            "created":1314075600,
            "id":1173519,
            "title":"Big breakfast"
        },
        "11511111111":{
            "choices":[
                "he then feeds her his food ",
                "the start to play and he chases her trying to tickle her",
                "they go to the movies"
            ],
            "content":"<div class=\"\"><div> <span>     Gabi is excited today because shes going to the movies to see \"how to train you Dragon\" She shot up off the bed and ran to the bathroom to get ready. She hadnt noticed but she was winded from that short little run. <br>\r\n<br>\r\nShe struggles to squeeze into her jeans, straining and pulling with all her might but her newly formed thick thighs is making it hard. She finally gets the up but now she has to get them over her new round bubble butt. she manages to get them up but they are tight, she could barely move. her jeans cut deep into her hips and her back arched a little because of her fat booty and her large jiggly potbelly that hung over her pants. <br>\r\n<br>\r\nnone of her shirts fit right, they all rose up revealing her super soft underbelly. she finds a tank top and a small over shirt. both shirts clings to her body and showed off how curves. <br>\r\n<br>\r\nshe gos into the kitchen where james is sitting eating breakfast and reading the paper. she walks over and hugs him and gives him a kiss on the cheek. not really paying attention, he puts his arm around her to hug her but he then notices her soft and jiggly she is. he looks down and sees her roundish fat potbelly just mashed up against him. He then slaps and jiggles her belly and booty ( in a playful manner). A look of shock came across his face. \" Gabi? Gabi what have you been doing?\" Gabi just look at him with a big smile and just shrugs her shoulders. \" I dont know... I like to eat.\" Shes says. \" I see that. I told you you were gonna get chubby...chubby.\" James says as he slaps her fat booty making it ripple. gabi just giggles and smiles from ear to ear.</span></div></div>",
            "created":1403845200,
            "id":1818210,
            "title":"One week later"
        },
        "115111111112":{
            "choices":[
                "but I still wanna go to the movies",
                "I wanna take a nap",
                "im hungry"
            ],
            "content":"<div class=\"\"><div> <span>     James then tickles her on her belly fat, Gabi instantly laughs and pulls away. \" No No.\" gabi says as she laughs. that when james gets up and gabi like a scared cat runs into the living room and james gives chase. Gabi running with a goofy giggle Her arms flail about as she runs. her potbelly jiggles and bounces loosely like a waterbed and her fat round booty cheeks bounces back and fourth.<br>\r\n<br>\r\nbecause of her meaty body she got fatigued and falls on the sofa. james tickles her all over her chubby soft body. gabi laughs hystarically. tears are streaming down her face, she snorting like a pig and small farts came from her butt. She convulsed with laughter she is helpless. her pants split for they couldnt contain Gabi's jiggling meat anymore. <br>\r\n<br>\r\nJames stops after a while and gabi lays on the sofa woth arms over her head and her thick legs spread apart. she is tired from all the laughing. her dome size belly heaves up and down as she breaths heavy. Gabi is still giggling as james neals down and places his hand on her fat belly. it made a deep hollow sound as he put his hand there. as he rubs her smooth belly she looks at him with the biggest smile. \" ur tired arent you? \" She nods her head yes. </span></div></div>",
            "created":1404018000,
            "id":1819995,
            "title":"the start to play and he chases her trying to t..."
        },
        "1152":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "In the morning.",
                "In the middle of the night.",
                "At the new house."
            ],
            "content":"<div class=\"\"><div> <span>Hannah is at home packing up all of her clothes except for one pair for the next day. Hannah and her mom Jenny are moving to a new house full of 10 single BBWs under 30 and their children. Their new house is a huge 20 bedroom mansion in a very nice neighborhood next to a school so they don't have to walk far. The reason Hannah and Jenny are moving there is Jenny's husband left their apartment with a note saying,\"I have left this apartment for the last time because you are a lazy fat slob.\" We are go to continue on</span></div></div>",
            "created":1469077200,
            "id":2184203,
            "title":"Hannah"
        },
        "11521":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "A resident of the place with kids.",
                "A servant. "
            ],
            "content":"<div class=\"\"><div> <span>Hannah woke up early in the morning to get ready to leave. Jenny then said,\"Time to go.\" Hannah walked outside of her apartment for the last time and they stopped at McDonald's for breakfast. Hannah got 5 cinnamon rolls and hash browns and a large coke. After she finished, Hannah asked,\"Mommy, is there dessert at the new place. Jenny then said,\"Maddie, you can have as much dessert as you want and you even have a food cabinet with a mini fridge in your very own room.\" Hannah became ecstatic and very egared to get there. When they finally arrive, they are greeted by</span></div></div>",
            "created":1469077200,
            "id":2184276,
            "title":"In the morning."
        },
        "115211":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "The play room.",
                "To Hannah's bedroom."
            ],
            "content":"<div class=\"\"><div> <span>When they arrived at their new house, Hannah and Jenny were greeted by Anna with her two kids. The two kids were Mia and Riley. They said hi to each other and Jenny said,\"Hannah, you can go with Mia and Riley into the basement towards your room. Hannah follows them into the basement and they go to </span></div></div>",
            "created":1469336400,
            "id":2185443,
            "title":"A resident of the place with kids."
        },
        "11522":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "the blonde explains the house",
                "they eat lots of pie"
            ],
            "content":"<div class=\"\"><div> <span>It was the middle of the night when Hannah was escorted off by her fat mother Jenny \"Come on Hannah, let's leave this dump. You're father and all the other men here think we're too fat so we'll go somewhere that won't harass us.\" the indignant mother grumbled. <br>\r\n<br>\r\n\"Mommy where are we going?\" Hannah apprehensively asked.<br>\r\n<br>\r\n\"A wonderful place sweety, a huge mansion that welcomes fat women and girls and lets them eat as much as they want.\"<br>\r\n<br>\r\n\"Will they have cake and candy?\" Hannah inquired<br>\r\n<br>\r\n\"Of course, as much as you want and no one like your father will stop you.\" answered the mother.<br>\r\n<br>\r\nPrior to tonight, Jenny was married to a man who constantly criticized her weight despite Jenny loved to eat high calorie food and enjoyed her fat body. What furthered the tension was their daughter, Hannah. Jenny yearned for a fat daughter and encouraged her to eat hearty. Jenny's wish turned to be fortuitous when Hannah developed a strong appetite for desserts. Hannah quickly thickened with a soft padding of flesh. Upon seeing his thin daughter turn into a chubby dessert enthusiast, he left Jenny blaming her for proudly inducing their daughter's weight gain.   <br>\r\n<br>\r\nHannah got in the car with her irritated mother who drove them to the mansion. After 30 minutes of driving they arrive at their new home.<br>\r\n<br>\r\n\"Wow it's so big!\" exclaimed Hannah<br>\r\n<br>\r\n\"My it is impressive.\" added Jenny.<br>\r\n<br>\r\nHolding her daughter's hand, Jenny walked up to the door and rang the bell. The door opened, unveiling a 250 pound blonde woman in a night gown. The woman appeared to be only in her twenties giving off a rather youthful demeanor. The blonde woman eyed Jenny and Hannah, instantly noticing their plump figures, and accurately guessed their situation.<br>\r\n<br>\r\n\"Looking for a place to stay?\" asked the 250pound blonde.<br>\r\n<br>\r\n\"Yes, my husband left me.\" Jenny answered.<br>\r\n<br>\r\n\"Because you're too fat, yeah I know how you feel. Well come on in we'll get you set up here.\" she led them in.  \"So how about we introduce ourselves over some pie.\" the blonde suggested.<br>\r\n<br>\r\n\"Yummy!\" rejoiced Hannah.<br>\r\n<br>\r\n\"Oh that sounds so satisfying. You wouldn't believe the night I had.\" Jenny professed.<br>\r\n<br>\r\n\"All the women here have been through the same, and nothing remedies it like a big dessert. In fact I was having myself a midnight snack before you arrived.\" the blonde said.<br>\r\n<br>\r\n</span></div></div>",
            "created":1503723600,
            "id":2375136,
            "title":"In the middle of the night."
        },
        "115221":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "the mothers with Jenny",
                "the other kids"
            ],
            "content":"<div class=\"\"><div> <span>The fat blonde led them into the kitchen which was very huge and filled with various accessories. \"The women here sure do love to cook.\"the blonde said noticing the new resident's awe. \"Here take a seat.\"<br>\r\n<br>\r\nJenny and Hannah sat down while the blonde brought over a huge pie. The three immediately dove in.<br>\r\n<br>\r\n\"So let's introduce ourselves, I'm Debby, I'm one of ten other women living here with our daughters.  After getting scolded for letting ourselves get fat, us ladies got together to build a supportive environment were we can eat without care and enjoy our soft jiggly bodies. This mansion has 20 bedrooms, a fully stocked kitchen, playrooms, and a pool where no one will judge you in a bikini. This property resides in a fabulous neighborhood that's safe and secure.  We also live right next to an excellent school were our daughters attend\" Debby told.<br>\r\n<br>\r\n\"This place sounds marvelous.\" Jenny stated as her daughter voraciously ate.<br>\r\n<br>\r\n\"You seem hungry would you like some brownies?\" Debby asked noticing Hannah's appetite.<br>\r\n<br>\r\n\"Yeah I love dessert!\" Hannah answered.<br>\r\n<br>\r\n\"Well here you can eat all the dessert you want. My two girls love eating desserts too.\" Debby proudly boasted.<br>\r\n<br>\r\n\"Oh you have daughters?\" Jenny inquired.<br>\r\n<br>\r\n\"Yes, Emma and Becky, two of the cutest little fatties you've ever laid eyes on. They just love eating so much. But that's how we ended up here, my ex-husband wanted us to be thin always pressuring me to diet and exercise and forcing my lovelies to not eat sweets. Eventually I realized how miserable they were and decided to divorce him and bring them here. We became so fat and happy so quickly.\" Debby explained.<br>\r\n<br>\r\n\"Its great that me and Hannah can finally let ourselves go. In all honesty I want Hannah to get really fat.\" Jenny confessed.<br>\r\n<br>\r\n\"Lots of mothers here share your desire. Us girls here love getting fat.\" Debby admitted sliding more brownies over to Hannah.<br>\r\n<br>\r\nThe two women laughed a bit before going to a room to sleep.<br>\r\n<br>\r\n\"Let's get you set up in a room so you can sleep. In the morning you can get acquainted with everyone at breakfast.\" Debby said.<br>\r\n<br>\r\nIn the morning Hannah had a huge breakfast were she met...</span></div></div>",
            "created":1503810000,
            "id":2375597,
            "title":"the blonde explains the house"
        },
        "1153":{
            "choices":[
                "Tamika",
                "Sammy",
                "more girls"
            ],
            "content":"<div class=\"\"><div> <span>Tamika <br>\r\nLong red Hair<br>\r\n3rd grade (held back)<br>\r\nChubby / fat a lot of booty, soft quivering pot belly and fat thighs<br>\r\nHas a bit of an attitude. will eat anything very greedy and spoil. not very bright.<br>\r\n<br>\r\n<br>\r\nSammy<br>\r\nshort dirty blonde <br>\r\n5th grade<br>\r\ntall thin but soft all over. kinda chunky<br>\r\nLoves pizza </span></div></div>",
            "created":1400216400,
            "id":1797224,
            "title":"More girls"
        },
        "12":{
            "author_id":"rodge",
            "author_name":"Rodge",
            "choices":[
                "Don't get seconds just in case.",
                "Get seconds before her parents pick her",
                "Go in the bathroom and find out for sure"
            ],
            "content":"<div class=\"\"><div> <span>Kim sat at the table finishing off her plate. Her and two of her friends had just got back from ballet practice, and Kim loved ballet. She loved dancing, dressing up, and had a crush on her parnter, Will, the only guy in the class. She really loved it lately, since there was going to be a performance where her and Will were the stars.<br>\r\n<br>\r\nShe cleaned off the plate and started to get up to go back to the buffet when Ty, one of her friends stopped her.<br>\r\n<br>\r\n\"Kim, maybe you shouldn't get more.\" She said.<br>\r\n<br>\r\n\"Why not?\"<br>\r\n<br>\r\nTy and Kim's other friend, Carla, looked at each other. Carla answered, \"We heard Will talking to the teacher.\"<br>\r\n<br>\r\n\"He said you were getting heavier and he didn't think he could lift you at the recital.\" Ty finished.<br>\r\n<br>\r\n\"Heavy?\" She asked, before realizing what they meant. \"I'm not fat!\"<br>\r\n<br>\r\n\"Well, you have started to gain a little weight...\" Ty said, pointing at her belly.<br>\r\n<br>\r\n\"NO, I'm NOT!\" Kim growled before heading off to get more food.<br>\r\n<br>\r\nHow could they tell her she was getting fat? They were just jealous, she knew she wasn't gaining weight. She was positive she wan't gaining weight. She was pretty sure she wasn't gaining weight. The closer she got to the buffet the more she thought about it and the more doubts she had.<br>\r\n<br>\r\nShe had noticed some weird stuff lately. Her ballet uniform had been a bit tight and it was hard to get into. A few of shirts had seemed smaller lately, but her mom said she might have shrunk them in the wash, or that Kim was getting taller. She glanced down at her belly, making sure her friends didn't see her do it. It did look a bit bigger. She reached down with one hand rubbed it, notcing some exposed skin between her top and her pants. Finally she thought about how her dad let out a weird sound when she got on his lap after breakfast.<br>\r\n<br>\r\nBreakfast! That had to be it, she ate a lot that morning. More pancakes then she ever remembered having before. She wasn't fatter, she just had a stuffed stomach weighing her down, she thought.</span></div></div>",
            "created":1269838800,
            "id":858610,
            "title":"Kim"
        },
        "121":{
            "choices":[
                "Fatten Will up ",
                "Don't fatten up Will",
                "Talk with Will abou it"
            ],
            "content":"<div class=\"\"><div> <span>Kim got really mad. So,even if she gained weight it's not a big deal. Besides if Will isn't strong enough. It's not her problem and she's not causing it. Kim felt embarrassed,how could he say things like that in front of her teacher. Everything that she loved about Will disappeared. She thought of something... Will she :</span></div></div>",
            "created":1482728400,
            "id":2254581,
            "title":"Don't get seconds just in case."
        },
        "1213":{
            "choices":[
                "Will,why do you complain about my weight?",
                "Will I've realized you gained a bit weight?",
                "Don't say anything just look at him with disgusted look "
            ],
            "content":"<div class=\"\"><div> <span>She looked for Will. He was sitting alone eating his lunch. She came over to his table.<br>\r\n-Will,can we talk about something?-Kim said with her voice being as cold as possible.<br>\r\n-Sure,I guess-replied bored Will. <br>\r\nHe ended his meal and both of you walked to the school's corridor. Kim stared at Williams body. Now she saw all his flaws. A bit too long legs and really bony hands. Also a bit too thin body. What will she say?</span></div></div>",
            "created":1482728400,
            "id":2254588,
            "title":"Talk with Will abou it"
        },
        "123":{
            "choices":[
                "Saw her friends were waiting for her outside the stall",
                "She washed her hands and left the bathroom, bumping into Will on the way"
            ],
            "content":"<div class=\"\"><div> <span>Kim got out of line and hurried to the girls bathroom. She was alone in the bathroom but just to be safe she locked herself in a stall. Behind the closed door, Kim lifted her shirt and looked down at her belly.<br>\r\n<br>\r\nKim had expected her belly to bigger after stuffing her stomach at breakfast and eating lunch but not that much bigger. Her stomach stuck out a good three inches farther than normal and expanded even farther as she breathed out. Kim felt her belly gingerly, trying to determine if her eyes were deceiving her. They weren't.<br>\r\n<br>\r\nKim sat down on the edge of the toilet seat, shocked. Her friends were right, she had gained weight. Maybe not a lot but enough that Will had noticed.<br>\r\n<br>\r\nKim pulled her shirt back over her belly and sat for a moment, still taking in her recent gain. She stood up and flushed before leaving the stall and...</span></div></div>",
            "created":1276059600,
            "id":897198,
            "title":"Go in the bathroom and find out for sure"
        },
        "1231":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Get more food despite her friends opinions",
                "Ask the instructor about her opinion of weight gain",
                "Resign"
            ],
            "content":"<div class=\"\"><div> <span>When Kim came out of the stall, Ty said, \"Now do you see what we are talking about?\" \"Yeah, I guess...\" Kim replied. The main chaperone aproched them. \"Hey guys, your parents are going to be here to pick you up in 35 minutes. Just letting you know.\" She said. <br>\r\nWhat will Kim do?</span></div></div>",
            "created":1329195600,
            "id":1276865,
            "title":"Saw her friends were waiting for her outside th..."
        },
        "12311":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "After lunch",
                "At school, the next day"
            ],
            "content":"<div class=\"\"><div> <span>Although Kim was kind of concerned about her weight gain, the buffet they were at was her very favorite. While in her opinion, the entrées were great, but her favorite part was the all-you-can-eat dessert bar. The bar was almost twice at long as the regular meal bar. When Kim arrived at the bar, she served herself an entire platter of brownies, pudding, ice cream, and eclairs. She sat down in the chair between her friends and dug in. She greedily stuffed the fattening desserts into mouth. When she was done, she went back for seconds and shoved more desserts down her greedy gullet. She even went back for thirds. Although she was very full, she barley finished.<br>\r\n\"Are you sure you should have eaten all those desserts?\" One of Kim's friends asked. \"It was so yummy! I almost want to go back for a fourth helping!\" Kim replied. She glanced at the dessert bar and waddled over for more dessert. She only got half a serving because she was so full. She slowly but surly finished dessert. Kim's belly looked softer and rounder after dessert.</span></div></div>",
            "created":1329627600,
            "id":1279839,
            "title":"Dessert stuffing"
        },
        "123112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Cooking",
                "Gym"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is the main class she has today?</span></div></span></div>",
            "created":1329627600,
            "id":1279840,
            "title":"At school, the next day"
        },
        "1231121":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "After Class",
                "Durring class"
            ],
            "content":"<div class=\"\"><div> <span>The following day at school, Kim's main class was cooking. In the cooking class there are 30 people; 25 cooks, 4 group leaders, and the taste-tester, who happened to be Kim. The job of the taster was to eat a serving  of one person's meal and write a paragraph about it. There were less taste testers this year than there usually were, dispute it being the easiest position in the class. However, many of the past taste testers did gain large amounts of weight. One girl actually grew double her size because of her eating. Since Kim was the only taste tester in the class, she had to eat everyone's meals. It was also near the beginning of the new school year, so the effects didn't cause Kim to add anymore girth on her frame...yet.</span></div></div>",
            "created":1330146000,
            "id":1283702,
            "title":"Cooking"
        },
        "12311211":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Inside the house",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After a short sit and a belly rub, Kim started to walk home. She took a dirt path behind her school as a shortcut. She didnt like the walk home; in fact, she didn't like any sort of physical activity. The only reason why she was in ballet was because some of her friends were in it and her mom didn't want her to become obese. All Kim wanted to do is sit on the couch and eat chocolate all day. Kim looked down at her belly. Kim was always a big girl, but she was never super fat; she was just soft all over. However, she did notice that she has gotten a bit more chubby over the last few weeks, but she didn't mind gaining a few pounds, nor would she mind gaining more. Around four-fifths of the way home, she smelled multiple delicious aromas coming from behind a bush. Out of curiosity, she tried to move the branches of the shrub. No luck. After that, she took 10 big steps back, and ran as fast as she could towards the shrubbery. Although she made her way through, she still had little luck because she landed face first in the backyard of a house. But on the bright side, her head was cushioned by a large pan of brownies. \"Owwwie!\" Kim cried. A women emerged from the house. \"Oh my god! Are you okay little girl?\" The woman asked. The woman was ver plump; she had long and curly brown hair that went all the way to her lower back. She had a fat belly, breasts, arms, butt, and legs. She was wearing a tight tanktop and hot pants that showed off her curves. \"Oh my, you also look starving! Lets get you something to eat!\"</span></div></div>",
            "created":1332738000,
            "id":1302807,
            "title":"New neighbor"
        },
        "123112111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Kim Quits Ballet",
                "Kim goes home"
            ],
            "content":"<div class=\"\"><div> <span>\"But first you can have those brownies.\"<br>\r\n<br>\r\nKim blinked for a moment and then slowly began shoving the brownies into her mouth. As soon as the first brownie hit her tongue she was in heaven. It was just the right amount of firmness and softness. She quickened her pace and quickly devoured the brownies and then licked the chocolate off her hands and face.<br>\r\n<br>\r\n\"My you are starving aren't you, poor girl.\" the woman said. She helped him up and said:<br>\r\n<br>\r\n\"Come on there's lot more food inside.\"<br>\r\n<br>\r\nThe woman gently pushed Kim into the house where a delicious aroma-the aroma that had lured her in the first place greeted them.<br>\r\n<br>\r\nThrough the door was a kitchen where a large table covered with plates of different foods sat.<br>\r\n<br>\r\n\"My you are a tiny thing\" the woman said as she sat Kim down at the head of the table. \"Start with this.\"<br>\r\n<br>\r\nShe placed a large bowl of mashed potatoes heavily saturated with gravy.<br>\r\n<br>\r\nKim rubbed her hands together excitedly and taking the large spoon began shovling the mashed potatoes into her mouth.<br>\r\n<br>\r\nThey tasted so good, again a perfect mix. Was this woman some kind of angel chef?<br>\r\n<br>\r\nKim shoveled spoonful after spoonful into her greedly mouth spilling some onto her lap and disteded paunch.<br>\r\n<br>\r\nAfter finishing she rubbed her belly.<br>\r\n<br>\r\n\"Yummy that was really good!\"<br>\r\n<br>\r\n\"Would you like some more, I bet you're still hungry.\"<br>\r\n<br>\r\nAs much as Kim wanted to she shook her head. She was quite filled up from that and the brownies before plus cooking class at school.<br>\r\n<br>\r\nThe woman looked a bit disappointed.<br>\r\n<br>\r\n\"Oh well feel free to come anytime. I always eat alone so it would be nice to have company.\"<br>\r\n<br>\r\nKim thought for a moment.<br>\r\n<br>\r\n\"Well this is on my way home from school so I could come most days if you like Ms...\"<br>\r\n<br>\r\nShe smiled.<br>\r\n<br>\r\n\"You can call me Anne. And I'd love for you to come.\"</span></div></div>",
            "created":1338958800,
            "id":1353703,
            "title":"Inside the house"
        },
        "1231121111":{
            "choices":[
                "The next day, at Anne's",
                "The next day, at cooking class"
            ],
            "content":"<div class=\"\"><div> <span>Kim had a decision to make: Would she stop her gluttony, or would she stop her ballet? It was easy, with so much delicious food to coax her. She decided to quit. Kim sauntered home, listening to the satisfying slosh of her past meal in her ever-growing paunch. She entered her modest brick house, and confronted her mother.<br>\r\n\"Mom, what if I quit Ballet? for good?\"<br>\r\n\"Why would you want to do that?\" Her mother asked, puzzled. \"Don't you enjoy it? I thought you might like that Will boy.\"<br>\r\n\"Oh, he's sweet, and ballet is fun, but I dont like it as much as I used to.\" Of course, the REAL reason was because of her weight gain, which she knew she wouldn't stop any time soon. \"Besides, I want to free time after school to...\" She stopped, realizing she had no idea what she would fill her time with. Then she remembered cooking class \"...practice my baking! We learned to make brownies in cooking class, so I thought I could learn other dishes as well!\"<br>\r\nHer mother thought for a minute \"well, all right. So long as you learn a few healthy dishes as well, ok?\"<br>\r\nKim was delighted \"ok mom! Love ya!\" And Kim waddled off to her room to finish her meaningless math homework before going to bed, and dreaming of food.</span></div></div>",
            "created":1482210000,
            "id":2252638,
            "title":"Kim Quits Ballet"
        },
        "1231121112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "...hit it off with Anne",
                "...was disgusted with Anne"
            ],
            "content":"<div class=\"\"><div> <span>Kim walked through her front door eating a cookie that Anne gave her. Kim's mom was reading a book in the foyer. \"Where were you? You were supposed to be home an hour ago!\" Kim's mom said. \"I was *urp* meeting the new neighbor, Anne.\" Kim replied. \"We have a new neighbor? When did she move in?\" Kim's mom asked. \"She said something like a week or two ago.\" Kim explained. \"Hrrm... I am going to meet Anne. In the mean time eat dinner and put your ballet dress on; we're leaving in 45 minutes.\" Kim's mom said as she walked out the door.<br>\r\nKim walked into the kitchen and found that her mom made her favorite dinner: fried chicken and triple patty burgers with mac and cheese and fries on the side. Dispite this being Kim's favorite dinner, Kim's mom only made it once a month, becuase not only did Kim's mom think that making this fattening dinner too often could be unhealthy to Kim, but also becuase Kim's mom recently stopped making two dinners. (A tasty one for Kim and a healthy one for Kim's mom.) Becuase of this, Kim's mom immediately started to pack on a few pounds and develop a bit of a soft tummy.<br>\r\nKim first started with the Mac and cheese, then her three fried chicken legs, then the French fries, and then finally she moved on to her two massive burgers. She finished the last bite of her burger and rubbed her stuffed belly. \"Ohhhh, that was so yummy! I hope mom makes it again soon!\" Kim thought to herself. <br>\r\nAfter her fried food binge Kim put on her ballet outfit, which she noticed was reasonably tighter than usual. Kim looked at herself in her bathroom mirror. She saw that she had a bit of a muffin top now. She slowly held her soft love handles and caressed them. She then put her pinkie finger into her belly button. She giggled a bit. She than heard the front door open and close.<br>\r\nHer mom...</span></div></div>",
            "created":1339304400,
            "id":1357156,
            "title":"Kim goes home"
        },
        "12311211121":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "The phone rings",
                "The doorbell rings"
            ],
            "content":"<div class=\"\"><div> <span>Kim's mom came through the front door carrying a devil's food cake wrapped in plastic in her arms, a cookie in her mouth, and a grin on her face. <br>\r\n\"What did you think of Anne?\" Kim asked.<br>\r\n\"What a nice woman! I've never seen a person that hospitable!\" Her mother replied. \"She offered me so much of her delicious food!<br>\r\nToo bad I couldn't stay longer!\"<br>\r\nKim looked at the Devil's food cake. It look as if Anne made it since Kim saw many cakes at her house.<br>\r\n\"Can I have a slice of the cake?\" Kim asked.<br>\r\n\"Did you clean your plate?\"<br>\r\n\"Mostly...\"<br>\r\nKim's mom looked at the plate; there was still a third of a serving of the macaroni, a small chicken thigh, and a half of a burger. <br>\r\n\"Finish your plate and you can as much cake as you'd like.\" Kim's mom replied.<br>\r\n\"Owwww... But I ate so much today!\"<br>\r\n\"Eat what you need to and you'll grow strong! You'll have abs just like me!\"<br>\r\nKim's mom always gave this lecture every time Kim didn't finish her food and she lifted up her shirt to she Kim her Toned abs. But because of the weight she recently gained, her once-toned abs were somewhat buried in a layer of fat.<br>\r\nKim rolled her eyes and finished up her meal. Each bite was harder to swallow than the last but she eventually finished. She than cut herself a third of the cake and tucked in.<br>\r\n\"That's my girl.\" Kim's mom said while rubbing her back.<br>\r\nThen...</span></div></div>",
            "created":1344229200,
            "id":1398687,
            "title":"...hit it off with Anne"
        },
        "123112111212":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Kims father had left them so Ann moved in",
                "Kims mother started to do some baking as well"
            ],
            "content":"<div class=\"\"><div> <span>It was Ann at the door and she brought over some sweets like brownies, cookies, another cake, and a bunch of junk food. She would usually come by almost every day with sweets. Around a month and a half after she had started. Kim noticed that whenever her mom would give her the speech about not eating all of her dinner that she was getting bigger every time she would do it. Kims mom was getting almost as big as Ann and she hadn't even noticed it.</span></div></div>",
            "created":1487394000,
            "id":2279222,
            "title":"The doorbell rings"
        },
        "1231121112121":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "a year passes ",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>They would have Ann come by for dinner a lot of nights (Ann brought the food of course) and she would help out with things around the house here and there while Kim and her mother enjoyed her cooking. Over the months Ann would let herself in and bring treats and tell Kim's mother to relax and eat. Kim's mother didn't have a problem with Ann coming right in because they were so close. Kim would always have to wait to eat the treats because her mom said she would have to wait until after dinner. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1564981200,
            "id":2697585,
            "title":"Ann would stop by to \"help out\""
        },
        "12311211121211":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Kim's mother finds the treats and everyday she \"gets rid of them\"",
                "Kim asks for bigger treats "
            ],
            "content":"<div class=\"\"><div> <span>After a year of eating all of Ann's food Kim and especially her mother plump up. Kim's mother has blooned up to 300 pounds. She has started eating the desserts Ann brings over before dinner and she eats most of it before Kim can get to it. When Kim complains she just says that she is an adult and that if Kim ate a little healthier than she could afford to eat desserts before dinner. Her mother knows she has gained some weight but just shakes it off and says its only a few pounds. But she still critisizes her daughter for over eating. Sometimes she even tells Ann to make healthier food for Kim's sake. But then when Ann does make healthier food she tries to make Kim eat it and doesn't even try it herself. When Kim complained to Ann tha ther mother was eating mot of the desserts, Ann felt bad and started to make Kim some treats to \"tide her over\" until dinner.</span></div></div>",
            "created":1564981200,
            "id":2697593,
            "title":"a year passes "
        },
        "123112111212111":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Kim's mother really porks up ",
                "Kim complains to Ann"
            ],
            "content":"<div class=\"\"><div> <span>Kim's mother finds Kim with a treat and asks Kim where she got it. Kim not wanting to get in trouble says Ann gave it to her knowing her mother loves Ann and she is practically a mother to her. Kim's mom says that she will get rid of it because it was too much sugar for her. and everyday Kim tries to get away with the treats whether they are brownies, cookies, cupcakes, her mother will find them and take them away. Kim never once thought that her mother could smell the baked goods that she snuck in down the hall. But she would make sure Ann never saw or knew because she told Kim she didn't want to hurt her feelings. When really she just wanted some more of Ann's baking without showing her daughter.</span></div></div>",
            "created":1564981200,
            "id":2697597,
            "title":"Kim's mother finds the treats and everyday ..."
        },
        "1231121112121111":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Kim starts investigating weird things that are going on ",
                "Kim's mother keeps getting bigger and bigger"
            ],
            "content":"<div class=\"\"><div> <span>Over the next 6 months Kim's mother has really porked up. She is at 375 pounds. Her boobs stick out more than her stomach so she believes she isn't as big as she actually is. One day Kim asks her mom why she gets to eat all of these treats and she has to wait until she eats her \"healthy\" dinner to eat whatever her mother has left her. And Kim's mother says that she can afford it. While she pats her big belly she tells Kim that she can afford to gain a few pounds because she isn't that big. While on the other hand Kim was a very chubby child so she couldn't eat as much as her big and strong mom. Then her mother gave her the lecture  that if she eats her \"healthy\" food first then she will have toned abs just like her mom. Then she asked her mother why she doesn't have abs. Her mother said that she has a little padding but they are still there. She bumped Kim with her belly and Kim fell on to the couch and she said \"see if I didn't have abs I couldn't have done that\". A few minutes later right before dinner Kim's mom decided to check the scale to make sure she still was fit. When she got into her bathroom her mirror she had was too small to show her body it only showed her face. But she stepped on the scale and it said 175 pounds. She felt good and didn't worry. She went to her room but remembered there was a small one in there too. It only showed her face, then she remembered she used to have a bigger one a while back. When she tried to remember what happened to it Ann showed up with a piece of apple pie with ice cream and thick homemade whipped cream, her favorite, and said that dinner was ready. Kim's mom forgot about the whole thing and went to eat her dinner.</span></div></div>",
            "created":1564981200,
            "id":2697606,
            "title":"Kim's mother really porks up "
        },
        "12311211122":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Tell her mom that she was cut",
                "Go to Annes instead of ballet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kims mom came in and told kim to never visit her again. She said that after school she should go right to ballet and then walk home. But the next day at ballet the coach told her she was cut from the ballet team. What does she do next.</span></div></span></div>",
            "created":1485666000,
            "id":2271031,
            "title":"...was disgusted with Anne"
        },
        "123112111222":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Tell her mother it was from ballet",
                "Come clean to her mom"
            ],
            "content":"<div class=\"\"><div> <span>Everyday after school Kim would go to Annes house instead of ballet. She was getting so stuffed from cooking class then Annes house, then dinner at her house. A few weeks later when she was going through the bushes to Annes house she fell and rolled her ankle. </span></div></div>",
            "created":1485666000,
            "id":2271034,
            "title":"Go to Annes instead of ballet"
        },
        "1231121112221":{
            "author_id":"joshjohnson",
            "author_name":"toodles123",
            "choices":[
                "Weeks later",
                "Monthes later"
            ],
            "content":"<div class=\"\"><div> <span>When Kim rolled her ankle her mom put her in the wheelchair. So she wasnt moving that much. So all she did was eat breakfast then go to school eat lunch there  cooking class and annes and her dinner. She was being stuffed so much . Anne was feeling bad so she stuffed her even more until she could barely fit in the chair.</span></div></div>",
            "created":1485666000,
            "id":2271037,
            "title":"Tell her mother it was from ballet"
        },
        "12311212":{
            "choices":[
                "She was being dramatic, and Will has little trouble lifting her",
                "She is heavier, and a burden on Will."
            ],
            "content":"<div class=\"\"><div> <span>\"All right class, today's the big day!\" Mrs. Robinson, the instructor said, wheeling in a cart draped in cloth. \"You all have been eagerly waiting for this day, I'm sure; today, you will learn to make desserts!\" Kim's eyes lit up, and she suddenly felt hungry, as if she had completely skipped breakfast altogether. \"Finally\" She thought to herself, one hand on her growling belly, \"I can stuff myself silly with all the fattening things my class can think of!\" Of course, Kim had fantasies of masterfully crafted cakes and pies and the like, but She as merely in fourth grade. Her classmates were mediocre chefs at best. \"So, class, what will we make first? Any suggestions?\" Voices cried out at once, with a chorus of fattening treats flying in all directions. \"I should have expected so many creative ideas from you all. How about we let out taste-tester decide for us. Kim? What will the class make today?\" Kim was even more excited! She thought for a minute, before deciding that brownies were best. \"All right, brownies it is!\" So the class set to work, mixing ingredients together to produce the fattening, not quite cake-like dessert that Kim cherished. The smell emanating from her baking class was torture, but finally, after an agonizing thirty minutes, the treats were done. \"line up! Let the taste tester decide your fate!\"<br>\r\n<br>\r\n\"Wow!\" Kim said under her breath. \"These suck! SO much!\" But, she wouldn't say that out loud. She feigned a smile for her friends, and at the fact that the treats were a guilty pleasure of hers. With a burp, she laid the less sticky of her hands on her satisfied little belly. After 24 of the 10 gram samples she ate, She was stuffed to the brim with more than half of the calories she needed in a day. \"OH man, my mom will KILL me when I get home. But it was SO good! Well, some of it was\". Then a thought occurred to her: Oh snap, my practice with Will is tomorrow! Oh, This is going to go straight to my thighs and butt and he will NEVER be able to lift me!\"<br>\r\n<br>\r\nIs she being dramatic, or will she pay the price for her gluttony?</span></div></div>",
            "created":1482210000,
            "id":2252635,
            "title":"Durring class"
        },
        "1231122":{
            "choices":[
                "She then goes home and eats a whole cheese cake",
                "After gym class."
            ],
            "content":"<div class=\"\"><div> <span>     Gym class had begun, The 12 year old kim stands in line along with her class mates getting instructions from her gym teacher. But kim is too preoccupied with her shirt rising up showing off her soft soft underbelly and deep navel. <br>\r\n<br>\r\nShe looks around at the other kids and saw how taunt and thin everyone else is. She then looks down at her soft protruding potbelly and thought \"all man its gotten even bigger.\" She then made a sudden movement and was shocked to feel a very unpleasant jiggle from her backside. \"HUH?\" having a befuddled look on her cute chubby face. Kim feels back on her backside only to find that it has gotten soft and squishy. \" Oh no. not my booty.\" Kim slaps it making bubble butt jiggle from left to right. the vibration went all the way up to her small lovehandles. <br>\r\n<br>\r\n\"KIM FOR NOT PAYING ATTENTION YOU WILL DO FIVE LAPS. GO!\" The gym teacher shouted. \"Awwwww\" So kim began to run. <br>\r\n<br>\r\nAfter a half a lap kim starts to trot. Her big soft belly bounces and jiggles, quivering with every step. Her shorts start to wedge in her fat jiggly booty and her shirt has risen to show off her whole stomach. but by now she didnt care. Kim is huffing and puffing breathing hard through her mouth, her fat juicy cheeks quiver and shack as her eyes roll from fatigue. By the end of the second lap Kim is wheezing and snorting. \"Ok stop.\" <br>\r\n<br>\r\nThe poor gluttonous 12 year slides down the wall. her thick thighs spread out and her belly heaves up and down. some of the kids were giggling. Kim was too tired to be embarrassed.</span></div></div>",
            "created":1400648400,
            "id":1799831,
            "title":"Gym"
        },
        "13":{
            "choices":[
                "They go home and wendy force feeds Madison",
                "Her dad pampers her and fixes a huge meal.",
                "She gos out with friends ",
                "something else happens",
                "something else happens"
            ],
            "content":"<div class=\"\"><div> <span>     11 year old Madison and her family were at the movies watching a kids movie. \" What do you want to eat Maddi?\" her dad ask. \"Mmmm Can I have two hot dogs with chilly and cheese with fries and a drink.\" Madison asked with a big smile on her cute little face. \" Wow! ok honey but dont make ur self sick.\" Being a daddys girl dose pay off for he usually got her what ever she wanted. <br>\r\n<br>\r\nHer older sister Wendy thought she was a pig. But she love to stuff her with food.<br>\r\n<br>\r\nHer clothes were a little tight on her already, Her pink spandex pants and the arch in her back shows off her rather curvy grown up lower body and her white tanktop shirt clings to her showing a little of her small underbelly.  with big beautiful brown eyes, full lips and freckles she is very adorable. <br>\r\n<br>\r\nMadison sits on her older sisters lap in pure bliss as wendy feeds her a hotdog. Her face is covers in chilly and cheese. \"Mmmph, mmph mmph.\" It like shes in a trance. Her jaw chomps up and down eating like a hog. <br>\r\n<br>\r\nAfter she ate all the food she leans back on her sister. Her sister places her hand on her bloated belly. \" You got fat thigh and a fat butt.\" Her sister teases her pinching her rather meaty thigh and soft booty. after the movie...</span></div></div>",
            "created":1400216400,
            "id":1797219,
            "title":"Madison"
        },
        "131":{
            "author_id":"tybrantly",
            "author_name":"Personman395",
            "choices":[
                "Head to the Bed and have Wendy play with her sister’s new flab",
                "More feeding!"
            ],
            "content":"<div class=\"\"><div> <span>After getting home, Madison tells Wendy she’s hungry. Wendy was more than happy to remedy her sister’s problem. She got out a whole bunch of food for her sister. Madison looked eager to eat all the delicious food before her. Once Madison started, she seemed to eat forever. She ate and ate and ate and ate. Wendy put food in her mouth one after the other and Madison happily ate each and every little thing. She seemed to be visually getting bigger. She seemed to swell and buldge more and more with every bite. Her belly became bigger and bigger until it fell and hung in between her massive thunder thighs. Her butt became massive, and the chair creaked, struggling to keep all of Madison’s growing figure supported. She even started to grow breasts (and they weren’t small either). Both Wendy and Madison both seemed to enjoy this. Wendy loved watching her sister get bigger and feeling her growing flab. Madison loved to watch her big belly, butt, breasts, and everything else really grow out, and she loved the feeling whenever they jiggled. Eventually, the feeding stopped. Wendy put everything away and admired her sister. She no longer looked like the 11-year-old she was. Except she didn’t grow up, she grew out. And Madison loved it. Madison’s massive butt now hung off both sides of the chair, and her belly hung so far out in front of her she could barely reach her hands over it. She could hardly see over her huge breasts, and she definitely couldn’t see over her belly. Her feet became invisible too her. With much difficulty, she got off the chair and waddled over to the scale with everything on her jiggling as she made her way over. Madison found the feeling amazing. When she got on the scale, Wendy had to tell her how much it said. “300 Lbs! Wow sis, I can’t believe you packed that all in there!” Wendy told her sister happily. Madison could hardly believe it either. After all this, the sisters decided too..</span></div></div>",
            "created":1563771600,
            "id":2690816,
            "title":"They go home and wendy force feeds Madison"
        },
        "1311":{
            "author_id":"tybrantly",
            "author_name":"Personman395",
            "choices":[
                "It’s time for an interesting day at school",
                "Forget school! Madison’s hungry!"
            ],
            "content":"<div class=\"\"><div> <span>It was a hard trip that required much assistance, but they were able to make it to the bedroom. Madison sat down on her bed, completely out of breath, causing it to creak a lot under her massive frame. “Want a belly rub?” Wendy asked her sister. “Yeah!” Replied a very full Madison. Wendy was very happy to give her sister a belly rub, and loved the way her sister felt. She began by putting her hands on her sister’s belly, and allowed her hands to sink in to the softness. She moved her hands around her sister’s big buldging belly, feeling all the fat. She then gave Madison’s belly some little kisses. When she did, her face sank in to the ears in flab. “Hee hee hee! That tickles.” Madison told Wendy. Wendy smiled and continued to rub her sister’s belly. It really was giant. It was hard to see Madison’s face over it, and her belly hung between her sister’s legs. In fact, the way she was sitting, with her legs over the side of the bed, her belly seemed to almost touch the floor. Speaking of her legs, they also got pretty big. Each leg was twice as thick as Wendy’s arms. Wendy moved her hand down and pinched her sister’s massive thighs. Feeling the fat. And Madison’s butt was massive as massive can be. Even sitting with her legs over the bed, her butt still seemed to hang over the other end. Wendy tried to reach around Madison to squish her butt, but Madison was so big she had to get up and walk around. She gave Madison’s butt a slap, and it rippled like water. It was almost hypnotizing. Madison loved that feeling. “Do it again!” She asked her sister. So Wendy gave her giant booty a few more slaps, not too hard, but definitely caused a decent amount of jiggles. Wendy then walked back around her sister and shook her breasts a bit. Madison then asked her, “Can you go back to my tummy?” So Wendy started not just rubbing her sister’s belly, but shaking it, causing waves of flab to shake, slapping it, causing her fat to ripple and jiggle, and she even lifted it and dropped it, which caused a whole lot of jiggles. Eventually, Madison got tired and wanted to go to bed. So, with the help of her sister she changed her position on her bed and Madison fell into a quick deep sleep. Wendy, loving the feeling of her sister, decided to sleep next to her. She was so comfortable! Wendy soon fell asleep using her sister as a pillow (and kind of a mattress too!) The next morning...</span></div></div>",
            "created":1563771600,
            "id":2690822,
            "title":"Head to the Bed and have Wendy play with her si..."
        },
        "13112":{
            "author_id":"tybrantly",
            "author_name":"Personman395",
            "choices":[
                "Wendy plays with her newly fattened sister",
                "The Parents come home "
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Wendy and Madison woke up. Both of them had school, and neither wanted to go. To remedy this, Wendy managed to convince her parents that they were sick. After they were home alone, Madison asked Wendy for more food. Wendy was more than happy to comply. With help from Wendy, Madison got out of the bed and made her way to the kitchen. She was still in her clothes from last night, and Madison just realized how much she outgrew them. Her massive tummy had pushed her tank top up and half of her ginormous belly was now visible. Her pants weren’t fairing much better. Her titanic ass filled up her tight spandex pants, and they had rips and tears all throughout where Madison’s fat ass poked out. Madison waddled to the kitchen, and all of her shook tremendously. Her big butt wobbled, and it was hypnotizing to watch. Wendy couldn’t help but stare at her Sister’s swaying belly, it was such a beautiful sight. Madison sat her plump ass on the chair and waited for the food. The chair creaked, and Madison hoped in the back of her mind that she would break the chair. Wendy then brought over lots and lots of food, and began to feed Madison. She took bite after bite, and it was even more intense then the previous night. Madison grew and grew, her chins multiplying, her cheeks growing larger, her boobs becoming more massive, her belly swelling, and her fat ass and thighs plumping up. Suddenly without warning, the chair gave way, and Madison’s obese body fell onto the ground. However, her booty had become so large that she wasn’t hurt. Furthermore, her entire body jiggled something fierce. Madison was deep in pleasure at this. Wendy brought Madison more food and they continued. Soon Madison’s pants ripped off of her body, her gargantuan ass had ripped it apart. She was now in her underwear. Her shirt didn’t rip, but her tummy was now so huge that it was less of a shirt and more of a bra, struggling to cover her huge titties. After a while, the feeding stopped. Madison was completely huge. “Well sis, that was very impressive, do you wanna get weighed now?” Wendy asked. “Uhhhh, yeah but slight problem,” Madison replied. “I can’t move.” It was true. Madison was now completely immobile. Her plump arms were at her sides, and her feet couldn’t touch the ground, as her fat ass pushed her up to the point her feet couldn’t touch the ground. “No matter, but by the looks, you’ve hit 700 pounds! You’re gorgeous Madison!” Madison blushed. Next, </span></div></div>",
            "created":1577681160,
            "id":2766785,
            "title":"Forget school! Madison’s hungry!"
        },
        "131121":{
            "author_id":"tybrantly",
            "author_name":"Personman395",
            "choices":[
                "More food for Madison",
                "Wendy’s hungry"
            ],
            "content":"<div class=\"\"><div> <span>Wendy couldn’t help it. Madison had become the most beautiful thing possible. Wendy feel to her knees and began to play with Madison’s tummy. She kneeded the dough, and savored the feeling. She shook Madison’s belly, and also lifted and dropped it, causing a jiggle storm. She then climbed Madison’s tummy and groped and caressed Madison’s tits, feeling their size and beauty. She was enthralled by the sight. Madison didn’t mind any of this, and actually enjoyed it. Madison was deep in pleasure, and wanted it to never go away. Wendy meanwhile, got up, and felt Madison’s legs, and walked along her side, feeling her sister’s plump leg and thigh. She walked behind her sister, and gave her two big butt cheeks a passionate squeeze. She then gave one of the cheeks a light slapping and continued squeezing the other. Even the slightest touch of Madison caused a storm of jiggiling. She then walked back around to her front and played with her tummy some more. She then climbed Madison’s belly once more, and got face to face with Madison’s adorable face. She looked at Madison’s plump face, and gave her fat cheeks a quick pinch. Then, without warning or hesitation, she gave Madison a passionate long kiss. Madison kissed back, and they held it for a bit, before Wendy started making a trail of kisses down Madison’s fat face, her chins, her boobies, until finally reaching her belly. She then played with her tummy with kisses while her hands fondled her fat rolls on her sides and back. Finally she stopped and looked at Madison. Madison looked back at Wendy. Wendy smiled at Madison, and said, “Madison, I am in love with you.” Madison blushed and then said, “I love you too.” Wendy jumped back up and kissed Madison again while playing with the pile of flesh that was her sister. Now, </span></div></div>",
            "created":1577682180,
            "id":2766789,
            "title":"Wendy plays with her newly fattened sister"
        },
        "1311212":{
            "author_id":"tybrantly",
            "author_name":"Personman395",
            "choices":[
                "Wendy goes to get more food for them both",
                "The parents come home"
            ],
            "content":"<div class=\"\"><div> <span>Wendy was now looking at her step-sister and felt a sudden urge to be just like that. In her mind, Madison was perfect. She wanted to be perfect too. She went to the kitchen to prepare herself a feast. Wendy was a smart girl, and she was a couple years older than Madison, her step sister, and was in 5th grade. She also was very tall for her age. She is wearing a button down shirt and some jeans. She was also very cute, like Madison. After a while, she finished preparing her meal, and began to eat. She did it in front of Madison so she could watch her grow. Madison was eager to see her sister blow up just like she did. Slowly but surely, the pounds started to pack on. Wendy began to grow in all ways. Her arms became softer. Her chins multiplied. Her belly became rounder and plumper. Her bum was starting to rip her jeans, and so were her growing thighs. And she was also starting to grow a pair of boobs. She grew and grew and grew. Until suddenly, POP! Her jean button burst off, and Wendy felt a great wave of satisfaction. Her belly hang over her jeans, and dangled in front of her. Wendy gave it a squeeze and loved how soft it felt. Suddenly, there was more popping, and her shirt buttons began to come off, one by one. Her shirt began to rise higher and higher as it struggled to contain her growing frame, until it stopped, with a button fighting fiercely to contain her breasts from breaking loose. Her jeans were also starting to tear. She could hear rips while she ate as her thighs and ass grew. She could feel bits of fat sticking out, and her butt was not going to be contained much longer. Her face also grew very plush, and she had too many chins to count. Madison watched enjoying her sister grow, and felt as much enjoyment watching Wendy grow as Wendy did watching Madison grow. Rolls began to form all over Wendy, and they spread all around her belly. Suddenly there was a loud rip. Wendy’s titanic booty completely shredded her jeans. Wendy was in pure ecstasy. At last, her feast was over, and she felt very satisfied. “Hey, Wendy, you got to feel me when I got big, now let me feel you” said Madison. Wendy knew that she would have to come to Madison, since her step sister was fed to immobility. Wendy, with difficult, waffles to Madison, and approached her side where one of her fat arms could reach her. Madison reached out and squeezed Wendy’s belly. Wendy and Madison both loved the way it felt and was happy they could experience this from the opposite end. “Wanna play with my fat?” Wendy asked Madison. “Yeah!” Said Madison, who was already having fun with Wendy’s plump tummy. Wendy then turned around, and allowed Madison to get some good squeezes of her extremely large butt. Madison gave both of Wendy’s cheeks multiple and good squeezes. Then, Wendy turned around and allowed Madison to go back to her front. This time though, Madison grabbed her step-sister’s breasts, and gave them good squeezes and shakes. Finally, Madison was done. Wendy decided to weigh herself. It took a few tries to read the scale, but she was able to make out at least 400 lbs. Wendy’s tubby legs began to feel sore from carrying her large frame around, and longed to take a rest. She decided to plop herself down in front of her step sister, with their bellies touching. Wendy was suprised to feel that she was in no discomfort on the floor, due to her rump providing all the cushion needed. Madison and Wendy rested for a bit, and then...</span></div></div>",
            "created":1582790760,
            "id":2793648,
            "title":"Wendy’s hungry"
        },
        "132":{
            "author_id":"ceilidhm",
            "author_name":"BLUEsuedeSHOE",
            "choices":[
                "Lasagna",
                "Mac&Cheese"
            ],
            "content":"<div class=\"\"><div> <span>The drive home was not very comfortable for Madison. The eight-year-old's belly was stuffed full with food, and while she enjoyed being stuffed past her capacities, driving over the bumpy road was not the most pleasant of experiences. When she let out grunts of slight pain though, Wendy bent over and rubbed her tummy in order to make her feel better. Wendy's gentle strokes changes her grunts of pain to grunts of passion.<br>\r\n<br>\r\n“Maddi's not feeling very good, Dad”, she said to their father, Hal, who gave them a quick glance over his shoulder and laughed.<br>\r\n<br>\r\n“Ate too much, huh?”, he teased affectionately.<br>\r\n<br>\r\n“Noooo...”, Madison tried to protest, even though she knew it was very obvious she was lying.<br>\r\n<br>\r\n“Well, I know just the remedy for that”, Hal said.<br>\r\n<br>\r\nWhen they finally got home, Hal picked Madison up from inside the car and carried her inside. Wendy followed behind. Usually, she would get envious if their father treated Madison like a little princess, but after the movie and after feeding Madison, she was in too good a mood for it to be tarnished by something so trivial.<br>\r\nHal carried Madison into the big, comfortable living room and placed her on the sofa, where he wrapped her into a blanket like a toddler. Then he left the room. How bloated Madison was from eating so much food was very obvious now. Ever since they moved here, she had been eating a lot more than before and it had started to show. Even when she hadn't eaten anything, her belly protruded a bit and jiggled whenever she ran. Her butt also had gotten bigger and her face had gotten just a tiny bit more cherubic, too. Wendy and Madison's father wasn't bothered by this at all. He called it “baby fat” and said that growing girls had to eat a lot. But now, just after eating all those snacks, she had a full stomach that stood out as a round, heavy sphere that was obvious even under the blanket. She let out the most petite of burps as she sprawled on the sofa.<br>\r\nWendy took a cloth from the kitchen to wipe Madison's face. <br>\r\n<br>\r\n“You're a spoiled piglet”, she said as she did so. Madison giggled.<br>\r\n<br>\r\nJust then, Hal came back and beamed at his two precious daughters.<br>\r\n<br>\r\n“I prepared a bath for you, Maddi. It will make your tummy feel much better”, he promised.<br>\r\n<br>\r\n“Awesome!”, Madison cheered and raised her arms to indicate that she wanted to be carried to the bathroom.<br>\r\n<br>\r\n“Wendy, you may watch TV if you want to”, Hal told his other daughter cheerfully as he lifted Madison up, leaving the blanket behind. <br>\r\n<br>\r\nWhen Madison leaned over her father's shoulder, her stuffed belly pressed against his chest and she had to burp again.<br>\r\n<br>\r\n“Urp... 'scuse me”, she murmured under her breath.<br>\r\n<br>\r\nHal just laughed and carried her outside. Wendy sat on the sofa with the remote control and wrapped herself into the blanket that had been preheated by her rotund sister.<br>\r\n<br>\r\nThe bathroom was warm, lit by the nice modern LED lights from above, with a white and cream interior and a glossy natural stone tub in which water shimmered promisingly. Thick bubbled floated above it, iridescent under the bright lights. The air smelled sweet and kind of pink. Hal placed Madison onto the bath mat and examined her frame with his eyes.<br>\r\n<br>\r\n“Aren't you ever the growing girl”, he exclaimed.<br>\r\n<br>\r\nHer spandex pants were really tight on her, they wedged into the crack of her slightly bigger butt. Her tank top stretched over her stuffed stomach. Luckily for her, her slight weight gain had made her face look softer and had given it an almost angelic quality so she looked even cuter. Even before, it was next to impossible for Hal to be mad at Madison, but now, he was close to melting under her sweet gaze.<br>\r\n<br>\r\n“My clothes are making me uncomfortable, though”, she said sadly.<br>\r\n<br>\r\nHal was completely blind to her weight gain or the fact that she overate, so he answered: “It's no wonder after a big meal like this. But don't worry, we'll get you out of those and the warm water will make you comfortable again in no time.”<br>\r\n<br>\r\nSo he helped her out of her clothes. She wiggled herself out of her top with his help and looked down at herself. Her belly really looked rounder than usual and both it and her sides spilled over her pants... but those were really tight anyway, she told herself. Hal helped her out of those, too. She placed a hand on her belly and looked up at her father. He just gave her an adoring smile, lifted her up and placed her into the bathtub, where she lumped back and let out a soft moan. It was candy cotton scented bubble bath, her absolute favourite. Hal took a soft sponge, leaned over the tub, gently placed a hand in the small of Madison's back and started rubbing her stuffed belly in big, soothing circles. Her taut stomach groaned and gurgled and she thought it really sounded like a purring cat. She enjoyed the feeling of the big meal sloshing inside her almost as much as this pampering session – which, she thought, she really had deserved for herself after managing to eat such an amount of wonderful foods.<br>\r\n<br>\r\nHer father lovingly massaged her bloated belly like a professional massage therapist, all the while she moaned in ecstasy, rubbing her tummy gingerly herself. From time to time, she burped to let out a bit of pressure.<br>\r\n<br>\r\nAfter a long, soothing massage, Hal announced: “I gotta go now, Maddi. You can relax here for a while and let your tummy settle. I'll come back and dry you.”<br>\r\n<br>\r\n“'kay, Daddy”, Madison purred, feeling completely relaxed.<br>\r\n<br>\r\nHal went into the kitchen. After the massage and more time of relaxation, he was sure Madison would be able – and more than willing – to eat something again. So he started to prepare her favourite...</span></div></div>",
            "created":1427086800,
            "id":1952853,
            "title":"Pampering the belly"
        },
        "1321":{
            "author_id":"ceilidhm",
            "author_name":"BLUEsuedeSHOE",
            "choices":[
                "Hal",
                "Wendy"
            ],
            "content":"<div class=\"\"><div> <span>While Hal was still preparing the lasagna for Madison, Wendy came into the kitchen to check out what was going on.<br>\r\n<br>\r\n“What are you doing, Dad?”, she asked.<br>\r\n<br>\r\n“I'm making a nice, big lasagna. Maddi seemed a bit upset, and it's her favourite, so what's a father gotta do?”, Hal asked gleefully.<br>\r\n<br>\r\n“Ooooh, great!”, Wendy cheered. She had only had a small portion of popcorn at the movies, for she knew she would be too busy feeding Madison to eat anything much herself anyway. Now, too, she would be too preoccupied with feeding her sister than eating a lot herself, but at least that kept her slim. <br>\r\n<br>\r\nShe happily helped Hal to prepare the lasagna. Hal was an awesome cook, for his daughters he was like a five star chef. All the better for them, because ever since their mother wanted a divorce because she was having an affair with a younger and sexier colleague of hers Hal was all the girls had known. He had quite the gut himself and was no health freak at all, and since he was now the general manager of a company that made deep-frozen pizzas, it was obvious what kind of food the girls would mostly be having.<br>\r\n<br>\r\nAs soon as the lasagna was in the oven, Hal asked Wendy: “Why don't you go watch TV again?”<br>\r\n<br>\r\nSo Wendy went and waited for the lasagna to be ready. Hal cleaned up the kitchen and when the lasagna was almost ready, he went back to the bathroom, where his overstuffed daughter sprawled in the bathtub, obviously enjoying herself and the hot water, while she absent-mindedly rubbed her tummy, which now looked much less taut. Still, it was as round as the bubbles surrounding her lovely frame, but of course only because she had overeaten on snacks... or so Hal made himself believe.<br>\r\n<br>\r\n“Is my little princess enjoying herself?”, he asked.<br>\r\n<br>\r\n“Very much so”, Madison answered with a grin.<br>\r\n<br>\r\n“But I know something that would make you enjoy yourself even more?”, he teased affectionately.<br>\r\n<br>\r\n“Nah!”, Madison protested playfully and placed her hands on her slightly squishy hips.<br>\r\n<br>\r\n“Oh yes”, Hal objected.<br>\r\n<br>\r\n“What is it?”, Madison demanded to know.<br>\r\n<br>\r\nHal just smiled at her mischievously for another moment to tease her, then he whispered: “Lasagna.”<br>\r\n<br>\r\n“Lasagna!”, Madison screamed in joy.<br>\r\n<br>\r\n“Except if you're not hungry after all those hot dogs and fries...”, Hal added with an innocent shrug.<br>\r\n<br>\r\n“No way am I not hungry!”, Madison yelled.<br>\r\n<br>\r\nHal laughed and lifted her out of the bathtub. She felt indeed better, her belly less stretched, her breathing less heavy. If was no wonder, after the nice hot bath and the pampering by her father. She let him dry her like she was a little spoiled diva, a new Shirley Temple, luxurious and capricious despite her bare eight years, and did she ever feel lush! When he grabbed her clothes, though, she winced.<br>\r\n<br>\r\n“What's wrong, sweetheart?”, Hal asked consideratly.<br>\r\n<br>\r\n“I just, uhm...”, Madison stammered. “I'd better like to wear one of your tees.”<br>\r\n<br>\r\nHal beamed at her. “Of course you can wear a t-shirt of mine. Wait a moment, Maddi.”<br>\r\n<br>\r\nWhen he came back he had with him an older t-shirt that was slightly small on him when he wore it. It showed a patriotic motif with the American flag and a bald eagle. He helped Madison into it. On her, it was like a wide robe.<br>\r\n<br>\r\n“Okay, you're all nice and dry now. Let's go and eat, shall we?”, Hal asked, picking her up again and carrying her like a baby.<br>\r\n<br>\r\nOf course, Madison didn't have to eat the lasagna by herself. She was fed by...</span></div></div>",
            "created":1427086800,
            "id":1952862,
            "title":"Meal of the gods"
        },
        "13212":{
            "author_id":"marluk",
            "author_name":"Marluk",
            "choices":[
                "The following morning, Madison is woken early by...",
                "A month later, and Maddi's clothing situation is getting critical"
            ],
            "content":"<div class=\"\"><div> <span>As before, Madison was fed by her older sister Wendy. The older girl enjoyed spoiling her little sis almost as much as Hal did, and so Maddi sat happily in Wendy's lap at the dinner table, being fed two forkfuls of lasagne for every one that Wendy ate herself. Despite being only eight years old, Madison was already thoroughly used to habitual overeating; with a father and a sister who both enjoyed treating the young girl like a pampered princess, she typically wound up quite stuffed by the end of every meal – and with Hal’s disinterest in healthy eating, those meals were typically heavy, fatty dishes that were as bad for the waistline as they tasted good.<br>\r\n<br>\r\nAnd this meal was no exception. Though she felt much better now than she had before her bath, Madison’s stomach was really still quite full from her overindulgence earlier in the day, and Wendy was feeding her much more quickly than she would have been eating herself. The lasagne tasted so good though that she didn’t even think of protesting, even as her stomach swelled fuller and rounder beneath her oversized top with every mouthful she swallowed of the rich pasta. <br>\r\n“You’re such a little piggy, Maddi,” Wendy giggled, prodding another heaping forkful of lasagne between her little sister’s waiting lips, “I’m surprised you haven’t grown a little pig tail by now.”<br>\r\nThe teasing was good-natured. Madison enjoyed being doted upon; she was perfectly happy with her sister calling her a piggy if it meant she got to keep being so thoroughly pampered. Swallowing her mouthful, she wriggled her plump backside against her sister’s lap.<br>\r\n“No tail, see!” she giggled loudly, and Hal and Wendy both laughed.<br>\r\n<br>\r\n“No tail, but it looks like the little piggy’s got some sauce on its snout,” Hal smiled, leaning across the table to wipe a little smudge of red from his little princess’s nose, “How’s the lasagne?”<br>\r\n“Great!” Madison replied, “You’re the best cook in the world.” She let Wendy feed her another mouthful as though to prove her point, though beneath her baggy top her belly was beginning to reach its limits once again, bulging roundly with the sheer volume of food stored within.<br>\r\n“Yeah, it really is good, Dad,” Wendy agreed, actually eating a mouthful herself for once. Her habit of feeding Madison before eating herself was likely the only thing that was keeping Wendy from growing as plump as her little sister, as she had quite an appetite herself when she actually got around to indulging.<br>\r\n<br>\r\n“I’m glad to hear it,” he smiled, proud of both his cooking and his delightful little girls. To him, they were flawless; the extra weight his youngest was carrying, as well as the bad habits the whole family shared, were both completely invisible to him. The fact that his eight year old and twelve year old had just polished off enough food to feed two grown adults seemed, to him, perfectly acceptable; after all, he was just making sure his babies were properly fed. And on the note of ‘properly fed’… “So, who’s for dessert? I bought ice cream!” <br>\r\n<br>\r\nMadison hesitated. She was already stuffed, already close to her limit – but before she could say anything Wendy was already nodding yes, and at the sight of the ice cream itself her doubts melted away despite themselves. She had a sweet tooth a mile wide, and so despite her stomach grumbling and groaning beneath her top, she let Wendy take a big spoonful of ice cream straight out of the tub and push it straight into her mouth.<br>\r\nImmediately her fullness was forgotten as the sugary treat passed her lips, and she swallowed eagerly. <br>\r\n“More please!” she pleaded, opening her mouth once again to be fed like a hungry baby bird, and Wendy promptly obliged. Delicious!<br>\r\n<br>\r\nBy the time the meal was over, much of the tub of ice cream was inside Maddi’s little belly, churning away noisily along with a huge portion of lasagne and the food from earlier in the day. The amount she’d managed to eat was legitimately astonishing, but neither Hal nor Wendy saw it as anything but a bit of cute indulgence, natural for a healthy young girl like Madison. As Hal carried Maddi up to her room to sleep off this huge meal, his muscles strained under the burden of his youngest’s plump body.<br>\r\n“You really are growing into a big girl,” he grinned happily, stroking her hair away from her face as he laid her down on her bed. Her belly bulged up before her, the American flag design stretched across her swollen stomach, and Hal patted it gently, “I’m glad you inherited my appetite instead of your mother’s! She was always an unhealthily light eater.”<br>\r\nMadison smiled herself as he tucked her in, delighted enough to be spoiled that she could ignore the way her overstuffed belly twinged as he patted it. He gave her one last kiss on the forehead, then left her room, turning out the light on another overindulgent day in a life that lately seemed to consist of little else.</span></div></div>",
            "created":1559451600,
            "id":2668366,
            "title":"Another Indulgence"
        },
        "14":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Sara",
                "Tori",
                "Dani",
                "Rachel",
                "Amy"
            ],
            "content":"<div class=\"\"><div> <span>Sara<br>\r\n2nd grade<br>\r\nJust quit soccer over the summer and up'd here meals to 10 a day<br>\r\nShort and blond<br>\r\nLoves Mexcan food<br>\r\n<br>\r\nTori<br>\r\n1st grade<br>\r\nHas a sister who is starting to fatten her up<br>\r\nFat arms and brown hair<br>\r\nLikes anything her sister feeds her<br>\r\n<br>\r\nDani<br>\r\nKindergarden<br>\r\nGaining weight because she wants to<br>\r\nNever has a pair of pants that fits her<br>\r\nFat belly<br>\r\nHooked on French food<br>\r\n<br>\r\nRachel<br>\r\n4th grade<br>\r\nJust moved to north amarica<br>\r\nThin but is starting to grow an addiction of fast food<br>\r\n<br>\r\nAmy<br>\r\n5th grade<br>\r\nFind pleasure from reading fantasy WG stories and watching cartoon girls gain weight.<br>\r\nPlumpish belly<br>\r\nLoves pastries</span></div></div>",
            "created":1262149200,
            "id":812928,
            "title":"More girls"
        },
        "141":{
            "choices":[
                "With another burrito",
                "With another burrito and even more food",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Little 7 year old Sara sat at her kitchen table. The little one smiled as her mother brought her yet another big burrito. Mexican was her favorite food and she was more than happy to begin shoving it into her face like the 2 she had had before it. <br>\r\n<br>\r\nAs she messily ate, she placed a hand on her now slightly large belly. The two tasty treats she had before helped to push it out even further. This was quite noticeable as the little one wasn’t a small child. Oh, sure she was slightly shorter than most of the other kids in her grade, but height wasn’t the thing most noticed about the little blonde child. It was her large middle.<br>\r\n<br>\r\nSara had been packing on the pounds for quite some time now, especially since she had quit playing on the local girls’ soccer team. She had loved the game at first, but found it very hard to keep up with children. So her mother pulled her from the team and since then, her belly seemed to grow even rounder. Yes it wasn’t the only place she had put on weight, but it was where the grand majority of it went. So much so, that most would have thought her pregnant if she wasn’t still a child.<br>\r\n<br>\r\nStrange as it might sound to most, Sara actually liked her weight. She thought it made her look cuter and loved packing on the pounds as much as her parents were indifferent to her gaining. So, the little plump kid took every chance she got to eat everything she could, usually in a very rude and messy manor.<br>\r\n<br>\r\nThat was another quirk about little Sara: she had next to no manors, and didn’t mind. She’d piggily ate with her mouth open, got her food all over her face, burped and even worse (after all she did eat a lot of Mexican) if the mood struck her. She was more shy about doing so in front of her friends and such, but when she was at home or alone, and even if she was with strangers she didn’t much care for, she’d make a pig of her self in more ways than just her gluttony.<br>\r\n<br>\r\nShe quickly finished up the third burrito, her face and hands a mess. She didn’t mind though. She was in the mood for being a bit of slob. She licked her lips as she let out a loud belch, her mother’s signal to bring her yet another helping. <br>\r\n<br>\r\nShe looked down at her big belly and pondered whether or not she could eat another whole burrito. She decided she’d better make some room and grinned slyly as she new just the way to do so. She let out another burp and lifted her bulk to one side as she let out a quite fart with a giggle.<br>\r\n<br>\r\nSoon her mother entered…<br>\r\n<br>\r\n</span></div></div>",
            "created":1269320400,
            "id":855721,
            "title":"Sara"
        },
        "1411":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "calls for her mom",
                "eats more thinking it will help",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>\"Here you go\" said Saras mother utting another burrito on her plate<br>\r\n<br>\r\nShe didnt even say thank you before she started devorworing the burrito. She noticed how tight her clothes were and with every bite they got tighter.<br>\r\nFinaly she finished the burrito and also a big glass of whole milk. Then she felt a pain in her stuffed tummy. She started to rub it but it did not help. <br>\r\n<br>\r\nWhat does she do next</span></div></div>",
            "created":1280206800,
            "id":925230,
            "title":"With another burrito"
        },
        "14111":{
            "choices":[
                "Just from the rubbing",
                "After Sara accidentally let out another fart"
            ],
            "content":"<div class=\"\"><div> <span>Sara looked down at her big tummy a little worried. She might have over eaten a bit here. It wasn’t something that happened to the fat-bellied child often as she was able to eat a LOT of food, but she had packed away more than she was used to. Not only that, but she did have a nice big snack before dinner. However, part of her still felt hungry.<br>\r\n<br>\r\nShe was so confused by this sensation that she decided to call in someone who she hoped would have a bit more knowledge about it.<br>\r\n<br>\r\n“Mooommmmy!!!” She cried out in a slightly painful whine.<br>\r\n<br>\r\nIt didn’t take very long for her mother to come rushing over to aid her stuffed 7 year old girl. She bent down so she was eye level with the sitting child and asked,<br>\r\n<br>\r\n“What’s wrong sweetie?” she said in a loving tone.<br>\r\n<br>\r\n“My tummy hurts.” Sara replied as she lifted up her shirt and exposed her bare belly to her mother.<br>\r\n<br>\r\nIt was an impressive dome indeed. The large creamy white ball of blubber stuck out almost a good 10 inches from the child and looked very hard and stuffed from all the food she had just eaten. It even moved about slightly as Sara breathed in and out.<br>\r\n<br>\r\n“Awww…want mommy to rub your tummy?” She asked caringly.<br>\r\n<br>\r\nSara nodded and pushed her belly out even more. She grinned happily as her mother rubbed her big belly with skillful hands. Sara loved having her fat tummy rubbed and it felt so good at now. In fact, it was so nice that the pressure in her belly was soon relieved…<br>\r\n<br>\r\n</span></div></div>",
            "created":1280811600,
            "id":929556,
            "title":"calls for her mom"
        },
        "141111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "thay were out of food",
                "they had 3 whole cheese cakes"
            ],
            "content":"<div class=\"\"><div> <span>By the rubbing. Now the pain started to get less and the hunger became bigger. However she was worried that if she ate more her belly would start hurting again. Then it came to her, Her mom rubbing her tummy made here belly stop hurting so if she rubbes her belly while she eats then it should not start huring at all.<br>\r\n<br>\r\n\"Mom, can I have some more food\" sked Sara<br>\r\n<br>\r\n\"Of course\" said her mom patting her gorged daughters very big belly<br>\r\n<br>\r\n\"And can you also rub my tummy while I eat\"<br>\r\n<br>\r\n\"I dont see why not\" said Her mother going into the fridge but found...</span></div></div>",
            "created":1280898000,
            "id":929903,
            "title":"Just from the rubbing"
        },
        "1411112":{
            "choices":[
                "Feed her daughter more while rubbing her tummy",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Sara grinned as she watched her mother go off to get her more food. She was so happy to be able to eat so much and get so big. She loved being fatter and loved stuffing her face and was about to get fed even more food. The fat little girl was thrilled by this.<br>\r\n<br>\r\nShe looked down at her gut and grinned even more. It might have hurt a bit to be stuffed with so much Mexican food, but it was worth it. She could see just how big and round her belly was now. The pale dome looked pretty stuffed, but also retained a bit of its softness. It was still quite large though, almost reaching to the 7 year old's knees. She was so proud of what she had accomplished and couldn’t wait for her mother to return with even more belly-growing food.<br>\r\n<br>\r\nHer mother on the other hand wasn’t having such a happy time though. Her big tummied little daughter had practically eaten everything in the house. All that was left were a few drinks and sauces. The only thing that was really solid food was 3 cheese cakes she had made for the upcoming school bake sale and didn’t really want to dip into this supply.<br>\r\n<br>\r\nOn the other hand her daughter was still hungry. She also knew how her daughter got when she began to binge, since she binged quite a bit.  The poor woman knew the round little one wasn’t going to take the news of no more food well at all. She probably would keep pestering her all night for something more to eat and she knew the overweight little girl wouldn’t let up until her ever-hungry tummy was filled with something.<br>\r\n<br>\r\nThe mother could only sigh and grab one of the set aside cakes and return to her daughter. She could only hope one cake would be enough to satisfy her.<br>\r\n</span></div></div>",
            "created":1282021200,
            "id":937966,
            "title":"they had 3 whole cheese cakes"
        },
        "14111121":{
            "author_id":"bellyinflater2",
            "author_name":"bellyinflater",
            "choices":[
                "Next day",
                "Next week"
            ],
            "content":"<div class=\"\"><div> <span>Sara started to eat the cake while her mother rubbed her belly. She liked the feel of her mothers rubbing as she ate the cake. It took 30 minutes for Sara to eat 1/4 of the cake. She was then to full to eat the rest. Then Sara got up from here chair and walked over to the couch and laid down. She then fell asleep and her mother went out to get more food.<br>\r\n<br>\r\n2 hours after Sara fell asleep her mother came back with the groceries. She stocked up the frig and went to the living room. Then Sara woke up.<br>\r\n<br>\r\n\"Are you hungry sweety?\" asked Saras mom.<br>\r\n<br>\r\n\"Yes mommy.\" Sara said.</span></div></div>",
            "created":1309842000,
            "id":1141239,
            "title":"Feed her daughter more while rubbing her tummy"
        },
        "141111211":{
            "choices":[
                "Her mother was making a large breakfast for her",
                "She was the first one and had to find her own breakfast"
            ],
            "content":"<div class=\"\"><div> <span>After Sara had awoken she gorged even more, much to her mother’s chagrin. Sure the woman didn’t care how big her daughter got, but feeding her plump 7 year old was getting to be more and more of chore.<br>\r\n<br>\r\nHowever, Sara loved it! She got to fill her now empty belly up again with delicious food. She was so glad her mom had gone shopping and made sure to eat as much of her mommy’s latest offerings, wanting to get her belly as full and round as possible.<br>\r\n<br>\r\nShe had done quite a good job too. By bed time, the fat 7 year old was rewarded with a belly that rested just past her knees. It was pretty tight from her stuffing, but was able to slosh around nicely and she was able to enjoy this effect as she laid in bed and played a bit with her added pounds through her too small pjs. The sight of such a beautiful dome of little girl fat was the perfect sight for her to see as she drifted off to sleep.<br>\r\n<br>\r\nNow, it was morning and Sara had gotten out of bed, as hungry as ever. The fat blond little girl noticed her belly had gone down since last night, but was still bigger than before she started her binging.<br>\r\n<br>\r\nShe grinned and gave her tummy a nice, gentle, slap and watched the rubber-like fat bounce at her touch. Yep, she was definitely ready to go and pig out at breakfast.<br>\r\n<br>\r\nShe quickly got dressed and headed downstairs to find…<br>\r\n<br>\r\n</span></div></div>",
            "created":1310446800,
            "id":1146566,
            "title":"Next day"
        },
        "1411112111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Bath time with Sarah",
                "There's, sooo much Syrup!"
            ],
            "content":"<div class=\"\"><div> <span>Sarah arrived in the kitchen to see a table full of towering stacks of pancakes, each almost as tall as she was, and dripping with thick syrup. Her mother was standing beside a strange machine that she had never seen before.<br>\r\n<br>\r\n\"What's that mommy?\"<br>\r\n<br>\r\nStartled by her daughters sudden appearance she turned around.<br>\r\n<br>\r\n\"Oh, this is a new machine I won in a contest to help me make food for you.\"<br>\r\n<br>\r\nSarah bounded on the balls of her feet in excitement causing the cupboards to rattle and her belly to jiggle violently, but then she stopped as she realized something.<br>\r\n<br>\r\n\"Was I that much work to feed?\" she asked quietly?<br>\r\n<br>\r\nHer mother sighed. \"Well you do eat a lot Sarah, that's why I'm glad I got this machine...\"<br>\r\n<br>\r\nHer mother's voice trailed off as she was having difficulty deciding what to say, while in Sarah's mind things were different.<br>\r\n<br>\r\nShe realized that her appetite would have eventually outstripped her mother's ability to feed her, and horrifying images of her making a pig of herself while her mother slaved away and starved made her tremble. The images made her seem like the wicked stepmother from Cinderella.<br>\r\n<br>\r\nShe put one hand on her bulbous gut and looked back up at her mother.<br>\r\n<br>\r\n\"Did you eat Mommy?\"<br>\r\n<br>\r\nHer mother blinked and then replied. \"Yes, I ate before I started making your breakfast.\"<br>\r\n<br>\r\n\"Okay then. From now on for Breakfast Lunch, and Dinner, you have to eat before me. That way you always get food.\"<br>\r\n<br>\r\nHer mother looked puzzled for a moment and then she realized what her daughter was trying to do. She leaned down and gave Sarah a playful kiss on the cheek.<br>\r\n<br>\r\n\"Okay Sarah, I promise. Now go eat before your pancakes get cold.\"<br>\r\n<br>\r\nSarah didn't need to be told twice. She waddled over to the chair and with a bit of a struggled climbed on top of it. She needed to stand on the chair in order to reach the top of the immense tower of pancakes. She looked down and realized she would have to be careful because her belly was nearly touching the tower and if she wasn't careful she would end up knocking it over.<br>\r\n<br>\r\n<br>\r\n\"Thanks for the food mom!\" she called out and then grabbed the top four pancakes and brought them to her waiting mouth.<br>\r\n<br>\r\nSyrup dripped from her mouth and the pancakes onto her shirt and the uncovered top of her belly. She giggled as she felt the sticky substance slowly slide off her belly onto the floor.<br>\r\n<br>\r\nShe gobbled down the pancakes in her hands in a shameless barbaric display of eating habits that her mother had gotten used to by now. Sarah continued down the stack until she had to sit down, or risk falling over from the weight of her belly. She resumed eating the stack, finding it a bit difficult to reach but still manageable until she had finished every pancake on the plate, and then she licked the plate clean of syrup. Then she used her hands and tongue to clean herself of syrup, her belly which now reached just past her knees was thick with syrup.<br>\r\n<br>\r\nSarah patted her belly in satisfaction and then looked up at all the uneaten stacks of pancakes still standing on the table, like the skyscrapers of a large city.<br>\r\n<br>\r\nGrinning she stood up, her belly bumping the table as she did so and then stepped onto the table itself so she could reach the remaining stacks. Standing among the stacks she felt like a giantess, a Godzilla, ready to devour the city of pancakes. She giggled at the though and made playful roaring sounds before resuming her breakfast.<br>\r\n<br>\r\nBecause her belly now stuck out as far as her arms could reach she was forced to approach the stacks at an angle, but she compensated by standing in between two stacks and eating two at once.<br>\r\n<br>\r\nShe rapidly devoured both stacks, feeling her belly swell bigger and bigger.<br>\r\n<br>\r\nWhen finished those stacks she was sitting on the table, her belly almost at her ankles and it was so big she almost couldn't see in front of her.<br>\r\n<br>\r\n<b>Bbbuuuuuuuuuuuuuuuuuurrrrrrrrrrrrrrrrrrrppppppppp</b><br>\r\n<br>\r\nShe felt better after a good belch and she got to her feet with surprising ease and resumed.<br>\r\n<br>\r\nHer mother watched in awe as her daughters belly seemed to defy gravity as Sarah devoured the stacks of pancakes with great zeal and her belly only got bigger and rounder without hanging much lower than it did before. Even though her belly stuck out almost at her feet when she was sitting; when she was standing her belly button was at the same height as her pelvis.<br>\r\n<br>\r\nNow finishing the final stack, Sarah was forced to sit with her legs spread in order to accommodate her immense gut which now reached past her feet as she gobbled up the last few pancaked from the plate in her hands. <br>\r\n<br>\r\nThe unsung hero of all this was the table which had somehow been able to support her without collapsing. She would have to give Sarah her meals on the floor from now on, and if things continued, the basement.<br>\r\n<br>\r\nSarah smacked her lips, finally finished her breakfast. She stood up and then carefully climbed down from the table onto the chair and then the floor.<br>\r\n<br>\r\nFrom straight on, Sarah's mother could see just how wide her gut was too. It was twice as wide as Sarah's still fairly petite frame, and Sarah had to physically carry her belly in her hands to keep it from sloshing about too much.<br>\r\n<br>\r\nSarah walked up to her, her entire body, but especially her face and belly were dripping with syrup.<br>\r\n<br>\r\n\"I'm full now\", Sarah said happily. \"Thanks again for all the food.\" She patted her taught belly for emphasis. \"I loved it\".<br>\r\n<br>\r\n\"Go into the tub and clean yourself off\", her mother told her.<br>\r\n<br>\r\n\"Okay.\"<br>\r\n<br>\r\nMeanwhile her mother would have to clean everything up.</span></div></div>",
            "created":1371704400,
            "id":1614100,
            "title":"Benevolent Godzilla Daughter"
        },
        "14111121111":{
            "choices":[
                "Mom cooked her a nice big breakfast",
                "They are going out to eat"
            ],
            "content":"<div class=\"\"><div> <span>Sara slowly hauled her massive frame up to the tub. It was quite a feat given how large she had grown from this single feast. Her belly actually hung on the floor and had to be lifted up a step higher than she was as she braved the staircase. However, the obese 7 year old managed to do this with great ease. Her tummy didn't feel all that heavy at all!<br>\r\n<br>\r\nSoon she was in the bathroom drawing herself a nice big hot bath. She grinned as she looked down at her big tummy. She still had her pyjama shirt and pants on, but one couldn't really tell. You see, her tummy was so big it pretty well covered the front of her so all that was visible was her head and arms. The massive, syrup covered, dome quaked and jiggled at the slightest movement the little girl made and a smile of delight appeared on her face at this. She LOVED being this fat!<br>\r\n<br>\r\n\"Sara! Time to get up!\" Her mother yelled up the stairs to her room.<br>\r\n<br>\r\nThe tubby 7 year old sat straight up, her tummy bulging through the covers in her bed as she did so. She was confused for a moment, her belly was now smaller than it was when she went to sleep the night before and her bed, while comfy, wasn't exactly the warm bath she was ready to plop into.<br>\r\n<br>\r\nIt was all a dream. She hadn't actually woken up or had the massive feast. That realization hit her with sadness, although not excessive shock. She realized eating that much in one sitting, even for her, was impossible. However, the tubby kid liked the idea of stuffing herself to truly massive proportions. She already liked being fat but, this dream had not only worked up her appetite, but gave her further motivation to gain more.<br>\r\n<br>\r\nWith a sly, determined, grin on her face, Sara jumped out of bed, causing the floor to creak from her big belly which jiggled and sloshed from the movement. She was defiantly ready for breakfast this morning!<br>\r\n</span></div></div>",
            "created":1373259600,
            "id":1625020,
            "title":"Bath time with Sarah"
        },
        "142":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Watch T.V",
                "The computer",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Tori. Open wide.\"<br>\r\n<br>\r\nTori did like she was told and opened her mouth wide so her sister could stuff another spoonful of ice cream in her mouth. Tori happy swallowed it.<br>\r\nTerri (her sister) smiled while she pushed another spoonful of ice cream in her sisters mouth. She liked feeding her sister. Not that Tori could't eat herself but she liked it to be fed. Then she did't have to use her fat arms.<br>\r\n<br>\r\n\"Here comes another one.\" Terri said.<br>\r\n<br>\r\nTori opened her mouth again and thought about how this all started. About two weeks ago. She was watching T.V and said to her sister she was hungry. Her sister lately seemed to act a bit strange around her when she talked about food and eating. She continued to watch T.V but suddenly her sister came from the kitchen with some snacks. Pretzels, cookies, candy and ice cream. Terri fed it all to her. She did't knew why but she liked it. Terri stuffed her so much she felt like a stuffed pig or Christmas turkey. She liked it to feel like that. She told Terri that and her sister did it again the next day and the day after that and after that one too until now.<br>\r\nTerri also thought about it. She always liked fat girls. when she was in kindergarten she always hang out with the fat girls. While she herself was pretty thin. But she liked other girls too be fat. She did't knew why she just knew she wanted that. She always looked at other fat girls from school and never thought about her little sister at home that seemed to have a big appetite. But the last weeks she started thinking about that. When her sister once said that she was hungry she fed her a lot of food and she ate it all and she liked it too. If she and her sister both liked it there was no use in ruining their fun she thought.<br>\r\n<br>\r\n\"All right Tori the last bite.\" Terri pushed the last spoonful in her sister's mouth. <br>\r\n<br>\r\nTori laid back an let out a belch.<br>\r\n<br>\r\n\"Oh i feel so stuffed.\"<br>\r\n<br>\r\nTerri started to rub her sisters belly. Touching her sister's belly was the most fun thing too do for her. In the beginning there was just a small layer of fat but soon her sister started to gain and became pretty chubby and now she was on the way from chubby too fat.<br>\r\nLucky their parents did't paid much attention too what they were doing. Her mother once saw it and said she thought it was sweet she was feeding her little sister.<br>\r\n<br>\r\n\"Come on sis. Let's go watch some T.V.\"<br>\r\n<br>\r\nTerri always tried to let Tori besides eat watch T.V or listening too stories or music or reading as long if she did't burned too much calories while doing it.<br>\r\nTori yawned and did't notice all the weight she gained the past time. Her whole body fattened up but mostly her fat arms that were slowly turning into rolls that were swallowing up her under arms.<br>\r\nTerri smiled with every roll she saw.<br>\r\n</span></div></div>",
            "created":1265086800,
            "id":829483,
            "title":"Tori and Terri"
        },
        "1421":{
            "choices":[
                "A new resturaunt",
                "A new food",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The saw an advertisement. What was it for?</span></div></span></div>",
            "created":1282798800,
            "id":944783,
            "title":"Watch T.V"
        },
        "1423":{
            "author_id":"iamsoawsome",
            "author_name":"Doomz",
            "choices":[
                "They eat the cookies",
                "They DON'T eat the cookies (I dunno, it could happen)",
                "They...something something...cookie"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go skydiving!\" Terri beamed as Tori's mouth dropped open.<br>\r\n<br>\r\n\"Wha-mmph!\" Tori muffled as Terri pushed a doughnut in her stomach. Tori clutched her belly fat in horror as the jelly-filled treat vanished into her already painfully full stomach. Terri stifled a chuckle as Tori flopped on the couch, rubbing her belly causing it to jiggle and glob frantically.<br>\r\n<br>\r\n\"Psych! Just kidding! What we're actually going to do is get some cookies!\"<br>\r\n<br>\r\nAnd so they got some cookies and then...</span></div></div>",
            "created":1274418000,
            "id":887006,
            "title":"Something much else"
        },
        "14231":{
            "choices":[
                "Tori takes a nap",
                "There mom comes in and tells them they are going to an all you can eat buffet "
            ],
            "content":"<div class=\"\"><div> <span>she gets Tori to lay down on the couch and feeds her a box of two dozen cookies. Tori's already stuffed tummy got a little bigger with every cookie. after painfull and happily finishing the cookies Her sister rubbed her now huge belly. Im so stuffed but those cookies made me thirsty. Can you get me some cola? sure,said her sister. She brought back a 2 litler cola. I did not mean i was that thirsty. Oppen up,said her sister and put the top in the cola bottle in Tori's mouth.She had no choice but to drink. after 15 min she had finished ll of it. oww,my tummy hurts. Tori's sister rubbed her belly some more till it felt better. after that..</span></div></div>",
            "created":1275973200,
            "id":896318,
            "title":"They eat the cookies"
        },
        "142311":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Tori wakes up",
                "Terri finds something intresting on the net"
            ],
            "content":"<div class=\"\"><div> <span>Tori slowly closed her eyes and fell asleep.<br>\r\n<br>\r\n\"Ah that's good little sis. Fall asleep. Then can all that food you consumed be turned into beautiful fat.\"<br>\r\n<br>\r\nShe liked her sisters flab and wanted to make her so much fatter.<br>\r\nShe then stood up and cleaned up all the things she used to stuff her sister. She really got a big appetite lately. She was planning too use that by fattening her up for her own pleasure. She liked fat girls and her sister was fed. Something she liked. It was a win-win situation.<br>\r\nWhen she would become a mother she was also planning to raise her kids too be fat. Then she would have fat bellies around here. She loved the idea.<br>\r\n<br>\r\n\"Hm-mmm!\" Tori mumbled in her sleep.<br>\r\n<br>\r\nTerri stopped what she was doing listening too her sister. But Tori stopped mumbling.<br>\r\nShe cleaned the latest stuff. Then she heard the front door. Her mother came in.<br>\r\n<br>\r\n\"Ssssssh!\" Terri said and pointed at Tori. \"She's sleeping.\"<br>\r\n<br>\r\n\"Ah. She's so sweet when she's sleeping.\" Their mother whispered.<br>\r\n<br>\r\nTerri pushed her out of the room.<br>\r\n<br>\r\n\"Yeah she's really sweet and we need to go so we don't disturb her.\" She softly closed the door behind them.<br>\r\n<br>\r\nTerri decided to go up to her room she shared with her sister. Her mother followed her.<br>\r\n<br>\r\n\"Eh Terri do you have a minute? I have a question for you.\" their mother asked.<br>\r\n<br>\r\n\"Oh eh sure. What is it?\"<br>\r\n<br>\r\n\"Well it could be me and maybe i'm just not seeing it right but does Tori look maybe just a bit fatter. Also her arms look a lot flabbier.\"<br>\r\n<br>\r\n\"Really? Did't really noticed. I think your just seeing things mom. She looks fine.\" Terri said and went sitting on her bed.  <br>\r\n <br>\r\n\"Well maybe i just worry a bit too much.\"<br>\r\n<br>\r\nThe door suddenly was pushed open by Tari. The older sister of Tori and Terri. She was a sixteen with black shiny hair too her shoulders and a slender body she did't mind too show. She wore normally very short skirt and shirts that showed a lot of her cleavage. Sometimes she even only wore a bra. Well at school she wore normal clothing since she knew the teachers would't like it. <br>\r\nTheir mother was't too happy her oldest daughter dressed like a whore<br>\r\n<br>\r\nTerri sometimes had a little trouble their names looked so much alike. All started with a T and ended on ri. The only difference was the second letter of their name and that she ad an extra r. Their grandmother gave them their names. Since they were sisters she wanted their names too match.<br>\r\n<br>\r\n\"Mom can i have some money? I want too buy some clothes.\" Tari asked.<br>\r\n<br>\r\n\"Oh Tari tell me you're not going out like this.\"<br>\r\n<br>\r\nShe looked at the skirt that barely came to her thighs and  a shirt that was so short it only covered her boobs.<br>\r\n<br>\r\n\"Mom this just is what girls were. Don't make such a big deal about it!\"<br>\r\n<br>\r\nTerri looked at her sister. She knew that her father decided that if she wanted to look like a whore she had too decide that for herself even if he was't too happy about it. When he was a teenager he also had problems with his parents about his clothes, music and all other stuff and he promised himself that his kids could were and listen what they wanted. A promise he now regret. Even while he only made the promise too himself he still felt he needed to keep it.   <br>\r\n<br>\r\n\"I don't think all girls were this.\" <br>\r\n<br>\r\n\"So what if the're not. It's my life, and my body and my body looks good. I mean if you have a body that's  gorgeous why won't you show it. I think i look gorgeous. Now can i have some money?\"<br>\r\n<br>\r\n\"I just gave you money yesterday.\"<br>\r\n<br>\r\n\"That's gone. Can i have some money now?\"<br>\r\n<br>\r\nHer mother sighed and gave Tari some money and without even saying thank you she walked out. Good thing their parents were rich. Tari must use about over $100 each week.<br>\r\n<br>\r\n\"Hee mom. If i'm sixteen do i get just a much money?\"<br>\r\n<br>\r\nHer mother looked at her. She did't wanted another kid from time too time give that much money but at the other hand she gave it Tari so it would be unfair too Terri and Tori.<br>\r\n<br>\r\n\"Eh...  We'll see.\" She said and left the room.<br>\r\n<br>\r\nTerri started her computer <br>\r\n     </span></div></div>",
            "created":1276059600,
            "id":896907,
            "title":"Tari"
        },
        "142312":{
            "author_id":"thekeybearer",
            "author_name":"Kingdom Hearts fan",
            "choices":[
                "At the Golden Corral "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey kids get in the car we are going to golden Corral. Tori looks. at her mom, then her stomach and she groaned but her mom put her in the car. Terri got a huge grin on her face. Tori was worried. </span></div></span></div>",
            "created":1347858000,
            "id":1429856,
            "title":"There mom comes in and tells them they are goin..."
        },
        "1423121":{
            "author_id":"thekeybearer",
            "author_name":"Kingdom Hearts fan",
            "choices":[
                "Tori is surprised when she is the 1000 person to walk in ",
                "Tori eats until she can't eat anymore "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While at the Golden Corral Terri was stuffing Tori with french toast and tori was wondering if she could handle eating more food at Golden Corral when they get there</span></div></span></div>",
            "created":1348290000,
            "id":1433015,
            "title":"At the Golden Corral "
        },
        "14231211":{
            "author_id":"redthunder132",
            "author_name":"RedThunder132",
            "choices":[
                "Saw that Tori was in discomfort and unhooked the machine.",
                "Had gotten the staff to bring all of the food in the buffet to Tori. "
            ],
            "content":"<div class=\"\"><div> <span>As the 1000th person to walk in Tori won a food pump/grinder grinding any food you put into it into paste and through the pump and into the persons mouth. With this exciting news Teri quickly sat Tori down and strapped the funnel to her mouth. She then ran to the buffet taking a platter and pilling it full of chicken strips and another with mac &amp; cheese. With her hands full she ran back to the machine and poured all of the chicken into the grinder. With the grinder making short work of the chicken it poured into Tori's already full stomach and slowly extended her stomach. After 2 minutes the chicken was stuffed into the child's belly. Tori wanting to take the funnel out was unable to because her arms were so fat and she was so fatigued she was unable to reach it. While Teri was pouring the mac &amp; cheese their mother...</span></div></div>",
            "created":1483765200,
            "id":2260223,
            "title":"Tori is surprised when she is the 1000 person t..."
        },
        "142312112":{
            "choices":[
                "Stopped by a Bakery for Dessert.",
                "Stopped by a Pool to swim."
            ],
            "content":"<div class=\"\"><div> <span>Their mother convinced the staff to begin feeding her daughter, pouring in all the food they could into the grinder. This caused Tori to grow three times as fast, now the size of the worlds most jiggly beach ball. Tori wished it would end, but it didn't seem like it would, as they now were bringing in food from the back just to keep the young girl fed and \"Happy\".<br>\r\n<br>\r\nHours passed when finally Tori had consumed all the food in the restaurant and she was half as large as her Mother in weight.. Tori could barely stand under her own weight, but her mother helped her up.<br>\r\nAfter much struggle fitting Tori through the door, the Family went into the car for home, and on the way home they all...</span></div></div>",
            "created":1487048400,
            "id":2277706,
            "title":"More and More"
        },
        "1423121122":{
            "author_id":"sphysic",
            "author_name":"Sphys",
            "choices":[
                "They were seen.",
                "They weren’t noticed."
            ],
            "content":"<div class=\"\"><div> <span>As they were on the way back to the house, their mother (Sharon) remembered that they had the swimwear packed in the car, wondering whether or not to go she asks the kids, “Do you kids what to go for a swim, I have our swimsuits packed but I’m a little worried that Tori’s won’t fit anymore after the meal she had.” Tari looks over at her sister to try to see just how much she’d grown, “She should fit mom, but maybe we’ll get lucky and be the only ones there today anyway, so it wouldn't matter.” When they got to the pool, they saw that they actually were the only ones there. “Well, it is a bit chilly, not many people being here is understandable,” Sharon said, “OK, we’ll try to get Tori in her swimsuit but if we can’t, well we’re alone.” After managing to get Tori into the changing rooms they try to pull, stretch and force the material of her swimsuit around her malleable body, which if you at all understand how malleable fat is you’ll understand just how improbable the notion of fitting was. Eventually, Sharon, with the help of Tari, managed to fit her heavy daughter’s feet and ankles through the leg holes, but they couldn’t manage to pull the suit up past that. Understandably they gave up after awhile, since as they were alone they didn’t really need the swimsuit for Tori. Caving in, Sharon told them, “Nevermind, we’re alone so it doesn’t really matter whether we have a swimsuit on or not, let’s just get to swimming.” After that was said, they managed to somewhat easily get the swimsuit back off of Tori’s fat calves and went out to swim in the pool, or they would have if it wasn’t moderately full of people, one thing I forgot to mention about the changing rooms is that they were either family, like the one they used, or private for only one swimmer. Though the other customers didn’t make terribly much noise, they were still quiet enough for Sharon and Tari not to notice when their full attention was focused on getting Tori’s swimsuit to fit. Are they noticed or can they manage to get back to the changing room without being seen?<br>\r\n</span></div></div>",
            "created":1524027600,
            "id":2481367,
            "title":"The little whale."
        },
        "14231212":{
            "author_id":"kingotderps",
            "author_name":"Derp",
            "choices":[
                "They go home to weigh Tori",
                "Terri shoves more food back into Tori"
            ],
            "content":"<div class=\"\"><div> <span>Tori sits down at a booth. She has to squeeze her gut in. \"Hehe... this is a bit tight,\" Tori chuckles. <br>\r\n<br>\r\nTerri replies with, \"Don't worry Sis, I'll get your food.\"<br>\r\n<br>\r\n15 minutes later, Terri comes back with a large stack of food. \"Doesn't this look good,\" she says. \"Kinda, but isn't it too much,\" Tori says worried. Terri replies with, \"Eh, I'll help you eat it all, plus that's not it. You'll get more.\" <br>\r\n<br>\r\nTerri sits besides Tori and starts shoveling food down her throat. Tori's stomach slowly expanding. Her fat starts poking out the bottom of her shirt. <br>\r\n<br>\r\nTori sighs in relief when she sees all the food on the plate gone. Then Terri puts another large plate of food in front of Tori.<br>\r\n<br>\r\nAfter 20 minutes. Tori's stomach won't even fit into her shirt fully. She stands up to she her shirt only passes her belly button.  Terri comes back and shouts, \"Sit back down! I just brought your 13th plate of food.\" Tori squeezes back into the booth.<br>\r\n<br>\r\nAnother 30 minutes pass and Tori just finished her 19th plate. \"I'm done!!!\" she cries. Her shirt a centimeter above her belly button. Terri smiles looking at her gut. </span></div></div>",
            "created":1574571600,
            "id":2751263,
            "title":"Tori eats until she can't eat anymore "
        },
        "142312121":{
            "author_id":"kingotderps",
            "author_name":"Derp",
            "choices":[
                "Tori takes a nap and sleeps peacefully",
                "Tori takes a nap and Terri stuffs her in her sleep."
            ],
            "content":"<div class=\"\"><div> <span>Tori slowly steps onto the scale. Terri reads the scale. 149.9 pounds she reads. \"hang on, \" Terri says. Terri runs away. Tori confused. Terri comes back with a slice of cake and shoves it down Tori's throat. The scale moves to 150 pounds exactly.<br>\r\n<br>\r\nTerri smiles, \"How does it feel to be a 150 pound 1st grader.\" <br>\r\n<br>\r\n\"My stomach hurts,\" Tori whines. </span></div></div>",
            "created":1574571600,
            "id":2751265,
            "title":"They go home to weigh Tori"
        },
        "1423121212":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Tori woke up!",
                "It actually worked?"
            ],
            "content":"<div class=\"\"><div> <span>Stil groaning from how full she was after dinner, Tori waddled herself to bed. <br>\r\nAll the fattening foods had left her sleepy and before too long she was out cold.<br>\r\nIt had only been a few hours into the night when Terri had a wicked idea.<br>\r\nWhat if she could feed her sister while she slept?<br>\r\nWith a snide grin, she sprung into action. Quietly as she could to create something<br>\r\nto aide in her goal. It didn't take much really. She found some extra tubing that was a <br>\r\ndecently wide-gauge they had leftover from the old fish tank. With a little bit of duct tape<br>\r\nand a funnel from the kitchen, she had done it.<br>\r\n<br>\r\nNext, was to figure out what to feed her not so little, little sister.<br>\r\nShe poured through the cupboards. Pulling out anything remotely fattening she could find.<br>\r\nSweetened Condensed Milk, Brownie Mix was followed by ice cream, heavy cream, and butter from the fridge. <br>\r\nAs quiet as she could she blended them all up into the shake and tiptoed to Tori's room.<br>\r\nThere she was, laying on her back and cuddling a giant stuffed cupcake plushie, and in a deep sleep.<br>\r\n<br>\r\nCreeping closer, Terri set down the pitcher of shake on the night table. Greased up the end of<br>\r\nthe tube with a bit of the leftover butter and leaned in. Slowly, she feeding it down her sister's throat only to find that...<br>\r\n</span></div></div>",
            "created":1576219860,
            "id":2758994,
            "title":"Tori takes a nap and Terri stuffs her in her sl..."
        },
        "14231212122":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Tori wakes up feeling sick.",
                "Tori wakes up oblivious."
            ],
            "content":"<div class=\"\"><div> <span>Terri was shocked. Tori didn't even flinch as the tube slid down her throat.<br>\r\nWith the tube now placed so her sister wouldn't choke,  Terri began to pour<br>\r\nthe shake into the funnel. Slowly at first, but soon filling the funnel until it drained away.<br>\r\nAfter about 20 minutes the entire half-gallon of the shake was resting in Tori's bulging tummy.<br>\r\n\"Hehehe, sweet dreams Lil' sis.\" Terri smiled, patting the girl's tummy before seeing herself out and<br>\r\ngoing to bed herself. As she drifted off she wondered how the next morning would go.</span></div></div>",
            "created":1576220700,
            "id":2758998,
            "title":"It actually worked?"
        },
        "142312121222":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Why not? She seemed to not care.",
                "Better not risk it, she could gain to quickly."
            ],
            "content":"<div class=\"\"><div> <span>A little sluggish Tori woke up the next morning feeling different. She didn't know<br>\r\nhow or why just different. Still in her pajamas, belly poking over the waistband<br>\r\nof her straining cotton shorts, she wobbled her way to the kitchen.<br>\r\nTerri was already there, just finishing up a lavish breakfast for the little girl.<br>\r\n\"Good morning sleepy head.\" she chirped, wondering if her sister knew<br>\r\nwhat had happened. <br>\r\n<br>\r\nTori only plopped herself at the table and began chowing down on the large<br>\r\nstack of pancakes already placed there. \"I had a funny dream.\"<br>\r\nShe finally said, breaking the sounds of her chewing.<br>\r\nHer older sister played along, as she brought over two more plates.<br>\r\nOne piled high with sausage and bacon, the other with scrambled eggs, loaded with cheese.<br>\r\n\"What kinda dream Sis?\" She prodded.<br>\r\nTori shoved a slice of the bacon in her mouth before answering<br>\r\n\"I dreamed I was a balloon!\" She paused for a mouthful of eggs.<br>\r\n\"and I was being filled up for a party!\" <br>\r\nTerri laughed. She guessed Tori really didn't have a clue what had happened last night.<br>\r\nTori kept talking about her dream as she kept eating her huge breakfast.<br>\r\n<br>\r\nTerri noticed it took a lot longer for her to have to start forcing her little sister to keep eating.<br>\r\nShe nodded and smiled like she was still listening to the girl as her own mind tried to understand the change.<br>\r\nAll she could come up with was that maybe the shake stuffing had expanded her sister's stomach. Giving<br>\r\nher more room to eat comfortably. Either way, she didn't really care. She was just happy to see her obese little sister<br>\r\neating so much.<br>\r\n<br>\r\nThe rest of the day passed as normal. Tori ate three more just as large meals with snacks in between and one final big<br>\r\nsnack of two boxes of snack cakes before getting her bath and going to bed. Terri wasn't sure if it was just her imagination<br>\r\nor not, but Tori's tummy seemed to hang a little lower and her face looked rounder. Maybe those extra overnight calories were<br>\r\nalready affecting the little girl.<br>\r\n<br>\r\nAfter Tori went to bed, Terri sat and wondered if she should try and feed her sister overnight again.</span></div></div>",
            "created":1576222140,
            "id":2759003,
            "title":"Tori wakes up oblivious."
        },
        "1423121212221":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "The next morning...",
                "A month of nightly feedings later..."
            ],
            "content":"<div class=\"\"><div> <span>It wasn't really a question. Terri wanted her little sister to be fatter and this seemed like the best<br>\r\nway to do it. So just as the night before she made the shake and snuck in. And again just like the<br>\r\nnight before Tori didn't even stir when she slid the tube down her throat. She couldn't believe it<br>\r\nwas working so well. <br>\r\n<br>\r\nThe next morning Tori woke up again going on about a weird dream as she ate her breakfast.<br>\r\nThis time though she was slurping up a really long noodle. Terri laughed and coaxed her through<br>\r\nfinishing up the massive meal. <br>\r\n<br>\r\nAnother day of overeating went by and this time Terri was sure her sister was bigger than the<br>\r\nnight they had weighed her last. Sure enough her suspicions were right. After giving Tori her bath she<br>\r\nhad her get on the scale again. Only to find she was up to 157 pounds. The little girl had gained a few pounds<br>\r\nin just two days. Tori didn't seem to care, but Terri was excited. She put her little sister to bed and got to<br>\r\nwork on preparing for that night's feeding. She tried to add more to it, making it more fattening. <br>\r\n<br>\r\nAfter about two hours she snuck in again and repeated her new routine until it was all gone.</span></div></div>",
            "created":1576222800,
            "id":2759010,
            "title":"Why not? She seemed to not care."
        },
        "14231212122212":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Tori loves it!",
                "Tori hates it..."
            ],
            "content":"<div class=\"\"><div> <span>It was morning and Tori, now significantly fatter, struggled to roll herself out of bed.<br>\r\nHer old pajamas no longer fit and she now wore an adult XL T-shirt as a nightdress.<br>\r\nStill, even it was beginning to cling to her bulging belly and widening hips. With a huff,<br>\r\nshe finally got herself out of bed and waddled to the kitchen. The smells of her breakfast<br>\r\nhelping her stay determined as she made her way down the hall. <br>\r\n<br>\r\n\"Good morning butterball!\" Terri greeted her, while Tori struggled to get into the chair.<br>\r\nTerri couldn't help but be excited by seeing how much her little sister had gained and<br>\r\nhow much she was struggling.\"It's okay Tori, why don't you go sit on the couch and watch<br>\r\ncartoons? I will bring you your breakfast.\" Red faced and sweaty from the struggle she<br>\r\nexcitedly wobbled to the living room and plopped on the couch. Before the intro song of<br>\r\nher favorite show had even ended Tori found herself snacking on the bag of cheese poofs<br>\r\nthat she had left there the night before.<br>\r\n<br>\r\nWalking in with the three piled high plates, Terri couldn't help but notice just how big Tori<br>\r\nwas really getting. The little girl was nearing 270 pounds now and thanks to her late-night<br>\r\nassistance showed no signs of stopping her growth. Still, she wondered what Tori thought<br>\r\nabout how big she had been getting. She placed the plates on the coffee table and sat<br>\r\nnext to the blubbery girl. \"Tori honey?\" Terri paused, trying to catch her sister between<br>\r\nmindless bites. \"You've been getting pretty fat lately, huh?\"<br>\r\n<br>\r\nTori didn't even stop eating, she only grunted an \"Mmmhmm\" as she chewed.<br>\r\nTerri hesitated but finally blurted it out. \"Do you like being so fat?\"</span></div></div>",
            "created":1576223880,
            "id":2759013,
            "title":"A month of nightly feedings later..."
        },
        "142312121222121":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "get you another round of breakfast?\"",
                "make you a special drink?\""
            ],
            "content":"<div class=\"\"><div> <span>Tori turned away from the tv with a bacon grease-soaked smile.<br>\r\n\"I really really like it, is it okay if I get fatter?\"<br>\r\nTerri was stunned. She hadn't expected such a blunt reply.<br>\r\n\"Well uh I mean... If you really want to, big sister could help you.\"<br>\r\nTori squealed with excitement and returned to her breakfast and<br>\r\ncartoons. Terri couldn't help but notice that one of the characters<br>\r\non the show was also very obese. Bigger than her little sister even<br>\r\nwith all of her recent gains.<br>\r\n<br>\r\nTrying to catch her attention Terri asked a bit louder than normal.<br>\r\n\"Who's that character Toni?\" The little girl's mouth was packed full<br>\r\nof pancake but still, she answered. Terri struggled but eventually made out<br>\r\n\"That's Frieda Fatty, she's my favorite.\" between the spewing crumbs.<br>\r\n\"Do you want to be like Frieda?\" Terri asked.<br>\r\nToni nodded yes as she finished the mouthful. \"Yeah! I wanna be just like her!\"<br>\r\nToni continued on between mouthfuls, explaining how if Frieda is fatter than<br>\r\nthe other princesses she gets to be the Queen of Candyland and how all of<br>\r\nher friends help her gain weight to be the biggest. <br>\r\n<br>\r\nAgain Terri saw an opening. \"So, do YOU want to be the fattest too?\"<br>\r\nOnce more, Tori nodded yes. Terri asked again. \"You want to be the fattest<br>\r\ngirl ever?\" This time caught between bites Tori came back with an annoyed<br>\r\n\"Yeah!\" before digging back in.<br>\r\n<br>\r\nThinking back, Terri had noticed that her sister had been forcing herself to eat more<br>\r\nall on her own since she had started watching the show a few weeks ago. This was<br>\r\nexactly what she needed. \"We can start right now if you want!\" Terri stood up, turning<br>\r\nto the kitchen. \"How about I...</span></div></div>",
            "created":1576225800,
            "id":2759020,
            "title":"Tori loves it!"
        },
        "1423121212221212":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Another month passes.",
                "Take it slow, it's the next morning."
            ],
            "content":"<div class=\"\"><div> <span>As soon as Terri mentioned the drink, Tori's eyes lit up and she pointed to the screen.<br>\r\nFrieda also seemed to have a magic potion she drank to make her bigger.<br>\r\n\"Oh, this is just too easy...\" Terri thought to herself, walking fully into the kitchen to prepare<br>\r\nanother batch of the shake she had been secretly feeding her sister.<br>\r\nAfter a few minutes, she returned with toting two pitchers of the shake. In total it was a full<br>\r\ngallon. \"Are you ready for your princess potion Tori?\" Bringing the first pitcher to her sister's lips.<br>\r\nHappily, she lapped it up. Nearly finishing the first pitcher before her breakfast was done.<br>\r\n<br>\r\nAs the day progressed the other pitcher was readily emptied along with five more half-gallon batches on<br>\r\ntop of Tori's usual overly gluttonous intake. The little girl barely got off the couch all-day as Terri<br>\r\ncatered to her every need. When the day finally was coming to an end the bloat and stuffed little<br>\r\ngirl passed out in the same spot on the couch where she had been firmly rooted. It took all she had to drink up the last<br>\r\nlittle bit, nearly falling asleep as the shake flowed down her throat. <br>\r\n<br>\r\nNot wanting to disturb her, Terri grabbed her sister's stuffed cupcake and blanket and tucked her in right there on the couch.<br>\r\nWaiting just long enough for her to fall into a deep sleep before tube feeding her another gallon and a half of the shake<br>\r\nover the course of the night. She hoped the little girl's tummy could handle the little extra tonight as after the third pour<br>\r\nTori started to stir. Merely a shift of her body weight. Her bloated gut sloshing as she rolled over.</span></div></div>",
            "created":1576239180,
            "id":2759040,
            "title":"make you a special drink?\""
        },
        "14231212122212121":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "Say yes and jump ahead in time.",
                "Say no for now and feed her by hand."
            ],
            "content":"<div class=\"\"><div> <span>The new feeding routine for Tori, including the excess of \"Princess Potion\", had become normal by now.<br>\r\nJust over a month since it started Tori had ballooned due to the influx of calories and decrease of activity.<br>\r\nOnly a week into the routine Tori had gotten so used to sleeping on the couch that it became where she<br>\r\nstayed. After a full morning of filling her belly, Terri finally got Tori to actually get up for more than just a<br>\r\nslow waddle to the bathroom. Bringing the scale into the living room she helped her now-massive little<br>\r\nsister step on to it. <br>\r\n<br>\r\nEvery inch of her bulged and folded with excess fat. Her once only slightly pudgy belly<br>\r\nnow hung below her knees. Her thick cankles brushing the top of the scale as they hung around her chubby<br>\r\nfeet. She hadn't really noticed it until Tori stood upright, but  Terri couldn't help seeing that due to the width<br>\r\nof her torso and the great sacks of flesh that hung from Tori's upper arms, that the little girl couldn't lower<br>\r\nthem very far anymore. At their lowest the lay at around a 45-degree angle at the shoulders. It brought her a<br>\r\nstrange sense of pride to see how fat she had helped the young Tori become. Even Tori herself, in spite of her<br>\r\nexhaustion from being forced to be upright on her own two failing legs, seemed to beam with pride when Terri<br>\r\nread her weight aloud.<br>\r\n<br>\r\nIncredibly the little Tori had over doubled her weight! Weighing in at an astounding 558 pounds, accomplished<br>\r\nthe little girl collapsed back on to the couch. Without hesitation insisting on more Princess Potion.<br>\r\nTerri hesitated. She had honestly never planned on fattening her little sister this much. Yet then again,<br>\r\nas she saw her six years old sister delighted by her girth, demanding more of the concoction that had<br>\r\ndone this obscene act to her, she couldn't help but want to keep going. Before going to make the shake, she kneeled<br>\r\ndown next to the blubbery mound that was her little sister.<br>\r\n\"Tori honey... Are you really sure you want to get fatter still?\" Terri paused. Waiting for a quick reply. None followed as<br>\r\nTori was already back to shoveling snacks in her face. Terri continued to prod. \"Cause ya know... if you get much fatter...\"<br>\r\nShe paused again, looking at the immense Frieda on the screen. Noticing how proportionally she was still fatter than<br>\r\nyoung Tori, she was in fact immobile! The other characters cheered her inability to walk or stand, with Tori joining in with<br>\r\nthe chant. \"Too big to move HOORAY!!! Too big to move HOORAY!!\" Terri shifted her tone.<br>\r\n\"Toni honey, I want to ask you one more time okay?\" She turned from the screen, looking a little annoyed.<br>\r\n\"I know, I know but I want to be sure. Your friend there on TV, Freida. She got soooo fat she can't walk anymore right?\"<br>\r\nTori nodded.<br>\r\n\"And you said you want to be as big as her, right?\"<br>\r\nStill agitated, Tori nodded again.<br>\r\n\"So just so I understand. Does that mean you want to be so fat you can't walk, or stand, or get out of bed too?\"<br>\r\nThis time Tori replied. \"Yeah! If I am allowed to.\" Terri lurched forward and squeezed as much of the obese six-year-old as<br>\r\nshe could get her arms around. <br>\r\n\"Of course you can! I will help you back to your bed and then bring the big tv back there for you!\"<br>\r\n<br>\r\nEven with the prospect of having to walk, Tori was excited. As she made the slow, waddle by waddle journey, having to stop<br>\r\nevery other step to rest, Toni took a turn to ask a question. \"If I drink Princess Potion all day, do you think I could get even fatter<br>\r\nthan Frieda?\" Terri's heart skipped a beat. Even she hadn't gone as far as to try and suggest an all gain shake diet.<br>\r\nThis could result in some very interesting things. </span></div></div>",
            "created":1576245540,
            "id":2759068,
            "title":"Another month passes."
        },
        "142312121222121211":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "More adventures with the now 1,000 pound 7 year old?",
                "She lived happily ever after."
            ],
            "content":"<div class=\"\"><div> <span>Another two months pass with Tori on the full shake diet. Within a few days of starting it, Terri had to resort to using<br>\r\nthe feeding tube she had made in secret months ago just to keep up with how much Tori wanted the shake.<br>\r\nSince getting into bed when the new diet started, she hadn't left since. Terri had gotten her a bedpan and<br>\r\npuppy training pads for her to use when she needed to go to the bathroom. As the days went by Tori just<br>\r\nkept growing bigger and bigger. It seemed immobility had agreed with her as over those two months she<br>\r\nhad again ballooned. Though towards the end of the second month, Terri noticed the no matter how much<br>\r\nshe fed her sister, her gains had finally plateaued. It had been another week and she had seen no real obvious change<br>\r\nto Tori's girth. Sadly, she knew that one day this might happen. But on the bright side, with her lack of mobility, insatiable<br>\r\nappetite, and pension for the Princess Potion, there was no foreseeable way she would ever be shedding a single ounce.<br>\r\nContent with herself, Terri arranged to have her immense sister weighed. It took three of them to help her get up plus the assistance<br>\r\nof a fourth to keep her standing long enough to stand on the scale. After the whole ordeal was over and the mound of child flesh<br>\r\nlay back in her bed, Terri finally told her sister how much she now weighed. Even with the feeding tube in her mouth, Terri could see<br>\r\nher sister try to smile around it as she told her that she weighed 990 pounds. A full 150 pounds heavier than the \"weight\" of the Freida<br>\r\ncharacter. Both so happy with their little adventure, Terri laid the far too small blanket over Tori massive belly and kissed her on her<br>\r\nmassively blubbery cheek while positioning the stuffed cupcake in the folds between Tori's upper arm and bust before refilling the tank that<br>\r\nhung above her with more of her beloved Princess Potion. All the while promising that she would do her best to help Tori gain those<br>\r\nlast 10 pounds before her 7th birthday next week. Taking her to a full thousand pounds.<br>\r\n<br>\r\nTrue to her word, Terri found a way to do it. But within days of cresting four digits, once again her weight stalled.<br>\r\nBut still, they both were happy. </span></div></div>",
            "created":1576246740,
            "id":2759072,
            "title":"Say yes and jump ahead in time."
        },
        "1423121212221212112":{
            "author_id":"bardoflard",
            "author_name":"Bard of Lard",
            "choices":[
                "the end",
                "...?"
            ],
            "content":"<div class=\"\"><div> <span>While Tori never again gained as rapidly as she had that summer, she did continue to get bigger as her life went on. <br>\r\nHappily spent the rest of her days as a massive blob of fat with Terri happily caring for her every need.<br>\r\nEventually even becoming famous as the fattest kid, teen, woman, and person to have ever lived as her life progressed.<br>\r\nOfficially setting the record at an astounding 1,986 pounds at the age of only 22. Though Terri swore the scale was off<br>\r\nand her kid sister had crossed the Ton threshold. Regardless, there was no question that Tori was the fattest alive, to have<br>\r\never lived, and would more than like hold that title for quite some time.<br>\r\n<br>\r\nThe End.</span></div></div>",
            "created":1576247220,
            "id":2759073,
            "title":"She lived happily ever after."
        },
        "143":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She goes down for a big breakfast",
                "She goes down and her mother takes her shopping",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Dani smiled while watching cartoons lying on the couch. Just like any weekend in the morning she took her blanket and went down too the couch and watched cartoons the next hours under the blanket. <br>\r\nMost of the time she also used those hours to stuff herself with as much food if was possible. Dani was a sweet girl with long white blond hair, kind of short for her age and a fat belly that she liked. She loved every pound on her body and loved too eat and gain more weight. She did't cared about health. She did't really know that eating a lot and gaining weight was bad for her health. She just wanted too eat and be fat that was all. very simple.<br>\r\nDani's mother was't too happy since she always needed to buy new pants for her gaining daughter. Her dad never really mind her gain. The twins (her older sisters) sometimes teased her with it. they were called Mia and Lia.<br>\r\nShe did't looked like her sisters. Except for the white blond hair. The hair of her sisters was kind of short and curly. They were tall, athletic and slender and muscled with visible abs while she had instead of abs a big layer of fat on her belly. Her sisters looked just the same. Did't matter since they were most of the time together.<br>\r\n<br>\r\n\"Oh Dani are you watching T.V again?\"<br>\r\n<br>\r\n\"Eh...\" Dani started.<br>\r\n<br>\r\n\"So you are. Just watching T.V all day. Just like grandma. I should throw that thing out of the window!\"<br>\r\n<br>\r\n\"I like cartoons. What's wrong with that?\"<br>\r\n  <br>\r\n\"Nothing. If you did something else besides it. Why don't you go outside with the twins? Do some exercise.\"<br>\r\n<br>\r\n\"I don't like exercise! Besides i can never keep up with the twins!\"<br>\r\n<br>\r\n\"Just because your'e too fat!\" Her mother said with a hard voice.<br>\r\n<br>\r\nDani looked with a smile at the two empty big bags of chips, the empty box of cookies the three empty wrappers of chocolate and the empty half a gallon of ice cream. That had been her morning snack. She patted her fat belly. She also took one look at her mother's fat belly. However her mother told her that she was't fat but she was pregnant. Again. Her fourth child. She would lose that beautiful round belly. It seemed too Dani wonderful having such a big belly. Too bad you lost it when the baby was out.<br>\r\n<br>\r\n\"Now put out that T.V and go upstairs and get dressed!\"<br>\r\n<br>\r\nWith a deep sigh she put out the T.V and took her blanket upstairs and got out of her nightie and put on some clothes. That was alway's a big problem. Too find clothes that fit. She put on a stretchy shirt and try too put on some pants that fitted a while ago but she also outgrow them. <br>\r\nShe went down with her shirt and only some underpants.<br>\r\n<br>\r\n\"Moooooooomy! I don't have any pants that fit!\"<br>\r\n<br>\r\nHer mother looked angry at her.<br>\r\n<br>\r\n\"It's always the same with you! Still you outgrown all your clothes just because you're too fat!\"<br>\r\n<br>\r\nDani was proud on the fact she was too fat but she knew that if she would tell her mother she would be furious so she just stood there and kept her mouth shut and looked at her mother.<br>\r\n<br>\r\n\"Look of you can get some clothes from Mia and Lia.\" Her mother said.<br>\r\n<br>\r\nMia and Lia might be thin but the were two years older then her and they had a lot of sport clothing that was very stretchy so it would probably fit over her belly. But it would be much too long and she alway's need to turn the pipes a few times. <br>\r\nShe went too her sisters room. They were both out. Probably with some friends exercise. She fast found some stretchy sport pants and pulled them over her belly. It fitted but just barely and he pipes were much too long. She turned them a few times and slowly went downstairs.<br>\r\n</span></div></div>",
            "created":1264914000,
            "id":828347,
            "title":"Meet Dani and her family"
        },
        "1431":{
            "author_id":"kingderp",
            "author_name":"Derp",
            "choices":[
                "Go try and find a swim suit that fits",
                "Continue to sit on couch"
            ],
            "content":"<div class=\"\"><div> <span>Dani walks into the kitchen to get herself some breakfast. <br>\r\n<br>\r\n\"what to get\" Dani wondered.<br>\r\n<br>\r\nHer mom states, \"Are you seriously thinking about eating more.\"<br>\r\n<br>\r\n\"Well this is breakfast\"<br>\r\n<br>\r\n\"Whatever\" Her mom sighed. <br>\r\n<br>\r\nDani grabs a box of cereal and sits down on the couch watching more cartoons. Dani eventually ate 2 boxes of cereal, an entire pack of yogurts, and a box of cookies.<br>\r\n<br>\r\n\"Are you done yet!\" Mia said.<br>\r\n<br>\r\n\"Yeah, we're ready to go swimming\" Lia said.<br>\r\n<br>\r\nDani shrugged and continued to watch cartoons. <br>\r\n<br>\r\n\"you're going to the pool too Dani!\" Her mom shouted. </span></div></div>",
            "created":1563166800,
            "id":2687251,
            "title":"She goes down for a big breakfast"
        },
        "144":{
            "author_id":"bbwonder",
            "author_name":"PhantomPen",
            "choices":[
                "Racheli is from India",
                "Rachieru is from Japan",
                "Map please"
            ],
            "content":"<div class=\"\"><div> <span>\"We hope you'he enjoyed your flight, and thanks for your preference.\" People began to leave the plane. Beetween al this people were a young girl. She was just 10 years old. She was on vacation, and decided to visit the USA for this 3 months. She will stay with her uncle and aunt. They usually are busy, so it's normal for them to be out of home. She was thinking of staying if she like the place. Rachel a happy girl from</span></div></div>",
            "created":1277442000,
            "id":906492,
            "title":"Time to change"
        },
        "1442":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "Waiting for her at the terminal",
                "Stuck in traffic"
            ],
            "content":"<div class=\"\"><div> <span>...Japan. From Yokohama if you were to be specific. Her uncle, having moved to America to make a name for himself, was only too glad to have his niece over for a visit. And while her parents were too busy to take that much time off, Rachel found it a great time to prove just how adult she was.<br>\r\n<br>\r\nOf course, first thing first off the flight, she needed to find out where Uncle Junpei was. Flicking out the quintessential accessory for any kid, a quick call would solve the issue right away.<br>\r\n<br>\r\n*<i>click</i>*<br>\r\n<br>\r\n...<br>\r\n<br>\r\n...<br>\r\n<br>\r\n\"Hey, Uncle Junpei!\"**<br>\r\n<br>\r\n\"Yeah, I just got off my flight.\"<br>\r\n<br>\r\n\"It was pretty cool. Well, at least the take-off was, I think I slept through a lot of it.\"<br>\r\n<br>\r\n\"Hey, where are you guys right now?\"<br>\r\n<br>\r\n** - dialogue translated for reader convenience</span></div></div>",
            "created":1487394000,
            "id":2279209,
            "title":"Konnichiwa From the Far East!"
        },
        "14422":{
            "author_id":"casualcritic",
            "author_name":"CasualCritic",
            "choices":[
                "Her aunt and uncle have just arrovex and are ready to pick her up.",
                "Junpei is... now in the airport proper. She still has time."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh.\" Stupid big city traffic.<br>\r\n<br>\r\n\"Yeah, I can stay here until you pick me up.\"<br>\r\n<br>\r\n\"OK, see you soon too, Uncle Junpei. Byeee.\"<br>\r\n<br>\r\nWell that was a bit of a bummer. She'd kinda been hoping to start this vacation off right but Atlanta had other things to say about that. Now the question was, what to do in the meantime.<br>\r\n<br>\r\nHer stomach grumbled an answer to her. Going from Japan to America was a LONG flight and she didn't have much of a way to pay the flight attendant for refreshments. Or at least... she didn't think she did. In any case, she was starving and couldn't wait until her Uncle got here to eat.<br>\r\n<br>\r\nLuckily, like most airports, this one was stocked with a large food court for flight passengers. And like a greasy angel from above, she could always trust the welcoming golden arches of McDonald's. The name may be difficult to read, English wasn't her best subject, but you could always recognize the logo.<br>\r\n<br>\r\nWalking to the front counter, she did notice a small problem. She normally ordered a kid's meal, but that was difficult to do when you changed the language. Buuut... she could count on English. And they had a lovely menu board with pictures of food and large numbers she could recognize. And was she not grown up enough for a grown-up combo? No toy, unfortunately, but she was proud of the ingenuity of her plan.<br>\r\n<br>\r\nKeeping it simple, she ordered a number one, number two, and number three. Simple enough. Her parents had been kind enough to provide her with an American credit card too, just in case she needed to buy something. It may be a tad much, but a little known secret was that she absolutely loved fast food. Nobody had to know she ate all that.<br>\r\n<br>\r\nWhen her order got there, though, she realized she MAY have made a mistake. Combos weren't just the pictures shown on the menu board. Four burgers (since the number two had two burgers), three drinks, and more fries than she'd ever expected. What did her mom always say about her eyes being bigger than her stomach?<br>\r\n<br>\r\nShe cautiously peeked around the corner as if someone might be watching her. She couldn't waste all this food. She WOULDN'T waste all this food. Three drinks, that was one for her and both Uncle Junpei and his wife. She'd eat what she could and bag up what she couldn't. Though she still had to eat a lot, just so her Uncle didn't ask her why she had all this food.<br>\r\n<br>\r\nTwenty minutes later, she was feeling pretty sorry for herself. This was a bad idea. This was a terrible, terrible idea. She had succeeded in eating a large amount of the food, but at the cost of her own well-being. She was feeling quite ill to her stomach. But at least there wouldn't be any unwanted questions.<br>\r\n<br>\r\nStartling her from her food-induced stupor, her pocket began vibrating urgently. A text message! She grabbed the phone and clicked it on with a speed that surely must be world record pace. Guilt did fun things with your reflexes.</span></div></div>",
            "created":1487394000,
            "id":2279221,
            "title":"Now to Play the Waiting Game"
        },
        "1443":{
            "author_id":"bbwonder",
            "author_name":"PhantomPen",
            "choices":[
                "Raquel it's from México",
                "More countries please",
                "That really matters?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So where she comes from?</span></div></span></div>",
            "created":1277442000,
            "id":906493,
            "title":"Map please"
        },
        "14432":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "England?",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rachel suddenly forgot her heritage!<br>\r\nShe was tapping her foot and trying<br>\r\nto remember</span></div></span></div>",
            "created":1277874000,
            "id":909043,
            "title":"More countries please"
        },
        "144321":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Go to meeting Kate "
            ],
            "content":"<div class=\"\"><div> <span>Oh that's right! she is from England! Usaly a long sleep on then plain makes you forget many things.<br>\r\nBack in her home fast food was scarce. In total there were only around 15 Mcdonalds in the entire country. She had a taste of fast food at the airport and she could not get enough of it. She ate more then she ever ate in here life! Her mother was good with it. She thought she was too thin anyway.<br>\r\nRachel and her mom stayed with her aunt and uncle every year and Rachel had many friends in the town that they were staying in. Her best friend was Kate, she was like Rachel in many ways, such as her face and that she was thin</span></div></div>",
            "created":1277874000,
            "id":909047,
            "title":"From U.K. to USA"
        },
        "1443211":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Go get a bite to eat",
                "Go to aunt and uncle's house"
            ],
            "content":"<div class=\"\"><div> <span>When her mom<br>\r\nStoped the car by Kate's house Rachel was exited, but when she was Kate, something, changed. Rachel had a hard time making it out, but she did: Kate was fatter, much fatter.<br>\r\nThey both hugged because they have not seen eachother in a year. The last time they hugged, Kate felt bony and thin now she was fat, soft, and warm. Rachel actualy sort of liked this change (And so did Rachel's mom)</span></div></div>",
            "created":1277874000,
            "id":909052,
            "title":"Go to meeting Kate "
        },
        "14432111":{
            "choices":[
                "2 big hamburgers,3 big fries,4 boxes of nuggets and 3 big cokes"
            ],
            "content":"<div class=\"\"><div> <span>Rachel felt a bit strange. Her best friend had to gain at least 40 pounds! She hugged her but she still gave her a  disgusted look. She still liked her but now she was a big butterball! A fat huge butterball. Rachel's mom always was angry at her because she rarely ate anything. Why? She didn't want to get fat or even worse ... Be obese and \"ugly\".  <br>\r\n-Hey,I'm sure you're hungry.Maybe we should head to this amazing restaurant?-asked Kate in friendly voice. Rachel looked at her with a weird look on her face. After all,she shouldn't eat now. She should be exercising! Though,she was hungry. After a moment of silence she agreed. When they arrived Rachel realized that this restaurant was a Fast Food place. She felt super hungry and felt really big desire for food.Therefore she decided that she wants to eat :</span></div></div>",
            "created":1482728400,
            "id":2254572,
            "title":"Go get a bite to eat"
        },
        "144322":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Austrailia",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rachel than remembered that she hailed from ....</span></div></span></div>",
            "created":1488085200,
            "id":2282495,
            "title":"Nope"
        },
        "1443221":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "They go through a drive thru",
                "they eat at a fastfood restaurant"
            ],
            "content":"<div class=\"\"><div> <span>Rachel was a ten year old Australian girl who was spending the summer with her aunt and uncle who live in North America.  Rachel was a cute little blonde girl with blue eyes and of course an Australian accent. Living in Australia, Rachel was accustomed to an active lifestyle, true to her Aussie girl character, from playing in the outback, seeing koalas and kangaroos, and swimming. Rachel also grew up eating a balanced diet bereft of any heavy consumption of  junk foods unlike the Americans. Thus Rachel possessed a very trim and light physique.<br>\r\n<br>\r\n\"Thanks mate!\" Rachel said to the flight attendent as she exited the plane, brimming with excitement at the thought of experiencing America and seeing her aunt Shelly and uncle Rick again. Rachel's aunt and uncle originated from Australia but they left for a high paying job in the US. Their departure saddened Rachel for she enjoyed their company. But now Rachel got to spend 3 whole months with them. Rachel was wearing a light blue tank top and a skirt, ornamenting herself with bracelets and a necklace, fashioning her long blonde hair in a ponytail. Rachel scanned through the crowd, searching for her relatives.<br>\r\n<br>\r\n\"Rachel!\" a voiced cried.<br>\r\n<br>\r\n\"There they are!\" Rachel said with glee. \"Aunt Shelly! Uncle Rick!\" Rachel squealed as she darted at them.<br>\r\n<br>\r\n\"Rachel! come 'ere give me a hug!\" shouted aunt Shelly.<br>\r\n<br>\r\nRachel jumped right into the arms of her aunt and despite her jubilee, Rachel noticed something different. Aunt Shelly was fat, really fat. Her embrace was soft and plushy. Her arms were smothered in lard, her belly squished into her, while her huge boobs pressed into her face. The last time Rachel saw her aunt 2 years ago prior to moving, she was slim, barely weighing 115 pounds. But now Rachel gazed upon her aunt's new girth, nearly tripled in size.<br>\r\n<br>\r\n\"Welcome to the US Rachel.\" greeted her uncle Rick, who to Rachel's pleasure had remained slim unlike his wife, at least that remained familiar.<br>\r\n<br>\r\n\"Oh it's been too long Rachel. My aren't you growing into a beautiful woman.\" aunt Shelly stated eyeing her thin niece.     <br>\r\n<br>\r\n\"Well what do you say we get going, Rachel?\" her uncle suggested.<br>\r\n<br>\r\n\"I bet you're hungry too, we'll pick you up some nice fast food.\" aunt Shelly offered.<br>\r\n<br>\r\n\"I could eat. I never had fast food before though, is it good?\" Rachel responded.<br>\r\n<br>\r\n\"It's delicious!\" aunt Shelly enthusiastically answered displaying quite the ravenous countenance.<br>\r\n<br>\r\n\"Great.\" Rachel replied, now anticipating a tasty meal.</span></div></div>",
            "created":1488085200,
            "id":2282505,
            "title":"Austrailia"
        },
        "14432212":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "huge, filled with food",
                "normal sized"
            ],
            "content":"<div class=\"\"><div> <span>After leaving the airport, they drove to a fastfood restaurant where Rachel would try her first sample of American eating. They stopped in front of a building with the typical fastfood restaurant look, a look that was totally unfamiliar to Rachel.<br>\r\n<br>\r\n\"EEE! here we are Rachel! Oh you are  in for a real treat.\" aunt Shelly confidently squealed.<br>\r\n<br>\r\nUpon entering the building, Rachel was instantly buffeted by a strong greasy odor. She never smelt such a strong smog. A torrent of smoke from frying grease sallied Rachel's nostrils. Rachel also noticed the numerous fat people eating there. She never saw such a concentration of overweight people in Australia. Rachel heard her relatives order. Uncle Rick ordered a modest meal whereas her aunt Shelly's order was far larger and more elaborate. When it came her turn to order Rachel was too daunted to order having never set foot in a fastfood dive before. Fortunately for her, aunt Shelly ordered for her. As they wait for their order they take a seat and chat. After catching up, Rachel asks questions.<br>\r\n<br>\r\n\"So are there any beaches or lakes to swim in?\" Rachel inquired.<br>\r\n<br>\r\n\"No sorry but we do have a community pool.\" they answered.<br>\r\n<br>\r\n\"Do the kids play soccer here? Do they roller blade or play games?\"<br>\r\n<br>\r\n\"We don't see many kids playing outside.\" Shelly said.<br>\r\n<br>\r\n\"Huh?! But what do they do?\" Rachel grew alarmed.<br>\r\n<br>\r\n\"Video games, tv, going out to eat, movie theaters, swimming in the community pool, going to theme parks...\"  uncle Rick listed before getting cut off by the order being ready.<br>\r\n<br>\r\nBeing the more agile, Rick got up to get it while Shelly's fat ass remained sitting.<br>\r\n<br>\r\n\"Don't worry Rachel, you'll find all sorts of fun things to do here.\" Shelly consoled.<br>\r\n<br>\r\nLittle did Rachel know that her active lifestyle was going to come to a screeching halt in place of a sedentary lifestyle.<br>\r\n<br>\r\n\"Here's the food.\" Rick said.<br>\r\n<br>\r\nThe meals were placed in front of them. Rick's was modest, Shelly's was massive. As for Rachel, the tray placed in front of her was.....<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1488085200,
            "id":2282509,
            "title":"they eat at a fastfood restaurant"
        },
        "1443222":{
            "author_id":"justanotherone",
            "author_name":"JustAOne",
            "choices":[
                "Czech Republic",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Arrived from exact center of Europe. <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/wink.png\" alt=\"*Wink*\" class=\"emoteZ\" title=\"Wink\" border=\"0\" width=\"15\" height=\"15\"> </span></div></span></div>",
            "created":1517979600,
            "id":2450494,
            "title":"other"
        },
        "145":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "It is now a good time to go to sleep, it is now midnight.",
                "To sneak more coke from downstairs.",
                "That she wants to get fatter."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amy was on her iPad secretly on deminsions magazine reading WG stories while eating a jar of peanut butter with a spoon with a cherry coke past 10:00pm because if she did it at another time, she might get caught. She then decided that</span></div></span></div>",
            "created":1468731600,
            "id":2182063,
            "title":"On her favorite website "
        },
        "1451":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "fatten her friends",
                "get fat",
                "watch cartoons"
            ],
            "content":"<div class=\"\"><div> <span>Amy grew tired and decided to go to bed.<br>\r\n<br>\r\n\"Yawn! I'm sleepy, guess its time for bed. I'll read more wg stories tomorrow.\" Amy said walking to her bed.<br>\r\n<br>\r\nAmy was a little more peculiar than the typical girl, for experience a pleasurable sensation from watching women get fat. Amy got her thrills from hearing stories of women gaining to cartoon girls getting fat, to thoroughly enjoying her mother's struggle with her weight. Amy herself had become self indulgent as she dove deeper into this fascination, resulting in an accumulation of fat. This did not bother her though, for she had an appreciation of her new curves, getting to play with her soft belly and more so watching her slim waist vanish under a layer of flab.  <br>\r\n<br>\r\nAmy quickly fell to sleep and had a rather amusing dream. In her dream Amy found herself in the totally spies cartoon were she was greeted by Clover wielding boxes of passion patties.<br>\r\n<br>\r\n\"Hey Amy want to get really fat?\" dream Clover asked.<br>\r\n<br>\r\n\"Yeah lets do it!\" Amy responded enthusiastically.<br>\r\n<br>\r\nAmy then dreamed about her and Clover consuming heaps of cookies growing obese. Amy watched as Clover's fat bulged out and jiggled, she was far fatter than she got in the cartoon. Amy fondled Clover's fat and Clover let out a squeal of pleasure.<br>\r\n<br>\r\n\"Hey Amy wanna help me fatten up my friends?\" Clover deviantly suggested.<br>\r\n<br>\r\nSuddenly Sam and Alex were hooked up to the feeder getting force fed into immobility. Amy joyfully watched as the other cartoon girls' fat tore through their clothing. Their squirming limbs thickening into submission fueled Amy's lust. Upon their capitulation Clover looked at Amy with a devilish grin and asked.<br>\r\n<br>\r\n\"Amy do you have any friends you want to fatten?\"<br>\r\n<br>\r\nUpon that question Amy woke up feeling rather vigorous and with a strong urge to...  </span></div></div>",
            "created":1477717200,
            "id":2230069,
            "title":"It is now a good time to go to sleep, it is now..."
        },
        "15":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Girl scouts",
                "Day care",
                "Bake sale",
                "Fatteners ",
                "New snack"
            ],
            "content":"<div class=\"\"><div> <span>Group weight gain is an event that girls partisapate in making their weight sky rocket<br>\r\n<br>\r\nChosis<br>\r\n<br>\r\nGirl scouts<br>\r\n(All they do there in real life is just snacks, camp, and somtimes going to the beach)<br>\r\n<br>\r\nDay care center<br>\r\nSome parent has been grossly misinformed about nutrition<br>\r\n<br>\r\nConstant bake sales<br>\r\nSome schools have bake sales yearly or monthly but how about hourly?!<br>\r\n<br>\r\nFattening teachers/parents<br>\r\nPlumping up girls for little personal gain is always fun!<br>\r\n<br>\r\nNew snack<br>\r\nA new snack compony has sponserd the school but it is starting to take over everything they do there </span></div></div>",
            "created":1260939600,
            "id":806338,
            "title":"Group weight gain"
        },
        "151":{
            "author_id":"wgstories",
            "author_name":"Wgstories",
            "choices":[
                "Mom's room",
                "Vanessa's room",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa Sage was a 11 years old and was a member of girl scouts. Her mom was the troop leader, and every time girl scout cookie time came, Vanessa would sneak at least 10 boxes into her room and eat them all. She couldn't get enough. Due to her cookie cravings, Vanessa had become much fatter. So anyways, it was cookie selling time again...<br>\r\n<br>\r\n\"So remember Girls, make sure to sell lots of cookies!\" Vanessa's mom addressed the group<br>\r\n<br>\r\n\"Mom? Now that our meeting is over, can Lizzy and Tracy stay and play?\" Vanessa asked nicely<br>\r\n<br>\r\nLizzy and Tracy had been Vanessa's friends since Kindergarten.<br>\r\n<br>\r\n\"Only if their moms say it's ok. I'll go call them.\" Vanessa's mom left the room<br>\r\n<br>\r\nAfter all the girls had left, Ms. Sage came back.<br>\r\n<br>\r\n\"All right, they can stay. But only until 5.\" Her mom explained<br>\r\n<br>\r\n\"Yay! Thanks mom!\" Vanessa cheered<br>\r\n<br>\r\nThe three girls ran towards Vanessa's room but were stopped by Vanessa.</span></div></div>",
            "created":1264482000,
            "id":826130,
            "title":"Girl scouts"
        },
        "1511":{
            "author_id":"wgstories",
            "author_name":"Wgstories",
            "choices":[
                "\"Eat up!\"",
                "\"Feed me!\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Shh! Follow me.\" Vanessa whispered<br>\r\n<br>\r\n\"Where are we going?\" Tracy asked<br>\r\n<br>\r\n\"Into my mom's room.\" Vanessa explained<br>\r\n<br>\r\n\"What? Why?\" Lizzy asked<br>\r\n<br>\r\n\"Because that's where the cookies are!\" Vanessa explained<br>\r\n<br>\r\nThe girls walked quietly into Vanessa's mom's room. Vanessa started to grab boxes.<br>\r\n<br>\r\n\"What are you doing?!\" Lizzy asked shocked<br>\r\n<br>\r\n\"I love eating these! Help me!\" Vanessa explained<br>\r\n<br>\r\nThe two girls grabbed a couple boxes, and they all ran to Vanessa's room. Vanessa locked the door. She started eating a box of thin mints.<br>\r\n<br>\r\n\"So good!\" Vanessa said with her mouth full<br>\r\n <br>\r\nThe girls stared at her, awestruck.<br>\r\n<br>\r\n\"What are you looking at...</span></div></div>",
            "created":1264482000,
            "id":826131,
            "title":"Mom's room"
        },
        "15111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Convince her friends to indulge with her",
                "Force-feed herself and friends"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vanessa opened the closet revealing piles apon piles of girl scout cookies. \"Look at this! There are enough cookies for all of us!\" Vanessa said. Tracy and Lizzy seemed hesitant.</span></div></span></div>",
            "created":1293080400,
            "id":1020609,
            "title":"\"Eat up!\""
        },
        "151111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "The next girl scouts meeting (1 week later)",
                "The following school day"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa thought for a second and smiled. \"Oh Tracy, I do believe that you hate these cookies to go to waste?\" Vanessa started. Vanessa ate an entire cookie package right in front of both of her friends. \"Well Tracy, it was such a shame that you couldn't enjoy all that yummy sugar!\" Tracy then started to devour part of the packages. Vanessa then focused her attention on Lizzy. \"Lizzy, I do notice you want to become more pretty by any means possible?\" Vanessa asked. Lizzy nodded. \"Well then, did you know the more sugar and calories you eat, the more pretty you become?\" Vanessa asked. \"Really!?\" Lizzy inquired with a smile. \"Yeah, and did you know fashion models our ages only eat desserts all the time?\" Vanessa lied. \"Wow! I'm so behind then! I better start eating!\" Lizzy said. Vanessa started a quiet laugh when she saw two of her best friends sharing her favorite hobby. Vanessa and none of her friends knew that sugar turned to fat, and fat made them fat, but since they didn't know, they continued to eat, and eat...</span></div></div>",
            "created":1293080400,
            "id":1020622,
            "title":"Convince her friends to indulge with her"
        },
        "1511111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "The meeting",
                "Lunch at school"
            ],
            "content":"<div class=\"\"><div> <span>After one week since the last meeting, a lot has changed. For Tracy, although she was a little fat before, over the week she has become noticeably fatter. For Vanessa, none of her shirts fit, they all showed a little bit of belly. The largest change was probably Lizzy. Since Vanessa said that pretty girls only ate sugar, that's all Lizzy has been doing for that last week. Although Lizzy hasn't gained as much weight as Vanessa and Tracy, her diet of sugar is having a major affect on her attitude. Lizzy was very hyper and has constant sugar rushes, so she had extra energy to spare. At the girl scout meeting, there were 9 other girls in they're troop, two of them were very notable. One of them was Trisha, she had dark brown hair, and a belly as big as Vanessa's. She had the reputation as being a rich, spoiled, brat. She was very admired by Vanessa. The other one was Lindsey. She was a blonde, quiet girl. She used to be skinny, but had a massive weight gain recently. Vanessa secretly wanted her to get fatter.</span></div></div>",
            "created":1293166800,
            "id":1021517,
            "title":"The girls"
        },
        "15111111":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "A 20 layer cake withevery flavor and the cookies formlua in makeing it super fat",
                "ice cream the size of a middum size airplane."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All right everyone as your leader I delare this meating started! Everyone cheared.As such I have a new law to add to this team YOU MUST GAIN WEIGHT!!!! And so I have brought some super good food for you to fattin up on dring it out! and it was.....</span></div></span></div>",
            "created":1381294800,
            "id":1676557,
            "title":"The meeting of fatting"
        },
        "151111111":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "20 layer cake feast",
                "more realisitic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Go with the girls gorging on the 20layer cake?<br>\r\nor something more realistic?</span></div></span></div>",
            "created":1530939600,
            "id":2516123,
            "title":"A 20 layer cake withevery flavor and the cookie..."
        },
        "1511111112":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "noticeably fatter",
                "munching on a box of cookies"
            ],
            "content":"<div class=\"\"><div> <span>The girls sat around in Vanessa's living room, chatting as they waited for Vanessa's mom to come and commence the meeting. Vanessa observed her twelve girl squad, particularly their bodies. As of lately, the eleven year old girl was developing a yearning to fatten up her friends. Watching them feed their bodies and soften up satisfied Vanessa, even watching herself grow pleasured her. Seven girls of her troop were far too skinny but the other four were tubby and only growing.<br>\r\n<br>\r\n\"Ahem!\" Trisha, the rich spoiled girl addressed \"Really Vanessa can't your mother come out quicker?\"<br>\r\n<br>\r\n\"Oh hey Trisha.\" Vanessa answered happily looking at Trisha's big belly which was seeping out from under her shirt \"Sorry about my dumb mom being so slow, but here have some cookies while you wait.\" Vanessa suggested offering Trisha a box of girl scout cookies.<br>\r\n<br>\r\n\"Very well.\" the rich girl accepted taking a seat and beginning shoving cookies in her mouth.<br>\r\n<br>\r\n\"Hey hey hey Vanessa!\" jabbered a hyper Lizzy. \"I could use some cookies too. Gotta eat lots of sugar. Just like the fashion models.\"<br>\r\n<br>\r\n\"Sure here you go.\" Vanessa obliged giving Lizzy the most sugar densed cookies available.<br>\r\n<br>\r\nVanessa than looked at Tracy who was already stuffing her exposed belly with cookies. The sight of Tracy's visible belly button provoked Vanessa to smile. Vanessa then turned her gaze to the other fat girl of the group, Lindsey. <br>\r\n<br>\r\nJust a few weeks earlier Lindsey was skinny, downright scrawny even, but for some reason (much to Vanessa's joy) the quiet Lindsey began to binge eat. Unbeknownst to the other girls, Lindsey's parents were arguing more than ever which stressed their young daughter out causing her to seek serenity in food. Whenever her parents would start yelling, Lindsey would run up to her room and eat as much candy as she could. As a result Lindsey's slender body became buried in stress-induced flab.  In spite of Lindsey's turmoil, Vanessa couldn't help but relish the accumulating pounds on the blonde.<br>\r\n<br>\r\n\"Okay girls Gather round!\" shouted Ms Sage walking into the living room, ready to start this meeting.<br>\r\n<br>\r\nVanessa was pleased as she noticed her mother was...</span></div></div>",
            "created":1530939600,
            "id":2516151,
            "title":"eating to pass time"
        },
        "15111111122":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "the next meeting, the 8000 boxes arrive",
                "Vannessa and her friends sell cookies"
            ],
            "content":"<div class=\"\"><div> <span>\"Big announcement girls!\" Vanessa's mom shouted with a mouthful of cookies.<br>\r\n<br>\r\nThe girls quickly focused on Vanessa's mom who was pouring the remnants of the box down her throat, the tubby five followed suit.<br>\r\n<br>\r\n\"Guess what girls! Every troop that accepts 8000 boxes of cookies gets a trip to the beach.\"said an excited Ms Sage.<br>\r\n<br>\r\nAll of the girls' dropped their jaw, shaking with joy.<br>\r\n<br>\r\n\"Now do you think our squad can handle a load of 8000 boxes?\" asked a hopeful Ms Sage. <br>\r\n<br>\r\nThe girls grew silent, apprehensive of the possibility of success. Selling 8000 boxes would be really hard for twelve girls but passing up a trip to the beach would be too disappointing for the young scouts to bare. It would be Vanessa who would lead the girls to triumph.<br>\r\n<br>\r\n\"Come on its not like we have to sell all of them.\" her words caught everyone's attention. \"We could keep whatever we can't sell and eat it ourselves.\"<br>\r\n<br>\r\nThe rest of the squad cheered Vanessa's plan.<br>\r\n<br>\r\n\"Alright then. I'll go inform the head scouts that our group will take 8000 boxes.\" Ms Sage stated amidst the jovial girls. \"Now let's celebrate.\" <br>\r\n<br>\r\nMs Sage briefly left for the kitchen to pull out several boxes of pizza \"Dig in girls!\"<br>\r\n<br>\r\nThe fervent girls pounced on the pizzas, quickly consuming the cheesy meal. Each girl, whether fat or thin stuffed several slices down their throat. Even Ms Sage took generous proportions. Seeing the thinner girls gorge pleased Vanessa who longed to see them fat. Lindsey ate at a moderate pace due to an abense of her yelling parents. Trisha ate the more heavily topped pizzas with the mentality that more toppings meant more sophistication. Lizzy however wasn't eating.<br>\r\n<br>\r\n\"Come on Lizzy eat up.\" Vanessa recommended holding a slice to her.<br>\r\n<br>\r\n\"But Vanessa there's no sugar in pizza. How can I make myself prettier if I don't eat alot of sugar?\" Lizzy reasoned.<br>\r\n<br>\r\nVanessa went into the kitchen and returned with a bag of sugar with which she poured the contents onto one of the pizzas.<br>\r\n<br>\r\n\"There you go Lizzy. A sugar pizza. Now eat up.\"<br>\r\n<br>\r\nLizzy's eyes lit up as she gazed upon the pizza buried under a pile of sugar and joyfully accepted. \"O-Kay!\" <br>\r\n<br>\r\nNow every girl was eating without restraint and quickly demolished the pizzas. With only 3 slices left, the girls were far too full to eat another bite. That was when Vanessa manipulated Tracy to eat the remaining slices. Tracy was a girl who hated seeing things go to waste. Being raised in a frugal household, the big bellied girl developed a disdain for wastefulness.<br>\r\n<br>\r\n\"Hey Tracy you wanna eat the last slices.\" Vanessa inquired.<br>\r\n<br>\r\n\"Ughh\" moaned Tracy too full to properly answer.<br>\r\n<br>\r\n\"Okay then I guess I'll just have to throw them away.\" Vanessa playfully sang.<br>\r\n<br>\r\n\"Err you'll really throw them away?\" Tracy weakly asked.<br>\r\n<br>\r\n\"Uh-huh.\"<br>\r\n<br>\r\n\"Fine\" Tracy groaned lifting herself up \"Give them here.\"<br>\r\n<br>\r\nAnd as Tracy force fed herself the last three slices, the girl scout meeting concluded with no girl possessing a flat tummy anymore. <br>\r\n<br>\r\n</span></div></div>",
            "created":1530939600,
            "id":2516182,
            "title":"pizza party"
        },
        "151111112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Main girls:340 other girls:260.",
                "Your choice!"
            ],
            "content":"<div class=\"\"><div> <span>The kids marveled at the size of the sweet milky treat and charged up the ladders on the sides and slided down into it mouth open 20 pounds a bite was added to there small frames making theme grow dramaticly with each bite when the last scope of ice cream was eaten they weighed...</span></div></div>",
            "created":1411275600,
            "id":1859674,
            "title":"ice cream the size of a middum size airplane."
        },
        "1511111121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Later that night....(Like daughter like mother,mom gain to!)",
                "Next weeks meeting even fatter kids bigger food!"
            ],
            "content":"<div class=\"\"><div> <span>OOOOOOOBBBBBBBBBBBBBBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUPP PPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPHHHHHHHHHHHHHHH!!!!!! I couldn`t eat another bite.(The ice cream really changed how the looked most of the girls had rips, tears,splits and ruined clothes on the ground and they had gained breasts from it so that was a plus.)So what now?</span></div></div>",
            "created":1415250000,
            "id":1882392,
            "title":"Main girls:340 other girls:260."
        },
        "15111112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Next week",
                "The following day"
            ],
            "content":"<div class=\"\"><div> <span>After the meeting the girls went outside to eat lunch. Vanessa looked at what everyone has for lunch. She had some crackers and a box of cookies, Tracy had a large ham sandwich and a box of cookies, Lizzy only had a bunch of boxes of cookies, Lindsy had some cupcakes and two boxes of cookies, And Trisha had a large piece of thick chocalete cake, two boxes of cookies and some twinkies. Vanessa sat next to Trisha. \"Hey Trisha, want some of my cookies? You look hungry!\" Vanessa asked. \"Of course!\" Trisha said while wolfing the cookies down. \"Do you get to eat desserts for lunch every day if you want to?!\" Vanessa asked. \"Yep! My mom said I can eat what ever want!\" Trisha said with pride. \"Wow!\" Vanessa astonished. Vanessa watched Trisha take a greedy bite out of the cake slice. \"Want to come over to my house and swim next week?\" Vanessa asked. Trisha finished the last of her lunch and unbuttoned her pants to release her growing belly. \"Sure thing!\" Trisha agreed. \"Yay! She said yes!\" Vanessa thought to herself. </span></div></div>",
            "created":1312002000,
            "id":1157713,
            "title":"Lunch"
        },
        "151111121":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "They start eating",
                "They start playing"
            ],
            "content":"<div class=\"\"><div> <span>The following week, Trisha, Lizzy, and Tracy came over to swim. Changes had occurred, but nothing too unexpected. Because of the extra cookies Vanessa brought Trisha every day, Trisha's already tight clothes became skin-tight; giving Triha a muffin top that spilled out of the sides of her shirt. Trisha also brought in extra dessert for Vanessa, giving her a muffin top aswell. There wasn't a huge change in Tracy. She kept growing at a moderate pace. Lizzy's metabolism started to slow down, making her sugar rushes less frequent, making her lazy, and making her gain weight. Trisha was the first to arrive. Trisha's belly jiggle in her bikini was heavenly to Vanessa. They both got in the shallow end of the pool.</span></div></div>",
            "created":1322283600,
            "id":1229349,
            "title":"Pool party"
        },
        "1511111211":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Lizzy and Tracy arrived"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa went into her house in a quick fashion, and came out with a large storage box containing many cookie boxes. She emptied the contents of the box on the ground and climbed back into the pool. The cookie boxes looked different. They were all much larger, had images of plump Girl Scouts on them, and the names were different. Vanessa's personal favorite name was \"morbidly obese mint\". Trisha looked puzzled. \"What's different about these cookies?\" She asked. \"Apparently each cookie is three times as large and tastes three times as good.\" Vanessa replied. \"They arn't realeased to the public yet, our troop is the first troop to taste-test it; we got a huge amount of boxes in the cellar.\" \"Three times as good eh? I'll be the judge of that.\" Trisha said. She took a bite and her eyes widened. \"THIS IS THE BEST THING I'VE EVER EATEN!!\" Trisha screamed.</span></div></div>",
            "created":1322370000,
            "id":1230155,
            "title":"New cookies"
        },
        "15111112111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Inside the house.",
                "Time passes"
            ],
            "content":"<div class=\"\"><div> <span>Lizzy and Tracy walked through the gate on the side of the house to the pool. Tracy carried her new girth on all of her body, making her look \"fluffy\" in her bikini. Lizzy was starting to get a bit of a potbelly. Lizzy saw the crate. \"What is that?\" she asked. \"Larger and tastier cookies! Try some!\" Vanessa threw both of them two boxes. They both had a taste. Tracy had a large grin on her face and shoved handfuls of cookies in her mouth. Lizzy looked as she was going mad, practically inhaling all the cookies. All the girls giggled and ate the entire crate in minutes. When the crate was finished, they all layed on their backs while rubbing their soft, bulging bellies.<br>\r\nAfter some time, Vanessa's mom came out Vanessa's mom was gorgeous. She had the skin, body, and face of a woman in her mid 20s. With the addition of makeup, she looked even younger. She was wearing her bikini and holding a plate with a huge slice of chocolate pound cake and ice cream in one hand, with 3 boxes of cookies in the other. She was also chewing a Baby Ruth. After she swallowed her candy bar, She said, \"If you girls are still hungry, I bought some cupcakes, pound cake, and candy bars. There is also a ton of cookie crates in the cellar. Have as many as you girls want, just leave some for me!\" She said. She stuffed a forkfull of cake in her mouth afterwards. \"Hey mommy, why are you giving as all this yummy food?\" Vanessa asked. \"After eating some of the new cookies last week, I decided we needed more sugar and sweets in our diet.\" Her mom replied. Vanessa looked at her mom's belly. It looks as that her mom gained around 24 pounds in the course of a week.<br>\r\n\"Mommy, why is your tummy so soft and round?\" Vanessa said as she poked it. \"Why is YOUR tummy so round and soft?\" Her mom asked back while squeezing Vanessa's love handles. \"Go on inside and eat some sweets, you girls look absolutely starving!\" The girls went inside as Vanessa's mom continued to eat the abnormal amount of desserts.</span></div></div>",
            "created":1327122000,
            "id":1262744,
            "title":"Lizzy and Tracy arrived"
        },
        "151111121111":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "A week",
                "Two months"
            ],
            "content":"<div class=\"\"><div> <span>(When they went in side the house it was load with fatting,sugery,greasey,additive food every were cakes in the living room,ice cream of every flavor was in the restroom,mountains of candy of every brand in the dining room the table creaked that weight of it,rivers of 100% purest suger with cinnamon in the basement,and finally the crates in the cellar holding a ton's worth of the new cookies!) They girls were awstrake at the sight they were seeing and Vanessa said:Woah! Mommy when did you have the time to get and make all this? The others wondered the same thing but her mother said:The cookies gave me the energy I needed in fact eating them made me feel young again so dig in everyone! (And so the 4 kids and 1 mother when into a eatting frezzy and ate for a long time choice time).</span></div></div>",
            "created":1407906000,
            "id":1840977,
            "title":"Inside the house.the suger house!"
        },
        "1511111211112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "The girls wake up!",
                "A 5 week food coma later......."
            ],
            "content":"<div class=\"\"><div> <span>In the course of two months most of the food had been eaten and two fourths of the river had been drunk Vennisa was sleeping mouth open drinking the cinnamon.Lizzy was on her now HH breasts and sofa sized butt eating cake after cake.Trisha and Tracy had started a eating contest two monthes ago and showed no signs of stoping.Mrs.Sage was laying on the floor in a food coma and had grown a lot her breasts were KK and her butt was as big as three sofas her stomach was stone hard and stood 3 feet in the air her cheeks where 10 in.long and wide plus her thighs were touching 3 feet in length when the food ran out..... </span></div></div>",
            "created":1411275600,
            "id":1859662,
            "title":"Two months"
        },
        "151111121112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "1 day",
                "1 Week"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much time passes?</span></div></span></div>",
            "created":1327726800,
            "id":1267404,
            "title":"Time passes"
        },
        "1511111211121":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Vanessa Encourages her mom to eat more",
                "The girls go upstairs"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa woke up to quite a sight late in the morning. Dried chocolate and whipped cream covered her face, she was laying on the carpet, and an large amounts of half-eaten desserts were everywhere. Vanessa remembered that her friends stayed for dinner and slept over. They had an insane amount of sweets while doing so.<br>\r\nVanessa looked down at her belly and was unsuprised at it's growth. Her muffin top became even more plump and continued to spill put of her shirt. She stood up, grabbed a candy bar and some cookies on the way out of the room.<br>\r\nShe walked into the kitchen and saw her mom making breakfast. Her mom grew aswell from her eating. Vanessa still didn't know why her mom was gorging on chocolate so much. In fact, Vanessa had no idea why her mom was being so nice and giving more sweets than Vanessa could ever want. Aside from the lack of knowledge of these changes. Vanessa liked her own increase of sweets consumed per day, and her mom's new look. She might even want to get her mom to be even fatter in the future(?). \"Hey mom.\" Vanessa said. She noticed that there were freshly baked pasteries, pies and cakes everywhere in the kitchen. \"Mom, how long have you been cooking?\" \"All night, dear. We ate all the good food last night.\" Lizzy walked into the kitchen, who said that she woke up in basement. Trisha walked in and said that she was unknowingly spooning Tracy in Vanessa's room. Tracy had no recolection of being spooned she explained as she walked in.<br>\r\nHer mom served all of them some cake and candy for breakfast. Vanessa, her mom, and the others dug in. Although they were still somewhat full from the binge the previous night, they still still ended up coming back for seconds, thirds, fourths, and fourths and one half because of the tasty and addictive taste of sugar. They all moaned and rubbed their distended bellies when they finished. \"Ohhhhh, that was sooo good. It was even better than the last cake I had.\" Vanessa's mom said while patting her own belly.</span></div></div>",
            "created":1327899600,
            "id":1268267,
            "title":"1 day"
        },
        "15111112111211":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "When the girls left",
                "Time passes"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa brought a layered cake to the table. \"Mom, we don't have room in the fridge for all the yummy sweets you made.\" she said. \"Well I can try and eat some more.\" Vanessa's mom said. She started to dig into the rich cake. As she dug deeper and deeper into the cake, her clothes got tighter and tighter. \"c'mon mom, one more bite!\" Vanessa said. Vanessa's mom put the last piece of cake in her mouth and.... 'TING!' The button from her jeans flew off and her belly escaped out of her zipper. \"Wow mom, you sure are getting really soft and squishy.\" Vanessa said. \"Just more of me to love.\" Mrs. Sage giggled. The girls went to Vanessa's room when they were finished.<br>\r\n\"Wow, your mom sure is getting chubby.\" Tracy stated. \"Why did you give her more when she was full?\" Trisha asked. \"I dunno. I guess I like seeing my mom get fatter.\" Vanessa replied. \"I'm not sure why my mom is eating so much, she is usually concerned about weight. So do you guys want cookies?\" \"Yeah!\" everyone said at once.</span></div></div>",
            "created":1328504400,
            "id":1271782,
            "title":"Vanessa Encourages her mom to eat more"
        },
        "151111121112111":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Get a maid",
                "Relax more"
            ],
            "content":"<div class=\"\"><div> <span>When the girls left Vanessa's mom was cleaning up the mess that they all made the previous night. It wasn't easy since she was out of shape. As she was sweeping up the living room, she was out of breath and fell over on the sofa and ate a candy bar to regain energy. \"*huff* this isn't as easy as it was before I discovered good food. There must be some way to combat this...\"</span></div></div>",
            "created":1328504400,
            "id":1271785,
            "title":"When the girls left"
        },
        "1511111211121111":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Skinny",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of maid?</span></div></span></div>",
            "created":1444194000,
            "id":2044808,
            "title":"Get a maid"
        },
        "15111112111211112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Penniless pregnant woman",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this?</span></div></span></div>",
            "created":1444194000,
            "id":2044810,
            "title":"Next"
        },
        "151111121112111122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Infinite suger Rush girl",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This then my friends?</span></div></span></div>",
            "created":1444194000,
            "id":2044811,
            "title":"Next"
        },
        "1511111211121111222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about if you had twin maids?</span></div></span></div>",
            "created":1444194000,
            "id":2044813,
            "title":"Next"
        },
        "15111112111211112222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of the schools teachers?</span></div></span></div>",
            "created":1444194000,
            "id":2044814,
            "title":"Next"
        },
        "151111121112111122222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Genius",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Genius Maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118840,
            "title":"Next"
        },
        "1511111211121111222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Nurse",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A nurse maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118842,
            "title":"next"
        },
        "15111112111211112222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Otaku",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An Otaku maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118843,
            "title":"next"
        },
        "151111121112111122222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Sumo",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A sumo maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118845,
            "title":"next"
        },
        "1511111211121111222222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Former Model",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Former Model maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118846,
            "title":"next"
        },
        "15111112111211112222222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Anthro",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An Anthro maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118847,
            "title":"next"
        },
        "151111121112111122222222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Chocolate maker",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Chocolate maker maid?</span></div></span></div>",
            "created":1458190800,
            "id":2118848,
            "title":"next"
        },
        "1511111211121111222222222222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Daven Port",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If it is ok a maid from Daven Port?</span></div></span></div>",
            "created":1458190800,
            "id":2118849,
            "title":"next"
        },
        "1511111211121112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "With the girls...."
            ],
            "content":"<div class=\"\"><div> <span>I think I huff need to puff rest more to huff huff get more energy and falls asleep the food she had ate begin to spread around her body some of it went to her butt and and grow 3 inches in width and some in her legs make them 1foot from rubbing to getter and and the rest of it went into her breasts making them a size EE meanwhile.....<br>\r\n<br>\r\n</span></div></div>",
            "created":1407906000,
            "id":1840978,
            "title":"Relax more"
        },
        "15111112111211121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "They gaining weight 2x as fast!",
                "You chose."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>GLUP!!!Ahhhhh that hit the spot!(They have cookies like mad they where on there 10th box when something?)</span></div></span></div>",
            "created":1414990800,
            "id":1881174,
            "title":"With the girls...."
        },
        "151111121112111211":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Next girl scout meeting",
                "Total metabolism shutdown 30x the normal gain."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(Normaly one cookie gives 5 pounds but the girls metabolism was slowly degrading so they gained weight easier so on with the fic!) RIPPP!!!! The girls jeans all spelt at the same time but they did not care and continued to eat...</span></div></span></div>",
            "created":1415336400,
            "id":1882757,
            "title":"They gaining weight 2x as fast!"
        },
        "151111121112111212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "sugar rush",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how about this?</span></div></span></div>",
            "created":1440565200,
            "id":2025827,
            "title":"You chose."
        },
        "1511111211121112122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "muscle growth",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this than?</span></div></span></div>",
            "created":1442811600,
            "id":2037894,
            "title":"MUSCLE"
        },
        "15111112111211121222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "pregnant ",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This then my friends?</span></div></span></div>",
            "created":1443502800,
            "id":2041401,
            "title":"next"
        },
        "151111121112111212222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Brain junk food!",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about they make you get smarter?</span></div></span></div>",
            "created":1458104400,
            "id":2118400,
            "title":"next"
        },
        "1511111211121112122222":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "breast expansion",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>breast expansion?</span></div></span></div>",
            "created":1484370000,
            "id":2263447,
            "title":"next"
        },
        "151111121112112":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Wensday",
                "Friday"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Skip to which weekday?</span></div></span></div>",
            "created":1334206800,
            "id":1313757,
            "title":"Time passes"
        },
        "1511111211121121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "The big eatathon where the winner becomes leader or stays leader.",
                "Special event."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What special activity was planned for the girl scouts?<br>\r\n</span></div></span></div>",
            "created":1410843600,
            "id":1857747,
            "title":"Wensday"
        },
        "15111112111211212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "4 weeks later",
                "9 monthes later"
            ],
            "content":"<div class=\"\"><div> <span>A truck driver had read the address wrong as to where he should drop of his shipment of suger, cinnamon, coffee,and chocolate and drop it off at the sages residents and left. By the time the girls got there mrs.sage was in a MEGA suger rush eating one or drinking one of each and said HeysweetyhowwasyourdayminewasgreatIhavebeeneattingthispileofsugerytandcaffinefue ledgoodniesnowwhatareyoujuststandingaroundfor(Breathe)dig in.</span></div></div>",
            "created":1410843600,
            "id":1857753,
            "title":"Special event."
        },
        "151111121112112121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "10 months later.",
                "3 years later"
            ],
            "content":"<div class=\"\"><div> <span>Into the first week the sugar had put them into a MEGA suger rush as well and they showed no sign of stopping they had limitless energy and it would never run out later into the forth week they where shacking with energy because they could not get rid of any of it and where still eating/drinking the caffeine,sugar mix it the shipment finally was empty about... </span></div></div>",
            "created":1412571600,
            "id":1867752,
            "title":"4 weeks later"
        },
        "1511111211121121212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "The young heads are feeded suger and coffie everyday to keep there energy up!",
                "With their mother and neighbors....."
            ],
            "content":"<div class=\"\"><div> <span>After awhile the supplies ran out but the same guy from 2 weeks ago brought another shipment and left and cycle continueed for 3 years and every shipment made them even more hyper neighbors joined in at the 2nd month and got hyper to eatting drinking like mad and this whent on for 3 years and by that time the girls with unlimited energy maded it to college and took over the cookie factory and became the bosses in only 2 seconds later on...</span></div></div>",
            "created":1417237200,
            "id":1895509,
            "title":"3 years later"
        },
        "1511111211121122":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Slumber party",
                "Selling day"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What special activity was planned for the girl scouts?</span></div></span></div>",
            "created":1334206800,
            "id":1313759,
            "title":"Friday"
        },
        "15111112111211221":{
            "choices":[
                "Lunch",
                "Swimming and Snacking"
            ],
            "content":"<div class=\"\"><div> <span>Vanessa's mom had once again agreed to host the girls over for lunch, dinner, swimming, snacking, and even a sleepover to end the night. Lizzy, Tracy and Trisha all arrived in their bikinis ready to swim. As the girls walked into the house, Vanessa's mom could really see all of the pounds that had been added to the girls' frames. Each of the girls seemed to be about the same weight, up about 50 pounds each, and each were nearly busting out of their bikinis. Each of their new bellies hung over the fronts of their bottoms and their butts seemed ready to burst their bottoms at any moment. Even the girls' faces had plumped up showing clear double chins on all of them. Also, even at such a young age, they had very sizeable boobs and to Vanessa's mom's guess, they were about a C cup.<br>\r\n<br>\r\n\"Hello girls,\" Vanessa's mom said, \"Are you girls ready for a great day.\"<br>\r\n\"Yeah we are,\" they answered, \"Where's Vanessa?\"<br>\r\n\"Oh she's just upstairs getting dressed, she'll be down in a moment,\" Vanessa's mom answered.<br>\r\n\"MOM!\" Vanessa yelled from upstairs, \"I need your help with something.\"<br>\r\n\"One second dear,\" she answered.<br>\r\n<br>\r\nVanessa's mom walked up the stairs to her daughters room. She knocked on the door to see what was wrong.<br>\r\n\"Hey Vanessa, what's up?\" Vanessa's mom asked.<br>\r\n\"Well, uh mom... I just ripped my new bikini and I have nothing to wear to the pool.\"<br>\r\n\"Oh that's ok, Vanessa's mom said, I'll just get you one of my old one's for you to wear.\" Vanessa's mom said. \"You're just a growing girl, that's it.\"<br>\r\n\"You're the best, mom.\" Vanessa answered. <br>\r\n<br>\r\n'Vanessa's mom walked into thinking about how Vanessa managed to rip her bikini. \"I just bought that for her 3 days ago, how is it already too small?\" she thought. \"I don't know if I have anything that will fit her.\" Vanessa's mom dug through her closet and managed to find a really big 2 piece swimsuit that she wore during her more hefty days in the past. She walked back to Vanessa's room and handed her the bikini around the door.<br>\r\n<br>\r\n\"Here you go sweety.\" Vanessa's mom said<br>\r\n\"Thanks mom.\" Vanessa replied.<br>\r\n<br>\r\nVanessa's mom decided to stand outside the door and wait for her daughter. She heard Vanessa struggle a little bit but she seemed fine.<br>\r\n\"It's perfect,\" Vanessa said as she walked to the door.\"<br>\r\n\"Great let me see my beautiful daughter.\" Vanessa's mom answered.<br>\r\nVanessa walked out the door and her mom was shocked at what she saw. The bikini looked to be very tight meaning Vanessa was fatter than she had ever been herself. Vanessa's mom had peaked at 210 and was only 2 inches taller than Vanessa which meant Vanessa was probably past 200.<br>\r\n<br>\r\n\"You look great Vanessa.\" she said<br>\r\n\"Thanks, I feel great too.\" Vanessa answered.<br>\r\n<br>\r\nVanessa's mom was first to walk down the stairs back to Tract, Trisha and Lizzy. They saw all of Vanessa's mom's new weight jiggle up and down as she came down, but were even more shocked when they saw Vanessa. She came down the stairs making a loud thump with every step and with a bikini on, they could see every inch of her fat. She looked to have gained 20 plus pounds in just a week. Her belly was easily the biggest of the group as it nearly covered her entire bikini bottoms. Also her boobs and butt were clearly bigger than the other girls' and her bikini looked very tight on her.<br>\r\n<br>\r\n\"Hey girls Vanessa said, \"who's ready for lunch?\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1408338000,
            "id":1843590,
            "title":"Slumber party"
        },
        "151111121112112211":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "All of their swimsuits burst off of them.",
                "Drinking contest!"
            ],
            "content":"<div class=\"\"><div> <span>In sided the houses was soda...soda as far as the eye could see plus tons of sweets and sugar. Wendy and the girls went into eating the food and drinking gallon after gallon of different soda making their stomachs stretch abet after 2 hours of eating they hear a pop and saw that their tops had come off but didn't care much about and went back to eating.        </span></div></div>",
            "created":1420779600,
            "id":1915601,
            "title":"Lunch"
        },
        "1511111211121122112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "7 hours ",
                "3 weeks"
            ],
            "content":"<div class=\"\"><div> <span>One of the girls had the idea of a drinking contest and so they grabbed every single pint of soda and began drinking and drinking their stomachs swelled with gas the more they drank and showed no signs of stopping at this point they where at there 15 gallon of cola when Wendy went and drank 5 gallons of it all at once make her stomach expanded by 3 feet and so this went on for... <br>\r\n  </span></div></div>",
            "created":1421298000,
            "id":1918268,
            "title":"Drinking contest!"
        },
        "15111112111211221121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Burp to see who wins",
                "Get more soda more room with navels out don't wast it!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There bodies where near the brim with gas but they keeped on drinking the soda there stomachs where feeling tight then \"POP\" there navels all came out of there stomachs increasing the capacity of the soda when they ran out....</span></div></span></div>",
            "created":1436590800,
            "id":2006644,
            "title":"7 hours "
        },
        "151111121112112211212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "It's a tie and they brake the world burping record ",
                "The sages win!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After going to the store they went right back to drink and with their navel popped they had more room and after 8 hours of drinking they had their fill of the sugary substance they decided to have a burping contest.</span></div></span></div>",
            "created":1437109200,
            "id":2009258,
            "title":"Get more soda more room with navels out don'..."
        },
        "151111121112112212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Vennessa wins(If there was any doubt!) ",
                "You pick who wins(make a other chose for different people please!) "
            ],
            "content":"<div class=\"\"><div> <span>Um..said Lizzy Before that how about we take a swim I brought cake and cola and some greasy pizza!They thought it was a great idea and went to the pool.(Vanessa was in a floater tube eating a box of pizza,Tracy was sunbathing and eating her third cake,Trisha was drinking her 6th bottle of cola and was getting ready to do a \"Burp Cannonball\",Mrs.Sage was eating pizza,cake,and drinking cola on her raft.)After awhile they besided to have a \"Burp Cannonball\"competition they would drink as many bottles of cola in the time of 2 hours and the winner would be fed until near bursting.(the competion begins!)    </span></div></div>",
            "created":1412571600,
            "id":1867753,
            "title":"Swimming and Snacking"
        },
        "1511111211121122121":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "A week later the girls make it a thing all girl scouts will do.",
                "2 hours into the feeding...."
            ],
            "content":"<div class=\"\"><div> <span>As the two hours were almost up Vennessa drank three bottles at the same time making her total cola count at 50 her belly was swishing and bubbles where growing bigger the biggest was 5 inches she went and drank 2 more and and than 2 more after that she was not stopping when time ran out Lizzy had drank 38,Tracy 46,Mrs.Sage 89,and Vennessa at a whopping 121 bottles! There stomachs and bodys where filled to their limit with cola but in the end Vennessa was victorious!</span></div></div>",
            "created":1416200400,
            "id":1888034,
            "title":"Vennessa wins(If there was any doubt!) "
        },
        "1511111211121122122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lizzy wins the contest</span></div></span></div>",
            "created":1436763600,
            "id":2007565,
            "title":"You pick who wins(make a other chose for differ..."
        },
        "15111112111211221222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Yes",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tracy Wins it all</span></div></span></div>",
            "created":1436763600,
            "id":2007566,
            "title":"Next"
        },
        "151111121112112212222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Yes",
                "Let's go into ties now"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mrs.sage is the Winner!</span></div></span></div>",
            "created":1436763600,
            "id":2007567,
            "title":"Next"
        },
        "15111112111212":{
            "content":"<div class=\"\"><div> <span>They all went to sit down and have some snacks. However, as they were going up the stairs, Tracy tripped, her new found bulk making it hard to keep her balance. She went toppling into Lizzy, sending them both tumbling down the stairs and landing in a tangled heap at the bottom with a horrific crunching sound. <br>\r\nVanessa gasped in horror, and adrenaline was released, pumping through her system and speeding up her heart rate. The poor organ, worn out long before its time by an unfortunate genetic condition, poor diet and excessive use, failed under the strain, and Vanessa fell forwards, scrabbling at her chest as icy blades of pain knifed their way through her. She fell forwards, down the stairs, landing on the other two girls with her full, rather excessive, weight, crushing bones and pulping internal organs. <br>\r\nHer mom, hearing their screams of pain, called an ambulance, but it wasn't enough, as all three were later announced dead, Vanessa of cardiac arrest and the other two of blunt physical wounds caused by their terrible fall. Vanessa's mother later committed suicide, devastated by what she had let her daughter become.</span></div></div>",
            "created":1387170000,
            "id":1708834,
            "title":"The girls go upstairs"
        },
        "1511111211122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "They were very thirsty.",
                "Ms. Sage had made a big breakfest."
            ],
            "content":"<div class=\"\"><div> <span>It was a whole week when they started  eating and it was paradise it was all fating and very additive greasy sugary goodness everyone had been eating nonstop all week by Saturday they were stuff to truthfully bursting  everyone had gained 200 pounds 250 for vennisa her once small frame had transformed into a huge one breast had grown into a size EE her butt was the size of 1/4 of the sofa and her belly's love handles had grown 4 inches everyone was the same but in smaller proportions. 5hours later.....<br>\r\n </span></div></div>",
            "created":1375074000,
            "id":1636597,
            "title":"1 Week at heaven"
        },
        "15111112111221":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "A pumpkin pie milkshake at is 50 ft tall and a 70ft tall whipped cream top.",
                "200 gaillons of ice cream and milk of all kinds."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They soon found that their throuths were very dry and they ask mrs.sage to make something to drink a little while later....</span></div></span></div>",
            "created":1381294800,
            "id":1676552,
            "title":"They were very thirsty."
        },
        "151111121112211":{
            "content":"<div class=\"\"><div> <span>In the meantime they all went to sit down and have some snacks. However, as they were going up the stairs, Tracy tripped, her new found bulk making it hard to keep her balance. She went toppling into Lizzy, sending them both tumbling down the stairs and landing in a tangled heap at the bottom with a horrific crunching sound. <br>\r\nVanessa gasped in horror, and adrenaline was released, pumping through her system and speeding up her heart rate. The poor organ, worn out long before its time by an unfortunate genetic condition, poor diet and excessive use, failed under the strain, and Vanessa fell forwards, scrabbling at her chest as icy blades of pain knifed their way through her. She fell forwards, down the stairs, landing on the other two girls with her full 320 pounds, crushing bones and pulping internal organs. <br>\r\nHer mom, hearing their screams of pain, called an ambulance, but it wasn't enough, as all three were later announced dead, Vanessa of cardiac arrest and the other two of blunt physical wounds caused by their terrible fall. Vanessa's mother later committed suicide, devastated by what she had let her daughter become.</span></div></div>",
            "created":1387170000,
            "id":1708817,
            "title":"A pumpkin pie milkshake..."
        },
        "151111121112212":{
            "content":"<div class=\"\"><div> <span>In the meantime they all went to sit down and have some snacks. However, as they were going up the stairs, Tracy tripped, her new found bulk making it hard to keep her balance. She went toppling into Lizzy, sending them both tumbling down the stairs and landing in a tangled heap at the bottom with a horrific crunching sound. <br>\r\nVanessa gasped in horror, and adrenaline was released, pumping through her system and speeding up her heart rate. The poor organ, worn out long before its time by an unfortunate genetic condition, poor diet and excessive use, failed under the strain, and Vanessa fell forwards, scrabbling at her chest as icy blades of pain knifed their way through her. She fell forwards, down the stairs, landing on the other two girls with her full 320 pounds, crushing bones and pulping internal organs. <br>\r\nHer mom, hearing their screams of pain, called an ambulance, but it wasn't enough, as all three were later announced dead, Vanessa of cardiac arrest and the other two of blunt physical wounds caused by their terrible fall. Vanessa's mother later committed suicide, devastated by what she had let her daughter become.</span></div></div>",
            "created":1387170000,
            "id":1708832,
            "title":"200 gaillons of ice cream and milk of all kinds."
        },
        "15111112111222":{
            "choices":[
                "Vennisa's realized something incredible.",
                "Something terrible..."
            ],
            "content":"<div class=\"\"><div> <span>Everyone went through to the kitchen to find a massive breakfast covering the table. Vennisa gasped in delight and waddled over to a reinforced chair. She eased her huge rear into it and started grabbing food and shoving it into her hungry mouth, desperate for sugar. Everyone else joined her and soon the food was disappearing at an incredible rate.<br>\r\nSuddenly Vennisa gasped, and the spoon dropped from her hand as though in slow motion, bouncing off the edge of the table and clattering to the floor. Everyone looked up, wiping grease from their faces.</span></div></div>",
            "created":1387170000,
            "id":1708701,
            "title":"A big breakfast."
        },
        "151111121112221":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "5 monthes",
                "1 and 1/2 years(Holy Sweet cream cakes that was a lot of suger!!!!!!"
            ],
            "content":"<div class=\"\"><div> <span>(W.N:Ok J will now explain what is going on before you head on in there umkay so here is the deal the extreme amounts of suger and other sugery sweets the body now has almost limitless energy in side giving them a heavy suger rush so now that you no on with the interative!)Vennisa's body had Begun to shack like crazy so was everyone else in the room was doing the same thing then Vennsia ran like a Cheetah all around the house.Lizzy began to talk an acre a minute eating a bag of suger to eternally keep going.Trisha and Tracy were somehow in a suger induced “heat\"(If you are a teen or an adult you will understand what I am writing here!)And starting doing things to each other moving on mrs.Sage was making food at the speed rainbow dash is at performing a sonic rainboom and it keeped being like this for...</span></div></div>",
            "created":1410066000,
            "id":1853833,
            "title":"Vennisa's realized something incredible."
        },
        "151111121112222":{
            "content":"<div class=\"\"><div> <span>Vanessa clutched her chest as a spikes of pain lanced through her, and she tipped of her chair, landing with a fleshy thud on the floor. People leaped to their feet, and Vanessa's mom screamed in horror. For Vanessa herself, however, the world was already turning to darkness as her ailing heart failed to pump blood to her brain. The last thing she saw was her mom's horrified face, looming above her, bleached of all color by the fatal cardiac arrest that claimed her life.</span></div></div>",
            "created":1387170000,
            "id":1708703,
            "title":"Something terrible..."
        },
        "1511111212":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "get something to eat",
                "relax on the water raft"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Trisha, Let's get in the pool.\" suggested Vanessa who grabbed Trisha by her soft chubby hand.<br>\r\n<br>\r\nThe two pudgy girls got into the pool immediately noticing how much more buoyant their bodies were.<br>\r\n<br>\r\n\"Oh wow! We can really float now, huh Trisha.\" Vanessa said.<br>\r\n<br>\r\n\"Giggle yea, looks like we won't need inner tubes.\" Trisha responded as she effortlessly floated on her fat back.<br>\r\n<br>\r\nThe girls continued to play with each other, splashing and touching each other. Vanessa enjoyed watching their flab bounce in their tight bikinis and loved squishing their bodies against each other.  Trisha found her extra weight satisfying as well, her soft flesh jiggling and wobbling provided her with amusement.  All of the jiggly flab filled Vanessa with the urge to fatten up her friends as well as herself. As Vanessa and Trisha played, Tracy and Lizzy arrived.<br>\r\n<br>\r\n\"We're here!\" yelled Tracy accompanied by Lizzy who was munching on some sugary candy just like all the pretty girls did.<br>\r\n<br>\r\nTracy was carrying a huge plate of brownies \"I brought these so we can have a snack for later.\" <br>\r\n<br>\r\n\"Alright those look yummy!\" Vanessa hollered. \"Now get in the pool!\"<br>\r\n<br>\r\nTracy and Lizzy removed their clothing, stripping down to their swimsuits. With each article of clothing removed, more flesh was exposed, manifesting their freshly formed fat. Far from the slim girls they previously were, both girls had grown into thick chunkers who became tired far easier than i the past.<br>\r\n<br>\r\n\"Gasp whew! That was tiring.\" wheezed Lizzy <br>\r\n<br>\r\n\"Gasp Yea I worked up a sweat. Getting in the pool is gonna feel so good.\" Tracy said.<br>\r\n<br>\r\nThe two hopped in the pool, raising the water level.  The strings on their bikinis were taut as their rolls gently crept over them.  Like a preditor, Vanessa swam over to Lizzy and wrapped her arms around her.<br>\r\n<br>\r\n\"Oh my Lizzy how pretty you are!\" Vanessa exclaimed hugging Lizzy's portly body.<br>\r\n<br>\r\n\"Well yea, I've been eating tons of sugar just like the pretty models.\" Lizzy stated finding Vanessa's embrace enjoyable.  <br>\r\n<br>\r\n\"Hey what do ya say we toss the beach ball around?\" Tracy suggested.<br>\r\n<br>\r\nThe girls responded positively and the commenced passing the ball around. The girls meaty arms jiggled as they hit the ball, their boobs and bellies bounced as they jumped, while their asses quaked under water. Each action drew more stress upon their swimsuits. Their extra weight induced an early fatigue in the girls causing them to....<br>\r\n<br>\r\n </span></div></div>",
            "created":1484456400,
            "id":2263807,
            "title":"They start playing"
        },
        "151111122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Next day for real",
                "Swimming and tons and tons of cookies and sweets"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(hey all Nightmare here to give you a news bulletin the cookies from here on will be fill with the powder from let them eat cake with was brought down for some dumb reason but anyway the powder will make the cookies more addictive and fatting)</span></div></span></div>",
            "created":1436763600,
            "id":2007579,
            "title":"News for you JABE!!!"
        },
        "1511112":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Find out that school is now full time cookie eatting",
                "At lunch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At school not much had changed on any of the girls but a few pounds in unnoticeable places.</span></div></span></div>",
            "created":1436763600,
            "id":2007571,
            "title":"The following school day"
        },
        "15111122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "All food is now fating & greasy",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened at lunch?</span></div></span></div>",
            "created":1444885200,
            "id":2047696,
            "title":"At lunch"
        },
        "151111221":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "fat is the new thin in the world",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why is this so?</span></div></span></div>",
            "created":1446613200,
            "id":2056782,
            "title":"All food is now fating & greasy"
        },
        "1511112212":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cookies changes principles mind on food &amp; health? </span></div></span></div>",
            "created":1446613200,
            "id":2056784,
            "title":"next"
        },
        "15111122122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A new law that states that all teachers and students to gain 50 pounds a day or that school will close?</span></div></span></div>",
            "created":1453179600,
            "id":2091398,
            "title":"A new law"
        },
        "151111221222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Burping and Farting are now reqired in school?</span></div></span></div>",
            "created":1453179600,
            "id":2091400,
            "title":"The Burp Fart Act is passed?"
        },
        "15112":{
            "author_id":"wgstories",
            "author_name":"Wgstories",
            "choices":[
                "Lizzy touches her belly",
                "Tracy touches her belly"
            ],
            "content":"<div class=\"\"><div> <span>\"If you feed me, I'll let you touch my belly!\" Vanessa said<br>\r\n<br>\r\n\"What are you talking about?\" Tracy asked<br>\r\n<br>\r\n\"My belly is really soft! Look!\" Vanessa explained<br>\r\n<br>\r\nShe pulled up her shirt. A pudgy belly was revealed.<br>\r\n<br>\r\n\"Touch it, but after that you have to feed me to touch it.\" Vanessa explained<br>\r\n<br>\r\nThe two girls were appalled, but were still curious. </span></div></div>",
            "created":1264482000,
            "id":826134,
            "title":"\"Feed me!\""
        },
        "151121":{
            "author_id":"sagepsypris",
            "author_name":"TheSage",
            "choices":[
                "Mom Walks in and catches them",
                "Vanessa get's force feed cookies"
            ],
            "content":"<div class=\"\"><div> <span>With hesitation Lizzy reached out to touch her friend's soft expanse of a belly.<br>\r\n<br>\r\n\"Oh,\" Lizzy blushed gently and with a shock \"wow so soft and squishy.\"  Her mind raced with the thought of what was happening to her.  Lizzy liked the feel of Vanessa's bulging, beautiful, belly; it shocked her to think about how much she liked it.<br>\r\n<br>\r\n\"Ya see it is fun, and soft,\" Vanessa smiled wide as she whispered.<br>\r\n<br>\r\n\"Yeah you're right, it is fun,\"  Lizzy's blush intensified as she took her free hand and placed a cookie in Vanessa's awaiting mouth.  She was having a moment where the only thing that mattered in this very moment was Vanessa and her growing gut.  Without looking over at Tracy she whispered \"go stand watch I need to stuff, this, little, piglet.\" Each word fell out of her mouth as if in slow motion.  Vanessa upon hearing those magic ear brightening words was nearly begging for this with her big doe eyes and her open mouth just waiting to be filled.  Not that it took long for Lizzy to kick in to gear and rip open a box of Thin mints and shoving them into her friends plump but extremely cute face.<br>\r\n<br>\r\n\"Wow look at her go,\" Tracy replied from the door way while watching the stuffing of her friend happen.  Two, three, four sugary treats at at time were shoved in to Vanessa's needy belly until the box was empty and caste aside and replaced with a full box of Tag-a-longs; which was also quickly dispatched into Vanessa's ever expanding gut.<br>\r\n<br>\r\n\"Wow you feed so well I'm loving it,\" Vanessa said between boxes.<br>\r\n<br>\r\n\"Yeah?\" Lizzy shoved more cookies into her friend's mouth slowly placing her free hand back on her friend's gut.  It was only slightly harder to push in sense before they started but from the look on Vanessa's face she wanted so much more,<br>\r\n<br>\r\n  </span></div></div>",
            "created":1482987600,
            "id":2255889,
            "title":"Lizzy touches her belly"
        },
        "1513":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Infinite Cookie dough dispenser",
                "reading the latest fashion magazine.  ",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she do?</span></div></span></div>",
            "created":1463547600,
            "id":2150042,
            "title":"Something else"
        },
        "152":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "You start wit one of the girls at home",
                "You start at daycare",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>There is a new daycare in town. A group of chubby girls have a desire to gain weight at daycare.<br>\r\n<br>\r\nSasha: A lovely girl with blond hair and glasses with extra weight around the middle that's trying to escape. She has big glasses that gave her a smart look. <br>\r\nShe is some sort of leader of the gang but she's not bossy. She let everyone speak and then the others normally wait until she decides what too do and mostly they do what she decide even when they have doubts about it.<br>\r\nSasha is normally a happy and open girl. When you see her you might think she's a bit shy but she's not. When you hurt her feelings she hide and does't speak for some time.<br>\r\n<br>\r\nKatja: Short black spiky hair and dark eyes. She's a bit chubby spread over her body. <br>\r\nShe is normally quiet and a bit shy and sometimes you not even notice she's around. She normally watches everything from a dark or high hiding spot.<br>\r\nShe does't talk that much but she can talk. She is not a retard she just don't like it too talk. She does't really care what people think about her <br>\r\n<br>\r\nDebbie: Has light brown hair. She wears it at one side short and at the other side long. She normally has a orange bow in her hair. She looks like a cute girlie girl in her shirt and skirt and a cute round belly that just poke out a bit between her shirt and skirt.<br>\r\nDebbie alway's offers help and is very friendly she does have two weaknesses. She has trouble sharing things (especially food), and she's addicted too hot dogs with a lot of mayonnaise, ketchup and mustard.<br>\r\nDebbie always has a subject too talk about and loves a good joke every now and then. She is very sensitive if somebody says something bad about her clothes or bow.<br>\r\n<br>\r\nChris (short for Christine): A girl with long blond hair and cap. Her extra weight is spread over her body but a bit more in the belly. She normally wears shirts and pants that you would suspect a boy too wear.<br>\r\nChris is also a open girl that loves a good adventure. She believes in one for all and all for one, no one is left behind and who does good who meets good.<br>\r\nChris likes it to have and doing games or play pretend or doing something adventures but can get pretty soon bored when nothing happens and then can get a bit annoying<br>\r\n<br>\r\nMary-Kate: This girl has brown hair till her shoulders and all her weight is in her thighs and butt and she loves it is there (even while her mother does't like they need to buy bigger pans so often) She often wears sweatpants or dresses.<br>\r\nMary -Kate is nice and confident, sometimes a bit too much and is also a bit cocky but mostly means it good.<br>\r\nMary-Kate loves it to see cartoons or be read books about cool or/and brave girls, She hates stories about girls who can't do anything then scream and get captured and just sit on their butt until a handsome boy saves them.<br>\r\n <br>\r\nNienke: A real fashion girl but surely no fashion doll. She has blond straight hair and looks a bit like an angel with her sweet smile and perfect white teeth but also her whole body is perfect and also almost perfect round. But she knows too always look very cool.<br>\r\nNienke is nice and always offer free fashion tips too anybody who wants it or (she thinks) need it. She's also a bit adventures and has a wide open mind<br>\r\nNienke loves it to play fashion show or trade clothes with her friends. Fashion is important to her and she can't bear to hear something bad about her clothes.<br>\r\n<br>\r\nCarrie. A huge girl with dark blond hair and only wear clothes that fit. She has a huge belly and arms wit rolls of fat just like her legs and huge butt and thighs. <br>\r\nShe's new at daycare. The reason for her huge weight is because her parents own a snack bar and every day she eats junk food and she loves junk food. She 's a real sweetheart but can be pretty though when she needs to be.<br>\r\nCarrie likes it to play or do games and listen too stories and watch cartoon or adventures.<br>\r\n<br>\r\nThese are the seven girls that want to gain. <br>\r\nOf course there are a lot more kids at the daycare like<br>\r\nMiranda: A mean girl who hates fat girls and always tease them and always has some hanger on's.<br>\r\nA girlie girl club.<br>\r\nA trio boys with lame stunts and even lamer jokes. <br>\r\nThe sportive club.<br>\r\nThe snobby popular kids club<br>\r\nAnd a lot of other kids.<br>\r\n<br>\r\n </span></div></div>",
            "created":1265346000,
            "id":831021,
            "title":"The gainer group"
        },
        "154":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Teachers",
                "Parents",
                "Other students"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will fatten up the girls?</span></div></span></div>",
            "created":1343797200,
            "id":1395083,
            "title":"Fatteners "
        },
        "1542":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "the  mothers discuss the changes",
                "the girls notice",
                "the boys notice"
            ],
            "content":"<div class=\"\"><div> <span>After watching yet another story on the news about a cute young girl getting kidnapped, concerned parents felt obligated to do something. Worried mothers called one another expressing their fear of their daughter being abducted. Each phone call was the same, \"Did you hear another adorable girl went missing?\" \"It happened again another girl was taken while playing outside.\" \"Its always the pretty girls that get taken.\" were among some of the common verses. However one mother came up with an unusual proposal.<br>\r\n<br>\r\n\"What if we fattened all of the pretty girls?\" pondered a mother.<br>\r\n<br>\r\n\"What, fatten our own girls? Are you mad?!\" replied a skeptical mom.<br>\r\n<br>\r\n\"No really, think about it, if the girls are fat, they won't have the urge to go outside and play making them vulnerable to abduction.\" reasoned the mother. \"And since its always the prettier girls getting target, we'll spend extra effort on fattening them up.\"<br>\r\n<br>\r\n\"The other girls would copy the pretty girls...\" a mom rationalized the theory.<br>\r\n<br>\r\n\"That's brilliant! We'll feed the girls tons of food, fattening them up, thwart their urge for outdoor activities and have them stay home and safe.\" explained a mother.<br>\r\n<br>\r\nThe women all consented to the idea and implemented it immediately. The girls found what would transpire next to be bizarre. Each girl woke up to be greeted with a huge breakfast, a huge stack of waffles drenched in syrup, bacon, and heavily buttered toast. The young girls struggled to eat it all but the concerned mothers forced it upon them. The girls left for school with bulging bellies filled with food only to return home for another feast. Some moms made the meals others picked up fast food which they consumed while watching tv, which the women fiercely encouraged to be watched. The prettier girls received very large portions of food, girls with milky skin, big eyes, and long flowing hair. As this routine was practiced the girl abduction dropped to zero, all the while the slim girls plumped up.<br>\r\n </span></div></div>",
            "created":1477803600,
            "id":2230502,
            "title":"Parents"
        },
        "15422":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Tells them that fat is beautiful",
                "convinces them that they're too thin"
            ],
            "content":"<div class=\"\"><div> <span>A month had already passed since the concerned mothers had implemented their plan onto their adorable daughters. Girls who would once have been frolicking outside, skipping rope, hop scotch, summer saults, dancing, and running with the wind blowing through their long fine hair were now enclosed in the house safe from the lustful eyes of any predator. Foods of all sorts lavished the house. Pizza rolls were constantly supplied, sweets were frequently baked, snacks were always within reach. Indeed the mothers were devoted to keeping their pretty girls fat and safe. In fact, focusing so much attention on food had resulted in the worried moms gaining weight too.<br>\r\n<br>\r\n\"Hey mom can we go outside?\"<br>\r\n<br>\r\n\"Oh Lana, why don't you and your friends watch a movie, I just baked some pizza rolls.\" suggested the mother pulling out a hot baking sheet loaded with the fatty pizza rolls.<br>\r\n<br>\r\n\"Mooom! Me and my friends have been eating those all day!\" pouted Lana. \"We want to go outside.\"<br>\r\n<br>\r\n\"Well how bout I bake you and your friends some yummy cupcakes or perhaps you'd rather have cookies. I guess I could make both.\"<br>\r\n<br>\r\n\"But mom we're full!\" whined Lana.<br>\r\n<br>\r\n\"Oh nonsense you're all far too thin. You're all growing girls afterall.\" assured Lana's mother patting her daughter's belly.<br>\r\n<br>\r\nLana glared at her imposing mother.<br>\r\n<br>\r\n\"Tell ya what if you can get everyone to eat all the pizza rolls I'll take you to the mall tomorrow.\" <br>\r\n<br>\r\nLana's eyes lit up at her mother's proposal. <br>\r\n<br>\r\n\"Okay.\" Lana said taking the pizza rolls to her friends pleasing her mother.<br>\r\n<br>\r\n\"Hey girls!\" Lana called out \"We can't go out but we can watch a movie instead. And we got more yummy pizza rolls.\" Lana attempts to convince her friends to eat more so she could be rewarded with a trip to the mall.<br>\r\n<br>\r\nThe response was mixed some girls were full and tired of eating but some loved all the feasting. Lana's friends who were once svelte girls running around had plumped up, no longer possessing the vigor of their past skinny selves.  Her mother's persistent feedings had clearly affected Lana. A month earlier Lana was a thin active girl. Her long platinum blonde hair was familiar to the breeze of wind blowing through it. Her nimble body was agile and constantly expelling energy. Lana's days were quite active as were her friends. The youthful antics had kept their bodies petite. That came to an abrupt end with their mothers sternly discouraging them from going outside and feverishly pressured them with copious servings of food. <br>\r\n<br>\r\n\"Hey why do our moms keep making us eat so much?\" asked one girl grabbing a roll. <br>\r\n<br>\r\n\"I don't know, but at least the food's yummy.\" a girl answered as she chewed.<br>\r\n<br>\r\n\"Yeah but we're getting fat.\" said a girl declining the snack in favor of playing with her hair.<br>\r\n<br>\r\nThe room became silent as the girls stopped to inspect themselves. They grabbed their flab, pinched their rolls, even touched each other. Lana herself noticing how tight her tank top and skirt had become. Flab bulged out from her previously well fitting outfit. <br>\r\n<br>\r\n\"I made cookies!!!\" announced Lana's mom entering the room.<br>\r\n<br>\r\n\"Mom we're all fat!\" Lana yelled.<br>\r\n<br>\r\nThe mother didn't expect the girls to realize and than had to devise a plan to placate the girls.</span></div></div>",
            "created":1517634000,
            "id":2448838,
            "title":"the girls notice"
        },
        "154221":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Girls’ stomachs about to burst ",
                "Mothers keep their daughters ‘ stomachs full"
            ],
            "content":"<div class=\"\"><div> <span>Lana’s mom told the girls that being fat can be a beautiful and rewarding thing. She told them that in some cultures  girls are loved and pampered for being fat and considered beautiful.  She said girls are also rewarded.  The girls ask how are rewarded mom said girls are paid money for gaining weight. She told them that first each girl is weighed and paid what she weighs before getting fat and a certain amount each month for the weight she gains.  The girls got excited about that and Lana’s mom said would they like that the girls said yes. Lana’s mom called the other mothers and they agreed to pay the girls to get fat.</span></div></div>",
            "created":1563685200,
            "id":2690237,
            "title":"Tells them that fat is beautiful"
        },
        "1543":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "boys",
                "jealous girls",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So a group of cute girls gets fattened up by their classmates. Who are the classmates? <br>\r\n<br>\r\nboys who want soft fluffy girls in their class<br>\r\n<br>\r\njealous girls</span></div></span></div>",
            "created":1494046800,
            "id":2315631,
            "title":"Other students"
        },
        "155":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Continue to Monday"
            ],
            "content":"<div class=\"\"><div> <span>PTA meeting:<br>\r\n<br>\r\nSuperintendant: OK, our first big problem, we are bankrupt!<br>\r\nParents: What!!!<br>\r\nParent What will we do now!<br>\r\nParent: Do we just let them stay home and do nothing<br>\r\nParent: I get enough of my kids on the weekends!<br>\r\nSuperintendant: don't worry! I have a plan: there is a new snack corp in town that makes snacks for girls and they are looking for a sponser! And who wouldn't turn down an elementery school?<br>\r\n<br>\r\nContract day:<br>\r\nMan: OK, here is the deal, you serve our snack with every resess, four for every girl studant and you get an income of $10,000 a month<br>\r\nSuperintendant: Deal but what is the snack?<br>\r\nLady: It is a cupcake the size of two human heads.<br>\r\nSuperintendant: Are they at least healthy?<br>\r\nLady: that is not our problem<br>\r\nSuperintendant: Well, fine</span></div></div>",
            "created":1260939600,
            "id":806344,
            "title":"New snack"
        },
        "1551":{
            "choices":[
                "Keep eating",
                "Go home",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>All the girls were playing during recess. A teacher came out.<br>\r\n<br>\r\nTeacher: Okay girls. Eat these! The amount of snacks is unlimited. Eat as much as you like.<br>\r\n<br>\r\nGirl: They look so good.<br>\r\n<br>\r\nThe girls grouped around the huge cupcakes. After one bite, the girls became hooked.<br>\r\n<br>\r\nGirls grabbed as many as they could and ate as fast as they could. After 5, all the girls were very fat. But not full.<br>\r\n<br>\r\nGirl: These are so yummy<br>\r\nGirl2: Look how fat we are!<br>\r\n<br>\r\nAll the girls like their fat. They began playing with their bellies.</span></div></div>",
            "created":1282798800,
            "id":944778,
            "title":"Continue to Monday"
        },
        "15511":{
            "choices":[
                "Cry",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They kept eating. The girls never got full. They were so fat that they had to crawl to get more. Their bellies were like beanbags as they ate. Soon they grew so much that they were too fat to reach more.<br>\r\n<br>\r\nThey started to-</span></div></span></div>",
            "created":1288501200,
            "id":984403,
            "title":"Keep eating"
        },
        "155112":{
            "choices":[
                "The teacher began feeding them all by hand",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else happened?</span></div></span></div>",
            "created":1484197200,
            "id":2262755,
            "title":"something else"
        },
        "1551122":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Suzy 11 years old and has 44 DD boobs, blonde and is a girl scout",
                "Mandy 10 years old and has a butt almost as big as her moms and 36 C boobs",
                "Betty, 11 and has large 40 E boobs but she is lactating too. Latin girl",
                "Tammy, 10 and has a pear shaped body with 34 D boobs and plays soccer "
            ],
            "content":"<div class=\"\"><div> <span>They began gaining fat in areas most young little girls don't gain weight. They started developing breasts, not fatty man boob breasts but REAL breasts. As well as growing hips and butts too. With in one month of this program the little girls had huge boobs and no one at the school seemed to care as long as the 10 grand checks were coming in. <br>\r\n<br>\r\n(Follow one of the big boobed girls)</span></div></div>",
            "created":1535000400,
            "id":2538040,
            "title":"Something else."
        },
        "15511221":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Suzy shows up with her friends for a pool party, that weekend",
                "Suzy mom comes by to thank you.",
                "You post the video of her doing jumpingjacks",
                "Suzy comes by later that afternoon in a swimsuit."
            ],
            "content":"<div class=\"\"><div> <span>Suzy had swelled a lot fatter with the school cup cake snacks. She even had to have her girl scout uniform modified with her breast gain. Suzy walks up to your door and you happen to be drinking coffee looking out the window on a rare day off at what you think is a midget in a girl scout uniform eating cookies walking to your door. The doorbell rings you open it and you hear Suzy in a very young girls voice (but deepened by weight gain), \"Hi Mister I am with the G. Scouts and I am selling cookies for a trip. How many boxes do you want?\"<br>\r\n<br>\r\nYou look at her uniform and she has cleavage and the top is very revealing. You can't help but stare at her large boobs and you stammer. \"Oh gee uh sorry little girl I normally get the boxes at work from other parents selling them.\"<br>\r\n<br>\r\nSally sighs and starts to walk away and you think no but say it anyway. \"Uh little girl, maybe if you can do 10 jumping jacks in a row I will buy 5 boxes.\"<br>\r\n<br>\r\nSally spins around and smiles, \" 10 boxes and it is a deal!\"<br>\r\n<br>\r\nYou agree and get your phone and press video. Sally does the 10 most breast bouncing jumping jacks ever recorded. You buy 10 boxes of thin mints and tell her, \"Hey send more of your troop here and if you girls ever want to I have a pool that you can use anytime you like.<br>\r\n<br>\r\nSuzy thanks you and hugs you, you knelt down and her huge 44 DD boobs squished into your face. She waddles off with her boobs and butt.</span></div></div>",
            "created":1535000400,
            "id":2538056,
            "title":"Suzy 11 years old and has 44 DD boobs, blonde a..."
        },
        "15512":{
            "choices":[
                "keep her from school",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of the girls (Tracey) went home. She went to her mom and said hi.<br>\r\n<br>\r\nBut the mom was not happy. Her little girl had a HUGE belly now.</span></div></span></div>",
            "created":1313298000,
            "id":1168042,
            "title":"Go home"
        },
        "155122":{
            "author_id":"samman",
            "author_name":"Polish Warchief",
            "choices":[
                "Tracy's mom saw the teachers",
                "Tracy's mom liked the girl's new bellies"
            ],
            "content":"<div class=\"\"><div> <span>The following day, Tracy's mom went to investigate the school. While driving to school Tracy's mom noticed that Tracy was eating some of the snack that she was given yesterday.<br>\r\n<br>\r\nUpon arrival, there was much to see. All the girls who she knew have changed. A majority of the girls at school haven't gotton drastically fatter, but it was noticeable. Some of the girls have gotten much fatter and a few of the girls looked like they have gotten obese overnight (although they were fat to begin with). <br>\r\n<br>\r\nShe saw that all the girls were eating the same snack that Tracy was eating. </span></div></div>",
            "created":1313384400,
            "id":1168488,
            "title":"something else"
        },
        "15513":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Pink Yummy",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Let's try a different sponsor.<br>\r\n<br>\r\nThings had become dire for the school. Having drained all of their funds, they were desparate. Salvation came to the school in form of a mysterious corporation offering to pay off the school's expenses in exchange for serving their new product. It was a new yogurt that they had just concocted, \"Pink Yummy.\" It was a super sweet pink yogurt geared towards girls and the company wanted to test out its marketing strategy on the school's students. Destitute, the school obediently complied and shortly after the school started serving Pink Yummy.</span></div></div>",
            "created":1582218360,
            "id":2790159,
            "title":"Something else"
        },
        "155131":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "days later",
                "more vending machines are added"
            ],
            "content":"<div class=\"\"><div> <span>\"Wowww!\" <br>\r\n<br>\r\n\"So cool!\"<br>\r\n<br>\r\nThe girls found themselves standing in awe in front of a trendy looking vending machine serving the new yogurt. <br>\r\n<br>\r\n\"Pink Yummy...\"<br>\r\n<br>\r\n\"It looks so tasty!\" chirped an excited girl purchasing a cup.<br>\r\n<br>\r\nThe girl unabashedly inserted her quarter into the machine, anxious to try the product. The mechanics of the machine spun and produced a cooled cup of Pink Yummy. The girl was instantly surprised by the size of the cup, expecting less. The girl dipped her spoon into the yogurt and scooped a generous serving to her mouth. <br>\r\n<br>\r\nThe girl's eyes burst open. <br>\r\n<br>\r\n\"Wow! This is delicious!\" she rejoiced quickly shoveling the rest down her mouth. <br>\r\n<br>\r\nCurious, the other girls purchased the yogurt too. Each taking their first taste of Pink Yummy delivered them to tongue euphoria. Within an instant, every girl had scraped her cup clean and bought seconds. Then thirds...some even bought more.<br>\r\n<br>\r\nRIIIIIINNNNGGGG<br>\r\n<br>\r\nThe bell had rung and it was time for class to start.<br>\r\n<br>\r\n\"Aaawwwww\" the girls moaned in unison dragging themselves to class away from the vending machines.<br>\r\n<br>\r\nThe students filed in as usual, although there was something different about the girls. The girls were less attentive then usual. Squirming in the seats, eyes dashing back and forth to the clock. It was clear to the teacher that the girls were distracted. As class concluded, the girls swiftly dashed out of the room, rushing back to the Pink Yummy vending machines. Girls who had already eaten from the machines bought more and girls who had only heard of the yogurt tried it for the first time. Before the next class even started, every girl in school was in love with Pink Yummy.<br>\r\n<br>\r\nWith each bell the dejected girls trudged to class away from their new snack only to immediately return when class ended. This cycle repeated itself for the entire day.</span></div></div>",
            "created":1582219920,
            "id":2790173,
            "title":"Pink Yummy"
        }
    },
    "info":{
        "author_id":"samman",
        "author_name":"Polish Warchief",
        "brief_description":"Have a girl from kindergarden to fifth grade grow some thick love handles",
        "created":1260943200,
        "description":"<td align=\"left\" class=\"norm\">From the same author of middle school girl weight gain comes elementery school girl weight gain!<br>\r\n<br>\r\nIn this story you have a choise from many girls from kindergarden to fith grade gain weight!<br>\r\n<br>\r\nRules<br>\r\nNo in depth nudity-brief is aloud but don't be crude<br>\r\nNo sex<br>\r\nNo drugs<br>\r\nNo \"weight gain darts\"<br>\r\nNo guy weight gain<br>\r\nI would appreciate if there wasn't any immobility<br>\r\nIf a girl goes over 800 pounds start a new girl<br>\r\nNo magic<br>\r\nNo vore<br>\r\nGo easy on the farting</td>",
        "id":1627296,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582790760,
        "modified":1582790760,
        "pretty_title":"Elementery school girl weight gain!"
    }
}