{
    "chapters":{
        "1":{
            "author_id":"killjoy07",
            "author_name":"Kadoya",
            "choices":[
                "Smell my socks and then feet",
                "Worship my feet",
                "Worship me and my friends' feet (M'gann and Zatanna)",
                "Let me give you a footjob",
                "Watch helplessly as I tease you with my feet"
            ],
            "content":"<div class=\"\"><div> <span>You walk around the air vent, looking for any signs of suspicious activity. Ever since the Justice League had sent their Team to ruin an operation of the Shadows, someone had to get on the inside. \"I could really use some air.\" You say to yourself as you drop from your place. When you land, you look around and see that there's a girl with blonde hair and a green suit looking at you suspiciously. \" Who are you and how'd you get into the Cave?\" She asked. Obviously, you know who this is. \"Artemis.\" You rudely spit at her. The archer does not take this insult so lightly as she grabs you by the collar. \"I dare you to say that again.\" She threatens. You gulp and look around, first the room, and then, ooh, her feet. They look so beautiful! You think to yourself. Artemis takes notice and looks down. You gulp again as she chuckles. \"Okay, I know what you want. I see that you like my feet a lot.\" She teases. You shake your head no, but Artemis gives a girly laugh and shows you her soles. I've done it now. You curse to yourself in your mind. Artemis laughs and then hits you in the back of the head. \"Since you're about to fall unconscious and you like my sexy feet so much, I think, when you wake up, you should…\" she sadistically says before you fall unconscious...</span></div></div>",
            "created":1370839740,
            "id":1608298,
            "title":"Just got caught"
        },
        "11":{
            "author_id":"killjoy07",
            "author_name":"Kadoya",
            "choices":[
                "Kiss my Feet",
                "Lick my Feet",
                "Suck on my feet.",
                "Get my friends in here to help.",
                "Come clean and admit you have a Foot Fetish."
            ],
            "content":"<div class=\"\"><div> <span>As soon as you woke up, everything was a blur. You looked all around you to see that you were still in the same room you were in before.<br>\r\n<br>\r\n\"Had a nice nap?\"<br>\r\n<br>\r\nYou look up to see Artemis, grinning at you. \"No one can break in here and get away with it, you know.\" She sits down and smiles. \"I noticed you were blushing at bit at my feet.\" She says. \"Ah, I've never taken them off in a while, but I think I can make an exception to you.\"<br>\r\n<br>\r\nYou start to gulp as Artemis takes her shoes off, revealing white socks. She chuckles as she flexes her feet before putting them up to your face.<br>\r\n<br>\r\n\"Smell them.\" Artemis ordered.<br>\r\n<br>\r\n\"What?\" you ask.<br>\r\n<br>\r\n\"You heard me,\" Artemis says, waving her feet in front of your face. \"Smell 'em!\"<br>\r\n<br>\r\nYou start to inhale deeply into both socks. Artemis chuckles and playfully pulls back one of her feet, wiping her other one on your face. \"I bet you just love feet, don't you?\" she asks before taking away her foot and putting her other one in its place. You are forced to sniff it once again before Artemis grins.<br>\r\n<br>\r\n\"Can you handle this?\" Artemis asks. You try to get a good whiff of her feet, but she pulls back her feet and places them together, side by side. She chuckles and strokes her soles, making you envious. She chuckled and puts her socked feet back on yur face. You sniff away at them happily before Artemis groans lightly, obviously enjoying what she's doing to you. After a while, she pulls her feet away.<br>\r\n<br>\r\n\"Okay, that's enough,\" she says, starting to remove her socks. You gasp as she reveals her really sexy feet. She flexes her toes in your face before sitting on your knees. \"Now, sniff them!\" she orders.<br>\r\n<br>\r\nYou have no choice. You start to smell Artemis's feet as she spreads them all over your face. She eventually puts one foot over your mouth and the other by your nose, making you smell both feet.<br>\r\n<br>\r\nArtemis laughs at your predicament, letting out some built-up stress. You begin to feel sweat as she playfully waves her bare feet in front of your face. It's official now. You're in love with Artemis's feet! You try to grab her feet to smell them more, but you find that your hands are tied behind your back.<br>\r\n<br>\r\n\"I'm not letting you touch my feet unless I say so,\" Artemis says, wiggling a finger. \"Smell my feet, and don't stop unless I tell you to do, slave!\"<br>\r\n<br>\r\nYou are forced to smell in between Artemis's toes, getting a lot of toejam from them. She laughs and pinches your nose with her toes before moving onto the soles. These, you start to enjoy, but take it back after a strong odor comes from them. You attempt to turn away, but Artemis puts her feet around your neck, stopping you. You start to sniff the soles, which are really strong. You close your eyes and sniff and sniff again before Artemis plops both of her feet on top of your face. This was heaven to you. Artemis notices this and giggles, wiggling her toes in front of your face. She smiles as she sees your erection go up, and keeps one of her feet on your face while carefully caressing your manhood. You lean in and try smelling both feet again, to which Artemis complies by covering your nose with her feet. As her feet cover your face completely, she grabs a chair nearby and sits on it while forcing you onto your back. She starts to smother her feet against your face. All that sweat and strong odor gets to you as you feel the need to cum, but Artemis doesn't let you and wipes her feet all over your face, even getting you to sniff in between her toes again.<br>\r\n<br>\r\n\"I'm not going to let a Foot Pervert like you get away so easily, you know,\" Artemis says. \"You wanted my feet? You're going to get them!\" She exclaims, making you sniff in between her big toes. This serms like Paradise to you, but you try not to show it. Artemis keeps a firm grip on your face with her feet, forcing you to sniff more before she plants her feet right onto your face, not trying to give you a chance to get away. You inhale deeply, much to her pleasure. Artemis chuckles once again before she gets rid of her chair, placing you against a wall and pressing her feet against your face.<br>\r\n<br>\r\n\"You still like my feet?\" Artemis asks, holding both of her feet out in front of her and wiggling her toes. You can't resist them anymore and start to smell her bare feet like crazy. Artemis laughs as she presses one foot against your face while putting her sock back on another one. Using her socked foot and her bare foot, she has you smell both. They had such the cheesy smell to them, and the way she teased you with them had to be her way of saying she was as good as a goddess as they come. You close your eyes and take more deep breaths of her feet, eventually getting your face covered up once again. You now have the smell of Artemis's feet in your head forever and want more of it. All Artemis does to you is smother you with her soles.<br>\r\n<br>\r\n\"You're really amusing me,\" Artemis teases. \"I think it's time for you to...\"</span></div></div>",
            "created":1422053820,
            "id":1922063,
            "title":"Smell my socks and feet"
        },
        "111":{
            "author_id":"killjoy07",
            "author_name":"Kadoya",
            "choices":[
                "Suck on my Feet",
                "Lick my Feet",
                "Get a Footjob"
            ],
            "content":"<div class=\"\"><div> <span>\"K-Kiss them?\" You ask.<br>\r\n<br>\r\n\"Never kissed anyone before?\" Artemis asks playfully, caressing your manhood with her feet.<br>\r\n<br>\r\n\"I don't have to tell you.\" You spit.<br>\r\n<br>\r\n\"You don't have to,\" Artemis says playfully before putting her toes out in front of your face. \"You just have to kiss my feet… right now.\"<br>\r\n<br>\r\nYou look to Artemis's feet before she places her toes against your lips. You can't shake them off, and who knows what Artemis will do if you so much as dare to bite her feet. You give Artemis's toes a quick kiss before finding something out: you like it. Artemis puts her other foot against your lips, and you repeat the process. You continue to kiss her toes before kissing the rest of her feet. She moans lightly, showing how much she enjoys this as you try and free yourself. You don't want to be held back anymore, you want to go all out with her feet. Artemis continues to make you kiss her feet until she notices your hands moving.<br>\r\n<br>\r\n\"Oh, no you don't!\" Artemis exclaims, placing your feet on top of your crotch. You stop immediately, feeling an erection. You soon sweat as Artemis glares at you.<br>\r\n<br>\r\n\"If you don't like kissing my feet, you must really want them, badly,\" Artemis muses. \"I'll give you my feet to worship, but after trying to pull that stunt you're gonna...\"</span></div></div>",
            "created":1422165480,
            "id":1922842,
            "title":"Kiss my Feet"
        },
        "1111":{
            "author_id":"killjoy07",
            "author_name":"Kadoya",
            "choices":[
                "Lick my feet",
                "Worship my friends' feet",
                "Give you a footjob"
            ],
            "content":"<div class=\"\"><div> <span>\"What?! No!\" you say.<br>\r\n<br>\r\n\"Oh, yes!\" Artemis replies. \"Open up!\" You open your mouth allowing her to stick her left foot's toes inside. You are soon greeted by a taste and smell that together are probably worse than the taste of socks, or even Artemis's feet. You start to cough and gag before she puts her toes back into your mouth. \"Don't just sit there! Start sucking!\" Artemis demands while wiggling her toes inside your mouth.<br>\r\n<br>\r\nYou start to lick and suck her toes all the while Artemis laughs at you. \"I should have gotten the other girls. They would <i>love</i> this!\" she says. \"I can't believe my feet are actually in your mouth!\" she says.<br>\r\n<br>\r\n\"Like I have a choice...\" you manage to say.<br>\r\n<br>\r\nArtemis glares at you. \"What was that?\" she asks. She stops wiggling her toes before she places her other foot up to your face. Not managing to handle the smell, you open your mouth, allowing Artemis to put both of her feet into your mouth.<br>\r\n<br>\r\n\"You need to learn some respect,\" Artemis says before she starts to move her feet around. You feel your head turn as you try to get Artemis's feet out of your mouth. You are used to smelling her feet, but this? This was too much! \"After all, I could just take my sexy feet away from you, and you can never get the chance to worship them ever again.\" Artemis taunts, right as she takes her feet out of your mouth.<br>\r\n<br>\r\nArtemis continued to press you against the wall before she holds out her feet again, now wet from being inside of your mouth.<br>\r\n<br>\r\n\"Suck on it again,\" Artemis orders. \"Is that going to be a problem?\"<br>\r\n<br>\r\n\"No,\" you say nervously. You gulp before you start sucking on her toes. \"Mmm!\" you exclaimed, not able to take this anymore. Artemis grins at this and starts to make you suck the rest of her toes. You have no choice given the circumstances as you suck all of her toes. Artemis starts to smile at this and holds out her other foot while placing the foot you just sucked on her lap. You suck the same way you did with Artemis's foot from before, getting each toe nice and juicy.<br>\r\n<br>\r\n\"Well, I think you learned your lesson,\" Artemis teases. \"But with that stunt you tried to pull, I'm going to make you...\"</span></div></div>",
            "created":1430605500,
            "id":1972601,
            "title":"Suck on my Feet"
        },
        "114":{
            "author_id":"killjoy07",
            "author_name":"Kadoya",
            "choices":[
                "Miss Martian",
                "Zatanna",
                "Rocket"
            ],
            "content":"<div class=\"\"><div> <span>You really want to worship Artemis's feet more, but she pulls them away from you and playfully circles them in front of your face. \"You know I can't do this alone,\" Artemis teases as she starts tormenting you by taking one of her feet and smelling it. \"There are others. U just gave them a call. Who do you want?\" </span></div></div>",
            "created":1422164580,
            "id":1922838,
            "title":"Another girl to help."
        },
        "12":{
            "author_id":"dog457",
            "author_name":"Idk",
            "choices":[
                "Keep worshipping her feet",
                "Ask her out",
                "Smell her feet"
            ],
            "content":"<div class=\"\"><div> <span>You wake up in a strange hut, looking to see if There is anybody nearby. <br>\r\nYou see the sexy footed goddess, non other than Artemis, she has silver sandals on. <br>\r\nYou think to yourself “I thought that was just a dream and you didn’t see the sexy footed goddess”.<br>\r\nYou inch forward towards the goddess, She smiles at you.<br>\r\nYou can smell her sexy feet, you think to yourself “oh my god they smell so good”.<br>\r\nYou take three big whiffs, of the scent of her feet that are covering the whole room.<br>\r\nShe’s still smiling at you, she takes off her sandals slowly teasing you, your heart skips a beat.<br>\r\nShe puts her foot on your chest, you can just smell her delicious feet.<br>\r\nYou grab her foot and lick her sole starting from the bottom to the top. <br>\r\nRepeating the process for the other foot too.<br>\r\nShe moans as you hot saliva goes up and down her feet, You grab her right foot and start sucking on her big toe. <br>\r\nShe giggles as you suck her toes on her right foot one by one till they’re all soaked in saliva.<br>\r\nYou grab her left foot, and you start licking her sole bottom to top.<br>\r\nYou grab her other big toes and put it in your mouth, her toes and soles taste delicious!<br>\r\nYou suck her toes again one by one, ones both of her feet are soaked with saliva you.... can </span></div></div>",
            "created":1559790060,
            "id":2669497,
            "title":"Worship my feet"
        }
    },
    "info":{
        "author_id":"killjoy07",
        "author_name":"Kadoya",
        "brief_description":"Artemis Crock from \"Young Justice\" holds you captive and forces you to worship her feet!",
        "created":1326385980,
        "description":"<td align=\"left\" class=\"norm\">You are a spy sent by the government sent to spy on Artemis for information of her background, you get caught and are forced to Worship Her Feet!<br>\r\n<br>\r\nHere are the Rules:<br>\r\nNo Foot Rubs<br>\r\nNo Nudity<br>\r\nNo Blowjobs<br>\r\nNo Shrinking<br>\r\nNo tickling<br>\r\nIt can be any girl in Young Justice<br>\r\nJust feet, no other parts<br>\r\nThe character has a foot fetish<br>\r\nNo Deaths<br>\r\nNo Gore<br>\r\nHave Fun</td>",
        "id":1840074,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1559790060,
        "modified":1559790060,
        "pretty_title":"Artemis's Slave"
    }
}