{
    "chapters":{
        "1":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "He goes to the bathroom for a piss",
                "You later go to get some breakfast",
                "He sits on the couch and later calls you over",
                "He orders you to massage him",
                "You just go back to bed"
            ],
            "content":"<div class=\"\"><div> <span>You watch your mother and two younger sisters drive away from the window as you wish more than anything that you were there with them. You were dreading this weekend with your dad and his sadistic smelly schemes. What was it with him and making you suffer? He never lost a chance to torment you, especially since you turned 13. You knew it would only get worse with your mother gone. Suddenly, the all familiar smell hit you. It smelled of week-old sweat, and the odor of a silent fart. You slowly turn around and are terrified when you see your father standing right behind you, looking down at you, wearing nothing but white posers. Beyond his big, hairy pecs is his face, smiling down at you in a friendly manner, which you didn't trust at all.<br>\r\n<br>\r\n\"SO you ready for a fun packed week boy?!\" Your father says as he performed a short pec dance.<br>\r\n\"I've been waiting for this day, boy, I haven't showered in a while just for it?\" your father then lifts his arm, smelling his armpit \"Man, the smell of a real man after work!\"<br>\r\n<br>\r\n\"Come on dad can we just hang out this week? Please! I don't wanna spend the next week smelling like your ass!\" you say.<br>\r\n<br>\r\n\"Well this is going to be interesting isn't it?\" said your father quite menacingly.<br>\r\n<br>\r\nThe next thing you know, your father lifts you up in a firemans carry and drops you on your bed. He gets on his knees, his ass filling your field of view, and lowers his ass until it is just a milimeter from your nose.<br>\r\n\"A whole week, just me and you, boy!\" He gladly gloats,<br>\r\n\"Dad no! Please!\" you beg,<br>\r\nHe then lets out a long, powerful, and foul smelling fart right on your face. The hot wind eminating from his ass covers your face.<br>\r\n\"S-stop it,\" you state very softly, the sound of your face barely making a sound over his fart.<br>\r\nAs the foul gas continues to escape his manly rump, his ass lowers an inch, and the tip of your nose is now touching his butt crack as his gas walks right into your poor nostrils. As his ass begins to touch your lips, you moan in disgust, now tasting his gas as well.<br>\r\n<br>\r\nHe sighs with both relief and what seems to be pleasure, and gets off of you. You gasp for the clean oxygen, which still has some of your father's fart remnants lingering.<br>\r\n\"Why do you always have to do that to me?!\" you scream, \"What did I do?\"<br>\r\nYour father places a foot on you in a triumphant pose as you cough and cry from the stink and the embarrassment.<br>\r\n\"Get used to it, boy, because now that those weak, crybaby females are gone, I've got a lot in store for you, your nose, your mouth, and every inch of skin on your pathetic body!\" your father states as he laughs triumphantly while still stepping on you.</span></div></div>",
            "created":1358744400,
            "id":1513138,
            "title":"Beginning a foul vacation"
        },
        "11":{
            "choices":[
                "Dad makes his son drink his piss",
                "The friends arrive",
                "Dad tortures you with gas"
            ],
            "content":"<div class=\"\"><div> <span>As dad enters the bathroom right next to your room, he yells for you to come inside. You had never seen your dad piss before, but wonder what he wants. As you enter into the bathroom, all you see is your dad completely naked exposing his hairy chest, his hairy legs, his hairy, tan-lined butt, his enormous muscles, and his huge erected penis. He is hovering over the toilet when he calls you,<br>\r\n\"Son come here!\" You obey, but when you get closer he forces you down to the ground while looking up at his cock.<br>\r\nYou ask, \"What are you doing dad?\"<br>\r\n\"I said I had more in store for you this weekend, and I am going to let you taste my man piss.\" He arrogantly replied,<br>\r\nYou had never tasted piss before, but it wasn't the first time your father had bullied you like this, so you felt interested.<br>\r\nYour father is so horny and you actually start craving for his big pecker to be in your mouth. You lift your face up to your dad's penis and start rubbing his hairy legs.<br>\r\n\"Dad let me have it!\" and he sure did!<br>\r\nHis piss starts going all over you and as you open up your mouth to drink his piss, he inserted his big gigantic dick inside you, his son's, mouth. His piss tastes so good! Dad states that after you got done drinking his piss and sucking his dick you could smell his buff, foul ass where he had a taste of shit awaiting for his son to taste. In fact, what is in store for you? You have no idea! Unknowingly, Dad had actually invited his buddies over who would find you two in the bathroom doing all this stuff and literally, I would eat a lot of gas and urine that night!</span></div></div>",
            "created":1376283600,
            "id":1644896,
            "title":"He goes to the bathroom for a piss"
        },
        "12":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Get comfy with your father. That was kinda sexy",
                "Try to leave the house",
                "Get on his good side",
                "Confront him about his choice in discipline again",
                "You choose"
            ],
            "content":"<div class=\"\"><div> <span>About ten minutes past, and you walk up the courage to get some breakfast. You wonder how you're going to last for a whole week with your dad. There's no possible way you can ever outsmart him, and there's definetely no way you can even think of overpowering him.<br>\r\nYou walk into the kitchen and get out some froot loops and milk. Although you usually do it the other way around, you poor in the milk before the cereal. You turn on the tv, sit at the table, and before you can take your first bite, your father walks right in.<br>\r\n<br>\r\n\"Good morning, boy!\" he states,<br>\r\n\"M-morning,\" you reply, wondering if he's even going to bring up the situation this morning.<br>\r\nYour father is wearing a white buttoned shirt and khaki pants. He \"accidentally\" drops his cup next to you. Before you can even attempt to get it, he ends up to your right picking it up. You turn to your right as he bends down and end up seeing his hot rump right in your face (pic? sure, here ya go <a rel=\"nofollow\" href=\"http://images.wikia.com/fetishes/images/d/d2/Vlcsnap-2013-01-22-17h11m29s229.png\" target=\"_blank\">http://images.wikia.com/fetishes/images/...</a> ). Although you are afraid he might fart again, his butt stimulates you for some reason, and you continue to stare at it. Just as you are ready to turn away, afraid he might catch you, he states something that stimulates you even more,<br>\r\n\"Damn, that is SOME CRACK!!\" he yells, as he gets back up.<br>\r\nSurprised he didn't fart, you decide to be bold and blunt.<br>\r\n\"Dad, why do you always have to do stuff like this morning?\"<br>\r\n\"Hmm? Like what?\"<br>\r\n\"Like fart on me, and tea bag me, and stuff?\"<br>\r\nHe doesn't answer, and you are ready to persist, but then, he does something both odd and downright cruel.<br>\r\nHe places the lower inches or his ass into your cereal (just the dry part, so he does not get wet from the milk). He then lifts his left leg and lets out a loud, long trumpeting fart. The smell is horrendous and disgusts you. Your father then places his hand on your head and pets you while letting out a very comforted and sexual sigh.<br>\r\nYou feel very aggravated towards your father as he does so. He then walks off, patting his belly. Before you can say something like <i>\"See, like that!\"</i>, he opens his mouth first,<br>\r\n\"Go ahead and eat, boy.\" He states<br>\r\n\"What!? Dad, please don't make me!\"<br>\r\n\"Don't just waist it, boy! C'mon, it won't bite.\" He replies, still turned around, while scratching his right butt cheek.<br>\r\n\"B-but dad...\"<br>\r\n\"Now son, you know you're not getting out of this, now be a good boy and eat your breakfast.\"<br>\r\nYou know he is right. There is no way of getting out of this, especially not without a punishment, so you know what you have to do. You take a spoonful of cereal and eat it. Your father smiles in delight as you do so. He turns around to watch you. You can still taste the remnants of your dad's fart. As he watches you, he walks in a circle, as though ready to enforce discipline. But what did you do.<br>\r\n<br>\r\nAs you gulp down your second spoon of your flatulent-scented cereal, you get curious and turn around, sensing your father right behind you, feeling the air escape his nostrils. As you do so, you see something that shocks you and sends chills down your spine.<br>\r\nyour fathers large, stimulated, circumcised cock is revealed through his pants zipper.<br>\r\n\"you know, son, I'm not very pleased with your question\" he states with a serious look \"A good son of mine would take responsibility about his actions, and you dare question me?\"<br>\r\n\"D-d-d-dad, w-w-what are you...\"<br>\r\n\"Are you ready to recieve your punishment?\"<br>\r\n\"What!?\" you respond,<br>\r\n\"Give it a kiss.\" he states,<br>\r\n\"WHAT!?? You mean... you mean your...\"<br>\r\n\"Boy, you've clearly been lacking discipline, and I suppose you need reminder who's boss!\"<br>\r\n\"Dad, please!\" you yell,<br>\r\n\"Kiss your father NOW! And for taking so long, you get to kiss this manly rod of meat right on its tip.\"<br>\r\nYou look at your fathers dick, pointed directly at you. As you do so, your fathers stern look turns into a sadistic smile. You have no choice. You kiss your father's dick right on its pecker. He laughs softly as you do so. The kiss lasts for six seconds, you certainly don't want another punishment, so you pretty much force yourself.<br>\r\n\"Good boy\" he states, petting you on the head. He then turns around, bends over, and farts in your face. The wind slightly blows your hair, and smells awful.<br>\r\n\"It's good to be a man.\" He states as he leaves the kitchen.<br>\r\nOH GOD!! You don't know WHAT to do! What just happened?</span></div></div>",
            "created":1358830800,
            "id":1514359,
            "title":"Dad's odd punishment"
        },
        "121":{
            "author_id":"jadow",
            "author_name":"Jadow",
            "choices":[
                "Sleep. You know it's going to be a rough, but fun weekend.",
                "Forget sleep, under dad's ass is where I need to be.",
                "Wait around, remembering past torture."
            ],
            "content":"<div class=\"\"><div> <span>Despite the way he treated you, you look at him as he walks back to the sofa, especially his well toned ass. You want to be near his ass and under his control as soon as possible. You walk right next to him and sit right by him.<br>\r\n<br>\r\n\"What do you want?\" He asks in a stern tone.<br>\r\n\"I-I...\" you stutter.<br>\r\n\"What!?\" Your father repeats, becoming annoyed.<br>\r\n\"I-I want to be farted on again!\" You yelled.<br>\r\n<br>\r\nYour father is stunned by your response. At first he wanted to test how much you wanted to be farted on again, but now he has another idea.<br>\r\n\"Sure, son. I'll fart on you again.\"<br>\r\nYour eyes widen by the sound of that \"Oh thank you si-\", but you're interrupted by him once again.<br>\r\n\"But it'll not only be me. If you're going to embrace your new role, you might as well get a whiff from <b>ALL</b> of us.\" he stands up and smiles. He almost passes you, but he grabs the back of your head and pushes your nose deep in his ass, he lets out a grunt and a loud trumpeting fart comes your way. \"Just a small taste of what's to come.\" he states as he fans it in your direction. You sniff the pungent odor as if it was the best thing you smelled in your life.<br>\r\nHe gives a slight chuckle at you and starts punching in some numbers on the phone.<br>\r\n\"Hey, it's me. Yeah, listen here. My son wants to be farted on....No I'm serious, we better give him the best we can muster.\"<br>\r\nYou begin to walk towards him, and as soon as you stop, he reaches his hand out and touches your dick, which has become erect from the situation. He messages your dick head gently, like your opinion doesn't even matter in the situation. It feels really good, so much that you moan with pleasure.<br>\r\n\"Yeah the more the merrier, he wants to get farted on, so let's stink him up as much as we can. Also get some supplies. You know like....\"<br>\r\nAfter that he starts to say things in a hushed tone. You can't hear him over the TV. He starts to crack a smile.<br>\r\n\"All right in the mean time I guess I'll let him rest for a while. He's not getting much sleep this weekend.\"<br>\r\n<br>\r\nHe hangs up the phone and looks at you \"Well you can choose what you want to do while we wait.\"</span></div></div>",
            "created":1367470800,
            "id":1582680,
            "title":"Get comfy with your father. That was kinda sexy"
        },
        "1212":{
            "author_id":"threecyou",
            "author_name":"OctoBear",
            "choices":[
                "You remain as dad's cushion for the rest of the day.",
                "The doorbell rings; Dad's friends are here.",
                "Your dad gets another idea on how to torture you."
            ],
            "content":"<div class=\"\"><div> <span>“I just… want to be under your ass, Daddy!” You exclaim rather enthusiastically. He smirks at the suggestion, “You sure? You won’t be getting any fresh air for a while.” You nod. All you really need are your dad’s farts. He chuckles, “Alright, but don’t say I didn’t warn you, I’m feeling pretty gassy today.” He says, letting out a quick fart. He heads over to the couch and taps his hand against the cushion, motioning for you to lie down. Nervously, you head over and lay yourself down into position. Your dad stands up, “Take a deep breath boy. This’ll be the last clean air you’re gonna get for a while.”  You anxiously take a deep breath, right as dad places his muscular butt on his face and sits down, smothering you between his cheeks. As he wriggles around to get comfortable, he pauses for a moment, before letting out a booming, foul smelling fart right in front of your face. “Oh yeah, let the fun begin.” He smiles as he reclines. <br>\r\n<br>\r\nDad continues letting out loud, pungent farts in your face. They make your eyes water they smell so bad, but you’re loving every minute of being your dad’s seat cushion. You inhale deeply as he continues to fart, savoring the stench, an even opening your mouth to taste them through his stained briefs. You didn’t realize just how gassy your dad was! He just seems to let one rip every ten seconds, and they’re seriously some of the worst farts you’ve ever smelled from him. Your dick is getting hard as you continue to huff the pungent fumes. <br>\r\n<br>\r\nAs strange as it sounds, it’s actually rather relaxing under your dad’s huge, hairy, gas-spewing ass. You’ve never noticed before, but there’s something strangely nostalgic about his fart, and being between his warm, musky cheeks. He’s farted in your face so many times that, although you’ve never gotten fully used to the smell, you can’t help but admit that there’s just something calming about sniffing them. You start snorting harder and faster as dad just continues to rip fart after nasty fart without end. It’s paradise. Then after a particularly wet sounding fart, dad shifts in his seat, then briefly gets up, only to pull his briefs down and sit on your face bare-assed. “Sorry son, my crack kinda itches, mind scratching it for me while you’re down there?” He says sadistically. <br>\r\n<br>\r\nHis farts actually smell even worse now, if that’s possible. You can’t get enough, and suddenly just start licking your dad’s hole as he continues to fart in your face. “Mmph, yeah boy, just like that.” Wrapping your arms around your dad’s thick thighs, you continue to rim him, happily letting him fart straight into your mouth. As you lick him and suck up his farts, your dad suddenly notices your growing erection. With a smirk, he places his foot on your bulge and starts rubbing it with his big, sweaty feet, sending waves of pleasure through your body. His farts just seem to keep getting louder and smellier. His damp, sweaty ass is so warm, and the gas hitting your face is even warmer. You snuggle your face in as deep as you can go, loudly licking daddy’s hole as he continues to fart down your throat. His rubbing your dick just gets faster as you do so, undoing the top of your pants with his foot, freeing your erection, which he continues to work. <br>\r\n<br>\r\nYou can’t hold it anymore. Daddy’s flatulent ass on your face, combined with his jerking you off with his feet, make you feel like you’re going to explode in pleasure, until you finally start cumming, all over your daddy’s feet and legs, and your own stomach. As you do, dad lets out a massive 15-second long, earsplitting fart in your face. It’s the worst one you’ve smelled so far. It smells like sulfur mixed with rotten eggs, and the stench feels almost visible. You could swear it burned out your nose hairs. It’d make you throw up if it just weren’t so hot. You just know you’re going to smell just like it for a few days. Then, as if you thought it would get any better, your dad just laughs, “Phew, that was a long one, wasn’t it? Not nearly as smelly as it usually is though. Good thing the guys ain’t here yet, they’d be laughing their asses off over how weak that was.” You can’t believe that dad could possibly smell worse. That’s probably got to be the foulest fart you’ve ever smelled from him in all your time together. “For right now, let’s just consider that a teaser for what you’re gonna go through this week. It’ll be a lot worse than that.” You can scarcely imagine just how bad they usually smell if dad considers that ‘weak’. As you lay there dumbfounded, dad just resumes leaning back on your face, watching TV, and continuing to let out smaller, less pungent but strill rank, farts on your face. “Hey, my ass still itches by the way. I didn’t say you could stop runt. Keep licking, or I’ll go ahead and give you worse.” You gulp and continue rimming your dad while he moans sexually. “By the way, I hope your dick isn’t tired. My friends and I are gonna have lots of fun milking you dry, so don’t disappoint us.” You just nod as you continue licking your dad’s asshole, smothered in his thick, gassy, bubble butt as you dreamily consider what it’ll be like when his friends get here. <br>\r\n</span></div></div>",
            "created":1549811940,
            "id":2615560,
            "title":"Dad's Seat."
        },
        "1213":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Memories continue",
                "Just get back to the story"
            ],
            "content":"<div class=\"\"><div> <span><u>Edited and retold in more detail</u><br>\r\nOh man, you are filled with anticipation. You've always felt some sort of attraction towards your father, but you never knew he'd actually do something like this. You were so afraid that he'd spend the entire time bullying you and tormenting you with his gas, but damn, this big, matured, muscular man you call your father is about to relieve all your sexual fantasies. You should have seen this from so long ago. You go to your room, sit on your bed, and lay back, remembering all the things that should have made you think of this possible outcome.<br>\r\n-------------------<br>\r\nThe official torture began when you turned 7. Ever since then, this big, large father of yours has been taking every chance he got to fart on you. You remember one time where you were pleasently reading your book when suddenly, your father came in with his buddy, Dan, holding a video camera. Your dad told you to keep reading. While you read, Dan began recording what was going on. Your father stood above you as you layed down. He slightly bends over and slowly pulls down his well fitting gym pants, revealing his bare, buttocks, with slightly visible tanlines. He hits the book out of your hand and before you know it, he's sitting on your head. With you laying down, his manly ass practically engulfed your head. As you screamed, he let out a thunderous fart. Such a foul smelling, powerful fart, a fart you'll never forget. Patting his belly with pride, your father began to bounce a bit up and down on your head. The embarrassment you felt was amplified even more by the fact that Dan was recording the whole thing. Your father let out another fart in your ear before groaning with relief and getting back up. You remember looking up at your father and asking why he'd do this. He gave back a cocky, sadistic look that said \"Get used to it, kid\", and from then on, the torture just got worse.<br>\r\n-------------------<br>\r\nYou sit up, turn on your TV, but don't pay attention to it. You remember more of the past you endured.<br>\r\nIt's morning, you're 7 years old and you wanted breakfast. At the fridge, however, is your buff, well groomed father in his red bath robe. You walk up to the fridge and tell him,<br>\r\n\"Good morning dad!\" you tell him<br>\r\n\"Good morning, runt,\" he replies<br>\r\n\"I'm not a runt, daddy!\" you respond.<br>\r\nYou walk directly behind him and wait for him to finish. He bends down to get something from the lower levels of the fridge. His toned, robe-covered ass brushes up against your face. Seriously, your nose and lips are now touching his buttcrack with the only thing in between being his bath robe. You are about to yell, you take in a short breath to do so, and just as you do, out comes a huge hunk of your manly father's rancid gas, filling up your nose and mouth. Your yell of his name doesn't even make a sound over that huge fart. Your dad begins to shake his gloots in shere mockery of you before getting up and smiling. He chuckles at your reaction to the taste of his flatulence.<br>\r\n-------------------<br>\r\nYou remember back when you were 8, and Dad's friends were over. You wanted to set something to record on TiVo while they were watching the game. Big mistake. You were lucky your mom was home, but that didn't save you 100%. When you finished setting your cartoon to record, you turned around and your field of vision is nearly entirely cut off by Bill's hairy, fat muscle ass, mooning you in front of everyone. They laugh as you run to your room disgusted.<br>\r\n-------------------<br>\r\nAgain at 8, you remember having a fun day with your dad at a Chuck E. Cheese. While you were playing a  game with him, he asked you<br>\r\n\"Son, have you ever seen a grown man naked?\"<br>\r\nYou don't remember your response. What you do remember is that that night, he entered your room completely naked. He sat down and had a talk with you. He patted you on the back and kissed you on your lips. He then got up, making sure to fart in your face while doing so.<br>\r\n-------------------<br>\r\nAs a kid, you loved bubble baths, and loved taking them. Well, once Dad drank quite a lot of beer and had to take a wicked piss. Seeing you in the bathtub was far too much of an opportunity. He completely ignored the toilet, unzipped his pants, pulled down his underwear, and took an incredibly long, relieving piss on you and your bathwater. The girls weren't home, so you had to endure it. He leaned his head back and let out a sexy sigh of relief as he showered you with his urine.<br>\r\n\"Now this, hehee, this is some good ass parenting\" he stated as he shook his dick the necessary amount of times.<br>\r\nThat was the first time he ever urinated on you, and a week later, he did it again, and a few days after that, he and his friends all did it at once. Once, Dan was babysitting you for three hours after school for a week. Peeing on you was next to farting on you as his favorite form of interaction.<br>\r\n-------------------<br>\r\nAt 9, you used to play wrestling with your sister's dolls. Once, while Hoss was over, he caught you. He tricked you into \"play\" wrestling him, even taking off his shirt and pants, leaving him only in his underwear. Needless to say, agreeing to wrestle him was a huge mistake. He tricked you into a corner and gave you one hell of a bronco buster that lasted a whole minute. He then got up, slowly turned around, and gave you a 3 minute long, firm, gassy stinkface.<br>\r\n<br>\r\n<br>\r\nYup, these men loved nothing more than to make you stink. They got quite a good feeling out of it, especially your own father. But it was about to get much worse. When you were 10, you started getting regular erections and, well... your Dad certainly noticed...</span></div></div>",
            "created":1369630800,
            "id":1597523,
            "title":"Memories of foul man handling"
        },
        "12131":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "They arrive",
                "You and Dad have a \"talk\""
            ],
            "content":"<div class=\"\"><div> <span>When you were 10, you began getting regular erections, and boy did your father take advantage. You still have no idea how he even found out! Remember the same robe incident mentioned in the last chapter? Well it happened again, only with a slight alteration. Your father bent down, kneeled a bit so this buff, tall man's ass was face to face with your fully erect morning wood, and made sure his ass brushed your dick. Wearing the same bathrobe, he made sure that when he brushed it the very first time, your dick head would be slightly revealed through your boxers. He touched his butt to your dick, made sure your dick was in the correct position, all without you being able to stop him, as you thought he would get suspicious if you kept acting jumpy. His robed buttcrack brushed against the very tip of your hard wood as well as the staff of your dick, and he released a heavy, trumpeting fart right on the very tip of your penis. Such a heavy, offensive smell, you could feel the wind of gas hit your lower abdomen and testicles. The smell was terrible! you were disgusted, but you also noticed how good it felt to have that happen to you by someone so much bigger and stronger than you. your father patted his belly, turned around to look at you, and saw your horrified face and couldn't help but laugh.<br>\r\n<br>\r\nBut the worse, most scarring memory was when you were 11. That was the LAST time the females left on a girls only vacation. You were terrified back then too, to be left in the hands of your bully of a dad. And you remember everything, because who could forget such an experience? The second the girls left, your father grabbed your head, planted it firmly into his jean clad buttocks, and let out a huge, deep growler on your very face. The rumble of that fart was just as vigorous as the stench of the smell.<br>\r\nYou remember sitting on the couch after they left, and turning on the T.V., when your father came over. He looked sternally at you. You wandered what he seemed so mad at. Then suddenly, he kneeled over you on the couch. He then began tea bagging you.<br>\r\n\"Dad, what are you doing!?\" you yell<br>\r\n\"It's just me and you, boy, one whole week!\" he replied, \"Oh-h-hoo, you are in for it big, son, I've got you all to myself for seven whole days, and I decide, hehe, what i'm gonna do with you.\" his voice getting lower and more sadistic.<br>\r\nHe unzipped his pants and let out his musky, sweaty, meaty, manly dick and large, musky, hairy balls. You look at his penis, shocked, and he plants his dick and his sack on your face again. He continues to rub his groin on your face. The smell of manliness is unbearable,<br>\r\n\"You, my son, are in for the stink of a LIFETIME!! HA HA!\" he yelled with pride!<br>\r\n<br>\r\nTwo hours pass after he finishes, and Dan, Hoss, Bill and John were all here. And for the next week, you became their fart magnet. The first thing they did was force you to take off all of your clothes and lay down in your bed. They followed you and as you layed down, you feared what these men would do to you. They striped down to their underwear, all of them wearing white briefs. Your random erections went crazy at the moment, and the five of them gently sat on your small, 11-year-old body.<br>\r\n<br>\r\nBig John sat on your face, making sure your head was facing up and that his ass consumed your face. Next was Hoss, who sat on your belly and faced the opposite direction, putting him at eye contact with John, whom he would occasionally kiss while farting on you. Your father, sat on your very hard dick, not letting it go into his ass, but aligned it with his butt crack so he could have fun rubbing it while releasing his gas. Bill didn't have much room to work with, so he farted on your legs and arms when he felt like it and used your hands to massage his balls and scratch his buttocks, especially when it came to digging deep in his ass to get that great itch inside. Dan flipped between video taping the whole thing to farting on whatever inches of skin was left, bringing his stand to set the camera on. You father was the first to expel his gas, letting out a beefy fart right on your dick. This signaled the beginning. The five of them farted on you for a whole 20 minutes, sighing, groaning, and moaning with relief and pleasure as they released their dirty, noxious gas all over you, not stopping until you, a mere 11-year-old, ejaculated. The gas marinated into your skin, leaving you smelling like them not only for the rest of the week, but even a few days after your mom and sister came back. You could do nothing to stop them; you're just a kid, your dad, Dan, and Hoss are so muscular, and John and Bill, even then, had their large guts along with their muscle. You remember those muscle men, rubbing their butts on you and farting, and as incredibly foul as that was, it certainly wasn't the end.<br>\r\n<br>\r\nFor that week you became their fart magnet. Every time they needed to pass gas, they made sure you smelled it all. Any time their crotch itched, they were sure to give you a good, musky teabagging. Even worse, they made sure to stock up on many things that will make them fart either more or worse, and made sure either your face or lap were under somebody's ass while you were still conscious.<br>\r\n<br>\r\nDan, Bill and Hoss sometimes went easy on you, if you started to feel their muscles and worship their godly bodies, but only if they liked how you did it, if not they'd pin you down on your back. One of them would lower his ass (be it covered or bare) right on your face, burying your face deep in his ass, often making sure to land his rump on your open mouth, and the other would lower his buttocks on your crotch, gently comforting himself on your lap. The rest made sure you didn't turn your head away or close your mouth, and if you did you'd be punished with all of them farting on you for 10 minutes, smothering every inch of skin on your bare body.<br>\r\n<br>\r\nYour father, Bill, and John's favorite position for you was sitting down with your cock under their ass. Bill and John would make sure to get the smell of their ass on you by rubbing their asses on your hard dick all the while releasing their flatulence. Your father liked the feeling from the vibrations of your voice begging or mercy from under his ass as he ripped loud trumpeting farts on you. Of course, this is without mentioning the teabaggings he and the others would often give you.<br>\r\n<br>\r\nWhenever you ate, they made sure whatever food you had was given a heavy dose of gas to give it a \"kick\". Not a single meal went by without at least one of them giving it a good dosage of flatulence. Any time you went to sleep, one of them would enter your room, bend over with their ass only an inch from your face, and break wind. Any time you needed a drink, they'd make sure to dip their dicks in it, maybe even pee in it a little. And throughout all of this, you were absolutely FORBIDDEN of even thinking about taking a shower.<br>\r\n<br>\r\nAt the end of that week, you reeked of their gas and sweat. All you could taste was their ass and their urine. It took many showers and brushing to get the smell out. To this day, they still say they were going easy on you just because it was your first time. And now, they're here to do it all again WITHOUT holding back! Your dick throbs sensationally just thinking about it.</span></div></div>",
            "created":1369803600,
            "id":1599141,
            "title":"Memories continue, things get hotter"
        },
        "121311":{
            "author_id":"jadow",
            "author_name":"Jadow",
            "choices":[
                "Time to go and meet my tourmenters ",
                " On second thought maybe I should stay in my room"
            ],
            "content":"<div class=\"\"><div> <span>          Just as you finished reliving that moment, you hear the living room door opening. You quickly jumped up the sound of it and crept out just to get a long peek at your four muscular tormentors. <br>\r\n<br>\r\n          Dan and Bill are both state cops. They must have just got off their shift, cause they still have on their uniforms. Dan and Bill had on their tight fitting slacks and uniform shirts along with those shiny black motorcycle boots. While Bill's slacks had trouble fitting both his beer gut and muscular ass, Dan's slacks practically left noting to imagine when it came to his . Hoss and John looked like they just came from a long session at the gym. Hoss ,looking like modern-day Adonis, is wearing a white undershirt and red workout shorts. Your eyes were immediately focused on his enormous chest, but when he turned around your full attention was on godly ass. John, with a power lifter build has on a red shirt with the sleeves ripped off and that comes up a little due to his beer gut, and black workout trunks that couldn't contain his muscle thighs and giant ass.  All four are well over six feet tall. <br>\r\n <br>\r\n          Not only were these men beasts, but it was made even more dangerous due to the fact that you are presently at the mercy of your father, and these guys are all ready to make you stink for ages.</span></div></div>",
            "created":1373518800,
            "id":1626262,
            "title":"They arrive"
        },
        "1213111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Dad leaves them to play with you",
                "Dad decides to begin"
            ],
            "content":"<div class=\"\"><div> <span>You gulp, sigh, and begin to walk downstairs. Bill is the first to notice you, then Hoss, then Dan, then John. You already know your father knows you're coming down. The men stop conversing with themselves and bring their attention towards you. The top of your head barely reaches the middle of the valley between their pecs, you feel like you're going to faint out of the fear.<br>\r\n<br>\r\n“Well well, look at the little shrimp,” says Hoss. “How long have you been waiting up their with that stiff cock of yours?”<br>\r\nYou suddenly look down and notice the huge boner in your pants. <br>\r\n“Ahh, well look at you,” says your father, “I've raised such a lewd boy,” You don’t know whether to back up or creep forward, but you’re halfway down the stairs and frozen.<br>\r\n“What’s wrong, lil’ guy, you look frightened.” Says Bill. Realising this, I quickly come down and great them. What’ should I do?<br>\r\n<br>\r\n“Hmph, look at this thing,” John states again. He puts his hand on your dick head and starts massaging it. You quiver from both fear and pleasure, making the others laugh.<br>\r\n“The things you say and the things you do don’t really match, eh boy? Hoss states.<br>\r\nHe bumps you with his belly, now touching you. You feel the hairy gut rubbing against your mid chest as he has fun with your dick head. He bumps you with his belly again, and you back up. He continues to playfully bump you until you find yourself in a corner. Dan, John, and Hoss are surrounding you with little room you have.  Dan pets you on the head, John pesters you, and Hoss continues to rub your dick.<br>\r\n\"Y-y-you guys are such bullies!\" you raise your voice. They chuckle and begin to pester you even more. They always took that title as a compliment.<br>\r\n<br>\r\n“Don’t be rude, boy, say hello!” your father commands.<br>\r\nTerrified with the image of him taking your head off with a single flex, you're astounded as he pulls you into a one armed hug, softly, and to feel his fingers running through your hair, stroking you gently. When you finally open your clenched eyes, you see a bulging wall of fur covered muscle. You do as your father commands and give Hoss a hug. He returns the favor and you rub your cheek on his gut, enjoying the scent of a big, mean man fresh from the gym. A portion of his hairy gut is showing. You want to pick up his shirt a bit and bend down a little to hug it, but are too timid to do so.<br>\r\n<br>\r\nSuddenly, you hear a deep rumble from his guy. John gives off a bit of a strained look.<br>\r\n“Ha! Holdin’ it in all this time, big guy?” Your father says,<br>\r\n“Hahaha, you guys know, Big John ALWAYS comes prepared!” John gloats as he flexes his arm muscles.<br>\r\nYou are a little scared, but now even more lustful! You begin to rub his gut, making the big guy chuckle. You turn your head a bit and between the little room of vision you have outside of these men, you see that Bill is holding a few bags. Groceries? Just then…<br>\r\n</span></div></div>",
            "created":1373691600,
            "id":1627238,
            "title":"Time to go and meet your tourmenters "
        },
        "12131111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Smell his bried-clad ass",
                "Get tortured some more"
            ],
            "content":"<div class=\"\"><div> <span>Just as you notice, your Dad takes the groceries and leaves for the kitchen.<br>\r\n “As your host, I’ll prepare our meal.” Says your dad, “Stay here and enjoy yourselves, do whatever you want with him, but don't make the boy cum...” he walks over towards you and puts his hand on your shoulder, “…and boy, make sure these men are entertained.” He tells you with an evil grin.<br>\r\n<br>\r\nHe walks away, leaving you with the others. You quiver a bit, a little nervous. Suddenly, Bill places his hand on your shoulder. He looks at you with a smile that slowly turn evil as he lowers his hand towards your private area. Oh no...<br>\r\nHe gently grabs your dick before softly tapping it. He lets out an evil laugh. He walks up to you even closer, puffing out his chest.<br>\r\n\"Look at this thing, you seem pretty excited, boy\" he says, \"This just shows that you really like it rough...\"<br>\r\nHe then turns around, now with his strong, fat muscle ass planted on you, from your mid chest to your dick, as you are practically a foot shorter than him.<br>\r\n\"And nobody likes it rougher...than real men!' He gloats, placing your hands on his gut while placing his hands on your butt, shoving you into his own firm, large ass. He groans sadistically while slowly shaking his butt in a full 360 degree spin over and over again, bringing your body with it.<br>\r\n<br>\r\n\"Heh heh heh, yeah, bring it around town, eh boy!\" He states,<br>\r\n\"Please, just leave me alone, please...\" you cry,<br>\r\n\"Haha, what was that?\" He then moves back, pushing you further into the corner while he stops shaking and stands still, he lifts you a bit, his buttocks now pressed against your hard dick and lower abdomen. He lets out a huge, manly fart, groaning with pleasure. The smell hits you right in the face. It smells of broccoli and re-fried beans. What a horrendous fart! And right on your dick. The others laugh at you. He lets out another fart, but this one much more quiet, but still very long. He keeps you there for a bit to make the foul stench marinate into your skin. He then lets go of your smaller derriere and walks forward a bit.<br>\r\n<br>\r\n\"You really are something, kid. You've got a good father. He really knows how to put a kid like you in your place.\" He says. You blush, embarrassed. You then notice him unbuckle his belt and slowly pull down his pants, showing his buttocks in his great white briefs.<br>\r\n\"Now, I'll give you an option, either take a few good whiffs of this man's fine ass,\" he says, speaking in third person, \"...Or deal with this treatment without even my briefs!\"</span></div></div>",
            "created":1375765200,
            "id":1641519,
            "title":"Dad leaves them to play with you"
        },
        "121311111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Time to get tea bagged and drink Hoss' piss!",
                "Time to smell and lick some armpit!"
            ],
            "content":"<div class=\"\"><div> <span>Bill laughs, \"Alright, kid, better prepare that nose of yours!\" You bend down, ready to take it in. He laughs some more as he turns around.<br>\r\nYou look at Bill's fat-muscle ass. The perfect mounds encased in tight briefs. Your heart beats so fast as he inched closer. Your face is so close to this muscular adult's ass. Your nose begins to touch the layer of his briefs between his butt cheeks. He rubbed his butt up and down on your poor, defenseless nose. You move your face a few inches closer, your nose and lips now within his buttocks.<br>\r\n\"Now, go on!\" He orders. You do as commanded. You take in a deep breath and find yourself greatly aroused! You kiss his butt and continue to breathe in the foul beast's buttocks. The powerful odor of such manly butt. You had always been so aroused when your father had forced you to do this, but never let yourself show it. And now, here's his close friend, bill, just having fun torturing you with your sexual emotions. You are beyond horny when the unthinkable happened. just as you take another deep breathe, a loud deep fart rips out of his Bill's ass. You can't help but moan. Bill chuckles, and the others look at you kindly, proud of your bravery of showing your enjoyment, but you know they enjoy seeing you tortured by this as well. You are shaking...nervous but also very turned on. Sure enough another loud but shorter fart escapes. You feel it vibrate on your lips. You swallow his gas, and just as you are about to go crazy, Bill leans up and pulls back up his pants. He turns around and is proud to see you dazed with a big smile on your face.<br>\r\n\"Heh, you did well, kiddo!\" He says, patting you on the head. But your torture is yet to stop...<br>\r\n<br>\r\nAs you get up, Bill places his hand on your shoulder. He pats you on the back. As he does so, the other men center in, grouped together with you in the middle. You can smell the stink emanating from them, combining into a huge, musky force. The stink of armpit and groin fills the air, and you’re right at its source. Just then, Bill catches you in a head lock,</span></div></div>",
            "created":1375765200,
            "id":1641535,
            "title":"Smell Bill's brief-clad ass"
        },
        "1213111111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "John farts in your face",
                "They take you upstairs for John to fart in your face"
            ],
            "content":"<div class=\"\"><div> <span>“Hahaha, it’s been a while since you've smelled some good ‘ol uncle Bill, eh boy?” he laughs. His arm lock gets noticeably tighter, and the stink of armpit intensifies.  As he has you there, Dan centers in on your face, you are now face to face with his groin. The lack of air is now enough to bring you to tears. Bill lightens up, and you struggle to breathe. He lets off his head lock, but keeps you down. With the fact that you couldn't breathe earlier, you are now forced to breathe heavily the stench of Dan’s sweaty groin. He pulls you in, making you smell more and more of his balls. He opens his legs and begins rubbing his balls on your face. The disgusting sweat on his manhood is spread across your face, especially on your mouth. You feel his dick touch you a few times, and notice it getting harder. The men laugh evilly, watching Dan torture you. After two minutes of this, he lets off and the others give him a congratulatory tap to his back and butt.<br>\r\n<br>\r\n“You thirsty, boy?” Says Hoss, rubbing his dick for a second. You aren't much, but could go for a drink. But is this a trick? You wonder what he could mean by this.<br>\r\n“You guys were wondering why I was drinking so much beverages on our way here,” he says, “I was planning to give the boy here a drink too.” He pats you on the head, and you finally get what he means by this. You notice Dan setting up his camera. He seems to have set up the stand while you weren't noticing, and is currently setting up his laptop. As he finishes, Hoss takes your hands and places them on his pecs. You know what this means. You rub his pecs and his muscular, enormous arms.<br>\r\n“Do a good job and I’ll give you a drink.” As you rub this big, powerful man, Bill and John begin to get aroused. At this point, Dan has finished his work and the camera is all set and recording you and Hoss. You rub every inch of his upper body, and when you finish, he pets you and orders you on your knees. You get down. <br>\r\n“Now, I’m gonna unbuckle my belt”, he says “I’m gonna unzip…my pants”, he says in a sexier manly voice, “I’m gonna undo my pants…” He undoes his pants, and his underwear. His penis flops out of his zipper, and pointing directly at you.<br>\r\n“Here, boy, drink some of Uncle Hoss’ special lemonade, right from its tap.” Is he going to pee on you? The others center in, not letting you escape. Hoss slaps his dick on your face,<br>\r\n<br>\r\n“Either you drink from the source, or absorb it through your skin, your choice, boy!” You realize what he means. He wants you to drink it right from his dick head. You open your mouth and try to catch his dick.<br>\r\n“Only my head enters your mouth, got it! This ain't a blow job or nothin!’”  You do as he commands and only put your mouth on his head, getting ready to swallow. He then lets out a long stream of piss in your mouth.<br>\r\n“Don’t let a single drop hit this carpet! Drink every last bit of it.” He says, standing in a dominant pose, letting out a soft sigh of relief as he urinates in your mouth. You never knew what pure urine tasted like. They often used to dip their dicks in your drinks, occasionally peeing in it while doing so, but you never tasted pure piss. You expected it to be very tangy, but, while only a little tangy, you learn now that it is also very salty. As he pees, he lets out a big, foul fart. The smell eventually wafts over to you. The smell is about as bad as this piss is long. You struggle to chug so much urine at once. He really did have a lot to drink before he arrived. After a shocking full minute of relieving himself in your mouth, his stream finally ends.<br>\r\n\"Heh, serves you right!\" Hoss states. You gulp down the last bit of his pee and make a disgusted face as he takes his dick out of your mouth. The men laugh at you and begin to make fun of you. As you fall, Hoss places a foot on you in a triumphant pose similar to your dad. During their laughter, John’s belly moans yet again.<br>\r\n“Still holdin’ in all that gas?” says Dan, “Well, here’s your opportunity, we've got ourselves the fart magnet of every man right in front of us.” He says, with his hand facing your direction.<br>\r\n</span></div></div>",
            "created":1375765200,
            "id":1641539,
            "title":"Hoss' special lemonade, right from the tap!"
        },
        "12131111112":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Your Dad pops in. Their meal is ready!",
                "Dan comes up with an idea."
            ],
            "content":"<div class=\"\"><div> <span>“Yeah,” says John, “I’ve been saving all this for you all day, boy!” He says. Just then, you notice Bill sneaking up behind you. He picks you up, carries you up to your room,  and places you on your bed. A sudden strike of fear hits you, it’s like the time when you were 11 and they tortured you with their farts all at once. John laughs, looking down at you. He gets up on your bed and gets over you. The others make sure your head isn’t turned away. You already know this rule, and wouldn’t dare break it, but the fear, it’s scarred into your memory. John slowly lowers his big buttocks to your face, making sure your nose and mouth are right in his crack and under his pucker hole. <i>Oh man, here it comes!</i><br>\r\n<br>\r\n“Time for some good ‘ol relief.” John says, just before letting out a fart so enormous and loud that it shakes your entire body. The odor is so strong; you’d be sickened even if you were standing on the other side of the room. What power, the taste is ungodly, and the force is unbelievable! The fart continues, filling up your mouth with his gas. You’re forced to swallow his warm gas more and more. After the shocking ten-second fart, he fully relaxes and sits on your head with full relaxation. You’d be crushed if your head weren't on your pillows. You hear the others laugh and John groan with relief. He bounces his ass, along with your head, up and down. You place your hands on his cheeks, the only air possible to breath in being his gas. Thus, you are practically reliant on his powerful flatulence. He lets out another huge fart, this one more trumpeting. The stink and taste you must take in, it’s horrific, and the odor is nearly blinding.<br>\r\n<br>\r\n“God Damn, this feels good!” John gloats, flexing his butt cheeks on your face, \"Look at you, boy, you're pathetic!\" He yells. Your dick is so immensely hard, and the others notice. <br>\r\n“Think we should do it now?” asks Hoss,<br>\r\n“Nah, his old man wouldn't like it if we did it without him” replies Bill. You can barely hear them, but know what they’re talking about. Just then, John lets up for a second, allowing you to breath. Fresh air never smelt and tasted so good before. You look over and see Dan’s camera taping the whole thing. You look a bit more up and see Dan taping it with another camera as well, maybe using it to catch some of John. There's also one to your right above your head, getting a good angle of John's butt as it sits on you, and another filming him from a different angle further off beyond your right foot.<br>\r\n“Look up, runt!” yells Bill. You do as he commands, and John’s big bad bottom falls right back on you, with you in the same position as before. The moment makes your dick harder and harder, and suddenly, one of them removes all your bottom clothing and begins to suck it. It feels like it's Hoss, since besides John and your dad, he's the only one with a beard, and you feel his rugged hairs occasionally brush your dick. It feels great! You're in heaven! You've never been given a blowjob before, and you never imagined it could feel so good. As he does so, John lets out a tremendous, loud, long fart that lasts at least 9 seconds, not that you even have time to count anyways. You are so humiliated, feel so degraded, but so entranced! The moment has you fully aroused and heartfelt, feeling both love and lust for all these powerful, strong men. You put your arms around John’s waist. He wiggles his ass a bit and lets out another powerful, rich fart.<br>\r\n\"I bet that feels really good.\" Says John. You moan with pleasure in his ass. You wish it could continue longer, but Hoss soon stops sucking, not wanting to make you ejaculate. After another five minutes of John's intense fart treatment, he slowly gets up. Maybe for more air, you think, but he comes off your bed entirely. It feels like an enormous cloud just blew off of you just seconds after he gets off your bed. You gasp for air, feeling much relief from this giant man of muscle and fat get off of your face. You feel dazed, looking around, and see the men praising John. You're still very hard. Just then...</span></div></div>",
            "created":1375765200,
            "id":1641649,
            "title":"They take you upstairs for John to fart in your..."
        },
        "121311111121":{
            "author_id":"jadow",
            "author_name":"Jadow",
            "choices":[
                "He decides to pleasure you more"
            ],
            "content":"<div class=\"\"><div> <span>          Your dad comes in,\"Hey, your meals are ready.\"<br>\r\nJohn looks at you with a grin and says \"Don't worry, there will be more time for you to get some personal time with my mighty ass.\" John's belly starts to moan once again. Dan laugh,<br>\r\n\"You still haven't gotten it all out?\"<br>\r\nJohn pats his belly, \"Well lets find out how much I have left.\" Just as he says this, he walks closer to you, he grabbed the back of your head and pushed it closely to his ass. With your nose pressing up to his asshole, he grunts and out comes a fart even louder and smellier than the others before. As he farts, he let out a loud animalistic moan and yells, \"FUCK YEAH!!! SMELL IT!!!\" The fart lasts for 10 seconds, and just as it ends, out come 3 more 5 second farts each following one after another. <br>\r\n<br>\r\n          Everyone hears you sniffing each fart deeply, they enjoy seeing you both powerless and taking pride of being farted on. You start to grab on John's waist once more pushing your nose further in his ass while John starts to push you even deeper. Once he finishes, he starts to rotate his hips making your head also follow his movements. <br>\r\n<br>\r\n          John lets go of his grip on the back of your head and you slowly loosen your grip on him. The men start to praise John and the amount of gas he had, while they leave you gasping for air and still having a hard-on.<br>\r\n\"Man that felt good!!!\" John says with a huge smile while patting his belly.<br>\r\n\"Well don't hog him, let us have some of him.\" Bill replies as he unbuckles his pants. <br>\r\n<br>\r\n          \"ENOUGH!\" your father interrupts. \"Go eat first, then come back. You can gas him all you want then.\" He started to look at you with side grin, \"In the meantime, I'll keep my boy entertained until you get back.\"<br>\r\n<br>\r\n          He starts to walk up to you and  stops. He stared at your rock hard cock and starts rubbing the head saying, \"Now, what to do with you?\" </span></div></div>",
            "created":1378270800,
            "id":1657840,
            "title":"When the Guys are Away, Dad will Play"
        },
        "1213111111211":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "He continues anyway",
                "You have second thoughts"
            ],
            "content":"<div class=\"\"><div> <span>Everything that just happened has you incredibly sexually aroused. The domination from those men, all that they did to you. You haven't felt this way before. Since the issue when you were 11, your dad has been more sexual in regards to pranking and punishing you, but you would have never allowed yourself to reveal a hard cock to him, or anybody. How embarrassing. You haven't felt this way since you were 11, but even then, the sheer scarring of the moment caused you to ignore it as much as possible.<br>\r\n“Heh, looks like you had some fun, aye kid! Ha ha ha!” Your father chuckles, placing his hand on your stiff boner and rubbing the head. “Haven’t got a chance to cum yet, have you?”<br>\r\nYou nervously shake your head 'no'.<br>\r\n\"Good, so looks like your daddy will be the one that teaches you the great feeling of releasing your seed.\" He states proudly, continuing to rub your erection. It feels incredible. You look up at him with a smile on your face.<br>\r\n<br>\r\nYou smell the stench of a bad silent fart. What a time, too, as your father was facing away from you, with his beautiful, powerful buttocks just half a foot from your face. You can feel the heat as it escapes his rectum. The stench, it is so masculine. It is made amazingly better as he slowly rubs, squeezes, and pets your hard penis. The stink is immense, the power is fierce, and if you know your dad, he’s just getting started. You look up at his body. He is so powerful, firmly built, with bulging muscles, great enough to intimidate any man. You suddenly feel a tingly feeling in your gut, the sensation in your pants, it just feels so good.<br>\r\nYour father turns and faces you, looking down arrogantly, as if belittling you while stroking his own ego. You look at his bearded face, both enticed and afraid. What is this man going to do to you? He moves slightly to the left, knocking the remote to your television off your night stand table. He then bends down to get it, and the rest is like De Ja Vu:<br>\r\nYou watch his buttocks as he bends down. It is so beautiful, so round, do full. Sitting up a bit more, you are face to face with his buttocks, and it is only about a centimeter from your nose and lips. You can barely contain yourself from kissing that beautiful butt crack. Just then, he surprisingly moves back just a bit, and just like that, your face is now touching his buttocks. As if it couldn't get any <span style=\"text-decoration:line-through\">worse</span> better, his very next line is \"Man, that is some crack!\", pretty much a throw to you that this is the same situation that occurred this morning. Your nose and mouth now right in his buttcrack, he lets out another silent fart. You feel the hot, moist air all over your face. Your lips slightly open, the gas slowly creeps its way into your mouth. You are now tasting the gas of your father.<br>\r\nYou can no longer hold all your contain. You give his butt crack a peck-kiss, before slowly placing your lips, followed by your cheeks and nose, back in, giving it a bigger kiss, digging your face into his firm, masculine buttocks. You take a huge whiff of his ass, taking in all the masculinity your nose can contain. He then lets out a loud, powerful blast all over your face. Such crude strength, he laughs evilly as you inhale all of his gas. As you continue, he slowly gets back up. You look up at him, his large back and broad shoulders, his firm buttocks. He turns around and looks at you. He slowly creeps down, and his face is now over yours. He gazes into your eyes, a gaze that tells you he truly knows he can do anything he wants to you, and feels great knowing it. He takes in a good whiff of you, smelling the gas of Bill, John, and himself, as well as Dan's sweaty crotch, all over your face. He exhales a sexy, relieved sigh,<br>\r\n\"Mmmmmh\" he sighs. Looking at him smile so arrogantly, you are filled with love and lust, and just then, he kisses you. Your father kisses you. Your big, hairy, powerful, sadistic father kisses you, and… it feels amazing. The kiss slowly becomes more and more sexual, to the point his tongue is in your mouth. You moan as you feel his mustache rub against the skin under your nose, and his beard your cheeks. In a glimpse, you see past your father’s left shoulder that Dan’s camera has been recording everything, as was the camera to your right, and the one to your left, all of which are high quality. This is your first kiss, and it is one you will never forget.<br>\r\nYour father stops for a minute, lifting his head just a few inches. There is a bit of drool hanging from his tongue to yours.<br>\r\n“So son, tell your old man, have you ever kissed a girl?” He asks with a sadistic look, already knowing the answer,<br>\r\n“N-no” you reply, breathing in while still in a gaze,<br>\r\n“Then your first kiss was with a big, mean bully like me?!\" He gloats, opening your mouth, to continue the kiss, \"How does it feel, having your first kiss with your own father?” He states while kissing you again, “How does it feel having your first kiss with a man as old, big and strong as me,\" He pauses to continue the kiss, \"...right after he and four other men farted all over you?”<br>\r\nFilled with ecstasy and lust, you place your arms around him, hugging him as he slowly begins dry humping you. Feeling his big, hard dick rub against yours, you feel even more enthralled. This big man on top of you, in full control of you, and he’s your own father. It feels so good. Your very first kiss. You are certain no kiss could ever compare. You feel and hear him moan loudly while kissing you, and you moan a few times yourself. You feel his tongue inside of your own mouth, at one point popping out of your mouth and licking your lip before continuing. You don’t ever want this moment to stop. You still smell the foul flatulence, both your father’s and John’s. Oh man, the feeling is amazing! Too amazing, you've reached the sexual plateau phase. That's fancy talk for <i>you're gonna cum soon!</i><br>\r\n\"D-dad!\" You yell softly, your father knows what that means...</span></div></div>",
            "created":1379566800,
            "id":1665511,
            "title":"First kiss...and it's from Dad!"
        },
        "12131111112112":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Time to receive your father's gas.",
                "Time for a good, fierce spanking."
            ],
            "content":"<div class=\"\"><div> <span><span class=\"clred\">Warning, Saliva</span><br>\r\n<br>\r\nFully in the heat of pleasure, you gasp as your dad gets a hand of your dick.<br>\r\n\"Uh, wait-wait dad!\" you yell,<br>\r\n\"What? Did I hurt you?\" he asks<br>\r\n\"N-no, uh, I just don't, I don't know\" he seems confused and lies down next to you, \"I mean, I was liking it, a lot, I-I'm sorry, I just don't know...\"<br>\r\nYour dad places his hand on your stomach and rubs it gently,<br>\r\n\"Why so worried?\" he asks. You giggle a bit from his hand, but reply,<br>\r\n\"Wouldn't mom be really mad if she ever found out?\" you ask, \"and...I don't know, it's scary\",<br>\r\nYou really don't. You only started masturbating a few months ago. It's not like you're losing your virginity, it just feels so intense having someone masturbate you who isn't you yourself.<br>\r\n\"Who says your mom will ever find out?\" he assures you, \"What mommy doesn't know won't hurt her.\"<br>\r\nYou smile, but you aren't sure if you should laugh or be mad at yourself- or him. You hope to your stomach this means he never cheated on your mom,<br>\r\n\"Dad...sorry...but I can't\" you say, this time with a slightly more stern voice. He looks back at you, unsatisfied.<br>\r\n\"Son, we both know you enjoyed yourself,\" he states, getting back on top of you in the same way as before,<br>\r\n\"D-dad...\" you mutter,<br>\r\n<br>\r\nHe grabs you by the head and continues to kiss you, whether you like it or not. You whine and try to push him off, but to no avail. Your father is far too strong. As you whine with aggravation, he moans loudly, sexually pleased. having him kiss you so powerfully, well, despite your earlier judgement, you are enthralled and filled with immense lust. Your father is such a good kisser. He gets up, slightly, with a slight string of saliva extending from his mouth to yours. You don't know what to do. Should you go back on your earlier judgement, or give in to your lust for your own father?<br>\r\n\"Seems I still haven't been 100% clear, I'm the king of this castle!\" he states, \"I suppose someone needs another good punishment.\"<br>\r\n\"No no no! Dad, I'm sorry, I- please, dad!\"<br>\r\nHe chuckles, laughing at your please, \"A good father knows when to show his son a good helping of discipline.\"<br>\r\n<br>\r\nHe grabs your head and looks at you with a fierce look of seriousness. He grabs your jaw and forces your mouth wide open.<br>\r\n\"Maybe this will teach you when to shut your mouth and listen to your father.\"<br>\r\nYou look up at him, and you are shocked and terrified at what you see. With his lips only about 3 <font class=\"size15\" style=\"\">1/2</font> or four inches from your mouth, he lets out a long, fat trail of drool. Your muscular, tall, 40-year-old is right now, at this moment, spitting in your mouth. The embarrassment and utter disgust you feel is immense, as the saliva slowly falls down to your mouth. This man, this big powerful man, has full control of you, and boy does he know it. He keeps his stern serious face, and with his lips still semi closed, he lets out a rather noticeable moan.<br>\r\n<br>\r\n<i>Oh god, it's so disgusting</i>, you think as the spit lands on your tongue. You know that when your father gets like this there is no stopping him. With tears beginning to form in your eyes, you slowly swallow it, tasting with disgust. If not, he may give you an even worse punishment. You wince with humiliation as you swallow your father's spit.<br>\r\nWith the remains of his loogie still landing in your mouth, your father lets out another moan. The serious look still on his face, you feel his big, large dick through his pants touching you; it is clear he is enjoying himself. He looks down at you with a proud smile on his face. He lets go of your jaw, and you swallow all that is left of his spit.<br>\r\nYour father gently holds your chin,<br>\r\n\"That's it, boy, swallow\" he states as his saliva goes down your throat. He chuckles evilly, full of masculinity, as he creeps down and kisses you once again. His lips touch yours, and you both moan as the kiss becomes more passionate. This man, the man that just took pleasure in humiliating you in front of cameras, now has his tongue in your mouth. Your penis is throbbing, and presses against his.<br>\r\nAs the kiss ends, he \"relaxes\" on you, laying on you completely, pressing you into your bed. Relaxed, he rubs his bearded cheek against yours. He then looks at you, still proud.<br>\r\n<br>\r\nHe gets up and folds his arms, looking down at you with pride and a smile.<br>\r\n\"Good job, kiddo,\" He states in an uplifting manner, \"taking your punishment so easily without a complaint.\" He crouches back down, laughing evilly as he continues to kiss you, and you both moan with pleasure.<br>\r\nHe gets up a bit and looks you in the eyes, his right hand patting you on the left cheek,<br>\r\n\"Now, it's time for you to learn your place.\" He states with an evil grin.</span></div></div>",
            "created":1382331600,
            "id":1682610,
            "title":"Punishment for your second thoughts"
        },
        "121311111121121":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "You go to your parents room",
                "You wait until the game is over"
            ],
            "content":"<div class=\"\"><div> <span>Your father lets off of you, getting off the bed, he slowly takes off his pants in your face. (pic? sure, here <a rel=\"nofollow\" href=\"http://sexipedia.wdfiles.com/local--files/wiki:underwear-eroticism/tumblr_ma7fv0RKIy1rb0vr2o1_500.jpg\" target=\"_blank\">http://sexipedia.wdfiles.com/local--file...</a>) You gaze at the seductive, brief-clad buttocks you always feared in the past.<br>\r\nShooting you his evil grin, he gets back on the bed in a different position, so now his ass is directly in front of your face. You stare at his big, buttocks. He teases you with the sight as you watch his buttocks lower closer and closer towards your face. He allows you truly catch your breath from the earlier kissing and spit swallowing. Once you do, he lowers his buttocks even more. You shudder in what is an odd mixture of guilt, fear and anticipation. Suddenly, you feel the cloth of the portion of his underwear covering the very lower regions of his buttocks touch your face.<br>\r\n<i>Oh man</i>... you think, already smelling the awful scent. He laughs, ready to show you just what your father can be capable of.<br>\r\n<br>\r\nHe slowly lowers his buttocks more and more until he is completely sitting on you. He grinds his butt on your face, teasing you while making sure not to sit on you completely, as to allow you to breathe in as well as taste as much gas as possible. The second he stops, the nightmare begins. He lets out a long trumpeting fart that slowly lowers in sound and changes pitch during release. The smell and taste is so horrible it barely matters, shooting directly up your nose and down your throat. He made sure you were in the perfect position before he released the noxious odor.  Having such a big man do this to you makes you feel so inferior, so week in comparison. Your father lets out a good sigh of content, nodding his head as he finishes pushing the fart out, before letting out a manly chuckle. As he does, your dick throbs even more than before.<br>\r\n\"See that, boy, you'll always be a fart magnet, so why not enjoy it.\" he gloats,<br>\r\nYou lie in your bed, groaning repeatedly from the horrible stench, mainly from the pleasure. He wiggles his butt on your face a bit and a roaring fart escapes from his ass, covering your face with a cloud of pure stink. You flail as the smell invades your nose. Your dad doesn't let up and continues to sit on your face. He releases another fart, this one shooting mainly in your mouth. You feel the rumble of the escaping fart against your entire mouth at every corner. Good god, what a horrendous fart. The taste is almost as bad as the smell!<br>\r\nTo your surprise, your father lifts his butt a bit. He turns his head back to look at you, his helpless child.<br>\r\n\"Enjoying yourself?\" He asks. The cruelty warms your heart.<br>\r\nYou smile back at him, struggling to say how you love him, but you keep it back,<br>\r\n\"D-dad\", you say, lustfully with a wide smile on your face.<br>\r\n\"Hmph!\" your dad replies with a smile, knowing he now  has you completely sexually enthralled for him, \"I'm gonna make you know, that you're my bitch, kid. I'll make sure you stink for ages.\"<br>\r\nYou look up at his big, firm, brief-clad buttocks, fully shown right in front of your face. You shudder greatly, this isn't the first time this has happened to you. The only thing between you and your fathers big, hairy ass, is his pair of white briefs.<br>\r\nHe grabs your head and positions it so your face is perfectly aligned to receive all the gas he can give. You shudder again, remembering all the times he did this as well. He bends over a bit more and rubs you with his foul, sweaty balls, before returning to position. He then sits back down, with your nose shoved up hos musky crack. You moan from the smell.<br>\r\n<br>\r\n\"You know, I was somewhat of a real bully when I was your age.\" He gloats, \"I always found that letting a good pile of gas on a kid's face was always a great way to let them know just who the boss was.\" He lets out another enormous fart. The gas shoots directly up your nose and fills up your mouth. What's worse is that it ends with a stream of silence. Yes, it ends as a silent fart. Damn, you father's gas may actually be stronger than Big John's. He wiggles his ass on your face to torment you before he lets out a good, long silent fart.<br>\r\n\"All those weaklings knew to fear me, even in high school. I was the strongest, fastest jock.\" he gloats as he pats his belly with pride, \"I had the frame of a man in his twenties by the time I was 16. Everyone either loved or feared me. I was the big man on campus.\" He releases another stunning fart on your face. The stink is so bad, it burns. Your dick, however, tells your body that you want more.<br>\r\n\"Mm, mmm mm! Damn this feels good!\" He states as he clenches his ass cheeks on your face three times. The arrogant way he does this makes your heart beat with delectation and anticipation. He looks at your throbbing, fully erect cock, on the verge of ejaculation. He places his right hand on it and massages it, putting you in immense pleasure. Moaning for more, you begin to smile again, smiling while your face is in his ass.<br>\r\n\"Thank you, thank you, dad!\" you yell within his ass. Embarrassing words, but even he can barely make it out, as your voice is so muffled by his ass. You're full of desire, enjoying every minute of this treatment. <i>The stink, the smell, the odor</i>, you think.<br>\r\nFinally, all the sexual excitement reaches its head, and you ejaculate just as he releases a massive, incredibly foul 8-second fart all over your face, ending with a three second silent fart (total of 11 seconds!). Seeing you release your sperm, your father lets out a soft, but proud chuckle, still sitting on your face.<br>\r\n\"I hope you learned your lesson.\" he states, rubbing his ass on you as he gets up slowly and sits beside you, looking down at you, admiring his work. He leans above you to take a good whiff of your face,<br>\r\n\"Damn, kid, you stink!\" he gloats.<br>\r\nFull of gratitude and guilt from earlier, you hug him while he's close. He hops over you and lays down beside you, returning your hug with a one arm hug.<br>\r\n\"I love you, dad.\" you tell him,<br>\r\n\"I love you too, kiddo.\" he replies.<br>\r\n\"Will the others... care that I...\"<br>\r\n\"They'll be happy for you.\" he assures. You give an unsure look,<br>\r\n\"Heheh, you mean will we let you recharge that piss slit of yours.\" he realises, you up to him, semi worried. \"Haha, kids,\" he laughs, \"Don't worry, the game's on in a few minutes. You'll have all that time.\" he assures, \"In the mean time,\" he grabs a pillow, \"we'll use this pillow of yours, get it nice and ready for your pretty little head.\"<br>\r\nYou smile up at him, letting out a comfortable laugh,<br>\r\n\"If we win, we'll have to celebrate,\" he states, shooting you a mean smile. You know what that means.<br>\r\n\"But what if you lose?\" you dare ask, putting a bit of a frown on his face,<br>\r\n\"Then we'll have to let our anger out.\" he replies. He looks at you and your now incredibly foul face. He takes out his dick, placing it right in front of your lips,<br>\r\n\"Give daddy a kiss.\" He orders. You do as commanded, landing a peck right on his head. He laughs down at you as you do so. He puts back on his pants taps you on the cheeks, and walks out of the room, truly proud of himself and you.<br>\r\nAs he closes the door, you lay back with excitement and perfect relaxation. You sigh, feeling as though you're in love.<br>\r\n---------------------------------------------------------------------------- -----------------------<br>\r\nAn hour passes. To your surprise, your already ready to go for more. The smell from all the earlier farts linger, making you aroused. You wonder what to do until then.</span></div></div>",
            "created":1382418000,
            "id":1682699,
            "title":"Time to receive your father's gas."
        },
        "1213111111211211":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Your Dad enters",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go to your Dad's room. You continue to think about him on your way there, thinking about that kiss. In your mind, you KNOW your Dad 'knew' it was your first true kiss, and you remember the first technical kiss you ever got, which was also from your dad, when you were only 9. <i>Man, that was such a beautiful moment</i>, you think. That kiss, it was only about a second long, and it was only lips, but anyone watching could tell it had passion in it. As you walk, you continue to smell yourself. All the gas and sweat that these men have covered you with makes you very horny.<br>\r\nYou enter your parents bedroom and wonder exactly what to do there. Your so horny you just couldn't wait on your dad. You look around and see a pair of your Dad's dirty underwear. You gaze in awe as you make your way to it and bend down to take it up, noticing its yellowish tint. This arouses you more; your father is a man after all. Holding it, you imagine what it looked like when this thing was on your dad. The image arouses you, and you put the briefs to your face and take in the biggest whiff you can. The smell is so strong it nearly intoxicates you, but not as much as it would if fresh.<br>\r\n\"Mmmhm\" you moan as you happily wipe the the dirty underwear on your face. The smell of ass and groin fills you and you get more and more horny. You fall down on your parent's bed and look up with joy and arousal before bringing the briefs back to your face. You continue to moan as you notice your erection. You move your hand south and begin to jack off to the scent. You feel so good right now, when suddenly...</span></div></div>",
            "created":1386219600,
            "id":1703557,
            "title":"You go to your parents room"
        },
        "12131111112112111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Someone new enters...",
                "Things start getting more sexual for both of you."
            ],
            "content":"<div class=\"\"><div> <span>You take in a deep nose inhale of your father's underwear, and rub it on your face. Suddenly, you feel a large hand on your erect cock, and it isn't yours. You jump up in fear and you see that it's your dad.<br>\r\n\"Dad!\" you yell, aggravated at being so shocked. He laughs at you, enjoying the scared look on your face.<br>\r\n\"What’s wrong,\" he asks, \"...not gonna finish?\"<br>\r\nHe looks down at you while you lay on his bed, you do not know what to say. When he sees that you are not doing anything, he decides to take his own initiative.<br>\r\n\"Poor little guy, don't know how to spank your young teenage cock?\" he says, placing his hand on your erect penis.<br>\r\nYou moan softly, but a sudden, even greater increase of pleasure causes your moan to cease and grow. Your dad really knew how to pleasure you. He sits down, parking his ass next to you. You quickly move your hand so that he doesn't sit on it. He seems a little displeased by that.<br>\r\n\"How did you know I was in here?\" you ask, still very aroused.<br>\r\n\"Maybe it was lucky timing,\" he replies, \"or maybe I just know my boy.\"<br>\r\nHe leans above you and kisses you on the neck, working his way up to your lips with several more kisses. He picks you up and kisses you while standing, holding you with ease.<br>\r\nHe places you down in front of him, originally gentle; he begins to get aggressive, forcing you down on one knee. As you get there, he forces your head towards his well-muscled abdomen. Your nose soon comes into contact with his navel. You smell it a bit through his shirt and it is not pleasant, carrying a sour aroma. Just a few seconds after you notice this, he lifts his shirt a bit, revealing his hairy, beefy, but still well abbed stomach.<br>\r\n\"Lick it.\" He orders.<br>\r\nYour lips twist with disgust as you hesitate to follow through on his order, but you quickly do as commanded.<br>\r\n\"Wait, boy!\" he states just before you begin, \"stick your nose in it first.\" He orders with a grin on his face.<br>\r\nYou groan in disgust as you hesitantly place your nose in his belly button.<br>\r\n\"Now breathe it in!\" He orders. You sniff his navel, breathing the sour stench. It’s then that you realise what he’s doing. You should have just let him sit on your hand, and this is a punishment….. Or, maybe that’s not it; maybe he’s just getting a kick out of humiliating you.<br>\r\n\"Alright, now lick it clean!\" He orders, standing in a dominant pose.<br>\r\nYou begin to lick his navel with a frown on your face, however, the aggravation sort of turns you on, to your surprise.<br>\r\nYour father chuckles evilly as you stick your tongue into his belly button. You groan in disgust, tasting the nasty, disgusting, tiny pieces of belly button gunk within his navel, cleaning it out with your tongue.<br>\r\n\"Don't spit any of it out, swallow it all!\" you once again hesitate before doing as you're told. Swallowing the taste of his uncleansed navel, your mouth is filled with a sour taste.<br>\r\n\"Good job,” he says, “Now get back up.\" He orders,<br>\r\nAs you do, your father once again grabs your dick, only now he unzips his pants and rubs your dick against his. This nearly makes you lose control,<br>\r\n\"Looks like you're too young to control yourself in front of men, eh boy?\" He states, squeezing your dicks together. As he does that, you both let out a good, pleasure-filled moan.<br>\r\nYour dad leans down and kisses you. You are filled with ecstasy as your kiss continues. He leans back up, but turns around. At first you think he's going to get something, but suddenly, he slightly kneels down in front of you he places his prominent backside on your pajama-covered pelvis. He then lets out a giant, immense fart on your hard, throbbing cock. You nearly drop to your knees with pleasure, placing your arms around his chest, as he lets out a well-deserved sigh from the relief. The smell hits your nose in a giant heated wind. It smells putrid, carrying a sharp, egg-like, meaty aroma. Just then, he grabs you by your ass and forces your pelvis towards into buttocks, allowing him to deeply grind his ass on your cock and midsection, pressing the stink past your garments and deep into your skin.<br>\r\n\"Oh-ohhh-h-h\" you moan, filled with an enormous amount of sexual pleasure.<br>\r\nSure enough, the harsh odor lingers around the exact area in which he farted. You sniff the sulfuric, musky air with pleasure just before your dad begins to softly pat his ass on your dick, averting your attention back on him,<br>\r\n\"Oh-h-h...yeeeahh, dad,\" you moan, this makes him laugh a bit.<br>\r\nHe rubs his ass a little more, before kneeling back up. His ass is now on your midsections, due to your shorter stature. He flexes his arm muscles, and as he does, he lets out another fart. It’s longer, but more of a growler sounding fart, but it still smells just a putrid. The fart is released all over your midsection, including your belly button. The fart entering your navel results in a ticklish feeling. If you thought his smelt bad before, well, now yours smells like his ass. You hug him from behind as his fart continues. He lets out another good sigh as he finishes relieving himself of his gas.<br>\r\n“It sure does feel good to have a week little punk of a son to fart on!” he gloats, shaking his ass on you for a bit.<br>\r\nYou rub your cheek on his well-sculpted back, feeling as though you are in love.<br>\r\n“Aren’t you lucky to have such a nice, big daddy to show you your place?”<br>\r\n“Yes… oh yes!” you reply, in a gasping sense,<br>\r\nHe chuckles arrogantly in response, slowly turning back around and kissing you again. God, his kisses feel amazing! You begin to move your hands around his wide, firm back as he moves his hands downward towards your own ass, before squeezing it firmly. It feels surprisingly good having him squeeze your ass like that. You both moan into each other's mouths before...</span></div></div>",
            "created":1397192400,
            "id":1776947,
            "title":"Dad's back for more"
        },
        "121311111121121111":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "An adult (one of the guys probably?)",
                "A new kid (one of the guys' sons?)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You and your dad are interrupted when someone new enters the room. Well whoever could it be?</span></div></span></div>",
            "created":1397192400,
            "id":1776951,
            "title":"Someone new enters..."
        },
        "1213111111211211111":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "Squish you face with his but",
                "Kiss his pit"
            ],
            "content":"<div class=\"\"><div> <span>It was s big muscler man  and he smelled like he had just came back form a 5 hour workout your dad smile and says \"Sean you made it\" you then got a huge feeling of dread your dad had mentioned Sean and at the construction site he always was the sweatest person there and how he smelled and that saying something because it came from your dad own mouth so it couldn't mean anything good just then you notice that Sean was walking your way  he looked down at you a said \" is this the runt that want to be punished because I jogged here from my place and I live 5 miles away in the blazing heat so I'm nice a sweaty for you\" before you could say a word your dad said yes he is and that no matter what you said it was just a lie and not to believe you at all.  You dad decided to leave for you to get to know Sean in private when he left Sean frist took of his tight booty shorts  then his tang top leaving him in his berifs he decided to </span></div></div>",
            "created":1494997260,
            "id":2320782,
            "title":"An adult (one of the guys probably?)"
        },
        "12131111112112111111":{
            "author_id":"bobster9001",
            "author_name":"Mcbobby0101",
            "choices":[
                "Your Dad comes back to let Sean know that dinner is ready",
                "Sean finds another way to punish you",
                "Sean keep doing what he's doing"
            ],
            "content":"<div class=\"\"><div> <span>Sean absolutely towered over you're tiny self. He was taller than any of the other guys and was more muscular than any of them, too. As he made his way towards you he bounced his pecs, striking fear straight into your little heart. You could also smell his scent worsening as he approached. You gulped as you hoped that he wouldn't force you to smell his toxic pits or *gasp* his ass. <br>\r\n<br>\r\n\"Well, well, well, what ever should we do with you, boy,\" Sean asked in a menacingly deep voice. <br>\r\n<br>\r\nYou quickly shot a glance down at his ass, immediately regretting your decision.<br>\r\n<br>\r\nSean smirked as he saw where you glanced. \"Hey, I got an idea.\" <br>\r\n<br>\r\nSean proceeded to quickly force you to the ground in one swift motion, planting his firm ass on your puny face. You felt as if your face was being constricted in a vise as Sean's rock-hard ass cheeks barley budged open from being used to staying firmly clamp shut, like a bear trap. His ass held you in place like a bear trap too. You were kinda surprised that you were able to remain in place as good as you did considering how sweaty Sean's ass was. You'd figured that with all that pressure coupled with the slippery surface that his sweat created would cause you to shoot out like a rocket. <br>\r\n<br>\r\n\"ahhh, feels good to put a runt like you where you belong! Now time to start your punishment\"<br>\r\n<br>\r\nWithout warning, Sean suddenly blasted an atomic bomb sized fart from pointblank, right onto your face. The odor was something out of this world as it mingled with the putrid stench of his sweat and natural ass musk to create a truly ungodly stench. The toxic combination of the three distinct smells flowed throughout the room, making it a nuclear exclusion zone for anyone trying to enter the room. <br>\r\n<br>\r\n\"How was that, bitch? Tickle your fancy?\" <br>\r\n<br>\r\nYou'd hate to admit it but it did. Fortunately(or unfortunately)for you, you didn't have to say anything as your dick gave a suitable answer. <br>\r\n<br>\r\n\"Ha, I see you like being punished. Now what should I do next?\"</span></div></div>",
            "created":1549705980,
            "id":2614809,
            "title":"Squish you face with his butt"
        },
        "12131111112112111112":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "to lower arm you lock in are armpit without air",
                "to be nice and frees you from his armpit to put you somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Sean approaches you is starting to lift arms that you see are armpit with a huge tuft of hair and sweat poured<br>\r\n<br>\r\nyou took a suction when all of a sudden you felt law smelling armpit that senses but you think if it stinks of here while it's not yet beside me you have to be worse<br>\r\n<br>\r\nyou look sean with the tear in your eyes and told him<br>\r\n\"please not in it\"<br>\r\n<br>\r\nsean goes dangerously close with a devilish smirk it's my feeling these armpits are you saying \"you can cry because I can tell you in it meaning to contain it and rot that a man can not breathe<br>\r\n<br>\r\nand then approaches you and takes your head is you glue the face under are armpit<br>\r\nyou were out of air which made you breathe smell when you were stuck to his armpit but you were lucky he had an open arm because even if he was hairy fresh air go into are armpit<br>\r\n<br>\r\nthen he looks at you and says<br>\r\n<br>\r\n\"Good I feel you're not punished enough I'm going to choose be I'm yours in my ass and pee on you or I choose to firm your arm to enclose your face in it\"<br>\r\n<br>\r\nyou are so scared that you prefer to talk and eat the sucker talk about nothing and said<br>\r\n\"If you do not get stuck in your armpit if you give up, I'll be stuck in your hair and he'll have</span></div></div>",
            "created":1508814480,
            "id":2405633,
            "title":"Kiss his pit"
        },
        "1213111111211211112":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "You try to comfort him",
                "He leaves you alone and you bask in the earlier moment"
            ],
            "content":"<div class=\"\"><div> <span>He then kissed you on the cheek, then kissed you on the neck, then began to roll over your body.<br>\r\n\"Dad, haha,\" you reply<br>\r\nYour dad continues to toy with you as if you were his high school girlfriend. You giggle, laughing with your dad as he continues to tease you; rubbing his bearded face on yours and repeatedly kissing your lips, neck and cheeks and nibbling at your ear. You remember when you were very young, you used to walk in on him pulling the same moves on your Mom. This makes you a little uncomfortable for a second.<br>\r\nYou both stop and look at each other, eye to eye. You begin to giggle, when you realise this, you try to explain yourself,<br>\r\n\"Sorry,\" you state, \"it's just...I never knew how lucky Mom was.\"<br>\r\nYou quickly catch your words; fear makes its way to you as you fear what his reaction will be to bringing up your mother on a guy's-only break.<br>\r\nBut to your surprise, he gives you a pleasant, fatherly look, a look of pride. Your heart begins to pound with love as he does this, feeling complete protection and love from him.<br>\r\n\"You really are a bully, dad\"<br>\r\nYour father chuckles, \"Damn right I am!\" as he begins to kiss you romantically and places his hand back on your erection. He begins rubbing your hard cock very slowly, and after a good two minutes, moves downward and begins to kiss your hard wood. You gasp from the shock of this before placing your hand on your dad's broad back, rubbing it as he takes care of your dick.<br>\r\nSuddenly a little boy opens the door. You are so invested in kissing your big bully of a father that you don't even notice until the kid reacts with a noticeable \"Eww!\"<br>\r\nBoth your and your dad's eyes widen in surprise. He gives off an aggravated look as he gets up and looks at the source of the sound.<br>\r\nThe boy's face turns from disgust to complete fear. You remember that kid; it's Bill's son, Mikey. You've seen him a few times before at a few gatherings. Bill brought him over every now and then. He's only seven, and although the men in the house have always adored tormenting you, there have been times where Mikey was the source of their torment. It wasn't anything major, just a few things they'd do to you when you were his age, although comparing that to any normal kid, you suppose you could call it major. What you do know is that he's very afraid of your dad. You always figured it was because your dad liked to torment him too, but you never fully knew. Being a powerful building of a man probably helped though.<br>\r\n<br>\r\nYour dad gives you two pats on the cheek before getting up to grab the boy. Mikey tries to run, but your dad is far too quick for him. He grabs him by the arm, backs up, and slowly takes a seat on your lap, backing onto your hard penis.<br>\r\nMikey, with tears forming in his eyes, continues to try and run, but realises that there is no hope. He slowly looks up at your father, who is looking at him with a comforting smile similar to the one he gave you when you're mother and sister left.<br>\r\n\"Now, boy,\" he says calmly, which in itself seemed to terrify Mikey, \"What exactly were you doing snooping around my house?\"<br>\r\nYour father scoots a bit further onto your lap, his firm buttocks now on both your cock and your lower abdomen. You react simply by rapping your arms around him, hugging him from behind as he gets ready to bully the little kid while sitting on you. Although you aren't aware of it, this truly makes your father even more comfortable and confident; he was smug and arrogant enough as it is, but having one of his victims fully give in to his sadism really encourages him.<br>\r\n<br>\r\nYour dad farts once again on your lap, turning you on greatly as you rub your cheek against his broad back. Mikey tries to back away, but your dad won't let him. He pulls him in, brings him closer to his crotch, and makes him sniff up his foul groin and acrid gas. He then rubs his ass on your lap for a bit before slowly getting up.<br>\r\n\"Now, now, boy, give daddy a kiss,\" he says, bending over with his ass directly in front of your face. You stare for a bit before quickly complying with your father's demand. Before you can, however, he scoots back, his ass now touching your face. You slightly move your head back so his gorgeous ass doesn't knock your head back. With that, your father passes gas on your face. It is very long and loud, managing to alert the men downstairs.<br>\r\n\"Goodness!\" Your dad states sexually, yet mockingly, filling up Mikey's ear with his deep, sexy voice, \"pretty good one, aye, kiddo!\"<br>\r\nEnthralled, you simply and quickly plant your lips on  his ass in return, his big, muscular, firm ass, all the while patting it gently with both your hands. Your dad laughs evilly,<br>\r\n\"You see what an old bully like me can really do to his kid?\" He says to Mikey before shaking his ass in your face, then blowing out a quick, short fart to humiliate you in front of the kid.<br>\r\nGrabbing Mikey's head, he stretches his mouth open similarly to how he did with you before. He then collects all the spit and mucus he can before hocking a huge loogie into Mikey's mouth. As he does so, his ass scoots back and presses against your face again. You hear Mikey screaming, but your father forces him to swallow all of his spit as he sits back down on your lap. He then opens his mouth again and begins to release a stream if saliva similar to how he did you before. As your huge father takes over this tiny, defenseless kid, he blows another strong gust of gas on your lap, and you are so overcome with lust and love for him that you return to hugging him. After a good minute, his spit seems to stop. He hocks up some more mucus and rubs his buttocks on you again before spitting in Mikey's mouth. He then gets up and bends over, showing you his ass directly, and blows a hot, silent wind of gas on your face as his firm ass continuously dances between gently touching your face to being directly in front of it. You feel the warm flatulent wind brushing all over your facial skin, and your eyes cross in disgust and pleasure at the strong scent. The silent fart lasts about 11 seconds, filling your nose and your mouth. The stink wafts over to Mikey, smelling the foul air as he gases in fear at your huge, 42-year-old father, who returns his gaze with a fierce, evil stare, scaring the 7-year-old.<br>\r\nAs it ends, your father gets up, making Mikey swallow his spit yet again, and releases his head, though still grabs his arm. As Mikey dry heaves over the saliva he had to ingest, he makes a face of even more disgust over the odor of your father's ass.<br>\r\nYour dad then unzips his pants and takes out his large penis.<br>\r\n\"Alright boy, time to drink up!\" He says,<br>\r\nYou are shocked at this, as is Mikey, who's eyes widen with confusion and disgust. Several seconds pass and your father angrily orders him to drink,<br>\r\n\"I said DRINK UP, BOY!\" Once again, Mikey freezes.<br>\r\nYour dad scoffs and turns to you, still having a firm grip on Mikey.<br>\r\n\"You'll pay for that one, kid, and as for you, son,\" he says while looking at you, \"Drink up!\" He orders,<br>\r\nHis semi-hard cock press against your lips, the smell of it already in your mouth, but you do as your father commands and place your mouth on the top of his cock, ready to drink.<br>\r\nA hot stream of urine shoots down your throat. You are quick to drink it up, not wanting to displease your dad. As you drink, you hear a heavy sigh from your father. You look up and he looks down at you. At first, his facial expression looks somewhat sadistic, but as he continues to relieve himself inside of your mouth, his face becomes more prideful, not for himself, but for you, his son. He then places a hand on your head and pets you. It feels so good when he does that. You smile a bit, lust taking over at a rapid pace, but you are quick to continue drinking his urine until the stream ends. You don't even notice Mikey anymore, all that matters to you is making this beautiful, strong, masculine man you call your father happy. Your father finishes his piss and let's out another sigh,<br>\r\n\"Yeah, that's my boy!\" He says, softly, making you smile even more. He takes out his cock and shakes it on your face and chest. He then squats down to your level and gives you a smile before giving you a romantic peck on the lips. He gets back up and admires you, looking at his boy, as he does.<br>\r\nJust then a roar is heard downstairs. It seems the guy's team was doing well atm. Your dad's eyes seem to look over in that direction. He places his hand on your shoulder,<br>\r\n\"Sorry, boy, we'll have to finish our talk a little later.\"<br>\r\nHe says before heading downstairs, leaving you with Mikey...</span></div></div>",
            "created":1438150500,
            "id":2013879,
            "title":"Another Victim"
        },
        "124":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "They decide to fart on you all at once",
                "They ignore you for now",
                "A little history of these guy's torture"
            ],
            "content":"<div class=\"\"><div> <span>Okay, that was just too weird. You decide that enough is enough, and you confront the man once again. You follow him to the den and stand next to the couch with an angry expression on your face. No matter how hot that was, it's still wrong.<br>\r\nHe turns his head and looks at you \"What, boy?\"<br>\r\n\"WHAT!? What was that??\"<br>\r\n\"What was what?\"<br>\r\n\"Dad, you just... this isn't right!\"<br>\r\nHe gets up, walks closer to you, and stares down at you with a dark expression on his face.<br>\r\n\"I wonder, do you need MORE discipline?\"<br>\r\nJust as you are about to say something, he pushes you on the couch and sits on your lap.<br>\r\n\"Mm mm mmmm! Obviously I've been going too easy on you, boy, fortunately, I have days to let you truly know your place around here!\"<br>\r\nHe wiggles his ass before letting out a huge fart. Oh god, the stench is so powerful, you can practically taste it. <br>\r\nYour dad is so huge - he's just looming over you and playing with you - rubbing his strong buttocks on your lap while laying back on your chest.<br>\r\n<br>\r\n<br>\r\nSuddenly, the doorbell rings. You hope that your mom and sister forgot something and are here to save you. But shouldn't they have keys?<br>\r\n<br>\r\nYour dad gets up slowly, making sure to go extra slow when his ass is in front of your face, and walks to the back door. As he opens the door, you are shocked to see four of his burly friends. You run over to your room hoping that your dad will hang out with these guys all day. Maybe you could find a way to convince your mom to come back - or you could wake up - cause this has to be a nightmare.<br>\r\n<br>\r\nBill, John, Dan and \"Hoss\" are all assholes. They come over and drink with your dad whenever the women in your house are away. Unfortunately, they all enjoy picking on you and humiliating you with your dad.<br>\r\n<br>\r\nDan and Bill are both state cops. They must have just got off their shift, cause they still have on their uniforms. Dan and Bill still had on their tight fitting slacks and uniform shirts along with those shiny black motorcycle boots. All four are well over six feet tall. <br>\r\n<br>\r\nDan and Hoss are both 100% muscle. They look like body builders, only with understandable waists not those that are weirdly thin. Bill and John look like bodybuilders too, but have really packed on the weight. Both of them had to squeeze over 300 pounds of beer gut and muscle into those worn uniforms.<br>\r\n<br>\r\nNot only were these men beasts, but it was made even more dangerous due to the fact that you are presently at the mercy of your father, and these guys are all ready to make you stink for ages.</span></div></div>",
            "created":1359954000,
            "id":1523975,
            "title":"Confront him about his choice in discipline again"
        },
        "1242":{
            "author_id":"colegreen_102",
            "author_name":"Cole",
            "choices":[
                "Used you as a human toilet",
                "Shrunk you and used you as a seat cushion"
            ],
            "content":"<div class=\"\"><div> <span>You sat on your bed hoping one of them wouldn't come in, suprislingy to your luck they did not. You sat quietly listening to them, they were all talking about how they lived to torture you. That's when you realized you needed to get out of there. You quickly packed up a bag of clothes and food and jumped out your window. You were running to the road until you heard yelling and you knew they found out you snuck out, you decided to jump into your dads car, luckily there's a little cumpartemment under the drivers seatt that your dad did not know about, but that would mean taking a risk of having your dads butt in your face again.<br>\r\n<br>\r\nYou waited a couple of mins and heard yelling and footsteps, you had heard in terror and shock your dad and his friends taking there seats in the car. You were now face to ass with your dads butt again, you had no choice but to be quit and hope no one hears you. They sounded shocked and extremely mad not to any surprise. As the drive went on your dad passed a ton of gas. It was a horrible smell. You assumed your dad was going all over town looking for you with his friends, they were discussing how they were going to torture and punish you. And that made you ensure there was no way you were going to get out of your hiding place. After what seemed like hours the car finally stoped and you were at your house again. You heard them get out and go inside, that's when you got out of your hiding place, not knowing that was a bad idea you looked up to see your dad staring down at you, looking pissed. Your dad yelled at you on ways your getting punished, he first...</span></div></div>",
            "created":1499854800,
            "id":2351945,
            "title":"They ignore you for now"
        },
        "1243":{
            "author_id":"jadow",
            "author_name":"Jadow",
            "choices":[
                "They decide to fart on you all at once",
                "They ignore you for now",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Ever since you turned 7-years-old, whenever the girls were away, and whenever you showed even the slightest sign of disobedience to him, your powerful father made you kiss his ass, to let you know who's in charge, occasionally adding a facesitting to the punishment. But when his buddies ever came over, he'd usually focus on flatulent toilet humor and so did they. These big muscle heads loved getting ready before every trip to your dad when they knew you would be around.<br>\r\nYou remember one of your most scarring memories; It was a few days after your 11th birthday, your mother and sisters went on a trip for a week and you were in your father's capable hands with the help of Dan, Bill, John, and \"Hoss\". only a few minutes after the females left, they told you they had a special present that they've been dying to give you. Unfortunately, when you came in to the living room, they ambushed you, pinned you down, and farted on you all at once for 20 minutes. Their gas marinated into your skin and left you smelling like them, but that was just the beginning.<br>\r\n<br>\r\nFor that week you became their fart magnet. Every time they needed to pass gas, they made sure you smelled it all. Any time their crotch itched, they were sure to give you a good, musky teabagging. Even worse, they made sure to stock up on many things that will make them fart either more or worse, and made sure your face or lap was under somebody's ass while you were still conscious.  <br>\r\n<br>\r\nDan, Bill and Hoss sometimes went easy on you, if you started to feel their muscles and worship their godly bodies, but only if they liked how you did it, if not they'd pin you down on your back. One of them would lower his ass (be it covered or bare) right on your face, burying your face deep in his ass, often making sure to land his rump on your open mouth, and the other would lower his buttocks on your crotch, genly comforting himself on your lap. The rest made sure you didn't turn your head away or you close your mouth, and if you did you'd be punished with all of them farting on you for 10 minutes, smothering every inch of skin on your bare body.<br>\r\n<br>\r\nYour father, Bill, and John's favorite position for you was under their ass. Bill and John would make sure to get the smell of their ass on you by rubbing their asses on your face all the while releasing their flatulance. Your father liked the feeling from the vibrations of your voice begging or mercy from under his ass as he ripped loud trumpeting farts on you. Of course, this is without mentioning the teabaggings he and the others would often give you.<br>\r\n<br>\r\nWhenever you ate, they made sure whatever food you had had a heavy dose of gas to give it a \"kick\".  <br>\r\nAt the end of that week, you reeked of their gas and sweat. It took many showers and brushing to get the smell out. <br>\r\n<br>\r\nTo this day, they still say they were going easy on you just because it was your first time.<br>\r\n<br>\r\nNow back to the story</span></div></div>",
            "created":1368766800,
            "id":1591827,
            "title":"A little history of these guy's torture"
        },
        "13":{
            "choices":[
                "Go downstairs ",
                "Stay and risk it",
                "Someone rings the door bell distracting your dad"
            ],
            "content":"<div class=\"\"><div> <span>Your dad gets ready to leave, but just for fun rips one more loud fart right before he leaves.  The stink that came from that fart was horrible, worse then before, hinting you what is in stock.  You lay down in bed, thinking about how you are going to survive this week.  You know that your dad won't let you go for much time without torturing you, and that he will probably invite his friends to all torture you at once.  You shudder at the thought of all the torture.<br>\r\n<br>\r\nSince your dad left, you think about where he might have went.  Dad loves to torture you on the couch, and that's where you think he is.  He was very simple yet devious at the same time.  After some time, he calls out to you.  \"HEY GET DOWN HERE\" he yells, obviously wanting you to go down to the couch.  You begin to worry as you think about the torture he has in stock.  At first you don't want to go down, but then you realize that if you don't go downstairs, he will come up and probably do worse than what he planned.  You get out of bed, and look at the door, and you still smell the lingering stench of your father's gas. <br>\r\n<br>\r\n\"DON'T MAKE ME CALL AGAIN\" your dad yells, sounding mad.  You only have a few moments to decide, do you stay and risk it or do you go downstairs and face what he has planned.</span></div></div>",
            "created":1423617840,
            "id":1931485,
            "title":"He sits on the couch and later calls you over"
        },
        "131":{
            "choices":[
                "Continue with your head on his lap",
                "Worship his ass",
                "Sleep with him"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go downstairs to take his torture.  You don't want to risk what else he has in store.  You walk down the stairs to see your dad on the couch like you expected.  \"I have been waiting, I was about to come up there\" he says furious about you not coming down when he told you too.<br>\r\n\"I'm sorry, I was asleep\" you lie, worried about what's going to happen next.  <br>\r\n\"Come here\" he says, as you go to him.  He pulls you next to him and makes you sit down.  You are worried about what he is gonna do.  \"Put your head in my lap of you are so sleepy\" he says, in a sweet yet devious way.<br>\r\n\"N-No thanks, I'm fine\" you say, now really worried \"I don't want to bother you\" you say.<br>\r\nHe put his hand on the other side of your head and pulls it down to lap.  \"It's okay son\" he says, holding your head down.<br>\r\n<br>\r\nSurprisingly to you, he hasn't done anything, and he just left your head rest there.  Your eyes start to droop as you really were tired.  That's when he struck.  \"you seem sleepy, I hope I don't inconvenience you\" he says sarcastically as it begins to fart loud and wet farts, that all smell worse than the last.  He holds your head to his lap and doesn't let you move.  Your head is also close to his ass which is why it smells so bad.<br>\r\n\"Dad stop please, let me go\"  you say, begging for freedom, yet he just farts more and more.<br>\r\n\"Okay, fine, I'll stop but you must pick one of following three things to sub it out for\" he says, with an evil grin. <br>\r\n\"What are they?\" you ask, gulping in fear.<br>\r\n\"you must worship my ass, sleep with me in my bed or swallow my underwear whole\" he say, all of them scaring you. </span></div></div>",
            "created":1423618920,
            "id":1931494,
            "title":"Go downstairs "
        },
        "1313":{
            "author_id":"gekigao",
            "author_name":"gaogeki78",
            "choices":[
                "The mouth",
                "The ass",
                "Doorbell rings, dad's friends join in on the fun"
            ],
            "content":"<div class=\"\"><div> <span>\"Bold choice son.\" your dad responded \"I'll be up in a minute.\"<br>\r\n<br>\r\n\"Okay.\" you responded nervously back.<br>\r\n<br>\r\n\"Hold it. When the girls away, I don't believe in clothes while sleeping and you will too.\"<br>\r\n<br>\r\nAfraid of both what will and could happen, you decided to strip out of your pjs rather quickly.<br>\r\n<br>\r\n\"Was hoping for more of a show.\" Your dad said looking a your naked body \"Get in my side of the bed.\"<br>\r\n<br>\r\nYou reluctantly headed up the stairs to your parents bedroom. You knew your dad slept on the right side of the bed. As you approached the bed, you got hit with a big  stench of your dad's fart and musk. You slowly slip under the sheets trying to bear the smell. As you wait for your dad, you notice that your cock is at its full 4 1/2 inches. You knew your dad would have a field day if he saw that. Before you had a chance to take care of it, your dad ripped the sheets clean off the bed to show show that he was not only naked, he was sporting a 14 inch hard manhood.<br>\r\n<br>\r\n\"Well, that worked out well.\"<br>\r\n<br>\r\nYour dad then pinned you down on his bed, purposely making sure that your two cocks rubbed together resulting in a quick moan from you.<br>\r\n<br>\r\n\"So since I'm giving you choices today, where do you want it in first? Your mouth or your ass?\"</span></div></div>",
            "created":1458330600,
            "id":2119439,
            "title":"Sleep with him"
        },
        "14":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Lets Bill take over",
                "Lets Dan take over",
                "Lets Hoss take over",
                "Lets John over",
                "Crush you in a group"
            ],
            "content":"<div class=\"\"><div> <span>Beaten and humiliated by your own dad, you are forced to rub his shoulders while he poisons the house's air with his gassy ass.<br>\r\n<br>\r\n\"Don't be afraid to really dig in there, boy,\" you dad orders as he grunts in relaxation as you knead the meat of his shoulders and slowly move down his arms. You don't want to do this, but every five minutes you must squeeze his 'superior biceps' as he would say.<br>\r\n<br>\r\n\"Dad, why do we have to keep doing this?\" You ask.<br>\r\n<br>\r\nYour dad simply grins at your disgust and sadness. \"Because it's fun. Now shut up or you're gonna get a taste of my foot.\"<br>\r\n<br>\r\nYou hold your tongue and continue to rub your muscled, buff dad's shoulders.<br>\r\n<br>\r\n\"Now move on to my feet, son.\"<br>\r\n<br>\r\nYou reluctantly massage his feet, and he occasionally kicks you in the face as he tries and succeeds to get his sour tasting foot in your mouth. \"Mmmmmmm, you like that?\"<br>\r\n<br>\r\nYou cannot speak with your father' foot in your mouth, and suddenly you find yourself taking the role of a footstool. Your father's manly musk is just starting to dish out your pain, but the main course is yet to be served.<br>\r\n<br>\r\n\"Now listen up, boy,\" your father orders. \"Some friends are coming here to watch the big fight. Now I want you to serve up the burritos and keep 'em coming. Got that?\"<br>\r\n<br>\r\n\"Yes dad,\" you say.<br>\r\n<br>\r\nYou know your dad and is friends. They have no shame when it comes to relieving gas. They will fart loud or silent, with no shame of who hears or smells it. In fact, it's their pride. You know your dad is only feeding them burritos to spite you, and give you a smelly house while the girls are away.<br>\r\n<br>\r\nYou get the burritos ready anyway, and await the arrival of your dad's rugged, smelly friends. Dan, Hoss, Big John and Bill all enter the room and get ready to watch the big fight. None of them are wearing sleeves, and your nose and eyes catch the sour sweat seeping into the fabric of their shirts and glistening around their arm pits.<br>\r\n<br>\r\n\"Hey, boy, get in here,\" your dad orders, and you walk in, scared. \"These guys are here to watch the big fight.\" He then crouches down into a wrestler's starting position, and takes you down easily with his beefed up body. His friends cheer for him loudly while you lay on the floor being crushed by your father's stinky foot.<br>\r\n<br>\r\n\"Time for a knockout,\" said your dad, ignoring your desperate squirms and sits on your face. He pulls his massive globes apart and shoves you into his ass. He wiggles on top of your beaten face and laughs at your misfortune.<br>\r\n<br>\r\n\"Finish him off! Kick his ass! Make him eat your farts!\" Such cheers were chanted by the four spectators repeatedly.<br>\r\n<br>\r\nYou hadn't imagined that this would be their big fight, and you suffered under your father's butt for it.<br>\r\n<br>\r\nFAAAAAAAAAAAARRRRRRRRRRRRT!!!!!!!!!!!<br>\r\n<br>\r\n\"Squirming, son? That all you got?\" Dad asks you before he . . .</span></div></div>",
            "created":1400389200,
            "id":1798648,
            "title":"He orders you to massage him"
        },
        "15":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "Dad's laying down in bed with you",
                "Dad's already in bed with you",
                "Dad's friends are here",
                "You're shrunken",
                "You're in an unusual place"
            ],
            "content":"<div class=\"\"><div> <span>A few minutes later, after your father had finally left you to wallow in his stink, you get up. It is only 7:36 in the morning and you're kinda tired. You decide to go to bed. You don't wash your face because you know that he'll punish you if you do. You climb into your bed and get comfy, until you fall asleep. About two hours pass when your father walks in to check on you.<br>\r\nHe knocks on your door and you wake up. A bit dazed, you quickly fully awaken. He opens the door and you pretend to be asleep, thinking he won't do anything if you aren't awake. He gazes down at you. You tilt your eyes open just a bit and see that his dick is fully erect and sticking out of his zipper. He is wearing light blue jeans and a blue buttoned shirt, unbuttoned at the top, showing his big pecs. He places his great dick directly on your lips. You can't react, afraid of what could happen. He begins to smack your lips and cheek with his cock, before placing his dick head back on your lips, wiping your lips with his fat head. He then turns around, bends over with his buttocks just above your face, and lets out a strong fart directly on your lips. The taste is horrendous, but you can't do a thing, or else he'll know you're awake.<br>\r\nHe turns back around<br>\r\n\"Damn, WHAT A STINK! Mmm a whole week. Damn, this is gonna feel so good!\" He states, \"I'm the true man, I'm the king of this castle, and I'll take my time dominating you, until I'm satisfied.\"<br>\r\nHe begins to walk out of your room<br>\r\n\"By the way, boy, quit pretending to sleep, it's pathetic!\"<br>\r\nyour eyes fully widen with fear. He exits the room and you are left there.<br>\r\nHorrified, you are still very tired. Well, you decide to just go back to sleep<br>\r\n<br>\r\nYou wake up again at 10:09, and...</span></div></div>",
            "created":1359867600,
            "id":1523945,
            "title":"You just go back to bed"
        },
        "153":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "They torture you all together",
                "They torture you one at a time",
                "You start to tell the truth"
            ],
            "content":"<div class=\"\"><div> <span>All of your Dad's friends were here. Dan, Hoss, \"Big\" John and Bill were talking to your father as you were still in your room. After what happened earlier, you were afraid of what your father and his friends would do to you. When you were 10, you started to get random erections from them torturing your weak body when your mom and sisters were gone for a vacation. They farted all over you until they made you cum. The smell that lingers from this barely went away last time. \"Boy, get down here!\" Your dad yelled from downstairs. You were afraid but you went downstairs to meet your tormentors again in fear of refusing to do what he asked.  When you made it downstairs, the four of them grinned at you. All four of them shook your hand and talked to you for what's to come. You cower in fear because you knew that this was the calm before the \"storm\".  <br>\r\n<br>\r\n<br>\r\nYour Dad and his friends start to take off their clothes, leaving them in white t-shirts and briefs. Today has been a very hot day, you can see this because they started to sweat. Your Dad and his friends slowly walked up to you to begin the torture while saying, \"Let the games begin!\" </span></div></div>",
            "created":1415077200,
            "id":1881670,
            "title":"Dad's friends are here"
        },
        "154":{
            "author_id":"sage94",
            "author_name":"guys_rule",
            "choices":[
                "He farts",
                "The doorbell rings",
                "The phone rings"
            ],
            "content":"<div class=\"\"><div> <span>You were pinned under your dad's massive size 14 foot. Your head was in between his sweaty big and second toe. He spread them apart so that he could see your tiny face scrunching up from the horrible smell.<br>\r\n<br>\r\nWhen you finally wake up you try to move but feel restrained. Your vision clears as you look down the length of a strange floor you are sitting on. Your back is against something and your hands are bound behind you as well. <br>\r\nSlowly your senses return, There is a smell of sweat<br>\r\n<br>\r\n\"Looks like you are enjoying yourself down there shrimp!\" he laughs. You are shocked and not sure exactly how this happened. Your dad is now HUGE, literally! How did you get so tiny?<br>\r\n\"D-day w-w-w-wha-?\"<br>\r\n<br>\r\nNormally, he was huge compared to you, but now he was godly. He seemed like a living skyscraper. You looked up and took it all in while begging for his mercy. His beefy hairy legs climbed to the sky. His shorts were loose and you could see up to his monster bulge. Unfortunately, you could see his junk hanging since he was going commando. Bending over, you noticed just how gigantic his chest and arms were, squished into a really tight white t-shirt. <br>\r\n<br>\r\nIt unnerved you when you saw the evil glint in his eyes. He licked his goatee surrounded lips in anticipation. You were still in shock when he moved his foot forward covering your entire body. He rolled you around roughly on the ground. Loud chuckles filled the room as you cried out in pain.<br>\r\n<br>\r\nWhen he lifted his foot off, you breathed a sigh of relief. Until of course you looked back up and saw him stripping off his tight shirt. He through it over to a chair and took a whiff of his pits, \"Man - I smell awesome little bug!\" Then, he slid off his pants and you stared up, frozen looking at his growing fat cock. Your dad was now standing over you completely naked. The musk was nearly overbearing. <br>\r\n<br>\r\nYou decided that this was not good at all and got up to sprint for the nearest exit. Before you get anywear, you notice a giant shadow. You look up and see that it is your father's ass, slowly sitting until he lands firmly on your body. Surprisingly, you're not dead, but you hear your father's stomach rumble.<br>\r\n<br>\r\nThis has been a fast one minute, but suddenly...</span></div></div>",
            "created":1359867600,
            "id":1523951,
            "title":"You're shrunken"
        },
        "1541":{
            "author_id":"hello396",
            "author_name":"Heloo5789",
            "choices":[
                "It's his friends",
                "His new fart powder has arrived"
            ],
            "content":"<div class=\"\"><div> <span>PPPPPPTTTTTSSSSHHHHHH <br>\r\n\"Ahhhhhh, that felt so good, and I bet you just love the smell don't you.\"<br>\r\nIt smelled absolutely terrible. You feel your dad's cheeks clench as he stands up and puts on his sweatpants. He walks down to the kitchen and he begins to eat the black bean soup he made yesterday. <br>\r\nBBBBUUURRRPPP<br>\r\n\"Man boy can you believe I at that whole pot of soup and the 60 deviled eggs I made this morning.\"<br>\r\nYour stomach drops <br>\r\n\"Looks like you will have a lot to smell this coming weekend. Well I'm going to go for my run, don't go anywhere. ... oh wait you can't. \" Your father begins his run and he begins to sweat.  The sweat drips down into your face and you end up swallowing it. He then begins to fart <br>\r\nPPPPPPTTTTTSSSSHHHHHH <br>\r\nPPTTTHHH<br>\r\nPPPPSSSPPPOOOOSSSSHHHHH<br>\r\nThe farts mixed with the heat cause you to fell light headed but you unfortunately stay conscience throughout the entire run. When you arrive back home your father sits and watches TV for another hour.  Then the doorbell rings. ..</span></div></div>",
            "created":1507606320,
            "id":2398959,
            "title":"He farts"
        },
        "1543":{
            "author_id":"alcapoco",
            "author_name":"AlcaPoco",
            "choices":[
                "\"Rubbing my balls\"",
                "\"Massaging my feet\"",
                "\"Scratchin' my ass\""
            ],
            "content":"<div class=\"\"><div> <span>You slide easily between your fathers cheeks, you could feel your feet lose contact with the carpet. You were being smooshed between your dads furry cheeks and could hear him chuckle.<br>\r\n\"Comfy in there? Well consider it your new home for the weekend!\". Just then the phone rang, and your 'home' jiggled slightly as your father stood up to answer it. He scratches his exposed nuts as he picks up the phone, you struggle in vain in the fleshy prison to no avail, and instead begin to try to listen to the conversation.<br>\r\n\"Yea yea I'll make sure he does his chores, yes trust me he'll be safe.\" Your father says with a chuckle, clenching his cheeks and letting out a rancid fart. You gag and ponder what dad has planned, he has shrunk you and obviously plans to not let you off his rancid body for the whole time.<br>\r\n\"Okay...love you too, bye.\" You hear the phone hang up and your father sighs with content and your home squeezes you as he sits down in his lounge chair and let's out a long fart before reaching around and fishing you out and putting you on his thigh.<br>\r\n\"Well boy get to work by..\"</span></div></div>",
            "created":1376283600,
            "id":1644965,
            "title":"The phone rings"
        },
        "15431":{
            "author_id":"scampers36",
            "author_name":"Scampers36",
            "choices":[
                "His balls",
                "Drags you up to his massive cock"
            ],
            "content":"<div class=\"\"><div> <span>Your Dad peels you out of his massive, godly ass easily between his two huge fingers. The giant, evil man sits down, criss crossing his legs and sets your teeny little 13 year old self in the middle. Above you is your Dad's massive cut, throbbing and bulging with veins. Just below that are the massive orbs of your Dad's balls, the very same ones you came from.<br>\r\n\"You see those son?\" Dad booms down at you in his masculine voice. \"You came from those. I MADE you. And now look at you, so tiny and helpless. I could do anything I want to you. You should be thanking me that I allow you to live! \"<br>\r\nYou shudder and tremble, the musk from Dad's crotch is thick and hot, the sweat on his balls make them glisten. Dad reaches down and grabs his gigantic cock in his strong grip and slowly begins to jerk it, a huge evil smile on his face as he watches you, his helpless, young, puny son obey. You fall on your hands and knees and tearfully, crawl to the huge smelly orbs and start to rub. Dad groans and curls his toes, feeling your tiny hands on his old rugged balls. <br>\r\n<br>\r\nThen you feel something happen to you, your Dad uses his other hand to press you against...</span></div></div>",
            "created":1399352400,
            "id":1792766,
            "title":"Worship the creator"
        },
        "154311":{
            "author_id":"sage995",
            "author_name":"sage995",
            "choices":[
                "he shoves you in his armpit",
                "he shoves you inbetween his ass cheeks"
            ],
            "content":"<div class=\"\"><div> <span>your dad pushes you up to his sweaty ballsack, 3x the size of you! you feel the sweat dripping all over you and you struggle to escape out of your dad's grasp<br>\r\n<br>\r\n\"haha! keep trying baby boy, it gets me even hornier when you do that, i think ive found a perfect use for you, lets test this!\" you knew you were in trouble now.<br>\r\n<br>\r\nyour dad starts massaging you right in his gigantic balls, you felt every wrinkle, every drop of sweat, you heart every laugh, every moan that came out of your dad. \"lets change things up, just a tiny bit\" he said as he dropped you on the ground. you tried to get up and make a run for it. \"oh no you dont!\" he said as he dropped his giant balls on your body, trapping you inbetween them and the carpet. you look up and see your father smirking down at you.<br>\r\n<br>\r\n\"this is fun isnt it runt! i might just keep you at this size forever!\" he laughed and then stopped suddenly. \"ive got a great idea!\" you were sure you werent gonna like this.<br>\r\n<br>\r\nhe lifted himself up a bit and pushed you further under him and sat right on top if you, your legs smooshed inbetween his two ass cheeks and your shoulders upwards out and looking straight up at him, he was holding his giant dick and balls, they looked even bigger from this position. <br>\r\n<br>\r\n\"say goodnight, runt\" he dropped his gigantic balls on your face, smothering you completely under his body. you tried to move but your legs were trapped inbetween his hairy cheeks and your arms were under him, your face covered in sweaty balls.<br>\r\n<br>\r\nafter 10 or so minutes he started to grind on you. \"yeah boy, feel every part of me.\"<br>\r\n<br>\r\nhe then lifted you out of there, you thought he was giving up, boy were you wrong.<br>\r\n<br>\r\n\"ive worked up quite a sweat off that boy, why dont you feel!\"</span></div></div>",
            "created":1515205260,
            "id":2437228,
            "title":"His balls"
        },
        "1543111":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Go to the gym",
                "Have a few beers while we watch the game",
                "Go fishing at the cabin"
            ],
            "content":"<div class=\"\"><div> <span>Your dad shoved you into his armpit. You are quickly soaked by his sweat as he presses you harder. He starts to rub you around and you get all tangled in the hairs. When he removes his fingers you find yourself stuck in place. The phone rings interrupting what he was about to tell you. “Hold tight while I get this.” He smerks as he  lowers his arm trapping you in the sweaty and hairy prison. As he walks your rolled around in the pit. You can hear your dad talking to one of his buddies. He agrees to something and hangs up. Walking back to the living room your da sits down befor raising his arm to talk to you. <br>\r\n<br>\r\n“That was the boys. Me and them are going to...”</span></div></div>",
            "created":1549823820,
            "id":2615690,
            "title":"he shoves you in his armpit"
        },
        "15433":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "You scratch his ass (and hate it)",
                "You scratch his ass (and like it)"
            ],
            "content":"<div class=\"\"><div> <span>With tears in your eyes, you nod your head, knowing that fighting back would only make your situation worse.<br>\r\n<br>\r\nYou look up at your extremely tall, sadistic father, he has an incredibly well muscled body, with just enough fat to make him truly huge and intimidating to any man. The massive bully bends down towards you with an evil grin on his face,<br>\r\n“Don't worry, boy, your big, mean daddy will take care of you.\" Your father states, in a mocking tone, \"Now close your eyes and don’t move, got it, kiddo.”<br>\r\nYou agree kind of worried what this big beast is going to do to you. In the darkness of your closed eyes you can sense some large shadow enveloping your form, your father must be inspecting you or something. Then you quickly get pushed down into two hard, but clothed objects.<br>\r\n<br>\r\nAs a massive almost unbearable weight settles on you, you open your eyes to see where you are but when you open them you see nothing but darkness. But as your eyes adjust you see you are trapped under something firm… slightly jiggly… and warm… with a hairy texture. You’re under your father's ass! And what’s worse is this bully of a dad has taken his briefs off fully exposing his big, hairy ass to you. Now it’s just you, the carpeted room floor and your father's huge ass cheeks that you’re sandwiched between. You try to move your arms to wriggle free but you realize that they are both crushed underneath each respectable ass cheek. Your dad feels this and pats his ass,<br>\r\n“Having fun down there kid?\" He mocks, \"Don’t worry, your old man's about to turn up the heat.” You start to wriggle and squirm even more, knowing exactly what he means by ‘turn up the heat’. But then the hairy, sweaty, and of course, rancid cheeks clench around you, squishing and compacting you more and, in a sense, sucking you deep into your bully of a father's ass crack. Ahead of you in the deep canyon that is your dad's crack, you feel something like a pucker move about as if it is trying to push something out. You begin to scream, cry, and beg,<br>\r\n\"NO! DAD, PLEASE DON'T FART ON ME! PLEASE!\"<br>\r\nYour father chuckles, \"You like making me look like a fool?\" He asks, \"You think being a weak, pathetic little brat makes me look bad?\" He laughs, \"Well, my boy, sorry to disappoint you, but all you've done was give yourself to me, a fresh dish of bully meat.\"<br>\r\n\"OH GOD NO!\" You yell, then suddenly you hear it, [PPPPPFFFFFFTTTTTTTT]. The massive, hugely-build, 40-year-old man you call a father just farted on you! A horrendous fart, filled with the stink of rotten eggs and broccoli. As your father groans with relief, you choke and tear up a bit from the immense gas blast. chuckles,<br>\r\n“You know what, boy, that actually felt good. Even better than farting on you normally!” You tremble in fear crunched between his two butt cheeks, terrified of your father.<br>\r\n\"Now, I wonder, didn't I order you to do something for me?\" He asks,<br>\r\nWell, if you had any dignity before, it's officially time to kiss it goodbye.</span></div></div>",
            "created":1389243600,
            "id":1724532,
            "title":"\"Scratchin' my ass\""
        },
        "154331":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "You hear a grumble from his stomach",
                "You get sucked in"
            ],
            "content":"<div class=\"\"><div> <span>You scratch his ass and you hate it. As you​ do so you hear your dad laugh at you. At this point you were so filled with anger at him that you lashed out against him even calling him a \"no good rotten meat head\" when you finish you rage you realizes what you done as now your dad is standing up with you in his hand he yell \"your a good son who can't respect his own father and that your punishment need to be worse\" then with that he brings you face his asshole and he starts to remove his berifs to expose hi large butt to you then with no effort on his end he shoves you up and press you face first against  his asshole he removed his  then he put on his berifs trapping you in his ass thing get worse when</span></div></div>",
            "created":1494996000,
            "id":2320771,
            "title":"A Even worst fate"
        },
        "1543312":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "content":"<div class=\"\"><div> <span>His asshole start to pull you in slowly first your head then your chest when your dad reach your feet he had to fart so he released the gas with you still trap  then he sucked you up in to his asshole and there you spent your week except when the grill came back he didn't let you he just told the grill that you ran away so now your when your dad's a lone he takes you out and tortures you  and when the guys are here it becomes hell on Earth but you can never escape from it and that how your going to spend the rest of you life to the day you die.</span></div></div>",
            "created":1494996360,
            "id":2320773,
            "title":"You get sucked in"
        },
        "154332":{
            "author_id":"dog56",
            "author_name":"Stray",
            "choices":[
                "I want to be a inside of his ass! (anal vore)",
                "I want to pleasure dads cock!"
            ],
            "content":"<div class=\"\"><div> <span>As your sadistic father says this he ever so slightly lifts his ass off of you.<br>\r\n\"Get in there good!\" He said loudly laughing and working his anus around your body as you began to stand up. After managing to sit criss-cross style, your father sits back down but with his ass spread a bit.<br>\r\n\"Don't think about running.\" He said. \"Just try it and I'll clench and put you back in the gas chamber faster than you can blink!\" He laughed uproariously at this. You almost begin to cry but you manage to hold back and you begin to scratch your pop's enormous ass cheeks. Using both hands you scratch the horrendous smelling and hairy flesh. <br>\r\n\"OOOOOH YEEEEeeeaah!\" He groans in pleasure. \"God I love ya boy!\" He said somewhat loving and you smiled a bit. You try your best to stand and start scratching a bit more vigorously. As you worked his beefy rump he wiggles his ass a bit continuing to moan erotically.<br>\r\n\"Why dont you give your old man a kiss?\" At that point you felt him push down harder and his anus met your face. Before you could say no you were making out with daddies butt hole. He pushed it down over and over to resemble kisses. Pretty soon you couldn't even think straight. You began kissing back. Grabbing a hold of his inner butt fat and lapping at his hole you began to feel a bulge going in your underwear. Before long you are willingly sniffing the powerful butt odor. It was awful but... manly... mighty. Dad will take care of me as long as I'm here. I think... it will be better for me. I licked his ass one more time scratching the flab part that made him kick like a dog. Has he always smelled so good? Has his ass always been this warm and cozy. Snuggling up to the inner ass fat you suddenly think...</span></div></div>",
            "created":1453162620,
            "id":2091135,
            "title":"You scratch his ass (and like it)"
        }
    },
    "info":{
        "author_id":"sage94",
        "author_name":"guys_rule",
        "brief_description":"When the girls are away, your father will play",
        "created":1358777580,
        "description":"<td align=\"left\" class=\"norm\">Based on <b>A Day with Dad</b> by lovef33t Also, the name may change, so if you like what you read, fav me so you can still read and write on.<br>\r\n<br>\r\nYou are a 13 year old boy. You try to live a normal life with your family, but your 40-year-old-father has been treating you differently since you turned 7, especially when you two are alone. The girls in your family have decided to have a girls only vacation and left you alone at home with your 40-year-old-father. He is about 6' 5\", handsome, rugged, and has an exceptionally-sculpted and well-defined musculature honed from years of physical training.<br>\r\n<br>\r\nOften for punishments he has you give him a massage or force you to smell him, especially after either a workout or a gassy day, but you never quite knew why he had you do this. It's almost as though he takes pride in it. He loves to wear underwear around the house, and sometimes after a long day he'll stuff his underwear in your face for \"fun.\"<br>\r\nNo matter what, you could never do anything to stop him. Your father is so much bigger, stronger, and smarter than you, it's practically impossible. Your dad's friends, Dan, John, Bill and Hoss are all assholes. They come over and drink with your dad whenever the women in your house are away. Unfortunately, they all enjoy picking on you and humiliating you with your dad. He has a lot in store for you this week.<br>\r\n<br>\r\n<b>Characters</b><br>\r\nYou- whatever you want to be, or basically you as a 13 year old.<br>\r\n<br>\r\nDad- your buff, 40-year-old father. Although he's been treating you weirdly since you turned 13, he's been a bit unusual before then. When you started getting erections when you were 10, you slightly remember a moment where he whispered something in your ear and kissed you on your cheek, even grunting sexually.<br>\r\n<br>\r\nWhatever, anyways, at 6'5 and 310lbs, your father is a giant of a man with his unbelievable size and muscle. However, his core is also very developed, so while buff and having abs, he does not have a thin waist. He is like a comic book hero stepping off the pages with his huge proportions and every muscle and curve just bulging in front of our eyes.<br>\r\n<br>\r\nDad's buddies:<br>\r\n<br>\r\nDan- a handsome hunk that loves to show off his incredible body. Your eyes easily linger over big muscles and hard abs as he flexes while his beautiful ass captures your full attention.<br>\r\n<br>\r\nHoss- a handsome, beefy muscle man with a laid back attitude. At ease in front of the camera, he knows how to hit his poses and flex his muscles to perfectly tease viewers. Seeing his muscles pour out of his posers its hard not to appreciate every inch of his body, front AND back.<br>\r\n<br>\r\n\"Big\" John- unlike Dan and Hoss, John more resembles a muscle man you'd see at a strongman festival. He is covered in muscle, but has a thick waist. This, of course, isn't saying the others have \"thin\" waists, as they are thick, but still have visible abs. Thick muscle is what he's got and he knows a hard workout will help him get even bigger, but he doesn't care at all about shredding fat.<br>\r\n<br>\r\nBill-  his body is like John's, big and buff, but with a thick waist because of all his core muscles. Bill's charismatic performances of muscle flexing are magnetic...he draws you in like a moth to a flame. His bright smile lightens even the darkest surroundings. Simply put in two words, OH JAYZUS!<br>\r\n<br>\r\nOnce again, this is based off of another story you can view here:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1780579-A-Day-with-Dad\" target=\"_blank\">http://www.writing.com/main/interact/item_id/1780579-A-Day-with-Dad</a><br>\r\nI created this story because the other story focused more on foot fetish, so if that's your thing and you obsess over it, either add a few of those chapters here or a lot of chapters there. I got this idea from <b>The Boy</b>, who's work you can view here:<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.writing.com/main/portfolio/view/cooldude9404\" target=\"_blank\">http://www.writing.com/main/portfolio/view/cooldude9404</a><br>\r\n<br>\r\nRules:<br>\r\nThis is a GAY story, okay, male interaction only<br>\r\nTry to be creative, anything is good, but creativity makes Dad look better<br>\r\n<span class=\"clred\">Allowed</span><br>\r\nsweat<br>\r\nworship<br>\r\nfarts<br>\r\nurine<br>\r\nsmothering<br>\r\nshrinking<br>\r\ndomination and submission<br>\r\nmain character can be sexually excited<br>\r\nSex/rape (just don't make it depressing)<br>\r\nAdding other men (but try messaging me first)<br>\r\n<span class=\"clred\">Not allowed</span><br>\r\nshort entries<br>\r\nGrowing<br>\r\nsexual descriptions of the main character (he's only 13, it's his dad whose hot)<br>\r\n<span class=\"clred\">Maybe</span><br>\r\nScat (message me if you want to add this, but unless I give the okay, no scat)</td>",
        "id":1914593,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1549823820,
        "modified":1549823820,
        "pretty_title":"A boy and his Dad"
    }
}