{
    "chapters":{
        "1":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "Julia",
                "Kate",
                "Piper",
                "Jess",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>The girls <br>\r\n<br>\r\nJulia <br>\r\nBrown hair<br>\r\nBlue eyes<br>\r\nHeight 5'4<br>\r\nStarting weight 130lbs<br>\r\nAge 16<br>\r\nShape  pear<br>\r\n<br>\r\nJulia is a laid back girl who loves sports and is pretty fit.<br>\r\nJulia comes from a long line of overweight pear shape women.<br>\r\nBoth Julia's parents are overweight and fine Julia's love of sports weird .<br>\r\nUnkow to her her mom sent her to be plumpped up .<br>\r\nJulia's starting body type A cup breasts six pack abs wide but boney hips big butt.<br>\r\n<br>\r\nKate <br>\r\nHair blonde<br>\r\nEyes green<br>\r\nHeight 5'7<br>\r\nAge 16<br>\r\nStart weight 100lbs<br>\r\nShape none<br>\r\n<br>\r\nKate wants to be a modle and to do this she try's not to eat very much.<br>\r\nShe is underweight and her parents are worried so they send her to camp to get her here they told her it was a modling camp.<br>\r\nStarting body type flat flat chest flat butt tiny hips just plan boney<br>\r\n<br>\r\n<br>\r\nPiper<br>\r\nHair black<br>\r\nEyes blue<br>\r\nHeight 5'4<br>\r\nWeight 135lbs<br>\r\nAge 17<br>\r\nShape pear<br>\r\n<br>\r\nPiper is   gay and likes larger girls .<br>\r\nPipers mom sends her to this camp knowing that piper likes larger women and thinks piper should gain a few</span></div></div>",
            "created":1372395600,
            "id":1619137,
            "title":"The girls"
        },
        "12":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "talking with other girls",
                "unpacking in her cabin",
                "at the mess hall",
                "greeted by a counsler",
                "receiving an introduction and pills"
            ],
            "content":"<div class=\"\"><div> <span>Kate was an aspiring model who had it all, beauty, long blonde hair, smooth skin, piercing green eyes, and bones. Kate was utterly bereft of any flabby flesh. The devoted girl deprived herself of necessary calories which prompted her concerned mother to take action. Kate's mother, Naomi was a healthy 220 pound woman cooking sumptuous meals for her emaciated daughter only to have her turn them down. Watching her daughter's body exhibit the rims of her bones, Naomi seeked council, which she found in a peculiar camp. The camp specialized in fattening girls, promising obesity in even the most recalcitrant of girls. Naomi quickly acted and enrolled her anorexic daughter. Knowing full well Kate would object, Naomi lied to het saying it was a modeling camp, Kate immediately accepted.<br>\r\n<br>\r\nAt the present Kate is located at the camp amongst dozens of other girls destined to be fattened. Like Kate, the other girls were lied to as well. The misconceptions varied from sports camps from parents who wanted their daughter to veer away from athleticisms, to weight loss camps for girls far too obsessed with being thin, to even an average summer camp. The camp was aware that most of their campers were purposely mislead so they remained ambiguous about their intentions.<br>\r\n<br>\r\nCurrently Kate is...</span></div></div>",
            "created":1507957200,
            "id":2401009,
            "title":"Kate"
        },
        "125":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "had her first meal",
                "changed into her uniform",
                "went to her cabin"
            ],
            "content":"<div class=\"\"><div> <span>Kate is sitting alongside the other girls listening to an introduction. <br>\r\n<br>\r\n\"Hi girls!\" greeted a cheerful portly woman.<br>\r\n<br>\r\n\"Huh she's kindof fat for a modeling instructor. Then again some ladies do let themselves go when they retire.\" Kate thought staring at the hefty counslor. <br>\r\n<br>\r\n\"I hope you ready for a summer filled with fun and activities!\" enticed the woman provoking the girls to cheer.<br>\r\n<br>\r\n\"I wonder what type of modeling activities they have planned.\" Kate wondered. <br>\r\n<br>\r\n\"Okay now before I tell you the camp's schedule, counselors will be passing out pills for you to take.\"<br>\r\n<br>\r\n\"Oh boy diet pills! Like the real models!\" Kate thought quickly taking a pill without hesistation.<br>\r\n<br>\r\n\"Performance enhancing drugs!\" thought others which couldn't be any farther from the truth. The pills that the oblivious girls were taking were hyper appetite enhancers and metabolism crushers. <br>\r\n<br>\r\n\"To fully benefit from our camp you'll need to take these pills everyday. Now lets get started, you'll be assigned to a cabin with other girls. In the cabin you'll find a refridgerator, a television with game system, and a large comfy bed for each girl.\" said the woman purposely leaving out the lack of mirrors(so they won't notice their growing body) and scented candles which incite cravings. Also how the fridge was stocked with rich foods.   <br>\r\n\"Everyday you'll participate in an activity, followed by a compulsory nutritious meal. You'll have lots of free time to do whatever you want. You could eat at the mess hall, play video games at our arcade or in your cabin, you could relax in the spa or in our hot springs. We end each day with a late night dinner followed immediately by bed.\" instructed the counselor omitting details such as the hot springs and spa are very foggy preventing girls from seeing themselves or others, and the massive servings at each mandatory meal, and that the arcade was filled with tempting vending machines.<br>\r\n\"Now for your uniforms you'll be wearing our camp's signature skirt and tank top and for swimming you'll be issued a fashionable bikini. As of tonight any other clothes are forbidden.\" she said leaving out that the clothes are incredibly elastic and able to stretch to any size, preventing awareness of their gains.<br>\r\n<br>\r\n\"Oh wow the uniform sure is cute! I wouldn't expect any less from models.\" Kate smirked.<br>\r\n<br>\r\nAs the lecture concluded, Kate...</span></div></div>",
            "created":1507957200,
            "id":2401028,
            "title":"receiving an introduction and pills"
        },
        "13":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "Go to the cabins",
                "The mess hall"
            ],
            "content":"<div class=\"\"><div> <span>Piper black hair  blue eyes she stood at 5'4 weighed in at 135 pounds she is age 17.<br>\r\nPiper isnt thin but isnt fat she is an B cup bra her belly is a liittle soft hips wide and flared thighs thick butt wide and jiggle piper is very pear shape.<br>\r\nPiper is openly gay &amp; what one would call a chubby chaser piper was very happy to be at an all girls camp.<br>\r\nStood at the camp holding some paper it told her where she needed to go.<br>\r\n<br>\r\nThe paper said piper needed to <br>\r\n<br>\r\n</span></div></div>",
            "created":1373605200,
            "id":1626834,
            "title":"Piper"
        },
        "15":{
            "author_id":"bellies01",
            "author_name":"Bellies01",
            "choices":[
                "A softball team whose coach thinks they are too small?",
                "The fat girl whose parents thought they were sending her to a weight LOSS camp?",
                "Even more options?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options?</span></div></span></div>",
            "created":1559883600,
            "id":2670088,
            "title":"More"
        },
        "151":{
            "author_id":"bellies01",
            "author_name":"Bellies01",
            "choices":[
                "Caroline",
                "Mackenzie",
                "Caitlin"
            ],
            "content":"<div class=\"\"><div> <span>Which of the softball girls will be our focus?<br>\r\n<br>\r\nCaroline<br>\r\n5'10<br>\r\n140 lbs<br>\r\nHair: Blonde<br>\r\nEyes: Brown<br>\r\nAge: 18<br>\r\n- Caroline has always had a tall, athletic build, with a pretty face to match, with long legs and a toned waist.<br>\r\n<br>\r\nMackenzie<br>\r\n5'0<br>\r\n95 lbs<br>\r\nHair: Brown<br>\r\nEyes: Blue<br>\r\nAge: 17<br>\r\n- Unfortunately, the team's pitcher, Kenzie, is very undersized. While she has a good arm for someone so tiny, she could definitely use some more mass. She is quite petite, with A cup breasts, very long legs for her height, and a tiny belly.<br>\r\n<br>\r\nCaitlin<br>\r\n5'3<br>\r\n140 lbs<br>\r\nHair: Light brown<br>\r\nEyes: Green<br>\r\nAge: 17<br>\r\n- Caitlin is already on of the chubbier girls on the team, and one of the best hitters. She has a definitive pear shape, with a set of solid C/D cups, a round, pudgy muffin top, w i d e hips, and an ass that would make Kim Kardashian Jealous</span></div></div>",
            "created":1559883600,
            "id":2670093,
            "title":"A softball team whose coach thinks they are too..."
        },
        "1512":{
            "author_id":"bellies01",
            "author_name":"Bellies01",
            "choices":[
                "The beach on the lake",
                "The dining hall",
                "Sports area"
            ],
            "content":"<div class=\"\"><div> <span>Kenzie stepped off the bus with her softball teammates. “What even is this place?” She asked. Caroline responded “I have absolutely no idea. Maybe it’s-“ “I don’t know, but someone’s cooking and it smells soooo good.” interrupted Caitlin. The girls checked in to camp, and proceeded to their rooms. As her friends finished unpacking their things in the rooms on either side of hers, Kenzie looked in the large mirror in her room. She looked at her tiny figure, having no idea what would soon become of it. Her (relatively) long legs were skinny and toned, there was barely a belly to speak of on her, and even though her ass was small, it still had a nice shape to it. She didn’t know it yet, but before too long she would have a better summer body than ever before. While looking around her room, she noticed something that she had never seen at any other camp: a full-sized refrigerator. Kenzie remarked to herself how nice that was, but didn’t think anything of it. Before she could really get settled in, somebody came knocking on her door. Caitlin yelled out “Kenz, come explore the camp with me! Where do you want to go first?”</span></div></div>",
            "created":1559970000,
            "id":2670372,
            "title":"Mackenzie"
        }
    },
    "info":{
        "author_id":"spuffyromy",
        "author_name":"spuffyromy",
        "brief_description":"A camp where girls get fat.",
        "created":1372406220,
        "description":"<td align=\"left\" class=\"norm\">So parents send thier girls to this camp unknowingly to the girls to fatten them up.<br>\r\nThe girls can't know what the camps for till later once their stuck at the camp.<br>\r\n<br>\r\nRules <br>\r\nFemale gain only<br>\r\nNo gaining 100 pounds one day kinda thing<br>\r\n</td>",
        "id":1940555,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1559997480,
        "modified":1559997480,
        "pretty_title":"Girls fat camp"
    }
}