{
    "chapters":{
        "1":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to call Daniella",
                "Emma decides to sit down and watch TV",
                "Emma decides to start her chores",
                "Emma gets a phone call from Daniella"
            ],
            "content":"<div class=\"\"><div> <span>   Emma came home from her very first day of highschool. She was freshman, she was absoultely new to the school. <br>\r\n   But the worst part was that her best friend, Daniella wasn't in any of her classes. They didn't even have lunch together. It was terrible.<br>\r\n   \"Make new friends,\" her mom would say, \"Quit bein' shy, Emma, you gotta learn that.\"<br>\r\n   For years, she had been know as the \"quiet\" kid. The \"mouse\" of the school. She was shy. She didn't care if she talked to anybody, she just wanted to talk to her friends. And there was nothing to say. There was definately nothing to say. All of this was on Emma's mind when she realized she was the only one home in the house.</span></div></div>",
            "created":1029992400,
            "id":117806,
            "title":"Intro"
        },
        "11":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Daniella isn't home",
                "She gets the answering machine",
                "Daniella is home"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   Emma sighed as she picked up the phone.</span></div></span></div>",
            "created":1032325200,
            "id":121605,
            "title":"phone"
        },
        "111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Bored, Emma flips on the television",
                "Emma decides to go for the refridgerator"
            ],
            "content":"<div class=\"\"><div> <span>Emma dialed her best friend's number. \"Hello?\" a friendly voice asked. It was Daniella's mother.<br>\r\n<br>\r\n\"Is Daniella home?\" Emma asked, timidly.<br>\r\n<br>\r\n\"No, she's out with a friend,\" her mom explained. \"Good-bye, Emma. I'll tell her you called.\"<br>\r\n<br>\r\n\"Bye,\" Emma said, plopping down the phone. Emma wondered who the new friend was that Daniella was hanging out with. She sighed.</span></div></div>",
            "created":1112418000,
            "id":242694,
            "title":"Not home"
        },
        "1111":{
            "author_id":"jo2005",
            "author_name":"purplelove3121",
            "content":"<div class=\"\"><div> <span>and sits on the beautiful long green sofa in the living room and begin watching the evening news. A news story about the presidentia campaign fills the room, but she's so immersed in her thoughts about her friend not being in any of her classes that she doesn't hear the report. She wonders if her is right that she make new friends. Just then the telephone rings.  </span></div></div>",
            "created":1219986000,
            "id":575736,
            "title":"Bored, Emma flips on the television"
        },
        "1112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "not very hungry after all, so she decides to close the refridgerator",
                "Takes something out of the refridgerator"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma was...</span></div></span></div>",
            "created":1112418000,
            "id":242695,
            "title":"To be Hungry or not to be Hungry"
        },
        "11121":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "go upstairs and listen to music",
                "head for the TV"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Closing the refridgerator door, Emma decides to...</span></div></span></div>",
            "created":1112418000,
            "id":242696,
            "title":"Not hungry"
        },
        "11122":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "An apple",
                "A chicken sandwich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma chooses...</span></div></span></div>",
            "created":1140498000,
            "id":302884,
            "title":"Emma chooses..."
        },
        "111221":{
            "author_id":"lyn_ette",
            "author_name":"Lyn_ette",
            "choices":[
                "She masturbated, thinking of sucking a cock",
                "your story"
            ],
            "content":"<div class=\"\"><div> <span>As she is closing the refrigerator door, she sees a bunch of bananas and takes on, putting the apple back.<br>\r\n<br>\r\nShe peels the banana absent mindedly then looks at it. Long, thin, with a rounded top. Like a cock, at least what she imagined a cock would look like. Using her teeth, she nibbled a groove around the top, to make it look circumcised.<br>\r\n<br>\r\nWonder, she thought, if she could swallow a cock that big? She opened her mouth and held her head back, Slowly she slid the banana into her mouth and back until it touched the back of her throat. Concentrating, imagining it was a hot, hard cock, she pressed further. To her surprise she didn't gag.<br>\r\n</span></div></div>",
            "created":1291408140,
            "id":1007469,
            "title":"An apple"
        },
        "1112211":{
            "author_id":"dataggz",
            "author_name":"Zero",
            "choices":[
                "Daniella",
                "An unknown number"
            ],
            "content":"<div class=\"\"><div> <span>As she slides the banana further back, she feels a heat between her legs like she has never felt before. She was horny, hornier than she has ever been. She used to left hand to hold the banana and she used her right hand to caress her firm breasts. At 14, they are pretty big. In fact, she begins to realize that her breasts are probably the largest in her grade. Her right hand then moves down to her shorts and she pulls them down slowly, followed shortly by her panties. \"I wonder what it would feel like to be fucked by a big cock...\" She thought to herself. She begins to pull the banana out of her throat, thick trings of saliva connect the banana to her mouth. She uses her right hand to rub her saliva into the banana, completely lubing it up. As she moves the banana to her warm sex, she begins to wonder why no boys talk to her. \"I'm sure that I could geta date with someone... especialy that new kid Dallas... If only I wasn't so shy...\" Just as she touches the banana to her clit, the phone starts to ring. nervously, she pulls her shorts and panties up quickly, and looks at the caller id. It is...</span></div></div>",
            "created":1348425180,
            "id":1433516,
            "title":"She masturbated, thinking of sucking a cock"
        },
        "11122111":{
            "author_id":"dataggz",
            "author_name":"Zero",
            "choices":[
                "Go over to Danielle's house and see if she can win over Dallas",
                "Go upstairs to her room and think of a way to win over Dallas"
            ],
            "content":"<div class=\"\"><div> <span>Emma picks up the phone and lets it ring for a few more rings, as she tries to regain her composure. Then she presses the green talk button, and brings the phone up to her ear. \"Hey Daniella, what's up?\" Emma says softly. <br>\r\n<br>\r\nIn her ear comes Daniella's excited voice. \"Hey girl, guess what! you know that new kid, Dallas?\"<br>\r\n<br>\r\n Emma feels her cheeks get red a mental image of Dallas nude comes into her head \"Yeah... what about him?\" Emma says quietly. <br>\r\n<br>\r\n\"He's at my house! All of my classes this year are with him, and last period he asked if I wanted to hang out after school with him! He offered to walk me home, and I graciously accepted. He's downstairs in my living room, talking with my mom...\"<br>\r\n<br>\r\nEmma zones out listening to Daniella brag about Dallas. Emma often zones out whenever she talks to Daniella, because she has a tendency to just rattle on about the most insignificant things. She occasionally puts the correct \"Uh-huhs\" and \"Okays\" in when necessary, to pretend to listen as not to offend Daniella, but one line brings Emma back down to Earth.<br>\r\n<br>\r\nDaniella's cheery voice comes through the other end. She says, \"Do you want to come over and meet him?\"<br>\r\n<br>\r\nEmma is stunned. A few minutes ago she was fantasizing about his cock, and now, she has an opportunity to meet him personally. Emma doesn't know whether she should go over to Daniella's house, or feel heartbroken, knowing that her best friend just stole the boy she wanted. She decides to...</span></div></div>",
            "created":1348426440,
            "id":1433531,
            "title":"Daniella"
        },
        "11122112":{
            "author_id":"yipyskipy",
            "author_name":"yippyskippy11",
            "choices":[
                "Emma closes all the blinds",
                "Emma thinks it over"
            ],
            "content":"<div class=\"\"><div> <span>Emma said \"hello\" and was a little took aback hearing a hushed female voice on the other end of the line say, \"That was s pretty hot show you had going with your little yellow friend there.\" Gasping, Emma was ready to end the call right there, until the voice spoke again. The other end continued with a sigh, \"Though I would had preferred it staying above the waist, let's me focus on her pretty little face.\" Hearing another female talk to her like this caused the teen to blush. \" Maybe next time you're all alone like this, you should just take it to your room.\" the voice on the other end then paused before throwing on it's most seductive voice, \"Unless you like having some audience for these kind of things.\" it said airy enough Emma could have sworn she felt it on her neck. <br>\r\n<br>\r\nFeeling like she had to say something, the first thought of asking the question, \"Who are you,\" was caught in her throat and swapped for a slow moan. Unwittingly the girl was playing with herself again, slipping her hand into her pants half way through the call. \"Mhmmm, looks like you're ready for a repeat performance.\" the seductive voice said, verbally smiling at the pent up teen. \"No more peanuts from the gallery from me, unless again you like that sort of thing, in which case just do the come here gesture, then..\" The teen felt the blood drain from her face hearing a laugh that of a evil scientist. \"Let's just say, you won't be preforming for your pleasure.\" the voice ssid, ending the call right there...</span></div></div>",
            "created":1507642560,
            "id":2399120,
            "title":"An unknown number"
        },
        "111221122":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "The woman wants to help",
                "The woman has a plan up her sleeve"
            ],
            "content":"<div class=\"\"><div> <span>When Emma returned from school the next day, she couldn't get that conversation off her mind. Who was that woman and how did she know what she was doing? It was then Emma realized that she hasn't finished her business yesterday. Without hesitation, she immediately went toward her room, locking the door and closing the blinds for privacy. She was about to enjoy herself again until she got another call. Thinking it was Daniella, she picked up the phone, recognizing the voice.<br>\r\n<br>\r\n\"Ready for another performance sweetie?\"<br>\r\n<br>\r\nRealizing it was the woman from yesterday, she panicked.<br>\r\n<br>\r\n\"How did you..?!\"<br>\r\n<br>\r\n\"Why else would you close your blinds? I'm not that dumb.\"<br>\r\n<br>\r\nPeaking from the window, she tried to find the woman who was spying on you, with no luck.<br>\r\n<br>\r\n\"You're cute for your age. If you weren't shy, you'd be out there getting all the boys.\" said the woman.<br>\r\n<br>\r\n\"How do you know all this?! Who are who? What do you want from me?!\"</span></div></div>",
            "created":1560928560,
            "id":2675594,
            "title":"Emma thinks it's over"
        },
        "1112211222":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "The woman uses a spell",
                "You both switch souls"
            ],
            "content":"<div class=\"\"><div> <span>\"Listen sweetie. I've been spying on you for years. You could be the most popular girl in your school if your shyness and ego weren't in the way. You got the looks, and I'm not getting younger. Since you're just standing there, wasting away your youth, I plan on stealing your body for my benefit.\"<br>\r\n<br>\r\nThinking it was some sort of prank, you sarcastically tell her...<br>\r\n<br>\r\n\"Oh no, I'm so scarred. How ever will you steal my body?\"</span></div></div>",
            "created":1560928620,
            "id":2675595,
            "title":"The woman has a plan up her sleeve"
        },
        "11122112221":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Woman in her 20's",
                "Woman in her 30's"
            ],
            "content":"<div class=\"\"><div> <span>Muttering jibberish, you decide to hang up the phone, not taking it seriously. As soon as you hang up however, you suddenly felt sleepy, thus collapsing. When you awoke, you noticed a cellphone in your hand. You came across a mirror, staring back at a...</span></div></div>",
            "created":1560928680,
            "id":2675596,
            "title":"The woman uses a spell"
        },
        "111221122211":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Find a way to fix this",
                "More with the woman in Emma's body"
            ],
            "content":"<div class=\"\"><div> <span>Staring back at a very attractive woman, you immediately panic. You call back, hearing the voice you once owned.<br>\r\n<br>\r\n\"Hey sweetie, enjoying your new body so far? I know I am,\" she said seductively. Blushing, you're in too much of a shock that this woman just stole your body and is probably doing unspeakable things.<br>\r\n<br>\r\n\"Get used to it honey, because I ain't giving it up. Enjoy your new life!\" The woman laughed as she laugh, hanging up. Not sure what to do next, you decide to...<br>\r\n</span></div></div>",
            "created":1560928740,
            "id":2675597,
            "title":"Woman in her 20's"
        },
        "1112211222111":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "To continue watching",
                "Too figure out a way to get your body back"
            ],
            "content":"<div class=\"\"><div> <span>You panicked, realizing that this woman just stole your body, your life. Looking around, you see a telescope. You take a peak, realizing that she lives across the street from you. Looking again, you looked in horror as the woman is now masterbating in your body. Seeing that she's taking advantage of your body, you decide...</span></div></div>",
            "created":1560991200,
            "id":2675947,
            "title":"Find a way to fix this"
        },
        "111221122212":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Find a way to fix this",
                "More with the woman in Emma's body"
            ],
            "content":"<div class=\"\"><div> <span>Staring back at a very attractive woman, you immediately panic. You call back, hearing the voice you once owned.<br>\r\n<br>\r\n\"Hey sweetie, enjoying your new body so far? I know I am,\" she said seductively. Blushing, you're in too much of a shock that this woman just stole your body and is probably doing unspeakable things.<br>\r\n<br>\r\n\"Get used to it honey, because I ain't giving it up. Enjoy your new life!\" The woman laughed as she laugh, hanging up. Not sure what to do next, you decide to...<br>\r\n</span></div></div>",
            "created":1560928800,
            "id":2675598,
            "title":"Woman in her 30's"
        },
        "1112211222121":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "To continue watching",
                "Too figure out a way to get your body back"
            ],
            "content":"<div class=\"\"><div> <span>You panicked, realizing that this woman just stole your body, your life. Looking around, you see a telescope. You take a peak, realizing that she lives across the street from you. Looking again, you looked in horror as the woman is now masterbating in your body. Seeing that she's taking advantage of your body, you decide...</span></div></div>",
            "created":1560991140,
            "id":2675946,
            "title":"Find a way to fix this"
        },
        "112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma says: \"Yeah, sure.\"",
                "Emma says, \"No, sorry.\""
            ],
            "content":"<div class=\"\"><div> <span>\"We aren't home right now...please leave a message at the beep...\"<br>\r\n<br>\r\n\"Hi, Daniella. Listen, if you're there, pick up.\"<br>\r\n<br>\r\nSilence.<br>\r\n<br>\r\n\"Well, I guess I would like it if you'd call me once you have time...uh...I'll talk to you soon, I guess. It kind of sucks we don't have any classes together--\"<br>\r\n<br>\r\n\"Hello? Em?\"<br>\r\n<br>\r\n\"Dani?!\" Emma's heart leaped. She was home! Oh yes, she was home--now, she wouldn't be bored!<br>\r\n<br>\r\n\"Uh, yeah, listen Em--I can't talk now.\"<br>\r\n<br>\r\n\"Oh.\" Emma's spirits sunk.<br>\r\n<br>\r\n\"I have my boyfriend over.\"<br>\r\n<br>\r\n\"Since when do you have a boyfriend?\"<br>\r\n<br>\r\n\"You wanna come over and meet him?\"</span></div></div>",
            "created":1040533200,
            "id":135656,
            "title":"Talking"
        },
        "1121":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma writes the note for her mom",
                "Emma doesn't bother writing the note for her mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah...sure, I guess so. But only for a little while--like five minutes, because my mom might get a little curious on why I'm not home, because she isn't home yet and...\"<br>\r\n<br>\r\n\"Em, <i>chill</i>. We live next door! Just write a note to your mom incase she gets home when you're over and then come on over! I think you'll like Dallas. He's really nice.\"<br>\r\n<br>\r\n\"Dallas? You mean that six foot kid who just moved here last year?\"<br>\r\n<br>\r\n\"Uh huh. Wanna say hi to him?\"<br>\r\n<br>\r\n\"Uh...I think I'll just come over. See you then, Dani.\"<br>\r\n<br>\r\n\"See you then.\"</span></div></div>",
            "created":1057294800,
            "id":164503,
            "title":"\"See you then.\""
        },
        "11211":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma goes to Daniella's house",
                "Before she has a chance to go, the phone suddenly rings"
            ],
            "content":"<div class=\"\"><div> <span>Quickly, Emma took a piece of paper from a notebook in a drawer by the television and started to write.<br>\r\n<br>\r\n<i>Hi Mom!<br>\r\n<br>\r\nI'm gonna be gone because I'm at Daniella's house. So don't worry if you come home and I'm not here. I'll be back soon. See you later.<br>\r\n<br>\r\nLove, Emma</i><br>\r\n<br>\r\nWith that off her shoulder, she slowly made her way to the door.</span></div></div>",
            "created":1112418000,
            "id":242698,
            "title":"Writing a note to her mom"
        },
        "112112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "It's Emma's mom",
                "It's somebody from Emma's class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Annoyed at the rings from the phone, Emma grunted. She hurried over to the portable phone and picked it up.</span></div></span></div>",
            "created":1140498000,
            "id":302885,
            "title":"who is it?"
        },
        "1121122":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "whatever you do, don't go to Daniella's.\"",
                "I know a boy who is crushing on you.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Is Emma there?\" a strange voice asked.<br>\r\n<br>\r\n\"Yes... this is Emma. Who are you?\"<br>\r\n<br>\r\n\"Oh... it's just Jan from English class. Remember you put your phone number in my yearbook last year?\"<br>\r\n<br>\r\n\"Yeah...\"<br>\r\n<br>\r\n\"Well listen, I just needed to tell you something:</span></div></div>",
            "created":1161579600,
            "id":354639,
            "title":"strange phone call"
        },
        "11211221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to still go to Daniella's",
                "Emma decides not to go to Daniella's"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, spit it out.\"<br>\r\n<br>\r\n\"Okay. Whatever you do, don't go over to Daniella's.\"<br>\r\n<br>\r\nA weird expression morphed onto Emma's face. \"Why not? She's my best friend. I know her a lot better than I know you... what are you getting at?\"<br>\r\n<br>\r\n\"She's got a new boyfriend. Dallas.\"<br>\r\n<br>\r\n\"Yeah. I know. She just told me,\" Emma sighed. \"What's the problem?\"<br>\r\n<br>\r\n\"Dallas is supposed to be going out with <i>me,</i>\" she said. \"He's cheating on me.\"</span></div></div>",
            "created":1166072400,
            "id":365644,
            "title":"cheat"
        },
        "1122":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma says, \"All right. I'll come over.\"",
                "Emma says, \"No, sorry, Daniella.\""
            ],
            "content":"<div class=\"\"><div> <span>Stuttering, Emma gulped. \"Uhhh....no thanks...\"<br>\r\n<br>\r\n\"Why not?\" Daniella asked, a little offended. \"He's not going to bite. He's really nice. His name is Dallas.\"<br>\r\n<br>\r\n\"Daniella... I told you, I'm not good with people, I wouldn't be able to...\"<br>\r\n<br>\r\n\"Oh nonscense! You sure you don't want to come over? C'mon, Em, you're my best friend! You have to meet him!\"<br>\r\n<br>\r\nEmma paused and thought about this for a second.</span></div></div>",
            "created":1112418000,
            "id":242697,
            "title":"Come over? Please?"
        },
        "11221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma goes to Daniella's",
                "Emma decides to fall asleep instead"
            ],
            "content":"<div class=\"\"><div> <span>\"All right, I'll come over,\" Emma said, instantly regretting her words.<br>\r\n<br>\r\n\"Great!\" Daniella said. \"I'll see you soon.\"<br>\r\n<br>\r\nWhen she put the phone down, instant shock rang through Emma's eyes. How could she do this? Emma hated meeting new people. They never liked her. They always got the wrong impression of her. And no matter how much she wanted them to like her, they always wound up hating her.<br>\r\n<br>\r\n</span></div></div>",
            "created":1161579600,
            "id":354640,
            "title":"anxiety"
        },
        "113":{
            "author_name":"dark_goddess",
            "choices":[
                "Go for a walk.",
                "grabs a snack and hops on the couch to watch her favorite show."
            ],
            "content":"<div class=\"\"><div> <span>\"Danielle?\"<br>\r\n\"Yea. Hey Emma. How was your day? I love my classes and this guy in my history class asked me for my number. His name is Kyle and he is CUTE!\"<br>\r\n\"Cool. sounds like you had fun. Well, my classes suck and it sucks that you and I aren't any classes together or even lunch. It makes me mad.\"<br>\r\n\"Hey it's ok. Listen just hang out with people you are comptable around. Like me. I think you will find more friends in this big school and if you don't I will always be happy to take Art with you so we would have some classes together.\"<br>\r\n\"No, you don't have to do that. I'll be find. I am going to let you go. I still have to do my chores.\"<br>\r\n\"Ok Cya tomorrow morning.\"<br>\r\nWithout saying good bye Emma hangs up the phone and sits there thinking how it would be hard and difficult without her only friend. Maybe Danielle was right. I need to experience with new people and maybe I could get numbers like Danielle, she wasn't open minded like Danielle. She was pretty with layered deep brown hair like her dad and bright blue eyes like her mom. When Emma smiled she could brighten anyones day, but what was her problem. She couldn't figure that out.<br>\r\nShe went to her closet and decided she was going to wear soemthing nice tomorrow instead of some jeans and some shirt.<br>\r\nDeciding what to do next, Emma decides to...<br>\r\n</span></div></div>",
            "created":1032843600,
            "id":122480,
            "title":"Danielle's advice"
        },
        "1131":{
            "choices":[
                "The girl would say yes and help her find her home.",
                "The girl will say no and walked away from her"
            ],
            "content":"<div class=\"\"><div> <span>Emma decided to take a walk since there was nothing else to do. Emma put her shoes on and walked out the door. It was a breezy morning and Emma sniffed in the warm August air. The grass smells freshly cut and the weather was in the 70 range. Emma started  getting tired of walking so she started walking home. But wait, Emma doesn't know where she is. \"Oh No! I'm Lost!\" she wailed. \"Need help?\" Emma whirled around and saw a girl her age walking up to her. \"Yes I do. I don't know where I am.\" \"Will you help me please?\" What do you think the girl would say?</span></div></div>",
            "created":1033534800,
            "id":123607,
            "title":"Emma Is Lost."
        },
        "11311":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes, I will help you. By the way, I'm Patricia.\" \"Hi,Patricia! Thanks for helping me find a way back home. I'm Emma.\" The two girls walked to find Emma's house. When they got there, Emma invited Patricia in. They got two glasses of rootbeer and sat on the couch. They started talking about themselves. \"Do you go to WildCat High School?\" asked Patricia. \"Yes.\" said Emma. \"Do you have your schedule with you?\" asked Patricia. Emma ran to her backpack and pulled out her agenda book. She showed to page to Patricia where her schedule is. \"Cool! Your'e in my math,science,lunch,exploratory and Alpha classes.\" exclaimed Patricia. Emmma was SO excited. She had found her friend.</span></div></div>",
            "created":1033534800,
            "id":123610,
            "title":"Emma Found A Friend"
        },
        "113111":{
            "choices":[
                "Patricia introduced Emma to all her friends",
                "Patricia and Emma are the only friends"
            ],
            "content":"<div class=\"\"><div> <span>The next early morning,Emma woke up at 6. \"Ugh I don't wanna go to school anymore!\" Emma took a shower and went to her closet to pick out something  to wear. Since she couldn't find nothing to wear, Emma decided to go brush her teeth. When Emma turned around, she found a present on her bed. Emma opened it and inside were two dark,dark sparkly blue pants and four T-shirts and one long sleeved shirt. Emma put on her new sparkly jeans and her new t-shirt that said Too cool for you in sparkles. Emma put her hair up and went to eat breakfast. After breakfast, she walked out to the busstop. Emma found Patricia waiting for her there. \"Hi Emma!\" said Patricia. \"Hey Whats up?\" said Emma \"Nothing. Hey are those clothes new?\" \"Yep. I don't know who gave them to me.\" Then their bus arrived and they both together walked on the bus.</span></div></div>",
            "created":1033534800,
            "id":123614,
            "title":"Emma's Surprise"
        },
        "1131111":{
            "choices":[
                "Patricia wakes her up before they arrived at school",
                "Nobody woke her up and let her keep sleeping until they arrive at school."
            ],
            "content":"<div class=\"\"><div> <span>When Patricia showed Emma where she sits, Patricia introduced Emma to all her friends. Mary,Olivia,Rebecca,Lauren,Jessica and Betricia. Emma shyly said hi to all of them and then she turned around looking out the window. The bus kinda rocked Emma to sleep. So,it takes an hour to get to her school, Emma closed her eyes and the next thing you know it ,she is fast asleep. Patricia turned around to talk to Emma when she saw her sleeping. Patricia told her friends to look at Emma. They all saw her asleep. The bus bumped over a huge bump on the road that made Emma topple over and had her head on Patricia's shoulder. Patricia saw her and pulled Emma down on her lap and let Emma rest her head on.   Will they wake Emma up in time before they arrived at school?</span></div></div>",
            "created":1033534800,
            "id":123620,
            "title":"Emma's Sleepy Adventure"
        },
        "11311111":{
            "choices":[
                "Sleepwalk and answer the door",
                "Don't answer it."
            ],
            "content":"<div class=\"\"><div> <span>\"Emma?\" said Patricia shaking her awake. \"Huh? What?\" said Emma. \"What happened?\" asked Emma. \"You fell asleep.\" said Patricia and then they got off the bus to go to school. When Emma returned home, she took out her homework. It was so easy for her. Then she called Patricia. Patricia said she can't talk long causee she has to do her homework. They both hung up and Emma went into the living room. She laid on the couch and turned on SpongeBob SquarePants. Her mom is away in florida and won't be back home in a month. Emma dozed off. She was soooo tired today. Then there was a knock on the door but Emma didn't hear it because she's asleep. What should Emma do? </span></div></div>",
            "created":1033621200,
            "id":123695,
            "title":"Emma Is Very Tired"
        },
        "113111112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma calls up Patrica",
                "Emma goes to see what time it is"
            ],
            "content":"<div class=\"\"><div> <span>   Emma didn't bother answering it...of course, she was asleep, wasn't she? So, she kept sleeping and sleeping...she didn't know what time it was, when she finally awoke. But she did know that nobody had bothered to wake her up.<br>\r\n   Where was her Father? And what about her annoying sister? They hadn't awoken her...and what was the time? She was still very tired...</span></div></div>",
            "created":1033794000,
            "id":123855,
            "title":"What time is it?!?!"
        },
        "1131111122":{
            "choices":[
                "Emma called her father",
                "Emma called her mother"
            ],
            "content":"<div class=\"\"><div> <span>Emma got up and looked to see what time it was. It was 5:00. \"CRAP!\" said Emma and ran upstairs to her sister's room. She also found her little sister asleep. \"Katie?\" said Emma shaking her awake. \"Mmmm.\"mumbled Katie. Emma touched Katie's forehead. It was hot! Emma ran into the bathroom to find a thermometor. She found it and stuck the thermometer under Katie's tounge. When it beeped, it was 104 degrees. \"Yipes!\" said Emma and ran into her room to use the phone. She called Patricia. \"Whats wrong?asked Patricia. \"PLease come over. My sister is  sick and she has a fever of 104.\"explained Emma. \"I'll be right there. Stay in your sister's room.\" said Patricia and hung up. The the doorbell rang and Emma let Patricia in. They both ran upstairs to Katie's room. She was still asleep. Patricia told Emma to get a cold compress on her forehead while she is going to call 911. Emma put a cold compress on Katie's forehead and tried to wake her up. Katie still wouldn't wake up. Patricia said the ambulance is coming and Emma needs to wake her sister up. Emma propped her sister up.Katie fell on her side like a limp rag doll. Emma picked her up and carried her downstairs. The ambulance guys were still there. They put Katie on the strecher and wheeled her into the ambulance. Emma and Patricia climbed in back with her. Emma was worried. What should she do when she arrives at the hospital?</span></div></div>",
            "created":1034485200,
            "id":125067,
            "title":"Emma's Sister Is Sick"
        },
        "11311111221":{
            "choices":[
                "She gives the phone to a doctor",
                "There's no doctor for him to talk to"
            ],
            "content":"<div class=\"\"><div> <span>\"Dad?\" Emma asked when she heard his voice on the other end.<br>\r\n<br>\r\n\"Emma? Is something wrong?\" he asked, concern in his voice.  Just hearing his voice gave her comfort, and she lightened her stranglehold on the phone.<br>\r\n<br>\r\n\"Yeah, Katie is sick.\"<br>\r\n<br>\r\n\"Does she have a temperature?\" he asked, assuming it was a simple cold or perhaps the flu.  <br>\r\n<br>\r\n\"Yes, it was 104 so I called an ambulance.  I'm at the hospital now.  I would have called before but I forgot my cell and they wouldn't let me call you untl now,\" her voice quivered, giving her away.  She disliked it when people knew she wasn't one hundred percent alright.  Truthfully, she was scared.  Her sister was sick.  She didn't know what to do; she felt helpless and desperately wanted her father to take things over.<br>\r\n<br>\r\n\"Is she OK?\" his voice was louder and more forceful now, and he continued without waiting for an answer, \"Is there a doctor I can talk to, honey?\"</span></div></div>",
            "created":1143176400,
            "id":308355,
            "title":"A call to dad"
        },
        "113111112211":{
            "choices":[
                "Joins her father to hear what the doctor has to say",
                "Stay in the room and thank Patricia for staying"
            ],
            "content":"<div class=\"\"><div> <span>Gratefully she handed the phone over to the doctor in charge and, not wanting to leave her little sister alone for too long, headed quickly back to the room.  Snippets of conversation made their way to her ears, \"high fever,\" and \"intravenous.\"  She shook her head, trying to clear it of worries, but they were sticky like honey and wouldn't budge.<br>\r\n<br>\r\nPatricia was at her sister's side when she entered the sterile white room.  They played a hand game and though her sister's face was flushed and an intravenous drip swung from her arm, she looked happy and unconcerned.  <br>\r\n<br>\r\nHeavily Emma swung herself into a blue armchair by the window and surveyed her surroundings, smiling at her sister's giggles and thanking that Patricia had taken the pressure off of her for the time being.  The room was small, and not really a room at all but merely a space partitioned off by thin white gauze sheets which hung from the cieling.  It was like being in a room made of giant shower curtains.  Through the paper walls she could hear voices and phones ringing; they were the usual, routine sounds of a hospital but they made Emma nervous and she fidgeted uncomfortably in the chair, wishing her father would come soon and take them from here.  <br>\r\n<br>\r\n~*~<br>\r\n<br>\r\n\"My daughter was brought here this morning with a fever,\" a male voice filtered through the thin walls of the room and Emma quickly recognized it as her father's voice.  <br>\r\n<br>\r\n\"That's my dad,\" she informed Patricia quietly so as not to wake her sister, who had fallen into a peaceful sleep.  Patricia nodded but said nothing.  Suddenly Emma thought it odd that such a good friend could be made in such a short time, and out of such strange circumstances.  Maybe people weren't as bad as she thought they were after all.<br>\r\n<br>\r\n\"The doctor would like to speak with you, Mr. Hammond,\" the nurse informed her father.  </span></div></div>",
            "created":1143176400,
            "id":308366,
            "title":"Dad's Coming"
        },
        "11311111222":{
            "choices":[
                "Emma woke up in her bedroom",
                "Emma woke up in the hospital"
            ],
            "content":"<div class=\"\"><div> <span>When they arrived at the hospital,Emma ran to use the pay phone. emma called her mom's cell phone. \"Mom?\"asked Emma as her mother answered the phone. \"Emma darling whats wrong.?\" \"Katie's sick and we're at the hospital right now.\" \"WHAT? IS SHE ALRIGHT?\"shouted her mother. \"Mom,she's fine. They're checking her over now.\" \"Thank goodness. I'll tell her.\"said Patricia. \"Emma,the doctor said that katie has strep throat,she'll be ok.\" \"Mom,Katie's ok. She just has strep throat.\"said Emma. \"Thank heavens! Emma you did the right thing. I'll see you in 3 weeks. Bye!!\"said Emma's mom and hung up. Emma hung up andburst into tears. Patricia comforted her and sat down on the couch. As Emma and Patricia left the hospital,Emma saw something that was making her drowsy and weak. Emma blacked out,thick white fog was swirling around inside her. <br>\r\n</span></div></div>",
            "created":1040533200,
            "id":135595,
            "title":"Faintness"
        },
        "11311112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "They all wake Emma up",
                "They all let Emma sleep but talk about laugh about her"
            ],
            "content":"<div class=\"\"><div> <span>   So, with Emma sleeping, Patricia and all her friends went to school, and Emma just stayed on the bus. The bus driver thought that all the kids were all off, so she kept driving at driving until she got to the Bus Department. When she got there, she went inside, had a cup of coffee, and some breakfast and lunch, and before you knew it, it was time to pick up the kids again.<br>\r\n   Emma was still sleeping.<br>\r\n   And when the bus driver went back on the bus, she still never noticed Emma. And then, when the bus driver went back to school, and school was over, Patricia and her friends came back on the bus and saw Emma still sleeping there.</span></div></div>",
            "created":1033794000,
            "id":123868,
            "title":"She's asleep for that long???"
        },
        "1131112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma asks Patricia who Joe is",
                "Emma doesn't bother with their conversation and stares out the window"
            ],
            "content":"<div class=\"\"><div> <span>   As Emma and Patricia sat together, they argued over the window seat.<br>\r\n   But Emma won, and they started talking about school, and about how they would rule it once they got to senior year.<br>\r\n   But soon, they got to this one busstop with a bunch of tough gangster guys at it, and one of the guys took the seat right next to Patricia and Emma.<br>\r\n   \"Hey, Joe,\" Patricia said to him.<br>\r\n   Emma was confused. This mean and tough looking guy was Patricia's friend?<br>\r\n   \"Hey, Patti,\" Joe said.<br>\r\n   \"We still up for the movies Friday night?\" Patricia asked him.<br>\r\n   \"More than ever,\" Joe said.<br>\r\n   </span></div></div>",
            "created":1033794000,
            "id":123865,
            "title":"Joe? The tough-looking guy?"
        },
        "11311121":{
            "author_name":"FlthWriter",
            "choices":[
                "Skip and go to the coffee house, its just this once",
                "Go to Class you guys can talk at lunch."
            ],
            "content":"<div class=\"\"><div> <span>Pat tell Emma the Joe is her 'Friend'. When Emma questions her on it Pat tells her that her mom thinks she it too young to date, so she and Joe are just friends. Emma presses for more details but Pat knows Joe can hear so she just says that she will tell her more later. As they pull up to the school Joe stands up quickly and throws a note on Pat's lap ant is quick to leave the bus. Pat is grinning from ear to ear as the girls get off the bus. \"OK, tell me more now\" Emma presses. There is just so much to tell that Pat says she doesn't want to start now unless, Emma wants to skip first period and go talk over coffee. They have Alpha first period and none of the teachers or students know that they are friends yet so they probably won't catch on that they are out together. <br>\r\nWhat do you say? What should she do? Emma has never done anything like this before, but then again she has never had a friend ask. She really wants to know the deal bettween the dark brooding Joe and the Bubbly Pat, but she's not sure if the risk is worth it. She is also worried if Pat won't like her if she doesn't go now, because Pat brought it up so easily. What should she do?</span></div></div>",
            "created":1074488400,
            "id":185449,
            "title":"To Go or Not To Go, that is the Question."
        },
        "11312":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma tries to find her house by herself",
                "She sees a police man, and asks him for directions"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   \"No. Sorry.\" And the girl walked away.</span></div></span></div>",
            "created":1033794000,
            "id":123866,
            "title":"\"No. Sorry.\" And the girl walked away."
        },
        "113121":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "She bursts into tears",
                "She tries to find a way home"
            ],
            "content":"<div class=\"\"><div> <span>Emma grunted. \"OH MAN!\" She stomped her feet angrily, and sat down on the sidewalk. She rubbed her head, sighed, and tried her hardest not to burst into tears. \"Why am I so stupid? I've lived in this town for my whole life, and I'm lost!\"</span></div></div>",
            "created":1040533200,
            "id":135654,
            "title":"Stranded"
        },
        "1131212":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Keeps walking",
                "Goes into Daniella's house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Again, sighing, she stood up and walked casually for a few minutes until she spotted her friend Danellia's house!</span></div></span></div>",
            "created":1040533200,
            "id":135655,
            "title":"Houses"
        },
        "1132":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "fell asleep",
                "finished watching her favorite show"
            ],
            "content":"<div class=\"\"><div> <span>Emma took out a bag of chips and a can of cherry coke as she turned on her favorite TV show. <i>Maybe Danielle's right,</i> she thought. <i>I just need to be more open... yeah, but it's... just a lot easier said than done. I don't know, maybe this whole thing is just...</i><br>\r\n<br>\r\nEmma quit thinking her thoughts and...</span></div></div>",
            "created":1112418000,
            "id":242699,
            "title":"Thinking thoughts"
        },
        "12":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma's sister, Maria calls from school, saying she's sick",
                "Emma can't find anything good on TV",
                "Emma's mom bursts through the door",
                "Emma's dad bursts through the door",
                "Emma's favorite aunt bursts through the door"
            ],
            "content":"<div class=\"\"><div> <span>   So, as Emma flipped the TV on, she grabbed herself a coke from the fridge. She was pretty thirsty for some reason that she didn't know of.<br>\r\n   She thought of her brother, Dennis, who had absoultely no problem being loud and annoying...and just plain...fitting in.<br>\r\n   And she thought of her sister, Maria, who was popular, and the whole works.<br>\r\n   But she didn't care about popularity. All she wanted to do was just talk normally, like everybody else did. Not be nervous, or nothing.<br>\r\n<br>\r\nThis was supposed to be the year, she told herself.<br>\r\n<br>\r\nBut she had no doubt that it would be like any other year.</span></div></div>",
            "created":1029992400,
            "id":117807,
            "title":"Emma's thinking"
        },
        "121":{
            "author_name":"kuso",
            "choices":[
                "go in",
                "go to a doctor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma runs to the school<br>\r\n</span></div></span></div>",
            "created":1091163600,
            "id":209937,
            "title":"go to school"
        },
        "1211":{
            "author_name":"kuso",
            "choices":[
                "listen to her",
                "ignore it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>there is Maria<br>\r\nshe needs to tell you something</span></div></span></div>",
            "created":1091336400,
            "id":210277,
            "title":"Maria"
        },
        "12111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma takes Maria home",
                "Emma decides to first confront Maria's teacher, then take Maria home"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Maria? Are you okay?\" Emma asked, worriedly.<br>\r\n<br>\r\n\"I'm fine... just sick... you'll never believe what happened to me, Emma. I threw up all over this one kid at school! And he... and he...\"</span></div></span></div>",
            "created":1112504400,
            "id":242842,
            "title":"Listening to Maria"
        },
        "12112":{
            "author_name":"kuso",
            "choices":[
                "think",
                "use some magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you are only interested in boy, exspecally in Brad<br>\r\nbut how to get him?</span></div></span></div>",
            "created":1095051600,
            "id":216244,
            "title":"boy?"
        },
        "121121":{
            "author_name":"kuso",
            "choices":[
                "yes",
                "your last chance to stop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>but you find no normal way to be attractive for him<br>\r\nso use magig</span></div></span></div>",
            "created":1095138000,
            "id":216441,
            "title":"use magic"
        },
        "1211211":{
            "author_name":"kuso",
            "choices":[
                "you find something",
                "your last chance to stop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you enter a strange shop which sells everthing about magic</span></div></span></div>",
            "created":1095310800,
            "id":216602,
            "title":"strange shop"
        },
        "1212":{
            "author_name":"kuso",
            "choices":[
                "it is your sister",
                "it even gets worse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is some boy sitting inside the doctors room</span></div></span></div>",
            "created":1091336400,
            "id":210278,
            "title":"somethingf is wrong"
        },
        "12121":{
            "choices":[
                "find out more",
                "talk to her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she had suddenly been transformed into a boy</span></div></span></div>",
            "created":1116997200,
            "id":252310,
            "title":"transformed"
        },
        "122":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "The phone rings",
                "Emma puts away the chips, and goes upstairs"
            ],
            "content":"<div class=\"\"><div> <span>   \"This sucks!\" she screamed. She took one last sip of her pop, and turned the TV off. This was stupid. It was supposed to be a teenager's life, so why wasn't anything good on the TV??<br>\r\n   There were shows too young, too boring, and just plain...too blah.<br>\r\n   So, Emma started for the kitchen and took out some chips and just started pigging out! If nobody was home, who would care?<br>\r\n   \"This sucks,\" she told herself again, \"I wish everything could be good. Nothing bad would ever happen. This SUCKS!\"</span></div></div>",
            "created":1030424400,
            "id":118388,
            "title":"\"This sucks!\""
        },
        "1221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma continues to talk to James",
                "Emma hangs up the phone right then and there"
            ],
            "content":"<div class=\"\"><div> <span>   Emma sighed.<br>\r\n   The phone rang. Emma had no choice but to answer it. She didn't really mind, but all she had wanted as soon as she found out she was alone, was a nice quiet, and peaceful evening. But then the phone rings, and it ruins everything.<br>\r\n   But it just figured for Emma.<br>\r\n   \"Hello?\" she asked.<br>\r\n   \"Hello, and you have just won ten million dollars!\"<br>\r\n   \"Cut it out, James,\" Emma yelled, \"You're not funny, I'm gonna hang up.\"<br>\r\n   \"No!\" James yelled, \"I mean...sorry Charlie. I didn't know you were so...uptight.\"<br>\r\n   \"Uh...yeah,\" Emma said.<br>\r\n   This was usual behavior for somebody like James. He wasn't popular, he was a geek. Trying to get popular. But it never worked. And somehow, he had gotten Emma's phone number and now he was going to bug her all day.<br>\r\n</span></div></div>",
            "created":1030424400,
            "id":118390,
            "title":"James..."
        },
        "12211":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma goes up to her room and listens to music",
                "The phone rings suddenly after James hung up"
            ],
            "content":"<div class=\"\"><div> <span>   \"James, can you cut it out? I just wanna relax, okay? I got the whole house to myself,\" Emma added.<br>\r\n   \"House to yourself?! That's gotta be a new record! C'mon, Em, when's the last time that that happened to you?\"<br>\r\n   Emma had known James ever since kindergarten, and they really hadn't been friends, but they weren't often found not talking together. She didn't know if James was in any of her classes; she hadn't bothered to ask.<br>\r\n   James wasn't a very nice person when he was younger, but once middle school came up, he started trying to be the \"class clown\" but it never worked. He started lighting up, and wasn't that mean anymore, but Daniella had continued to hate him, so Emma was right there next to her.<br>\r\n   \"Shut up, James! Go call up Daniella and quit bugging me!\" Emma yelled.<br>\r\n   \"No! It's more fun bugging you,\" James said, and he hung up.<br>\r\n   Emma sighed and hung up the phone. Usual behavior for someone like James.</span></div></div>",
            "created":1033794000,
            "id":123857,
            "title":"\"It's more fun bugging you!\""
        },
        "122111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Seh listens to her music for a few minutes",
                "She listens to her music for a few hours"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>I know what I can do,</i> Emma thought silently. <i>Go and listen to music. Now, that'll be nice and relaxing.</i> She hurriedly ran upstairs to her room and sat on her bed with her headphones on.</span></div></span></div>",
            "created":1112504400,
            "id":242848,
            "title":"listening to music"
        },
        "122112":{
            "author_name":"Nemear",
            "choices":[
                "Emma's mom comes home",
                "Daniella calls"
            ],
            "content":"<div class=\"\"><div> <span>Emma had set the phone down and turned to go get a snack when the phone rang again. She turned back and looked at the caller I.D. \"Mom,\" she whispered, relieved and yet still rather disappointed, as it was most likely she was going to be coming home soon if she were calling.<br>\r\n<br>\r\n\"Hello?\" Emma answered, out of habit. She didn't need to query who it was.<br>\r\n<br>\r\n\"Hi hon, how are yoooou?\" she asked in a babying tone. Emma sighed.<br>\r\n<br>\r\n\"Fine...\"<br>\r\n<br>\r\n\"I'm going off to get some dinner and then I'm coming home.\"<br>\r\n<br>\r\n\"'K.\" Emma was one of few words.<br>\r\n<br>\r\n\"So? What do you want for dinner?\"<br>\r\n<br>\r\n\"I really don't care,\" she insisted, emphasizing every word. She hated having to choose things.<br>\r\n<br>\r\n\"Well I'm not choosing, am I? Now, what do you want?\"<br>\r\n<br>\r\nEmma sighed. \"Get me a hamburger meal or something.\"<br>\r\n<br>\r\n\"Right on it! Byyyye!\" Emma didn't bother to respond. She lowered her eyelids and hung up.<br>\r\n<br>\r\n30 minutes later, after she finally found something half-decent to watch on television.. </span></div></div>",
            "created":1034485200,
            "id":125033,
            "title":"Routine Phonecall"
        },
        "1221121":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "the phone rings and Emma picks it up",
                "the phone rings and Emma's mom picks it up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma's mom came home and they both enjoyed dinner...</span></div></span></div>",
            "created":1112504400,
            "id":242849,
            "title":"dinner"
        },
        "1221122":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "They keep talking",
                "Emma gets the other line"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Em?\" Daniella said, before Emma could get a word when she picked up the phone. <i>Gosh, we're sure getting a lot of calls today,</i> she thought to herself.<br>\r\n<br>\r\n\"Yeah?\" Emma asked, a bit concerned for her friend.<br>\r\n<br>\r\n\"Well, you'll never guess who called me and we talked for an hour.\"<br>\r\n<br>\r\n\"I won't guess. Who?\"<br>\r\n<br>\r\n\"James!\" Daniella yelled, as if she was excited.<br>\r\n<br>\r\n\"James?\" Emma asked, confused, \"Wait. Then why would you be talking to him for an hour? I don't get it, you hate him.\"<br>\r\n<br>\r\n\"Not anymore. I think he's kind of cute.\"<br>\r\n<br>\r\n\"But you <i>hated</i> him,\" Emma groaned. She didn't really like it when Daniella changed her mind so often. First, she liked somebody, then she hated somebody, then she liked them...Emma always figured she had to follow Daniella's thoughts.</span></div></div>",
            "created":1057294800,
            "id":164499,
            "title":"Talking on the Phone with Daniella"
        },
        "12211222":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "It's James",
                "It's Emma's mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, and so then James said the cutest thing...\" Daniella went on and on and on as she always did about all of her--fourteen, was it?--crushes.<br>\r\n<br>\r\nEmma was getting annoyed by all of this chatter, but she paid it no mind. She decided to daydream about something else. But what was there to daydream about?<br>\r\n<br>\r\nJust then, her phone started to beep, and she got a call on the other line. \"Hey, Dani, I got a call on the other line. Can you hang on for a second?\"<br>\r\n<br>\r\n\"Sure.\"</span></div></div>",
            "created":1057294800,
            "id":164505,
            "title":"The Other Line"
        },
        "122112221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "They keep talking",
                "James suddenly hangs up"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, is Emma there?\"<br>\r\n<br>\r\n\"James? It's me.\"<br>\r\n<br>\r\n\"Oh, good,\" James said, \"You know who I was just talking to for an hour?\"<br>\r\n<br>\r\n\"Daniella. She just called me up and told me.\"<br>\r\n</span></div></div>",
            "created":1057813200,
            "id":165226,
            "title":"It's James"
        },
        "1221122211":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma says, \"Sure, you can call me later.\"",
                "Emma says, \"No. Don't call later! Don't call ever!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"And guess what? It's so ironic, but I am on the other line talking to her,\" Emma answered.<br>\r\n<br>\r\n\"Really?\" James asked excitedly. \"Well, I'll let you go then. Call you later?\"</span></div></span></div>",
            "created":1112418000,
            "id":242704,
            "title":"Call later?"
        },
        "12211222111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "James never calls back",
                "He does call back"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure, you can call me later,\" Emma said, thinking now that Daniella liked him, she shouldn't think horrible thoughts about him, either.<br>\r\n<br>\r\n\"Great!\" James said, as happy as he could be, and then he hung up. Emma switched back to Daniella. <br>\r\n<br>\r\n\"Daniella?\"<br>\r\n<br>\r\n\"Who was that?\" Daniella asked.<br>\r\n<br>\r\n\"It was James. He called me to tell me that you and him were talking for an hour on the telephone,\" she muttered. \"He said he's going to call me later.\"<br>\r\n<br>\r\n\"What did he say about me?\" Daniella immediately asked.<br>\r\n<br>\r\n\"Nothing, just that. Then I told him I was talking to you, and he left.\"<br>\r\n<br>\r\n\"Oh my God, Emma. When he calls back, you have to ask him what he thinks of me.\"</span></div></div>",
            "created":1137387600,
            "id":296161,
            "title":"what did he say about me?"
        },
        "122112221112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "she's extremely annoying.\"",
                "she's very beautiful.\""
            ],
            "content":"<div class=\"\"><div> <span>A couple of hours went by... dinner was eaten, Emma had finally gotten ready for bed, and she was just about to go in her room to settle down for the night, when the phone rang yet again, and she picked it up. It was James.<br>\r\n<br>\r\n\"So, how are you?\" James asked.<br>\r\n<br>\r\n\"I'm good. Yourself?\"<br>\r\n<br>\r\n\"Good,\" James said.<br>\r\n<br>\r\n\"Listen,\" Emma began. \"Daniella wants me to ask you what you think of her.\" <i>Wow, I totally didn't mean to be so blunt,</i> she thought.<br>\r\n<br>\r\n\"Daniella?\" James asked. \"Well, that's an easy one. I think...</span></div></div>",
            "created":1161579600,
            "id":354643,
            "title":"think of daniella"
        },
        "1221122212":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma gets the other line again -- it's James",
                "Suddenly Emma loses connection with Daniella"
            ],
            "content":"<div class=\"\"><div> <span>\"What'd she say about me?\" James asked, completely excited.<br>\r\n<br>\r\nJust as Emma was about to tell him the truth, he hung up once again. She flipped back to the other line. \"Daniella,\" she said. \"It was James.\"<br>\r\n<br>\r\n\"Oh my God!\" Daniella said. \"What did he say about me?\"<br>\r\n<br>\r\n\"He just said that you guys talked for an hour, and then hung up,\" Emma replied.</span></div></div>",
            "created":1137387600,
            "id":296160,
            "title":"talking back to Daniella"
        },
        "12212":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "It's James again",
                "It's Daniella"
            ],
            "content":"<div class=\"\"><div> <span>James started to laugh. \"You know, Emma...\"<br>\r\n<br>\r\nEmma hung up the phone immediately. That was enough of James. Besides, she had no idea what she was going to say to him if he would continue talking to her. She always had a problem with communicating with her peers... the only person she could talk to was Daniella. Daniella was the only one who understood her, the only one Emma was never nervous around.<br>\r\n<br>\r\nJust as Emma was going to relax and sit back down on the couch, the phone started to ring once more.<br>\r\n<br>\r\n</span></div></div>",
            "created":1112504400,
            "id":242847,
            "title":"AGAIN the phone rings"
        },
        "122121":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "James stops kidding around",
                "James doesn't stop kidding around"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello?\" Emma asked, hoping that it was somehow Daniella. She sighed. <i>Please, I hope it's not James,</i> she thought to herself silently. <i>I swear, I don't know what to say to that kid...why did he even call me in the first place?</i><br>\r\n<br>\r\n\"Hi Emma,\" James said sneekily.<br>\r\n<br>\r\nOh no. It was James after all. \"Why are you calling me?\" Emma asked, trying to sound irritated.<br>\r\n<br>\r\n\"Why am I calling you? But Emma, you were the one who called <i>me</i>!\"<br>\r\n<br>\r\n\"Stop kidding around,\" Emma said. \"Or else I'll hang up on you again.\"</span></div></div>",
            "created":1112590800,
            "id":242979,
            "title":"James again"
        },
        "1222":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma is delighted with her work",
                "Emma is agravated with her work"
            ],
            "content":"<div class=\"\"><div> <span>   So finally, Emma put away all of her snacks, in fear that she might become fat and the kids would come up with another reason to make fun of her, and started heading for her room. She took out a pad of paper, and started drawing. Drawing wasn't normally her thing, but she just decided to do it anyhow.</span></div></div>",
            "created":1032325200,
            "id":121607,
            "title":"Art Work"
        },
        "12221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma gets the door for her brother",
                "Emma waits until he gets in hisself"
            ],
            "content":"<div class=\"\"><div> <span>   Emma smirked with joy. \"Yes!\" she screamed, \"At least something has gone good today. First, I had a rotten day at school, but I guess this wonderful piece of art makes up for it!\" <br>\r\n   Emma again smiled with glory, and put her paper on the fridge, with her favorite magnet. She didn't care if she was too old for this; at least it entertained her. But then the doorbell rang.<br>\r\n   And it was Emma's brother...</span></div></div>",
            "created":1033275600,
            "id":123144,
            "title":"Delighted!"
        },
        "122211":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Dennis had a good day at school",
                "Dennis had a bad day at school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma quickly ran downstairs to open the door for her little brother, Dennis. \"How was school?\" you ask him, as nice as possible.</span></div></span></div>",
            "created":1112504400,
            "id":242843,
            "title":"Greeting her brother Dennis"
        },
        "12222":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Her mom comes home w/out Emma knowing and says to turn music off",
                "Emma turns her music off, she's sick of this song already"
            ],
            "content":"<div class=\"\"><div> <span>   \"I'm not a good drawer!\" Emma shouted, and threw the drawing pad on the floor, with a big loud thud. \"This isn't fair! Today was a bad day! A very bad day!\"<br>\r\n   Emma quickly went to her CD player, and turned on her favorite song, the highest volume.<br>\r\n   And she just stood there, thinking...and listening.</span></div></div>",
            "created":1033794000,
            "id":123859,
            "title":"Music BLEARING! Heeheehee..."
        },
        "122222":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma calls Daniella",
                "Emma starts to hurt herself"
            ],
            "content":"<div class=\"\"><div> <span>Quickly, Emma turned off the music and started to cry. Everything went wrong. This was going to be the worst year ever. She was going to be a shy girl who never talked to anyone. And there was nothing she could do about it. Whenever she tried acting more outgoing she always felt like she wasn't being herself and she also felt extremely nervous. But she hated being her old shy self. She was always so lonely.<br>\r\n<br>\r\nShe didn't know what to do. </span></div></div>",
            "created":1112504400,
            "id":242844,
            "title":"So sad and depressed and lonely"
        },
        "1222222":{
            "author_id":"moowithme272",
            "author_name":"Portia James",
            "choices":[
                "It's her mom",
                "It's her sister"
            ],
            "content":"<div class=\"\"><div> <span>She started to get frustrated.<br>\r\n\"Why can't I do anything?\" she shrieked loudly. But then she had a thought. Maybe she could do something right. She took out a pair of scissors and made a small, deep cut into her arm with the edge. Then she heard a knock.</span></div></div>",
            "created":1112504400,
            "id":242854,
            "title":"Cut"
        },
        "123":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Her mom keeps talking about Emma's shyness",
                "Emma asks her mom if she can go online"
            ],
            "content":"<div class=\"\"><div> <span>   Emma kept flipping through the channels, and tried not to think about school or anything unpleasant--no, she didn't want to ruin her day more than it already had been.<br>\r\n   But then, she heard a noise, and flipped the TV off.<br>\r\n   It was the door...it was opening.<br>\r\n   But Emma didn't care, it was probably her mother. And when her mom did come in, Emma welcomed her with a smile. \"Hey, Mom,\" she said.<br>\r\n   \"Hi, Emma, how was the first day?\" her mom automatically announced.<br>\r\n   \"It was good,\" Emma said, \"Only, Daniella isn't in any of my classes, remember.\"<br>\r\n   \"I think you should make new friends, Emma. Then you won't be so lonely--\"<br>\r\n   \"Mom!\" Emma shouted, \"Don't talk about that!\"</span></div></div>",
            "created":1033794000,
            "id":123854,
            "title":"Mom Came Home"
        },
        "1232":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma's mom says she can go online",
                "Emma's mom says she can't go online"
            ],
            "content":"<div class=\"\"><div> <span>Emma was getting sick of hearing her mother rag on about her shyness. She knew she was shy, so she didn't need anybody to rag on her about it. Her dad often did this, as well. Emma got so sick of it, she growled.<br>\r\n<br>\r\n\"Can I go online?\" She didn't feel like hearing her mother anymore.</span></div></div>",
            "created":1112504400,
            "id":242846,
            "title":"Shyness"
        },
        "124":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to invite over a friend",
                "Emma is too shy and decides not to invite anyone"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi, Dad,\" Emma said brightly. \"You're home pretty early.\"<br>\r\n<br>\r\n\"Yeah,\" Emma's dad said. \"But I have to go back to work in a few minutes. Just came home to get a few supplies.\"<br>\r\n<br>\r\nEmma sighed. She was going to be home alone for a while, then.<br>\r\n<br>\r\n\"Listen, Em. Why don't you invite one of your friends over while I'm gone?\" her dad asked. \"That way you won't be so bored.\"</span></div></div>",
            "created":1112418000,
            "id":242700,
            "title":"Emma's Dad is home momentarily"
        },
        "125":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma and Aunt Shelia watch TV",
                "Emma goes up in her room to be by herself"
            ],
            "content":"<div class=\"\"><div> <span>   The doorbell rang. \"That's strange,\" Emma said for some reason, but she opened the door anyway.<br>\r\n   \"Hey Em!\" Aunt Shelia smiled, letting herself in and locking the door, \"How's life been?\"<br>\r\n   Emma struggled to answer her question. \"Uhh...okay, I guess. It's such a surprise you're here! Mom's not home--how come you're here?\"<br>\r\n   \"Your mother called,\" Aunt Shelia said, \"She said she's doin' stuff overnight and wants me to watch over you and Dennis and Maria. When do the youngsters come home, anyhow?\"<br>\r\n   \"Soon.\"<br>\r\n   \"Soon? That's wonda-ful!\"</span></div></div>",
            "created":1040533200,
            "id":135658,
            "title":"Aunt Shelia"
        },
        "1251":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to have the sleepover",
                "Emma decides not to have the sleepover"
            ],
            "content":"<div class=\"\"><div> <span>\"This used to be my favorite show when I was a kid,\" Aunt Shelia laughed. \"Don't you love this show, Emma?\"<br>\r\n<br>\r\nInside, Emma hated the show. She took in a deep breath. \"I guess it's okay,\" she said slowly.<br>\r\n<br>\r\n\"You don't like it, do you?\" Aunt Shelia asked.<br>\r\n<br>\r\nEmma smiled. \"No... I don't.\"<br>\r\n<br>\r\n\"Well, then that's okay!\" Aunt Shelia said. \"We can watch something else. Oh! Wait, I have a better idea. Why don't you invite some of your friends over for a sleepover? Won't that be fun?\"<br>\r\n<br>\r\nEmma started to think. She didn't have many friends... only Daniella... and Emma really didn't feel like having a sleepover.</span></div></div>",
            "created":1112504400,
            "id":242845,
            "title":"Sleepover?"
        },
        "13":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma answers the phone",
                "Emma lets the answering machine get it",
                "Emma leaves the house and doesn't care about the phone",
                "Emma picks up the phone and pretends they got the wrong number",
                "Emma picks up the phone and immitates her mother's voice"
            ],
            "content":"<div class=\"\"><div> <span>   She growled and moaned, and as much as she hated it, she started washing the dishes: her first chore of the day. She sighed with annoyance, but hoped that it would be worth it when she got her allowance.<br>\r\n   But as she started washing, things crept through her mind thinking of why her mother wasn't home. Usually, she would be home.<br>\r\n   She knew that her younger brother would be home soon, too--he was in the middle school, and was coming home in a half an hour. And her little sister was in elementry school, so she'd be home in about an hour and a half.<br>\r\n   Emma sighed, and soon she was done with her chores. And magically, the phone rang.</span></div></div>",
            "created":1033275600,
            "id":123141,
            "title":"Ring! Ring!"
        },
        "131":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma tells John about Matt's phone call",
                "Emma forgets and doesn't tell John"
            ],
            "content":"<div class=\"\"><div> <span>   \"Hello?\" Emma asked, rather boredly.<br>\r\n   \"Hello,\" the voice said, \"Is this the house of John Dinardi?\"<br>\r\n   Emma scowled, and rolled her eyes. \"You mean, John Sinardi?\"<br>\r\n   \"Yeah! Exactly!\" the voice exclaimed back.<br>\r\n   \"Sorry, Matt, John's not home from school yet,\" Emma said, \"He should be home in a half hour, though.\"<br>\r\n   \"Oh, well, thanks,\" Matt said, and hung up the phone without even a good-bye. It was always her brothers' friends calling! Emma hated Matt, and Joe, and Lars...and just all of his annoying little friends.<br>\r\n   But Emma decided to go back to her chores, and before she knew it, her little brother John came home.</span></div></div>",
            "created":1033794000,
            "id":123850,
            "title":"The Ridiculas Phone Call"
        },
        "1311":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma asks John to tell her about it",
                "Emma thinks he's kidding, and goes to her room"
            ],
            "content":"<div class=\"\"><div> <span>   Emma was on her very last chore: vacuming the living room. And as soon as she finished, the door opened and it was John.<br>\r\n   \"Hey, Em,\" John said, \"Where's Mom?\"<br>\r\n   \"Mom isn't home yet but Matt just called fifteen minutes ago,\" Emma explained, \"And he messed up our last name again--\"<br>\r\n   \"Yeah, with the D?\" John asked.<br>\r\n   \"Exactly,\" Emma said.<br>\r\n   \"Well, I guess I'll call him back then,\" John said, aiming for the phone and picking it up. But before he dialed he said, \"You know, Em, something really strange at school happened today about you.\"</span></div></div>",
            "created":1033794000,
            "id":123853,
            "title":"\"Something really strange happened.\""
        },
        "13111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma is completely stressed",
                "Emma doesn't care about it anymore"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Emma breathed. <i>Now, why would a simple middle schooler be talking about me?</i> she wondered. But at any rate, she sighed. \"Tell me, John! Tell me or I'll...\"<br>\r\n<br>\r\n\"You'll what?\"<br>\r\n<br>\r\n\"Just tell me!\"<br>\r\n<br>\r\n\"Alright, alright,\" John giggled, \"You remember Mrs. Dinnih from the eighth grade?\"<br>\r\n<br>\r\nEmma nodded. <br>\r\n<br>\r\n\"Well, she told us...she told us something about you.\"</span></div></div>",
            "created":1043730000,
            "id":141154,
            "title":"Mrs. Dinnih"
        },
        "131111":{
            "choices":[
                "The phone rings.",
                "Emma goes to her room & forgets the dishes"
            ],
            "content":"<div class=\"\"><div> <span>Emma nearly drops the plate she is putting away. \"What did she tell you?\" She demands, putting the plate on top of the plate pile a little too neatly. <br>\r\n<br>\r\n\"Why should I tell you?\" He says hotly.<br>\r\n<br>\r\n\"Tell me or I leave the room crying, and you don't want that because it will make you feel guilty for the rest of your life. That's why.\"<br>\r\n<br>\r\nHer brother glares at her. \"She just said you aced the class. I thought that was strange because you never get A's in anything but algebra and stuff.\"<br>\r\n<br>\r\nEmma's face goes red and....</span></div></div>",
            "created":1074574800,
            "id":185528,
            "title":"A 8th Grade"
        },
        "1311111":{
            "choices":[
                "Call Danielle back in a new found fit of rage in order to confront her",
                "Mum comes home and Emma confides in her"
            ],
            "content":"<div class=\"\"><div> <span>Emma hears the phone ring. She picks up the phone. She shoes John away with her hand and turns to face the kitchen window, cupping the phone in her hand protectively in an act to provide herself with some privacy. The second she hears Danielle's voice, she feels a smile spread across her face. She greets her friend with a perky \"hello\". Danielle pauses on the other line. Emma bites her lip with nervousness. \"Hello?\" she stammers into the receiver, anxiety crawling over the surface of her skin as she blushes uncontrollably. \"Your not part of our group anymore.\" Danielle says blatantly before hanging up. With the receiver still at her ear, Emma's hand begins to quiver. She didn't understand, one day they were making daisy chains side by side on a swing set, plaiting each other's hair, sharing juice boxes in the inevitable heat of summer, hands in each other's jean pockets as the remorseless chill of the wind shook their little raincoats as they walked to school in the fall;and the next she was alone in her own kitchen, hands shaking and her mind manically trying to unravel the last 10 years of her life. Suddnely she throws the phone across the room, it skids across the counters and smashes into the cool, bone-white surface of tiles beneath her feet.  Her shaking hand cups her gaping mouth tight, as she tries relentlessly to muffle the sobs that escape her.<br>\r\nWhat had just happened?<br>\r\n</span></div></div>",
            "created":1340679420,
            "id":1367116,
            "title":"The phone rings."
        },
        "131112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma is bored in her room",
                "Emma is not bored in her room"
            ],
            "content":"<div class=\"\"><div> <span>Emma sighed. \"You're making this up, aren't you?\"<br>\r\n<br>\r\n\"No, no, I--I--I--\"<br>\r\n<br>\r\n\"You know what?\" Emma said, \"I don't care anymore, John. You're just a little brother who would do something like that.\"<br>\r\n<br>\r\nJohn cracked up in giggles. \"I can't believe you fell for it! You're so stupid, Emma! Freak!\" He was on the floor, laughing hard.<br>\r\n<br>\r\nEmma put her nose in the air, pretending she didn't care, and hurried up to her room. But before she got there, she noticed that John took a few cups and plates from the cabinets, and started having a feast.<br>\r\n<br>\r\n<i>Great,</i> Emma thought, <i>More chores. More dishes to clean. But I'm not going back down there now. Not until Mom or Maria comes home or something.</i></span></div></div>",
            "created":1057294800,
            "id":164504,
            "title":"Laughing"
        },
        "13112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "John barges through her door",
                "Emma turns the music down because she's bored"
            ],
            "content":"<div class=\"\"><div> <span>   \"Um...sure,\" Emma rolled her eyes.<br>\r\n   \"No, really! I'm serious, Em, everybody was talking about you!\"<br>\r\n   \"Sure John. Whatever.\"<br>\r\n   Emma rushed to her room, let her music on as loud as possible, and started on her English assignment.</span></div></div>",
            "created":1040533200,
            "id":135659,
            "title":"Music"
        },
        "1312":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to go upstairs and tell John about his phonecall",
                "Emma decides not to tell John about his phonecall"
            ],
            "content":"<div class=\"\"><div> <span>   \"Hey, Em,\" John said, \"What's up?\"<br>\r\n   \"The sky,\" Emma sighed, \"You get any homework?\"<br>\r\n   \"Nope,\" John replied, \"I'm going to go upstairs and play my gameboy...\"<br>\r\n   \"Okay.\"<br>\r\n   So, as quickly as John could go, he ran up the stairs and to his room. But then Emma remembered! She forgot to tell him that there was a phone call for him!</span></div></div>",
            "created":1034485200,
            "id":125026,
            "title":"Oops! Forgetful!"
        },
        "132":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "whoever was calling leaves a message",
                "whoever was calling doesn't leave a message"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Leave a message after the beep.. BEEP!\"<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1112418000,
            "id":242701,
            "title":"do they leave a message?"
        },
        "133":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "to go Daniella's house",
                "go back to school... just remembered she forgot something"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma angrily put down her last dish. \"That phone is so annoying!\" she screamed. \"And I hate chores! I refuse to do them any longer!\"<br>\r\n<br>\r\nShe marched out of the house.<br>\r\n<br>\r\nBut then she realized... now what?</span></div></span></div>",
            "created":1112504400,
            "id":242837,
            "title":"Out of house"
        },
        "1332":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "She gets to the high school",
                "She meets a random kid on the way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>You know what,</i> Emma thought to herself. <i>I forgot my English textbook at school. Weren't we supposed to read pages eight through twelve?</i> She sighed. Well, it was only a ten minute walk back to the high school. She started walking.</span></div></span></div>",
            "created":1140498000,
            "id":302882,
            "title":"Walk back to school"
        },
        "134":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "The person on the phone keeps talking to Emma",
                "The person believes Emma when she says it's wrong number & they hang up"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello?\" Emma asked politely.<br>\r\n<br>\r\n\"Hello? Emma?\" <br>\r\n<br>\r\nEmma didn't recognize who was on the line, so she started to get a little freaked out. \"Uhm... you have the wrong number... there is no Emma here...\"<br>\r\n<br>\r\n\"But there has to be an Emma here,\" the voice urged. \"I swear, I just got Emma's phone number, 551-5551. That is this number, isn't it?\"<br>\r\n<br>\r\nEmma gulped. \"Yes, but you're mistaken. There is no Emma here.\"</span></div></div>",
            "created":1112504400,
            "id":242840,
            "title":"Wrong number!"
        },
        "1341":{
            "author_id":"johnstanford78",
            "author_name":"Johnny Rocket",
            "choices":[
                "Another Life",
                "Body Swap",
                "Remove Shyness"
            ],
            "content":"<div class=\"\"><div> <span>\"Emma, I know it's you. I can help you with your life problems.\" said the person.<br>\r\n\"Not to sound rude, but what can you possibly offer me that would resolve all my problems.\"<br>\r\n\"Well, you have a three options. I could either take you to a parallel universe to spice up your life, force a body swap spell with anyone you desire, or I could remove your shyness problem, so you can gain the confidence you desperately need. Your choice.\"<br>\r\nEmma thought that this might be some sort of joke, but she decided to play along with this charade. She chose...</span></div></div>",
            "created":1515948780,
            "id":2440695,
            "title":"The person on the phone keeps talking to Emma"
        },
        "135":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Her mother comes home",
                "She decides to do her chores later"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello?\" Emma immitated. Emma almost giggled, remembering the last time she immitated her mother's voice.<br>\r\n\"Hi. Is Mrs.--\"<br>\r\n\"Yes. This is her. You're speaking to her.\"<br>\r\n\"Yes. We would like to know if you'd like to purchase AT&amp;T Internet Broadband. Are you willing to?\"<br>\r\n\"No thank you.\"<br>\r\n\"Would you like me to get my manager to persuade you?\"<br>\r\n\"No thanks,\" Emma smiled, and hung up the phone without even saying anything back.</span></div></div>",
            "created":1040533200,
            "id":135653,
            "title":"Immitating"
        },
        "1352":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "call Daniella",
                "go out for a walk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chores were getting pretty boring, so Emma decided to...</span></div></span></div>",
            "created":1112418000,
            "id":242702,
            "title":"boring chores"
        },
        "14":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma gets fed up with Daniella",
                "Emma starts getting extremely jealous",
                "Emma quickly says that she has to hang up"
            ],
            "content":"<div class=\"\"><div> <span>   As Emma started walking up to her room, she heard the phone ring. So, as quickly and quietly as she could, she grabbed the phone, turned it on, and said, \"Hello?\"<br>\r\n   \"Emma!\" a shreiking voice sounded, \"You'll never guess what happened to me this morning!\"<br>\r\n   Daniella. Emma smiled. \"What?\" she asked.<br>\r\n   \"You know that new kid from last year?\" Daniella asked.<br>\r\n   \"Yeah...Dallas I think his name was?\"<br>\r\n   \"Uh-huh!\" Daniella smiled, \"He asked me out!\"<br>\r\n   \"But you hardly know him -- \"<br>\r\n   \"It's the thought that counts!\" Daniella interupted. \"Isn't that so sweet of him?\"<br>\r\n   \"Yeah, but -- \"<br>\r\n   \"I know! I just couldn't believe it myself!\"<br>\r\n   \"But Danell -- \"<br>\r\n   \"Don't worry about it, Em,\" Daniella smiled, \"Everything will be fine with me and Dall. By the way, that's what I'm calling him now. Dall. Isn't that so...creative? That's what he told me...\"<br>\r\n   Emma kept trying to get a word in, but Daniella interupted every time.</span></div></div>",
            "created":1030856400,
            "id":123861,
            "title":"Daniella..."
        },
        "141":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma calls up her mom, and asks her if she did the right thing",
                "Emma goes for a walk"
            ],
            "content":"<div class=\"\"><div> <span>   \"Daniella! Shut up!\" Emma screamed, and with shock of her own word choice, she backed off.<br>\r\n   \"What?\" Daniella asked, surprised.<br>\r\n   \"Nothing,\" Emma said, \"Sorry, Dani, you're just getting annoying with Dallas and all--\"<br>\r\n   \"His name's Dall!\" Daniella shrieked, \"And don't call me Dani any more! You ain't my friend! Dallas is my only friend...well, okay, I have more but--\"<br>\r\n   \"No! Daniella, this is all a misunderstanding!\"<br>\r\n   \"No, Emma. The only misunderstanding is that you don't understand what it means when I say that I don't wanna be your friend anymore. Sorry, but you're just too darn quiet for me, too.\"<br>\r\n   Emma hung up. She couldn't take any of this nonscence anymore.</span></div></div>",
            "created":1033794000,
            "id":123862,
            "title":"Daniella isn't Emma's friend anymore??"
        },
        "1411":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma's Mom said she did the right thing",
                "Emma's Mom said she did the wrong thing"
            ],
            "content":"<div class=\"\"><div> <span>As soon as Daniella had hung up with her, Emma stood there silently staring at the phone, tears springing to her eyes. She didn't know what to do. Finally, after five minutes she decided to call her mother. <i>Mom always knows best.</i><br>\r\n<br>\r\nEmma started dialing the phone.<br>\r\n<br>\r\n\"Hello?\" Emma's Mom asked rigidly.</span></div></div>",
            "created":1094965200,
            "id":216195,
            "title":"Calling her Mom"
        },
        "1412":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma keeps on walking and thinking",
                "Emma goes back home"
            ],
            "content":"<div class=\"\"><div> <span>Emma sighed, and started walking down her block. She took the keys with her, and locked the door so she could get back in. She walked for fifteen minutes and enjoyed the nice breeze. Not too hot, not too cold...who cared about Daniella anyway? Daniella and her weren't very close to begin with, so it wasn't really that big of a deal anyway.<br>\r\n<br>\r\nEmma had a feeling that this would happen sooner or later. But now, she was lonesome. No friends at all. It had been her first day at highschool, freshman year, no classes with Daniella (which she was glad for, now) and no new friends.</span></div></div>",
            "created":1057294800,
            "id":164501,
            "title":"A Walk"
        },
        "14121":{
            "author_id":"smilejayuk",
            "author_name":"Dominique",
            "choices":[
                "He says he'll talk to her",
                "He hugs you"
            ],
            "content":"<div class=\"\"><div> <span>A figure ahead of her makes her freeze. Its Dallas. He whips around and sees her. Emma smiled slightly and nervously approches him.<br>\r\n<br>\r\n\"Hey i was on my way over to see Dani, where you heading?\" he asks warmly.<br>\r\nEmma shrugs and he looks at her concerned.<br>\r\n\"Are you ok?\" he enqiures.<br>\r\nEmma bites her lip to hold in tears but just shakes her head letting her glossy hair hide her face.<br>\r\n\"Emma?\"<br>\r\n\"It's-sniff-Dani, we-sniff- had a fight,\" Emma sobs.<br>\r\n\"Oh, well um...\"</span></div></div>",
            "created":1057381200,
            "id":164564,
            "title":"Dallas?"
        },
        "141212":{
            "choices":[
                "tell him what happened",
                "go back home"
            ],
            "content":"<div class=\"\"><div> <span>she backs up quickly and stares at the ground, feeling like someone was watching her she quickly turned around...and saw nothing<br>\r\n\"Uh I'm sorry...\" says Dall uncertainly<br>\r\n\"Uh...d-don't be...\"<br>\r\n\"well do you want to talk about what happened now?\" he says trying to comfort her</span></div></div>",
            "created":1074402000,
            "id":185356,
            "title":"talk or leave?"
        },
        "142":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Decides to start her homework",
                "Decides to go boy hunting at the skate park"
            ],
            "content":"<div class=\"\"><div> <span>\"I am so happy! Anyways, I have to call him soon and I will not be able to make the movie this weekend. I'm going with Dall and his family to the Water Park! Doesn't that sound fun?\" Daniella said happily. <br>\r\n<br>\r\n\"Ya, it sounds great but my God he is so ugly! I can't beleive you went out with him. Like eww,\" Emma said. <br>\r\n<br>\r\n\"Oh my god! You're just jealous! At least I have a boyfriend!\" Daniella screamed. \"Ya, whatever, I would rather have none than that ugly boy,\" Emma said back. There was silence for a minute then in the background she could hear Daniella's doorbell ring. Then she heard Dall's voice, then Daniella hung up. Emma was furious!</span></div></div>",
            "created":1032843600,
            "id":242703,
            "title":"Furious!"
        },
        "1421":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma lies about almost making a friend",
                "Emma tells the truth about almost making a friend"
            ],
            "content":"<div class=\"\"><div> <span>   With frustration, Emma started her homework, and by the time she got to her third math problem, the door opened, and in came her mother.<br>\r\n   \"Hey, Em,\" she said, \"Sorry I wasn't home. How was your first day of school?\"<br>\r\n   Emma sighed. \"It was okay.\"<br>\r\n   And Emma's mom said, \"Did you make any new friends?\"<br>\r\n   Emma stuttered a bit. \"Um...not yet. Almost.\"<br>\r\n   \"Oh? Really?\" Emma's mom asked. \"What do you mean, almost?\"<br>\r\n   Emma sighed. She hadn't made any friend whatsoever--she hadn't even talked.</span></div></div>",
            "created":1033275600,
            "id":123143,
            "title":"Her mom"
        },
        "14212":{
            "author_name":"Brooklyn",
            "choices":[
                "an an annoying bitch",
                "shes nice and friendly"
            ],
            "content":"<div class=\"\"><div> <span>/well actually i didn t really talk much to anyone/emma said fiddling with her pencil /emma this shy thing is getting really old..u need to learn to speak up/her mom yelled /i can t..i don t kno how to stop being shy/emma said as tears welled up in her eyes /well today at work i met this guy who jusy moved here and his daughter is in ur grade her name is hazel stanford do u kno her?/emmas mother asked emma thought for a minute /oh yea that new girl with the peirced nose shes.....</span></div></div>",
            "created":1058418000,
            "id":166185,
            "title":"the new girl"
        },
        "1422":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma runs home crying",
                "Emma goes to Daniella's house"
            ],
            "content":"<div class=\"\"><div> <span>   So, Emma went and got her skates, and went to the Skate Park. She knew this would be difficult, because no guy noticed her because she was so quiet. But she had to get Daniella back, for being so rude.<br>\r\n   When she was there for over an hour, and no guy with her at all, she decided to give up, and left the Skate Park.<br>\r\n   She had spent six dollars to enter...and for nothing! Nothing at all! This was terrible.<br>\r\n   And when Emma left, there was a guy there, with his friend.<br>\r\n   \"You wanna go out with me?\" he asked. He was pretty popular, so it surprised Emma. She didn't know what to say.<br>\r\n   The guy laughed. \"You're too darn quiet. Too bad. Your chance is up.\" And then he left, laughing...laughing with his friend.</span></div></div>",
            "created":1033794000,
            "id":123860,
            "title":"Laughter..."
        },
        "14221":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Her mom is home and sees that she is crying",
                "She runs up to her room"
            ],
            "content":"<div class=\"\"><div> <span>Slowly, tears formed into Emma's eyes. She knew she was going to cry, but tried not to anyway. She ran home as soon as the tears came out, and hoped that that boy didn't see her tears. She decided then and there that she didn't like that boy. If he would ask her to go out with her and really wanted to go out with her, then he wouldn't have just said, \"Time is up.\"<br>\r\n<br>\r\nWhen she got home...</span></div></div>",
            "created":1057381200,
            "id":164509,
            "title":"Crying Home"
        },
        "142212":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma finds out that same boy is in her English class",
                "Emma looks for the boy from the skate park"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Emma ran up to her room and started crying until her family got home. Then she decided she'd better stop and put on a clear face before anybody saw that she had been crying.<br>\r\n<br>\r\nThe next day...</span></div></span></div>",
            "created":1140498000,
            "id":302886,
            "title":"Crying"
        },
        "14222":{
            "author_id":"lequee",
            "author_name":"lequee",
            "choices":[
                "go home",
                "walk to the park"
            ],
            "content":"<div class=\"\"><div> <span>Emma starts to cry as she's running home she starts to think about what she did to daniella so she runs to her house frantically knocking on the door banging but then she realizes that nobody was there that she had left with dallas and for the first time she had to solve this promblem on her own.</span></div></div>",
            "created":1140584400,
            "id":302993,
            "title":"by myself"
        },
        "143":{
            "author_name":"Minnie",
            "choices":[
                "Call Daniella back and say sorry",
                "Watch TV"
            ],
            "content":"<div class=\"\"><div> <span>Emma began to stare at the phone as her friend continued to talk and talk. She pulled the phone from her ear, realizing how loud her best friend spoke. Sure she was glad her friend had a great day, but all she wanted was to relax, and watch TV. <br>\r\n<br>\r\n\" Hey Daniella, I got to go, ok?\" she said.<br>\r\n<br>\r\nDaniella ddin't seem to hear Emma and continued talking about Dal.   <br>\r\n<br>\r\n\" I am just so happy!\" exclaimed Daniella.<br>\r\n<br>\r\n\" Right, I'm happy for you too. Bye.\"<br>\r\n<br>\r\nShe quickly hung the phone, feeling rather bad, but she had a terrible headache. </span></div></div>",
            "created":1032670800,
            "id":122038,
            "title":"Bye"
        },
        "1431":{
            "choices":[
                "Rings Daniella's mom",
                "Waits till school"
            ],
            "content":"<div class=\"\"><div> <span>Later that night, when Emma had finished her tea, she decided to call Daniella back and apologise for hanging up so quickly before. She should be happy for her friend, not.... what? Jealous? Now she thought about it, she was pretty jealous. She'd always admired Daniella for being so confident while she was so shy, but she'd never had to worry about boyfriends before. Maybe that was what what happened when you started high school, Emma mused. <br>\r\n<br>\r\nShe picked up the phone and speed-dialled Daniella's number.<br>\r\n'Hello?' it was Daniella's mom<br>\r\n'Hello, Mrs Keeton. Is Daniella there please?'<br>\r\n'My honey, what a polite little thing you are!' she drawled 'I'm afraid Daniella's just gone out. She'll be round soon though.'<br>\r\n'Pardon?'<br>\r\n'Oh, I thought she's actually made some arrangements with you for once instead of just turning up on your doorstep! She'll be right round!'<br>\r\n<br>\r\nEmma hung up and waited, but Daniella never came.</span></div></div>",
            "created":1143262800,
            "id":308522,
            "title":"Jealous"
        },
        "1432":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "The doorbell rings",
                "Emma keeps flipping channels"
            ],
            "content":"<div class=\"\"><div> <span>   But Emma didn't really bother to call her friend back, and realized that if Daniella was at all concerned, she would call back.<br>\r\n   Emma couldn't find anything she wanted on TV, though. She still kept flipping the channels, one by one by one...aha! Seasme Street was on! But Emma knew she would never watch it.<br>\r\n   But for some reason, she found herself watching it, you know, for old time's sake.</span></div></div>",
            "created":1033794000,
            "id":123856,
            "title":"Seasme Street"
        },
        "14321":{
            "author_name":"elephant chicka",
            "choices":[
                "say thanks for coming and then say you have to go",
                "the phone rings"
            ],
            "content":"<div class=\"\"><div> <span>Emma kept flipping through the channels when the door bell rang. with a slight sigh, she snuck to the door and peeked to see who it was. It was a boy from her highschool named Brad. without even thinking, Emma opened the door. He gave a hansome smile and said, \"Hi, im Brad, the guy from your school. you're a new freshman just like me.\" How did he get here, Emma wondered, will he just please go away? Almost like reading her mind, he answered,\"I live just down the street. its kinda a small world. and i find it funny we go to the same school and live near eachother too.\" He a gave a nervous laugh, but recovered it with anohter handsome smile. Emma didnt say anything. she just kept staring at the ground.</span></div></div>",
            "created":1075525200,
            "id":186885,
            "title":"Brad, a boy from school"
        },
        "143211":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "\"Yeah, I understood it.\"",
                "\"Ummm...we didn't HAVE any biology homework...\""
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, well, you know, Brad,\" Emma stammered. \"I really appreciate you coming and paying me a visit. But I think you'd better go.\"<br>\r\n<br>\r\n\"Oh.\" Brad looked down at his shoes. They were red nikes, that he had gotten as a Christmas present last year.  \"Well, it was nice talking to you.\"<br>\r\n<br>\r\n\"You too.\" Emma was just about to close the door when she heard another whimper fall out of Brad's lips.<br>\r\n<br>\r\n\"Wait,\" he said. \"You're in my biology class. Do you understand the homework we had to do?\"<br>\r\n<br>\r\nEmma says:</span></div></div>",
            "created":1094965200,
            "id":216186,
            "title":"Closing the Door on Brad"
        },
        "1432111":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma decides to help Brad out in biology",
                "Emma says no, and shuts the door on him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Yeah, I understood it. What about it?\"<br>\r\n<br>\r\n\"I didn't understand a thing. I was wondering, that maybe, you could show me how. I'm clueless on the whole mixup of mitosis and meosis...\"<br>\r\n<br>\r\nEmma sighed.</span></div></span></div>",
            "created":1094965200,
            "id":216189,
            "title":"Bio Homework"
        },
        "14321111":{
            "author_id":"threadbarelove",
            "author_name":"Antidote For Loneliness",
            "choices":[
                "Unburden Her Heart ToThe Confidant"
            ],
            "content":"<div class=\"\"><div> <span>Following a self-reflection of whether or not her reaction was proper, Emma stirred aside to let Brad in, cleaving open the door with her palm as he crossed the threshold. Emma captured a momentary look at Brad, as his mannered judgment grazed his surroundings. Her inexperienced proclivity she had toward guys made her feel tense, and the feelings of what her parents would shout when they caught sight to the fact that she had a guy in the house while they were absent made her even more apprehensive about her verdict. Nevertheless, she pushed secure the door, in efforts of letting go her worries. She needed nothing more, whilst on tenterhooks, but to liberate herself from her concrete barrier composed of caginess and introversion. Former to spiraling around to face Brad, Emma took a momentary look at herself in the mirror, the one that her mother had positioned by the front entrance, creating a forever-easy view to the appearance of her form. Her russet hair fell in tresses roughly to her shoulders. It hadn’t been swept up or washed down and her too full eyebrows demonstrated her years of anxiety. Bright emerald-green eyes of innocence sparred for themselves, as she fingered her hair, cleaning strands from her eyes. It was then when Brad spoke creating Emma to jump at the unexpected break of silence. “Emma…why are you so reluctant to talk to me? I try to make friendly conversation and all you can do is isolate yourself even further from the people around you. They want to be your friends,” his tone caught Emma off guard. His concern for Emma was one she never had to face before. It left her in a speechless trance. “…I want to be your friend,” he spoke his words in disappointment as Emma swallowed hard, continuing to stare at Brad. Everything grew silent except for the ticking of the clock.</span></div></div>",
            "created":1146978000,
            "id":317451,
            "title":"Reluctance Has Its Disadvantages"
        },
        "143211111":{
            "author_id":"rlangley",
            "author_name":"rebecca._.langley",
            "choices":[
                "Brad tells his and Emma's parents about Emma's rape",
                "Brad tells the police about Emma's rape"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, Brad, last year I got raped by my boyfriend. I really trusted him since we'd been going out since the beginning of middle school. But, last year, at his party, he took me to his bedroom. He pushed me down on the bed and I shouted no because I knew what he was trying to do and I wasn't ready. He insisted anyway and kept going. I never told anyone. Not my parents. Not the cops. Anyways, ever since then I haven't been able to trust anybody, especially boys. I can only trust my best friend, Daniella because she was there for me afterward. But, she just called me and, apparently, now she's dating some guy she barely knows. She knows what happened to me so I don't know why she's dating him! I don't want her to get raped too!\"<br>\r\n<br>\r\nEmma starts crying and gets embarrassed that Brad is there to see it.<br>\r\n<br>\r\n\"It's okay, Emma, I'm here for you. Thank you for telling me but we don't have to talk about it anymore.\"<br>\r\n<br>\r\n\"Maybe you should get going,\" Emma suggested.<br>\r\n<br>\r\n\"Okay. But remember that I'm always here for you. I'll see you at school tomorrow,\" Brad says slowly.<br>\r\n<br>\r\nBrad slowly walks out the door, concerned about Emma. He is sorry for Emma and never expected that she would tell him that. Brad walks back to his house. When he gets there he goes immediately to his room.</span></div></div>",
            "created":1507613700,
            "id":2398990,
            "title":"Unburden Her Heart ToThe Confidant"
        },
        "14321112":{
            "author_id":"scarlet",
            "author_name":"Lolita",
            "choices":[
                "Another new friend from school invites Emma to a party",
                "The neighbourhood classmate's mother calls in..."
            ],
            "content":"<div class=\"\"><div> <span>Emma wondered whether she should put off off the TV, retire into her upstairs room and nurse her now worsened headache.Making her choice, she trudged up the staircase to her safe haven where she knew she could curl up in her fantasy world and go on a roller-coaster adventure or a romantic getaway, without worrying about who felt which way about her strange ways.<br>\r\n<br>\r\nThe musical telephone buzz interrupted even before she got started.Drudgery lifted, she ran downstairs to grab the receiver before her prying elder brother could stick his fingers into her complicated affairs.</span></div></div>",
            "created":1168750800,
            "id":373670,
            "title":"The Party"
        },
        "1432112":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "They continue to talk",
                "Emma finally slams the door on him"
            ],
            "content":"<div class=\"\"><div> <span>\"Ummm...we didn't <i>have</i> any biology homework.\"<br>\r\n<br>\r\n\"We didn't?\" Brad gulped.<br>\r\n<br>\r\n\"No. It's only the first day of school.\"<br>\r\n<br>\r\n\"Well, then, I was pretty confused in that class, I guess,\" Brad explained, \"Because I thought we had homework. You know, biology seems like a very interesting subject, although it also seems confusing. I think it'll be nice to know in the future. You know what I'm saying?\"<br>\r\n<br>\r\n\"I guess so,\" Emma nodded. \"But I don't want to be a biologist when I grow up.\"<br>\r\n<br>\r\n\"You don't?\" Brad asked. \"Then what do you want to be?\"<br>\r\n<br>\r\n\"A poet. I love poetry. I've loved it since I was very little.\"<br>\r\n<br>\r\n\"That's cool,\" Brad smiled. \"You know, my youngest sister is into poetry, too. But I bet you'll never guess what <i>I</i> want to be.\"<br>\r\n<br>\r\nEmma laughed. \"A salesman.\"<br>\r\n<br>\r\n\"Why would you say that?\"</span></div></div>",
            "created":1094965200,
            "id":216191,
            "title":"No Bio Homework"
        },
        "143212":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "Emma ignores Brad and calls Daniella back",
                "Emma asks Brad politely to leave so she can call Daniella back"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, in the midst of the awkward silence, came a ring from the phone. \"Um, what did you say your name was?\" Emma asked shyly.<br>\r\n<br>\r\n\"Brad.\"<br>\r\n<br>\r\n\"Brad, then. If you'll excuse me, my phone is ringing, so...\"<br>\r\n<br>\r\n\"No, that's all right. You answer your phone, I'll wait here.\"<br>\r\n<br>\r\nEmma hurriedly ran to the kitchen and picked up the reciever. \"Hello?\" she asked.<br>\r\n<br>\r\n\"Hey Em.\" It was Daniella. \"I was thinking about our earlier conversation and I think it was really mean of you to diss me and Dal like that.\"<br>\r\n<br>\r\n\"I didn't diss you, I just had to get off the phone.\"<br>\r\n<br>\r\n\"Uh-huh,\" Daniella screamed. \"You know, I've been thinking. I don't want to be your friend anymore.\"<br>\r\n<br>\r\n\"What?! No, Daniella, you can't do that, you're my only friend, you can't -- \"<br>\r\n<br>\r\nEmma couldn't say much more. Daniella had finally hung up her phone. Emma was thinking of calling Daniella back, but then she remembered Brad at the front door.</span></div></div>",
            "created":1094965200,
            "id":216194,
            "title":"Daniella's Mean Phone Call"
        },
        "1432122":{
            "choices":[
                "Daniella opens the phone.",
                "Daniella's mum opens the phone."
            ],
            "content":"<div class=\"\"><div> <span>Emma runs to the front door to see if Brad is there,she doesn't want him to learn about Daniella. Yes he is still waiting for her and when he sees her coming he smiled. Emma said shyly.<br>\r\n<br>\r\n\"Brad..\"<br>\r\n\"Yes Emma? I am listening to you..\"<br>\r\n\"Well look, I am really sorry but can we talk later? I need to do something that is really important..\"<br>\r\n\"Oh sure Emma. Good luck on it\"<br>\r\n\"Thanks .. I am really sorry again.\"<br>\r\n\"Look its not a problem so cheer up and oh it is really nice meeting with you.\"<br>\r\n\"Same here..\"<br>\r\n<br>\r\nBrad leaves and now all she is thinking about is Brad .. Then suddenly she remembers Daniella. Emma runs to the kitchen grabs the phone quickly and phones to Daniella.</span></div></div>",
            "created":1252386000,
            "id":757558,
            "title":"Emma thinks Brad is nice!"
        },
        "14321221":{
            "choices":[
                "The door rings.",
                "Emma goes to the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>When Emma phoned to Daniella, she opens the phone.<br>\r\n<br>\r\n\"Hello\"<br>\r\n\"Ugh ! What you want from me?\"<br>\r\n\"Daniella the thing I do .. I am really sorry.\"<br>\r\n\"No, no you don't want me and Dallas because your too jealous of us! Bestfriends don't do that to eachother.\"<br>\r\n\"Im not jealous of you both!\" Emma says shockly.<br>\r\n\"Sure, sure your not.\"<br>\r\n\"Please be my friend again! I don't want to loose you.\"<br>\r\n\"I dont care! Just get off from my life.\"<br>\r\n\"But but..\"<br>\r\n<br>\r\nDaniella closes the phone to her face. Emma sits on the sofa and begins to cry. </span></div></div>",
            "created":1252386000,
            "id":757560,
            "title":"Daniella opens the phone."
        },
        "143212211":{
            "choices":[
                "They ignore the door.",
                "It is Emma's mum."
            ],
            "content":"<div class=\"\"><div> <span>Emma runs to the door and opens it. It was Brad coming because he needed to talk to her. Brad sees Emma is crying.<br>\r\n<br>\r\n\"Emma ! Whats wrong?\"<br>\r\n\"Nothing is wrong everythings okay.\"<br>\r\n\"But look your crying!\"<br>\r\n\"No I'm not just there is something in my eye..\"<br>\r\n\"Noooo ! Look tell me whats wrong maybe I can solve it out.\"<br>\r\n\"Nobody can solve it out.\"<br>\r\n\"Maybe I can just tell me !\"<br>\r\n\"I just have a friend called Daniella shes the only friend I ever had. Today she phoned me and said she and Dallas they are going out but I need to say her an important thing about Dallas, she thinks I am jealous of both! She said me to get off from her life.\"<br>\r\n\"Whoaa..thats sad I guess your going to tell Dallas is cheating on her like hes doing the anothers?\"<br>\r\n\"Oh my god ! How can you know it ..\"<br>\r\n\"Because he was going out with my sister and in the mall I saw him kissing an another girl.\"<br>\r\n\"Woow .. what did you do ?\"<br>\r\n\"I told about it to my sister and they broke up.\"<br>\r\n\"Oh who is your sister by the way?<br>\r\n\"Amy.\"<br>\r\n\"Can Amy help us about this? I mean about me and Daniella..\"<br>\r\n\"Oh sure I will tell her these..well Emma we need to talk.\"<br>\r\n\"About?\"<br>\r\n\"Lets talk inside.\"<br>\r\n<br>\r\nThey go to the living room and sit on the sofa. Brad said with a smily face.<br>\r\n\"Emma..\"<br>\r\n\"Brad ?\"<br>\r\n\"Look I need to tell you something.\"<br>\r\n\"I am listening to you.\"<br>\r\n\"I don't know how it begin but..\" Brad holds her hand and continues<br>\r\n\"I Love You.\" He says..<br>\r\n<br>\r\nEmma was shocked. She didnt know what to say. Brad continue to his talking.<br>\r\n<br>\r\n\"Emma can you go out with me?\" He said shyly and kissed her. Emma was really happy she was smiling and her heart was saying that she SHOULD go out with Brad..<br>\r\n<br>\r\n\"Yes..\" Emma said in a shy quiet voice.<br>\r\n\"Oh my god! I Love You Darling\" They start kissing eachother.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1252386000,
            "id":757563,
            "title":"Emma and Brad is going out."
        },
        "1432122111":{
            "choices":[
                "They phoned to Emma's mum.",
                "Emma's mum comes."
            ],
            "content":"<div class=\"\"><div> <span>They heard that the door was knocking but they ignored the door. They were touching eachothers bodies and she could feel his body.. Then like an hour later she noticed that she wasn't a virgin no more ! She was so scared.<br>\r\n<br>\r\n\"Oh my god Brad! What did we do?\"<br>\r\n\"Emma.. I know ..\"<br>\r\n\"But I lost my virginity for you I am just fourteen!\"<br>\r\n\"We should forget about this, nothing like this happened okay?\"<br>\r\n\"No its about my life! She started to cry.<br>\r\n\"We can't forget it!\"<br>\r\n\"Emma If your preggie..?<br>\r\n\"I don't care If I am or not! We should tell it to my mum. If I am preggy then I am not going to give the baby a birth. It is really early for me to be a mum and you a dad.\"<br>\r\n<br>\r\nBrad noticed he did a wrong thing really a wrong one. He didn't know what should they do. He should tell these to Emma's mum .. All the things that happened.</span></div></div>",
            "created":1252419180,
            "id":757569,
            "title":"They ignore the door."
        },
        "1432122112":{
            "choices":[
                "Brad leaves.",
                "Her mum leaves."
            ],
            "content":"<div class=\"\"><div> <span>Then the door rings. Emma says<br>\r\n\"Oh I guess it is my mum...\"<br>\r\n\"Really? I want to meet with her.\" Brad smiles.<br>\r\n<br>\r\nEmma goes and opens the door and yes it was her mum. Her mum sees Brad and asks<br>\r\n\"Emma a new friend?\"<br>\r\n\"Mum..I guess I love him.\" She says shyly.<br>\r\n\"Aww my honeypie! I wish your dad can see this day too..\"<br>\r\n\"Mum don't make me shy\"<br>\r\n\"Okay honey.\"<br>\r\n<br>\r\nThey both walks to the living room. Brad says happyly.<br>\r\n<br>\r\n\"Hello Mrs.Bell\"<br>\r\n\"Hello I guess your Brad.\"<br>\r\n\"Yes Mrs. I am.\"<br>\r\n\"I heard that you and Emma are going out.\" She said happily.<br>\r\n\"Yes we are if it is not a problem tomorrow can me and Emma go out?\"<br>\r\n\"Sure, sure why not.\"<br>\r\n\"Thanks mum.\" Emma is smiling and totally forget about Daniella.<br>\r\n</span></div></div>",
            "created":1252386000,
            "id":757565,
            "title":"It is Emma's mum."
        },
        "14321222":{
            "choices":[
                "She ignores the phone.",
                "She opens the phone."
            ],
            "content":"<div class=\"\"><div> <span>Emma phones to Daniella but her mums open the phone.<br>\r\n<br>\r\n\"Hey\" Emma says politly.<br>\r\n\"Emma is that you?\"<br>\r\n\"Yes Mrs.McGranny\"<br>\r\n\"Oh look Emma, Daniella doesn't want you to phone her again.\"<br>\r\n\"But what did I do\" Emma starts to cry.<br>\r\n\"She says that your jealous of her and Dallas.\"<br>\r\n\"No, I am not but I need to tell her a truth about Dallas.\"<br>\r\n\"Oh my god ! Emma\"<br>\r\n\"...\"<br>\r\n\"Your really jealous! Don't phone us again!\"<br>\r\n<br>\r\nMrs.McGranny closes the phone. This talking was all wrong. Daniella's mum was being her really mean. Emma continues crying till the phone rings.</span></div></div>",
            "created":1252386000,
            "id":757561,
            "title":"Daniella's mum opens the phone."
        },
        "14322":{
            "author_id":"soapysuds",
            "author_name":"SoapySuds",
            "choices":[
                "She falls asleep",
                "Her mom comes through the door, interupting her moment"
            ],
            "content":"<div class=\"\"><div> <span>As Emma flipped the channels, her headache seemed to get worse and worse. She sighed. \"But we don't have any medicine for it,\" she told herself, which was, unfortunately true.<br>\r\n<br>\r\nRubbing her head, Emma decided to turn the TV off, and she rested her head on her couch pillow. Gently, she closed her eyes, and...</span></div></div>",
            "created":1057381200,
            "id":164508,
            "title":"Sleep?!"
        }
    },
    "info":{
        "author_id":"soapysuds",
        "author_name":"SoapySuds",
        "brief_description":"About a girl who is shy to the world.",
        "created":1030072980,
        "description":"<td align=\"left\" class=\"norm\">Emma. She's fourteen years old, her first year in highschool, and the shyest kid on the block.</td>",
        "id":503078,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1560991200,
        "modified":1560991200,
        "pretty_title":"The Shy One"
    }
}