{
    "chapters":{
        "1":{
            "author_id":"yajya",
            "author_name":"Yusush",
            "choices":[
                "God sized",
                "Giant sized",
                "Human sized",
                "Smol "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What size boss? Who’ll you be fighting a waist height or a god?</span></div></span></div>",
            "created":1572568320,
            "id":2740767,
            "title":"Choices"
        },
        "12":{
            "author_id":"yajya",
            "author_name":"Yusush",
            "choices":[
                "Fighter intro",
                "Other Bosses",
                "Other ",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Oress is a giant sized Serpior and the leader in the invasion of the earth. <br>\r\n<br>\r\nStrong Points: Her vines are the primary weapon she uses often just pushing her enemies away and then curling them up and constricting.<br>\r\nHer entire back is hard armor plates so it is next impenetrable.<br>\r\n<br>\r\nWeak Points:Under is her belly which can be cut by a butter knife with the right force. Also her deeper into her bellow are yellow sacks which contain her babies. Then later her heart. <br>\r\nShe is very cocky and often never really calls for help even when she needs it. And you can hide from her by going under armor because she never looks there when she loses sight.<br>\r\n<br>\r\nNSFW is optional and will go into it only with consent.</span></div></div>",
            "created":1576039980,
            "id":2758079,
            "title":"Giant sized"
        }
    },
    "info":{
        "author_id":"yajya",
        "author_name":"Yusush",
        "brief_description":"Now this is stupid yet cool.",
        "created":1572568200,
        "description":"<td align=\"left\" class=\"norm\">Hey! I decided to make a story for people to insert bosses of whatever they choose and others can make their fighter. Make a story on why it happening if you want! <br>\r\n<br>\r\nThen it turns into role play of fighter versus boss. Now the reason this is 18+ is because vore and erotic scenes are allowed but give a warning first k?<br>\r\n<br>\r\nHey diz are ze rules!<br>\r\n<br>\r\n1. No super op.<br>\r\nOk there can be situations where a fighter can’t do anything about it and just lose. But don’t make it boom boom dead. It’s not very fun at all.<br>\r\n<br>\r\n2. When the boss and fighter are chosen only they can add to their roleplay others can as long as they have permission.<br>\r\n<br>\r\n3. Pokemon based bosses only I will allow Anthros out pokemon only.<br>\r\n<br>\r\nThose are the rules I can think off. Go crazy!</td>",
        "id":2204454,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576039980,
        "modified":1576039980,
        "pretty_title":"Pokemon boss battle!"
    }
}