{
    "chapters":{
        "1":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Sept 17, 2003<br>\r\n<br>\r\n\" Hey Mike, Wait for me!\" Jake yelled out while running down St. Joseph boulevard trying to keep up...   Mike stopped running and turned around yelling, \"Come on, I don't want to miss the bus!\" \" I know, i been waiting so long to see this movie to, but man i'm just not as fast as a runner than you are you know that\" Jake Replied back.. <br>\r\n<br>\r\nA few blocks down Jasmine walked out of a building a little sad and depressed after what seems to be a disappointing search, as she needed to return home that night, without finding the person she was hoping to find...  Without realizing she is now walking across the street.<br>\r\n<br>\r\n\"Oh no, a Girl is about to get run over\" Jake yelled, and without thinking he bolted towards the girl pushing her out of the way, But unfortunately got hit by a car instead in the process.  <br>\r\nJasmine got up and turned around and found a boy lieing on the ground bleeding, and instinctivly she casted a small freeze time spell that froze time, the world around her is frozen in time as if they were statues..  and then she walked towards the boy speaking softly \" Could you be the person i was searching for?\" Then she looks up to the sky and summons her father.<br>\r\n<br>\r\n  \" Yes, my child?\" Drake said.  Jasmine says\" Father, can you save this human, i think he is the person I was searching for\"   Drake looks at the boy lieing on the ground, then looks back at Jasmine and replies\" Are you sure that this is the person? if he turns out to be the wrong one it could be very devastating to any possible alliance with the humans, after all it was a bad choice that ended the last alliance that we had with humans..\"  Jasmine replies back \" Im sure father\"    Drake nods, and then moves towards the boy and casts a spell, a glow started to surround Jake and Jasmine...    Drake Said \" its now done, i have linked your spirit with this child's he will now live as long as you do and will allow him to heal the link will disipate when he reaches 17.. although you are still not mated with him yet, unfortunatly he is too young to take on this reponsibility yet, so i will lock this memory of the event in his mind...  and wipe any memory of this event from all humans involved in this incident, You must not approach him while this link is active ok?\"  Jasmine replied \" Yes father\"  Drake said \" dont worry though he will vaguely remember you, as in his memorys place i will fabricate a memory that you simply just bumped into each other and talked for a while\"<br>\r\n<br>\r\nDrake towards Jake and now incants a few more words, and with that Jasmine and Drake disappears leaving Jake sitting on a bench located on the side of the road.. With Mike sitting beside him waiting for bus. Jake having no memory of what transpired except for meeting a girl that he enjoyed talking to.</span></div></div>",
            "created":1287378000,
            "id":977249,
            "title":"The hidden past....  "
        },
        "11":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Jake Tells Mike about his dream last night",
                "Jake bumps into a new classmate (Jasmine)",
                "Jake bumps into Ted the school bully"
            ],
            "content":"<div class=\"\"><div> <span>Sept 17, 2010<br>\r\n<br>\r\n\"Hey, Jake wake up, its time to get ready for school!\" Yelled Samantha,  \", Ok, mom, im getting up\"  Jake replied, Jake now sitting on his bed, thinking about the stange dream he had last night.  \" Another one of those dreams\" he said to himself...  standing up he heads to the bathroom to take a shower...<br>\r\n<br>\r\nMeanwhile in the Dragons Lair ....<br>\r\n<br>\r\n<br>\r\nDrake said\" Jasmine are you ready to go...?\" Jasmine replied \"Yes, Father, Its time to meet him again after 7 years... \"  Drake says \" Jasmine, Remember you must make yourself a part of his life as a human would before you mate with him, it is prefered by all dragons that it is done willingly, and only unwillingly if absolutly necessary\".  Jasmine looked back at her father repling \" I know father,  ill miss you,  \" Jasmine who now tansformed into a human, now headed out into the world to meet her future mate...<br>\r\n<br>\r\n<br>\r\nBack at Jake's House.<br>\r\n<br>\r\n \"Jake, Mikes here!\"  Samantha yelled....  Jake replied \" I'll be right down i'm almost ready\"  A few minutes later Jake comes running down the stairs, and takes his lunch bag from his mom as he runs by saying \" Bye Mom, see you later tonight, and thanks for the lunch\"  He then joins his friend on the way to school....<br>\r\n<br>\r\nOn the way to school......</span></div></div>",
            "created":1287378000,
            "id":977262,
            "title":"7 years later......."
        },
        "113":{
            "author_id":"xdarkrevex",
            "author_name":"Dark Reve",
            "choices":[
                "Jasmine",
                "The Principle ",
                "Steve, who is another one of Jake's bullies"
            ],
            "content":"<div class=\"\"><div> <span>Even after 7 years, Ted still picks on Jake. He was hoping not to bump into him today... unfortunately he did.<br>\r\n<br>\r\n“Well if it isn’t that same loser I beat up yesterday!” he says, then as he laughs, “Or more like every day!” Jake backs up, and says “Look, don’t you think we’re a bit too old for this now? I mean, this has been going on for 7 years! And wouldn’t you think it gets boring to just pick on the same person every day?”<br>\r\n<br>\r\nAs he walks toward him, Ted simply explains, “Trust me, I tried. But it seems that you’re the only one who never fights back. And so it’s fun to pick on you because of that.” He lifts his fists up, “Now, please have your stomach in good view so it’s easier to do this?”<br>\r\n<br>\r\n That fact got to Jake. He realized that whenever he’s in this situation, he never really tries to do anything to stop it. At this moment, he is now cornered at a wall. Ted raises his fist, “Take this you pipsqueak!” he says as he throws his fist towards him.<br>\r\nFor the first time in history, Jake actually dodges his attack, making him hit the wall. Ted realizes that he dodged his attack, and so he tried again. Jake barely dodged his second attack, making himself stumble afterwards. “Hey!” says Ted, “Stay still so I can hit you!”<br>\r\n<br>\r\nHe tried to hit him again, but he ducks, and attempts to take him down. Unfortunately, Ted is too big for him to do that. He kicks Jake off of him, making him fall to the ground. He rolls to evade Ted, and gets up to run. “Hey! Get back here!” says Ted as he runs toward him.<br>\r\n<br>\r\nMike finally finishes using the restroom. But when he comes out, neither Jake nor Ted is anywhere to be found. Meanwhile, Ted is still running after Jake… until someone certain saw them…</span></div></div>",
            "created":1287378000,
            "id":977378,
            "title":"Gulp..."
        },
        "1131":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Jasmine scares Ted off in her dragon form",
                "Jasmine  defends Jake in her human form",
                "Ted was able to get some shots on Jake, which brings Jake close to death."
            ],
            "content":"<div class=\"\"><div> <span>Jasmine was walking down the street when she heard a commotion just around the corner.  She decided to go see what its all about..  \"Get back here you dweeb, and let me give you whats comming to you!\" Ted Yells.   As soon as Jasmine heard those words Jake finaly came ito Jasmine's view followed by a kid who Jasmine does not recognize, but already determined that he can pose a danger towards Jake if this chase was continue.  <br>\r\n<br>\r\nTed finnaly catching up with Jake managed to push him to the ground.  \"You know Jake I was willing to only give you one good hit in the stomach, but since you made me run all this way to get you, its gonna be alot more worse!\" Ted yelled<br>\r\n<br>\r\nJake passed out due to the force exerted on him, Jasmine decided to stop this attack  against Jake..   <br>\r\n</span></div></div>",
            "created":1287378000,
            "id":977433,
            "title":"Jasmine"
        },
        "11312":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Jake came to... with the girl from his dreams gazing lovingly into his eyes!",
                "Slowly she helped him to his feet, him dizzy and out of it, not quite awake.",
                "Jake wouldn't wake up and Jasmine decides to carry him to safety."
            ],
            "content":"<div class=\"\"><div> <span>Jasmine's heart was racing, seeing the love of her life unconscious and beaten by this cruel human! She felt the raging hatred surging in her, but remembered her father's teachings. She struggled, fighting down the emotion, but as the bully strode over the prone form of Jake she had to fight the urge to just surge into dragon form and roar at the annoying human... It was hard but she resisted and instead strode powerfully up behind the boy and tapped him on the shoulder.<br>\r\n<br>\r\n\"Whu?\" Came the surprised voice of the bully.<br>\r\n<br>\r\n\"Cease this at once or I will be forced to hurt you.\" She said, her eyes glaring into his.<br>\r\n<br>\r\nA moment of fluster came to his eyes, and she knew she could be very intimidating, but his self-importance reasserted itself and he chuckled.<br>\r\n<br>\r\n\"What? Jakey has girls fight for him now? Oooh I'm so scared!\" He said, then gave her a dismissing wave of the hand before turning around towards Jake on the ground once more, flexing his knuckles in anticipation. \"Now get out of here girl. I got fun stuff to deal with.\"<br>\r\n<br>\r\nJasmine literally saw red. A hand clamped on the boy's shoulder and spun him around. He gasped at the rather strong motion, almost falling over from the sudden twist, then blinked as he saw a fist swinging for him.<br>\r\n<br>\r\nAmazingly he dodged. True, Jasmine was not a war dragon and did not have a lot of experience of fighting, let alone fighting in human form, but her reflexes were fast. It was impressive this boy avoided it.<br>\r\n<br>\r\n\"God damn it!\" He yelled, then swung back hard.<br>\r\n<br>\r\n*CLANG!*<br>\r\n<br>\r\n\"OW OW OW OW!\" He yelled, hopping from one foot to the other clutching his hand where he'd struck her stomach scales. She smiled viciously and while he was distracted slammed a fist into his gut, leaving him winded and curling up onto the floor clutching his belly.<br>\r\n<br>\r\nWith the threat dealt with she turned to her love and crouched down beside him.<br>\r\n<br>\r\n\"Jake? Are you OK?\"</span></div></div>",
            "created":1603047420,
            "id":2924081,
            "title":"Jasmine  defends Jake in her human form"
        },
        "113123":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "From Jake's perspective an angel was beaming at him.",
                "Jake jerked away, not used to waking up with anyone there. Yikes!",
                "Ted has recovered and watches unseen from the door as Jake wakes up."
            ],
            "content":"<div class=\"\"><div> <span>This was not how Jasmine envisioned finally meeting Jake face to face after all these years and she looked around. There was an abandoned shed nearby on the farm road heading towards town and she ignored the bully still curled in a fetal position on the ground and heaved Jake up into her arms and strode over to the shed. Kicking the door in heedlessly she strode in, found some straw and gently placed Jake down on it.<br>\r\n<br>\r\nHer knowledge of magic beyond the instinctual was... limited. Her father was far better at such things than she, but she did manage a weak healing spell to minimize what the bully had done. Soon Jake's eyes began to flutter and Jasmine found her heart speeding up for a very different reason. All these years, all this time watching him from afar, and now she could meet him.<br>\r\n<br>\r\nShe leaned over and as his eyes flickered open she smiled down at him.</span></div></div>",
            "created":1603047900,
            "id":2924088,
            "title":"A little privacy."
        },
        "1131231":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "She helps him up and to school once he's recovered.",
                "Jake's injuries are minor, but probably should be looked at. To the doctor.",
                "Jasmine owns up and begins to explain about herself."
            ],
            "content":"<div class=\"\"><div> <span>Jake slowly awoke, pain still surging in his gut, opened his eyes... and gulped. A beautiful girl was gazing down at him, a smile edging her mouth, but not a callous one. With sunlight streaming down behind her from a hole in the ceiling she looked like an angel!<br>\r\n<br>\r\n\"I... Who are you?\" Jake said in a whisper.<br>\r\n<br>\r\nThe angel's smile grew wider.<br>\r\n<br>\r\n\"Oh, I'm so glad you are unhurt Jake. My name is Jasmine. I couldn't stand by seeing that boy vent his anger upon you. Do not fear, he is dealt with.\"<br>\r\n<br>\r\n\"Y... you dealt with Ted?\" Jake says blinking in shock.<br>\r\n<br>\r\n\"Yes. I... Oh no! I swear he is fine! I didn't eat him or anything.\" she says with a slightly shocked expression.<br>\r\n<br>\r\n\"Uh... what?\"<br>\r\n<br>\r\nShe blinked down, as confused as Jake was. Jake got the distinct impression there was something he was missing in this conversation.<br>\r\n<br>\r\n\"Look, you are injured. Just relax Jake. All will be well.\" She said and smiled again, resting a hand warmly against Jake's forehead, making him flush at the touch.</span></div></div>",
            "created":1603048440,
            "id":2924092,
            "title":"Angelic savior."
        },
        "11312313":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "He is shocked, and scared. He needs time to accept all this!",
                "He wraps his arms tightly around her \"I trust you!\" He says, hugging tightly.",
                "Jasmine's father, in human form, arrives to explain further."
            ],
            "content":"<div class=\"\"><div> <span>\"Who are you?\" Jake says, then as Jasmine frowns he shakes his head. \"OK, I got your name but...\" He looks askance at her, getting the impression something is.... off about her. Not wrong just... different.<br>\r\n<br>\r\nJasmine sighed and sat back a little from him.<br>\r\n<br>\r\n\"It seems I have not spent enough time like this. I should have realized it would be easy to detect the differences. Jake, as I said my name is Jasmine but I am not a normal human girl. I... am a dragon.\"<br>\r\n<br>\r\nFor some reason Jake doesn't laugh at that. Something clicks in his head and despite the blur of dreams he connects her face.<br>\r\n<br>\r\n\"Oh my god you're my dream girl!\"<br>\r\n<br>\r\nJasmine's eyes suddenly go wide, misinterpreting his words slightly, and she blushes hard.<br>\r\n<br>\r\n\"I... Jake! I had hoped you felt the same for me but...\" She shook her head, calming visibly. \"But we must not dally on such things. There is much we must discuss first. Dragons have hidden themselves from the human world for a long time, the danger from such visits across the divide enough to hinder such meetings. But suffice to say that once, over three thousand years ago, Dragons and humans fought together against an ancient enemy. An alliance was formed, joining the brave warriors and powerful mages of humankind with the natural gifts and instinctive magics of dragons. Together we fought and bested the enemy, but did not defeat it outright. Banished it stayed on the edges of reality, waiting to return. There have been a few... scouts by the enemy in the past, but they have been minor. With humans losing their magic they were no match so we dealt with the few problems. But recently as humans have improved their machines we realized there is a new opportunity. A mix of our gifts and your new capabilities may yet deal with this enemy. But to do that a true alliance must form once more.\"<br>\r\n<br>\r\nJake stared at her while she stated this long speech. It sounded rehearsed but still got the feeling she was speaking from the heart. She... was a dragon? She looked wonderful, but hardly draconic. But he'd had dreams of a girl saving him, repeating many times over the years, and she was the spitting image of that dream. It was tricky to remember the details, but once he saw her in a clear light the resemblance was unmistakable.<br>\r\n<br>\r\nBut Jasmine hadn't finished her speech.<br>\r\n<br>\r\n\"For humans and dragons to be one once more and align against the darkness a joining must occur. A link between the two realms. I have already undergone a casting to allow me to shift to human form, but humans have lost their art. The Dragon council is resolved that only a partnership between two of both worlds will link the two realms. I sought you out seven years ago, looking for a mate...\" She blushed. \"... and you found me! You saved me back then. I know you do not remember, but you showed a selflessness and bravery even at such a young age that impressed me. As the years went by and I watched you I fell more and more in love with you. Please, consent to be my mate. Be with me, and by so joining know that you will gain much. You will be able to turn into a dragon just as I can become a human.\" She frowned slightly, a little anxiousness on her face. \"For the first two years it is likely you will be... stuck as a dragon. We still are not certain how humans lost their magic, but it has limited things. My father is a master of the arts and he says the joining will have no ill effects for either of us. Trust him, please.\"<br>\r\n<br>\r\nJake gazes up at her, mouth agape at what he has just heard.<br>\r\n<br>\r\nShe... wants to be his girlfriend? Wife? Mate?</span></div></div>",
            "created":1603049580,
            "id":2924102,
            "title":"Explanations."
        },
        "113123133":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Jake happily agrees, inviting Jasmine and Drake to his house.",
                "Jake is nervous, but definitely interested. He suggests they date first.",
                "Talk of an ancient enemy and dragons scares Jake. Just stay friends for now."
            ],
            "content":"<div class=\"\"><div> <span>\"My daughter speaks the truth.\"<br>\r\n<br>\r\nJake jerked his head to the left seeing a severe looking man with short cropped brown hair. He looked tall, dressed in a formal black suit, arms crossed behind his back. Jasmine too jerked as well at the man's entrance.<br>\r\n<br>\r\n\"Father! I did not expect you.\"<br>\r\n<br>\r\n\"Daughter. I hope you forgive me scrying you while you tended matters. This is a rather important situation after all.\" His severe expression melted slightly as he smiled at her. \"And I am glad to see you can handle yourself.\"<br>\r\n<br>\r\n\"He was a mere boy.\" She said, blushing slightly.<br>\r\n<br>\r\n\"True, but you have never been a fighter.\" He said, smiling warmly at her. Then his gaze got more serious and he turned back to Jake. \"Now, Jake, there is more you must be aware of. First my name is Drake, a powerful name among dragonkind and remembered by humans in your name for us. Both for Dragons and humans the age of eighteen is an important time. True humans thought less of it in ages past, but it has always meant a great deal to dragons. Your eighteenth birthday is coming in two weeks is it not?\" Jake nodded wordlessly. \"Good. It is our intention that, if you agree, your formal bonding with my daughter commence at that time. I should note she is not eighteen but twenty seven, but age is a little different for ourselves. Ages vary enormously depending on power of the dragon in question and vary from two hundred to several thousand years.\" A faint smile tinges his lips as his gaze fixes harder on Jake. \"Another benefit for yourself should you chose to join. My daughter inherits my power, despite her lack of experience in the arts, and likely you will live to a considerable age should you agree.\"<br>\r\n<br>\r\n\"Father!\" Jasmine says, a little put out. \"Bribery is no way to entice him to agree!\"<br>\r\n<br>\r\nHer father chuckled and shook his head.<br>\r\n<br>\r\n\"My daughter, some day you will need to learn such things. Governance is no place for being meek and you will inherit my place eventually.\"<br>\r\n<br>\r\nShe sighs, a little frustrated, and turns to Jake.<br>\r\n<br>\r\n\"I apologize for my father. Please, try to consider this for what it means for us... for me. I am asking you to join with me.\" She rolls her eyes. \"And as my father so kindly put it, when you turn eighteen the council will consider it time for you to formalize it.\" She blinks. \"Not that you have to wait to mate of course. I have been waiting a very long time for this moment and I understand the need.\" Her smiling face beams down at Jake.<br>\r\n<br>\r\nWait, is she saying...? Jake turns to look at her father who seems to still be smiling at the two of them. He notices Jake's odd look.<br>\r\n<br>\r\n\"Daughter. I do believe the humans do not talk of mating in public. You may need to be a little more circumspect in future.\"<br>\r\n<br>\r\n\"Oh... I... that explains all the suggestive phrases.\" She said, a thoughtful look. \"They have to talk about it without actually saying it? Hmmm. Odd.\"</span></div></div>",
            "created":1603051500,
            "id":2924117,
            "title":"Daddy explanations"
        },
        "1131231331":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "...into a seven foot tall, humanoid red dragon.",
                "...into a twenty foot tall European style red dragon.",
                "...into a fifty foot long Asian 'snake' style red dragon."
            ],
            "content":"<div class=\"\"><div> <span>Jake stares at Jasmine, the beautiful woman (dragoness?) smiling back peacefully.<br>\r\n<br>\r\n\"Wait, you... want to h... have sex with me?\" He squeaked, then realized he just said this in front of her father and looked nervously to his side, only for the 'man' to smile and nod.<br>\r\n<br>\r\n\"A necessity certainly, but hardly an onerous one is it Jake?\" He said with a chuckle. \"For you to begin your change you will have to mate with my daughter.\" He paused, a slight frown coming to his face. \"That will not be a problem for you will it?\"<br>\r\n<br>\r\n\"What?\" Jake turned back to Jasmine, who seemed remarkably calm through this. \"N... no. I... I just have never...\"<br>\r\n<br>\r\nHer smile perked up at that, her obviously amused.<br>\r\n<br>\r\n\"We are aware Jake. We have been following you these last seven years and know you have not laid with a woman. Will you let me remedy that situation?\"<br>\r\n<br>\r\n\"I... I.... yeah.\" Jake said, blushing intensely. \"O... of course would. I mean. I'd love to be your boyfriend Jasmine. I'd be honored if you could come back to my house with me.\" Turning to Drake he nods. \"You too... er... sir. I think I can miss a day from school. This is... important.\" At that last he thinks he sees a slight frown from Drake, but it fades.<br>\r\n<br>\r\nJake looks back between Drake and Jasmine, smiling. Then frowns.<br>\r\n<br>\r\n\"Um, but this isn't what you look like? I mean really look like?\"<br>\r\n<br>\r\nShe chuckles.<br>\r\n<br>\r\n\"No, it is not. This appearance I chose, but was facilitated by my father. I can control it, and this is, in part, a reflection of my true self, but it is not me.\" Her smile fades, leaving just the corners of her lips raised. \"Do you wish to see me as I truly am?\"<br>\r\n<br>\r\n\"I... yeah. I'd like that.\" Jake said with dry mouth.<br>\r\n<br>\r\n\"Very well. I should add that while we are together, at least to begin with, I will be staying as a human. I need to fit in to be with you until you are ready to travel to our realm. As I said that will likely take some time. None-the-less I am happy to wish to see my true form.\"<br>\r\n<br>\r\nShe smiles, then with a shrug her dress slips completely off her leaving her naked, just as muscles tense under her skin and she begins to shift. Jake gets a brief view of her naked human form before she begins to transform....</span></div></div>",
            "created":1603174800,
            "id":2925171,
            "title":"Skipping school."
        },
        "11312313311":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "\"I need you to promise to not tell anyone what I am for now.\"",
                "\"I need to mate with you. Will you be with me? Now?\"",
                "\"I need to know all I can about you. Please, enlighten me about your life.\""
            ],
            "content":"<div class=\"\"><div> <span>Her whole body literally ripples, and shifting can be seen under the skin, which seems... almost burned. Her soft pink tone shifts, darkening, almost turning black from head to foot, then a glow can be seen breaking through in cracks through it. There is a flaking, a tensing... then her head abruptly shoots up a foot, the cracked old skin shattering, showing a slender dragonic head on a long neck, a brilliant red tone coloring her completely. Moments later a similar expansion happens, her torso bursting from the blackened skin like a chrysalis, also a deep fiery red. She still is two legged and two arms... and two wings! Jake can see the huge red wings unfurling from her back as she stretches.<br>\r\n<br>\r\nShe looks almost like half way between those classic dragons of myth and a human, probably not much more than seven foot tall, standing on her hind legs, though the bending is reversed from a human's, like a dog's rear legs, her whole body shining in glittering red scales, but not entirely reptilian in visage. As Jake bends to see a curling tail whip out from behind her, he also looks up to see noticeable bumps on her chest. Er, isn't that a mammal thing? True, it's not quite like a human girl's chest but... odd. Odd but incredibly alluring.<br>\r\n<br>\r\n\"Wow.\" You mutter, and she smiles, her lips definitely still holding expression.<br>\r\n<br>\r\n\"I am glad you appreciate me in my true form Jake. It means a lot to me.\" She says, crouching a little and leaning in, smiling as her smoothly tapered snout comes close to him. She reaches out a long, bright red, three fingered hand to him, the long claws retracting away completely before she strokes him on the cheek. She's surprisingly soft skinned, though he can feel the scales on the back of her hand.<br>\r\n<br>\r\n\"You're beautiful Jasmine. Both this and your other form.\" He said, his eyes glistening. He'd never dreamed he'd meet a real dragon in the flesh, though he had to admit he'd always assumed they be, well, bigger. \"Um, I don't mean to insult you or anything, but... do all dragons look like you? I mean, our legends talk of huge dragons, hundreds of meters long.\"<br>\r\n<br>\r\nShe chuckled.<br>\r\n<br>\r\n\"I am not insulted, and no, not all dragons as as I am. I have never heard of any dragons quite that large, though I know of some black and green that are thirty feet or so long, more if you count the tail. There is a great variation in dragonkind Jake, and you will learn in time.\" She smiles at him warmly, an expression that should look strange on such a lizard face, but doesn't. Not at all. The warmth in her eyes shining through. \"As I understand you're people also have the phrase; 'Size is not everything,' yes? Now, Jake. I am glad that you have accepted me, and will happily travel with you to your abode. But there is something I must ask first.\"</span></div></div>",
            "created":1603661460,
            "id":2928803,
            "title":"Not too tall."
        },
        "1131231332":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Drake requests Jake attend the draconic council briefly before school.",
                "Jasmine escorts him to school, Drake heading back to the dragon realm.",
                "Jasmine escorts him to school, but is finding it hard to keep her hands off Jake"
            ],
            "content":"<div class=\"\"><div> <span>\"Um, this is... very sudden.\" Jake said, looking oddly between father and daughter. \"Do you mind if we date first?\"<br>\r\n<br>\r\n\"Date?\" Jasmine says, uncomprehending.<br>\r\n<br>\r\nHer father coughs.<br>\r\n<br>\r\n\"A semi-formal agreement to be close to one another without mating Daughter. At least mostly without mating from what I've seen. It is not dissimilar to some customs the Silvers have, though theirs is rather more stringent in rules than humans.\"<br>\r\n<br>\r\nShe blinks and stares down at herself.<br>\r\n<br>\r\n\"Am I not attractive enough?\" She says, frowning slightly.<br>\r\n<br>\r\n\"What?\" Jake says, shocked. \"God no! I mean yes, you are very attractive! I... just want to get to know you first.\"<br>\r\n<br>\r\nShe smiles.<br>\r\n<br>\r\n\"Oh I see. Very mature of you Jake. Understanding before amorous activities hmm? I can understand, if I admit to being a little... impatient. I have been waiting for seven years you know Jake!\"<br>\r\n<br>\r\n'Where were you when I was going through puberty!' Jake thought to himself desperately. He'd have gladly taken her back then, no questions asked. Now he is more acutely aware of the ramifications, especially with his mom's issues with boyfriends over the years. It's never gone well for her and he sympathizes too much perhaps.<br>\r\n<br>\r\n\"I... get it. And it's very flattering you see me like that Jasmine. At least let me get to know you a little first, OK?\"<br>\r\n<br>\r\nShe nods agreement with a soft smile.</span></div></div>",
            "created":1603052220,
            "id":2924121,
            "title":"Date first."
        },
        "11312313323":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Another bully starts making fun of her. Oh, wrong choice buddy!",
                "Tammy comes up, seemingly calmer than usual, though seems jealous of Jasmine.",
                "You get a few odd looks but things progress to first class: Biology."
            ],
            "content":"<div class=\"\"><div> <span>Jake stands up, a little shaky but OK, and licks his lips.<br>\r\n<br>\r\n\"Um, look I need to get going. I don't want to be late for school.\"<br>\r\n<br>\r\n\"Of course Jake, allow me to escort you. My father has arranged for me to be in as many of the same classes as you as possible. I... am sure I will learn a great deal.\" She says smiling<br>\r\n<br>\r\n\"Oh... cool.\" Jake says, not sure how to take that. Was her father magically messing with the school or was just him calling them and arranging her schedule? He decides not to ask. Kind of worried what the answer would be.<br>\r\n<br>\r\nJasmine smiles, straightens her rather pretty, flowery dress, and hooks an arm through Jake's.<br>\r\n<br>\r\n\"So, shall we venture to school?\" She says happily.<br>\r\n<br>\r\n\"Yeah.\" Jake manages, still a little freaked out by the thought that this girl is actually a dragon... and also her slightly odd mode of speech. Hopefully no-one at school makes fun of her for it. That likely would go badly for them!<br>\r\n<br>\r\n\"Take care daughter, and I remind you you have an appointment tomorrow with the council before you return to reside with Jake. If he desires you to stay with him that is?\"<br>\r\n<br>\r\n\"I... of course father.\" Jasmine says, Jake keeping his mouth shut. This is all way too much to take in all at once.<br>\r\n<br>\r\nThe two head out, arms locked together, as Jake shows the way to school from here. It's not far, just that he lives outside of town so it's a fair bit of walking (no buses in that region unfortunately). Only a ten minute walk, but it gets interesting. Mainly as Jasmine soon shifts her grip from looping through his arm to wrapping around his waist. Then a few minutes later sliding lower with her hand warmly cupping his bum! She's also getting as close to him as she can and still walk beside him easily.<br>\r\n<br>\r\nFeeling her warm body against him Jake is in heaven. True, he really doesn't know her, but she seems nice and... has an incredibly hot body! He blinks as he realizes it's not hers. Her real form is some kind of dragon. He can't really wrap his mind around that, but just knows that she looks very pretty now at least. And feels nice against him as well.<br>\r\n<br>\r\n\"Here we are.\" He says as they get to the outskirts of town and the school entrance is ahead. \"Hope you have a nice day Jasmine.\"<br>\r\n<br>\r\n\"Oh, I'm certain we will have a joyous day Jake!\" She says, and doesn't take the hint, still walking with him, her hand caressing his backside while they walk into the school gate.</span></div></div>",
            "created":1603056540,
            "id":2924160,
            "title":"Resistance is futile."
        },
        "113123133233":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "This was all new to Jasmine and she was fascinated.",
                "Dragons know some biology, but she sees human and dragon biology is different!",
                "Jasmine seems a little bored. They have science and magic, just no technology."
            ],
            "content":"<div class=\"\"><div> <span>Walking through the school yard a few other people look your way, either surprised at the new girl or surprised you have a girlfriend. And with her hand on your rump the whole time it's obvious she is to everyone. You also see Mal, another bully you've had dealings with (though no where near as consistent as Ted), eyeing you, but he lets it slide as he and some of his friends are standing around playing some form of cards. You have no idea what, but what ever it is it looks like he doesn't want to interrupt it before class.<br>\r\n<br>\r\nGetting to first class early you sit down, Jasmine managing to get a seat beside you, her smiling deeply at you.<br>\r\n<br>\r\n\"This is exciting!\" She whispers to you, her face split in a wide grin. \"I've never been around so many humans.\"<br>\r\n<br>\r\nYou blink at her.<br>\r\n<br>\r\n\"People. We don't call ourselves humans. Not normally anyway.\"<br>\r\n<br>\r\n\"Oh, I see. Understood Jake.\" She says, nodding seriously. Thankfully few other people are in class yet and no-one near enough to hear all that.<br>\r\n<br>\r\nThe others file in over the next ten minutes, and finally Mr Stanbridge the biology teacher. You've been in two minds about him. He seems nice enough, but does seem rather strict about time. You haven't exactly gone out of your way to get out of class or be late, but even you've been in detention once this year. Most of the class has one time or another. Plus Biology was not your favorite class. Of the sciences Physics was more your thing, though you weren't very good at it. At least you enjoyed it for the most part.<br>\r\n<br>\r\nThe lesson began going over rather boring details on ATP and energy interplay in the cells with very little hands on. Frankly you were fine with that. Biology was so messy!</span></div></div>",
            "created":1603170060,
            "id":2925141,
            "title":"Biology class."
        },
        "11313":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Jake replied back saying yes  (willing)",
                "Jake falls back into unconciousness, making Jasmine do it (unwillingly)"
            ],
            "content":"<div class=\"\"><div> <span>Ted started to punch Jake and manage to land 5 hits before a hand grabbed his arm preventing from hitting Jake anymore..  \"I think you hit him enough times young man\" Jasmine said.  Ted looked back at Jasmine \" And what are you going to do about it!\" he yelled.  \"Trust me you wouldn't want to know what I could do\" Jasmine said while here eyes started to have a red glow.  Ted let go of Jake and started to run away in fear although fails due to Jasmines hold on him.<br>\r\n<br>\r\nJasmine now putting her attention on Jake, examined him to ensure he was alright found out that his body has suffered injuries that can prove to be fatal if nothing is done about it.  Jasmine now decides to save his life by doing the one thing that could save his life..<br>\r\n<br>\r\nJake then regains conciousness. \"Jake, im sorry i didnt get here sooner\" Jasmine told Jake, Jakes vison was blurry he couldnt make out the face of the person talking to him...  jasmine Continues\" If you allow me I can save your life if you become my mate.\"  <br>\r\n<br>\r\nJake...</span></div></div>",
            "created":1287378000,
            "id":977463,
            "title":"Ted was able to get some shots on Jake, which b..."
        },
        "113131":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Say \"Introduce her to jasmine and Drake. She's bound to see them anyway.\"",
                "Jake says \"I won't tell her, keep it a secret.\""
            ],
            "content":"<div class=\"\"><div> <span>Ted just sneers at Jasmine \"You expect me to be the witness at this marriage? Forget it. As far as I'm concerned, he won't last long before your wedding.\"<br>\r\nTed begins to overpower Jasmine's hold. Jake yells \"Yes! please save me!\" Ted breaks Jasmine's hold as his get his arm free \"Too late! Eat this dweeb!\" Ted's fist hits Jake's stomech but with an audible CLANG! Ted's expression suddenly turns to pain as he covered his fist \"AHHHH!!! THAT HURTS! THAT REALLY HURTS!\" Ted checked his hands and sees that his knuckles are completly bruised. Jake completly puzzled on what just happened, pulled up his shirt and sees that his upper body is covered with gold scales, dragon scales. \"What? How did that happen?\"<br>\r\nA voice says \"Quite simple, you chose to be my daughter's mate.\"  Looking around Jake sees an image of a huge dragon in the sky, Ted sees it too and runs away in panic. The dragon continues saying \"Once a human agrees to be a dragon's mate. He or she is protected from all harm.\" Jasmane says \"it's the only way to save your life Jake. She helps him up. \"Why did you chose me?\" The dragon says \"Oh where are my manners? My name is Drake and this is my daughter Jasmine.\" Jake says \"Mine name is..\" Drake says \"We know, Jake.\" Jake says \"Why me?\" Mike rushed in \"Glad to see you Jake, I just saw Ted. He ran the other way in a panic and his fist looked like it hit a brick wall.\" Mike looks up \"What the? Am I seeing thngs or is that a dragon?\" Drake says \"Hello human, as for your question Jake, do you recall 7 years ago? You risked your life saving a girl from an incoming car, that girl is my daughter, Jasmine. I saved your life that day and somehow she fell in love with you.\" Jake says \"Just like the dream I've been having.\" Jasmine smiles \"Think of it as destiny.\" Mike looks at Jasmine in disbalief, \"She's the one in your dream? Whoa, this is wierd. I never expect to see dragons. What would your mother say when you tell her that your a dragon's mate?\"</span></div></div>",
            "created":1294981200,
            "id":1035629,
            "title":"Jake replied back saying yes  (willing)"
        },
        "1131311":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Samantha Faints due to the surprise",
                "Samantha takes it well"
            ],
            "content":"<div class=\"\"><div> <span>Jake smiled then replied\" I'm going to have to tell my mom, if I were to keep this a secret she would be mad.\"  Jasmine said\" You sure Jake, things are just starting out so no need to rush things, after all we got 2 years  before we need to make this mating official.\"  Jake looked at Jasmine and said\" no, I need to do this, last time i kept something important from my mom i ended up grounded for a month, and that wasnt fun, my mom does not like secrets\", Jake looked down and then continued\" It was a secret that broke up my mom and my dad...  it was devastating to her..  the thought of him cheating on her with another woman was just too much for her\"  <br>\r\n\tJasmine said\"I'm so sorry Jake, you dont have to worry about that with us... Dragons mate for life, sure we may have our disagreements  but we are always willing to work them out as long as it takes\"  Jake replied back \" Thats good to hear..\"  Jake and Jasmine continued down the road towards his house with drake and mike following behind them....  <br>\r\n \tTwenty five minutes later they arrive at Jakes house.  Before Jake opens the door he turns around and tells Jasmine and Drake to wait, so he can talk to his mom alone for a while, then motions mike to come in due to the fact mike will be staying over for a few days because his parents were out of town..  Jake said \" Mom, I'm home, can you come down for a bit i need to talk to you about something important.\"  Then Jake asks mike to wait at the door so he can let jasmine and drake in when its time.\"<br>\r\n\tSamantha replies \" Sure Honey..\" as she was walking down the stairs from the top floor..  then continued.. \" Whats the matter?\"  Jakes motions her to sit down knowing she may not exactly take it well or end up fainting..  Samantha looking at Jakes Face noticing some scratches that jake got during the altercation with Ted and said\"  You didnt get into a fight again with that bully did you?\" Jake nodded and replied\" Yea, but its not as bad as you might think... something you must know is my life was saved today.\"  Jake paused noticing the look of worry on his mothers face.  Jake then continued there are 2 people outside that you must meet..\" Jake then turns to Mike and asks him to let them in.<br>\r\n\tMike opens the door then motions Jasmine and drake to enter the house.  Samantha looked as a female and a male walked into the house.  then joined both Samantha and Jake in the living room.  Jake then said\" Mom, i'd like you to meet Jasmine and Drake Jasmines father\"  Samantha looked at Jasmine and Drake and ask \" Hello, how do you know my son?\"<br>\r\n\tDrake said\" It's kind of a long story but In short your son Jake, risked his very life 7 years ago, to save my daughter, ever since then Jake have been the only person jasmine was thinking about all her life\"  Sam with the look of shock replied back \"How? i would of known about such event if that were to happen.\"  Jasmine repiled \" There is a reason for that,, for everyone protection and for the fact that Jake was still to young at the time to undertake the new responsibility his life will lead we changed his memory and only had him remember a simple chat with a girl\"  Samantha then looked at Jake and asked\" What does this mean Jake?\"<br>\r\n\tJake gulped and then replied\" To put things simply, Jasmine and Drake are what you would call Dragons. and due to events in the past and the present I am to become Jasmines mate.\"  <br>\r\n<br>\r\nSamantha looks stunned and then....</span></div></div>",
            "created":1306558800,
            "id":1114787,
            "title":"Say \"Introduce her to jasmine and Drake. Sh..."
        },
        "11313112":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "decides to Stay for dinner",
                "Thanks Samantha for the offer but declines"
            ],
            "content":"<div class=\"\"><div> <span>Samantha says\" but you barly know each other.\"  Jake replied\" I know, but to me it seems i known her my entire life...  and if it wasnt for her i would of died 7 years ago.\"  Samantha said \" well if you sure about this, then I suppose i should welcome you Jasmine to the family.\"  Jasmine smiles then replies\" I am happy to hear that, but there is something you must know about Jake.\"  Samantha asks\"What is it.\"   Jasmine continued\" As part of the mating process Jake will become a Dragon himself..  We do not exactly know how long this process will take as it differs depending on the person it is done to, but when the time comes he will experience a forced transformation into a dragon.\"  Samantha looks at Jake and asks \" Is this true?\"  Jake responded \"Yes, right now any transformations are only instinctual.. .\"  Jasmine said\"  At times when needed to protect him from harm dragon scales will form in the area being affected protecting him from harm...\" <br>\r\n<br>\r\n  Jasmine then said\" Which brings us to our second reason of being here.\"  Samantha looked at Jasmine as Jasmine continued\" It is our tradition in this matter that I will have to live with him for 2 years while this mating takes place...  for that i am offering to rent out the room you have available for rent, it would give me a chance to get to know you and all of his other family members, not only that will allow me to give Jake the necessary guidance for the changes yet to come...\"  Samantha replied back\" By all means you can have the room, but You dont need to pay, its the least I can do\"  Drake replied back\" I'm afraid i must insist, i dont want any preferential treatment towards Jasmine because she is to be mated with your son, after all Jasmine needs this as a learning experience too as she needs to learn to live as a human just as much as Jake will need to learn to live as a Dragon. That goes with any responsibilities that a human may have in this society\" Drake paused and then continued\" Money is no object, we will supply funds to pay for the room for as long as it is deemed necessary, for the 2 years after which both Jake and Jasmine will move out into their own place, that will be provided to them by the Dragon Council.\"<br>\r\n<br>\r\n  Samantha sat thinking and then said\"Ok well i guess everythins settled then.. \" Drake then stands up and starts to head for the door... and said\" Well I best be off, Jasmine will be living with you starting from today,  I well send over more of her things as soon as i get the chance... but she has enought for now to start with..  \" Samantha said\" Drake, I'm about ready to serve supper, your more then welcome to stay for dinner...\"<br>\r\n<br>\r\nDrake...</span></div></div>",
            "created":1312779600,
            "id":1164244,
            "title":"Samantha takes it well"
        },
        "113131122":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "The next Morning",
                "Jasmine wakes Jake in the middle of the night"
            ],
            "content":"<div class=\"\"><div> <span> Drake replied \" Thanks for the offer but I must be off, there are still a number of things that needs to be taken care of that cannot wait any longer\", drake paused, then continued\" Maybe ill take you up on that offer at a later time if time permits.\"  Drake then looks at Jake and says \"Jake i now leave my daughter in your hands, I trust that you will teach her what it means to live like a human, as she will teach you how to be a dragon when the time comes...\" Drake then looks at Jasmine and gives her a hug and says \" Take care Jasmine..  I will see you soon.\" Drake then starts to open the door , then stops... Turns around looking at Jake again and says\" Oh, one last thing the Dragon council will expect to meet you sometime in the next couple months, you can choose the time so make sure you learn how to ride a dragon as for humans that is the only way into the dragon realm\" Then drake waves good bye for one last time and then starts heading out..<br>\r\n<br>\r\nSamantha Jake, and Jasmine now proceeded to the dining room to start eating the lasagna that samantha had made. Samantha asked Jasmine\" So, do you like the lasagna?\"  Jasmine replied\" Yes, it is very delicious...  first time i had this\"  After Everyone was finished eating Jake started to help clean up after supper..  Jasmine asked\" Would you like some help?\"  Jake replied\"No, you just got here you should relax for your fist day here..\"  When Jake Finished he yawned and then said well im going to go off to bed after all its school tomorrow\" As Jake started to go up the stairs Jasmine started to follow saying \"I will be going to bed also\"  <br>\r\n<br>\r\nWhen Jake got to the top floor he showed Jasmine the room she will be staying in, as well where the bathroom is, then went to his room to sleep.</span></div></div>",
            "created":1312866000,
            "id":1165019,
            "title":"Thanks Samantha for the offer but declines"
        },
        "1131311222":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "time for school"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine was restless in the next room, often turning over a number of times just to try to get to sleep...  mainly due to the fact she was excited. Jasmine got up to the bed and started to walk towards Jake's bedroom..  Jasmine then knocks lightly on the door, then says \"Jake, Can I come in?\"   She waied for a while, then turned around  to go back to her room thinking Jake must of been still sleeping however as soon as she started walking Jake replied\" Sure, come in\"<br>\r\n<br>\r\nJasmine opened the door seeing jake lying on the bed looking in her direction. Jake was kind of surprised of what Jasmine was wearing, it was a red lace night gown that was partially see through, u can easily tell she was not wearing a bra or even panties underneath, As Jasmine entered the room she closed the door behind her, then looks at Jake and says \"You know Jake ever since we met for the second time, i had the deisre to do something that i always wanted to do..\"  She slowly starts to take off her gown revealing her now naked body..  Jake looked at Jasmine and thought to himself, Wow,  To Jake Jasmine seemed to be perfect in every way her skin was a perfect complection, her breasts were decent sized, not small but at the same time not to big... Jake replied\" What is that?\"  Jasmine blushed as she started to climb on top of the bed then repled\" To make love, silly.\" Jasmine now positioned over Jake.  Jasmine started to giggle seeing that Jakes, face now seems to blush..  Jasmine then started to kiss Jake on the lips while she started to remove the pajamas that Jake had on, At first Jake was surprised at the kiss but he started to kiss back, As soon as Jasmine removed the last piece of clothing off of Jake, they started to have sex...  Which seemd to last for 15 mintures until Jasmine had a orgasm. After they stopped Jasmine now positioned her self to be lieing beside Jake and stared into Jakes eyes and asked\" Was that good?\"  Jake looking back at Jasmine smiled and replied\" Yea, that was definatly something\"  after that both Jake and Jasmine drifted off to sleep.</span></div></div>",
            "created":1312952400,
            "id":1165701,
            "title":"Jasmine wakes Jake in the middle of the night"
        },
        "11313112221":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Jake wakes up finding Jasmine is still asleep beside him Jake also noticing one of her arms are positioned over him as if she was hugging Jake. Jake using his free arm lightly lifted jasmines arm off him and started to sit up while at the same time lowering Jasines arm back on the bed..  Jake looked at the alarm clock on the dresser noting that it was 7:30 in the morning realizing he needs to get going to school he decided to get his clothes on and quickly freshen up in the bathroom.  After getting downstairs he grabs a lunch bag that was already waiting for him, which was made by his mother.. and headed out the door to go to school.<br>\r\n<br>\r\nOn the way to school he bumped into mike who already left ahead of him.  Jake yelled\" hey mike why didnt you wake me up..\"  Mike replied\" Sorry Jake, i had to leave early i forgot something at my home that i needed to pick up.. \"  Mike then said\" You know Tammy is returning back to school today after 1 month being in the hospital?\"  jake replied\" oh<br>\r\ngreat now i have to deal with her teasing now too..\"   As Mike and Jake arrived at school, Jake looked around and already noticed Tammy on top of the stairs and seemed to be looking for someone. Jake didnt want to take any chances and decided to keep out of Tammy's view and managed to slip past her as he entered the school...<br>\r\n<br>\r\nAt lunch time Jake and Mike headed out to the hall way and got their lunches from their lockers... as they started towards the cafeteria Tammy appeared from around the corner right in front of Jake.. as Jake tried to avoid her Tammy grabbed Jakes arm and said\" Jake, we need to talk..\" Jake looked at Tammy as she looked at him with a sad look as if she done something wrong.  To Jakes knowledge Tammy never looked at him in this way ever, it was always a mean look, or laughing at him. But this look was definatly a first.  Jake replied\" Ok, what is it.\" Tammy looked at mike then looed back\" Can this be in private please...\" Jake looked at mike and then back at Tammy,\" Well Ok.\"  Tammy then looked at mike and said \"Don't worry about him, Im not planning on hurting him\" with that Tammy started to lead Jake to the chearleading office set up for the chearleaders to have their discussions and planning.   \"Jake, I feel I have something to get off my chest...  First off im sorry for the way I treated you ever since the beginning of high school.\" Tammy said while still heading down the hall, she then stopped at the door to the office. She then said\"Ever since my accident it left me alot of time to think about my life, and everytime i did i started to think about you..  I got to the point where i couldnt imagine my life without you in it.\" Jake looked at Tammy and replied\" What are you tring to say?\"  Tammy responed\" I think i am....\"  Before Tammy was able to finish a commotion started in the hall way..  As Jake and Tammy turned around in the direction it was coming from a girl came into view...  Jake had a look of surprise as Jake recognized the girl to be Jasmine, Jasmine was heading towards Jake, Tammy looking back at Jake asking\" Do you know her?\"  Before Jake was able to reply Jasmine grabbed Jake by the shoulders and kissed Jake on the lips...</span></div></div>",
            "created":1313355000,
            "id":1168044,
            "title":"time for school"
        },
        "113131122211":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "After school",
                "Phys Ed"
            ],
            "content":"<div class=\"\"><div> <span>\"Jasmine, why are you doing here?\"  Jake asked.  Jasmine replied\"Im sorry I guess i should of told you this... as of right now im also a student of this school\"  Tammy interupted asking\" How do you know Jake?\"  Jasmine looked at Tammy and responded\" I am Jake's fi....\" Jake nudged Jasmine causing her to stop. Jake said \"She's my girlfriend\" then looked at Tammy and continued\" Can I have a monent alone with Jasmine?\"  Tammy reluctantly nodded and said \"Ok, ill continue this discussion later.\" Tammy then turned around and headed off to class.   \"Jasmine, i think it would be best not to let anyone here know we are to be mates.\" Jasmine looked at Jake and replied\" Ok, if you say so..\"  Jake said\" As far as they know you are my girlfriend and i am your boyfriend, I just dont think they would be ready to know what we really are to each other at least not yet.\" Jasmine and Jake started to head to the next class.. Jake asked\" I'm going to guess that you got yourself in the same classes i am taking?\"  Jasmine responded \"Yep, except for physed we are taking the same classes..\"<br>\r\n<br>\r\nAs Jake and Jasmine reached the door of the next class which was chemistry, Jake can already see mike was already there along with Tammy in the back corner which unfortunatly for mike was his assigned lab partner for the course.. Jake didnt have a lab partner so he knew that Jasmine would end up being his partner for the course.  Jake opened up the door and entered the classroom,  as he did everyone looked towards the door noticing the female from earlier following Jake into the room. She then handed a note to the teacher letting him know of her late addition to the class..  Mike noticed Tammys reaction to the girl.  Tammy was looking at her with suspicion.  In her mind she already determined that there was something fishy about her.. and how could Jake which was pretty much a loner up to this point suddenly have a girlfriend.  After all the teasing she done in the past made it next to impossible for him to get a girlfriend... and every time a girl started showing interest in him Tammy told the girl exactly what was needed to change her mind about him.. It was then that Tammy decided to herself that she will find exactly who this Jasmine is and try to get her separated from Jake so she can take Jake as her boyfriend.</span></div></div>",
            "created":1315174740,
            "id":1181073,
            "title":"continue"
        },
        "1131311222112":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "He accepts the offer",
                "He declines the offer"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAfter chemistry Jake said to Jasmine \" Well see you after school...\" Jasmine replied\" Yea, just wait for me ok, there is some things we need to do before we head home.\" Jasmine then bent over and gave Jake a kiss on the cheek.  Then went to her last class of the day.  Jake and Mike then went to get ready for phys ed.  Jake and mike was always the first 2 who entered the mens change room.  As Jake removed his shirt Mike noticed some patches of dragon scales on his back..  Mike said\"Woah,  you might want to get your shirt on fast, i doubt you want people to see that.\"  Jake looked at mike then looked at the mirror behind him, seeing the scales very visible.  But after a few seconds freaked out by the sight they seemed to vanish in good time too as other students started to enter the change room..  Jake and mike quickly finished changing and then went towards the gym.<br>\r\n<br>\r\nMr. Johnston was already in the Gym waiting for everyone to be ready to start, .  As soon as everyone was in the Gym Mr, Johnston said\" Well class what we are going to do today will be playing a game of baseball, but not just any game of baseball, you will be playing against our last years championship team.\"  Mike sighed and said quietly to Jake\"Oh great looks like Mr, Johnston is looking to recruit for this years team\"   Jake was kinda excited though baseball was his favourite sport and he kinda does want to take a shot of making the team  but he knew personally he wasnt any good at it and most likely be laughed at for trying so he never did.<br>\r\nMr. Johnston then continued\" It will only be a 4 inning match and those who does well against the other team would be offered a chance to be a part of this years team, and i have invited Tammy and her chearleading squad to cheer you guys on\"<br>\r\n<br>\r\nAs the game started it was pretty much boring, the other team already scoring 3 runs in the first half of the inning, when it was your turn up to batin the last inning you noticed Jasmine now sitting in the stands at the back of the field.  Tammy was also looking at Jake.  The other cheerleaders were mocking him knowing full well he would strike out... especially now when it would end the game as it was the last out and bases loaded...  still behind by 3, it all depended on him...the pitcher made the first pitch,,  Strike 1 ,  the pitcher made the second pitch...  Strike 2..  Jasmine spoke to Jake telepathically \"Jake, just focus you can do it.\"  Jake nodded, as the pitcher made the 3rd pitch  everything around jake seemed to slow down, he didnt notice but his eyes has changed to be like a dragon, Jake began to swing the bat with more strength that he ever had and hit the ball hard to the outfield.. as soon as he finished swinging everything went back to normal as he now seeing everyone looking at where the ball is going..  and it was high...  the ball was hit with enough force that not only it went past the wall in the back of the field it was high enough to actually hit one of the light posts that was a few feet away from the back...Everyone was surprised even Tammy, for someone who was known not to be good in sports just won the game..  Which was a first,  as Mr. Johnston every year always arranges a game with the previous years championship team to play a game with his students.. and this was the first time the championship team lost..<br>\r\n<br>\r\nJust as Jake headed off back to the changeroom to get his normal clothes back on Mr. Johnston asked to see him in his office.  Mr. Johnston said\" Well after 10 years running this class I have never seen anything close to what you have done today.\"  Jake said\" I know\"  Mr. Johnston continuted\" Well im going to get to the point...  I want you to consider trying out for this years baseball team... if your perofrmance in todays game is any indication you will do very well in the team, infact ill write you in for the tryouts next weekend, dont worry if you dont want to just dont show up and i wont hold it against you.. \"  <br>\r\n<br>\r\nJake said \"ive already decided.....\"</span></div></div>",
            "created":1320626700,
            "id":1219150,
            "title":"Phys Ed"
        },
        "11313112221121":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Follow them in.. following the same path they taken",
                "Follow them in.. and ended up getting lost for 10 minutes"
            ],
            "content":"<div class=\"\"><div> <span>\" I will come to the tryouts this comming weekend\".  Mr. Johnston replied \"Great, well ill see you then\" Jake then left the office to get ready to go home.  As Jake was walking down the hall towards his locker he felt that someone was following him.\tJake looked around to see if he can see anyone but didnt notice anyone...  and then continued towards his locker. As soon as he reached his lokcer he opened it up and grabbed his bag and put the books he needed in order to do his homework for the nigh and then left towards the front entrance of the school..<br>\r\n\tTammy was not that far behind she was intending to follow him and jasmine to try to see what jasmine was really, everything about jasmine seemd to be off with tammy and she was determined to find out what it is..  As Jake exited the school he noticed Jasmine and Mike waiting for him at the top of the stairs..  Jasmine and Mike both asked at the same time. \"What did Mr. Johnston want?\"  Jake replied\" he wants me to come to tryouts next weekend..\"  Mike said\" Thats great\" Jasmine agreed also, but jake couldnt help but notice a concerned look on her face.Jake asked Jasmine \"Whats wrong?\"  Jasmine replied\" Oh nothing, just be careful, you will find that you will be able to do stuff that you were not able to do before, and well quite frankly could give you an unfair advantage if you dont learn to control it.\"<br>\r\nAs Jasmine Mike and Jake walked by the edge of the forest Jasmine stopped and then said \"Here we are.\"  Jake and Mike turned around and Jake asked\" You mean this forest?\" Jasmine nodded yes and then Jake replied\" But this forest is haunted and cursed... anyone who enters there always ends up lost and then turns up 10 minutes later back where they started.  Jamine giggled and then said\" Thats because they dont know the correct path to walk to get to the other side let alone a clearing in the middle of it... as you see I have decided to teach both of you how to ride a dragon right now.  Mike asked \"why me?\" Jasmine looked at Mike anbd replied \"I have been in contact with the dragon council and they expressed interest into meeting you also.. \"  Then both Jake and Mike looked at each other then decided to follow Jasmine into the forest, who was showing them the correct way to go...<br>\r\nAs mike being the last to go into the forest Tammy walked up to the edge of the forest and decided to.....</span></div></div>",
            "created":1323739620,
            "id":1238824,
            "title":"He accepts the offer"
        },
        "113131122211211":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "fainting",
                "standing up making the group notice her"
            ],
            "content":"<div class=\"\"><div> <span>\tTammy started following the group into  the forest, while keeping far enough distance to ensure they dont discover that they are being followed.\tHowever Jasmine knew, but knows nothing can come from it, as it was on a rare occasion where a human did stumble on the correct path to get to the clearing in the middle, but such instances it was dealt with immediatly, the dragon who spots him tends to ask him some questions of the current state of human society, and after they will clear their mind of the experience and send them back on their way into the forest with the human not remembering except for entering the forest in the first place.<br>\r\n\tAfter 10 minutes entering the forest Jasmine, Jake and Mike emerged and walked into the clearing,   they were amazed what they saw there were statues of dragons, and even statues of humans riding dragons, with a what seems to be the bottom of a cliff on the northern edge of the clearing... which in the middle was a cave entrance..  Jasmine pointed towards the entrance and said \" There lies the portal into the dragons realm\" With that they see another human emerge from the cave entrance heading towards them...<br>\r\n\tTammy just arriving at the edge of the clearing watched in awe as she was looking at the statues.. which bared a striking resemblance to the images that was drawn in her fathers journal.  Tammy's father was a explorer, and had quite an interest in dragons, even though dragons were no longer around as they once were there was evidence of their existance found in remote areas of the world..  Tammy even had a interest in them... hell she even has some dragon plushies at home.  Tammy then looked down noticing where Jake, Mike and Jasmine was and also noticed a person heading towards them, she then quietly as poosible moved to the base of the statue that was closest to them without getting noticed...  <br>\r\n\t\"Mike, Id like to introduce you to Samara, She is my closest friend and she will serve as your dragon for as long as you wish\", Jasimine said, Mike responed \"My dragon?\" . Jasmine smiled then replied\"Yes, much like being mated dragons choose only one human to be allowed to ride them. by becoming a rider you will also be gifted with some abilities, you will gain a telepathic link to samara, and with training you will also be able to cast magic if you so wish\" Mike responded back\" But i wouldnt be mated with her right?\"  Jasmine replied back \"Yes, you would not be considered mated with her, well unless you wish to be, as you see just because you become her rider doesnt mean that option is closed to you.. if the time comes that you do wish to be mated with her all you have to do is ask. As you should know the only reason why a dragon would choose a human, especially one of the opposite sex is that they do have a interest in becoming your mate. And trust me, Samara isnt easy to impress alot of men approached her tried and failed.\" Mike noticed Samara was blushing a little.  Jake said\"Men, you have humans living with you in the dragon realm\"  Jasmine looked at Jake and Replied\"Yes, we do,  when we put ourselves into self imposed exile, some humans who believed in the alliance with the dragons chose to come with us. To this day there are still human colonies living in the dragon realm, but thats enough with that its time to get to what we are here to do, to teach you 2 how to ride a dragon...\" Jasmine and samara now distanced themselves from Jake and Mike and started to transform...  Tammy looked in awe of what became of Jasmine and samara which ended up with her .....</span></div></div>",
            "created":1332111720,
            "id":1297494,
            "title":"Follow them in.. following the same path they t..."
        },
        "1131312":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Drake tells Jake and Mike about the prophecy",
                "Jake being tired asks Drake to continue this at a later time"
            ],
            "content":"<div class=\"\"><div> <span>  Jake said\" I won't tell her, I think for now its best to keep it a secret.\"  Drake looked at Jake  and said\" Are you sure? she will eventually need to find out as right now your body is already changing.\"  Jake asked \"Changing?\"  Drake replied back \"You are becoming part dragon, those scales are just a small portion of those changes yet to come...\"  Drake paused looking at Jake then said\" When the changes are finished you will be able to change your form to either a full dragon or a mixed form(human but with features of a dragon) or stay as you are now... however the first time change to a dragon will be a forced one...  and there is no knowing when that will happen...\"<br>\r\n<br>\r\n  Jake then said\" Well if thats the case I will keep it a secret for now, but well i feel she still needs to know something..\"  Drake then looked back at him \" Well you could introduce her to your mother as a normal human girl until you feel its time that she needs to know the truth\"  Drake then continued\" As you see this mating with a human is a long process, and it is our tradition for the dragon to reside with the mate for 2 years in the human form before the mating is made official\"  Jake then looked at Jasmine and asked \" Would that be okay with you Jasmine?\"  Jasmine nodded.  Jake then looks back at Drake and asks \" But what do we do about her having to reside with me?\"   Drake replied back \" Correct me if im wrong but isn't your mom looking to rent out the extra room in your house?\"  Jake replied\" Oh yea, I suppose that would work.but..\"  Drake interupted\" there is nothing to worry about, we will give jasmine the necessary funds to keep paying your mom to rent out the room if that is what your worried about.\"  <br>\r\n<br>\r\nDrake now turning his attention towards mike..  then said\" Mike, you being Jakes best friend due to this expect your life to change,\"   Mike replied back \"What would i be forced into being mated to a dragon?\"  Drake laughed then replied\" No, well not unless you want to.. im sure there are other female dragons out there that will take up your offer should you desire it.\" Drake paused then continued\"  Mike because of your status with Jake you are already considered a friend amoungst all dragons,  many dragons will fight to protect you if you ever need it, and you will be offered come the right time to become a dragon rider.\" Mike than said \" Wow, im honored..\"  Drake replied \"and so you should, most humans would have to prove their worth to become a dragon rider, while you get an open invitation to become one should the time come to require it\"<br>\r\n<br>\r\nDrake then looked down then looked back at Jake and said with a more serious tone..\"Jake and Mike, I feel i need to be honest with you a little bit..  its partly due to why this is all happening now.\"  <br>\r\n---------------------------------------------------------------------------- -----------------------------<br>\r\nAN:   Ill let you decide if drake talks about the prophecy of what will eventually happen,  but keep in mind whatever the prophecy is it wont happen for quite some time...  regardless of your choice i want Jake's life with Jasmine to be sort of peaceful aside from the problems Ted may cause from time to time</span></div></div>",
            "created":1299387600,
            "id":1065981,
            "title":"keep it a secret"
        },
        "1132":{
            "author_id":"xdarkrevex",
            "author_name":"Dark Reve",
            "choices":[
                "The car crash... she forgot to give him the false memory.",
                "He remembered Jake's chat with her. (in the false memory)",
                "He forgot completely... just that she seems attractive..."
            ],
            "content":"<div class=\"\"><div> <span>The principle comes out of his office to notice that Ted is chasing Jake. He goes in front of them, “What is going on here?” he says. Ted points at Jake, “This thief just stole my iPod!” Jake snares at him, “No I didn’t! You just wanted to beat me up!”<br>\r\n<br>\r\nThe funny thing is, Jake has an iPod in the left pocket of his backpack. It’s Jake’s iPod, but he never really brings it to school. Ted however, always brings his iPod to school. This is something the principle has known ever since Jake and Ted attended this school.<br>\r\n<br>\r\n“Give me back my iPod!”<br>\r\n“This is my iPod!”<br>\r\n“Give it back to me you liar!”<br>\r\n“I’m not lying! This really is my iPod!”<br>\r\n<br>\r\nBasically, that argument went on for two minutes, then when the principle was about to stop it, Mike comes in and stops the argument. “Ted… this is Jake’s iPod. Now shut up and leave him alone.” Ted isn’t giving up, “But that IS my iPod! I was looking all over for it! And now I know that he stole it from me! Give me my iPod you thief!”<br>\r\n<br>\r\nMike sighs, and he says smoothly, “Geez, you just won’t give it up will you? C’mon Jake, we ought to get to class.” Jake and mike leave the scene, while ted continues to complain about his false witness of the iPod.<br>\r\n<br>\r\nMike looks at Jake… with a surprised look. “Wow Jake!” he says, “no bruises this time? This is a first! Usually when I see you with Ted, there’s not a single spot on you that isn’t bruised!”<br>\r\n<br>\r\nJake laughs, “Well, let’s just say… I dodged for once. More like three times! It took me until now to realize that I shouldn’t let them beat me up anymore. You know, I should’ve thrown a few punches myself! I now feel like I’m no longer a weakling! From now on, it’s no more Mr. Wimpy guy!”<br>\r\n<br>\r\nMike smiles, “Well I’m glad you’re improving Jake. You know how I’m always telling you to stand up for yourself, and today’s the day you actually did. I’m proud of you.”<br>\r\n<br>\r\nWhen school was over, Jake and Mike were both walking out of there… until Jasmine caught Mike’s eye…<br>\r\n<br>\r\nBut what seems so interesting about Jasmine that made Mike notice her?</span></div></div>",
            "created":1287464400,
            "id":977902,
            "title":"The iPod..."
        },
        "11322":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Mike Decides to come along",
                "Mike Can't come due to having to go home right away"
            ],
            "content":"<div class=\"\"><div> <span> Mike looking at Jasmine said\" Hey Jake, isn't that the girl you talked,to 7 years ago?\"  Jake now looking in the direction Mike was pointing.  Jake replied\" yea, I beleive so\"  Jasmine was looking straight at Jake walking towards them..<br>\r\n<br>\r\n\"Jake? Is that you?\" Jamine asked.  Jake,replied shyly \"Y...Y...Yes\"  Jasmine giggled \" Don't need to be so shy.\"  Mike said \" Jake always been like that, girls rarly ever talk to him thanks to some nasty rumors some bullies spread about him\"  Jamine looking at Mike \" That's terrible, Well Jake you don't have to worry about anything like  that from me, as I have no issues talking with you.\" Jasmne looking at Jake now said\" Jake, I would very much like it if you come with me, We need to talk\"  Jake now looking at Jasmine an replied\" Sure why not, can Mike come too.\"   Jasmine looks at Mike and replied\" If he wants to come along he can\"<br>\r\n<br>\r\nJake looks at Mike and asks\" Do you want to come along?\"  Mike replies...........<br>\r\n<br>\r\n<br>\r\nChoices..<br>\r\n<br>\r\n1. Mike decides to come along (Note: from this point forward he will be made aware of Jakes new role in life)<br>\r\n2. Mike can't come due to having to go home right away (Note: He will be unaware of Jakes new role Unless Jake lets him know later on)</span></div></div>",
            "created":1287896400,
            "id":980540,
            "title":"He remembered Jake's chat with her. (in the..."
        },
        "113221":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "\"Yes, I will become your mate\"",
                "\"Things are going too fast, can I have some time to consider it\""
            ],
            "content":"<div class=\"\"><div> <span> \"Sure i'll come along\" mike replied.  Then Jasmine Jake and Mike started to walk down the street.  \"So where are we going?\" Jake asked...  Jasmine looked at Jake\" We are going to my home.\"  Jasmine replied.   \"Tell me Jake, What is your opinion about dragons?\"  Jake looked at Jasmine with a puzzled look then looked at Mike for a second, then replied \" I think dragons are cool,  I always enjoyed reading stories about them.\"  Jasmine now smiling at Jake and asked \"What would you say if I said that dragons were real?\"  Jake looking at Jasmine again with a puzzled look then replied\" I suppose I would say cool, however dragons arnt real its just part of fantasy\"  <br>\r\n<br>\r\nMike said\" Jake, why dont you tell her about the dreams you been having\"  Jake looked at Mike then back at Jasmine and said \" Well i dreamt of dragons quite often in the past couple years..  I suppose that it got me interested in dragons.\"  When they turned the corner and headed towards the park..  Jasmine said\" We are almost there\"  As the entered the park which was well known for its cliffs,  Jasmine headed towards a chain link barrier that had a do not enter unsafe passage sign posted on it and then opened it.  Jasmine then looked at Jake and Mike and beckoned them to follow..  Mike and Jake looked at each other. then said \" But the barrier said not to enter.\"Jasmine replied\"Don't worry about that, it was fake really, as you see my family is sort of eccentric and prefers to keep their privacy, they bought the park and set a portion of the park where they can have their privacy. while keeping the remainder of the park open to the public\" After a short walk in a passage that was between to cliff faces it opened up to a yard with what seems to be a house built right into the cliff face at the other end of the yard..  <br>\r\n<br>\r\nThen Jasmine looked at Jake \" I want to show you something, but whatever I show you don't be afraid ok?\"  Jasmine said...   Jake replied \"Ok\" Jamsine then looked at Mike and asked\" Ok? mike\"  Mike nodded.   With that Jasmine started to walk towards the center of the yard then turned back to face Jake and Mike.   Jasmine then started to transform into her dragon form.   Jake and mike looked at each other with shock then back at Jasmine who is now a huge red dragon looking back at them...   But at the same time they were not scared at all, shocked yes but for some reason they didnt feel that there were in danger in any way..<br>\r\n<br>\r\nJasmine then looked at Jake and said\" Jake, as you see I am a dragon, and as you should know your dreams you been having was a side effect of the link we shared for the past 7 years\"  Jake asked with a puzzled look \" A link?\"  Jasmine replied\" Yes, to be honest our chance encounter 7 years ago didnt happen as you remember it.\"  With that she uttered a few words causing Jake to remember everything that happened 7 years ago.    Jake now remembering everything said \" Wow, I suppose I owe you my life\"<br>\r\n\"Jake, ever since that day I fell in love with you, and the whole main reason for this meeting is that I want to ask you if you want to become my mate.\"<br>\r\n<br>\r\nJake now looking at Jasmine surprised then replies......</span></div></div>",
            "created":1287982800,
            "id":981188,
            "title":"The offer..."
        },
        "1132211":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "Choice 1",
                "Choice 2"
            ],
            "content":"<div class=\"\"><div> <span> Jake said \" Yes, I will become your mate\"  Mike looking at Jake with a surprised look on his face and asked \"Are you sure you want to mate with a dragon?\"  Jake looked at Mike and Said, \"Yes I'm sure, it just feels right to me..\"  Jasmine now excited after hearing the words se wanted to hear for so long, transformed back ito her human form, then approached Mike.<br>\r\n<br>\r\nJasmine said \"Mike, I can tell you are a very good friend to Jake, and therefore makes you my friend and a friend to the other dragons who live here, But I must ask a favour from you.\"<br>\r\nMike looked at Jasmine and said \"What, you want me to become another dragons mate?\"  Jasmine giggled and replied\" No not quite like that, although if thats what you wish there are some other dragons present who would also like to take a human as a mate..\"  \"Well what is it?\" Jake asked...   Jasmine relpied \" It i to my knowledge that your parents is out of town for the next 2 weeks and you will be all alone for 2 weeks right?\"  Mike replied\" Yes\"  , Jasmine continued\" The favour I want to ask you is that I need you to take Jake's place for the next 2 weeks while Jake stays here with me to prepare for the mating.\"  Mike replied\" Sure, but how i don't look like him nor sound like him.\"  Jasmine replied \" Don't worry about that, I can cast a spell that will temporarily make you look and sound like Jake for 2 weeks..\"  Mike replied\" Ok , do it,  but I would like something in return later\"  Jasmine looked at Mike and said \"Of course there are many other honours a dragon can bestow on a human, but we can talk about that later\"  Jasmine now closed her eyes and uttered a few words that Jake or Mike cannot unerstand and then a cloud of smoke surrounded Mike then dissipated revealing Mike which now looks like Jake.  Jasmine said\" It is done now... but for now you must leave Mike, as this is now a private matter between me and Jake,\"  Jasmine gives Mike a jewel..  then says\" Come back here in 2 weeks with this jewel, this jewel will grant you passage back into this area.. ok\"  Mike nods then heads back the way he came..<br>\r\n<br>\r\nJasmine now motions Jake to take her hand as she now heads to enter the house.... and then takes him to her room.  <br>\r\n<br>\r\nJasmine then said\"  First in order for a human to mate with a dragon you must first become a dragon, keep in mind even though you can change your mind about mating with me once you become a dragon you will always be a dragon.. what is one cannot be undone, Are you sure you want to do this?\"   Jake looked at Jasmine and said\" I'm sure\"<br>\r\n<br>\r\nJasmine smiled and then decides to .....<br>\r\n<br>\r\nchoice 1:   \"Thank\" Jake for his brave act 7 years ago before taking him through the process to turn him into a dragon.<br>\r\n<br>\r\nchoice 2: Takes him directly to a huge room big enough for a dragon in order to turn him into a dragon</span></div></div>",
            "created":1288069200,
            "id":981745,
            "title":"\"Yes, I will become your mate\""
        }
    },
    "info":{
        "author_id":"tkmaster",
        "author_name":"Teus",
        "brief_description":"A human holds the key to a new alliance between humans and dragons.",
        "created":1287430380,
        "description":"<td align=\"left\" class=\"norm\">A long time ago humans used to fight along side dragons against a great evil, And now with the threat of it returning to the world, A dragon sets out to find a human male to mate with to bring about a new dragon-human alliance.<br>\r\n<br>\r\n<i><u><b>Characters:</b></u></i><br>\r\n<b><u>Jake</u></b>: A human male age 17,  Only has 1 friend in high school, Often picked on by bullies, always tries to defend other people even though most attempts end up in him getting beat up. And always teased about the strange dreams he has.<br>\r\n<br>\r\n<u><b>Mike</b></u>: Jake's only friend age 18 , often saves him from being beat up by the bullies, <br>\r\n<br>\r\n<u><b>Jasmine</b></u> A female Red Dragon princess, very kind, Stong believer in a prophecy that fortells a new alliance between humans and dragons, and believes she will be the one to find the human... and as with all dragons  she can take a human form <br>\r\n<br>\r\n<b><u>Ted</u></b>  A school bully who always picks on Jake<br>\r\n<br>\r\n<b><u>Tammy</u></b>  The schools head cheerleader, always picked on Jake, however due to a accident that nearly ended her life she realized that she has feelings for Jake, and is determined to make Jake her Boyfriend regardless of how futile it may be<br>\r\n<u><i><b>Rules:</b></i></u><br>\r\n<br>\r\n1.  No killing of main characters(although can be brought close to death), new characters can be introduced and killed off as necessary<br>\r\n2. No One line chapters, Each chapter must at least contain a paragraph, I will permit a chapter merely for giving more choices provided you choose 1 of the choices yourself.. <br>\r\n3. When the time comes for the mating it can be either willing or unwilling but if its unwilling it must be done in effort to save the persons life.. the process either willing or unwilling will end up giving josh the ability to transform into a dragon form at will<br>\r\n4. Mike can either know about jake's new role in the world or be unaware of it..<br>\r\n5. Story progression must be logical, for example, if a character at the end of the chapter decided to take a ride on a bus home, the next chapter should reflect that he was on the bus, <br>\r\n6. and have fun :)<br>\r\n<br>\r\nI should also note that for the sake of the story the mating wont happen till after  a couple chapters,  and the first chapter will be in the past<br>\r\n<br>\r\nI will randomly reward 150 points for good additions...<br>\r\n<br>\r\n</td>",
        "id":1717450,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603661460,
        "modified":1603661460,
        "pretty_title":"Becoming a Dragon"
    }
}