{
    "chapters":{
        "1":{
            "author_id":"bigrich1",
            "author_name":"Bigrich",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female??</span></div></span></div>",
            "created":1409547600,
            "id":1850296,
            "title":"Gender"
        },
        "11":{
            "author_id":"bigrich1",
            "author_name":"Bigrich",
            "choices":[
                "Jump into the mothers purse",
                "Grab ahold of the little girls shoe lace",
                "Hop onto the female employees shoe",
                "Hop on the mexican womans sandal"
            ],
            "content":"<div class=\"\"><div> <span>You are a male shopping for some goods in the electronics section. As you grab what you need, you start to feel dizzy and hit the floor.....<br>\r\n<br>\r\nWhen you awake,  you see everything is much larger than before! It then dawns onto you that you have shrunk. In fact you have shrunk really small. At least ant sized! Suddenly, a whole horde of people approach the aisle you are in! Random people and even an employee! You gasp and take cover beneath the rack in hopes of avoiding being crushed! Just then, a woman sets her purse down and begins to argue a bit with her bratty 5 year old daughter in an attempt to avoid buying her that boy band CD she'd never let her children listen to. Also, you notice a female employee organizing the racks. She looks 25 and has curly brown hair and is thin. There is also some random hispanic/mexican female in her early 30's checking out some of the CD's as well. What do you do first?</span></div></div>",
            "created":1409547600,
            "id":1850299,
            "title":"Male"
        },
        "111":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "continue...",
                "different ...",
                "different..."
            ],
            "content":"<div class=\"\"><div> <span>You decided it would be, some what of a good idea to hop into the mothers purse. For all you know she was harmless enough.<br>\r\nYou look around before making a move as her purse was not that close but close enough to consider it an option.<br>\r\nTo the right end of the aisle was the employee on the left side was the Hispanic woman.<br>\r\n<br>\r\nYou then decide to sprint for the purse and with luck you made it.<br>\r\nInside of the purse it was very dark, you couldn't see a thing and that's when the purse finally began ascending as the mother of whom looked to be in her mid twenty's with dark brown long silk hair, sparkling hazel eyes what to you looked like C cup sized breasts and a perky ass. The mother wore a pink pencil mini-skirt dress and a denim jacket. She was also wearing red heels.<br>\r\n<br>\r\nIt seemed to you that at least half an hour had gone before the mother and her five year old daughter finally left the store 'Tesco' and began their journey home in the family car.<br>\r\n<br>\r\nOnce they had arrived back at the house, the purse was set down on the kitchen counter and the mother proceeded to the down stairs bathroom to make herself a nice warm and relaxing bath, to release the stress that she had gained doing her shopping.<br>\r\n<br>\r\nThe mother turned on the hot tap and put the plug in place, before walking back out of the bathroom to search for an item in her purse.<br>\r\n<br>\r\nShe began to search but as she did she felt some thing odd in her purse. She took the object out of her purse and was shocked at what she had found.<br>\r\nThe object looked to be around 1-2 inches and resembled that of a full grown human male.</span></div></div>",
            "created":1441861200,
            "id":2032613,
            "title":"The single mum."
        },
        "1111":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Ask about the bath.",
                "Ask about her children.",
                "Ask about sleeping places and house rules."
            ],
            "content":"<div class=\"\"><div> <span> Now in the hand of this mother you decided that to not be mistaken for a toy from the shop that her daughter had put in the purse so she could have it, you spoke to the mother to explain what you remember and see what she can do.<br>\r\n<br>\r\n\"Hi um this may all seem a bit overwhelming and all but some who at the shops I was shrunken down and was in the electrics aisle when you put down your purse. And so I climbed in your purse to seek help. Now I know you may not be able to do much to help but if you can at all it would be appreciated.\" You explained to the mother who was so shocked that she believed that her b<br>\r\neing stressed out is causing her to see thing, however the mother decided to go along with the situation.<br>\r\n<br>\r\n\"Well tiny guy my name is Laura, Laura Catabell. And yes I may not be able to help you become normal sized again, but you can stay here if you like. Oh and don't worry about having to confront the 'man of the house' as I am single and so I own this house and as you must of saw I have a daughter, Lily who is five but is six next week, and I have another daughter Sophie who is 15.<br>\r\nSo whats your name? I mean you don't want to have to be called tiny or little man for the rest of your life do you?\" Laura questioned.<br>\r\n\"No of course not my name is Jamie Gunn</span></div></div>",
            "created":1441861200,
            "id":2032641,
            "title":"Mother meets tiny."
        },
        "11111":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "You can put me on the counter.",
                "You can put me in your back pocket (the only pockets she had.)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Um, don't you have that bath running Laura?\" You questioned but reminded Laura.<br>\r\n\"Oh dear, um where should I put you? Um?\"Laura started panicking and so you said.</span></div></span></div>",
            "created":1442120400,
            "id":2033810,
            "title":"Ask about the bath."
        },
        "111111":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Well\"",
                "\"What, What do you mean?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Do you really think that is a good idea with my five year old in the house? No I think I should put you in my purse, that way you will be safe and hidden.\" Laura said as she grabbed her purse took out her phone and put you back into the purse. When Laura came back half an hour later  she got you from the purse and  headed to her bedroom. <br>\r\n\"So what should I do with you?\" Laura raises an eyebrow as she questions you.<br>\r\n</span></div></div>",
            "created":1442120400,
            "id":2033813,
            "title":"You can put me on the counter."
        },
        "1111111":{
            "author_id":"cakepan",
            "author_name":"nathan",
            "choices":[
                "ass ",
                "pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well it has been pretty lonely since my husband left me, and you,re the perfect size to go inside me.<br>\r\nOkay I will let you choose, you could go into my ass or you could go in my pussy, you choose.</span></div></span></div>",
            "created":1545282000,
            "id":2591438,
            "title":"\"Well\""
        },
        "11111112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Ass sweaty",
                "Sweaty shoe"
            ],
            "content":"<div class=\"\"><div> <span>So you say, I'd love your pussy, but ...<br>\r\nI think you'd better help me get back to normal. And it can be dangerous too.<br>\r\n<br>\r\nLaura says: What's the problem? Are you going to tell me that you do not feel like it? and another, I do not know how to make you big again.<br>\r\n<br>\r\nYou insist: fine! Take me to my house then!<br>\r\n<br>\r\nLaura does not like the way you talk.<br>\r\nYou are being very ungrateful little man.<br>\r\n<br>\r\nOf punishment, you will go inside my</span></div></div>",
            "created":1555909200,
            "id":2648548,
            "title":"pussy"
        },
        "111112":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Yes I still want to go back there and I...",
                "\"Ok maybe you can put me on the rim of the bath?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"My back pocket? Are you sure? I mean it will be tight in there and truthfully it may get gassy back there I have been holding it in since the shopping trip, and I will try not to fart on you. Well unless you want me to, hehe...\"</span></div></span></div>",
            "created":1442120400,
            "id":2033819,
            "title":"You can put me in your back pocket."
        },
        "1111121":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Do want you to fart on me.\"",
                "do not want you to fart on me.\""
            ],
            "content":"<div class=\"\"><div> <span>(This is where you decide whether or not to go down the path of giantess farts, burps, etc. Laura and Sophie will be the main ones to do this Lily will however not be until she becomes 15 at which she will sometime down the story line which ever way you go.)<br>\r\n<br>\r\n\"Yes I still want to go back there and I... do/ do not want you to fart on me.</span></div></div>",
            "created":1442120400,
            "id":2034101,
            "title":"\"Yes I still want to go back there and I..."
        },
        "11111211":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Yes!\"",
                "\"I don't want to spoil anything.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You? You want me to fart on you?\"Laura asked compleatly shocked.<br>\r\n\"Yes\"You reply getting more exited by the minute.<br>\r\n\"Wow, no ones ever wanted to do that before. Well do you want a sneek peak of whats to come?\"Laura offered.</span></div></div>",
            "created":1442206800,
            "id":2034433,
            "title":"Larua's gassy."
        },
        "111112112":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Go in your pocket.\"",
                "Go head first into your ass hole.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Is that the case well I now give you a choice feel it and inhale it from my back pocket or, inhale and feel it with your head to waist in my hole, your choice. Whats it going to be?\" Laura asked you while she groped her ass. In the end you told her. \"I would like to....</span></div></div>",
            "created":1442206800,
            "id":2034512,
            "title":"\"I don't want to spoil anything.\""
        },
        "1111121122":{
            "author_id":"gamersloth",
            "author_name":"Slothman",
            "choices":[
                "She farts",
                "She forgets about you and goes to eat at taco bell"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She pulls her panties and shoves you in her ass which is covered in shit. she pulls her thong back up which shoves you next to her anus.</span></div></span></div>",
            "created":1559538000,
            "id":2668617,
            "title":"Go head first into your ass hole.\""
        },
        "11112":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"So What about you then?\"",
                "\"Can we go and see Lily then?\""
            ],
            "content":"<div class=\"\"><div> <span>\"So what are you children like? And what would happen if one of them saw and got a hold of me?\" You asked.<br>\r\n\"Well I don't know what Sophie would do if she found you, but Lily would most likely play with you like a toy.<br>\r\nLily as you have seen has blond hair made into a pony tail and has blue eyes.<br>\r\nSophie has fiery red hair with green eyes. Neither of my girls are over weight but Sophie has got a slightly big rear. Sophie wont be back till later and Lily is in her room.\"<br>\r\n</span></div></div>",
            "created":1442120400,
            "id":2033824,
            "title":"Ask about her children."
        },
        "111121":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "in her ass.",
                "in her bra."
            ],
            "content":"<div class=\"\"><div> <span>\"Well like I said my name is Laura, I work as a waitress at Popys cafe. I am genaraly a nice person. So I have a bath running and so you are coming with me, for me to protect you.\"<br>\r\nLaura picked you up and took a moment to think and decided to put you...</span></div></div>",
            "created":1442120400,
            "id":2033956,
            "title":"\"So What about you then?\""
        },
        "1111211":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "sliding toward the front of her nickers.",
                "being sucked into Laura's rear hole."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"This may not be the nicest of places but you will be safe.\" Laura said as she slid you in the back of her nickers before walking into the bathroom to finish making her bath. Meanwhile you were...</span></div></span></div>",
            "created":1442120400,
            "id":2034096,
            "title":"in her ass."
        },
        "11112111":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Laura continues to get undressed ",
                "Someone comes in/ Calls Laura out. "
            ],
            "content":"<div class=\"\"><div> <span>With the constant movements being created by Laura, you slowly started to slide towards the front side of Laura's nickers, the closer you got, the more hot you felt, not because of the sight and an idea of what's to come. The reason behind that is due to the sheer heat generated from Laura's sweet moist pussy. Laura could feel you slowly moving. However, she decided not to stop you or move you to the back of her panties once more. Laura was close to finishing up with her bath. Making sure it was the right temperature, Laura turned off the tap's and proceeded to take off her clothes starting with her top. </span></div></div>",
            "created":1460005200,
            "id":2129268,
            "title":"sliding toward the front of her nickers."
        },
        "1111212":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Laura starts to clean you.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Laura took you and put you inside her bra and walked into the bathroom and locked the door got undressed and picked you up and placed you on a tray that floats on water and proceeds to get in the tub and places you and the tray on the water, so now all you see is bubbles all around you and a huge face infront of you that belongs to Laura.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1582174800,
            "id":2789976,
            "title":"in her bra."
        },
        "11112122":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Laura keeps her promise?",
                "Laura goes back on her promise?"
            ],
            "content":"<div class=\"\"><div> <span>Laura asks You \"How did you get so tiny?\" You explain everything up till now. Laura says \"Well do you have a family that you want me to bring you to?\" You reply \"No im the only one left.... They are all dead..... remember that car crash a few months ago that oiled 12 people and 1 person survived then went missing?\" She replies \"Ya... wait that's you?!\" You reply \"ya.... Im the survivor that went missing... I have no-one. Do you think you can help me find someone that can return me to normal? Ik 1 person who lives on 3rd ave if you don't mind.\" Laura says \"Sure i will bring you and I live on 3rd ave after this bath we will go outside and you tell me if we are on the currect 3rd ave ok?\" You say \" Ok! Thank you!\" Laura smiles and starts to wash you and clean you up then places you on a wash cloth on the counter and washes herself and dries off and then dries you off. You get dressed as Laura does. <br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582174800,
            "id":2789979,
            "title":"Something else."
        },
        "111121221":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "You go talk to the lady to fix you.",
                "You decide to live tiny and stay with Laura."
            ],
            "content":"<div class=\"\"><div> <span>Laura takes you and walks outside and she asks you if this is the currect street and you look around and say \"yes\" Laura asks \"what way to go to find this person?\" You tell her the address and she walks to it. When you arrive there you tell Laura \"hold on a few, I want to think this over 1 more time b4 we go any further.\" Laura says \"ok\"<br>\r\n<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582174800,
            "id":2789984,
            "title":"Laura keeps her promise?"
        },
        "11113":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Sophie\"",
                "\"Lily\""
            ],
            "content":"<div class=\"\"><div> <span>\"So have you got any house rules that I should follow?\" You asked.<br>\r\n\"Well normally its pay rent, do some chores but seeming that your size may muck that up instead it will be either have Sophie use you for what she wants or become Lily's play doll.</span></div></div>",
            "created":1442293200,
            "id":2034943,
            "title":"Ask about sleeping places and house rules."
        },
        "111131":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Gross.\"",
                "sexy.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Very well but for now I have a bath running and you are coming in it.\" Laura stated before taking you into the bathroom and placing you on the side of the bath and then turned off the tap and stripped before then getting into the bath. <br>\r\n\"Can you swim?\" Laura asked with a wink as she teased you by rubbing her breasts and then making her way down to her pussy and rested her fingers on top of it.<br>\r\n\"Yes.\" you replied, Laura motioned for you to jump in and you did after taking off your clothes. <br>\r\n\"Right now swim to the side of my head.\" Laura demanded and so you did. when you came to the side of her head she said<br>\r\n\"Now climb up.\"<br>\r\nYou once again did as you was asked.<br>\r\nOnce you made it onto her face she told you to go down to her chin and lean over her sweet pink lips. Hesitant, you continued as she asked and then she parted her lips slightly and burped.<br>\r\n\"He he... How was that?\"<br>\r\n\"Honestly that was...</span></div></div>",
            "created":1442293200,
            "id":2034948,
            "title":"\"Sophie\""
        },
        "1111312":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Yes...",
                "No..."
            ],
            "content":"<div class=\"\"><div> <span>Later when you and Laura get out of the bath, Sophie finally arrives home and Laura explains to Sophie about you.<br>\r\nSophie takes you into her room and places you on her bed. You look up to see Sophie stripping into just her bra and panties, once she had stripped she slowly lowered her ass towards you.<br>\r\n\"So I heard that you liked my mums burps, well I wonder what your opinion of my farts are.\" And with that she sat down on your tiny little body, positioned your face right under her ass hole and farted. <br>\r\nSophie sat there for a little while afterwards before finally asking, \"So did you like my fart? And did you like my ass too?\"</span></div></div>",
            "created":1447304400,
            "id":2060494,
            "title":"sexy.\""
        },
        "11113121":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "Shuffle into the oppening or...",
                "Wait for Sophie to play her card's"
            ],
            "content":"<div class=\"\"><div> <span>Sophie:<br>\r\n<a rel=\"nofollow\" href=\"http://www.deviantart.com/art/Redhead-Girl-Ballpoint-Pen-310870595\" target=\"_blank\">http://www.deviantart.com/art/Redhead-Gi...</a><br>\r\n<br>\r\n\"I enjoyed that quite a bit. Although I would like to see what else you have in store. \"<br>\r\n<br>\r\nThat's when Sophie thought up an Idea, she stood up off you, picked you up and pushed you up her nostril while covering the other nostril before proceeding to sniff you up with concentrated force. <br>\r\nGradually you got deeper and deeper into the girls nose and just before you reached the opening to the rest of the body Sophie rested and you were stuck, trapped there waiting for her next move. The only possible move you could make is to shuffle through the opening that you had been stopped before. <br>\r\n<br>\r\nSo what do you do? </span></div></div>",
            "created":1460264400,
            "id":2131028,
            "title":"Yes..."
        },
        "111131211":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Let nature take its course",
                "She throws you up. "
            ],
            "content":"<div class=\"\"><div> <span>Covered in snot, you could barely make out a clear path ahead of you, and decided to take it to see where it leads. You make your way towards it, but suddenly Sophie inhales. You are pushed inward, abd find yourself slidin down a slimy, gross tube of flesh.  Suddenly Sophie began to cough, and you were assualted by air pushing past you as you seemed to be stuck.  You frantically wiggle around when you suddenly seem to be lodged free of wherever you are... <br>\r\nAnd heard a loud <i>glurk!</i> You had been swallowed!  Immediately the muscles of Sophie's throat push you deeper into her gullet, until you find yourself in a fleshy, dark prison with slimy weinkled walls. It smelled strongly of vomit and the slime was starting to make your skin itch.  </span></div></div>",
            "created":1492405200,
            "id":2306717,
            "title":"Choking Hazard"
        },
        "111131212":{
            "choices":[
                "Break free",
                "Stat put (toilet time)"
            ],
            "content":"<div class=\"\"><div> <span>You try to move but are covered in the red heads snot. Then all light is blocked as she puts some sort of cloth up to her nose. You realise what she i planing and brace yourself for whats to come.<br>\r\n“Achoo!!” Sophie sneezes with so much force that, if not for the fabric, would if killed you. \"How was that little man?” She asks; lust full in her voice.<br>\r\n“Fucking A sophie!” You cry out. Looking around, you relise you are on a piece of toilet paper, stuck by her thick snot whichmeant moving anything but your head and neck was impossible.<br>\r\n<br>\r\n“Well seeing as you are on toilet paper. I think i will use you for its intended purpose\" sophie says walking towards her door<br>\r\n<br>\r\nSo reader, do you try to break free of sophies snotty embrace or get better aquatinted with her ass hole and toilet?</span></div></div>",
            "created":1460782800,
            "id":2134203,
            "title":"Wait for Sophie to play her card's"
        },
        "1111312121":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "not very far",
                "to the door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How far do you make it before being caught </span></div></span></div>",
            "created":1460869200,
            "id":2134676,
            "title":"Break free"
        },
        "11113121211":{
            "author_id":"diesel01",
            "author_name":"Diesel01",
            "choices":[
                "Panties",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You don't make it far before Sophie noticed that you not there anymore. Once she sees you she grabs you and.....</span></div></span></div>",
            "created":1479358800,
            "id":2238251,
            "title":"not very far"
        },
        "111131212111":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "At the rear",
                "In the front"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sophie picks you up and says, you bad boy, you'll have to pay, you'll spend all day in my panties. You scream: Noo !! forgive me!!<br>\r\nNo excuses, it's settled, you go for my panties, but where is better<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1480050000,
            "id":2241791,
            "title":"Panties"
        },
        "1111312121112":{
            "author_id":"brentford",
            "author_name":"Reg man",
            "choices":[
                "Lesbian friend amy ",
                "Younger sister pixy",
                "Delivery of some sex toys"
            ],
            "content":"<div class=\"\"><div> <span>She pulls open her elastic panties, the strong smell of her pussy greats your nostrils.<br>\r\n<br>\r\nHave fun down there she says with an evil grin, I certainly will. She let's go leaving gravity to complete her deed, <br>\r\n<br>\r\nYou land head first sliding straight into her tight pink lips, just before she starts to mastabate she here's<br>\r\nA knock at the door it is here__</span></div></div>",
            "created":1553403600,
            "id":2634298,
            "title":"In the front"
        },
        "11113121211121":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "two fingers get you",
                "A tongue licks you. Amy starts sucking Sophie"
            ],
            "content":"<div class=\"\"><div> <span>Sophie's lesbian friend had arrived.<br>\r\nHer name was Amy, she was very naughty.<br>\r\nThey kissed each other on the cheek, and began to talk.<br>\r\n<br>\r\nYou were smashed in Sophie's pussy, the heat and the smell was intense<br>\r\n<br>\r\nSophie tells Amy about you.<br>\r\n<br>\r\nAt this time, Sophie's panties go down.<br>\r\nYou were stuck in Sophie's pussy,<br>\r\nsuddenly</span></div></div>",
            "created":1555909200,
            "id":2648490,
            "title":"Lesbian friend amy "
        },
        "111131212111211":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "They use you as a sex toy?",
                "Next option."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you feel two fingers grab you and pull you out of Sophie's pussy Sophie brings you up to her face lays you flat on the palm of her hand and shows you to Amy. Amy says OMG HE'S SOO CUTE! Sophie do you think we can have some fun together? Just the 3 of us? Sophie replies Sure that's what I was hoping you would ask.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582088400,
            "id":2789912,
            "title":"two fingers get you"
        },
        "1111312122":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Ass",
                "Pussy"
            ],
            "content":"<div class=\"\"><div> <span>As much as you tried to break free, Sophie's snot held you fast to the bleached paper. Each thundering step brought you closer to the bathroom, where you knew a very unpleasant fate awaited you. She locked the bathroom door behind her and sat down on the pot after pulling her pants down. She placed you on her bare leg face down, and the toilet paper blocked out most of the light. But you clearly heard the sound of urine splashing into the water below, followed by a distinct trumpetting as she passed wind. It stank up the bathroom quickly and you couldn't help but cough. The smell got progressively worse, though, as you heard the wet plop of shit hitting the water, followed by another wet fart. After a few moments its stopped. Your toilet paper was lifted as she said, \"alright, time to do your job as toilet paper,\" as she used you to wipe her...</span></div></div>",
            "created":1491800400,
            "id":2302576,
            "title":"This Stinks!"
        },
        "11113121221":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Manage to hold on",
                "Lost your grip!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, thanks for helping clean up tiny guy!\" Is the last thing you hear as Sophie brings you around towards her crack.  You grimace as you see bits of crap hanging around her crack as you are brought closer, closer, and pushed right into a blob of shit!  You gag in utter disgust, but thankfully the flesh is soft enough here that the pressure doesn't outright crush you as she wipes back and forth. You notice your loosening up from her snot, and desperately grab onto a small ass hair as you are rubbed against her dirty flesh.  As you do, she starts to pull the toilet paper away, getting ready to discard it.  Can you hold on to the hair?  </span></div></div>",
            "created":1491800400,
            "id":2302595,
            "title":"Smeared"
        },
        "111131212211":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "You were crushed along with the shit. Unconscious of you trapped in the butt",
                "You were stuck in the ass. Sophie returns to work"
            ],
            "content":"<div class=\"\"><div> <span>Yes, you can hold your butt hair full of shit, stinking a lot. As soon as Sophie takes the paper off, her buttocks close, squeezing and kneading him. Sophie looks at the paper, full of pieces of shit, all erased. Sophie kneads the paper and throws it in the trash. Sophie imagined</span></div></div>",
            "created":1491973200,
            "id":2303824,
            "title":"Manage to hold on"
        },
        "1111312122111":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Scratch the itch.",
                "Pull out what was causing her to itch."
            ],
            "content":"<div class=\"\"><div> <span>When Sophie tossed the toilet paper into the water of the toilet, she had assumed that the tiny man who had been stuck to it was no more. She pulled down the handle and her waste swirled around as it swirled into the sewers. \"So much for that little guy.  But I bet he enjoyed going out that way, heh!\"  She stood up and pulled up her pants as she walked out of the bathroom. <br>\r\n<br>\r\nYou were not sure how to feel about this situation. Granted, you kind of had a kink for gross situations, but even you had limits. Getting farted or burped on was on a whole different level from what you were experiencin now. You were currently squeezed between her buttocks, smeared in foul-smelling feces. Clearly she wasn't very good at cleaning herself.  You were trapped in her by Sophie's tight panties, and ground by the powerful muscles on either side of you with each step she took. It was totally dark as you tried to wiggle your way out of there, not knowing that you were heading deeper into her crack until your hand made contact with the slimey, wrinkled hpuckdr that is her asshole. As if to affirm your suspicions on what it was, the picker shifted, and a blast of hot, putrid air erupted from it, causing you to cough and gag.  <br>\r\n<br>\r\nMeanwhile, Sophie stopped walking when she felt somethin tickling and irritating the sensitive skin of her tail hole.  She headed back into her room and shut the door behind her. Pulling back her pants and panties, she reached a finger towards her crack to... </span></div></div>",
            "created":1492232400,
            "id":2305379,
            "title":"Just a Memory... and an Itch"
        },
        "11113121221111":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You die in there",
                "You manage to survive and escape. "
            ],
            "content":"<div class=\"\"><div> <span>Sophie felt a wierd, tingling feeling against her asshole, not knowing it was in fact the struggles of the man she thought she had killed. Reaching back, her hand slipped down into her panties, and she reached a finger between her butt cheeks. <br>\r\n<br>\r\nYou were experiencing a living Hell between her cheeks. This was perhaps the grossest you have ever felt!  Suddenly you froze as you heard a squelching sound. Was she going to pull you out?  Your hopes for savin were dashed as a giant finger pushed against you and started to rub back and forth. As it did, you felt your body get smushed deeper and deeper into the puckered, slimy hole behind you. You managed to cry out a final time before getting pushed fully inside Sophie's asshole. The tight, hot walls pushed on you from all sides, making it nearly impossible for you to so much as wiggle around. </span></div></div>",
            "created":1494046800,
            "id":2315733,
            "title":"Itchy"
        },
        "111131212211111":{
            "author_id":"cmalfonso",
            "author_name":"cmalfonso",
            "content":"<div class=\"\"><div> <span>Your breaths grow shorter and more strained as you run out of air in this girl's colon. No matter how hard you attempt to wiggle free, you were stuck for the rest of your short lifespan. The last thing you hear is \"Oh, there's another one coming!\" Before the girl farts one more time. That was the last thing you ever smelled before you perish in your smelly tomb.</span></div></div>",
            "created":1500181200,
            "id":2354612,
            "title":"A Smelly Tomb"
        },
        "111131212211112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Look at the panties, she realizes you",
                "Throw the panties in the laundry basket or trash"
            ],
            "content":"<div class=\"\"><div> <span>Without oxygen you were hopeless. Suddenly a hot, stinking gust of wind, a strong, wet fart throws you out of your ass, making you soaked in your panties. Sophie feels the fart coming out with shit and says: I think I got blown away, ahahah. I'll clean it up later. After hours the fart with shit dried up and you were stuck in the panties. The night sophie is going to take a shower, she takes off her clothes and her panties. She then</span></div></div>",
            "created":1501218000,
            "id":2360749,
            "title":"You manage to survive and escape. "
        },
        "1111312122111122":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "The condincation from the hot water lossen up the shit around u letting u go",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Sophie finaly gets home she goes directly into the bathroom to take a shower she take off her pants and sets them next to the sink and removes her panties that are now shit stained she looms at it for a minute. You think she notices you and you think your saved, but you no sooner finish your thought Sophie takes her panties and aims for the laundry basket but misses her panties (and you) land on the floor behind it. Sophie says I think it went in. But I don't care if it did or not. As she finished taking off her shirt and bra and socks and put them with her pants next to the sink. Sophie then starts the hot water and gets in the shower.<br>\r\n<br>\r\nWhats next?</span></div></div>",
            "created":1582088400,
            "id":2789925,
            "title":"Throw the panties in the laundry basket/on the flo"
        },
        "11113121221111221":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "You wait till Sophie leaves the bathroom.",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>The condication from the hot water of Sophie's shower is lossening up the dried shit around you allowing you to escape. You get off her panties fully and hide in a crack in the wall, completely hidden from all view even close up view.<br>\r\n<br>\r\nWhats next?</span></div></div>",
            "created":1582088400,
            "id":2789927,
            "title":"The condincation from the hot water freeing you."
        },
        "111131212211112211":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "You leave the bathroom?",
                "You keep waiting in the bathroom?"
            ],
            "content":"<div class=\"\"><div> <span>After about an hour you hear the water turn off and see Sophie getting out of the shower. She walks over to the laundry basket and looks behind it and sees her panties and picks them up and puts them inside the basket and closes the lid. You think that if you couldn't get off in time that you could be traped inside that basket with no light or air until it gets moved to the washer then you could drown in there. You suddenly snap out of your thoughts of what might have happened cuz Sophie finished getting dressed and was leaving the bathroom as her mother Laura walks in right away and locks the door behind her she pulls out her phone and says \"Yes this is Mary, right now everyone including my kids think my name is Laura.... yes my mission is going well there was something that happened today walmart but I felt with it... its a tiny person I found I have him to my daughter to use for what ever she told me she killed him and flushed him with her shit.... ok.... understood... I will talk to you soon... bye.\" With that done the mother you thought was Laura is really Mary, leaves the bathroom and shuts off the light.<br>\r\n<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582174800,
            "id":2789949,
            "title":"You wait till Sophie leaves the bathroom."
        },
        "11113121221112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Clench your fingers, crush it and end suffering",
                "Have other plans, maybe swallow or go back to the butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sophie tightens the itch and pulls to find out. Coming close to her face, Sophie watches the shriveled girl shriveled up with a smile, then sophie</span></div></span></div>",
            "created":1492405200,
            "id":2306380,
            "title":"Pull out what was causing her to itch."
        },
        "111131212211122":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Eats you",
                "Up her butt"
            ],
            "content":"<div class=\"\"><div> <span>As Sophie's face came into focus, you saw her wicked smile.   Hey, you survived!  I thought you had died in my butt!\"  She held her nose, \"ugh, you smell awful though!  I should clean you up before I do anything else... unless, did you like it in my butt?\"  Too tired to even shake your head, you tried to answer, but only managed to wheeze. \"Oh you did, huh?  Well I guess I could put you back...\" as she said that, you heard her stomach growl. </span></div></div>",
            "created":1492405200,
            "id":2306497,
            "title":"Sophie's Choice"
        },
        "1111312122111222":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "She fart",
                "She sits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Come to think of it, you go back to my ass, Sophie said with a laugh. Sophie opens the panties and throws the woman huddled in her ass, sealing her panties, sophie then</span></div></span></div>",
            "created":1492491600,
            "id":2307075,
            "title":"Up her butt"
        },
        "111132":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Hi Lily\"",
                "\"What you doing then?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, little bit unexpected but, good luck to you.\" Laura kissed you before taking you into Lily's room.<br>\r\n\"Lily darling I have something for you.\" Laura said.<br>\r\n\"Oh what is it mommy, what is it?\" Lily jumped excitedly.<br>\r\n\"Well a tiny man is staying here and so he is coming to stay in here with you, now be nice.\" Laura finished before setting you on the floor and started walking to the door.<br>\r\n\"Now I am going in the bath so behave while I am in there okay?\" Laura asked as a reassurance.<br>\r\n\"Yes mommy.\" Lily replied as her mother walked out the room.<br>\r\n\"Hello little man.\"</span></div></div>",
            "created":1442293200,
            "id":2034953,
            "title":"\"Lily\""
        },
        "1111321":{
            "author_id":"stoneshadow",
            "author_name":"StoneShadow",
            "choices":[
                "\"Okay\"",
                "\"Not really what other things do you want to do?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Why are you so small?\" Lily asked.<br>\r\n\"I don't actually know\" You replied.<br>\r\n\"Well do you want to play hide and seek?\" Lily asked.</span></div></span></div>",
            "created":1442293200,
            "id":2034957,
            "title":"\"Hi Lily\""
        },
        "11113211":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Lilly says \"you hide and I will count to 10. Ready... GO!\" You run to find a good hiding spot when you notice a small hole in the wall leading into the room that belongs to her sister Sophie. You hear Lilly say \"6..7...\" So you run to the hole.<br>\r\n<br>\r\nDid you make it?</span></div></div>",
            "created":1582174800,
            "id":2789930,
            "title":"\"Okay\""
        },
        "111132111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Jump into Sophie's room?",
                "Go back to Lilly's room for now."
            ],
            "content":"<div class=\"\"><div> <span>You made it into the hole in the wall. Lilly says \"10... Ready or not here I come!\" For some reason you never figure out you wait in that hole out of view until Lilly gives up and forgets all about you and goes to sleep. Then once you realize everyone in the house is sleeping you make your way to the room of Sophie. You stop at the end of the hole, looking down you see that Sophie's room is lower than Lilly's so there is a gap at the end of the hole. So if you jump into Sophie's room you have to find a way to go back b4 being noticed.<br>\r\n<br>\r\nWhat do you pick?</span></div></div>",
            "created":1582174800,
            "id":2789932,
            "title":"Yes"
        },
        "1112":{
            "author_id":"amista6",
            "author_name":"Amista6",
            "choices":[
                "Buttplug",
                "Foot Massager",
                "Candy Man"
            ],
            "content":"<div class=\"\"><div> <span>You were so intimidated by this giant woman that you decided to stay perfectly still.  Here you were in the palm of a giant beauty and all you could hope was that she doesn't realize your human so you can escape undetected when she's sleeping.   It seemed to be working.  The young beauty had no idea she had a living breathing human in her grasp and had control over his entire life .  Unfortunately for you, she recognized you as something else.<br>\r\n<br>\r\n\"How did this get in my purse? What is it?  Wait... Is what I think it is? Yes! It's a ...\"</span></div></div>",
            "created":1564376400,
            "id":2694433,
            "title":"She Thinks You Are A..."
        },
        "11121":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "She enjoys you and takes you home unaware",
                "Your view"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The mother smiles with glee she's been needing a quick release of her urges she drags her daughter away off to the toilets with her. She leaves the daughter outside the stall while she slides off her tights and underwear and inserts you.</span></div></span></div>",
            "created":1564462800,
            "id":2694714,
            "title":"Butt massager"
        },
        "111211":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "They go on a free vacation to Disney World Florida?",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>After the unaware mom shoves you up her ass hole thinking you are a butt plug, her phone rings b4 she could get her panties and pants back on. She answers the phone \"Hello?.... Yes this is Mary.....Of course I will tell Lilly, and Sophie (her 2 girls Lilly is 6 and Sophie is 15) the great news! Thank you and we will be ready in 1 month.... Ok See you then!\" She hangs up well now you know all their names if you live to even use them. Suddenly Mary pulls up her panties and pants traping you inside her ass half way with a nice ring to stop you from going fully inside. Mary leaves the bathroom and brings the girls to the checkout b4 loading up the car and going home to tell them the great news.<br>\r\n<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1582174800,
            "id":2789934,
            "title":"She enjoys you and takes you home unaware"
        },
        "1112111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Stay with them and remain under the radar.",
                "Leave them now and never look back."
            ],
            "content":"<div class=\"\"><div> <span>When they get home Mary tells the girls that they are going on a 2 month all essences paid vacation to Walt Disney World Florida! And that they will be staying at a 5 star hotel with the VIP Package all ready paid for and that they are leaving in 1 month. \"Ok girls time to start packing!\" The girls run like there's no tomorrow to get packed. That night Mary takes you out and places you on her night stand cleans you off and washes you then puts you on her dresser and goes to sleep, (you notice that Mary sleeps fully naked and is single rasing 2 girls alone... you feel bad for her and you think back to when you first saw her, she was sad but when she saw you and thought you were a butt plug you felt she was truly happy. And you wonder if you leave now how will that affect her mood for the next month and then on the 2 month vacation? You think for a bit and decide that....<br>\r\n<br>\r\nWhat are you going to do?</span></div></div>",
            "created":1582174800,
            "id":2789943,
            "title":"They go on a free vacation to Disney World Flor..."
        },
        "11121111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>You choose to stay and keep them unaware of the fact your human. Shortly after you say that a orb of bright light appears infront of you it asks you \"do you want the powers to survive With out being discovered?\" You reply \"Yes\" the orb says \"put ur hand on me and accept the powers to survive!\" You do so and it vanishes. You start to feel different you have heard stories of tiny people gaining powers to shapeshift and other things, so you try to take the ring off ur waste after its off you focus and try to turn into a read butt plug.<br>\r\n<br>\r\n<br>\r\nDid it work?</span></div></div>",
            "created":1582174800,
            "id":2789954,
            "title":"Stay with them and remain under the radar."
        },
        "111211111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "She  grabs you right away?",
                "She doesn't remember about you yet?"
            ],
            "content":"<div class=\"\"><div> <span>Yes it worked! You try to say outloud but in this form you can't speak or move. You try to revert and it works! You jump up and focus and realize you can fly also! You suddenly think of the old show Danny Phantom and try to go intangible and invisible and it works you phase through walls and have no reflection in the mirror. So now you go back to the dresser and revert to normal and you toss the ring behind the dresser so she doesn't find it and instead you shapeshift one on yourself. And you freeze your movements realizing its 6am and her alarm is going off.<br>\r\n<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1582174800,
            "id":2789965,
            "title":"Yes"
        },
        "1112111111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "She takes you out and puts you back in her ass?",
                "She doesn't bother you till she gets he?"
            ],
            "content":"<div class=\"\"><div> <span>Laura turns off her alarm and grabs you right away but instead of using you as a butt plug she puts you in her pussy and uses you as a dildo. But then leaves you there and gets dressed. \"I guess she uses butt plugs in her pussy for pleasure oh well I have no complaints right now.\" You think to yourself. Laura goes about her day as a waitress with you unawarely tagging along.<br>\r\n<br>\r\nWhat's next?</span></div></div>",
            "created":1582174800,
            "id":2789985,
            "title":"She  grabs you right away?"
        },
        "11121111112":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>8 hours later Laura is home from work and goes to the shower and she takes you out of her pussy and places you on the bathroom sink, then strips and gets in the shower. You think that it may be best to hide until the trip so you turn invisible and intangible then try to fast forward time to 3 days b4 the trip. And it works you revert to Laura's plug as she walks in she notices something behind the toilet and says \"omg that's where this went! Im so happy I found it b4 the trip!\" You can feel her true excitement for finding you. She takes you into her room and puts you inside her suitcase and piles a lot of clothes on top of you (not to mention under you as well). 3 days pass in that suitcase and you hear they made it to the airport. The suitcase your in goes on the belt to be scaned and you realize if it detects you it will beep and they would have to hand search the suitcase so u turn invisible and hope for the best.<br>\r\n<br>\r\n<br>\r\nDid it work?</span></div></div>",
            "created":1582174800,
            "id":2789988,
            "title":"She doesn't bother you till she gets home"
        },
        "111211111121":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Stay in the suitcase?",
                "Go into one of their shoes?"
            ],
            "content":"<div class=\"\"><div> <span>You made it though and everything is fine you revert to normal. And think of how much fun it would be to spend the flight inside either Laura's or Sophie's shoes. <br>\r\n<br>\r\n**(Remember Laura is the mother and Sophie is 15 years old, and Lily is 6 years old).**<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1582174800,
            "id":2789990,
            "title":"It worked!"
        },
        "1112111111212":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Laura?",
                "Sophie?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's shoe do you go inside?</span></div></span></div>",
            "created":1582174800,
            "id":2789991,
            "title":"Go into one of their shoes?"
        },
        "1112112":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Going on a trip to Paris?",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about?</span></div></span></div>",
            "created":1582174800,
            "id":2789938,
            "title":"Something else."
        },
        "1113":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Tampon",
                "Vibrator"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's forgotten her glasses and dismisses your human shape and believes you to be something else</span></div></span></div>",
            "created":1564462800,
            "id":2694717,
            "title":"different..."
        },
        "112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "The little girl clothes section",
                "The toy section",
                "The mother's shopping for her clothes "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You grab on to the little girls shoelace. Where are the mother and daughter going? Which department?</span></div></span></div>",
            "created":1525323600,
            "id":2487945,
            "title":"Grab ahold of the little girls shoe lace"
        },
        "113":{
            "author_id":"miami_fa",
            "author_name":"miami_fa",
            "choices":[
                "You hide in her shoe and she doesn't see you.",
                "She sees movement, and finds you."
            ],
            "content":"<div class=\"\"><div> <span>The employee was kneeling down and focused on her task. I crept up as close as i could and noticed she was actually a bit on the chunky side. Stereotypical nerdy girl with short black hair and dark clothing. The type of girl that used layers of clothing to hide her actual size. When she stood up i grabbed on to her converse and was whisked away towards the break room. One the way in she bumped into an older employee at the store. Above me there was an exchange of words, and the younger employee seemed offended as the woman walked away. <br>\r\n<br>\r\nI wasn't able to make out any of the exchange since when they collided, my world was inverted and i lost my bearings. I was dizzy but when i came to i was no longer on the employee, i watch the doors close behind her as she went into the break room. I looked up and realized i was now on the foot of the older woman who bumped her.<br>\r\n<br>\r\nThis woman was even bigger than the young girl i was hitch hiking on before. I stared up her calves, mesmerized at the dimple flesh, jiggling like liquid with every step she took. This faded up her tan skirt into black as i could only imagine what lay between her legs.<br>\r\n<br>\r\nSuddenly she stops and pulls out her phone, she's checking her messages, and i'm right in her field of view.</span></div></div>",
            "created":1448859600,
            "id":2068417,
            "title":"Hop onto the female employees shoe"
        },
        "1131":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Climb off her shoe and head over to the blonde employee's VANs sneaker",
                "Climb off her shoe and head over to the asian employee's flats",
                "Stay on the big employee's shoe"
            ],
            "content":"<div class=\"\"><div> <span>((excuse any typo's. Writing from my smartphone!))<br>\r\nAs much as you wanted to be seen right now, you knew that was not a good idea. Can you imagine how easy it would be for this woman to mistake you for an ant on her shoe and crush you at this size if she spotted you? That idea haunts you and you know that you must get to higher ground to have better chances of being spotted as an actual human being and not a bug. Making haste, you hide in the space between the tongue of her sneaker and lining of her sock.<br>\r\n<br>\r\n::Sniff:: ::Sniff::<br>\r\n<br>\r\n\"Uuuugghhh.......\" you groan to yourself. Of course you should of saw it coming. The strong smell of sweaty feet fills your lungs! This woman has been on her feet for 8 hours so of course her feet and shoes are smelling bad!<br>\r\n<br>\r\nEventujally, the woman stops texting and puts her phone away just as two other female employee's walk into the break room. As you make your way out of your little hiding spot, still clinging to the fabric of her sock for dear life, you are able to see the two new giantesses that entered the room! One is a short haired blonde girl in her early thirties with red highlights in her hair. She has a really nice butt and big boobs. She is wearing the usual blue walmart vest and shirt, with black tights and black VANs tennis shoes that look rather worn.<br>\r\nThe second girl is a dark skinned asian girl with medium length dark hair who looks like she just got out of high school. She is wearing a walmart vest and shirt as well with brown khaki shorts and black flats which she is constantly popping her heels in and out of.<br>\r\n<br>\r\nThe big woman is now stationary as she takes a seat and begins converstating with the two younger women, leaving you with the options of either staying put on this overweight slow moving woman, or taking a risk and attempting to get a ride on one of the younger employee's footwear. What do you decide?</span></div></div>",
            "created":1463979600,
            "id":2152468,
            "title":"Hiding between her sock."
        },
        "11311":{
            "author_id":"ghxstslave",
            "author_name":"GHXST.JPG",
            "choices":[
                "Fall into the shoe, rolling under the employee's foot, but stop at the sole.",
                "Fall into the shoe, but a sudden motion causes you to roll to her toes.",
                "Grip onto the side of the shoe at the last minute, saving yourself."
            ],
            "content":"<div class=\"\"><div> <span>You decide that you'd rather not stay with this woman and climb off of her shoe. Thankfully, you weren't too stuck between the sock and shoe and you were able to free yourself rather easily. Climbing down off the shoe, you cautiously make your way over to the blonde employee's sneaker. You'd just gotten there and hadn't even begun the climb and already you could smell the odor that was emitting from her shoe. It was rather pungent, but you decided that you could probably get her attention far easier than the overweight woman you were previously stuck with.<br>\r\n<br>\r\nTaking that into consideration, you began to climb the sneaker before you, the smell growing stronger the higher you climbed and you pulled yourself over the edge of the sneaker. Unfortunately, you were correct in your analysis earlier and the shoe was well-worn. So well-worn, in fact, that there was more space between the shoe and her ankle than you had initially thought. This made it very difficult to find your footing once you had climbed up to the top of the shoe. You were wobbling right above the mouth of her shoe, the space between her foot in the shoe was wide enough that you would definitely fall down under her foot should you fall.<br>\r\n<br>\r\nAs that thought crossed your mind, the blonde employee began to stir and her foot began to move, causing you to lose your balance and begin falling. You only had a second to choose what to do, if you took too long, you were falling into the shoe and most likely rolling under this blonde woman's tight-clad foot. From the stench you smelled outside of the shoe, you didn't imagine that the black tights she was wearing smelled any better, and they were probably damp with sweat. It definitely wouldn't end well for you.</span></div></div>",
            "created":1595857080,
            "id":2876151,
            "title":"Climb off her shoe and head over to the blonde ..."
        },
        "11312":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "You begin climbing up the bow lace of her flat ",
                "She drops a pen on the floor, next to you ",
                "She repositions her foot, raising it above you"
            ],
            "content":"<div class=\"\"><div> <span>You get off the heavy employees sneaker and skitter over to the nearest employee, the Filipino one. As you near her foot, you learn her name is Vivian, as she is addressed by a co-worker. In fact, you have seen this girl. Shes normally working the self check outs and has assisted you a few times when the machines screwed up or ID checked you for adult items like booze. You just never could remember her name, but she is pretty cute regardless and you always secretly sorta of had a thing for Asian girls.<br>\r\n<br>\r\nAs you near Vivian's carrier ship sized shoe, you are hit with a faint whiff of feet. Since she has her foot half way out of her black flat, you can smell the stench contained within her shoe. Especially being this small and close to them. You also take note that her flats appear to be a little worn, and the bow design on the toe part has came undone a little, hanging low enough for you to jump up and grab hold of. You are still in pretty good shape and used to be the fastest kid to rope climb in gym class back in high school, so this should not be a problem for you. You just need to be quick while her foot is stationary. One wrong move and this could go south very quickly!<br>\r\n</span></div></div>",
            "created":1552366800,
            "id":2629243,
            "title":"Vivians flats"
        },
        "113122":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Calling her attention may be her only chance.",
                "Grab hold of the pen."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vivian dropped a pen on the floor, the pen fell close to you, but it did not kill you very much.<br>\r\n<br>\r\nWhen Vivian bends down to pick up the pen.<br>\r\n<br>\r\nAt this time you decide:</span></div></span></div>",
            "created":1555909200,
            "id":2648452,
            "title":"She drops a pen on the floor, next to you "
        },
        "11313":{
            "author_id":"keevin",
            "author_name":"Zade",
            "choices":[
                "She feels you",
                "She doesn’t "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly the employee says welp I gotta run cya</span></div></span></div>",
            "created":1571806800,
            "id":2737569,
            "title":"Stay on the big employee's shoe"
        },
        "1132":{
            "author_id":"miami_fa",
            "author_name":"miami_fa",
            "choices":[
                "Keeps on torturing you with her tits",
                "New torments"
            ],
            "content":"<div class=\"\"><div> <span>Rita smiles a sadistic smile when she looks down at you. Immediately recognizing you're a tiny human, but not at all reacting surprised. Rita is a  little dim witted, she reaches down for you and picks u up and brings you close to her face. On your way up you get a better view of her full body. Rita stands 5'9 and is pushing 300lbs. Even through the tough fabric of her skirt you could make out her massive gut. The fabric of her blue shirt stretch thing over her massive breasts. So much so you could clearly see the bra line through the shirt. An ill fitting bra too since you could make out the dark areola peeking from on of the cups. <br>\r\n<br>\r\nWithout a word she glanced around to make sure no one was looking, then leaned forward and pulled her shirt open a bit. She dropped me unceremoniously and i landed with a thud onto her tits. I tried to steady myself on the flesh as she breathed but it was of no use. Rita had grabbed onto her tits and had begun to rearrange them, causing me to lose my balance and sink into her cleavage.<br>\r\n<br>\r\nAs her tits roll around your body you sink deeper and deeper until you're submerged in her flesh. Suddenly the motion stops and you're literally encased in flesh. Small tremors give way to small earthquakes as you now understand she's laughing above you. Her laughter causes her entire body to shake, but everything is muffled for you.<br>\r\n<br>\r\nSuddenly light floods your face as two fingers grab you and hold you while you watch her lift her massive tit straight out of her bra. In one motion she cups the loose tit with the hand she's holding you in, pressing you firmly against her nipple before she places it back into her bra. There's a brief second when she releases her tits where you take a breath and ponder running. But you hadn't realized how damp her tits were, and how sticky her flesh would be against you. Your fabric prison snaps shut behind you, holding you even firmer in place. Air is scarce, but being so small, you don't need much of it. And light still filtered through Rita's clothes, you could hear everything and see lights and some shadows if you turned your head. A feat which became easier as the day wore on and she began to sweat more.<br>\r\n<br>\r\nRita makes sure to make the most out of tormenting you. Leaning against shelves to stock items, crushing you into her tit in the process. Stretching randomly, bouncing randomly. Eventually i began slipping under her breast as she sweat more and more. Her nipple went from being on my chest, to pressing my face, and now i'm holding on to it to prevent myself from slipping. Her bouncing makes it next to impossible so it was only a matter of time before my grip slipped and i slid completely under her tit. Salty sweat invaded all my senses and no matter how much i struggled i could not move, it was too slippery. I was able to turn my head to breathe, but the air was humid with sweat and a hint of vinegar. When was the last time she showered...?</span></div></div>",
            "created":1448859600,
            "id":2068429,
            "title":"She sees movement, and finds you."
        },
        "11321":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Rita begins to apply pressure to her boobs. Uhoh..",
                "You manage to slip free from her tits and free fall...."
            ],
            "content":"<div class=\"\"><div> <span>Rita smiled as she continued to torture you between her massive tits. She moans slightly as she fulfills her fantasies. Squeezing her massive tits with every moment she makes!<br>\r\n<br>\r\n\"Arggh!!! Nooo!\" you groan as you are bounced around in your fleshy prison. Fortunately for you, Rita begins to interact with a co-worker and forcing her to stop and keep her professionalism. This gives you an opportunity to crawl out of your crevice of doom slightly.<br>\r\n<br>\r\n\"Yes yes I understand. Ok but maybe Ron can handle it...\" Is all you can hear come out of Rita's mouth as she talks to her co-worker. You are seeing a light from your gross sweaty prison and are getting close. Just then,</span></div></div>",
            "created":1464843600,
            "id":2157604,
            "title":"Titty torment"
        },
        "113212":{
            "author_id":"connorking",
            "author_name":"The King",
            "choices":[
                "... mannage to maintain your grip on her shrit (unaware)",
                "... fall right into her pantiees (unaware)"
            ],
            "content":"<div class=\"\"><div> <span>          You then free-fall right on to her stomach and are rolling towards her skirt, and by extension, her panties!<br>\r\nYou try your best to grab ahold of the soft, jiggly flesh, covered by the shirt. No matter where you end up, its better than being tormented by her!<br>\r\nYou struggle and struggle and...</span></div></div>",
            "created":1485579600,
            "id":2270499,
            "title":"Is this better???"
        },
        "11322":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Inside of her shoe.",
                "Inside of her lunch. A salad container."
            ],
            "content":"<div class=\"\"><div> <span>You are about to pass out from lack of oxygen when light suddenly fills your vision, followed by your tiny body being lifted out of her cleavage!<br>\r\n<br>\r\n\"Well well well, hows my little man doing??\" Rita said to you, having a seat in the employee break room. You cannot respond as you are still coming in and out of consciousness and her now deafening voice temporarily mutes your hearing.<br>\r\n<br>\r\n\"Did you like being smothered by my tits? Did you have fun? You are not off the hook just yet. Its lunch time now and I can spare more time to play with you tiny man. Hahaha!\" Rita laughs. You whimper something but its inaudible.<br>\r\n<br>\r\n\"Now, lets see.........where else can I put you....\" Rita</span></div></div>",
            "created":1451192400,
            "id":2080231,
            "title":"Rita's New Torment"
        },
        "113221":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "The toe section",
                "The heel area"
            ],
            "content":"<div class=\"\"><div> <span>Rita looks down at her dirty black leather non-slip tennis shoes. The overweight female employee looks at you, cracking a small smirk before she fixes her attention back to her footwear. Using her free hand, she undoes the laces and removes her foot from her shoe!<br>\r\n<br>\r\n<br>\r\n\"Ahhhhh...\" Rita sighs, flexing her toes within her black/pink striped sock that is covered in lint balls.<br>\r\n<br>\r\n\"How about you spend a day in my shoes? That is, if you can survive. Mwahahaha....\" Rita laughs as grabs her empty shoe and dangles you over the opening! You can see the insides of the shoe and wretch. The heel lining is torn due to Rita constantly slipping them on and off, the insole is worn and glistens with sweat. The odor hits you like an Abrams Tank and its just flat out bad. You thought you had the smelliest feet ever but they dont even scratch the surface compared to this womans shoes. You almost feel sorry for this shoe how it has to support this womans 300+ lbs  frame!<br>\r\n<br>\r\n\"N-no....\" You manage to muster weakly as you are lowered closer and closer into the dreaded opening of her Rita's shoe. You hit the insole with a moist thud. If hell existed, this would be it for you. This would be your eternal suffering. Some overweight fat bitches disgusting smelly work shoe.<br>\r\n<br>\r\n\"AAGGGHHH!!!\" You gasp, covering your nose with your shirt.<br>\r\n<br>\r\n\"Hahahahah!!! Get comfortable in there tiny man. Because I am working major overtime tonight. Its going to be one long sweaty shift. I'd advise running to the toe part by the way as I got these shoes a size larger for my wide feet. I'll give you ten seconds.\" Rita says before she holds her socked foot into over the shoe!<br>\r\n<br>\r\n\"Wait wait noooo!!\" You cry out before running to,</span></div></div>",
            "created":1451278800,
            "id":2080359,
            "title":"Inside of her shoe."
        },
        "1132212":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "content":"<div class=\"\"><div> <span>You huddle up in the huge ditch that the heel of Rita's foot created inside of her shoe. No matter where you go inside of this shoe, you know you are doomed. The smell is so bad inside of these shoes that its impairing your mind.<br>\r\n<br>\r\nRita begins to re-insert her foot casually inside of her shoe. A huge smile fixed on her face as she does this.<br>\r\n<br>\r\n\"Nooooo!! I promise I wont say a thing!! noooo!!\" You scream out your last words...<br>\r\n<br>\r\n\"Rita carryout on check stand 4\" A voice booms over the stores intercom. Rita immediately slams her foot back into her shoe and laces it up. Her monstrous heel flattening and grinding you into her shoes insole. Rita then politely walks over to help an elderly disabled woman carry her groceries back out to her car....<br>\r\n<br>\r\n4 hours later, Rita enters her house and has a seat on her couch. She then removes both her shoes and brings one up to her nose, the one your remains are smashed into and takes a whiff,<br>\r\n<br>\r\n\"P.U. Hahaha.....I feel so sorry for you...\" Rita says as she see's your smashed remains in the heel of her work shoe. Rita licks her lips, a bit turned on at the site of a tiny person dead inside of her sweaty bacteria infested shoe. Rita then gets a text from her friend saying they are going out. Rita changes out of her uniform and into her casual attire.<br>\r\n<br>\r\n\"I think I'll wear these tonight. They are super comfy.\" Rita says and puts on her non-slip work shoes with your crushed remains still inside before stomping out of her front door. You are never heard from again, Rita the wal-mart employee wears these shoes for almost another six months before they become too torn up and sold on ebay to some pervert.<br>\r\n</span></div></div>",
            "created":1456635600,
            "id":2110580,
            "title":"It was so obvious...."
        },
        "113222":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Faith Trades Rita Lunch",
                "Faith decides not to trade food"
            ],
            "content":"<div class=\"\"><div> <span>\"Hahahaha!!\" Rita bellows as she drops you on the leafy green surface of her salad!<br>\r\n<br>\r\n\"I just started my diet last week as my doctor said I need to lose 100lbs. Its going to consist of a lot of low fat and calorie food. Tho I still need protein to build some muscle mass and you are just perfect to start out with!\" Rita says smiling evily!<br>\r\n<br>\r\nYou cannot believe this is all happening. Its like some fucked up nightmare coming true! Rita then grabs her spork and begins to stir up the condiments of her salad!<br>\r\n<br>\r\n\"No!! You cannot be serious about this! Please do not eat me!!\" You beg but your cries are inaudible to Rita. <br>\r\n<br>\r\n\"This is going to be.....a gorgeous lunch indeed.....\" Rita says as she pours some organic balsamic dressing from a packet all over the contents. You barely avoid being coated in this stuff as it would surely impair your mobility. Rita smacks her lips and is about to dig in, when one of her fellow co-workers walks in, listing to headphones.<br>\r\n<br>\r\n\"Long day huh Rita?\" The girl comments, slipping off her brown leather flats and sitting on the chair indian style.<br>\r\n<br>\r\n\"Way too long for me, Faith. Way way too long.\" Rita responds, a little upset she cannot enjoy her food in peace. Faith is a hipster 21 year old Filipina girl. She was a bit overweight too but not nearly close to Rita. She had black hair with pink highlights, wore the the walmart uniform vest with a black t-shirt, dark blue jeans and flats which are now off her feet.<br>\r\n<br>\r\n\"Faith? It smells like feet. Why did you take your shoes off??\" Rita asked, a little disturbed. Faith laughs as she unwraps her hamburger.<br>\r\n<br>\r\n\"Sorry Rita. Its not my fault feet are feet and just stink.\" Faith said. Rita licks her lips at the sight of Faith's burger.<br>\r\n<br>\r\n\"You checking out my lunch? Its actually a Boca burger from Red Robin. I want to drop a few pounds for the beach this summer so I am eating vegetarian now......wow that salad looks very colorful and fresh....\" Faith comments. Rita completely ignores the fact you are still in her salad and asks,<br>\r\n<br>\r\n\"Want to trade?\" Rita asks,</span></div></div>",
            "created":1451278800,
            "id":2080373,
            "title":"Impending Lunch."
        },
        "1132221":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "On Faith's spork",
                "On the table"
            ],
            "content":"<div class=\"\"><div> <span>Faith eyes the salad across from her hungrily, but then she notices the hungrier look in Rita's eyes. A mischievous smile cam across her lips. <br>\r\n\"Sure thing Rita...on one condition!\"<br>\r\n\"What condition is that?\" she asked. She tried to suspicious, but she couldn't stop eyeing up the burger. Faith responded by stretching her legs out placing her feet on her lap.<br>\r\n\"You need to give me one foot-rub at a time of my choosing.\" <br>\r\n<br>\r\nFaith smirked as she began to rub her toes on Rita's plush thighs. Rita narrowed her eyes at Faith. It was demeaning for someone like her to rub a younger coworker's smelly feet! If anything, it was job for a tiny man... But another look at the tasty meal made her forget about you and sigh in defeat.<br>\r\n\"Deal, I'll rub your smelly feet\" she says as she slides her salad over.<br>\r\n<br>\r\nFaith smiled and pushed her burger over to Rita. She pulled the salad over and scooped up some lettuce with the spork. She watched as Rita ecstatically picked up the burger and licked her lips. Just as she opened her mouth incredibly wide, Faith spoke up again. <br>\r\n<br>\r\n\"Oh Rita...\" she called. The large woman glared over and seemed about ready to yell at her when she felt Faith's feet slide further up her leg. \"I'd like that promised foot massage now\" she said cockily, taking a bite of her salad. <br>\r\n<br>\r\nRita's face heated up to a beat red...before she just sighed and picked up a tan foot. She grimaced as her fingers pressed into the sweaty flesh, the smell rising up directly to her face. Faith leaned back in her chair and smiled at her complete victory. She got a healthier lunch instead of the burger she earned for free by taking a survey. Not to mention she got a free foot-rub from her attractive coworker. At least, attractive to her. <br>\r\n<br>\r\nBut the only question remaining, what happened to Rita's \"special ingredient?\" </span></div></div>",
            "created":1462597200,
            "id":2144517,
            "title":"Faith Trades Rita Lunch"
        },
        "11322211":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You made it out just in time!",
                "You're trapped!  Gulp!"
            ],
            "content":"<div class=\"\"><div> <span>Rita's situation would have seemed more humorous to you considering the torture she had put you through, but you had more important things to worry about as the piece of lettuce you are resting in shivers and shakes.  Looking up, you can see the spork had stuck into it, and now it was being lifted up. Vertigo from the sudden movement made you dizzy, and you lost your bearings as you got closer and closer to Faith's mouth.  As you got a hold of yourself, you saw that you had started to make it past her lips. Faith's hot breath washed over you as she started to close her mouth. If you were going to act, it had to be now!  Letting go of the lettuce, you landed on her slimy tongue. You slipped and slid as you made your way to her closing lips!  You rushed towards her teeth as they were closing, could you make it in time?</span></div></div>",
            "created":1491800400,
            "id":2302579,
            "title":"Death by Spork"
        },
        "113222111":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You manage to escape",
                "She decides to put her shoes back on!"
            ],
            "content":"<div class=\"\"><div> <span>You lunged forward, hearing her teeth clack just behind you.  Thank God you managed to narrowly avoid being chomped in half.  But suddenly you realized you hadn't thought ahead very far. Bouncing off Faith's lower lip, your decent leads you to land on her soft breast, which you then rolled off of. Closing your eyes in terror, you felt yourself hit some kind of fabric as you bounced off of Faith's hip.  Fully expecting to get splattered on the tiled floor of the breakroom, you were taken by surprise when you landed on something warm, soft, and wet. Before you had opened your eyes, the smell was a clear indicator of where you had ended up, and part of you wished you had died on the floor. You were on the heel of Faith's shoe!  As your eyes opened the stench burned them, forcing you to squint. You HAD to get out of here as soon as possible!</span></div></div>",
            "created":1491800400,
            "id":2302580,
            "title":"Out of the Frying Pan..."
        },
        "1132221111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Stay on the Head Band.",
                "Stay at Wal-Mart."
            ],
            "content":"<div class=\"\"><div> <span>suddenly u black out trying to escape, and u r fully aware of whats happening but u cant control ur own body at all, its acting on its own. u feel Faith's shoe being lyfted up and u narrowly avoid her bare foot as u were running the walls of her shoe out. once u r fully out u re-gain control of ur own body and u start freaking out as ur free falling onto the tiled floor of the break room, when suddenly u notice something soft u can land on, u can see that some high school girl on a job site trip left her hair band on the floor so when u et closer to the floor u aim for it and land safely on it, u have time b4 she gets back (since she just left it to use the bathroom) what do u do?<br>\r\n<br>\r\nStay on it and go with the High School Girl?<br>\r\n<br>\r\nor <br>\r\n<br>\r\nGet off it and stay at Wal-Mart and try and find help here.</span></div></div>",
            "created":1561525200,
            "id":2679025,
            "title":"You manage to escape"
        },
        "11322211111":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "She goes to sleep fully clothed with u still around her neck.",
                "She un-dresses and goes to sleep fully nude."
            ],
            "content":"<div class=\"\"><div> <span>You stay on the head band, thinking you may have more luck with a school girl than one of these evil Walmart fat-ass's trying to kill you. You look around on the head band and see that there is a single piece of thread looped out, so u think you should go in there and tighten it to not fall once the head band is picked up and or put on. so now you go under the loop of thread and pull it tight, sealing yourself onto the head band<br>\r\n<br>\r\nabout 5 mins pass after getting settled in, and the girl comes out of the bathroom and u notice that she isn't a school girl, shes a school teacher. looks to be about 22 yrs old. b4 you can even process anything else you are lyfted up and she puts her head band around her neck and leaves it. and you can see everything from your spot right now. The lady walks out and gets into her car, and drives to a All Girls Private High School. Once she parks in the gated parking lot she heads to HER dorm on campus.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nwhat happens next?</span></div></div>",
            "created":1562648400,
            "id":2684535,
            "title":"Stay on the Head Band."
        },
        "1132221112":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Try to rub against her toes",
                "Too late, she finished her break"
            ],
            "content":"<div class=\"\"><div> <span>\"Heh, that was pretty good Rita!\" You hear the echoing sound of Faith's voice say teasingly to your previous tormentor, \"you can enjoy that burger now, but you may want to wash your hands first.\"  \"Yeah, whatever,\" Rita says dismissively, \"but put your damn shoes back on so I can eat without gagging on your foot stink,\" the overweight woman growled. <br>\r\n<br>\r\nYou panicked as a shadow fell over the entrance of your smelly prison, and watched as her foot slid into the entrance of the shoe. The stink around you increased as her dark toes wiggled closer to you.  You made a mad dash towards the other end of the shoe to avoid getting crushed, until your back was pushed against the very edge of the toe section. You could feel her toes getting closer and closer, and thought you might end up crushed, until her big toe tapped your face as it came to a stop. You gave an exasperated sigh, then instantly regretted taking a breath as you inhaled that rancid foot stink. If you didn't try to get her attention while she finished her salad, you might pass out before she starts walking and end up crushed under her gross foot?</span></div></div>",
            "created":1491800400,
            "id":2302603,
            "title":"...And Into the Fire!"
        },
        "113222112":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "wait....",
                "Swim for it!"
            ],
            "content":"<div class=\"\"><div> <span>Well this is it, u accept ur fate and stop wasting ur energy and let her swallow u. U finally make it into her stomach and notice that u landed on a block of tofu, witch seems to not dissolve in her stomach acids. so u have 2 choices, either wait on the tofu and let nature run its course. or risk everything u have left and try to swim for it.<br>\r\nwhat is ur choice?</span></div></div>",
            "created":1561525200,
            "id":2679020,
            "title":"You're trapped!  Gulp!"
        },
        "11322212":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Rita",
                "Faith",
                "Another employee joins in!"
            ],
            "content":"<div class=\"\"><div> <span>During Rita's interaction with the new giantess, you decided that this would be the best opportunity to escape. The girl named Faith had agreed to trade lunches after all, and the last thing you wanted was to end up as lunch for either of these large goddesses. <br>\r\n<br>\r\nWhile the salad dressing had made everything slippery around you, you latched onto a piece of lettuce and began to hoist yourself up. While wiping off the dressing on the plants, you were also making your way up to your goal. A particular leaf was about to fall out of the plastic container, and you planned on using it to escape.<br>\r\n<br>\r\nEverything shook as Rita slid the container over to Faith. Your foot hit a slick spot as you begin to slide down your current foothold. Taking a bite into the plain green, you create a handhold and grip it as tight as you can. Just as your grip began to slip, Faith began to eat. She pushed around the contents of the container and sending you flying over the edge!<br>\r\n<br>\r\nThe landing was horribly rough but besides a few bumps and bruises you're unharmed. Standing up, you realize that you're completely exposed on top of this table. Rita was too busy rubbing her younger coworker's foot to notice that you got out. Also, Faith was watching Rita give her massage while eating her lunch so she wasn't looking down. <br>\r\n<br>\r\nYour best course of action would be to get down from this table and run away from Rita, that sadistic bitch. An option would be to try to contact Faith, but that seemed like a terrible idea. Someone able to counter Rita so easily couldn't be considered safe. So the anything left now, how to get down? The only way you could think of is to move over and climb down one of these titans while they were still distracted. <br>\r\n<br>\r\nBut who? You know that Rita is dangerous, but the fat ass seems incredibly focused on finishing her foot rub so that she could eat her burger. Heck, she traded you without a single thought when she first saw it! But getting caught by her would mean certain death...<br>\r\n<br>\r\nOn the other hand, Faith had challenges of her own. She seemed perfectly distracted, but her legs were resting on Rita's lap. To get down to the floor, you would either have to slide down the chair leg...or jump into her shoes below. The soft insole would certainly cushion your fall,but the thought of being trapped made you shiver in disgust. <br>\r\n<br>\r\nWho do you pick to scale?</span></div></div>",
            "created":1464066000,
            "id":2153029,
            "title":"Out in the open"
        },
        "113222121":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Rita's stomach (hold on)",
                "Rita's cleavage (trapped again)",
                "Rita's breast (slip and fall)"
            ],
            "content":"<div class=\"\"><div> <span>Looking over the edge to Faith's shoes, it was an immense drop to the ground. There was no way you would survive such a fall, even if you managed to reach Faith's legs. And you can't stay here. Which only left Rita. <br>\r\n<br>\r\nTurning back and running to her side of the table, you saw the sadistic employee still working on Faith's foot with a scowl on her face. Every now and then, she looked over at her burger, but was otherwise completely distracted. And her own feet were on the ground, so you could at least reach the floor safely. <br>\r\n<br>\r\nIt might not be the smartest idea in the world...but you made up your mind. You would climb down Rita's obese body and escape from her! Taking a few deep breaths, you ran for the edge of the table and made a leap towards her! <br>\r\n<br>\r\nYour momentum launched you forward as you watched Rita's ill-fitting shirt getting closer and closer. You braced yourself just before making contact with...</span></div></div>",
            "created":1589846580,
            "id":2837742,
            "title":"Pretty Stupid Idea"
        },
        "1132221211":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "The floor",
                "Her waist",
                "Still on her belly"
            ],
            "content":"<div class=\"\"><div> <span>Her enormous breasts fell out of your view as you plummeted down. There was just too big of a gap between the rim of the table and her! But luckily for you, something stuck out even farther than her boobs. <br>\r\n<br>\r\nYou smacked into Rita's thick belly fat and latched on for dear life. The blue shirt gave you a few handholds to brace against. Looking directly up, you could barely make out the underside of Rita's face with her breasts blocking the view. At least now you were out of sight from the sadistic retail employee. <br>\r\n<br>\r\nAs you started to climb down, a low, powerful growl echoed around you as Rita's body vibrated. It took you a second to realize the beastial noise was her stomach growling. <br>\r\n<br>\r\n\"Oh c'mon, this has to be good enough now!\" Rita complained to Faith. <br>\r\n\"Five more minutes~\" the younger girl giggled in response. <br>\r\n<br>\r\nShoot. You were running out of time. Scaling down quickly, but carefully, you tried to escape before Rita has a chance to remember you. <br>\r\n<br>\r\nHow far down do you make it before Rita starts eating?</span></div></div>",
            "created":1589847060,
            "id":2837754,
            "title":"Nailed the landing"
        },
        "113222122":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Everything remains the same",
                "Faith will wear the shoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to jump in Faith insole, even the soft insole, you faint due to fall, when wake up</span></div></span></div>",
            "created":1464498000,
            "id":2155664,
            "title":"Faith"
        },
        "114":{
            "author_id":"writerguy",
            "author_name":"WriterGuy",
            "choices":[
                "You try to get her attention at her feet somehow",
                "You begin climbing up the outside of her jeans",
                "You begin climbing up the inside of her jeans"
            ],
            "content":"<div class=\"\"><div> <span>The latina woman is smiling and nodding her head to the rhythm of whatever song she is testing out. She looks like she might be nice, and right about now that is the best information you have to go on. It doesn't hurt that is is also very attractive, with a curvy figure clad in boot cut jeans and a nice fitting tank top.<br>\r\n<br>\r\nKnowing that staying where you were wasn't going to help, you break and run for her sandal. You grab one of the leathery straps and hoist yourself up onto her heel, looking up the belled leg of her jeans. You hadn't thought it out this far yet...what could you do now? The way you figured it, you could stay at her feet, or start climbing up her jeans.</span></div></div>",
            "created":1442725200,
            "id":2037411,
            "title":"Hop on the mexican womans sandal"
        },
        "1141":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "They get something to eat at the subway restaurant inside",
                "They go to try on shoes"
            ],
            "content":"<div class=\"\"><div> <span>Its too dangerous to climb further up the titanic girls body so you decide to stay put. This girl wont be stationary for much longer. You take a few seconds to gaze at her massive toes near you. Never in your life have you felt so......small and insignificant. Her big toe alone is twice your height and probably weighs as much as a car.<br>\r\n<br>\r\nJust then, you are almost thrown off balance as the Latina shifted her foot slightly as she begins gently tapping her foot a little to the beat of the song. You immediately grab a hold of the strap of her sandal. You do not want to get thrown off or even crushed beneath her heel. This goes on for about a couple of minutes until the girl hangs up the beats style headphones and proceeds to make her way down the isle of the electronic department to meet up with her sister,<br>\r\n<br>\r\nYou hang on for dear life as each step the girl takes jostles you while she begins talking to her sister. The girls,</span></div></div>",
            "created":1451192400,
            "id":2080226,
            "title":"At her feet"
        },
        "1143":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Pubic jungle",
                "Butt climbing"
            ],
            "content":"<div class=\"\"><div> <span>You decided to climb the inside of the mexican woman's jeans because it seemed like a safer idea. If she saw you on her foot she could mistake you for a bug and try to squish you, the same would go for climbing on the outside of her jeans. So if you climbed inside she won't see you. Thus you begin your climb into her pants as she is listening to music and unaware of you being there. As you climb upwards you notice there are tiny hairs on her naturally tan leg, but she probably just forgot to shave today. You finally reach the crotch of her pants and you noticed something, she decided to go commando today as you see no underwear is present. Not only that but she also has not shaved her crotch either as you look at a thick, dark forest of pubic hair. Now you have two options, either go through the mexican woman's large pubic jungle or go to the back and climb through her butt to get out of the jeans.  </span></div></div>",
            "created":1443070800,
            "id":2039371,
            "title":"You begin climbing up the inside of her jeans"
        },
        "11431":{
            "choices":[
                "She notices and gets aroused ",
                "Your fin she doesn't notice "
            ],
            "content":"<div class=\"\"><div> <span>You reach out to the black curly hair and get a grip. Without hesitation you reach with the other hand and hang above the mexicans clitorus. 'Home clear' you think but your leg brushes againt her women hood and immediately get wetter. You hadn't realised until now that it was humid where you were and the giantess was sweating. Quickly moving your foot you hope you hadn't made her notice you. So what happens next?</span></div></div>",
            "created":1462078800,
            "id":2141900,
            "title":"Pubic jungle"
        },
        "114311":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Escape",
                "Struggle- more aroused"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She gently brushes her hand against her crotch and starts biting her lip as you are slowly pushed closer to the ever gaping slit</span></div></span></div>",
            "created":1534482000,
            "id":2534934,
            "title":"She notices and gets aroused "
        },
        "1143111":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "She lowers her pants and starts masturbating ..",
                "She looks down and watches you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was very sweaty here. You had to escape. Suddenly you're trapped in the woman's hair. The woman decides to go to the bathroom. Getting there.</span></div></span></div>",
            "created":1534654800,
            "id":2535701,
            "title":"Escape"
        },
        "11431111":{
            "author_id":"vitriolo",
            "author_name":"Junseo1107",
            "choices":[
                "Crawl deeper and deeper",
                "Try to get out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly, you slide into her slippery vagina because of her acid from her vagina</span></div></span></div>",
            "created":1549429200,
            "id":2613675,
            "title":"She lowers her pants and starts masturbating .."
        },
        "114311111":{
            "choices":[
                "The woman (P.O.V)",
                "You are the pregnancy of a Mexican woman."
            ],
            "content":"<div class=\"\"><div> <span>The woman is thinking to herself in the bathroom, “what’s that feeling coming from her vagina?” You can till that she’s about to masturbate, with her finger closing in fast, you chose to go deeper into the Mexican’s womanhood. The woman let’s out a big orgasm, she tries to fish you out but you are way too deep for her to reach you. <br>\r\n<br>\r\nThe woman is finished with her “woman time thing” and now she washes her hands and buy some beats headphones and heads for her car, and drives out for her apartment. <br>\r\n<br>\r\nYou are still inside the Mexican woman’s vagina, she can feel moving but she’s driving and she is loving her new beats, you are struggling with her humid wet and very hairy uterus, you trying to find out of the woman’s body, after it seems like a year long of digging through a woman’s vagina, you see a white small object in the distance, it looks so beautiful and you get closer and closer to it and then you touch it, when the moment you touch the object, with great force you get sucked in. After you get sucked into the white object, you realize that it was a egg and now you are going to be reborn as the Mexican woman newborn baby. You always find pregnant women are super sexy, you’re going to be inside this woman’s womb for next 9 months. <br>\r\n<br>\r\nAfter 2 weeks since you’ve been shrunken and impregnating a strange Mexican woman with yourself, you find it very comfortable in the womb but does the woman know about her pregnancy.</span></div></div>",
            "created":1551502800,
            "id":2625572,
            "title":"Latina’s womb."
        },
        "1143111111":{
            "choices":[
                "Inside Alexandria’s womb.",
                "8 months later."
            ],
            "content":"<div class=\"\"><div> <span>Alexandra Marino is a single woman how’s looking to find love but her past relationships have not been great to say the least. Two weeks ago she was at Walmart, trying out some new beats headphones that just come and she loves them. During her shopping at Walmart, she felt a weird feeling in her vagina, she even went to the bathroom to masturbate it out, but she didn’t find nothing. Now she’s still loving her new beats, and one morning she wakes up and feels like her stomach is about to explode, she rushes to the bathroom and vomit like crazy.<br>\r\n<br>\r\nAlex is thinking to herself “why did she had to vomit?” She doesn’t drink even at her age, she walks to her kitchen and drink some ginger ale but it didn’t help at all. So she crawls back into bed and get some more sleep, little did she know “she’s pregnant” with a shrunken young man.<br>\r\n<br>\r\nBy now she would known about her pregnancy but she doesn’t so after 30 minutes she wakes up again and she still feels bad, she open a bag of chips and eating them and again she goes to vomit again. After another trip to the bathroom she takes a look in the mirror and her stomach is get a little bigger, and her breast are bigger than usual and tender too. And now Alex is thinking to herself “why is her stomach and breast are bigger?” Than she thinks she might be pregnant.<br>\r\n<br>\r\nAlex always wanted kids but she haven’t found the right guy. So she chose to stay single for a while until she finds her true love, but she’s thinking to herself “how could she get pregnant” she didn’t have sex with a guy for over a year, but she always thought that having a baby is a gift from god. So she drives to the local pharmacy to get a pregnancy test, after she got the test she drives back to her apartment and goes into the bathroom and take the pregnancy test. <br>\r\n<br>\r\nAfter taking the pregnancy test she waited ten minutes to read it and it’s positive she’s pregnant. Her first reaction is shocking to her but then she gets  excited, knowing her dream of becoming a mom are coming true. Alex place both of her hands on her stomach and says to her unborn baby “I can’t wait to meet you my child” and her pregnancy journey have just begun.</span></div></div>",
            "created":1551675600,
            "id":2626261,
            "title":"Mysterious pregnancy."
        },
        "114311112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Think you are an ant, just crush or swallow.",
                "Realize you're a tiny, stunned man, what does she do?"
            ],
            "content":"<div class=\"\"><div> <span>Desperate, you try to get out of the giant vagina.<br>\r\nThe acid was starting to burn your body, you'd melt if you stayed here any longer.<br>\r\n<br>\r\nFighting against the soft, wet flesh, you notice when two giant fingers come to get you.<br>\r\n<br>\r\nThe Mexican woman was in Walmart's bathroom masturbating, she knew there was something inside her, with two fingers she took the small thing.<br>\r\n<br>\r\nYou feel the pressure, almost crushing your ant body.<br>\r\nThen you observe a giant Eye and a strange smile.<br>\r\n<br>\r\nThe Mexican woman picked up and began to observe the little ant on her finger. <br>\r\nShe then:</span></div></div>",
            "created":1555909200,
            "id":2648445,
            "title":"Try to get out"
        },
        "1143112":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Your view",
                "Underwear shopping"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her primative desires tale over she quickly rushes to a private little spot and rubs a quick one out at your suspese</span></div></span></div>",
            "created":1563858000,
            "id":2691302,
            "title":"Struggle- more aroused"
        },
        "11431122":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Thong",
                "Granny pants"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly light blinds you the Mexican lady has lowered her jeans and she's bought various underwear to try on </span></div></span></div>",
            "created":1564290000,
            "id":2693542,
            "title":"Underwear shopping"
        },
        "114311221":{
            "author_id":"amista6",
            "author_name":"Amista6",
            "choices":[
                "Vagina",
                "Anus"
            ],
            "content":"<div class=\"\"><div> <span>She drops a pile of thongs on top of you, while she tries each of them on. <br>\r\n<br>\r\nYou struggle to get free, but get entangled in the last one left and it's the smallest.  She doesn't like any of them but smiles when she sees the one your stuck in.  Her hand reaches for you and soon enough she slips them over and up her legs until your right at the entrance to her...</span></div></div>",
            "created":1564376400,
            "id":2694437,
            "title":"Thong"
        },
        "1143112211":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Your view",
                "Her view"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel the raw heat of her vagina in front of you and with one big tug on her thong she thrusts you up inside of her </span></div></span></div>",
            "created":1564462800,
            "id":2694708,
            "title":"Vagina"
        },
        "12":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Go with the hot blonde",
                "Go with the chubby girls",
                "The mom and daughters",
                "The grumpy punk employee",
                "Other options"
            ],
            "content":"<div class=\"\"><div> <span>\"Mary, I need you to run to the store for me me! We're out of paper towels, money's in my purse!\"<br>\r\n\"Sure thing mom!\"<br>\r\n<br>\r\nThat was the last exchange you had with your mother. And it might end up the last exchange you'll ever have with her. That thought crosses your mind as you see all the giants walking before you. It was supposed to be simple, go to Walmart, grab paper towels, and go back to your house. But that is out of the question now that you've shrunken to the size of an ant!<br>\r\n<br>\r\nYou walked in 5'4\" and after feeling something like a static shock you become the size of a bug. It had taken you a while to dig your way out of your own clothes, leaving you naked. The mirror you kept in your pocket to check makeup had fallen out and opened. Looking at your reflection you took a little relief in seeing that you at least looked the same. Same long brown hair, same slender body...same small breasts.<br>\r\n<br>\r\n\"I guess they're really small now...\" you grumbled to yourself. Being 18 years old now, you doubt they'll ever get much bigger. At that time you you turned around to see a giant security guard towering larger than any skyscraper you had ever seen in your life. He quickly picked up your possessions and pulled out a radio. \"Be on alert, possible streaker inside. Keep your eyes open guys.\" And with that, he walked off. He couldn't even see you.<br>\r\n<br>\r\nYou were kinda surprised that no one saw you shrink. Due to the extreme summer heat, people were packing into AC cooled store to stock up on cold items. You've seen a lot of people just show up for a while and leave without buying anything just to keep out of the sun. Many of the colossal beings walking by wore incredibly revealing clothing. <br>\r\n<br>\r\nYou were currently standing on the side of an isle so that you wouldn't get crushed by any of these god-like beings. A single toe would crush you like a movable mountain. But as horrifying as it sounds, you decide to get help from one of the people around you. If you just stand around waiting to turn back to normal you could get killed by a bug! Or like a bug! At least if you get someone's attention they could keep you safe. <br>\r\n<br>\r\nLooking around you see a few options for attention. The closest one was a girl that appeared to be around your age. She had short, bleach blonde hair and some knockout curves. Her breasts seemed to be trying to rip the girl's tank top, and her butt was doing the same to her booty shorts. You saw her feet in blue flip flops with a cute pink nail polish. A little bit of resentment was already building inside of you for her sexy body. She appears to be reading the nutritional information off a box of crackers.<br>\r\n<br>\r\nYou also saw a group of girls around the same age as well. There were three of them, two with brown hair and one with blonde. However you would be a little hesitant about them. They were all wearing jean shorts and tan tops that wearing containing their heavy forms. They were by no means fat, but they were a little husky. At least their curves were amazing. What caught you attention was that they were all barefoot, which could make it easy for them to feel you. They were standing in the clothing isle in a circle, just talking. You glared at one of the brown haired girls. She was the heaviest with a pudgy belly that peaked over her shorts. But her assets...either end would have been bigger than your normal sized head.<br>\r\n<br>\r\nHearing a crying baby makes you look over to the shoe section. Four people were near each other, a mother and her 3 daughters. The mom looked young, probably in her mid to late 30's. Her daughters included a baby, a six year old, and thirteen year old. At least that was your guess. They all shared deep red hair and green eyes. The mom was trying to fit he baby with new shoes while the other girls seemed to be trying them on on their own. The mom was hot. You had to admit that she gave off an mature charm in her button up shirt and long skirt, matched with black strap sandals. The daughters are in varying outfits.<br>\r\n<br>\r\nYour last option could be the easiest, but the most dangerous. Looking over you see a woman in her mid twenties in a Walmart uniform stocking some shelves. She stocking the lower shelves so she's crouched down, causing her flats to remain on the ground while her feet arch into the sky. She's low so it'l be easier to get her attention. However, it might not be good for her to see you. She has short, neon pink hair and appears to have a similar body type to your own. A quick lick of her dry lips expose a tongue piercing. Guessing from her eyebrows she's naturally dirty blonde. She has a sour expression on her face as she's working, signaling you that she's in a very bad mood. <br>\r\n<br>\r\nSeeing these options before you, you need to come to a decision on who to make contact with. Of course there is the option that any of these people could crush you, but you could get crushed either way.</span></div></div>",
            "created":1460782800,
            "id":2134186,
            "title":"Female"
        },
        "121":{
            "author_id":"garth11",
            "author_name":"Gaturm",
            "choices":[
                "Noticed you!",
                "Notices a bug!"
            ],
            "content":"<div class=\"\"><div> <span>You look around some more: all of those people looked equally helpful, but who should you choose? You really only had one chance at this - running one way would leave you incredibly far from the others. Just as you were considering your options, an enormous foot slammed down infront of you, nearly knocking you off your feet! As quickly as they came, the sandalclad feet rose again and left, moving at an impossible speed. You were shaking...just a few inches, and you would have been pulverized by a giantess who would never have even noticed!<br>\r\n<br>\r\nPassing the halls was definitly to dangerous! You wouldn't last a second, trying to scurry through all those mingeling giants. That left the blonde girl as the best option - she was standing just in the aisle you were hiding in and seemed quite absorbed in the products she was looking at. Getting to her would be...well, at least not AS dangerous.<br>\r\n<br>\r\nQuickly, you started running towards the feet of the gigantic girl but even though you were almost sprinting, your tiny legs were barely making progress. When you arrived, you were completely out of breath, but thankfully, the girl was still stood at the aisle - and you infront of her enormous toes! Somehow you had to get her attention!<br>\r\n<br>\r\nThankfully, she was wearing flipflops - you just hoped, she had sensitive feet. With all your might, you raised your armes and started beating on her great toe, again and again. <br>\r\nNothing.<br>\r\nYou started shouting up at her, while continuing beating on her foot.<br>\r\nNothing.<br>\r\nYou became frustrated. Had you come all this way, just to be ignored and unseen? No!<br>\r\nYou took a deep breath - opened your mouth - and strongly bit down onto the girls enormous toe. And suddenly she flincehd!<br>\r\n<br>\r\n\"Ouch!\", the girl shouted, nearly dropping the food she had been looking at. \"What was that?\" <br>\r\nShe leaned over, looking down at her toes and...</span></div></div>",
            "created":1544418000,
            "id":2587984,
            "title":"Go with the hot blonde"
        },
        "1212":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Eat it",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she do with the bug?</span></div></span></div>",
            "created":1567054800,
            "id":2710051,
            "title":"Notices a bug!"
        },
        "12121":{
            "author_id":"bwethe20",
            "author_name":"zerozero",
            "choices":[
                "Hear the scream and take a closer look?",
                "Devour you ",
                "Gets interrupted by an employee"
            ],
            "content":"<div class=\"\"><div> <span>The hot blonde looks down at you in disgust, believing that you are nothing more than an insignificant ant. She hated bugs however, ever since she was a little kid, she had found them to taste delicious.<br>\r\n<br>\r\nGlancing around the isles to see if anyone was watching, she then reaches down and pinches you between your legs. The force of her fingers shatters the bones in your legs causing you to scream in pain. <br>\r\n<br>\r\nLifting you up to her mouth does she...</span></div></div>",
            "created":1567141200,
            "id":2710911,
            "title":"Eat it"
        },
        "121212":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "Taking the easy way out",
                "Being patient for your master",
                "An unexpected ally",
                "Blonde girl’s POV",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes widened as she opened up her mouth. You didn’t know what was worse: the fact that you were about to be eaten or the fact that she was about to swallow a bug on her own free will. You screamed as she placed you onto her tongue and pulled you inside.<br>\r\n<br>\r\nAs the amount of darkness grew, so did your fear. You quickly became covered in saliva, making it harder to move, not that you could anyways with your broken legs. Within a moment, the giantess swallowed sending you down her throat.<br>\r\n<br>\r\nIt didn’t take long for you to end up inside her belly. You ended landing on a piece of bread floating in the stomach acids. You looked around, trembling. You became her prey and had been sent to the prison for food, a place where the sun never shined. You could see pieces of digested food along with a couple of other insects she had captured. You slammed your fist down on your platform.<br>\r\n<br>\r\n“I want to go home! I want my family!” You yelled at the brink of tears. With your legs broken and no visible way out, you didn’t know what to do.<br>\r\n<br>\r\nOption 1: You decided to surrender yourself to her. You plunged head first into the stomach acids and let her body digest you.<br>\r\n<br>\r\nOption 2: You decided to wait patiently. Eventually, move food traveled down into her stomach, giving you something to eat and more platform to stand on.<br>\r\n<br>\r\nOption 3: Before you could react, a tiny boy suddenly approached from behind you. He had also been shrunken down and swallowed up.</span></div></div>",
            "created":1588658940,
            "id":2830307,
            "title":"An unfair fight"
        },
        "123":{
            "author_id":"cobragirl12143",
            "author_name":"Cobragirl13143",
            "choices":[
                "You land on the baby",
                "You land on one of the girls",
                "You hit a guy and fall in his pocket"
            ],
            "content":"<div class=\"\"><div> <span>You decide a family would be best, after all, at least one of them had to think bugs were cool or whatever. You rush over towards them and climb onto the oldest girl's foot. She notices almost immediately, you find, as she let's out a piercing shriek and kicks her foot, sending you flying.</span></div></div>",
            "created":1473310800,
            "id":2207520,
            "title":"The mom and daughters"
        },
        "1232":{
            "author_id":"orr4eva",
            "author_name":"4eva",
            "choices":[
                "The older daughter. ",
                "The mom.",
                "The six year old daughter."
            ],
            "content":"<div class=\"\"><div> <span>First you had to climb up the young teen's tan sandal sole which was easy enough because it is thin and therefore only a little taller than you are. After pulling yourself up, you were face to face with her gargantuan toes, her big toe in particular large enough to crush a barn.  It was easily an intimidating sight and you couldn't help but feel like an ant as you approached the massive appendages and tried to tap the girl's toes but she did not bother to look down as it appeared you were too small to be felt. You would have to climb up this colossus. <br>\r\n<br>\r\nYou simply climbed up the skin between her toes. It's a good thing the girl was relatively clean because the smell wasn't necessarily unpleasant but it definitely was there, an aroma of sweat and soap mixed together. Then you were on top of her foot, you looked back to see the girl flex her toes lazily, a movement that could have crushed you flat earlier. Her red pained nails gleamed from the store lights miles above. Now you turned your gaze ahead of you, through the slope of pale skin lined with green veins. You could feel the warmth of her skin below you radiating upwards as you trekked forward. As you got further along the top of her foot, you stared up at her long smooth legs and started to wonder how you would even be able to climb this girl?<br>\r\n<br>\r\nWhile you were walking, the young teen felt the slightest sensation on top of her foot. She looked down to investigate only to see a teeny tiny ant on her foot. Or at least what she thought was an ant or some kind of bug. How would she ever guess that a person could possibly shrink? Especially when she is looking from so far above. She hates bugs so she screams first and then kicks her foot up to try to make it depart her foot. It works.<br>\r\n<br>\r\nFirst the scream was so loud and its sound waves echoed ferociously into your ears forcing you to cover them and then the kick occurred. You were knocked into the sky like dust and you then screamed and flailed your arms about waiting any moment to hit the ground in a splatter but instead you land on....</span></div></div>",
            "created":1473310800,
            "id":2207534,
            "title":"What Goes Up..."
        },
        "12322":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "inside the bra, sweaty",
                "inside the bag, messy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You fly straight into the girls' mother, but where.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1473310800,
            "id":2207733,
            "title":"The mom."
        },
        "12323":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Hold on tight! ",
                "Let go now! "
            ],
            "content":"<div class=\"\"><div> <span>You sail through the air for what feels like miles before crashing into a massive purple wall. Panicked but relieved, you grip onto the thick material. Looking upwards you can see a mess of curly red hair and the face of this family’s youngest daughter. You’ve landed on the upper part of her thin but youthfully pudgy stomach. She didn’t seem to notice the impact. You sigh, looking down at the distant ground. The girl’s bare legs stretch from a white skirt into the distance. Her pink sandal clad feet seem miles away. Apparently her shirt was too small as you can also see the pale exposed skin of her stomach. Her loud, vibrating voice hums a tune that she’s moving to. The movement is too much. Her constant swaying breaks your grip before you can even call out. Sliding down the slight slope, you desperately claw at the fabric. The end of her shirt quickly approaches and passes. But instead of falling to your doom, the giant girl unknowingly catches within her navel.<br>\r\n<br>\r\nYou land with a tiny sized thud in an alien landscape. Getting to your feet is a struggle. Your joints crack and body aches painfully. Hopefully nothing was broken. You want to lay down, but you know you can’t stay for long. You examine your surroundings, knowing that you’re now inside the young girl’s navel. Who knew a belly button would save your life? It was darker than the immediate outside. The air is warm and slightly humid, with a slight natural body odor to it. The space in here seemed large enough to hold a house. The landscape was comprised of ridges and folds and her skin felt rough and wrinkly. You stumble while trying to walk, grimacing. The girl was still dancing around. How hadn’t she noticed you? Gurgling noises boomed around you, coming from the girl’s body. Likely food digesting deep inside her belly. While distracted, a shadow quickly covers you. <br>\r\n<br>\r\nSuddenly you see a gigantic thumb heading right towards you! Must’ve accidentally tickled her! You grip the skin folds tightly, but nothing could prepare you for this. Her thumb enters, causing everything to go crazy! Your world darkens as the thumb hits you like a truck. Her huge digit drags you back and forth across the wrinkled skin. She unwittingly grinds you into her smothering, soft flesh. Her thumb stops and simply presses you deep into her squishy belly button. You scream in pain helplessly for what feels like an eternity. Her stomach’s rumbling drowns out your pleas.<br>\r\n<br>\r\nFinally her merciless thumb pulls away with you stuck to its surface. You fly towards her face at dizzying speed, coming free. Her mouth opens to accept her thumb. Your eyes go wide and your mind races. Do you hold on and possibly get put in her mouth or jump to hopefully reach her legs? </span></div></div>",
            "created":1583470800,
            "id":2797411,
            "title":"Tummy Troubles "
        },
        "123231":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "A cup about to pour into her mouth!",
                "Her mother’s lips coming in for a kiss! "
            ],
            "content":"<div class=\"\"><div> <span>You hold on, despite your assumptions. And you were right. The young girl was going to suck her thumb. You quickly enter the dark, dank cave of her mouth. Saliva coated the digit’s surface and you were sucked off of it onto a valley of a tongue. You were surrounded by building sized teeth, many of them crooked or missing because of the girl’s young age. Her spit was sweet and sticky, like she’d been eating candy. After a short while of sucking, the thumb pulled out, leaving you imprisoned inside this mouth. The tongue shifts and you quickly gaze at her throat, a dark tunnel. You had to stay away from there no matter what. You had to escape from here. How had the girl still not noticed you? You were moving around on her tongue! Suddenly a voice boomed around you, shocking you... <br>\r\n<br>\r\n“Mommy, can I have a drink?” Oh no! “Sure sweetie.” You heard the mother say in a muffled voice. Suddenly the colossal lips opened up, filling the chamber with light. Outside you see... </span></div></div>",
            "created":1583470800,
            "id":2797616,
            "title":"Trapped on a Tongue"
        },
        "1232311":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>To your dismay, there’s the cup. You think to run, but where? This place is a death trap. You run towards the towering teeth, hoping to avoid the incoming waterfall. Once you’ve made it, you crouch down on the squishy gums of where a tooth was missing. A torrent of juice rushes into the girl’s open mouth, getting gulped down the gaping throat. You’re safe for the first few seconds, but eventually there is just too much juice and saliva. Washed away, your body swishes around the whole of the mouth, rubbing against teeth, cheeks, and tongue. You approach the girl’s throat and watch as her uvula comes and goes. In an instant you flow down her throat, deep into her body, screaming all the way. You end up splashing down inside her stomach, just like the drink or any other food. Her belly is cavernous and swampy, full of digesting juice and candy. This is the end. In defiance you yell and bang on the slimy, fleshy, pink walls. But it’s useless. The girl doesn’t even feel anything. You hear loud groans and gurgles as the digestive process takes over, churning it’s contents into a thick soup. And that includes you. Digested by a six year old girl’s stomach, never to be seen again. No one ever figured out what happened to you. Your disappearance would go on to baffle the world. </span></div></div>",
            "created":1583470800,
            "id":2797623,
            "title":"Down the hatch! "
        },
        "1232312":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>An even bigger pair of lips moved towards you. The mother coming in for a kiss! They were plump and covered in red lipstick. Her teeth were perfectly shaped and pearly white. Cool, minty breath blew in from outside. You glimpse a uvula glistening with saliva in the darkness. There was no where to run. No where to escape. You run to the edge of the six year old girl’s tongue. Maybe you could hide under it. But it’s too late. Both their lips meet, squishing against each other. <br>\r\n<br>\r\nThe impact knocks you down, but the suction picks you up. A loud puckering noise fills the air as their kiss tightens. The girl’s sweet, sticky saliva flows in a current, carrying you out of her mouth and into her mother’s. You’re once again deposited on the vast surface of a tongue, this time in a much larger mouth. <br>\r\n<br>\r\n“Honey, were you eating candy again?” The mother’s now booming voice asks. “No...” responds the daughter meekly. The mother seems doubtful. “We’ll see about that!” <br>\r\n<br>\r\nSuddenly the lips meet again, this time much more roughly. The mother’s tongue shoots inside her daughter’s mouth, licking everything and sucking in more saliva. You desperately hold on to it like it’s a bucking bronco. When would your troubles end? The mother finally pulls away with you still inside her mouth. You’re in a lake of the daughter’s own thick spit. <br>\r\n<br>\r\n“Ah-ha! You did have candy! Next time share some with me sweetie.” You watch the daughter move into the distance before the massive lips seal. Knowing that you’re once again on the verge of death, you desperately try to get the mom to notice you. But you’re still stuck in the pool of the young girl’s spit. You can barely move. Suddenly the mouth starts to tilt, hot minty air blowing from the incoming throat. She must’ve really liked the taste of her daughter’s candy flavored saliva: she was about to gulp it down. You and the giant spitball slide along tongue and roll over the edge into the awaiting esophagus. A loud gulping noise confirms your biggest fear. You’ve been swallowed. <br>\r\n<br>\r\n“Mmmm!” the mother’s voice shakes all around you. She’s clearly enjoying her treat. The wad of spit slowly travels deep down into her stomach, plopping down with thick drips. Her belly gurgles, almost like it’s happy as well. Your body is covered in layers of the gooey stuff. You don’t even live to see the digestion, having drowned in drool. </span></div></div>",
            "created":1583626560,
            "id":2798039,
            "title":"Kiss of Death"
        },
        "123232":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Still between her toes. ",
                "Laying on the ground."
            ],
            "content":"<div class=\"\"><div> <span>You quickly release her thumb and make a jump for it. You don’t want to be eaten! Her body flies past as you’re in a free fall. But the girl shifts her leg right into your path. Unprepared, you yell and smash into the fabric of her skirt. You roll down the skirt and fall over it’s edge. This time there is little to save you. You bounce off her knee and roll all the way down her shin. Tree-like leg hairs hit into your body relentlessly. You hit the top of her sandal hard and fall down the sloped pink strap. Her foot lifts and bare toes wiggle, causing further turbulence. You’re deposited directly under them. You look up in fear to see all five of her toes hovering over you threateningly like a giant beast. They lower fast, landing on your poor body. The impact knocks you unconscious and your world goes black. Hours later you wake up... </span></div></div>",
            "created":1583470800,
            "id":2797421,
            "title":"K.O.’d"
        },
        "1232321":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "“A bug!!!”",
                "“A fairy!!!” "
            ],
            "content":"<div class=\"\"><div> <span>You groan in pain, still between your unaware tormentor’s toes. When would all this suffering even end! You realize that the lighting is different. It’s no longer the hard lights of the store, but a soft yellow light on purple walls. Great. Now you’re completely lost. Luckily the toes were no longer covering your tiny body allowing you to stand up. Now you were in the same position as you were before. Standing before some random young girl’s dangerous toes. Hers were slightly smaller than her sister’s but they were clearly still a threat. They looked soft and round. While they were pale, they had a slight pink color to them as well. You could see the ridges of her toe prints winding around in unique patterns. The odor here was less pleasant. More of a strong, natural foot smell than anything else. Thankfully it wasn’t overpowering. <br>\r\n<br>\r\nThey started to flex and wiggle yet again and you knew that you had to run. They began lifting and rubbing against each other, exposing their tops and and unpainted toenails. You didn’t want to get crushed again. Besides, what help would a six year old be to you? She still hadn’t even noticed you! And who knows what she would do with you if she did. You turn around to climb off the platform of her sandal. It looked like a pretty big drop, but you already survived a few of those. As you prepare to jump, your luck disappears again. <br>\r\n<br>\r\nThe girl’s enormous feet move from being flat on the floor to her toes pointing at the ceiling. You powerlessly tumble backwards, away from possible freedom. Once again, you’re at the mercy of this girl’s toes. You land on the webbing between her big and second toes and try to scramble up the top of the sandal. The massive digits clamp onto your waist tight. Furious, you pound on their surface with you minuscule fists. It fails. Out of options, you bite the hard skin of her big toe, filling your mouth with a salty taste. You look to her face and see the girl looking at her foot. She moves closer and her blue eyes go wide. She opens her mouth in shock. Her booming voice fills the air, saying... <br>\r\n</span></div></div>",
            "created":1583470800,
            "id":2797429,
            "title":"Escape Attempt "
        },
        "12323211":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>“Aaaiiigh!” The girl’s scream pierces through the air, hurting you ears. The massive toes that grip you quickly release. Screaming, the girl kicks and rolls around to escape you. You’re stuck on her sandal the whole time until she finally kicks it off. It flies the the air, landing with a massive crash. You fly out and hit the floor hard. Your blurry sight clears to see a massive shadow moving towards you. The girl towers over your tiny broken body. You look up into her eyes, which were full of fear. She thought you were the threat, but in reality she was about to commit a murder. Accepting your fate, you stop moving. Your last view of the world was the sole of a six year old girl’s sandal, crushing you out of existence. </span></div></div>",
            "created":1583470800,
            "id":2797658,
            "title":"A Bug’s Fate"
        },
        "12323212":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Keep talking to her.",
                "Run for it! "
            ],
            "content":"<div class=\"\"><div> <span>“A fairy!!!” Her loud voice exclaims. She laughs excitedly. Her face zooms to your place between her toes at almost frightening speed. You had finally been noticed. But you knew you weren’t safe yet. <br>\r\n<br>\r\n“I’ve always wanted to meet a fairy!” She really thinks your a fairy. Better than her thinking you’re a bug and freaking out. <br>\r\n<br>\r\n“N-no! I’m not a fairy! I’m a human! I’ve been shrunk and I need help! Please let me go!” You shout. You don’t even know if she can hear you. <br>\r\n<br>\r\n“But you are a fairy! Only fairies are as small as you! It’s okay! I won’t tell anyone!” Her face beamed. This was hopeless. <br>\r\n<br>\r\n“Okay, okay. I am a fairy. But I need help! Please let me go! Can you take me to you mom or someone? I want to talk to them!” You gave up and decided to humor her. <br>\r\n<br>\r\n“I knew it! I’ve always wanted my own fairy! We’re gonna be friends!” Her gigantic fingers plucked you from your toe prison. She kicked off her sandals with such strength and speed, causing loud booms. She moves you close to her eye. It’s a wall of a rather beautiful blue framing a shiny black pupil. You can see your reflection, revealing your absolutely tiny form. The finger quickly move and release you on her bare knee cap, which has been brought up to her face. She has a cute face framed by thick curly red hair. In the middle was a button nose smattered with freckles. Her mouth was scarily  big, full of large crooked teeth with some missing. Her humid breath blew from inside and smelled very sweet, like she’d been eating fruit. <br>\r\n<br>\r\n“You’re so small and pretty! Where are you from?” This was ridiculous. You had to find a way to get real help. You could continue talking. She might help if you convince her. She seems sweet and like she wouldn’t hurt you. But what if you get kept as a toy? Looking around at your surroundings, you see that escape would be tough. You could slide down her shin to her now bare feet and run for it. Looking back up at her face, you decide to... </span></div></div>",
            "created":1583470800,
            "id":2797438,
            "title":"A “Fairy” Tale"
        },
        "123232121":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "“I’ll make you a home!”",
                "“You can live on me!” "
            ],
            "content":"<div class=\"\"><div> <span>“I’m from Walmart.” You say, giving in to the giantess. You had to keep her in a good mood, you didn’t want to have to run away from an enormous young girl. For now you had to keep her happy. Hopefully she’d eventually take you to an actual adult who could help you out. You sit down on the rough skin of her kneecap, surrounded by sprouting leg hair. <br>\r\n<br>\r\n“Oooh! I didn’t know that fairies lived at Walmart! That’s so cool! By the way, I’m Magdeline but you can call me Maggie! How come you don’t have wings?” You covered you ears the second she spoke. It felt like she was screaming every word. Saliva flew out as she spoke, splashing you in the gooey and sweet substance. This Maggie wasn’t trying to be rude, but she needed to calm down.<br>\r\n<br>\r\n“Can you speak a little more quietly?” You ask gingerly. Maggie quickly nods, hanging on your every word. “Thanks. I, uh, wasn’t, uh, born with wings. Yeah.” Your little lie couldn’t fool anyone, but it fooled Maggie. You kind of felt bad for stringing her along, but you needed help. “Hey, can I speak to your parents please?” <br>\r\n<br>\r\n“Aww! But we just met! We haven’t played any games yet! I wanna play with you! I thought you would live here now. There’s so much to do! Do you not like me?” Her large eyes began filling up with tears and her lip quivered. You were trying to keep Maggie happy. You didn’t even know what she was like when she’s upset. Once again you were out of luck. <br>\r\n<br>\r\n“Okay! Okay. We can play. Then I need to talk to your parents. Alright?” You’d have to play along if you wanted to get some help. You just hoped that it wouldn’t take that long. Still, you had a bad feeling that this wouldn’t work. <br>\r\n<br>\r\n“Yay! Thank you, thank you, thank you! We’re gonna have sooo much fun!” Her massive fingers scoop you up and and you into the soft skin of her cheek. “Okay! First I’ll give you a home! Than we’ll play together! I could make you a home or you could live on me! That way we’re always together!” You had no intentions of living here. It didn’t matter, she answers for you. <br>\r\n</span></div></div>",
            "created":1583470800,
            "id":2797594,
            "title":"Humoring Her"
        },
        "1232321212":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "“In my hair!” ",
                "“In my mouth!”",
                "“On my feet!” "
            ],
            "content":"<div class=\"\"><div> <span>“You can live on me!” Exclaims Maggie. “We can be together alll the time! It’ll be sooo fun!” This wasn’t what you wanted to hear. You had already nearly died on this young girl’s enormous body. You didn’t want to go through that again. <br>\r\n<br>\r\nYou sputter a quiet “N-no, I’m fine! I-“ You get cut off by the giddy giantess. <br>\r\n<br>\r\n“Aww! I’ll take good care of you! You can live...” </span></div></div>",
            "created":1583470800,
            "id":2797604,
            "title":"Homebody"
        },
        "12323212121":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Huge fingers scratching her scalp, headed for you! ",
                "A giant mite headed right towards you! "
            ],
            "content":"<div class=\"\"><div> <span>“I think my hair is pretty! Do you think it’s pretty too? Maggie’s massive fingers quickly shift you to over her head. Below is a huge pile of curly red hair. If you end up there, you could be lost forever! <br>\r\n<br>\r\n“Wait, wait! Slow down!” You yell in vain. Maggie isn’t even listening to you at this point. She releases her tight grip of your waist and you fall a short distance into an alien forest. Gigantic red hairs twist endlessly into the air, blocking out much of the light. The smell of shampoo fills the air. The skin is smooth with some large flakes of dead skin cells spotting the ground. The wind blows through the “trees” gently. <br>\r\n<br>\r\n“Maggie! Maggie! I’m not ready yet! Come get me!” Your shouts don’t even get a response. Once again, panic fills you. How would you escape this endless tangle? Would you ever escape this girl’s body? A sudden noise grabs your attention. You look over to see... </span></div></div>",
            "created":1583616300,
            "id":2797975,
            "title":"In the jungle..."
        },
        "123232121211":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Stick with the finger. ",
                "Hold on to the hair. "
            ],
            "content":"<div class=\"\"><div> <span>“Maaaggiiiee!!!” You scream, turning and bolting away from the incoming digits. You were now convinced that the young girl was completely stupid. She was going to get you killed. The enormous hairs block your path and hit into you which wastes precious time. Where were you even running? There was no way you would make it! Your foot catches a piece of dandruff and you skid onto the ground. <br>\r\n<br>\r\nThe finger hit you before you can even look up. Your vision goes dark as they press you hard against her scalp. It feels like you’re being pinched to death by a vice grip. You scream in pain without any hope that Maggie would hear you. This was it for you. <br>\r\n<br>\r\nExcept it wasn’t. The finger ceases pushing and pulls out of the vast red forest of hair. The unfortunate thing was that you were stuck under her pointer finger’s nail. Completely wedged. Her hand leaves her head at dizzying speed. It’s good to see the light again, but it doesn’t last long. Her finger heads straight inside one of her huge nostrils.<br>\r\n<br>\r\n“Noo-!!!” Your terrified yell is quickly smothered. The merciless finger scrapes against the rough interior and solid hairs. The more the rubbing continued, the more thick liquid mucus seeped in. You remained trapped under the nail through the nauseating ordeal. The massive object went in and out, in and out of the girl’s moist tunnel. Snot threatened to choke you completely. Luckily a nose hair caught itself under her nail, prying you from your tight prison. What now? Should you stick with the finger and hope for a way out, or should you stay with the nose hair for a hopefully calmer exit? Any option would probably lead to death be it crushing or sneezing. Having accepted your fate, you...</span></div></div>",
            "created":1597895160,
            "id":2888225,
            "title":"Nose Dive"
        },
        "1232321212112":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>The hair seems like a better choice. Knowing Maggie, she’d probably eat the boogers she was picking. Last thing you wanted was to die stuck in snot in a six year old girl’s stomach. Your plan wasn’t much better unfortunately. You’d exit her nose, try to slide down her body again, and hopefully escape. It didn’t work last time and it probably wouldn’t work this time. <br>\r\n<br>\r\nIt didn’t matter. When you went to let go of the giant hair follicle you found you couldn’t. You were completely stuck to it. <br>\r\n<br>\r\n“Come on!” You yell in anger. The mucus had crystallized around your limbs, binding you to the hair like hardened glue. Over the next few hours you tried to get free with no success before finally passing out due to exhaustion. Maggie was asleep now as well. As she slept, she subconsciously swallowed phlegm, phlegm that included you. Neither of you even wake up. You body enters her stomach to be digested alongside her dinner. All traces of your body were completely destroyed. Absorbed for nutrients like everything else inside Maggie’s belly.</span></div></div>",
            "created":1598020380,
            "id":2888992,
            "title":"Sticky Situation "
        },
        "123232121212":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>You scream at the top of your lungs and run for your tiny life. It’s the size of a car compared to you and was equipped with deadly looking mandibles. The bug charges forward at terrifying speed like a tiger chasing its prey, easily maneuvering through the forest of red hairs. It clicked and hissed angrily. Running was absolutely terrible. Dead skin tripped up your feet and the huge hairs blocked your path and slowed you down. You could hear the skittering getting closer. In fact it sounded like it was coming from around you... <br>\r\n<br>\r\nAgainst your better judgment, you look back. At least three mites were now chasing you with more hidden in the jungle of hair. This girl had a lice infestation! Gross! They had you surrounded now, racing each other for a bite of you. They were too fast to run from and you couldn’t out climb them either. Your best hope would be to find Maggie’s hair line and jump for your life. But you were lost deep in the jungle of hair. <br>\r\n<br>\r\nA huge shadow covers your surroundings. A hand! But you’re not being saved. Maggie had unwittingly intervened in the hunt because she felt a tiny itch. Her hand descends on you and your pursuers faster than you can react! Enormous fingers scrape against the hairs and scalp, grinding everything to bits. Still barely conscious, you watch as your broken body and crushed enemies were lifted out of the hair and quickly entered the darkness of Maggie’s mouth. The unaware girl was sucking on her fingers and sealing your fate. You and the lice were gulped down by your unwitting host to your doom inside her belly.</span></div></div>",
            "created":1597928520,
            "id":2888442,
            "title":"Mighty Mites"
        },
        "12323212122":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>“... in my mouth!” Maggie exclaimed. She would kill you! <br>\r\n<br>\r\n“Do not do that! I could diiiieee-...!!!” It was too late. She opened her giant sized maw exposing jagged teeth, a slithering tongue, and the black pit of her throat. <br>\r\n<br>\r\n“Aaaahhh!” She playfully yelled as she tilted her head back and tossed you in the air. You arc miles into the sky before plummeting back down towards the abyss below. <br>\r\n<br>\r\n“NnoOoOOooo...!” You rocketed downwards and quickly entered her mouth you land on the tip of her hanging uvula, dangling precariously above the awaiting throat. You struggled to get a strong grip but its slick surface was coated in saliva. The lips behind you closed, darkening the area. Hot air from her lungs blew around you. The back of her mouth did a slight motion and simply swallowed some excess drool. It was too much and you lost your weak grip on the appendage. This was the point of no return. You tumble straight down the dark tube, the thumping of a heartbeat filling your ears. Then comes the entrance to her stomach.<br>\r\n<br>\r\nYou tumble right on through it and fall to the floor of Maggie’s stomach where chewed up hard candy waited for you. The force of impact was too much for your minuscule body, completely dashing your corpse on the jagged pieces. You never even felt it.</span></div></div>",
            "created":1598027940,
            "id":2889017,
            "title":"Plunging"
        },
        "12323212123":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "choices":[
                "Maggie settles down to play a video game. ",
                "You shrink to microscopic size! "
            ],
            "content":"<div class=\"\"><div> <span>“You can live on my feet!” Not again! You had just escaped from between her toes. They’d probably crush you to a pulp! <br>\r\n<br>\r\n“Wait! How about I live on your windowsill? That would be nice!” You plead with her but it’s too late. Maggie’s finger swing you over to her bare foot. Her toes were pointed towards the ceiling which left the tip of big toe as your “landing pad”. She set you down rather carefully in the area below her toenail. <br>\r\n<br>\r\n“There you go fairy! Your braaaand new home! It’s perfect for a little fairy!” Her movement caused you to fall on your rear. The landscape is wide and rounded with her toe prints winding across the surface. Particles of dirt dotted the landscape. Her toenail stood tall with some specks of dirt stuck beneath it too.<br>\r\n<br>\r\nThe ground shifts below your body suddenly as... </span></div></div>",
            "created":1598029680,
            "id":2889020,
            "title":"Big Toe"
        },
        "123232122":{
            "author_id":"micro.pov",
            "author_name":"Micro.POV",
            "content":"<div class=\"\"><div> <span>Now! You spin around and once again slide down this massive girl’s leg. You have to get out of here now! Her approaching toes quickly wiggle, sending you flying high into the air. Your body hits into the side of her bed hard and fast, sending you tumbling straight downwards. Dazed, you hear booming footsteps and see the girl’s enormous bare feet headed towards you. They step just short of squishing you flat. Their scent fills the air. <br>\r\n<br>\r\n“Fairy! Oh no! Are you okay?” The girl worriedly asks. You look up, knowing you had failed and possibly hurt yourself beyond repair. The towering giantess stands directly over you. She crouches down quickly, causing you to flinch. Her skirt lifts, revealing a set of pink underwear beneath. <br>\r\n<br>\r\nA shadow covers your body as her hand reaches down. Her fingers try to grip you, failing several times due to your minute size. She doesn’t know what she’s doing. By the time she succeeds, she has inadvertently turned you into a red pulp. </span></div></div>",
            "created":1583470800,
            "id":2797664,
            "title":"Making a break for it..."
        },
        "1233":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "Fall in a guy's front pocket",
                "Fall in a guy's back pocket",
                "Fall in a guy's shirt pocket"
            ],
            "content":"<div class=\"\"><div> <span>You begin making your way across the isles, running as fast as you can twist your destination. Finally, you're right at the little girls foot, briefly meaning against the leather bass to catch your breath. After a moment, you assess the foot before you. At first you begin poking out the thick, warm skin, hoping to get the girl's attention. Nothing happens. Then, more boldly, he began punching the living wall a flesh and Bone. Again you received no reaction from the \"little\" girl. Seeing no other option, grab hold of me soft leather strap of her sandal and begin to climb. Thankfully, even with your small size making everything so huge and difficult, you were able to reach the top have the girls foot fairly quickly. Looking up at the girl once again, you see no reaction to your presence. Out of frustration, you begin kicking the top of her foot, then out right jumping; not admitting to yourself that you were currently having a temper tantrum.<br>\r\nUnbeknownst to you, far far above, the little girl felt something tickling her foot. She look down and saw but tiny, little Ant crawling around on her foot; because really, what else could it be? The girl let loose a shrill shriek, reflexively kicking her foot up into the air to get rid of the icky bug.<br>\r\nDown below, stunned by the audio assault by the piercing siren issued from the girl's mouth. Your senses are so overloaded by the sound, that you don't realize you are airborne until you are hurtling through the icy airstreams of the open store. Twisting and tumbling, you have no way of predicting your destination.<br>\r\nSuddenly, you hit a firm fabric wall. The impact stuns you, meeting you to fall down into a dark, fabric covered area. As you hit the bottom, something hard cracks you in the back of the head, leaving you dazed. It takes a few moments clear your head enough to you study your surroundings.</span></div></div>",
            "created":1543813200,
            "id":2585253,
            "title":"You hit a guy and fall in his pocket"
        },
        "12331":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "Doge to the side",
                "Duck under the penny"
            ],
            "content":"<div class=\"\"><div> <span>Looking around, you notice the thing that you hit your head on is actually he said of metal keys. All of them as long as your driveway. Up above, a white strip of light slices through the darkness, allowing you to make-out the blue color of the soft warm walls of fabric. When you shift slightly, you become aware of an object directly beneath you. You look down and see that it is a penny the size of a hot tub. Your size it's you all over again, you're as tall as Abraham Lincoln's freaking head!<br>\r\nThen you hear a booming Rumble overhead. Realize that it has been going on for a while now, you had just been to focused are your immediate surroundings. \"Seriously, dude, it's not my job to do all the shopping. Being a roommate means you have to contribute more, not just pay half the rent...\" the deep masculine voice paused, as if listening to a reply. \"I swear, next time you are doing this, or else I'm going to frigg'n kick you out.\" and with that, came the sound of a sharp click.<br>\r\nA second later, the light above was blocked out by hand holding a cell phone. Once it slid in a few inches, the hand let go in the phone was left free fall into the pocket. You had have a second to move were you would be crushed under the phone. With your options limited, you figured you had two choices...</span></div></div>",
            "created":1543813200,
            "id":2585263,
            "title":"Fall in a guy's front pocket"
        },
        "124":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Yell and jump around",
                "Wait by the skittles",
                "Go into the shoes"
            ],
            "content":"<div class=\"\"><div> <span>As much as it scares you, you've decided upon the punk employee. While she is in a bad mood, she's also the lowest to the ground. While she's crouched down like that she could spot you the easiest. Plus, she's still an on duty employee. Even if she's grouchy she couldn't take it out on you. Right?<br>\r\n<br>\r\nSo you take off as fast as you could. Even though she was only an aisle away, that distance spans miles to your new stature. You were on the track team for years, so making that distance wouldn't be too difficult. But time is also against you. When the employee is finished stocking she would start moving again, making this exhausting journey of about fifteen feet all for nothing. <br>\r\n<br>\r\nSweaty and panting, you finally reached this Goddess of Walmart. While catching your breath you decide to get a better look at this woman. You were right on most parts. She did seem to be in her early twenties, and you notice another piercing, but this one on her ear. On her nearly absent chest read the name-tag \"Anna.\" She was wearing a standard work shirt and tight, black pants. There was an open bag of skittles near her that she took a handful of every now and then. <br>\r\n<br>\r\nWith your heart rate down you stopped breathing through your mouth and used your nose. Then it hit you. The intense smell of feet. You were standing close to her flats and exposed soles to the point you could see the sweat shimmering on her heels. At normal size, you would probably complain about a faint odor. But at the size of an ant...it was incredibly strong. It was like someone had put their feet directly on your face, and you were still a good fifty (to you) feet away! It was practically overwhelming...and a little intoxicating. The smell of sweat was mixing with the leather of her shoes and a hint of soap made a confusing aroma that you weren't sure you hated or loved.<br>\r\n<br>\r\n\"Ugh...I need a break...\" the monolith grumbled. The sound snapped you out of the trance you didn't even know you were in. If you were going to make contact with her, it had to be now. But...How?<br>\r\n<br>\r\nYou never thought about that on your way over, so now you need to figure the hard part out. The simplest way would be to run in front of her and trying to get her attention. Of course that would leave the possibility that she may not even see you. Or mistake you for a bug and crush you.<br>\r\n<br>\r\nAnother option was to wait by the skittles bag. She still had about half the bag left, so if you were to stand at the opening she would have to see you during her next handful. Although that might lead to her eating you if she doesn't notice you. The thought of getting ground up between her teeth passed through your mind and terrified you. <br>\r\n<br>\r\nThe last option...you don't quite want to think about it. You were right next to her well worn shoes, so you could easily limb inside and make contact with her feet. However, that would put you in ground zero from her confusing foot smell. And you'd likely get soaked by her foot sweat. Not to mention that if she doesn't feel it, that'd be it for you. Snuffed out under the foot of a Walmart employee's flats.</span></div></div>",
            "created":1460869200,
            "id":2134661,
            "title":"The grumpy punk employee"
        },
        "1241":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "\"Is that a person?\"",
                "\"Is that a bug?\"",
                "\"Mary? Is that you?\"(Reserved)"
            ],
            "content":"<div class=\"\"><div> <span>There's no way you were going into her shoes, even if you like the smell it sounds pretty stupid when you think about it. If she didn't feel you, her foot would crush you into paste. It was also too dangerous to head into the skittles bag. This giantess was taking in handfuls without even looking, and being digested alive didn't sound too promising. So your best bet would be to simply try to get her attention by making a lot of sound and movements. It was the least likely to work, but it was without a doubt the safest.<br>\r\n<br>\r\nYou make your way into her shadow and gaze upward. She truly looks like a goddess from this position. The light is completely eclipsed by her slender body. The light reflecting off her face reveals a few beads of sweat rolling down her face. Even with a scowl, you can't help but notice that she's quite pretty even with her punk style. She even looks a bit familiar, but that's probably because you frequently visit this store. <br>\r\n<br>\r\nYou move towards the shelves where she's stacking goods and start trying to get her attention. You start off by waving your arms around and jumping up and down. Of course she sees none of this and continues her work. The problem was mainly that she was focused on her work and wasn't looking at the floor. Next idea.<br>\r\n<br>\r\n\"Hey! Down here! Look! Please!\" You yell out. <br>\r\n<br>\r\nOf course this fails as well. Your tiny voice was drowned out by her own grumbling. All of her mumbling about how long she's been working was much more powerful than your own screams. <br>\r\n<br>\r\n\"Oh come on! Can't I have just one break?!\" you cry out. Jut then, another shadow appears just above you. Looking up you notice a falling skittle coming directly towards you! You leap out of the way in time to avoid its initial impact. Looking over you see it roll around a bit before it settles a few feet, to your scale, away from you.<br>\r\n<br>\r\n\"Damn, Angela would kill me if she thinks I'm making a mess...\" Anna said under her breath. She looks down in your direction and swiftly picks up dirty candy. Seeing an opportunity, you start waving your arms and yelling again to try and grab her attention. This time however, a blue eye the size of truck falls upon you. You've done it! She sees you! Her black pupils become smaller as she says...</span></div></div>",
            "created":1462424400,
            "id":2143797,
            "title":"I'm here!"
        },
        "12411":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Before Anna's feet",
                "Inside of Anna's pocket still"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes! I am a human being! Help me please!!\" You cried out. Anna's eyes widen a bit more at the sight of your tiny figure.<br>\r\n<br>\r\n\"Oh my.......\" Anna then looked checked her surroundings briefly before focusing her attention back onto you. She knew there were cameras so she couldn't make it obvious. <br>\r\n<br>\r\n\"Well, looks like I found another one......I will explain it to you later. Now, come with me....\" Anna's mightly hand reaches down to collect you! Its at this point you faint and black out...<br>\r\n<br>\r\nLater, you awake...</span></div></div>",
            "created":1471323600,
            "id":2196634,
            "title":"All anna's now"
        },
        "124111":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Becomes Anna's foot slave",
                "Her 17 year old sister joins in"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh good! You're finally awake!\" Anna boomed in excitement. You cough and gasp as the first thing that comes to your senses is a terrible odor. You can still smell that very intoxicating stench of leather and foot sweat! You are not in the Walmart supermarket anymore but now on a coffee table right before the soles of Anna's flats which are loose on her feet exposing her heels. Anna is still in her uniform, chowing down on a cheeseburger and smiling down upon you as she chews her food.<br>\r\n<br>\r\n\"Oh.....oh god! Why are you doing this?! Please help me!\" You squeak but you are barely audible to the mighty Anna!<br>\r\n<br>\r\n\"I cannot hear a word that comes out your mouth. But I already know what you are trying to ask so I will answer simply. Lets just say that the place I work at was built upon sacred grounds where witchcraft was highly practiced in the day. You obviously believe in a certain god which the spirits do not like. No wonder why so many customers and employees just come and go where I work. They either end up beneath the shoe of somebody, perhaps swept up and thrown away. Not to mention eaten up in that mcdonalds and subway restaurant should they try and seek food. At your size, its almost impossible to see you as a human being. Me, I am an atheist so I am immune to being shrunk unlike you hahaha!\" Anna laughs. You begin to whimper and cry, being a born and raised christian girl, this is the worst nightmare that could ever happen!<br>\r\n<br>\r\n\"Now little girl, Its very rare I ever have a tiny woman before my feet. But that doesn't mean I am going to make any exceptions. Now, I am going to kick these flats off and I want you to worship my feet. Kiss them, lick them, sniff them, cum to them. these feetsies need love. Now, brace yourself little woman.\" Anna said as she prepares to remove her flats..</span></div></div>",
            "created":1475384400,
            "id":2217769,
            "title":"Before Anna's feet"
        },
        "1241111":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "You continue to worship Anna's feet!",
                "Anna decides to put you in her flats!",
                "You bite Anna's foot in retaliation! Uhoh.."
            ],
            "content":"<div class=\"\"><div> <span>Anna lets her flats fall off her feet, revealing her sweaty, stinky, slightly grimy, size 8 soles before you!<br>\r\n<br>\r\n\"EEEEEEWWWWWWWW!!!\" You cry out and gag, cupping your hands over your nose! Anna laughs as she waves her feet in front of you, flexing her toes.<br>\r\n<br>\r\n\"Yeah I am sure my feet must smell pretty bad. I have worn these flats for almost 2 years. Ya know, Out and about occasions, work, oh yeah, I even wore these bad girls last summer when me and my girlfriends went to death valley for a few days. Cool huh?\" Anna said, smiling evily.<br>\r\n<br>\r\n\"Worship my feet little woman, or else I will crush you!\" Anna commands! You whimper and began to rub her heel, the skin is tough, but does yield slightly to the touch.<br>\r\n<br>\r\n\"Doing good! Ahhhhh....never thought I would have an ant sized girl, cowering before my feet after work. How do my feet look actually? I just got a pedicure a couple days ago so hopefully they still look lovely. At least lovely enough for a pathetic little girl like you to serve, hahaha!\" Anna laughs!</span></div></div>",
            "created":1556082000,
            "id":2649448,
            "title":"Anna's soles"
        },
        "1241112":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Libby and Anna smother you between their feet",
                "Libby wants you inside her work shoe"
            ],
            "content":"<div class=\"\"><div> <span>Just then, the front door to Anna's house opens and slams shut. Anna looks over her shoulder and sees her little 17 year old sister, Libby, entering the house. Libby just got off work and is wearing some sort of fast food uniform from what you can tell. <br>\r\n<br>\r\n\"Damnit Libby I told you not to slam that door! Seriously I hate that!!\" Anna exclaims. <br>\r\n<br>\r\n\"Well sorry Anna I keep forgetting these stupid doors are self closing! God!\" Libby replys, taking a seat on the sofa next to Anna. Libby spots the tiny woman on the coffee table and smiles.<br>\r\n<br>\r\n\"So.....what do we have here?\" Libby asked Anna, kicking up her nasty, greasy, black non-slip leather shoes before your tiny body!<br>\r\n<br>\r\n\"Just some tiny little cunt. I was hoping it would be another guy. But I guess we have a tiny woman to worship our feet...\" Anna says, kicking off her flats revealing her smelly soles also!<br>\r\n<br>\r\n\"Oh goodie! Well, ready to smell my feet to? Because these shoes are coming off hehehe!\" Libby laughs and slides her feet out of her work shoes. Immediately, a powerful stench assaults your nostrils! You gag as Libbys black sweat soaked socked feet tower before you now! <br>\r\n</span></div></div>",
            "created":1475730000,
            "id":2219552,
            "title":"Her 17 year old sister joins in"
        },
        "12411121":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "Anna lets her have you",
                "Anna keeps you to herself. "
            ],
            "content":"<div class=\"\"><div> <span>Anna grins as Libby exposes her gross, nearly sopping wet feet. She pushes you with her toe, and you stumble towards Libby's socked foot. Just touching it soaks your skin in sweat. Before you can groan in disgust, Libby lowers her socked foot down on you. You were smothered under the wet fabric, and squirmed in horror as it felt like you were drowning.  You took in deep breaths through the wet fabric, despite the awful stench.  She was waterboarding you with her sock!  After a few minutes of this, she lifts her foot. You lay looking defeated, mentally destroyed after being literally tortured by this young girl.  Your repreive doesn't last long, though, as her other foot, which had the sock removed, came down on you. You were pressed against the ball of her slimy, sweaty foot, forced to breath in her wretched stink. The foot then lifted, and you were lifted with it!  The sweat and dirt made you cling to her foot.  \"Hey Anna, high five for bringing home another tiny!\"  Anna grinned, and the two of them pushed their feet together. You were sandwiched between two dirty feet as they wiggled their toes against each other's foot. \"Think I can keep this one?  Since its not a boy I mean?\" Libby asked pleadingly.  You were barely able to hear Anna's response.  </span></div></div>",
            "created":1491886800,
            "id":2303498,
            "title":"Between a Sole and a Gross Place"
        },
        "124111211":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Libby shoves you between her toes.",
                "Libby dangles you over her open mouth."
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah sure, keep her. Make her your slave. You can do whatever you want with her I do not care. Tiny women just do not interest me.\" Anna said while cycling thru the channels with the remote. Libby squeals in excitement then proceeded to grab her purse and work shoes.<br>\r\n<br>\r\n\"Thank you, Anna!\" Libby said before heading upstairs to her bedroom. Libby then shuts the door behind her and carefully sets you down inside her disgusting, sweaty, slip proof leather work sneaker! You immediately gag and pull your shirt over your nose in an attempt to block some of the odor!<br>\r\n<br>\r\n\"Hang tight little woman, I am going to change and then we are going to have a lot of fun!\" Libby said. You cringe as Libby begins to remove her work uniform outfit starting with her shirt. She's just a tad chubby. Not fat by all means but her belly is jiggly and slightly overlaps over her belt. She works at Mcdonalds and obviously eats that disgusting crap for food often. As she proceeds to remove her pants, you briefly observe the inside of your shoe prison. It looks just as disgusting as it smells.<br>\r\n<br>\r\n\"Eeeeww....\" You groan in disgust. Once Libby is changed and comfortable, she grabs the shoe you are in and peers inside.<br>\r\n<br>\r\n\"Having fun in there? It smells nice huh? I worked 10 hours in these bad girls today. Do you want to spend the night inside of these? No? Thats what I thought! Hahaha!\" Libby roared in laughter before pinching you out of your disgusting prison.<br>\r\n<br>\r\n\"I've got better plans for you...\"</span></div></div>",
            "created":1492232400,
            "id":2305440,
            "title":"All Libby's"
        },
        "1241112111":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You obey",
                "You refuse"
            ],
            "content":"<div class=\"\"><div> <span>\"You probably can't imagine how excited I am, after seeing Anna breaking all those tinies she brings home from work, I finally have one of my own!\" Libby giggled as she held you between her two fingers and looked over you. Shw had stripped down to just her bra and panties. As she lifted her arm you could smell her horrific body odor. Well, first of all, tinies don't need clothes,\" Libby used her other hand to tear off your garments, leaving you naked and feeling exposed. \"Now, you wait in here while I take off these gross socks.\"  <br>\r\n<br>\r\nShe dangled you behind her and pulled on the worn elastic of her panties. One thing you noticed as she dropped you down was the streak mark on the back, which you landed on.  The elastic stretched under you like a trampoline and launched you into the top of her crack as you felt her shifting around. There was sticky sweat all around you, your confines smelled of ass and musk. You were startin to realize that if you didn't escape soon, this would become a living Hell. <br>\r\n<br>\r\nAt that moment Libby's fingers reached towards you again, pulling you out of your smelly prison.  \"First things first, I am going to need to use you to get the lint out from my toes,\" Libby told you.  She brought your tiny form closer to her feet, and then gripped your head and feet between the thumb and forefinger of both hands, holding you horizontally. You cried out as you neared her bare feet, and your body was wedged between the big and second toe of her right foot. The smell was wretched here, and you choked back bile that had worked its way into your mouth. She rubbed your naked body against her pudgy, greasy toes.  Sopping wet, warm lint was pushed around by your body, often getting caught under your breasts before getting pushed out of the toe crevice. Salty sweat got into your eyes and mouth, making you want to throw up again.  <br>\r\n<br>\r\n\"One down, nine to go,\" Libby said cheerfully as you were moved to the next, narrower section of her toes. This continued for 15 minutes, but it felt like hours of torment for you. She went over each one a second time, claiming that she wanted to be thorough. Finally you were placed on the bed by her rancid feet.  \"Well, that was a good start, next let's see if you're willing to serve me of your own free will. I want you to lick as much of my feet as you can reach. I haven't had much time to bathe recently, so they're pretty nasty!\" She wiggled her toes, and balls of lint knocked loose by your body fell to the bed around you like squishy boulders. </span></div></div>",
            "created":1492232400,
            "id":2305612,
            "title":"Toe Floss"
        },
        "12411122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "I'll wear him today, and you can tomorrow!\"",
                "I'll wear him till the end of my next shift, and then you can wear him!\""
            ],
            "content":"<div class=\"\"><div> <span>Libby picked you up.<br>\r\n<br>\r\n\"AHH! Put me down! Where are you going to take me!\" You could see her hand moving over her shoe, and then descending towards it. \"NOO!\" You cried, and kicked your legs frantically, which in hindsight was not useful; even if you could get free, you would've fallen in the shoe anyway! The smell got continuously worse as you neared it.<br>\r\n<br>\r\n\"There we go!\" Libby said as she dropped you into the shoe. You immediately got to the heel and started jumping, trying to get out.     \"Oh my god!\" Libby laughed, with Anna grinning over her shoulder. \"Look at him!\"<br>\r\n<br>\r\n\"It seems he doesn't like it, Libby!\" Anna said, barely containing her laughter.<br>\r\n<br>\r\n\"Would you?\" Libby laughed, then said \"what are you trying? Even if you get out, me or Anna will just put you back in there!\" After you stopped wasting energy, Libby said \"now you just lie back while I wear you as my new insole in my shoe!\" Her barefoot entered the shoe, covering you with its sweaty stink. <br>\r\n<br>\r\n\"Hey, wait, I wanna try him too!\" <br>\r\n<br>\r\n\"Okay,\" said Libby, \"...</span></div></div>",
            "created":1525496400,
            "id":2488940,
            "title":"Libby wants you inside her work shoe"
        },
        "124111221":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "Libby goes on her lunch break",
                "You try to climb out of Libby's shoe"
            ],
            "content":"<div class=\"\"><div> <span>((I think the victim is a female! Just gonna stay on track with the story branch!))<br>\r\n<br>\r\nLibby crosses her leg, wiggling her toes within her worn, dirty, black, size 10 \"Tredsafe\" brand non-slip shoes that resemble VANS slip ons. <br>\r\n<br>\r\n\"Yeah...I think I will take her to work with me today...\" Libby says, slipping her socked foot back out of that dreaded used safety sneaker that she has worn for almost 6 months! Libby is in her McDonalds uniform and ready to goto work. She raises the sneaker you are in and brings it up to her face, taking a whiff in the process.<br>\r\n<br>\r\n\"Yuck....you are gonna have a bad time in there, missy. These fucking cheap ass shoes stink! So get comfortable and try not to get squished. That other tiny person I found last month...well, he didnt fair too well inside...\" Libby mentions. Drenched in both your own sweat and Libby's foot sweat, you turn your head back to the toe section of Libby's shoe and see a skeletal human arm hanging out of the pile of sock lint just beyond the 5 perfectly rounded toe imprints on the insole.<br>\r\n<br>\r\n\"No! Please!!! let me out!! nooo!!!\" you scream as Libby's socked foot enters the shoe, knocking you back into the toe section and sealing you in total darkness!<br>\r\n<br>\r\n\"So your shift starts at 1 again, Anna?\" Libby says, grabbing her keys.<br>\r\n<br>\r\n\"Yeah! I will stop by for lunch.\" Anna said, drinking her coffee. Libby heads out the door and sits in her volkswagon beetle. Its a stick shift, and you are trapped in her left shoe to make matters worse. Libby stomps the clutch as she shifts gears. Inside the shoe, you are jostled around as you cling to the fibers of her sock, trying not to end up under her toes or the ball of her foot which would definitely mean instant death.<br>\r\n<br>\r\n30 minutes later, Libby arrives at work. She walks inside, clocks in, and carries out her duties. About a couple hours into this, you are in a living hell. Your hair, clothing, skin, are soaked in Libbys foot sweat! Plus the smell is just horrendous. You do not know how much more you can take! All you can do is just continue trying to survive! </span></div></div>",
            "created":1583824800,
            "id":2799274,
            "title":"Worn to work"
        },
        "1241112211":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You escape her shoe",
                "You're too afraid to leave in this strange place",
                "Libby decides to tell Tammy about you "
            ],
            "content":"<div class=\"\"><div> <span>Libby wipes her brow as she works up a sweat at work. It had been a non-stop line of customers for hours, and none of them had been the least bit patient or polite. She makes her way to the breakroom with a McDouble a customer had left behind which she claimed, and sat down at the table with two other workers. She slipped her sweaty foot from her shoe wver so slighlty, and as she did her tiny captor had their first breath of fresh air for the first time in hours. <br>\r\n<br>\r\nYou had been in a living Hell, and the cool air conditioning of the break room was nothing short of a godsend for your tortured, sweat-soaked body. As the foot lifted slightly, you clung to the sock, wgich allowed you to see outside of the shoe. Two other sets of black shoes could be seen under the table, though one quickly got up and left as you were freed. <br>\r\n<br>\r\nLibby grinned as one of the coworkers at the table scrunched their nose as they freed their feet. She figured if someone across the table was upset by it, her tiny captive must be in agony. The other person left, leaving her with her friend, Tammy. Who she spent the lunch period talking too. </span></div></div>",
            "created":1588491660,
            "id":2829126,
            "title":"Lunch Break"
        },
        "124112":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Bra",
                "Panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ana takes you out of pocket, looks, and decide to put it in another safe place where</span></div></span></div>",
            "created":1471755600,
            "id":2199144,
            "title":"Inside of Anna's pocket still"
        },
        "12413":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Ask for the locker",
                "Ask to hide on her",
                "Before you decide, another employee comes in!"
            ],
            "content":"<div class=\"\"><div> <span>\"Mary? Mary Wilson? Is that you?\" she asks in shock. You take a hesitant step back at hearing your name. How does this woman know you? While she seems slightly familiar you can't say that you know her. \"And...how did you get so small?! Actually, we can't talk here. My boss would fire me if she saw I was talking to myself.\" <br>\r\n<br>\r\nThe giantess moved her stadium sized hand over to you at speeds you couldn't believe possible, but instead of picking you up she left it on the ground next to you with the palm up. You can take the hint and start to climb up the massive wall of skin. Even the short distance from the floor to her palm was large to your ant sized frame, so you used the ridges of her skin for footholds. When you finally reached her palm, you fell onto your back exhausted. You were a great runner, but a lousy climber. <br>\r\n<br>\r\nAnna smiled at you for a moment before slowly closing her fingers, trapping you inside of her fist. She was applying pressure onto you to keep you in place, but not enough to turn you into a bloody mess. All of a sudden, you feel yourself shooting into the sky and swinging around like the world's fastest roller coaster. To Anna, it must have just been her casually walking. <br>\r\n<br>\r\n\"Hey Rita! I'm taking a 10!\" you hear her call out. You actually remember who Rita is, she's an overweight employee who's usually at the register. You always try to avoid her since she's actually pretty stuck up for someone working at Walmart. The swinging quickens as Anna walks faster towards the break room. The heat of her skin, the stale air, and the fast motions are starting to make you feel sick. <br>\r\n<br>\r\nYou hear a door open and close quickly, then you're once again exposed to fresh air as Anna opens her palm and holds you at chest level. You have to remain sitting to the nausea and dizziness caused by the ride over there. You take a quick look around the room and notice that you two are the only ones inside at the moment. It's exactly what you would expect a break room to be, a table with some chairs, a coffee machine, etc. <br>\r\n<br>\r\nThe giant employee pulls herself a chair and carefully tilts her palm, sliding you onto the table. However you have yet to recover from the previous joyride and land painfully on your back. <br>\r\n\"Oops, sorry about that. I should have warned you first\" she says sheepishly. After taking a few moments for the pain to pass, you sit up and look the older woman in the eye. You can't quite put your finger on it, but you definitely know her...<br>\r\n<br>\r\n\"Um...hello...\" you say nervously. <br>\r\n\"What was that? You need to speak up\" she says while leaning in closer. <br>\r\n\"How about this!\" you shout up to her. This time, she smiles.<br>\r\n\"Yeah, it's faint but I can make out what you're saying.\"<br>\r\n\"I don't want to be rude but...who are you?\" you ask. Anna's face seems frozen for a few seconds, her gaze locked onto you. You begin to fear that you've offended her when she begins to burst out in laughter. <br>\r\n\"Ha! I totally forgot that you haven't seen me with my new hair! Oh my god, you must have freaking out thinking I was some random creepy stalker chick!\" Her laughter booms so loudly that you can feel it rattling your bones. \"Mary, it's me. Annabelle, from high school! I used to be a blonde-\" she didn't even finish her explanation before you ran over and wrapped your arms around her thumb. <br>\r\n<br>\r\n\"Anny!\" you exclaim while squeezing her digit. Annabelle was one of your best friends in high school, but only for one year. You met her as you entered your freshman year, but she was already a senior. You had met her in your Advanced Placement math class. She was the one that introduced you to all your current friends and taught you how to get by in High School. Even after she graduated you hung out with her while she took a year off from school. However, two years ago she moved across the country to go to college and you two started to talk less and less. The last time you had heard from her was months ago. She was calling you tell you she had just been dumped by her long-time girlfriend. Julia. It never bothered you that she was lesbian. Anytime someone got creeped out, thinking she would try to sleep with them she would just say \"Hey, I might be gay but even I have standards!\"<br>\r\n<br>\r\n\"Whoa, easy there tiger! Still the cuddly type, huh?\" she joked. You just squeezed harder on her thumb. Your arms didn't even make it all the way around, so probably hardly felt it. <br>\r\n\"I missed you so much! Why didn't you tell me you were back in town?!\"<br>\r\n\"Ah, well, I kinda lost my phone about a month ago. And remember how you got a new number just before that? I still remember your old one, but I don't have your new one anymore. And before you ask, No, I did not drop out of college. I'm spending the summer home with mom and decided to work here for a little cash. Wait, aren't we forgetting something important here?\"<br>\r\n\"What?\"<br>\r\n\"You. Are. The. Size. Of. A. Bug.\" she emphasized. <br>\r\n\"Oh yeah...\" you say, releasing her finger. <br>\r\n\"How did this happen?!\" <br>\r\n\"To be honest, I have no idea. Mom had sent me over here to pick up some paper towels, next thing I know I'm naked and microscopic!\" <br>\r\n\"Hm...listen, we might want to keep you a secret for now.\"<br>\r\n\"Why?\"<br>\r\n\"Have you ever seen the movies where the government hunts down innocent aliens or mutants to try and dissect them?'<br>\r\n\"Yeah...\"<br>\r\n\"Who's to say they won't try the same thing on you? Maybe it would be a good idea to hide you away. I can take you back to your house after my shift, but before that I want to hide you.\" <br>\r\nAdrenaline started coursing through your veins. The thought of people knowing you're a person and still trying to hurt you had never occurred to you before. But what if that's just paranoia? You could try going to a regular hospital to see if they know anything. Or to the media, so the government couldn't take you away without people noticing. Hell, you'd even try a priest right now! <br>\r\n<br>\r\nBut maybe hiding would be the best course of action. You trust your family to keep you safe. You all loved each other, and you have a good relationship with your mother and both your sisters. However, mooching off your relatives while hiding men in black doesn't sound all that great. But another thought came to you. What if you stayed with Anna? You two were great friends, so she would take care of you. And if people really would want to dissect you, she would keep you hidden. Your mother would want to take you to a doctor, which could result in you being on the wrong end of a scalpel. <br>\r\n<br>\r\n\"Hello? Earth to Mary, do you read me Mary?\"<br>\r\n\"Huh? Oh, yeah! I can hide until you finish if you want. I could use the time for thinking anyway...\"<br>\r\n\"Great! Now, I could hide inside of my locker with all my stuff. Or...something more fun...\"<br>\r\n\"Fun?\" you ask nervously. You had a bad feeling about this. <br>\r\n\"I could hide you somewhere on me. You're so small I could you in my pocket, like a little doll. Or my bra. I may have small tits, but to you they would be enormous! Heck, you could even fit in my shoe!\" she once again bursts out in laughter. You realize that she was just teasing you, again. You got a little red in the cheeks, but a thought came to you. Call her out on it. Actually ask her to put you somewhere like that! The turn around would be hilarious! But then again, it might be safer to just take the teasing and go to the locker...</span></div></div>",
            "created":1478408400,
            "id":2233565,
            "title":"\"Mary? Is that you?\"(Reserved)"
        },
        "124132":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "pocket.\"",
                "bra.\"",
                "shoe.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, that does sound fun!\" you exclaim. Anna's laughter cuts out immediately as she stares at you with her mouth open. <br>\r\n\"What?\"<br>\r\n\"You're right, it could be so much fun! Just because I'm stuck at this size doesn't mean I can't enjoy the perks of it! I never even considered all the tight little places I could fit like this...\" you say the last part sensually. Anna's face heats up to a bright red at your comment, clearly not expecting such a flirtatious remark. But then she tries to cover up her shock. She wears a confident smile that clashes with her still glowing face. <br>\r\n\"Is that so? G-good!\" She reaches over and delicately plucks you off the table between two fingers. The warm flesh encloses your waist in a tight grip. It was hard to breathe, but didn't hurt. Anna then stands up to her full height and holds you in front of her face. Her mind seems to be running wild as her face turns a few shades darker red. You can feel the heat coming off in waves from her head. <br>\r\n\"S-s-so...where are you  going t-to hide?\" she asks, both excited and nervous. <br>\r\n<br>\r\nIt takes all your willpower not to burst out laughing. You've never seen her so flustered before. She must be the type that can dish it out, but never take it. What were the choices she gave you again? Her pocket would be the safest choice. You wouldn't worry about getting crushed or smothered in there...but that's boring! Anna would snap out of her current state and you would have to sit in there for hours!<br>\r\n<br>\r\nThere was also something more personal...her underwear. More specifically, her bra. Anna had offered, after-all. It would probably drive her crazy to know that you were inside there. It would be funny to keep her flustered...and you could also mess with her while she works... Plus, it would be really soft. <br>\r\n<br>\r\nThe last option confused you. You had considered going into her shoe earlier, and now it was offered to you again. It was foolish. The inside of her shoe would be hot, sweaty, and the most dangerous of all! So why are still thinking about it...? That smell was so intoxicating...<br>\r\n<br>\r\n\"W-well? Made a decision?\"<br>\r\n\"Yes. I'll hide in your...</span></div></div>",
            "created":1478408400,
            "id":2233574,
            "title":"Called out"
        },
        "1241322":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Anna remembers you, makes sure everything is okay.",
                "Anna forgets you, she was almost suffocating."
            ],
            "content":"<div class=\"\"><div> <span>Mary decides, her bra, must be the safest place. Anna keeps her mouth open, and says: If this is how you want it, it will be, she giggles, without time for you to say something, Anna opens her bra and throws you, you fall, until you hit something soft, everything goes dark When Anna closes and returns to work normally. Although the breasts were small, they were giants for you. It was very hot and sweaty, the smell of sweat was giving her a headache, to make matters worse, it was sticking, and you kneaded.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1478494800,
            "id":2234074,
            "title":"bra.\""
        },
        "12413221":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "He removes Mary from her bra, lets her breathe a little.",
                "She closes the bra cup, lets her friend stifle another time"
            ],
            "content":"<div class=\"\"><div> <span>After a few hours of work, Anna was very sweaty and stinking. then she remembers: Mary!<br>\r\n<br>\r\nMary was crumpled between her bra and her friend's bosom. It was very hot, sweating a lot, you were already almost choking.<br>\r\n<br>\r\nMary tried to move a few times to ask for some air. But in vain, she was stuck in sweat, turned into a tattoo<br>\r\n<br>\r\nAnna then: looks sideways, no one was around and opens the cup of her bra.<br>\r\nAnna looks a little frightened, but then she notices that her friend was trying to move and screaming: she's stuffy! I need to breathe.<br>\r\n<br>\r\nWith a giggle, Anna</span></div></div>",
            "created":1555909200,
            "id":2648567,
            "title":"Anna remembers you, makes sure everything is okay."
        },
        "124132211":{
            "author_id":"randomreader05",
            "author_name":"Foolishreader",
            "choices":[
                "Uh, sure",
                "Absolutely not!"
            ],
            "content":"<div class=\"\"><div> <span>With a giggle, Anna removes Mary from her bra and let's her breath a little. She carefully plucks out her into friend, laying Mary down on her palm. <br>\r\n<br>\r\n\"So, how'd you like it in there?\" Anna asked her tiny friend.<br>\r\n<br>\r\n\"It was... an experience to say the least.\" Mary replied.<br>\r\n<br>\r\n\"I don't suppose that means you want to go back in?\"</span></div></div>",
            "created":1594091040,
            "id":2863089,
            "title":"He removes Mary from her bra, lets her breathe ..."
        },
        "124133":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "wet and smelly (In her mouth)",
                "soft...(In her cleavage)"
            ],
            "content":"<div class=\"\"><div> <span>You don't even have the time to open your mouth to respond when the sound of a door handle opening jerks your attention away. Anna instantly snatches you off the table and holds you within the fleshy confines of her fist while she stares at the door. She put her hand behind her back, hoping to hide you even more from the unwelcome presence. <br>\r\n<br>\r\n\"Anna, hurry it up in here, we need you out on the floor!\" said a feminine voice. You had no way of telling who it was while trapped in your friend's hand, but she knew right away. It was her bitchy manager, Angela. Angela was an obese woman in her 40s, her hair was shoulder length and brown with green eyes. She was also the bane of all the employee's existences. She loved making their jobs harder while she sat on her ass most of the day. The few times she actually got up during the day was to give someone a hard time, like interrupting their break or knocking items off shelves with her fat ass. But the worst part of all was when she yelled at someone. Her bad breath was legendary, her crooked yellow teeth indicating she hates to brush. <br>\r\n<br>\r\nWhile most days she was an annoyance, today she was a horrible problem. \"Angela, I've still got six minutes on my break\" she said through gritted teeth. Wow, she was pissed. <br>\r\n\"I don't want to hear that crap, who told you that you could take a break anyway, huh?!\"<br>\r\n\"The law did when I've been working for four hours.\"<br>\r\n\"Is that so? According to when I clocked you in, you've only been working for one hour...\"<br>\r\n\"What?! You can't do that!\"<br>\r\n\"I. Just. Did. Hey...what are you hiding behind your back?!\" Uh-oh. \"Are you trying to steal something from MY store?!\" she accused. Which was ironic, given all the food and candy she stole everyday. She threatened to fire anyone that tried to tell on her. <br>\r\n<br>\r\nSuddenly, the large woman lunges forward and grabs Anna's arm! She tries to pull away, but Angela is far too strong for the scrawny Anna. <br>\r\n\"Open your hand, let's see what you're stealing...\"<br>\r\n\"NO!\" she screamed. She tried to pull her arm away, but the woman's grip was rock solid. Using her free hand, she started trying to pry open her fist. <br>\r\n\"Oh you are SO FIRED FOR THIS!\" she yelled. A blast of Angela's rotten breath caused her to gag, loosening her grip! Her obese fingers slowly started to open Anna's bony fist. <br>\r\n'I can't let Angela find Mary...there's no telling what she would do to her! Only one thing to do then...I can always try to find her later...' she thought. <br>\r\n<br>\r\nDuring this entire ordeal, you only heard muffled screams and felt violent jerks from outside your prison. You have no idea what's going on until you see a fat finger worm its way into the fist next to you and slowly pry open Anna's hand. Someone was trying to get to you! But Anna did something completely unexpected, she opened her hand all the way and jerked her arm with enough force to send you flying! The sheer G-force was about to knock you out, and your last conscious thought was about how you were flying towards a fat woman...<br>\r\n<br>\r\n\"Aha!\" Angela exclaimed...only to find that Anna's hand was empty! \"What the hell is this?!\"<br>\r\n\"I never said I was hiding anything\" Anna responded defiantly. Angela's face heated up to a dark red at the humiliation of being tricked by some punk kid. She grabbed her radio and practically screamed into it. <br>\r\n\"Al, break room, NOW!\" Less than a minute later, a security guard came in. \"Al, take this FORMER-employee out of my store. She isn't allowed to even step foot in here again!\" <br>\r\n\"Yes ma'am...\" he said reluctantly. Anna didn't resist when Al put his hand on her shoulder and egan guiding her out. But she looked down and saw a bruise begining to from on her arm where Angela had grabbed her. <br>\r\n\"This isn't over you fat pig! I'm going to police after this, you can't treat people like this!\" <br>\r\n'Mary...I promise I'll be back...and I'm sorry...' she thought as Al led her away. <br>\r\n<br>\r\nAngela pulled up a chair and sat down at the break table while letting out a deep sigh. She couldn't actually get in trouble for that, right? All she really needed was a good excuse, like...like... Her train of thought was interrupted by an enormous moan from her huge belly. <br>\r\n\"Hehe, can't think on an empty stomach...\" She said out loud. With a lot of effort, she managed to get up, lock the break room door (there's no way in hell she'll let someone ruin HER 3rd lunch break) and went to the fridge. She noticed a container of pasta marked \"Annabelle.\" Perfect. She placed the container in the microwave for a few minutes and sat back down. The room filled with a horrible odor as she removed her shoes and socks while placing her feet up on the table. <br>\r\n<br>\r\n\"Ah, it's good to be the boss...\"<br>\r\n<br>\r\nMeanwhile, on a smaller scale...<br>\r\n<br>\r\nYou begins to stir awake for the first time after being launched. The last thing you remember was being flung towards a brown haired woman that looked heavy enough to fit a normal sized person in her stomach! <br>\r\n\"Ah, it's good to be the boss...\" you hear. You suddenly begin to realize that you are surrounded by flesh. Everything is dark, but your surroundings are... </span></div></div>",
            "created":1480050000,
            "id":2241741,
            "title":"Busted"
        },
        "1241332":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Angela feels an itch in her chest, pushing Mary further into the bottom, suffoca",
                "Angela goes back to work, grinding Mary with her breasts, kneading it"
            ],
            "content":"<div class=\"\"><div> <span>You look up, seeing a little light, just your face was out, your whole body was buried in a lot of dough, a smell of very strong sweat, is when you realize that is between the fat breasts, mary no could move, she was stuck, stuck in the giant breasts of angela, good that her head was out, could breathe, but the smell of sweat was very strong, leaving you with a little headache, and worse, a A drop of sweat began to flow toward his head, Mary screams: Noo !!! Help!!! Impossible to hear, it is when the sweat arrives on your face, Mary is forced to drink, the salty sweat of angela.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1480050000,
            "id":2241789,
            "title":"soft...(In her cleavage)"
        },
        "1242":{
            "author_id":"dsteward85",
            "author_name":"Stormeagle",
            "choices":[
                "The girls manager approaches her.",
                "You are eaten."
            ],
            "content":"<div class=\"\"><div> <span>Trying to call out to her would probably be a waste of energy as the giant employee probably couldn't hear you at this size. And you really do not want to get any closer than you have to near her feet and shoes. The smell only reminds you of your 14 year old sister who would kick off her track shoes in your room and stink it up!<br>\r\n<br>\r\nYou can hear chatter coming from the girls 2 way radio attached to her belt as she grumbles even more under her breath. Something about parents needing to keep their kids in check, how she will never have children of her own, the people i work with are retards etc. You proceeded over to the bag of candy and the smell of sugar fills yours lungs! Such a welcoming treat considering prior to this all you were smelling was the feet of the giant woman consuming the candy.<br>\r\n<br>\r\n\"I hope this works...\" Was all you thought to yourself as you entered the bag of skittles candy. Up ahead, you see all the colorful round discs piled upon each other before you. Such an amazing beautiful site indeed. The macro world sure shares its many wonders just as it does dangers. Suddenly, your stomach flops as you feel the entire bag being lifted and tilted downward! Before you can even scream, the giant employee dumps a small handful of skittles in the palm of her hand. Unfortunately that also included you! Your lower body is pinned beneath a car sized candy piece as you are brought up to the girls face, her mouth opening to accept the contents in her hand.<br>\r\n<br>\r\n\"Nooooo!!!\" You scream as you finally realize that this must of been the worst idea ever in an attempt to get her attention!</span></div></div>",
            "created":1461819600,
            "id":2140337,
            "title":"Candy girl"
        },
        "12421":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Spit them out!",
                "Gulp!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the girl puts you and the skittles in her mouth, her manager walks over. “Eating on the job?! How dare you!” And takes the rest of her skittles. She then notices that there are still skittles in the employees mouth</span></div></span></div>",
            "created":1559538000,
            "id":2668740,
            "title":"The girls manager approaches her."
        },
        "124212":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the manager talks to her employee, the employee gulped, taking you and the skittles she was eating down the esophagus into the stomach. It was a wide cave, and there was a pool of stomach acid. Does the acid hurt?</span></div></span></div>",
            "created":1559538000,
            "id":2668743,
            "title":"Gulp!"
        },
        "1242121":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Taco bell",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The acid does not hurt you as you wade around in it. You can see other stuff that this woman has eaten, and you realize that you need an escape plan. You start thinking about ways to escape. You already know that anything you eat will come back out as Poop, but that would also mean that you were coming out as poop too, so you make this plan B. You could make her vomit, but this could also be a bit of a challenge too. While you are thinking about this, more food starts to come into the stomach. “Must be in her lunch break.” You think. What is she eating?</span></div></div>",
            "created":1559538000,
            "id":2668748,
            "title":"Yes "
        },
        "12421211":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Up",
                "Down"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see part of a Taco shell, and are both excited and worried. Mexican food will probably make her more likely to expel you from her body, but from which end?</span></div></span></div>",
            "created":1559538000,
            "id":2668749,
            "title":"Taco bell"
        },
        "124212112":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Quick ",
                "Not"
            ],
            "content":"<div class=\"\"><div> <span>The woman who had ate you was taking her lunch break ate Taco Bell. She started farting a bit. “Ooh I should not have gone here, Mexican food give me bad gas.” She thought “If that Manager hadn’t taken my skittles, I would not be eating this.” Inside her belly, you feeling a lot of shaking happening, before you and a lot of other stuff in the stomach started to enter through the pyloric shphyncter into the small intestine. Do you continue quickly or not</span></div></div>",
            "created":1559538000,
            "id":2668753,
            "title":"Down"
        },
        "1242121122":{
            "author_id":"ninjezus",
            "author_name":"NederdFox5$",
            "choices":[
                "Plop",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Despite the boost, you still take a long time to come out. You spend a few hours in her small intestine, as you are crowded together with other food along a very bendy and narrow path. In the large intestine, everything smells worse, but you are given more space. You get pushed along with the rest of the poo into the colon, which crams everything together. You start to hear grunts, as she starts to poop. You are pushed out with some logs, but you hold on to the hole, so you don’t immediately fall into the toilet. However a large fart comes. *FRTTTTT...” Does it knock you off her ass</span></div></div>",
            "created":1561525200,
            "id":2679032,
            "title":"*FRRRTTTT*"
        },
        "12422":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "You accidentally head to her throat",
                "You get chewed up"
            ],
            "content":"<div class=\"\"><div> <span>As you are lifted towards this girl's mouth, your screams go unheard.  The last thing you see is the saliva-drenched cavern that is this girls mouth as her hot, humid breath rushed to accept you. Then, darkness. You are thrown about on her tongue, and saliva pools around you as you hear the sound of candy crunching. Desperately you try to work against her powerful tongue to avoid the sounds. You don't want to be crushed to a paste. </span></div></div>",
            "created":1491800400,
            "id":2302586,
            "title":"You are eaten."
        },
        "124221":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "content":"<div class=\"\"><div> <span>Fighting against the current of melting, chewed candy, you manage to get away from the chomping teeth even in the darkness. That victory is short lived, though as the tongue starts to ball you up with spit and masticated Skittles. Suddenly you feel yourself forced into a tube of hot, wet flesh.  You get forced through this tight tube and have to hold your breath or risk drowning in saliva.  In a minute, you find yourself deposited by a sphinter into a slimy area. You are swimming in some kind of thick goo that... is starting to burn!  Screaming as loud as you can, your cries for help go unheard as the punk girl finishes her skittles, dumping more spit and chewed candy on top of you. Before long you pass out and drown. Your body dissolves in the acid, your blood mixing with the artificial dyes as they rush from her stomach into her bowels, where what's left of you is either absorbed or unused to be disposed of at a later date. The young woman would never know her candy ended up containing some speck of nutritional value after all, even as she evacuated you from her bowels the next morning. <br>\r\nTaste the Rainbow. <br>\r\nBecome the Rainbow.</span></div></div>",
            "created":1491800400,
            "id":2302591,
            "title":"Force Fed"
        },
        "1243":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "choices":[
                "She loses her balance and falls backwards",
                "She stands up, squishing you.",
                "She takes you out of her shoe."
            ],
            "content":"<div class=\"\"><div> <span>You decided to approach her foot.  At least if you were to die getting her attention, getting squished seemed preferable to getting eaten, for whatever reason.  You started climbing her flats while she was still crouched down.  her soles towered over you, threatening to come down at a moment's notice.  The smell was overwhelming, and you had to breath through your mouth just to make it more bearable.  You got close to the ball of her foot, knowing just how much weight they were supporting right now.  You could see her wobbling as she kept her balance.  At first you poke her foot, but nothing happened.  Deciding to be more forceful, you begin to punch and even resort to biting her thick, sweaty skin.  Though you regretted doing that, as the foul taste was stuck in her mouth.  This seemed to get a reaction out of her, though, as you heard her mutter something about feeling something on her foot.  You bite down again as hard as you can and... </span></div></div>",
            "created":1492491600,
            "id":2307111,
            "title":"Anna's Foot"
        },
        "12432":{
            "author_id":"iknight",
            "author_name":"Aayla's lover",
            "content":"<div class=\"\"><div> <span>As Anna stood up, you took a step back from the sweaty balls of her foot. You started to try and run to the back of the shoe, but you were too late. Her crushing weight bore down on your tiny body, pushing you against the sweaty surface of her flat as her foot put unimaginable pressure on you... then in seconds it was over. Your body was reduced to a small red smear. Your blood leaked under her grimy toes as she walked around totally unaware that she had ended a life under her foot. </span></div></div>",
            "created":1494824400,
            "id":2319905,
            "title":"Smeared"
        },
        "12433":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "bra",
                "Panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She takes you from the shoe, with open eyes and open mouth she says: but what is it? Before you say anything, the girl hides you inside.</span></div></span></div>",
            "created":1494910800,
            "id":2320595,
            "title":"She takes you out of her shoe."
        },
        "125":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Hide away for now...",
                "Find someone else",
                "Get to security!"
            ],
            "content":"<div class=\"\"><div> <span>\"Nope, there is no way in hell I'm doing this...\" you think out loud. All of these giants would probably crush you into oblivion before they even realized your presence. It would probably be safer to just stay hidden. But you would likely need to find a new hiding place. If someone comes to clean up the aisles after closing you would get swept up.<br>\r\n<br>\r\nBut then again, there are so many people here you could probably just find someone that isn't busy and could find you. However there is still your fear of getting too close and being snuffed out.<br>\r\n<br>\r\nOr...That's it! Your cell phone! If you could find your way to the security office, they would probably have all your clothes and your phone! You could call someone and get real help! Although finding the office and finding your stuff AND not getting killed on the process would be the most difficult option of all.</span></div></div>",
            "created":1460782800,
            "id":2134189,
            "title":"Maybe things will can get better..."
        },
        "1251":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "The food section",
                "The clothing section",
                "The kid's toys"
            ],
            "content":"<div class=\"\"><div> <span>As you thought of a plan to go to the security office and find your phone, you failed to notice a shopper coming up the aisle behind you. A morbidly obese woman moved slowly, casting a shadow over you while distracted. You looked up in time to see the sole of her sneaker over your head! <br>\r\n<br>\r\nYou jumped out of the way just as the enormous shoe smashed into the ground where you were standing. That's when you noticed just how busy it was in the store today...lots of shoppers milling about. And the security office was near the entrance, where the foot traffic is heaviest! <br>\r\n<br>\r\nSo, you changed your plan a bit for now. You couldn't risk getting crushed just yet. It would be smarter to wait until the store calms down before making the trek all the way to the front of the store. And in the meantime, you needed a place to hide. Standing in the middle of the aisle had nearly gotten you crushed right now...<br>\r\n<br>\r\nSo, you looked up and down the aisle a bit before running off. Your bare feet slapping against the tile floor, you raced towards the best hiding place you could think of. Which happened to be...</span></div></div>",
            "created":1595820480,
            "id":2875865,
            "title":"Hide away for now..."
        },
        "1252":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Your Mom",
                "One of your sisters",
                "They leave before you can choose"
            ],
            "content":"<div class=\"\"><div> <span>Cowardice overrules all of your other emotions when confronted by the sheer magnitude of these goddesses. As much as you need help, the people you see right now are all busy with their own business to notice you right now. Or you're pretty sure they'd kill you if they saw you.<br>\r\n<br>\r\nYou sit down on the cold tile floor and wait around for a while. With how busy the store is, these people all move on in a few minutes. Ha, even if you picked someone out of these people they would have left before you even reached them. No one else seems to stop nearby you for more than a few seconds, so you just people watch to take your mind off your situation. <br>\r\n<br>\r\nA lot of people in today are pretty normal, but you can see some of the \"Walmart crowd.\" There are some people that seem like tweekers getting busted busted for shoplifting. Some people were sneaking drinks from a beverage and then replacing it with a new one. A man had fallen asleep on a couch and his daughters were setting up a prank with some whip-cream.<br>\r\n<br>\r\nYou snap back to reality as a bare foot lands directly next to you. You curl up in shock and scream. It was so close you that you could feel the heat coming off it, and smell its sweat. Of course the person above heard none of this and continued on her way. Taking a deep breath you try to ward off the impending heart attack. <br>\r\n\"Jesus Christ...that scared the shit out of me!\" you exclaim. <br>\r\n<br>\r\nThat was a good sign to get going. You had just been sitting in denial for the past hour. You needed someone to help you, so you watch the entrance for anybody more reliable.<br>\r\n<br>\r\nThat's when she walks in, your mother! You could hear the gasps from people all the way over here. You're used to it already, your mom is a knockout after all. Six feet tall, long blonde hair, smooth skin, long slender legs, a huge bust... She may be 40 years old, but you know anybody would gawk at her before you. Curse your dad for giving you his genes... Her outfit really showed off her mature charms. Strap sandals that show her black polish, a long skirt with a slit on the side riding up mid-thigh, a blouse with just enough buttons undone on top. She used to model in her college years, even after having your older sister, Samantha. Her attitude was that of a mother, she can be strict at times, and gave harsh punishment, but really cared for your safety. <br>\r\n<br>\r\nSpeak of the devil, your sisters walk in behind her! First was Samantha, the oldest of you three sisters. She was 21, and was the only one to inherit your mom's looks. Her blonde hair went down to her shoulders. She was wearing tight denim shorts, a black bikini top, and black flip-flops with purple nail polish. Her pretty blue eyes were gazing lazily into her phone. Her attitude was rather aloof, she didn't really care about a whole lot. She was also kind of a bitch. Getting your mother's looks made her incredibly confident and assertive, she loves to be in charge. Despite all this, she does love you and helped you stay decently popular in school. <br>\r\n<br>\r\nFollowing in last was your younger sister, Emily. She was 14 and looked like a younger version of yourself. She shared the short, slender body type you had but was far more athletic. As embarrassing as it is, she could probably kick you ass. While you were all skinny, she was slim with muscle. Her playful attitude has caused you to frequently get mad at her. As much as you bicker, you're her favorite sibling and you wake up most mornings to find her cuddling you. She's wearing athletic shorts, a white tank top, and walking barefoot with bright pink nails with cats drawn on them. You grimace at the memory of her feet smell. <br>\r\n<br>\r\nLuck seems to be smiling further on you as they seem to be coming closer to you! Of course! They probably came because you never came back with the paper towels. Your mother probably thought that you just ran off with the money! That would explain the annoyed look in her eyes...<br>\r\n<br>\r\nAs they come closer, you realize that this is probably the best chance you're going to get help. If even one of them see you, your safety would be guaranteed! They finally reach your aisle and your mom compares prices. Quickly, get one of them to help you!</span></div></div>",
            "created":1462078800,
            "id":2141991,
            "title":"Family first, right?"
        },
        "12521":{
            "author_id":"madhattter86",
            "author_name":"madhattter96",
            "choices":[
                "Your mom sees you",
                "She decides to buy it and is unaware of you"
            ],
            "content":"<div class=\"\"><div> <span>You see your mom shopping and browsing over the shelfs as you get closer she suddenly knocks a clear container off towards you. You think it's a good idea to climb into it to be sure you mom would see you. Your whole world moves as she picks it back up and screws on a small cap. You read the label backwards and it says ehcuod. After a few seconds it snaps it says douche Nd your trapped inside of it! </span></div></div>",
            "created":1564462800,
            "id":2694713,
            "title":"Your Mom"
        }
    },
    "info":{
        "author_id":"bigrich1",
        "author_name":"Bigrich",
        "brief_description":"You shrink while shopping at Walmart! Survive!",
        "created":1396096140,
        "description":"<td align=\"left\" class=\"norm\">You are doing a little evening shopping at your local walmart when you are mysteriously shrunk down to the size of an ant. Will you survive or be stepped on by the giants?</td>",
        "id":1984072,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595857080,
        "modified":1598029680,
        "pretty_title":"Shrunk at Walmart"
    }
}