{
    "chapters":{
        "1":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Misty",
                "Dawn",
                "Iris",
                "May",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> ash gets to control 1 girl  with a stone he finds and he have these 5 in mind Misty,Dawn,Iris,May,and Lyra who should he choose</span></div></span></div>",
            "created":1355893200,
            "id":1491052,
            "title":"choose a girl"
        },
        "11":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Ash have to commmad over her body but Misty can still think",
                "Ash just have to think and Misty does what Ash want",
                "Ash have full control over her  body",
                "Ash have full control over her thoughts",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash decide to go with Misty how much control does he have</span></div></span></div>",
            "created":1356325200,
            "id":1493996,
            "title":"Misty"
        },
        "111":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "take off her shirt ",
                "take off her pants",
                "be a puppet for him use as he want"
            ],
            "content":"<div class=\"\"><div> <span>as ash picks up the stone misty gets a strange glow around her and she unable to move as the glow dims she appears in front of him. ash tell her that she can move only to take her pokeballs and place them at his feet as she do so her pokeballs go to a special pocket in her bag that she cant get to as he look around the forest where the are he decide to look at what all misty pack as he saw sexy undergarments and a lot of food misty thought what is he looking for as he found it a package of sleeping pills he tell  misty you wont need these and told her to</span></div></div>",
            "created":1436263560,
            "id":2004465,
            "title":"Ash have to commmad over her body but Misty can..."
        },
        "112":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Ash figures out his powers and uses them 'Wisely'",
                "Ash is oblivious about his powers and uses them accidentaly",
                "Oh, No Its Team Rocket!"
            ],
            "content":"<div class=\"\"><div> <span>Its been 8 years since Ash started his journey. He was meeting up with Misty in person for the first time in three of them in Viridian city. On the way he was having a battle against A really tuff trainer and finally beat him with a well timed thunder bolt against his garados. \"Congratulations! You beat the strongest trainer you've ever fought before! As a reward take this!\" He handed Ash a stone and was gone like clockwork. \"Huh, that was weird.\" Ash said to himself, then he looked down at the stone. it looked like an evolutionary stone, but where a leaf or sun or something would normally be there was a black spiral. Before this could process in Ash's mind the stone glowed in a light, not unlike that of a pokemon evolving, and vanished. \"And that was weirder.\" Ash thought before he noticed the time. He ran as fast as he could getting to Viridian city half an hour late. Naturally Misty was mad. \"What took you so long!? Eight years and you still hardly grew up, jeez.\" Misty pouted. \"Come on I said I was sorry.\" Ash said just wanting to hurry up and get to doing whatever Misty had planned for today. 'Man, I wish she would just calm down already.' Ash thought. Misty seemed to space out for a moment and then said \"Well I guess your hear now. Come on! We,re going to a bike trail, today. I thought it would help repay your ever standing debt.\" \"Ok, ok. lets go!\" Ash said just happy that Misty did what he wanted for once.</span></div></div>",
            "created":1427259600,
            "id":1954021,
            "title":"Enter: The Stone"
        },
        "113":{
            "author_id":"thewalrusclown",
            "author_name":"thewalrusclown",
            "choices":[
                "love confession and then some rule 34 (I DON'T CARE I SHIP IT)",
                "have Misty put on a repeat \"self grope\"performance, but this time with her butt",
                "go find more girls to \"stone control\""
            ],
            "content":"<div class=\"\"><div> <span>\tas ash picks up the stone misty gets a strange glow around her and she unable to move and she found herself saying \"Because of the power of the stone, you are my  master now, say it and my body will do it irrigarlless of wather I want to or not,\" only to regain her facalties and then screamed \"DEAR SWEET ARCEUS WHAT DID I JUST SAY\"<br>\r\n<br>\r\n\tAsh looked at her with amusment, and said, Alright, lets test this, he wrote something on a peace of paper and told misty \"every time I say now do and say whats on the paper\" he said with a chuckle.  <br>\r\n<br>\r\n\tMisty read it and started saying \"ash ketchum if you have be do this I swear I'll...\"<br>\r\n\t\"NOW\"<br>\r\n\tall of a sudden Misty stopped, took off her suspenders, shirt and bra and then proseded to started to  bouncing her boobs up and down, over and over all the while chanting, <br>\r\n\t\"M my name is Misty, and I like playing with my titties, go and gather a crowd, then watch me bounce them up and down\" <br>\r\n\tafterwords misty stopped and whiel trying to get her close back on she looked at ash with death glare and said \"your lucky your you, otherwise I'd never forgive what you just did, Ash Ketchum\"<br>\r\n<br>\r\n\tAsh spoke up and said \"there is know way that I'm not going to take advantage of this, the temptation's to great and I'll evenuallty give in, I know myself, but I could order you to get a mild endorphen rush every time you obey me so you'll like it instead of feelign compleatly used.\"<br>\r\n\"ever since there is no way out of  this for either of us might as well do it, and ever since I can tell by the look on your face I'm giving you permission, order away with whatever and let's get it over with\"<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1503969180,
            "id":2376348,
            "title":"Ash have full control over her  body"
        },
        "12":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Ash have to commmad over her body but Dawn can still think",
                "Ash just have to think and Dawn does what Ash want",
                "Ash have full control over her  body",
                "Ash have full control over her thoughts",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash decide to go with Dawn how much control does he have <br>\r\n<br>\r\n</span></div></span></div>",
            "created":1356325200,
            "id":1494000,
            "title":"Dawn"
        },
        "125":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Gave her a order to do something humiliating.",
                "gave her an order for a new personality.",
                "order order"
            ],
            "content":"<div class=\"\"><div> <span>In the sinnoh region.<br>\r\nAsh and dawn, Brock had left to take care of something urgent, were walking when Ash noticed a stone in the path.<br>\r\nHe picked it up and immediately it flashed and and ended.<br>\r\n\"What was that?\" Ash asked confused about what happened, as the stone had just disappeared.<br>\r\nAsh turned to Dawn, who was still perfectly still, but as could she her breathing, showing she was alive.<br>\r\nAsh waved his hand in front of her face, she did not react.<br>\r\n\"Come on Dawn talk to me,\"<br>\r\n\"Hello Ash,\" She said with no tone.<br>\r\n\"What is going on?\"<br>\r\n\"I have become your doll. I will do anything you want me too.\"<br>\r\nAsh smiled, he had complete control over her.<br>\r\nSo he.....<br>\r\n</span></div></div>",
            "created":1356411600,
            "id":1494481,
            "title":"Ash have full control over her thoughts and body"
        },
        "1251":{
            "author_id":"skywatch",
            "author_name":"Sky Watch",
            "choices":[
                "Give her her normal personality and have her dressed like this at the next town.",
                "Go all the way, strip her naked with no arguements.",
                "Other humiliating things"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh so you will obey my every command, ok then then do something no normal girl would do. Why don't you take off your skirt..\" Ash ordered, testing his power over her.<br>\r\nDawn took off her skirt with no hesitation.<br>\r\n\"Umm you know what that was so short I think everyone who has met you has seen what's under there already, why don't you strip down to your bra.\" Ash said, still wanting to see if this will still work, and he's curious about how big she is.<br>\r\nAgain Dawn took off all upper clothes till she got to her bra, she has the size of a C maybe but they still look good.<br>\r\n<br>\r\nAsh was blushing from this sight. \"Well ok this thing does affect your body, you also don't mind doing any of this don't you?\" <br>\r\n<br>\r\n\"Nope, honestly it feels right just to listen to you.\" Dawn tells Ash with an informative voice.<br>\r\n<br>\r\n\"We'll now what do I do with you?\" Ash asks himself...<br>\r\n<br>\r\n</span></div></div>",
            "created":1437881700,
            "id":2012500,
            "title":"Gave her a order to do something humiliating."
        },
        "1252":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "The perfect girlfriend",
                "A slave",
                "Bimbo Dawn"
            ],
            "content":"<div class=\"\"><div> <span>\"Well Dawn I think it's time you got a new less annoying personality.\" Ash said with a malevolent grin. \"If only I could think of one...Perhaps some <i>inspiration</i> is needed. strip down to your underwear.\" Dawn dutifully obeyed first taking off her shoes and socks. Then she took off her hat followed by her dress. She stood in all her near naked glory for Ash to enjoy. \"Nice...you could use bigger tits though...\" Ash said absentmindedly. As soon as he said that Dawns breast began to grow. They grew to A nice D-cup ripping off her bra in the process. Ash was shocked \"Holy shit! Um... now get a fantastic ass.\" Dawn's ass followed suit of her breast and grew larger. It strained her panties, not quiet breaking them, and formed a nice peachy shape that outclassed Misty's. Ash was ecstatic \"Alright! This doll thing is really working out. Now I know the perfect personality for you.</span></div></div>",
            "created":1428177660,
            "id":1958765,
            "title":"gave her an order for a new personality."
        },
        "12521":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Time for business",
                "We have to get to the next town"
            ],
            "content":"<div class=\"\"><div> <span>\"Now Dawn,\" Ash said \"When I snap my fingers you will be my girlfriend. You will be loyal, caring, sweet, supportive, and put my needs and happiness above everything else. You will be completely obedient to me and love me unconditionally.\" Ash then snapped his fingers and the now physically improved Dawn blinked a few times and then smiled wide and walked up to Ash and embraced him fully. There tongues played with each other fiercely. When they broke the kiss Dawn said \"I love you, Ash.\" with a sincere grin. Ash said \"I love you to.\" enjoying Dawns new body with how close they were. \"Now...\"</span></div></div>",
            "created":1428209820,
            "id":1959079,
            "title":"The perfect girlfriend"
        },
        "12523":{
            "author_id":"langdon14",
            "author_name":"Langdon ",
            "choices":[
                "Call me master",
                "Now strip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span class=\"chotpink\"></span> You have a small brain </span></div></span></div>",
            "created":1581943620,
            "id":2788581,
            "title":"Bimbo Dawn"
        },
        "1253":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "sex craze girl",
                "want sex with him",
                "another order"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>to strip and act like.....</span></div></span></div>",
            "created":1357707600,
            "id":1505021,
            "title":"order order"
        },
        "13":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Ash have to commmad over her body but Iris can still think  ",
                "Ash just have to think and Iris does what Ash want",
                "Ash have full control over her  body",
                "Ash have full control over her thoughts",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ash decide to go with Iris how much control does he have <br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1356325200,
            "id":1494007,
            "title":"Iris"
        },
        "132":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Ash figures out his new powers",
                "Ash is oblivious about his powers",
                "Oh, No Its Team Rocket!"
            ],
            "content":"<div class=\"\"><div> <span>Ash was returning to Unova after eight years to catch up with Iris. On his way he found a small orange stone, and decided on instinct to put it in his pocket. He didn't know it at the time but the stone was losing its orange color as its power slowly flowed into him. When he met Iris the greeting he got from his old friend was \"Late as always Ash. Will you ever stop being such a kid?\" \"Not as long as I live.\" Ash playfully replied. Iris has developed wonderfully over the years. Though you couldn't really tell because of her baggy shirt she now had a great hour-glass figure and double D-cup breast. She still wore tight pants however so you could definitely tell she had a great ass. Iris giggled a little and then said \"Come on, lets go to my place.\" As he was following Iris Ash thought 'wow she has a nice ass now. I wish she would sway it more when she walked.' Then just like clock work she started doing just that. Almost as though to attract Ash's attention she started sensually move her ass with every step she took. Ash could hardly look away and was almost getting a boner just from the display. \"We're here!\" Iris announced as they arrived at her house. \"Come on lets go inside!\" Iris said happily as she began walking towards her home the same sexy strut in her step as earlier. \"O-Ok.\" Ash said getting a little excited.</span></div></div>",
            "created":1427950800,
            "id":1957786,
            "title":"Ash just has to think and Iris does what Ash wants"
        },
        "1322":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Still oblivious about his powers",
                "Puts 2 and 2 together ",
                "Iris moves in on ash"
            ],
            "content":"<div class=\"\"><div> <span>Getting to Iris’s house ash couldn’t help himself from thinking about her body. Ash thought about her breast “Her breast are so big I wish she would show them off more” and with that Iris told him to wait a moment while she went and changed. When she came out she had on a black bikini top that was clearly a size to small that her breast jiggled in with every step she took. “So what you wanna do ash?” Iris asked </span></div></div>",
            "created":1516080540,
            "id":2441434,
            "title":"Ash is oblivious about his powers"
        },
        "14":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                " Ash have to commmad over her body but May can still think",
                "Ash just have to think and May does what Ash want",
                "Ash have full control over her  body",
                "Ash have full control over her thoughts",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\tAsh decide to go with May how much control does he have <br>\r\n\t<br>\r\n</span></div></span></div>",
            "created":1356325200,
            "id":1494001,
            "title":"May"
        },
        "142":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Ash figures out his new powers",
                "Ash is oblivious about his powers",
                "Oh, No Its Team Rocket!"
            ],
            "content":"<div class=\"\"><div> <span>Ash was flying to Hoenn on his Swellow to meet up with May. He left pickachu at Prof.Oaks lab so it could get some rest. When he landed he returned Swellow and started walking to Littleroot. On his something on the ground caught his eye, it look like a mega stone but it had a spiral instead of a mega evolution symbol. Curious he picked it up and it seemed to activate itself. when it stopped glowing Ash put it in his pocket and continued on his way. \"Hey May.\" Ash said happily as he arrived at Littleroot where she was waiting. \"Hey Ash! Its been a long time.\" May said enthusiastically. \"Yeah it has been a while.\" Ash replied. 'I remember her tight cloths a lot. I wish she would wear tighter outfits more often' Ash thought pervertedly. May space out for a second and then said \"Would you wait one second I think I forgot something.\" \"Sure no problem May.\" Ash replied politely. May went into her house then came out a few moments later. Ash's jaw nearly dropped clean off. May was wearing a tight white tank top that squeezed her D-cup breast together very <i>nicely</i>. She was also wearing skinny jeans that wrapped around her nice ass wounderfully. Her clothes were so tight that you could almost swear that they wear sprayed on. \"Well, do you want to come in?\" May asked. Ash recomposed himself and said \"Y-Yeah, sure.\" They went into her house when...</span></div></div>",
            "created":1427778000,
            "id":1956796,
            "title":"Ash just has to think and May does what Ash wants"
        },
        "15":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Serena",
                "Shauna",
                "Miette",
                "Lyra",
                "Cynthia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here is more he can control<br>\r\n</span></div></span></div>",
            "created":1356325200,
            "id":1494009,
            "title":"more girls"
        },
        "151":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                "Ash have to commmad over her body but Serena can still think",
                " Ash have full control over her body",
                "Ash have full control over her thoughts and body "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of control</span></div></span></div>",
            "created":1474316520,
            "id":2212148,
            "title":"Serena"
        },
        "152":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                " Ash have to commmad over her body but Shauna can still think",
                "Ash have full control over her body",
                " Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of control</span></div></span></div>",
            "created":1474317000,
            "id":2212152,
            "title":"Shauna"
        },
        "153":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                " Ash have to commmad over her body but Miette can still think",
                "Ash have full control over her body ",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of control</span></div></span></div>",
            "created":1474317420,
            "id":2212155,
            "title":"Miette"
        },
        "154":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                " Ash have to commmad over her body but Lyra can still think",
                "Ash have full control over her body ",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of control</span></div></span></div>",
            "created":1474317420,
            "id":2212156,
            "title":"Lyra"
        },
        "155":{
            "author_id":"wolfpack1",
            "author_name":"wolf 1",
            "choices":[
                " Ash have to commmad over her body but Cynthia can still think",
                "Ash have full control over her body ",
                "Ash have full control over her thoughts and body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of control</span></div></span></div>",
            "created":1474317420,
            "id":2212157,
            "title":"Cynthia"
        },
        "1553":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Continue 1",
                "Continue 2",
                "Continue 3"
            ],
            "content":"<div class=\"\"><div> <span>Ash was re-visiting the Sinnoh region for personal reasons. in his travels he discovered an orange stone and quickly realized it's awesome power of controlling other people. He was looking for someone in particular to take control of.<br>\r\n<br>\r\nCynthia was enjoying her walk far away from all the press and endless battle challenges. It was peaceful in the forest and she loved to be out in nature. Unfortunately she didn't realize that she wasn't alone in the woods. An orange glow enveloped the champion and she was startled to say the least. She quickly relaxed from that feeling though and she just kept relaxing. Her mind quieted and her body became loose as she stood there.<br>\r\n<br>\r\nWithin minutes the glow subsided and Ash left his hiding spot. He wasn't expecting to find Cynthia here, he was looking for her vacation home. Ash was never one to look a gift ponyta in the mouth however and was happy that things played out the way they did.<br>\r\n<br>\r\n\"Cynthia.\" Ash said waiting to hear the result he wanted.<br>\r\n<br>\r\nCynthia softly spoke back \"Yes master?\"<br>\r\n<br>\r\nAsh was over joyed! It worked better then he had hoped, she already knew what the score was. He got closer to examine his prize. Cynthia was quiet a catch. 'Pretty face, long flowing hair, a nice figure and great tits.' Ash thought as he grabbed one. Cynthia stood there blankly as the boy groped her breast. Ash grabbed her other boob and continued playing with them as Cynthia stood there without a thought in her mind.<br>\r\n<br>\r\n\"Is your vacation home here?\" Ash asked<br>\r\n<br>\r\n\"Yes master. It's hidden nearby and only I can get in. No one else is there right now.\" Cynthia answered back.<br>\r\n<br>\r\n\"Good. Take me there.\" <br>\r\n<br>\r\n\"Yes master.\"<br>\r\n<br>\r\nCynthia turned and walked toward her hidden vacation home. Ash reluctantly had to stop playing with her boobs so she could lead the way there but he kept a hand on her ass the whole way there. About half an hour of walking later they reached the house it was well disguised but still big and luxurious on the inside.<br>\r\n<br>\r\n\"This is perfect!\" Ash exclaimed \"Now Cynthia, I want you to strip to your underwear. It'll liven up the decor of the place.\"<br>\r\n<br>\r\n\"Yes Master.\" Cynthia said as she began to take off her clothes.<br>\r\n<br>\r\n\"Hmm...I think you should do it sexier. You know like a strip tease.\"<br>\r\n<br>\r\n\"Yes Master.\"<br>\r\n<br>\r\nCynthia began moving her body with more energy. Ash watched in delight as the Sinnoh champion, one of the most respected trainers in the world, danced like a stripper for him. It was a dream come true.<br>\r\n<br>\r\nWhen she was done Ash was slightly disappointed. \"Plain white underwear?\" Ash examined \"I'll have to fix that.\"<br>\r\n<br>\r\nCynthia stood in front of Ash mostly naked. Her underwear was only a functional, and comfortable, white pair of panties and a bra but her form filled it out spectacularly. Ash was happy with the results and was eager to start phase two of his plan.</span></div></div>",
            "created":1502730300,
            "id":2369057,
            "title":"Cynthia Doll"
        },
        "15533":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Sabrina maybe?",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Ash spent the next week in luxury, Cynthia obeying his every word. He made her 'improve' her wardrobe of coarse, now mostly consisting of fetish gear and lingerie. Ash was watching the snow fall out the window when Cynthia walked up behind him holding a tray with a glass on it. She was of coarse wearing a very relieving maid outfit.<br>\r\n<br>\r\n\"Your beverage, sir.\" Cynthia said her voice still monotone as she presented the drink and her body to her master.<br>\r\n<br>\r\n\"Thank you former champion.\" Ash said taking the glass which he proceeded to drink out of \"What's the progress on the stone?\"<br>\r\n<br>\r\n\"It's orange color is returning faster than expected master,\" Cynthia answered \"It will be ready tonight or tomorrow morning.\"<br>\r\n<br>\r\n\"Ah, so it takes a week to recharge.\" Ash spoke to himself \"I'll keep that in mind. Now who will I choose? Cynthia.\"<br>\r\n<br>\r\n\"Yes, master?\"<br>\r\n<br>\r\n\"Entertain me while I think it over. Use your mouth.\"<br>\r\n<br>\r\n\"Yes master.\"<br>\r\n<br>\r\nCynthia walked infront of Ash and sank to her knees. The once grate pokemon trainer now unzipping someones pants for their pleasure started to repress her gag reflex in preparation.<br>\r\n<br>\r\nCynthia removed her masters slightly erect penis. She did as she was instructed and kissed it's tip before licking it until it was hard enough to suck thoroughly. Once it was proper standing she engulfed it in her mouth and began gently sucking it, moving her head up and down.<br>\r\n<br>\r\nAsh moaned in pleasure and put his hand on her head and, receiving no aurguments, pushed her down so that his dick reached the back of her throat. <br>\r\n<br>\r\n\"Ahh, I have the best thinking cap.\" Ash said, talking to himself again \"Now then, who do I want to make a fuck toy next?\"</span></div></div>",
            "created":1510043160,
            "id":2412107,
            "title":"Continue 3"
        },
        "155331":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Ash was certain in his ability to capture things. Spending a life time collecting pokemon he understood when to so a head on fight to catch his prey, and when a softer touch was required. He was far more careful in his methods of catching Sabrina then he was in his methods of catching Cynthia. While she was a strong trainer, Cynthia didn't have any power of her own. Ash saw first hand what Sabrina's power could do and it was because of that power that he decided that she would be his next target. It also made him cautious but he was always a strategic thinker. He already knew how the was going to get Sabrina under his control.<br>\r\n<br>\r\nSabrina was excited to see Ash again. Haunter was asleep at the moment (funny how you never think that a spirit would need rest) but he would be over joyed when he woke up. Sabrina was waiting for Ash in the forest he was hiding out in expecting to see some psychic pokemon that he caught and wanted her to see it. What she was didn't expect was having trouble finding Ash when tracking his thoughts.<br>\r\n<br>\r\n\"Hey Sabrina, over here!\" Ash called out, prepared for the worst. He was wearing tin foil under his hat. It was a FOIL proof plan. Ash died a little inside from making that pun.<br>\r\n<br>\r\n\"Hello Ash.\" Sabrina said walking up to her soon to be master. \"Sorry I was having trouble finding you. Are you wearing tin foil on your head?\"<br>\r\n<br>\r\n\"What? Don't be ridiculous, you're my friend. Why would I be scared of your advanced psychic abilities that turned human beings into stuffed dolls in front of my eyes?\"<br>\r\n<br>\r\n\"Well, I have to say I'm a little hurt.\" Sabrina said making an over exaggerated frowning face \"How could you be scared of little ol' me after all the help you've given me?\"<br>\r\n<br>\r\n\"I thought you would have been more upset about your powers not working through a thin sheet of metal.\"<br>\r\n<br>\r\n\"Don't remind me.\" Sabrina said with an annoyed look in her eyes \"My one weakness is a cleche.\"<br>\r\n<br>\r\n\"Hey hey hey, don't worry\" Ash said \"You're also weak to the power of laughter.\"<br>\r\n<br>\r\nSabrina chuckled \"So anyway,\" she said \"Where's this new pokemon you wanted to show me?\"<br>\r\n<br>\r\n\"It's right here.\" Ash said reaching into his pocket. He grabbed onto the stone and hoped that it worked. Of coarse if it didn't then he would just pull out his new Bronzor. There was no reason to not have a back up plan.<br>\r\n<br>\r\nSabrina was confused, she felt light headed. She tried to use her advanced psychic abilities to over come this feeling but it felt like it was running on a different level. Somewhere deep inside that her mind was built upon cut couldn't change. Soon her light headed feeling lead to numbness in her mind. Her eyes glassed over and she stood still, not a thought in her head.<br>\r\n<br>\r\n\"Sabrina?\" Ash asked curious of the effect the stone could have on a psychic.<br>\r\n<br>\r\n\"Yes master?\" Sabrina answered.<br>\r\n<br>\r\nAsh smiled noting that it had the same effect it had on regular people.<br>\r\n<br>\r\n\"Follow me\"<br>\r\n<br>\r\nAsh lead Sabrina back to Cynthia's hideaway home. They arrived to the image of Cynthia wearing only an apron.<br>\r\n<br>\r\n\"Dinner will be ready for us and our new recruit master.\" Cynthia said \"There is still ample time for you to experiment with your catch or coarse.\"<br>\r\n<br>\r\n\"Thank you Cynthia, that'll be all for now.\"<br>\r\n<br>\r\nCynthia bowed and returned to the kitchen preparing the meals that they were going to enjoy.<br>\r\n<br>\r\nAsh brought Sabrina to the living room and sat in his chair.<br>\r\n<br>\r\n\"Sabrina, give me a strip tease. Feel free to make it as erotic as you wish.\"<br>\r\n<br>\r\n\"Yes master.\" Sabrina replied and began to dance. She had a different method than Cynthia did, she danced as erotic as she possible could and psychically removed her clothes at the same. It became a lap dance with Sabrina's clothing literally flying off of her body.<br>\r\n<br>\r\nOnce she was down to her underwear Ash ordered \"Stop. Stand up and let me get a look at you.\"<br>\r\n<br>\r\n\"Yes master\" Sabrina answered and stood at attention ready to be examined.<br>\r\n<br>\r\n\"Finally someone with decent taste in underwear.\" Ash said looking over Sabrina's body in hot red lingerie. \"Tell me why you decided to wear that hot little number Sabrina.\"<br>\r\n<br>\r\n\"I ran out of other underwear to wear master. I was going to do laundry once I returned home.\"<br>\r\n<br>\r\n\"Oh.\" Ash said a little disappointed that she didn't do it for her. \"Well no matter now. Soon you'll only be wearing things of that caliber.\"<br>\r\n<br>\r\n\"Yes master\" Sabrina said back still in monotone<br>\r\n<br>\r\n\"Master\" Cynthia said walking in the room \"Your dinner is ready.\"<br>\r\n<br>\r\n\"All right then.\" Ash said \"I suppose we can take a break to eat. Come along Sabrina, it's feeding time.\"<br>\r\n<br>\r\n\"Yes master\" Sabrina said<br>\r\n<br>\r\nWhen they went into the dinning room there was three plates. One had a full meal expertly crafted, while the others had what looked like pokemon food on them.<br>\r\n<br>\r\n\"As you can see I am a benevolent master.\" Ash said \"Giving you the healthiest of diet foods, all mushed up and mixed together. Of coarse, you are going to eat them without utensils or your hands. Just shove your faces in there and go at it like everything else that's as smart as you are.\"<br>\r\n<br>\r\n\"Yes, master.\" The girls replied together.<br>\r\n<br>\r\nWhile ash ate a full meal at the head of the table Sabrina and Cynthia shoved their face into cold mushed up vegetables, chosen to keep their bodies fit and hot. Although As always added his own special ingredient. He makes it himself and adds it in to give it more of a salty flavor for his pets.<br>\r\n<br>\r\nOnce they were done eating Ash led them to the bed room. \"I hope you girls are ready for a long night.\" Ash said with a wicked grin.<br>\r\n<br>\r\n\"Yes master.\" The women replied having no control over their actions.<br>\r\n<br>\r\n\"Now that I have Sabrina and her powers under my control\" Ash thought aloud \"My harem will grow much more efficiently. At the very least it will grow in more fun ways.\"</span></div></div>",
            "created":1510047720,
            "id":2412127,
            "title":"Catching Sabrina"
        }
    },
    "info":{
        "author_id":"wolfpack1",
        "author_name":"wolf 1",
        "brief_description":"that let you decide what Pokemon girl ash gets to control and with a stone he finds ",
        "created":1355938620,
        "description":"<td align=\"left\" class=\"norm\">NO SAME GENDER SEX <br>\r\nNO SIBLING SEX<br>\r\nHAVE FUN!!!!!<br>\r\nTHINK IN LIKE ASH AS IF HE KNEW WHAT THEY DID WHEN THEY MET PIKACHU!</td>",
        "id":1909277,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581943620,
        "modified":1581943620,
        "pretty_title":"pokemon girls dolls"
    }
}