{
    "chapters":{
        "1":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two dragoness",
                "two lioness",
                "two hawks",
                "two hyenas",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>one day lee was browsing the internet for a new place to live because he couldn't afford the rent at his old place then an ad appeared saying two lady furrys need roommate for a new three person house and rent was only fifty dollars a month I can afford that so lee responded to the ad and the next day was accepted so lee packed his stuff and started moving to the new house<br>\r\n<br>\r\nwhen lee arrived at the house he could see the furrys waiting for him outside and they were two of the most gorgeous double d chested lady's he had ever seen as he got out of the truck he was in the two furrys came down to meet him and they were     </span></div></div>",
            "created":1479186000,
            "id":2237398,
            "title":"the furrys"
        },
        "11":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "spa",
                "gym",
                "kitcken ",
                "bedroom",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>lee gazed at the two dragoness who looked very different the one on the right as red and blue and the other was pure green they opened their wings and flew down to the truck as lee got out off it and opened the back of the truck they introduced themselves my name is jenny and I am dora then lee said hi im lee nice to meet you both they both shock lees hand and picked up a few boxes from the truck and flew them up to the house as lee picked up the last two boxes and carried them up to the massive home he as shocked as he walked though the door<br>\r\n<br>\r\nthe house had chandeliers and priceless panting on the walls as he entered the living room he saw jenny and dora sitting on a black leather coach as the last box was brought in lee shut the door and entered the living room and sat on the coach then the dragoness jumped and sat next to lee and asked do you want a tour lee then he pondered and answers yes then dora asked where would you like to see first then lee decided on the      </span></div></div>",
            "created":1482250860,
            "id":2252442,
            "title":"two dragoness"
        },
        "12":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "bedroom",
                "kitchen ",
                "garden",
                "spa",
                "go out with the lioness"
            ],
            "content":"<div class=\"\"><div> <span>as lee got out of the truck to bring the boxes he had the two lady's came down to meet him lee opened the trucks backdoor to get his things out of it he had only pulled a few boxes out when he looked to his left and saw the two lioness standing next him he jumped in alarm the lady's smiled at him and said hello my name is kim and this is emily and welcome to your new home we will meet you inside then the lady's walked back to house<br>\r\n<br>\r\nlee finished unloading the truck and started to carry the boxes up to the house he had only carried ten boxes up the steps but he was tired so he sat on the top step when he saw someone coming up the steps with the rest of his boxes in two hands the person left lee scratched his head then kim and emily came out and they helped lee bring the boxes in the house with lee still confused <br>\r\n<br>\r\nkim and emily placed the boxes in the kitchen and took lee to the living room were they sat on a blue couch and started to talk kim said lee what are you into romance wise lee thought and was about to answer when emily asked what's your favourite food and they continued in this manner for sometime until lee said can I ask you two a question their was someone outside who helped me with my boxes do you know who it was the two lioness thought and asked for a description<br>\r\n<br>\r\nlee thought and said the person was wearing black skirt and a red shirt and had yellow eyes the lioness had no clue who this person was but then the lioness decided it was time for lee to learn the new house the lioness asked if lee would like a tour of the house as lee thought he decided        </span></div></div>",
            "created":1479531600,
            "id":2239128,
            "title":"two lioness"
        },
        "125":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "breakfest ",
                "morning fun",
                "go to see gina"
            ],
            "content":"<div class=\"\"><div> <span>lee thought and said how about instead of staying in we go out to celebrate me moving in the lioness thought and agreed to the idea they both ran like the wind to the bedroom to get changed for the night lee grabbed a pair of jeans and a checked shirt he was ready in five minutes then half an hour later kim and emily were ready and they decided to take him to their favourite bar <br>\r\n      <br>\r\nkim and emily took lee to the garage and they showed him a brand new convertible as they got in the car it was very roomie and it was very comfortable and they got on the way and after twenty minutes they arrived at a club called the room which was new to lee when they went inside it was filled with other furrys lee thought maybe I will see the furry who helped me then lee went to the bar as kim and emily went to grab a table <br>\r\n<br>\r\nas lee went to the bar he sat on one of the stools then a drink is given to him by the barmen who said lady down their paid for this and said it was for you lee then looked down the bar and saw the same outfit he saw before then the lady approached him taking her hood down to revile a snake who then said my name is gina then lee spoke thank you for helping me earlier then gina said it was no problem I like to help out anyway I can then gina kissed lee on the chick theirs my address come and see me sometime <br>\r\n<br>\r\nthen lee had the drink as he watched gina slither out the door and then bought some drinks for him and kim and emily when he arrived the lioness were ready for the drinks as they enjoyed the drinks lee only thought about what happened and after a few hours lee got the lioness home and placed them in bed but as lee was about to leave kim in her sleep grabbed lee and the lioness snuggled into lee and they all fell asleep <br>\r\n<br>\r\nbut what happens next <br>\r\n<br>\r\noption 1 lee and one of the lioness wake up and decide to have a breakfast together <br>\r\n<br>\r\noption 2 the lioness wake up before lee and decide to have some fun<br>\r\n<br>\r\noption 3 lee wakes up before the lioness and sneak off to see gina      </span></div></div>",
            "created":1479752940,
            "id":2240027,
            "title":"go out with the lioness"
        },
        "1252":{
            "author_id":"cheese111",
            "author_name":"cheese111",
            "choices":[
                "Stay quiet, enjoy the hug",
                "Tell them he loves it",
                "Tell them hes hungry"
            ],
            "content":"<div class=\"\"><div> <span>Lee woke up feeling warmer then usual. A strange itch hounds your nose and when lee opened his eyes you see Kim peering down at him. Lee suddenly realize where the itch is coming from as she presses herself against him, her soft boobs rubbing against his face. Still groggy and unable to make sense of what is happening lee instinctively push himself away, but behind him is another fuzzy body. Emily's warm breath washes over his ear as she whispers to you.<br>\r\n<br>\r\n\"How about we properly 'welcome' our new housemate.\"<br>\r\n<br>\r\nIt was hard to see from his perspective between the two, but they were lying opposite eachother in a loose embrace. Soon they pulled themselves towards eachother more vigorously, gently pressing lee between their bodies. They were barely any taller then him, but in this intimate embrace lee felt very small. There wasn't a hint of hesitation from either as they sandwiched him between them. Their soft skin gently brushing against his own as they shifted and moved around lee. he hadn't expected either of them to be this close to him already, but here you were being smothered by his new lioness housemates.<br>\r\n<br>\r\nKim leans in a little, her large nose hovering less then an inch from lees face. She locks eyes with him and stares lee down. lee is not sure what she's about to do, so he plays along and stare back into her beautiful yellow eyes. Eventually he blinks, which she giggles at. As a reward for winning this impromptu staring contest she sticks out her tongue and licks your nose.<br>\r\n<br>\r\n\"Oh my, I think he likes it.\" Kim giggles as you blush.<br>\r\n<br>\r\n\"How does he taste?\" Emily inquires.<br>\r\n<br>\r\n\"Delightful. He'll fit right in with us.\" lee weren't sure what that meant, but given their gentle treatment of him so far he didn't worry. Finding himself held firmly between them had been quite the experience. How will lee react to this welcome?</span></div></div>",
            "created":1482686040,
            "id":2254226,
            "title":"morning fun"
        },
        "1253":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "gina hypnotise lee",
                "gina has sex wih lee",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>it was 7 am in the morning lee woke up to see the lioness still fast asleep so he sneaked out of the bed and grabbed a pair of grey pants and red shirt and went for a run as he did he noticed a street named liberty and thought back to last night that's the street gina lives on I should go and see her as he ran up the street and came up to the house and saw a massive ramping leading up to the door and thought understandable as he walked up to the door and knocked gina answered the door and lee said \"hi gina\" she slithered back in shock but soon regained composer and spoke \"sorry lee I wasn't expecting you so soon\" then lee said \"well I was out for a run so I thought id come see you\" gina looked at lee and said \"would you like to come in?\" lee entered and gina took him to the kitchen and they sat down.<br>\r\n<br>\r\n\"would you like a cup of tea?\" asked gina to lee he politely said \"yes I would love one with two sugar's please\" gina giggled as she turned the kettle on and lee started to look around Gina's house gina looked at lee and said \"do you like my home lee?\" lee rapidly spun around and answered \"yes its very lovely\" gina giggled as she brought the cups of tea over placing them on the table as they drank gina asked lee \"how are you employment lee?\" lee spat his tea back into his cup and coughed and answered her question \"I'm unemployed I'm afraid\" gina looked at him with compassion and slithered round to him and hugged him.<br>\r\n<br>\r\nas gina was hugging lee she remembered that she had job lee could do letting go of him gina slithered back round the table and spoke to lee she said \"lee I need a house keeper if your interested?\" lee looked at gina and said \" yes happily I mean yes I would happily accept this job\" gina smiled and said \"okay I will go and get the paperwork\" gina slithered out lee looked around thing cleaning not to hard then he heard her coming back so he sat back down at the table as gina entered put the papers in front of him and said \"just sign on the dotted line and you are employed\" lee signed and gina was happy kissing and pulling him into her body wrapping him up in her tail.<br>\r\n<br>\r\nlee was happy to have a job but thought of something an decided to ask \"not to be rude but what happened to your last house keeper? gina looked at him and told him \"well my last housekeeper mrs mouse passed away but at the funeral the family asked if I would do them a favour as they could not have buried her they asked me to swallow her and I did\" lee looked at her understanding hugging her but asked another question \"when do I start work\" gina answered \"right now come with me\" gina dragged lee straight to her bedroom locking the door <br>\r\n<br>\r\nbut what happens next<br>\r\n</span></div></div>",
            "created":1498506300,
            "id":2343106,
            "title":"go to see gina"
        },
        "12531":{
            "author_id":"ryback123",
            "author_name":"maximus",
            "choices":[
                "emily and kim arrive to save lee",
                "gina spits lee up",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>gina slivered over to lee as he said\" why did you lock the door?\" she laughed and said\" well its training day for you\" holding the key over her mouth lee looked in confusion as she swallowed the key lee saw it traveling down her throat she then start to say \"you know I don't meet guys like you everyday\" as her tail started to wrap around lees legs he noticed nothing as his focus was on gina trying to kiss him as he fell on the bed.<br>\r\n<br>\r\nlee looked at his legs wrapped in Gina's tail he tried to get free but to no success as gina started to talk \"well I've got a fighter on my hands well I will stop that\" gina started to wrap her whole body around lee with him still fighting gina continued to giggle as lee kept fighting soon only his head could move as Gina's head hovered over and he said \"why are you doing this I fought we were friends\" gina looked at him and laughed at him<br>\r\n<br>\r\n\"of course we are\" said gina as looked at him and said \"I need to finish you training be fore you can start to work for me\" soon gina was looking directly at him she closed her eyes and started to talk saying \"you are under my spell you will fall into a trance and stay still\" she repeated this time and time again but when she opened her eyes lee saw swirling colours<br>\r\n<br>\r\nsoon all he could see was the colours and as they got stronger lee didn't fall asleep but he had no control over his body soon gina stopped saying her chant then lifted lee off the bed with her powerful tail and placed him head first over her mouth and started to lower him with her mouth completely open his head soon entered and was covered in saliva as gina swallowed slowly she tasted every bit of lee hmm she thought<br>\r\n<br>\r\nas gina continued to swallow she soon reached lees genitalia she decided to have moment to taste it completely by wrapping her tounge around it rubbing it up she soon continued swallowing with every swallow the bulge in her stomach got bigger until with one final swallow she closed her mouth licking her lips she slivered into bed and started to rub her belly just as she did the hypnosis wore off and lee started to feel cramped as gina was apply pressure making him feel trapped and started to fight<br>\r\n<br>\r\ngina noticed and laughed as she fell asleep but what happens next..... <br>\r\n<br>\r\n</span></div></div>",
            "created":1523821080,
            "id":2479994,
            "title":"gina hypnotise lee"
        },
        "125312":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "she unbirths him",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>after a few hours sleep gina woke and noticed lee had come to the fumes of her belly and decided to get him out she slivered out of bed and to the foot of it she positioned herself and started to gag forcing lee up her body as she pushed lee regained his consciousness as he felt the tightness around his body gina continued to push as lee viewed the flesh pushing him up soon he reached the back of Gina's throat she soon started to push him out her mouth soon lees head popped out of her mouth he gagged as fresh air entered his lungs and gina smiled as he did gina continued.<br>\r\n<br>\r\nsoon lees upper body was out of her mouth and he noticed the bed and landed on it as gina held his legs in her mouth she soon started to pull lee back in to her mouth she soon pulled lee back in to his neck and soon pushed him back out and he landed on the bed as he took deep breaths gina could only laugh soon lee passed out gina slivered to the kitchen and got water for lee she soon returned to the bedroom and found lee turning on the bed as he turned and faced gina he couldn't say anything as gina passed him the water he soon gulped the whole glass in one go.<br>\r\n<br>\r\nafter finishing his water lee said \"what the heck gina I must have been in their for hours\" gina laughed and said \"5 hours to be precise my dear lee\" lee could barely move then gina said \"that will only last ten minutes its just a side effect\" lee looked at gina and said \"is that my new job for you gina?\" gina coiled her tail around lee and squeezed him and said \"yes that is you new job and it won't always be in the mouth\" as she kissed him and placed him on his back and slivered over to lees face and started to hypnotise lee again by saying \"trust me my dear I will protect you\" and repeated.<br>\r\n<br>\r\nsoon lee came back under gina's control and fell asleep after a while he woke up in the kitchen still wrapped in gina's tail he struggled gina felt it and turned around slivering back up to lee and said \"evening darling have a nice sleep\" lee looked at her with both fear and anger after that gina uncoiled him and said \"remember to come back on Monday to start work\" and with a another hypnosis lee left and returned to his home with Kim and emily and telling them about his new job with gina and they had a three way to celebrate but every time they asked lee remembered nothing but after the weekend lee returned to gina's.<br>\r\n<br>\r\non Monday lee returned to gina's and wondered what awaited him. <br>\r\n<br>\r\n </span></div></div>",
            "created":1556053440,
            "id":2649139,
            "title":"gina spits lee up"
        },
        "13":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "bedroom",
                "kitchen",
                "garden",
                "spa",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>as lee got out of the truck to bring the boxes he had the two lady's came down to meet him lee opened the trucks backdoor to get his things out of it he had only pulled a few boxes out when he looked to his left and saw the two hawks standing next him he jumped in alarm the lady's smiled at him and said \"hello my name is jade and this is bell and welcome to your new home we will meet you inside\" then the lady's walked back to house<br>\r\n<br>\r\nlee finished unloading the truck and started to carry the boxes up to the house he had only carried ten boxes up the steps but he was tired so he sat on the top step when he saw someone coming up the steps with the rest of his boxes in two hands the person left lee scratched his head then jade and bell came out and they helped lee bring the boxes in the house with lee still confused <br>\r\n<br>\r\njade and bell placed the boxes in the kitchen and took lee to the living room were they sat on a red couch and started to talk kim said \"lee what are you into romance wise\" lee thought and was about to answer when emily asked \"what's your favourite cup size\" and they continued in this manner for sometime until lee said \"can I ask you two a question their was someone outside who helped me with my boxes do you know who it was\" the two hawk thought and asked for a description<br>\r\n<br>\r\nlee thought and said the person was wearing blue shirt and a red skirt and had brown eyes and was a big cat the hawks had no clue who this person was but then the hawks decided it was time for lee to learn the new house the hawks asked if lee would like a tour of the house as lee thought he decided </span></div></div>",
            "created":1516538820,
            "id":2443369,
            "title":"two hawks"
        },
        "14":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "bedroom",
                "kitchen ",
                "spa",
                "garden",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>as lee got out of the truck to bring the boxes he had the two lady's came down to meet him lee opened the trucks backdoor to get his things out of it he had only pulled a few boxes out when he looked to his left and saw the two hyenas standing next him he jumped in alarm the lady's smiled at him and said hello my name is jean and this is fiona and welcome to your new home we will meet you inside then the lady's walked back to house<br>\r\n<br>\r\nlee finished unloading the truck and started to carry the boxes up to the house he had only carried ten boxes up the steps but he was tired so he sat on the top step when he saw someone coming up the steps with the rest of his boxes in two hands the person left lee scratched his head then jean and fiona came out and they helped lee bring the boxes in the house with lee still confused <br>\r\n<br>\r\njean and fiona placed the boxes in the kitchen and took lee to the living room were they sat on a blue couch and started to talk jean said lee what are you into romance wise lee thought and was about to answer when fiona asked what's your favourite food and they continued in this manner for sometime until lee said can I ask you two a question their was someone outside who helped me with my boxes do you know who it was the two hyena thought and asked for a description<br>\r\n<br>\r\n lee thought and said the person was wearing blue skirt and a red shirt and had yellow eyes and was furry the hyenas looked at him and said who this person was but they didn't know then the hyenas decided it was time for lee to learn the new house the hyena asked if lee would like a tour of the house as lee thought he decided</span></div></div>",
            "created":1483702500,
            "id":2259841,
            "title":"two hyenas"
        },
        "15":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two giraffes",
                "two penguins",
                "two snakes",
                "two cougars ",
                "other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about one these</span></div></span></div>",
            "created":1479531600,
            "id":2239153,
            "title":"other"
        },
        "153":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "they eat him",
                "they have sex",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>as lee got out of the truck to bring the boxes he had the two lady's came down to meet him lee opened the trucks backdoor to get his things out of it he had only pulled a few boxes out when he looked to his left and saw the two nagas standing next him he jumped in alarm the lady's smiled at him and said hello my name is bulma and this is penny and welcome to your new home we will meet you inside then the lady's slivered back to house lee couldn't take his eyes off them<br>\r\n<br>\r\nlee finished unloading the truck and started to carry the boxes up to the house he had only carried ten boxes up the steps but he was tired so he sat on the top step when he saw bulma and penny's tails carrying the rest of his boxes inside the house then bulma and penny came out and they helped lee bring the rest of the boxes in the house with lee in penny's tail <br>\r\n<br>\r\nbulma and penny placed the boxes in the kitchen and took lee to the living room were they sat on a blue couch and started to talk bulma said \"lee what are you into romance wise?\" lee thought and said \"well you'll probably going to laugh but I'm a vorarephilia\" the two smiled and said \"so are we\"  when penny asked \"what's your favourite food?\" lee said \"well my favourite food is meat\" the two nagas slivered up to lee and coiled themselves around him. <br>\r\n<br>\r\nbut what happens next....  </span></div></div>",
            "created":1556119860,
            "id":2649596,
            "title":"two snakes"
        },
        "155":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two frogs",
                "two wolfs",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about </span></div></span></div>",
            "created":1479704400,
            "id":2239923,
            "title":"other "
        },
        "1553":{
            "author_id":"mike92586",
            "author_name":"MikeC",
            "choices":[
                "Two horses",
                "Two cows",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some others?</span></div></span></div>",
            "created":1486156620,
            "id":2272956,
            "title":"other"
        },
        "15533":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two alligators",
                "two tigeress",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about  </span></div></span></div>",
            "created":1486971300,
            "id":2276986,
            "title":"Others"
        },
        "155333":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two lemurs",
                "two otters",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about </span></div></span></div>",
            "created":1487175300,
            "id":2277869,
            "title":"other"
        },
        "1553333":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "two skunks",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about?</span></div></span></div>",
            "created":1497094680,
            "id":2333799,
            "title":"other"
        },
        "15533331":{
            "author_id":"ryback123",
            "author_name":"maximus",
            "choices":[
                "tour of the house",
                "go out",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>as lee got out of the truck to bring the boxes he had the two lady's came down to meet him lee opened the trucks backdoor to get his things out of it he had only pulled a few boxes out when he looked to his left and saw the two skunks standing next him he jumped in alarm the lady's smiled at him and said \"hello my name is fifi and this is jenny and welcome to your new home we will meet you inside\" then the lady's walked back to house<br>\r\n<br>\r\nlee finished unloading the truck and started to carry the boxes up to the house he had only carried ten boxes up the steps but he was tired so he sat on the top step when he saw someone coming up the steps with the rest of his boxes in two hands the person left lee scratched his head then fifi and jenny came out and they helped lee bring the boxes in the house with lee still confused <br>\r\n<br>\r\nfifi and jenny placed the boxes in the kitchen and took lee to the living room were they sat on a red couch and started to talk fifi said \"lee what are you into romance wise?\" lee thought and was about to answer when jenny asked \"what's your favourite food?\" and they continued in this manner for sometime until lee said \"can I ask you two a question their was someone outside who helped me with my boxes do you know who it was?\" the two skunks thought and asked for a description<br>\r\n<br>\r\nlee thought and said \"the person was wearing black t shirt and a red jeans\" fifi and jenny thought and fifi said \"oh that will be mania she is a mouse so helpful but extremely shy she live a couple of houses down\" lee looked at the house but before he could do anything fifi and jenny grabbed le and said \"what do you want to do now?\" lee thought and decided to....   </span></div></div>",
            "created":1523821920,
            "id":2480001,
            "title":"two skunks"
        },
        "155333311":{
            "author_id":"ryback123",
            "author_name":"maximus",
            "choices":[
                "kitchen ",
                "bedroom",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where in the house do they go </span></div></span></div>",
            "created":1525878660,
            "id":2490665,
            "title":"tour of the house"
        }
    },
    "info":{
        "author_id":"jackswager123",
        "author_name":"jackswager123",
        "brief_description":"two female furrys are looking for a human to live with ",
        "created":1479199920,
        "description":"<td align=\"left\" class=\"norm\">the rules <br>\r\n<br>\r\nthe two furrys and the human are the main characters so cannot die<br>\r\n<br>\r\nanything goes expect for water board and scat <br>\r\n<br>\r\nno digestion <br>\r\n<br>\r\nkeep in third person<br>\r\n<br>\r\n</td>",
        "id":2102779,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556119860,
        "modified":1556119860,
        "pretty_title":"two furrys and a human"
    }
}