{
    "chapters":{
        "1":{
            "author_id":"millimeter_man",
            "author_name":"Millimeter",
            "choices":[
                "The Beach",
                "A School Locker-Room",
                "Your House",
                "A Friend's House",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First things first, lets figure out the setting.</span></div></span></div>",
            "created":1128989040,
            "id":278135,
            "title":"Introduction"
        },
        "11":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all, are you a boy or a girl?</span></div></span></div>",
            "created":1131856560,
            "id":283680,
            "title":"Gender"
        },
        "111":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "Cassie looks for Matt and walks over to the chest",
                "Cassie stays at the towel, and Matt walks to her"
            ],
            "content":"<div class=\"\"><div> <span>You are Matt Warner, the cutest, toughest, and most popular guy at Arroyo Grande high school on the central coast of California. You drove your 1967 Chevy Camaro to Avila beach, for a keg party. Your girlfriend Cassie is with you. She has short brown hair, green eyes, and a tan complexion.<br>\r\n<br>\r\nAfter you set a towel out on the beach to lay down on while you wait for the keg to arrive, you sent Cassie back up to your car to get your portable stereo out of the trunk. As you look around, you see a wooden chest washed up on the beach. Thinking there might be drugs or money in it, you run down to it and open it.<br>\r\n<br>\r\nInside, there is a metallic device. You fumble with the control panel, and you are absorbed by a blinding white light that shrinks you instantly down to a millimeter tall!</span></div></div>",
            "created":1133130000,
            "id":401331,
            "title":"Matt Warner, high school winner"
        },
        "1112":{
            "choices":[
                "Near her feet",
                "Near her waist",
                "By her head."
            ],
            "content":"<div class=\"\"><div> <span>Your whole world changes right before your eyes. What was once a scenic view of rolling waves, sandy hills, and the city beyond has transformed into a stony wasteland of rocks and boulders. You recognize these basketball-sized stones as the fine grains of sand dispersed throughout the beach. A dark shadow sprawls out all around you, forming from the giant, splintered wall towering next to you. As you look up at the massive barrier, you recognize its features. Slats hundreds of feet wide shoot up into the sky, with a thick steel bar rolling across it at the very top. With horror, the whole picture comes together in your head. This is the once knee-high chest that you had just opened. Your mind is in a daze. You can't be taller than a millimeter! How is that even possible?<br>\r\n<br>\r\nYou've no time to consider the mind-bending physics of the situation as a series of rumbles shakes the unsteady ground you stand on. The rumbles rise in intensity, growing as powerful as a devastating earthquake. The grains of sand around you shake and bounce from the thunderous rumble, threatening to bury you deep into the sand. You struggle for several seconds, desperately trying to keep your head above the sand, when the quakes mercifully stop as quickly as they had come. Curiously, you turn your half-buried body around towards the source of the strange event.<br>\r\n<br>\r\nTwo massive, tanned pillars stand before you, stretching upwards and converging a mile above you. Further up, the colossal structure forms into a curvy figure, climbing ever skyward and supporting the head of a sexy brunette. Your girlfriend Cassie has returned, carrying your portable stereo in one hand and gazing out across the beach. You'd considered yourself lucky for getting such a knockout beauty, but from this perspective her features take on a whole new level of awe-inspiring. Her bronzed skin glistens from the sun's rays, casting an almost statuesque reflection of light across her perfect body. The endless fabric of a pink bikini wraps tightly around her waist and not-so-modest chest. In this rocky wasteland of nothing, here she stands a mighty goddess surveying her domain with her emerald green eyes. <br>\r\n<br>\r\n\"Matt!?\" she calls out, her deafening voice ringing boisterously in your ears. \"Matt, where did you go?\" She spins around, far faster than something her size should be able to, trying to find you.<br>\r\n<br>\r\n\"Cassie!\" you call up to her, waving your arms. \"Look down here! I've shrunk! Look down!\" You almost laugh at yourself for the feeble attempt. Though it may only be a few steps in reality, from your perspective she may as well be miles away from you. You can only hope that she somehow sees you flailing here in the sand. Even then, you consider the chances of her finding your speck-sized body among the trillions of grains of sand are pitifully infinitesimal. Sure enough, her all-seeing eyes still fail to notice the speck of nothing desperately trying to get her attention far beneath her. Shrugging, she lays the stereo down on the towel and plops herself down next to it, releasing one more deadly wave, and knocking more of the giant sand grains into you. <br>\r\n<br>\r\nThe event leaves you dismayed. Moments ago, you had been the spectacle of your school. Hardly any girl could ever take their eyes off you, and Cassie couldn't ever get enough of you. Getting cursed--or whatever this was--as an unnoticeable grain of sand was a depressing change of pace. You had to make this right.<br>\r\n<br>\r\nPulling yourself out from the suffocating mixture of microscopic ocean debris, you clamber your way towards the towel where Cassie waits. Your survival instincts fill you with unmistakable nerves. This woman was big enough that even the shock waves of her footsteps had nearly ended you. Still, staying in this sandy death trap was far from desirable, and getting her attention is the best chance you have at restoring your dignity.<br>\r\n<br>\r\n...And surviving, of course. Equal priorities.<br>\r\n<br>\r\nNearly twenty minutes pass before you finally reach the thick fabric of Cassie's towel, cringing at the thought. The chest had only been five paces or so away. Would traveling really be this tedious from now on? You shake the thought away, choosing to focus on more important matters. Hoisting yourself up onto the thick towel, you hug the solid ground, grateful for an easier path to traverse. You take a moment to catch your breath. This had been the easier part, after all. The dangerous part had only just begun. You stand up and look out towards your reclining girlfriend to see where on the towel you've ended up.</span></div></div>",
            "created":1556587080,
            "id":2652335,
            "title":"Approaching the Colossus"
        },
        "11122":{
            "author_id":"bossplay073",
            "author_name":"Bossplay073",
            "choices":[
                "Climb the Cheeks, this is a once in a life time",
                "Try to Climb her Head, an attempt to get her Attention "
            ],
            "content":"<div class=\"\"><div> <span>You look and see that you have reached the most dangerous part of the body, her waist. Cassie is currently lying down on her stomach a foot away (a few miles for you) from you. Her whole body is like a whole gigantic universe. The towel is like a big pink and blue forest. You look up to see that you were near her 5 mile long pink bikini that is trying to contain a large bubble butt the size of moons. You start walking towards the now Jupiter sized Cassie, you scan left to see her humongous body and more than 15 miles away, you could see her planet sized head with an ocean of hair spilling from the sides. You could see that she is trying to set up her stereo, but at least she had a pair of headphones. You scan to your right and you can see the most humongous legs ever with planet thighs and perfectly clean feet. <br>\r\n<br>\r\nThis was the moment of your life, thinking of the possible things you could do and what can happen. You couldn't keep your eyes off of Cassie’s body. All of a sudden, she lifts her gigantic body faster than you’ve expected. Cassie thought that it was a good time to start her sun bathing. She has set up the stereo and now she was grabbing sunscreen from her purse. You could see her humongous moon sized butt was now dangling wildly dangerous above you. You could see that the bikini was swallowed up by her cheeks, making it more visible. Then it started falling like it was in slow motion landing right behind you creating massive 200+ mph winds that sent you flying up and landing on her long Huge slippery smooth thighs. Cassie’s thighs are several miles wide and are 10 miles or more long. She let out a small sigh that felt like wind and loud thunder. “Where did he go?” Cassie whispered, it was more of a trembling sound for you. “Cassie, I am down here”, you scream your loudest, but it was just useless. It wasn’t even a squeak for her. Even if she spotted him, she would just think that it is just a speck of sand. <br>\r\n<br>\r\nCassie took the huge bottle of sun screen, then squirted a tiny amount, a lake to you, on her hands then rubs it on her humongous body. First, her face, then a little on her dangling chest. You were in awe of the current sight. Then, you snap out of it when Cassie’s humongous hand suddenly comes down crashing down on her planet sized thighs then starts rapidly rubbing the sunscreen around you, then when her hand comes towards you, your flea sized body gets glued to the sunscreen left on her index finger. You tried to not get the sunscreen in your mouth, but you could taste it. <br>\r\n<br>\r\nCassie lays down on her stomach again, squirts a bit more sunscreen, then brings her hand to her lower back and begins to rub around. You get unglued from her finger and were left stranded in the middle of her warm body on her lower back, you stand up and look towards the giant hill that leads up to her ocean sized hair that reaches a little lower than her shoulders. You look the opposite way to see a giant slope up that leads to two huge smooth Everest mountains trying to contain the monstrous cheeks. You are so tiny that you could just walk under her bikini without problem, but it could trap you easily. Her hands had moves toward her monster bubble butt rubbing some sunscreen around it creating jiggle waves making you stumble. <br>\r\n<br>\r\nYou were in awe at what you are seeing and glad that you were not stuck to the finger and get rubbed on her cheeks. Then she gets a pair of headphones and cranks up the volume. She closes the chest thinking that she opened it accidentally. But you really want to climb the cheeks. But, at the same time, you wanted to climb to her head to have a chance of getting her attention, but, it will be impossible for her to notice you because she is listening to music and slowly drifting away to sleep.</span></div></div>",
            "created":1597962060,
            "id":2888681,
            "title":"Near her waist"
        },
        "11123":{
            "author_id":"bossplay073",
            "author_name":"Bossplay073",
            "choices":[
                "Go in Chip Bag.",
                "Climb to Shoulders."
            ],
            "content":"<div class=\"\"><div> <span>You climb up the towel and see Cassie’s beautiful titanic face, huge emerald green eyes scanning around, giant hungry lips and her humongous hair resting on the towel. Her giant left arm is not far away from you. You can see that she is currently laying on her stomach trying to set up the stereo. <br>\r\n<br>\r\nYou start walking on the huge towel through the forest of fabric. Suddenly, you hear a deep grumble and loud thunder coming from her stomach, ‘GRRRR’, you were shocked from the trembling sound. “Uhhh,” Cassie groans deeply creating an earthquake making you stumble on the towel, “Where could’ve Matt run off to?” It was so loud to your microscopic ears. “Cassie, I am down here” you scream your hardest, but to Cassie, it wasn’t even a squeak. “I’m so hungry, thank goodness I got some Doritos.” Cassie said looking at the open chest thinking she opened it on accident then closing it. <br>\r\n<br>\r\nShe reached over into a grocery bag and grabbed a huge bag of family sized Doritos. She opened the huge bag creating a loud screeching sound hurting your tiny ears then placed the bag right in front of your flea sized body. Her massive hand was looming over you reaching for a massive stadium sized triangular chip and surprisingly lifting it with two huge fingers with no problem. Then her hand rapidly flew to her humongous starving lips revealing her dangerous skyscraper sized molars and a powerful massive tongue. ‘CRUSH, CRUNCH, CRUNCH... then GULP’ Her mouth started rapidly smashing, crunching, doing frightening things as fast as a train scaring your helpless grain sized body.<br>\r\n<br>\r\nYou want to go inside the chip bag to grab some food, but it may be too risky. You also want to climb up the arm to her shoulder to maybe have a chance of getting her attention, but it would be impossible for her to notice your flea sized body. You decide to...<br>\r\n</span></div></div>",
            "created":1598052540,
            "id":2889148,
            "title":"By her head."
        },
        "12":{
            "author_id":"millimeter_man",
            "author_name":"Millimeter",
            "choices":[
                "Swimming",
                "Basketball",
                "Football",
                "Volleyball",
                "Tennis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What event?</span></div></span></div>",
            "created":1128989160,
            "id":278136,
            "title":"Locker-Room"
        },
        "121":{
            "author_id":"millimeter_man",
            "author_name":"Millimeter",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Boy or Girl swim team?</span></div></span></div>",
            "created":1128989220,
            "id":278137,
            "title":"Swimming"
        },
        "1212":{
            "author_id":"millimeter_man",
            "author_name":"Millimeter",
            "choices":[
                "She stepped on me",
                "Her shoe landed right next to me."
            ],
            "content":"<div class=\"\"><div> <span>After my weight lifting session, I decided to shower off in the school's locker room. It was a half hour before the girl's swim meet, so I took advantage and used their showers, the boy's being to nasty for me.<br>\r\n<br>\r\nA few minutes after I started into the showers, I felt a bit light-headed. I grabbed onto the wall and slid down into utter darkness.<br>\r\n<br>\r\nI woke up to a vast world that made no sense. The sky was a pale white and the ground was a grayish color. There were even gaps every mile. It almost reminded me of- Then it hit me, this was the showers! Before I could find a way out, I heard the door to the locker room open and the sound of thunderous voices echoing off the walls.<br>\r\n<br>\r\nA few minutes after the voices entered, I finally got to see how small I was. The girls looked like mountains moving around. I had to be less then a millimeter tall, they'd never see me down here!<br>\r\n<br>\r\nI then saw to my horror their gigantic bare feet walking to the faucet I was beneath. One walked under the faucet, and her foot falls caused the wind to move me into the air at an alarming speed. I landed in between one of their feet and began running for the shower exit as fast as my little legs could carry me.<br>\r\n<br>\r\nI made it out to the main locker room when the rest of the girls started pouring in. Out in the middle of the room I was completely vulnerable. A freshman swimmer named Amber was heading straight for me. Her giant shoe slammed down a foot (to her) in front of me. The next one was on it's way towards me when...</span></div></div>",
            "created":1129071240,
            "id":279562,
            "title":"Little Shower"
        },
        "123":{
            "choices":[
                "David, Jenny Clarnasa formal boyfriend",
                "Peter, the teams freshmen towel boy",
                "Steven, one of Micheal's openly gay teammates."
            ],
            "content":"<div class=\"\"><div> <span>Micheal was on cloud nine having won the homecoming game for his school and his upcoming date with Jenny Clarnasa, the head cheerleader who he just won away from one of his teammates after almost three years of trying.  After most of his teams had left Micheal was finally able to get into the showers and started to wash up, not noticing that his normal shampoo had been switched.    As the quarterback applied the shampoo he started to feel weird and suddenly passed out.  When he woke back up Micheal gasp at the sight in front of him a pair of giant tree trunks until he tilted his head up and saw that they belonged to...</span></div></div>",
            "created":1397868240,
            "id":1782112,
            "title":"From quarterback to toy"
        },
        "1233":{
            "author_id":"007heath",
            "author_name":"Giantess007",
            "choices":[
                "He spots you",
                "Doesn't see you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Steven was of Micks teammates he was gay and wasn't afraid to show it as he wore a pink G-string. You don't want to be discover by him.</span></div></span></div>",
            "created":1573620660,
            "id":2746104,
            "title":"Steven, one of Micheal's openly gay teammates."
        },
        "13":{
            "choices":[
                "Tyler shrinks out of his clothes in the kitchen",
                "Tyler shrinks with his cloths on in the kitchen",
                "Tyler makes it back to the living room then shrinks nude",
                "Tyler shrinks in living room fully clothed",
                "The phone rings (slow shrink)"
            ],
            "content":"<div class=\"\"><div> <span>Tyler, age 18, was board, not that he would rather be in school right now, but board all the same  He had been happy when the school he went to had been closed due to loss of electricity.  Tyler had wanted to go out to the mall with his friends and just hang around but as he got up there was a note from his parents asking him to watch out for his little brother Steve, age 14.  So now Tyler was just sitting on the couch watching the new as his mom did not believe in having cable or satellite, as his brother was reading a book across the room.<br>\r\n\"What a bloody nerd,\" Tyler thought.<br>\r\n\"You have a day off of school and what you do go hang out with friends, no you sit at home reading a stupid book. What is up with that?\" Tyler asked Steve.<br>\r\n\"Well excuse me for trying to stay up with my classes not every one can be the all county running champ for three years running,\" Steve said.<br>\r\nTyler thought that, that was true Steve and him were like Yin-Yang, while he was eighteen years of age had a well toned body, and was fairly athletic and stood about 6'7\" well 6'9\" on tip-toe, Steve was fourteen years old was more intellectual, though for some reason he still had a tight body, and stood about 5'8\".  There of course were some similarities between them like that they both had brown hair and startling baby-blue eyes.  There was another similarity that they both shared thought neither of them knew it both of the brother’s were gay.<br>\r\nGetting tired of watching Steve read Tyler got up and went to the kitchen to get a drink as he opened up the fridge he saw what looked like unlabeled Gatorade, thinking nothing of it he grabbed the bottle and downed it all in one gulp.<br>\r\n</span></div></div>",
            "created":1173970920,
            "id":389713,
            "title":"Tyler and Steve"
        },
        "14":{
            "author_id":"ncurto772",
            "author_name":"nic",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Also, would you like to be a boy or a girl?</span></div></span></div>",
            "created":1593070560,
            "id":2856529,
            "title":"A Friend's House"
        },
        "15":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Your classroom",
                "The Chemical laboratory",
                "The Schoolyard",
                "The canteen",
                "A floor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lets go into the School</span></div></span></div>",
            "created":1129105740,
            "id":278362,
            "title":"In the Highschool"
        },
        "153":{
            "author_id":"derhumpf",
            "author_name":"DerHumpf",
            "choices":[
                "Malcolm shrinks by the older girls of his substitutional class",
                "Malcolm shrinks after the pause, when his classmates come back"
            ],
            "content":"<div class=\"\"><div> <span>Malcom wasn't really enjoyed. His whole class went to the fairground but he had to stay in school. <br>\r\n<br>\r\nHe had been caught smoking by a teacher and he reported it to his teacher. He almost finished the essay over how bad smoking is and what it can do to teenagers under 16. It was a stupid topic and he had to give it to his teacher, Ms. Gredstone.<br>\r\n<br>\r\nThe only positive thing on the whole shit was that he had to join a other class. He had the luck to get into the all female advanced course for english, which was two grades over him. All the girls around him where between 17 and 18. It was a nice sight though.<br>\r\n<br>\r\nIt is pause and Malcom just comes out of the school building with a sandwich in his hand. the pause ist almost over and he is on his way to a group of girls of his new class. They havn't seen him yet. After the pause his real class will arrive. Or what is left of it. The only three girls that are comming back are collected by their parents at school. The rest already went home by bus or train or whatever.</span></div></div>",
            "created":1129107120,
            "id":278363,
            "title":"He stayed in"
        }
    },
    "info":{
        "author_id":"millimeter_man",
        "author_name":"Millimeter",
        "brief_description":"You choose the shrinking!",
        "created":1128988680,
        "description":"<td align=\"left\" class=\"norm\">You pick the place or event and let the shrinking begin.<br>\r\n<br>\r\nThe character, (Can be male or female), is shrunk down to a Millimeter, what could happen? I would prefer that giants remain unaware of the shrunken ones.<br>\r\n<br>\r\nAlso, let's keep this to High School Students interacting, no adults. (So ages 14-18 is fine.)<br>\r\n<br>\r\nFeel free to add what you want, just keep away from one-word posts.</td>",
        "id":1020588,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598052540,
        "modified":1598052540,
        "pretty_title":"Random Shrinkage"
    }
}