{
    "chapters":{
        "1":{
            "author_id":"voqua",
            "author_name":"Voqua",
            "choices":[
                "Lucy",
                "Erza",
                "Juvia",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you want tickled?</span></div></span></div>",
            "created":1366779600,
            "id":1577548,
            "title":"Choose a girl"
        },
        "11":{
            "author_id":"voqua",
            "author_name":"Voqua",
            "choices":[
                "Beach",
                "Fairy Hills",
                "Other",
                "Other 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you want her to be?</span></div></span></div>",
            "created":1366779600,
            "id":1577549,
            "title":"Lucy"
        },
        "112":{
            "author_id":"voqua",
            "author_name":"Voqua",
            "choices":[
                "The old lady \"examines\" her.",
                "The old lady does something else."
            ],
            "content":"<div class=\"\"><div> <span>Lucy headed to Fairy Hills to search for the person who posted a strange job. She was wearing this outfit <a rel=\"nofollow\" href=\"http://i6.mangareader.net/fairy-tail/346/fairy-tail-4338903.jpg\" target=\"_blank\">http://i6.mangareader.net/fairy-tail/346...</a><br>\r\n<br>\r\nAs she walked there, she spotted an old woman.<br>\r\n<br>\r\n\"STOP!\" said the old woman as she held out her hand.<br>\r\n<br>\r\n\"Huh?\" said Lucy.<br>\r\n<br>\r\nThe old woman then suddenly jumps towards her.</span></div></div>",
            "created":1366779600,
            "id":1577556,
            "title":"Fairy Hills"
        },
        "1121":{
            "choices":[
                "a strange room tied to a bed.",
                "the middle of an unfamiliar town with her arms and legs in stocks."
            ],
            "content":"<div class=\"\"><div> <span>She examines Lucy.<br>\r\n<br>\r\n\"You have a pretty body!\" said the old woman.<br>\r\n<br>\r\n\"Umm... Thanks, I guess,\" said Lucy. <br>\r\n<br>\r\nThe old lady then pulled out a ring and showed it to Lucy. <br>\r\n<br>\r\nWhen Lucy looked at the ring, she went unconscious. <br>\r\n<br>\r\nShe woke up and found herself in... </span></div></div>",
            "created":1373950800,
            "id":1628811,
            "title":"The old lady \"examines\" her."
        },
        "11211":{
            "author_id":"loody909",
            "author_name":"loody909",
            "choices":[
                "upper body",
                "Lower body"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"text-decoration:line-through\"><div align=\"center\"><span style=\"text-decoration:line-through\">lucy woke up and found herself tied up to a bed in weird room,as she was asking hersalf what happend the old lady opened the door and walked in,\"finally u waked up blonde\".said the old lady.\"wh did u put me to sleep ?and where am i ?and why am i tied up?\" lucy asked as she seemed so nervous...\"relax girl i will not hurt you on the end i am the landlady of the dorm..i am not evil\"..lucy relaxed a little bit ..\"for the reasom i tied you up because i am going to tickle you\"...lucy's jaw dropped\"whaat..Why are you going to tickle me...\"....\"to have fun with this great body you have\" said the oldlady as grin appeared on her face..\"well i do not consent so untie me now\" lucy sounded so nervous after she remebred all the times she was tickled by natsu or cana when she was drunk or even erza sometimes...but all the tickling was for few second and giveb that she was tied she know this time it will be more then few seconds....\"you are the one whos tied up silly i decide when to untie you;its not your call\"..as lucy realized how helples she is she started begging \"no please hust untie me i will give you money if you want\"....\"i dont want money blonde all i want is to hear your laughter\"...and because i am nice to you i will give you 2 choises ......u want me to tickle your upped bode or lower body?</span></div></span></span></div></div>",
            "created":1601389320,
            "id":2912280,
            "title":"a strange room tied to a bed."
        },
        "112111":{
            "author_id":"loody909",
            "author_name":"loody909",
            "choices":[
                "what happend in the 2 hours of torture"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\">Ok then i choose the upped body..lucy said with a blush on her face....she is ticklish evreywhere equally she just said to herself it deos not matter..... the old lady climbed the bed and get closer to her belly she had really long nail whitch lucy will know the hard way.....with 1 hand she started playin with lucy's belly very softly....\"hahahmmm\" she tried her best to hold her laughter she didnt want to sound so weak against this old perv lady..\"trying to sound string lets see if u can hold it when i do this\" as her finger got in lucy's belly button she immedietly burst out laughing\"hahahahahahahoNOohohohohohoho noott the bellyhhhhhhhh butttohhhhhhn please stohohoohonp hahahah i beeeg yooooou hahahahaha...\"not so strong as before i see\" the oldlady taunted her....\"hahahahahahahplease i cahahahnt brehahahaathe anymore hahahahahah...i needhahahaha breahahahk\" the oldlady stopped for few seconds\"u deserce a break blonde you are one of the most ticklish girls i ever had i will have a lot of fun with this body of yours\"... after lucy had a good breal so i am not the only one here you ever tickled before?...\"ofcourse you are not silly..i had the girl named erza and one called mirajane they were so ticklish also..\"wow\" said lucy really surprised and imaginning these strong wizard tied up and begging like her....\"break is over now time to get tickled again sweetie...she said as she blows raspberries in lucy belly..\"hahahahahahahahah nohahahahahaha stophahaha thahahahat...\"why would i its so mutch fun\"..\"hahahaha bacahahahuse it tickles sohahahaha muutchhahahahahahah..please stohahahahap..i beg youhahahahahana\"...ok i will stop said the oldlady\".....\"thank you\" said lucy as she trying to catch her breath....\"now its your armpits turn\" \"pleaseee i haad enough\" lucy cried in despair....\"but we are havinf fun u ate laughing you clearly enjoying it so mutch\"..\"i am not\" said lucy trying to sound as series as she can after all the laughter...\"ok how about we make a deal blondie,,i will tickle your armpit for 2 minutes if you can hold your laughter for that time i will untie you, but of you laugh i will tickle you for another half hour and take video if me tickling you..ok??......kucy start thinking what she gonna do of that video come out it will be so embarassing,, but if i didn't laugh for 2 minutes i will be free from this hell...\"deal\"said lucy as confident as she can be,,..\"lets go\" the oldlady said as she started the timer ,,she didnt waste anytime as she started scrubbing her nail.on both of lucy's armpits,,\"hmmmmm\" she almost laughed in only the first 10 seconds,,,i can hold i can hold it she kept saying that in her mind, after 1 minute has passed that felt like forever<br>\r\n<br>\r\nWhat a strong will you have blondie...she pulled bottle of baby oil and put it in lucy's armpits....\"what is that?\" Lucy asked nervously...its baby oil she told her\"it will make you laugh for sure\"..\"never\" said lucy firmly...the old lady get close to lucy's ear and whispered to her i will break you blondie so just laugh and submit to the tickling\" and she begins to tickling again...and in less the  10 seconds lucy's laughter couldve been heared in the room\"hahahahahahahahahahahahahahahahahahahahahahahahahah\" \"haha you most blondie\" ...\"hahahahahhahahaha please stoahahahahap.i beghahahahahs yohahahahahahu...i cant take ithahahahahahaha anymorehahahahahahahshahahahahahahahsh\" mercyhahahahahahahahahahaha havehahaha mercy on mehahahahahaha\" \"say i love to be tickled and i will consider stopping\"....\"hahahahahaha i love hahahaha to be hahahahaha tickleehahahahahd\"........luder blondie i didnt hear you\" the oldlady tauntes her as tickled her fasteer....\"hahahahahahahahahahah I LOVE HAHAHAHAHAHAHAHAHAHAHAH TO BE TICKLEEEEED HAHAHAHAHAHAHHAHAHAHA PLEASE ENOUGHAHAHAHAHAHAHAH\"...ok bondie i wil stop...as lucy was trying to breathe \"thank you*....as the oldlady grinned evilly...but i will stop tickling you after 2 hours honey not now.....lucy's eyes popped off\"whaaaat you cant be series\"...i am so series honey....as she started wiggling her fingers in the air saying \"tickle hell in only beggninig sweetie\"....\"someone help me\" was the last thought in lucy's mind before the torture continued.</div></span></div></div>",
            "created":1601396520,
            "id":2912334,
            "title":"upper body"
        },
        "11212":{
            "choices":[
                "Everyone tickles her with angel feathers",
                "Everyone tickles her with the stuff they have"
            ],
            "content":"<div class=\"\"><div> <span>People around her had feathers, toothbrushes, hairbrushes, and an angle feathers. See finally sees her boots and socks off, she's in her bikini, and her feet and hands are in stocks. Her hands were above her head and her toes were tied to the stocks.<br>\r\n<br>\r\nLucy; What the hack is going on.<br>\r\n<br>\r\nThe old woman; You are in our tickle festival my young lady.<br>\r\n<br>\r\nLucy hates being tickled, exsepiacilly when she's like the most ticklish girl in the world. It all started Whalen she try to cast a spell to make a woman the most ticklish girl ever, but it went tiroublly wrong. Now she has to be tickled, but the number one thing she hates is the angle feathers she is really weak against them.<br>\r\n<br>\r\nOld woman; So you're weak against angel feathers.</span></div></div>",
            "created":1397268060,
            "id":1777195,
            "title":"the middle of an unfamiliar town with her arms ..."
        },
        "113":{
            "choices":[
                "Took of her boots. ",
                "Lifted up her shirt up to show her belly.",
                "Another scenario apart from this one. "
            ],
            "content":"<div class=\"\"><div> <span>Captured by the phantom lord Lucy was held in Sky Prison waiting to be rescued. However not wanting her to feel to relaxed about the situation,  Jose Porla the guild master called in a special wizard to take care of her. <br>\r\n<br>\r\n\"You know what to do,\" Jose said shutting the cell door behind the hooded wizard. From where she lay, Lucy could see her guest wore a black hooded cloak which hid his identity. <br>\r\n<br>\r\n\"How are you, what does Jose want you to do to me?\" Lucy asked worried. The wizard turns to face her before saying nothing. <br>\r\n<br>\r\n\"Hey answer me!\" Lucy shouts, but the wizard doesn't. Instead he calls upon a set of dark hand to hold Lucy up by her tied wrist like a piñata . <br>\r\n<br>\r\n\"My task is too keep you busy and to do that I have one idea\" the wizard said.<br>\r\n<br>\r\nLucy didn't now what the idea was but she soon knew when the wizard...<br>\r\n<br>\r\n</span></div></div>",
            "created":1370926800,
            "id":1609261,
            "title":"Phantom Lord Guild capture. "
        },
        "1132":{
            "choices":[
                "A dark feather.",
                "A baby oil bottle.",
                "A special glove."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! What are you...\" the blonde haired girl fidgeted as the unknown wizard grabbed the hem of her stripped shirt and dragged it upwards until it reached the underside of her bust. The top of her rib cage was now exposed.<br>\r\n<br>\r\n\"Do you know what my specialty is young Mage?\" the dark sorcerer asked as he tugged on her blue skirt, pulling it remarkably low until it was aligned above her silky white panties, revealing a lot more flesh. Her hip bone was now displayed. <br>\r\n<br>\r\nNow, her entire midriff was on exhibit as she instinctively tried to suck it in from her captor, unsure of what he was attempting to do. Truth be told, her stomach area was her most ticklish spot of her entire body. She desperately hoped that it was not what she was expecting. A single touch could send her into hysterics and god knows what might happen if it came down to that. <br>\r\n<br>\r\n\"I see that you might know the answer to that question.\" the man grinned, revealing his toothy smile which sent chills down her spin. \"But if I must break it to you, I am known as the Tickle Magician. I am hired by many guilds to tickle smooth captives like you until you break and beg me to stop. I have tortured men and women alike and none have been able to withstand what I do. Although I have only been recruited to 'keep you busy', I intend to mercifully torment you until I feel like taking a pause. You will get NO mercy from me.\"<br>\r\n<br>\r\nNow Lucy was feeling the state of nervousness. She knew very well which spots were sensitive on her figure but the worst one was unprotected at the moment. The Celestrial Spirit Mage tensed her body as she recognized ten small digits wiggling in the air as if to tease her, getting closer and closer to her uncovered abdomen. The woman extracted her stomach as far as possible to escape the deadly entities, but it only delayed by a few inches and she knew that it was inevitable. <br>\r\n<br>\r\n\"Yes, I know that this is your ticklish spot.\" the enchanter clarified. \"My magic allows me to sense your sensitivity and it is radiating fiercely in this area. Are you ready for this my little slave? Kootchie Kootchie Koo!\" <br>\r\n<br>\r\nIn the act of finishing his sentence, his fingers plunged into her hypersensitive guts and gently squeezed the surface of the soft flesh. Lucy's eyes shot open and bulged out of their sockets as her jumpy paunch was titillated and there was nothing she could do about it. She tried to jiggle her fists free from the dark hands holding her wrists, but it was no use. So she just relaxed her abdominal muscles as she felt hot meat hooks pinching her delicate sides as she let out a roar of laughter from her buccal cavities: <br>\r\n<br>\r\n\"NYAHAHA AHAHAHAHA AHA HAHAAHAH AHAHAHAHAHAHA AANOANONONON AHAHAHAHAH AHAHAHAHAH HAHIAHAHEHAHAAHAHIAH AHAHAHAA STOP IT HEHAHAHAAHA I CAN'T TAKE IT! HEAHHAAHAHAAA\"<br>\r\n<br>\r\nThe man simply ignored her pleas as his phalanges teased the soft derma of her concave belly. He kneaded her fragile waist using the \"Index-Thumb\" technique. Placing the designated fingertips on her leg joints, the necromancer rallied his digits together in the middle section near her groin, like two lovers reuniting together. The wizard received the desired effect as Lucy embarked on a trip further down the realm of hilarity. <br>\r\n<br>\r\nThe key-user was on the verge of tears as her volatile locus was exploited by this tickling expert. His hands moved in unpredictable pattern, which kept his element of surprise. Sometimes he would stop his assault, making her think that the deed was done, only to proceed in unexpected arrangements. Despite her predicament, she was determined to survive his onslaught. A nip on her flanks, to the rib, to the tummy. All of these produced tingling sensations to her nervous system, which was starting to malfunction from all the pokes. <br>\r\n<br>\r\n\"Tickle tickle tickle my little slave...does it tickle when I do this? What about here? And here? We need to check around these parts too...\" the adult cooed as he sustained his prosecution. His teasing words only attributed to the torment as he watched the young golden damsel squirm under his fondles. <br>\r\n<br>\r\nLucy continuously yelped from the contact of his phalanx with her flat and well toned midsection, prodding his digits around her sternum while he lightly scratched below her belly button. The itching sensation was gruesome as her laughter turned into screams in the blink of an eye. Her sweat transcended down her bare stomach as the wizard carried on his onrush. It seemed like he had taken interest on the little hole located in the middle of her dazzling abdomen as he squeezed the edge of her venter, sending more pulsations down her exhausted physique.  <br>\r\n<br>\r\n\"My, my...you do certainly have a gorgeous stomach my dear. I can sense that your belly button is equally as ticklish. How about we test that out?\" the hypnotized warlock questioned as his nails trailed alongside the rim of her navel, getting closer and closer to her umbilicus. <br>\r\n<br>\r\n\"NYAHAAHAHAHAHA HAAHAHAHAHAHAH NOOOOO AHAHAHA AHAHA HAHAHAHAAHAH AHAHAHAHA AHAHAHAHAHAA LEAVE IT ALONE HEAHAHAHAHA AHAHAHAH AHAHA HAHA HAHAAHHAAHAHAHAH AHAHAHAHAHAH AHAHAAAAAAAAAAAAAAAAAAAAAA\" the poor girl cried out, tears exceeding her eyes. Her hair spread over her pupils, overshadowing her brown peepers. <br>\r\n<br>\r\nAt a certain point in time, the wizard stopped his torture and laid his item pouch on the dungeon's floor. Lucy was not able to see what he was doing, but her heart stopped for a moment as she saw what her captor carried in his palm.<br>\r\n<br>\r\n<br>\r\nIt was...<br>\r\n<br>\r\n</span></div></div>",
            "created":1424648400,
            "id":1938599,
            "title":"Lifted up her shirt up to show her belly."
        },
        "11321":{
            "choices":[
                "He let Lucy go.",
                "He continues to tickle her."
            ],
            "content":"<div class=\"\"><div> <span>\"Wha-what is that?\" the fellow blonde Mage asked slightly frightened by the object at his disposition.<br>\r\n<br>\r\n\"This, dear, is what we call an angel feather. It is said to have been crafted by holy spirits and one stroke is equivalent to a thousand. It is very efficient in its duty, and I have been searching for this during my entire career. Fortunately, I was able to receive one myself in exchange for my services. These are highly exquisite and rare, there are only a few left in the world.\" the wizard clarified. \"And now, I am going to test it out on you.\"<br>\r\n<br>\r\nLucy looked like she was going to wet herself. The key-user did not want to be at the receiving end of that plume, no matter what happened. Sadly, the dark hands restraining her ruined any chances of escaping. The only thing she could do is observe as the substance neared closer and closer to her exposed abdomen.<br>\r\n<br>\r\n\"Tickle tickle tickle my little slave!\" the necromancer whispered seductively as the covert made contact with her smooth and toned skin. The torment had only begun, but the captive already broke down. The plumage dusted beneath her solar plexus, moving down the line that led to her belly button. A few seconds passed and the girl exploded with guffaws.<br>\r\n<br>\r\n\"HAAHA HAWHWH AAAHAHAHAA AHAHAHAHAA HAHOHOHOHEHA AHAHAHAHAAHAHHA OH MY GAWDDHEHEHEAHA AHAHAHAH AHAHAAHHAAHAH IT'S TOO MUCH HEHEA AHAHAHAHAHA GET IT OFF GET IT OFF HEHEAHA AHHAHAAAAAAAA\" the gal shifted in her position. <br>\r\n<br>\r\nThe sensation was undeniably powerful and prompted much more laughter than the previous methods. The device trailed down her lower tummy, brushing on the delicate area of her hip bone. The magic feather affected the sorceress' nerve endings; while it titillated the layer of flesh, it left a dusty entity on her skin that doubled its sensitivity. That was only a sample of what it could do.<br>\r\n<br>\r\nThe plumule travelled her rib cage, to her curves and finished at the waist section. After the man made sure that every parts of her stomach were afflicted by the tool, he slowly circled the hem of her navel following a specific axe. Lucy was already on the brink of insanity by this point. The feather plunged in the tummy hole, twirling around like a toilet flush. Like her midriff, the broad's crevice was now beset by the weapon's magic and it felt like millions of digits caressed the hypersensitive umbilicus. It was truly unbelievable. <br>\r\n<br>\r\nThe afflicted experienced a new definition to the words 'Tickle Torture'. Whilst the dark quills tormented her umbilical cord, the torturer used his other free metacarpus to tickle the lass' belly to test out the outcome. He wiggled his fingernails on her ribs like he was playing the piano and judging by the increase of snickering, it looked like he was jamming the right notes. The spell was a success and the female felt three times more jumpy than before. Tracing down her curves, the imprisoner pinched her dainty flanks. That was the last straw seeing as the golden maiden found energy left inside her spirit to shout one last time.<br>\r\n<br>\r\n\"AHA AHEHEHA HA AHAHAHOEH EAHAHAHAHA AHAAHAHAH STOOOOOP EHEHA AHAHA AHAOHE EHAHAHHAHAHAHAH STOOOOP IT HEEHA AHAHAHAHA WHAT DO YOU WANT? EAAHA AHAHAHAH AHAHAHAHAHAAAA\" she managed to state before the young adult embarked silent laughter.<br>\r\n<br>\r\n\"Like I said, I'm here to entertain you. Are you not entertained?\" the magician questioned while he continued his cruel torture. \"Perhaps you need even more amusement, is that what you're saying? Then I am most happy to oblige madam!\" <br>\r\n<br>\r\nAfter he completed his sentence, Lucy noticed four more dark hands appearing above her physique. They were each holding a white feather of their own and they drew at close quarters to the woman's breadbasket. Unable to speak, the juvenile lady shook her head to signal her disagreement but her gesture was ignored. <br>\r\n<br>\r\nThe soft fabrics established itself on the grown-up's midsection, grazing over her touchy epidermis. Two gingerly caressed both of her sides respectively while another assaulted her sternum. The last one took her pelvis section, sweeping its extremity dangerously close to her private region. Not to mention, the special plume was still exploiting her bare belly button. To say that it was gruesome would only be an understatement. <br>\r\n<br>\r\nThe platinum damsel felt five different organisms smiting her tummy and she felt like dying right there and then. Of course, she was unable to fall unconscious to intercept the sentiment because the torturer knew exactly when to stop to prevent such thing to happen. The anguish stopped for a couple of seconds then recommenced unexpectedly. <br>\r\n<br>\r\nLucy's watering eyes began to close themselves. When she thought that this would be the end, the stimulation stopped and the shadowy palms disappeared. The dark feather retracted from the girl's navel and the unknown assailant smooched her bright pink stomach. Said individual was mixed with embarrassment and pleasure. Placing a final kiss on her omphalos, the man stood up and left the room to prepare for other tasks. The blonde Mage was left alone inside the chamber with her bangs covering her teary peepers. Her abdomen shivered from the cold air brushing against her skin.<br>\r\n<br>\r\n<br>\r\nAfter what seemed ages, the man returned. What he decided next would change Lucy's destiny forever...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1425172260,
            "id":1941559,
            "title":"A dark feather."
        },
        "1133":{
            "choices":[
                "Fight with Flare",
                "Another ",
                "Another"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> How about this or you choose another. </span></div></span></div>",
            "created":1372222800,
            "id":1618132,
            "title":"A fight with Flare"
        },
        "12":{
            "choices":[
                "Fairy hill. ",
                "Out on a job.",
                "  Prison cell in the magic council. ",
                "other choice ",
                "other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is it that Ezra receives her tickling.</span></div></span></div>",
            "created":1370926800,
            "id":1609275,
            "title":"Where is Erza?"
        },
        "122":{
            "choices":[
                "Erza does as he says; it's a lot of jewels!",
                "Erza leaves immediately; it's not worth doing something she'll regret.",
                "Erza questions him about it; it's not a bad idea to get more details."
            ],
            "content":"<div class=\"\"><div> <span>Erza Scarlet, proclaimed as the number one warrior from the Fairy Tail guild, was browsing through the familiar job list on the habitual mission board. The commissions themselves ranged from standard chores to bandit arrests and so forth; nothing that the red-haired combatant hadn't gone through in her experience. Erza was a senior veteran and a unique, yet puissant mage in her own rights, so it wouldn't be staggering that she desired to accomplish a task of her calibre - one that would procure a satisfying price in return. As of then, there weren't many possibilities that met her requirement; the fighter wished to find an errand that stood out of the bunch. The female almost thought of abandoning before feasting her eyes upon a request that caught her attention; an assignment displayed a reward of one million jewels to the one who completed it, an astonishing recompense that she had never witnessed prior to this. <br>\r\n<br>\r\nSneaking a glance at her peers, neither of them seemed that shocked nor captivated by the outstanding employment. If an undertaking such as this contained a payment as unbelievable as this, she was certain that others would at least pay more awareness to it. It didn't appear to be as so, the poster was mainly ignored by the incumbent occupants. Snatching the notice from the plank, Erza began to read its content; a man necessitated assistance in his household not too far from her current location. The bulletin implied that the individual in question desired a <i>woman</i> to aid him in an unspecified matter which he was in no capability to fulfill in his present form. The powerful wizard was initially perplexed at first; why would anyone post an enormous perk for such a trivial affair? Regardless, the money was too excessive to neglect and Erza prepared to head out to the designated whereabouts. <br>\r\n<br>\r\n\"Wait, Erza-san!\" an accustomed voice was heard behind her. A medium-height, slender and blonde figure approached the crimson dame in a slight hurry. The young lady was patently distinguishable as one of her close companions, being none other than the key-user Lucy Heartfilia. The rushing colleen halted for a short instance to recover her energy after her sprint, bending down to accommodate her zonked shape. <br>\r\n<br>\r\n\"Lucy... what is it? I am in kind of in a hassle as we speak,\" Erza demanded in her normal, commanding tone. The quicker she finished her labor, the merrier she'll be. The robust servicewoman did not have time to waste by loitering around. <br>\r\n<br>\r\n\"I'm sorry to bother you, but I noticed how you looked at that job...\" the platinum personage gestured to the fabric of paper in the cardinal-pelted gal's disposal. \"I should warn you that the customer is very creepy and sort of...uncanny. Not many want to work for him and that's why I wanted to let you know of his character before you left. See you later!\" With that being said, Lucy departed - leaving a dazzled wench. She pondered on her friend's description for a short juncture, but shook her head nonetheless. If her client was as disturbed as her comrade stated, it did not matter in any case. If he became disarranged near her, the member would have no dilemma overpowering her assailant. Erza possessed the confidence in her skills and abilities after all - no complications would stand in her way. Although, the adult couldn't suppress a strange consciousness in the back of her mind, as if something heinous would occur during her adventure. Setting her crane straight, she commenced her journey to the bloke's home. <br>\r\n<br>\r\nDrawing near the correct residence, the strapping conjuror peered at the little shelter. There wasn't anything extraordinary about it, which made her partially skeptical about the abundance of jewels that were promised from the solicitation. The apartment resembled Lucy's excessively and the environment looked peaceful and harmonious - a trait that reassured her moderately. Marching towards the entrance, Erza rang the doorbell situated on the proximity and awaited the domestic's approval. It didn't take quite long before someone came, unbolting the entry from the adjacent border. <br>\r\n<br>\r\n\"Hello there, how may I help you?\" the middle-aged fellow queried with a friendly demeanor. He was tall - surpassing the broad's height by a foot or two - and was dressed in a conventional attire; a pair of blue jeans and a white t-shirt that matched his bleached socks. The gent retained short curly brown hair with appealing ocean blue peepers. He was quite skinny, if not muscular and seemed overall kind and semi-attractive. The lad was definitely not what she was expecting due to her blonde confidant's comments, but he looked honest and sincere - a characteristic that the singleton could respect. <br>\r\n<br>\r\n\"Yes, afternoon. I believe you are the one who seeked a helping hand from the Fairy Tail guild?\" she retorted politely. \"My name is Erza Scarlet, and I hail from the association. I've come to aid you in whatever you desired, in exchange for the large sum that you pledged.\"<br>\r\n<br>\r\n\"Ah, I recognize you now. The famous S-Class Mage of Fairy Tail, Erza Scarlet. I am indeed honoured to be in your presence,\" the male bowed in highlight of one reputed and superior. \"You're right, I'm the one who asked for the favor. Please come in.\" He invited the maiden into his expanse. Settling the damsel in the living room, the chap decided to clarify. \"You see, I've recently purchased some items that I'd like to be tested on. I knew that the willing candidates would be slim to none, so I chose to upgrade the perquisite. I got a bit discouraged seeing as no one came to me, that is until you arrived. I am extremely grateful for that and I will keep this short. I've heard that you were one with many armors that you can requip at your control, and I was wondering if you had any that was less...extravagant than that. For my artifacts to function properly, you'll have to wear something comfortable and convenient to adorn.\"<br>\r\n<br>\r\n\"Is that so? I believe I have something appropriate...\" Erza responded by switching garments. Her wonted imperial panoply was replaced by her japanese clothing; bandages covered her breasts and long trousers with flaming patterns engulfed her lower body. She could have sworn noticing a faint smirk on the opposite being, though dismissed it as an hallucination. Whilst the outfit left her gravely exposed, it was very advantageous as it provided much agility. <br>\r\n<br>\r\n\"It's...perfect. Please follow me,\" the unnamed menfolk guided her to his bedroom with glee. The compartment was considerably cramped, yet it had beautiful decorations and his rich origins was tremendously exhibited. His personal room, albeit, was rather dull and plain. A beige contour and wooden floor, accompanied by a masterbed with yellow sheet, followed by a desk and chair, as well as an ethereal abstract painting. Per contra, the mattress was distinctly strange since it had four metal shackles, two in each respective sides. The outlander shut the door as Erza penetrated in its wilderness. \"Alright, I'll need you to put your wrists and ankles through those restrains and we'll be ready to start.\"<br>\r\n<br>\r\nDespite his orders, the mage initiated a doubt behind the hombre's true intentions; why did he want her to be repressed in those cuffs? Something very odd was occurring before her very orbs, and she was conflicted in the whole ordeal. The idea of turning back and escaping was very captivating at that moment, but the load of funds was still visible in her mindscape. Erza entailed a decision quickly; the man was patienting for her move. <br>\r\n<br>\r\nWhat will she do?<br>\r\n<br>\r\n </span></div></div>",
            "created":1429064940,
            "id":1964454,
            "title":"Out on a job."
        },
        "123":{
            "choices":[
                "Her feet",
                "Her underarms",
                "Her sides"
            ],
            "content":"<div class=\"\"><div> <span>After taking the blame for destroying all the building on her last contract Ezra sat in one of the Council's prison cells. She sat on the prison bench waiting for the time to pass when after a few minutes, a run knight came to the front of her cell. <br>\r\n<br>\r\n\"Ezra scarlet\" he called catching her attention. The magic council have ruled that due to your recent destruction of building that your sentence will not be enough.<br>\r\n<br>\r\nTherefore with you as a prisoner of the council and the current need to form an alliance with the dark guilds of this kingdom, the council an agreement to allow them to own you for a few hours securing the alliance between dark guild and the magic council.\"<br>\r\n<br>\r\nEzra couldn't believe this, it was not enough for her to be in prison for no reason but now she was to be some dark guild plaything for a few hours. <br>\r\n<br>\r\nSadly she did not get time to complain before she was put to sleep and taken before the dark guild member, who had a small bed room for their meeting. <br>\r\n<br>\r\nOnce there the wizard asked her to lay on the bed before finally getting down to business. The wizard was allowed to tickle Ezra for 2 hour before a guard would get him, however where would he start.  </span></div></div>",
            "created":1372222800,
            "id":1618138,
            "title":"Not enough punishment"
        },
        "1233":{
            "choices":[
                "A special feather duster.",
                "More people.",
                "A navel tickling orb."
            ],
            "content":"<div class=\"\"><div> <span>Grabbing Erza's wrists, the wizard then extended them upwards, way above her head, and inserted them in a pair of magic handcuffs that would disable any kind of witchcraft from the captive. In doing so, her ribs were given more definition and they could be seen peering through her flesh.<br>\r\n<br>\r\nThe woman's clothing was extremely revealing. Her attire consisted of bandages around her chest and red saggy pants that necessitated supports to keep them from falling. It was decorated with orange flames at the bottom, and the upper region had white stripes. Her wardrobe left her entire belly on display, from the very top of her ribs down to her exquisite hip bone.<br>\r\n<br>\r\nThe necromancer wasted no time as he brushed both of his index on her curvaceous sides, gently feeling the soft fabric of her skin. The red-haired warrior lightly squirmed under his touch and twisted her torso to try escape his delicate graze. The man's smile widened seeing this reaction and dug deeper into her edges, squeezing the flesh to send pulsations down her firm figure. <br>\r\n<br>\r\n\"Wha-what are you doing? Stop that!\" Erza shouted as her upper body was given the treatment. Believe it or not, under the female's tough girl persona, she was actually a very ticklish girl. <br>\r\n<br>\r\n\"Don't be too surprised. You were assigned to be our playmate for 2 hours, and I was tasked to give you a proper welcome.\" the sorcerer grinned, showing his glowing white teeth. \"And I've always learned that laughter is the best medicine. Tell me, are you ticklish?\"<br>\r\n<br>\r\n\"No, do not waste your time by even attempting to. I do not possess any-- KYA!!!\" the young gal yelped as her side was pinched around her waist section, interrupting her mid-sentence.  <br>\r\n<br>\r\n\"Seems like you're lying to me young lady. Do you know what I do to naughty little liars like you?\" the magus asked while his fingertips wiggled in the air, approaching closer and closer to his slave's uncovered abdomen. <br>\r\n<br>\r\nErza gasped and extracted her abdominal muscles, essaying to evade the deadly digits that were drawing closer and closer. While she had never been titillated before, the girl knew exactly which part of her body was hypersensitive; her stomach. Despite the fact that most of her armors reveal this specific region, she could not stand it being tickled. <br>\r\n<br>\r\n\"Awww...is your tummy ticklish? What would happen if my fingers brushed against it? Tickle tickle tickle...\" the torturer whispered erotically in her ears as his digits came in contact with the delicate surface of her guts. His fingers darted everywhere, spider tickling the contour of her belly. He danced them around like he was playing the piano, prodding his phalanx in every direction. The man enjoyed her midsection spasm under his touch, digging deeper into her dainty flesh.<br>\r\n<br>\r\nThe Mage bit her lips, detaining her laughter. She did not want to give in to his desires and she fiercely agitated her torso to elude the wiggling phalanges that were teasing her epidermis. Her struggles were meaningless since it only dropped her already low pants even further, exposing more and more of her feet. The new spot was targeted next by the wobbling extremities. The woman could not hold in her cackling much longer, a few giggles and 'eeping' sounds came out of her mouth.<br>\r\n<br>\r\n\"Noo...heheaahaa 'eep' hahaaha ahahaaaa ok fine hehaahahaha 'squeal' my stomach is ehahahaah aahahahaah ahahahahahaha hahahahaah very ticklish ehahahaha ahahaaaaaahahahahahaa\" she conceded. <br>\r\n<br>\r\n\"Ahh yes, I kind of figured that out already. But I wonder if your belly button is equitably as sensitive?\" he rhetorically questions as his lips reached the boundary of her navel. Erza moaned in somewhat pleasure as the wizard placed soothing smooches directly on her crevice. The sentiment was clearly enjoyable for the young warrior. <br>\r\n<br>\r\n\"Ohh...enjoying this aren't you? Then you'll <b><i>love </i></b> this!\" he explained as the sorcerer blew a prolonged raspberry straight into her belly orifice, sending tingling sensations down her figure.<br>\r\n<br>\r\n\"Ugh HAHAAHAHA AHAHAHAHAHAHAHA AHAHAAHAHA WHAT IS THAT? EHAHAHAHA AHAHAHAAHAHA HAAHAHAHA WHAT ARE YOU DOING HEAHAHA ANAYAYAHAHAHA AHAAKAYAAAAAHAHAAHAHAHAAA\" Erza squawked from the stimulation. <br>\r\n<br>\r\n\"These are raspberries my dear! PFFFFTT PFPFFFFFTTT PFFFFFFFPFPFPFPTTTTT, do you like them?\" the magician queried as he consistently assaulted his slave's bare umbilical cord. The entity was covered in the man's saliva as he repetitively applied the same technique over and over again, sending the gorgeous beauty into a frenzy. <br>\r\n<br>\r\nMassive amount of sweat dripped down her frame as the fellow dragged his nails over her exhausted midriff, arriving at her unprotected pelvis. The individual kneaded her jumpy hips using the lobster claw technique. He grabbed as much skin as possible underneath his palm, gathering it in one place, then releasing it back to its original structure. The effect from the stratagem seemed to do wonders as Erza's laughter increased gargantuously. While one of his meat hook still palpated her waist, the other one jiggled her right flank. <br>\r\n<br>\r\nEventually, the red-haired combatant fell unconscious from the large amount of titillation, her energy having been drained from her body. The man patted her stomach and went to pick up some tools from his bag.<br>\r\n<br>\r\nAs soon as the girl awoken, the first thing she saw was... <br>\r\n</span></div></div>",
            "created":1424658120,
            "id":1938695,
            "title":"Her sides"
        },
        "13":{
            "choices":[
                "Fairy tail guild building",
                "Phantom guild building",
                "Other choice",
                "Other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where should Juvia be tickled?<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1370926800,
            "id":1609274,
            "title":"where is Juvia?"
        },
        "133":{
            "author_id":"king13z",
            "author_name":"King13z",
            "choices":[
                "The man walks behind Juvia",
                "Walks in front of juvia"
            ],
            "content":"<div class=\"\"><div> <span>  Juvia awoke in a dark room, groggy and alone. The bluenette attempted to move and was met with the rattle of chains. Juvia realized she was restrained in the center of the room, her arms tied above her head in a set of handcuffs. She was also seated in a chair, with her socked feet tied to a small stool in front of her. <br>\r\n  Just as juvia struggled to free herself, a door opened and a young man in a dark cloak appeared before her. \"Hello my dear, I hope you are quite comfortable.\" Juvia snapped at the man,\" no, I am not. Why am I here, and who are you?!\"<br>\r\n The man smiled, \"my name is not important, but I have been hired by Raven Tail to get a little information about fairy tail, and I so happened to see a beautiful  woman with the famous logo\"<br>\r\n  \"I will never tell you anything about my friends \" juvia shouted. </span></div></div>",
            "created":1473736500,
            "id":2209567,
            "title":"Interrogated  by raven tail"
        },
        "14":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Cana Alberona",
                "Mirajane Strauss",
                "/Wendy Marvell",
                "Mavis Vermilion",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of these targets?</span></div></span></div>",
            "created":1366952400,
            "id":1578736,
            "title":"Other"
        },
        "141":{
            "choices":[
                "Fairy tail bar",
                "On a job",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Cana get tickled? </span></div></span></div>",
            "created":1370926800,
            "id":1609278,
            "title":"Where is Cana Alberona?"
        },
        "142":{
            "choices":[
                "the Fairy tail guild master's office ",
                "At the Fairy tail bar",
                "other places."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Mirajane get tickled?</span></div></span></div>",
            "created":1370926800,
            "id":1609277,
            "title":"where is Mirajane Strauss?"
        },
        "143":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "Wendy is tied upon a tree!",
                "Entangled in a huge spiderweb!",
                "Awakens in a chamber cell!"
            ],
            "content":"<div class=\"\"><div> <span>\tA blue haired Dragon Slayer, Wendy, is traveling in the woods alone to complete her quest. From the guild of Fairy Tail, she chooses a mission from the bulletin board. According to the assignment, a gang of thieves have stolen many rare types of loot at midnight. Anyone who attempted ward off the enemy has failed. Therefore, a wizard who uses magic is wanted to defeat these villains and to return the loots. Wendy overhears a rumor that the thieves will steal a dangerous special orb that can steal magic.<br>\r\n<br>\r\n\tAs time approaches midnight at nighttime, Wendy is too late. The orb is already stolen. Shadowy figures snoop around in the woods, running away. That must be them! She follows the suspects, using her nose of a Dragon Slayer to sniff them out. Inhaling a large quantity of air into her lungs, “Roar of the Sky Dragon,” she exhales a beam of high pressure wind. The violent vortex of wind creates a path, knocking down the trees and obstacles in its way and alarming the group thieves. <br>\r\n<br>\r\n\t“A wizard?” A cloaked figure signals the other seven figures to go on without him. <br>\r\n<br>\r\n\t“Return the orb back to where it belongs!” Wendy demands.<br>\r\n<br>\r\n\tPulling an object from his pocket, he reveals a purple orb, glowing with an evil aura, “You’re referring to this, aren’t you? You’ll have to come and get it yourself.”<br>\r\n<br>\r\n\tWith no other option, Wendy engages battle. She spread her arms open, “Sky Dragon’s Wing Attack,” and she unleashes a violent whirlwind from both of her arms, twisting and rotating at the target. <br>\r\n<br>\r\n\t“Void magic…” An invisible sphere expands throughout the woods, dispersing Wendy’s attack.<br>\r\n<br>\r\n\tSuddenly, Wendy feels the air in her lungs being forcefully exhaled. There is not a trace of air around her, and she cannot breathe. Everything is dark at night; she couldn’t see her opponent very clear. She tries to speak, “…,” but no sound expels from her voice. Without air for sound to vibrate, sound cannot exist. Wendy hears absolute silence with nothing to inhale.  “It’s no use… I can’t breathe. No… I can’t give up. There must be a limit to how far this void exists.” Wendy runs in the opposite direction, away from the castor of this spell. A few steps later, she collapses onto her knees. She feels her mind beginning to shut down, and her vision starts the blur. Tilting aside, she lays unconscious in the middle of the woods. <br>\r\n</span></div></div>",
            "created":1367298000,
            "id":1581925,
            "title":"The clash of Wind and Void!"
        },
        "1433":{
            "author_id":"masuta",
            "author_name":"Zero",
            "choices":[
                "To make it up for her, he assists her on escaping!",
                "Another round of tickling!",
                "The entire building is raided by Fairy Tail wizards!"
            ],
            "content":"<div class=\"\"><div> <span>Slowly coming to her senses, Wendy awakens in a dungeon cell underneath the ground. The clean room is completely empty. Tiles of bluish grey marble makes up the floor. The series of rectangular bars made of steel lines up vertically among the locked entrance. Outside of her confinement is a large empty room with a corner that leads to another hallway in which she cannot see. The outside room contains four small lamps, a lamp in each corner which illuminates a dim yellow light. They are the only source of light that allows her to see. <br>\r\n<br>\r\n\tAs soon as Wendy attempts to sit up, she feels her wrists being handcuffed together behind her back by thick ropes. Rolling onto her feet, she stands up with little energy and magic within her. “ROAR OF THE…,” she inhales the air around her, “SKY DRAGON!” A puny gust of wind jets out of her mouth in a futile attempt to break the steel bars. Catching her breath, she realizes that it would be better to rest for her magic to return. Stepping to the back corner of the room, she leans her back against the wall to sit down, stretching her legs in front of her. Closing her eyes, she carefully laid her head against the wall beside her to sleep.<br>\r\n<br>\r\n\t A few moments later, something flies into her cell with a clattering noise. Quickly alerted, Wendy notices two small dices rolling towards her to a halt. One dice is black with white dots, and the other dice is red with white dots. Who tossed the dices? She peeks outside of her cell, and a shadow of a human approach towards her in silence. Cowering in fear, she returns back to her corner in her sitting position.<br>\r\n<br>\r\n\tWendy picks up a young voice, “Pssst! Hey! Could you return the dice back to me?” The girl scrutinizes the figure who wears a dark green cloak with a hood over his head. With her hands being unavailable, she gently kicks the two dices between the bars to the other side. <br>\r\n<br>\r\n\tBending over, the stranger extends his hand to pick his dices up. He smiles, “Thanks!” Afterwards, he doesn’t seem to have any intention of leaving. Squatting down, he quietly speaks to the captive, “That blue symbol on your right shoulder, you’re from Fairy Tail, aren’t you?” <br>\r\n<br>\r\n\tWendy slowly nods, not sure of the outcome of her response. The one speaking to her seems to be the same age as Natsu.<br>\r\n<br>\r\n\t“That’s awesome! They’re one of the strongest guilds around.” The unknown stranger holds up his hand, revealing the two dices between his fingers, “You seem lonely in that corner over there. I’m pretty bored myself. Let’s play a game to pass some time. I don’t think the others will do anything to you for a while.” His spare hand shows the dangling keys as he unlocks the barred door to Wendy’s cell. <br>\r\n<br>\r\n\tWendy is tempted to make a run for it, but she doesn’t have the strength to take down the cloaked boy, especially with her hands tied behind her back.<br>\r\n<br>\r\n\tThe cloaked figure finally pulls his hood down, revealing his true face. His most noticeable feature is his messy white hair. Pulling Wendy off the wall, he unexpectedly helps untied to the ropes off her hand, “It’ll be hard to play if you can’t use your hands.”<br>\r\n<br>\r\n\t“… Who are you?” Wendy whispers. A red dice is placed onto her hand.<br>\r\n<br>\r\n\t“Let’s play a game. Whoever rolls the highest number wins. If I lose, I’ll let you free. If I win, you’ll have to play another game with me.”<br>\r\n<br>\r\n\t“Really?” Wendy doesn’t see any risk in his deal. Going first, she quickly rolls her dice. Clattering across the color, the red dice shows four dots on top.<br>\r\n<br>\r\n\t“My turn,” The boy flicks his dice into the air. Bouncing off the ground, the black dice shows up five dots. “Looks like I win. You’re the victim.” Picking up the two dices off the ground, he explains the next game, “The black dice determines the location of where I tickle you, and the red dice determines the amount of time you’ll be tickled.”<br>\r\n<br>\r\n\tWendy is oblivious to how ticklish she is, and she finds this game rather unorthodox. “Err… Do I have to play this game?” She is given two dices in her hand. <br>\r\n<br>\r\n\t“Please!” He begs, “For the black dice, if it’s a one or a two, then I tickle your armpits. If it’s a three or a four, then I tickle your tummy. If it’s a five or a six, then I tickle your feet. For the red dice, each dot represents five minutes!”<br>\r\n<br>\r\n\t“How will you keep track of the time?” Wendy curiously asks.<br>\r\n<br>\r\n\tThe cloaked figure pulls his sleeve to show the watch on his wrist, “I can just set the time. It’ll beep when the time is up.” He gestures her, “Go on and roll the dice!”<br>\r\n<br>\r\n\tDropping the two colored dices, they clatter across the room and reveal Wendy’s fate. The black dice reveals a three, and the red dice reveals a four! In other words, Wendy will be tickled on her tummy for twenty minutes.<br>\r\n\tSetting his watch for twenty minutes, he immediately pounce the girl to the ground and begins wiggling his fingers on her sides.<br>\r\n<br>\r\n\tInevitably, Wendy giggles cutely with a little blush on her cheeks, “Hehehahahahahahahahaha!” She feels a total loss in control of her body. Her arms naturally try to push the tickling hand off her by reflex as her legs are kicking uncontrollably, “Ahahahahahahaha! Stop! Hehahahahahaha! No! Hahahahehahahaha!” The pair of whimsical hands continues to dance wildly around her sensitive tummy. <br>\r\n<br>\r\n\tOn the halfway mark of ten minutes, the level of tickling steps up a notch as the pair of hands slips under the skirt of her sleeveless dress. Once the fingers make contact to the bare tender skin of her belly, Wendy laughs even louder, “KYA! HAHAHAHAHAHAHAHAHAHAHA! NO! HYAHAHAHAHAHAHA!” The little Dragon Slayer squirms and rolls on the ground as her midsection is being provoked in an unusual manner. A teardrop leaks from her closed eyes from the experience. <br>\r\n<br>\r\n\tAt the final five minutes, she explodes into laughter when her bellybutton is touched, <br>\r\n“AHAHAHAHAHAHAHAHAHAHAHAHAHA!” Streams of tears flow from her eyes from the anguish, KYAHAHAHAHAHAHAHA! MAKE IT STOP! AHAHAHAHAHA! HEHAHAHAHAHAHAHAHAHAHA!”<br>\r\n<br>\r\n\tAt last, the watch beeps. The boy stops and wipes the tears off Wendy’s face, “Are you okay?”<br>\r\n<br>\r\n\tCurling defensively into a ball, Wendy gasps for air to catch her breath while panting. As a Sky Dragon Slayer, she is granted with the power to eat air itself to rejuvenate faster than others. <br>\r\n</span></div></div>",
            "created":1370408400,
            "id":1605147,
            "title":"The Dice Tickle Game!"
        },
        "145":{
            "choices":[
                "Evergreen",
                "Levy ",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these two?</span></div></span></div>",
            "created":1370926800,
            "id":1609281,
            "title":"Someone else 2"
        },
        "1452":{
            "author_id":"pcs124",
            "author_name":"Eleven59",
            "choices":[
                "Library",
                "Other",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will Levy be?</span></div></span></div>",
            "created":1408822800,
            "id":1846240,
            "title":"Levy McGarden"
        },
        "14521":{
            "choices":[
                "A friend walking in",
                "Other choices"
            ],
            "content":"<div class=\"\"><div> <span>Levy was hard at work studying once again in the fairy tail library wearing her usual clothing of a orange summer dress and brown flip-flops as he goes from one bookshelf to another. <br>\r\n<br>\r\n\"Hmm maybe its here?\" Levy says moving herself to the next huge book filled book case. Being small as she is Levy had a little trouble with reaching books and while she was busy trying to reach a new book to continue her studying she didn't notice..</span></div></div>",
            "created":1409512800,
            "id":1849836,
            "title":"Library study"
        },
        "145212":{
            "author_id":"pcs124",
            "author_name":"Eleven59",
            "choices":[
                "A strange, unrecognized woman",
                "An old hag"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could it be?</span></div></span></div>",
            "created":1411074900,
            "id":1858545,
            "title":"Other choices"
        },
        "1452121":{
            "author_id":"pcs124",
            "author_name":"Eleven59",
            "choices":[
                "In a room with feet in stocks and arms tied behind back",
                "In a hallway with arms handcuffed above head to staircase"
            ],
            "content":"<div class=\"\"><div> <span>\"Aha!\" Levy grinned, pulling down her book from the shelf. As she did, a strange woman wearing a cloak entered the library. Levy was too busy getting settled in to read, however, to notice. The woman walked out of sight, behind the bookshelf that Levy had just been at. Then, she walked back out, whistling as she exited the library. <br>\r\n<br>\r\n\"That was interesting.\" Thought the 17 year old Fairy as she walked to put the book back. As the book slid into its groove, it pushed something, causing a click. \"What was that?\" Thought Levy. Then, she heard a hissing noise. Then, she smelled something sharp. After she did, her eyelids shut instantly and she was out cold on the floor.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhere does she wake up?</span></div></div>",
            "created":1411075440,
            "id":1858547,
            "title":"A strange, unrecognized woman"
        },
        "14521212":{
            "author_id":"pcs124",
            "author_name":"Eleven59",
            "choices":[
                "Tickle her stomach",
                "Maybe her sides?"
            ],
            "content":"<div class=\"\"><div> <span>          McGarden's eyes blink open. <br>\r\n\"What the? Where am I?\" the Fairy thinks, feeling like she just had a long, deep sleep. She tries to stretch, then realizes her wrists are in a set of cold metal handcuffs. Those are then looped through a hole between two posts on a staircase. Another pair holds her ankles together. Levy looked around, noticing that she appears to be trapped in a house. <br>\r\n\"What's going on...?\" the blue haired girl wonders. Then, the door of the house opens. The same strange, unrecognized woman enters, hood stil on. <br>\r\n\"Hey!\", Levy says, \"I remember you!\" She hadn't paid much attention to the woman before, but now she remembered. <br>\r\n\"What did you do to me?\" the Fairy demands, pulling on her handcuffs. <br>\r\n\"Nothing personal, McGarden, just my job,\" she replies, stepping closer to the squirming girl. For the first time, Levy notices the feather strapped to her cloak. <br>\r\n\"What job? And how did you know my name?\" The woman pulls out the feather, saying, <br>\r\n\"Not important. However, do know that we don't want anything specifically from you<i></i>. \" <br>\r\n\"Then what fo you want?\" Levy asks, more confused than ever. Instead of responding, the woman simply brushes the feather on McGarden's nose.<br>\r\n<br>\r\n          The Fairy blinks, twisting her face to the side. <br>\r\n\"Stop that!\" she protests. The woman ignores her, instead lighty wiggling the white feather on the hazel eyed Fairy's pale neck. Levy smiled, the feather tickled her neck a bit, but then immediately choked it back, replacing it with a look of anger.<br>\r\n\"Get away from me!\" she demands, not getting any reaction from the mysterious, yet creepy woman. The woman instead brings the feather even lower, right into McGarden's underarm. She tests the girl's pit with a quick stroke of the feather, and is not disappointed. The girl yelps, then tries to pull her hands out of the cuffs to prevent the tickling. She quickly stops though when the woman begins brushing the feather in her left armpit. Rather, her girly laughes carry down the hallway. The woman smiles behind her hood, knowing her boss will be pleased. Levy continues to giggle and squirm in absolute ticklishness. The pale skin of her underarms is outrageously ticklish, and her dress was not helping to protect it. She shrieks when her tickler finally drops the feather and instead uses two fingers to tease her two underarms. The woman can't help but enjoy herself a little, the Fairy that she tortures is just so cute and ticklish. Levy was not enjoying herself, however, especially when the woman began pressing her fingers into her armpits. She howled with laughter, straining with everything in her to pull her hands ftom her restraints. The torture continues for another five minutes, which leaves Levy panting and red faced. What now?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1419193200,
            "id":1905601,
            "title":"Right Under The Arms"
        },
        "1453":{
            "author_id":"brony89",
            "author_name":"brony89",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Carla?</span></div></span></div>",
            "created":1385692500,
            "id":1700210,
            "title":"Others"
        },
        "14532":{
            "author_id":"pcs124",
            "author_name":"Eleven59",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bianca?</span></div></span></div>",
            "created":1408822380,
            "id":1846235,
            "title":"Bianca"
        }
    },
    "info":{
        "author_id":"voqua",
        "author_name":"Voqua",
        "brief_description":"Tickle the girls of Fairy Tail",
        "created":1366792560,
        "description":"<td align=\"left\" class=\"norm\">The girls of fairy tail get into ticklish situations.<br>\r\n<br>\r\nRules: No sex or violence.</td>",
        "id":1930377,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601396520,
        "modified":1601396520,
        "pretty_title":"Fairy Tail Tickling"
    }
}