{
    "chapters":{
        "1":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Sheila, the busty vixen",
                "Zig Zag, the tiger-striped skunk",
                "Sabrina, the skunk",
                "Persia, the cat",
                "More?"
            ],
            "content":"<div class=\"\"><div> <span>You lay back in your chair on the deck of the ship. You bask in the warm sun, in your swim trunks and Hawaiian shirt. Your sure were lucky that you won that sweepstakes back home. The one that got you this vacation. The sea is a crystal blue, the sun is shining, the fish are jumping, the clouds are thundering.......Wait, Clouds?<br>\r\n<br>\r\nYou open your eyes and see some dark clouds on the horizon to the west. You can hear their booming thunder from here. You lay back in your chair, not worrying about it. It'll probably pass right over you, you think.<br>\r\n<br>\r\nKATHOOM!<br>\r\n<br>\r\nLightning flashes through the sky, as the rain pounds on the ships deck. You were caught unaware by the storm, and try desperately to get to your cabin. You ran across the deck, slipping on the rain soaked surface. You are drenched, it'll take you weeks to get dried again. The storm churns the sea, waves rock the ship back and forth.<br>\r\n<br>\r\nYou crawl across the deck on your belly, trying to get back on your feet. Suddenly, a massive wave rams into the side of the ship, splashing over the deck, sweeping you away with it, across the deck, into the sea.<br>\r\n<br>\r\nThe waves toss you around through water like a rag doll. You open your mouth to yell for help, but it's filled with salty water. There's no hope for you now. Your vision begins to fade, as you sink below the waves. You stare at the rippling surface of the water as everything goes black.<br>\r\n<br>\r\nSuddenly, you can breath again! You open your eyes. You're laying face down on an island beach, you lift your face out of the sand, staring at your surroundings. You have no idea where you could be. You didn't even know if there were any island nearby. On the edge of the beach is thick jungle.<br>\r\n<br>\r\nYou wobbly get up onto your feet and trudge across the beach, still soaking wet. The jungle is lush and humid, with many different animal calls sounding in the distance. You make your way through the jungle, pushing branches and brush aside.<br>\r\n<br>\r\nSuddenly, as you step on a pile of palm leaves, you hear a loud cracking sound, as the leaves crumble beneath you, and you fall into a pit. Splintered bamboo and leaves lay all around you as look to the top. The pit is at least ten feet deep, and there is nothing you can use as footholds to climb out.<br>\r\n<br>\r\nYou sit at the bottom of the pit for over an hour, hoping someone comes and find you. Then you hear voices. \"Hey! We caught something!\" Staring down at you, is the strangest Creature you've ever seen. It is at least five feet tall, and appears to be a female. It was dressed in a grass skirt, and a leather bra. But the strangest thing, was that it appeared to be a skunk! Or at least, a skunk in a humanoid body.<br>\r\n<br>\r\nAnother one of the creatures appeared beside it, this one was a fox. They both carried spears, with golden spearheads. \"What is it?\" The fox asked to the skunk. \"Whatever it is, it is'nt one of us. Therefore, we should take it to our ruler, and let her decide what to with it.\"<br>\r\n<br>\r\nThey tie a think vine around wrists, and pull you along with them. You forcefully follow them through the jungle, dreading what might become of you. Suddenly, the jungle breaks, opening a Aztec-like city. They continue to drag you through the city streets, which are populated by more of these furry beings, who stare at you, like they're never seen a human before.<br>\r\n<br>\r\nThey bring you to the steps of an enormous, grand palace, big enough to be a city on it's own. They drag you inside, to an elaborate throne room. They force you onto knees, facing the floor. \"My empress.\" Says the skunk. \"We captured this man in the jungle. What shall we do with him?\"<br>\r\n<br>\r\n\"Bring him to me.\" You hear another voice say. You are forcefully shoved towards the throne. You stumbled as gaze up at the empress. It's another furry, at least five feet tall.<br>\r\n<br>\r\nBut, what furry is it.</span></div></div>",
            "created":1301720400,
            "id":1080947,
            "title":"The Island"
        },
        "11":{
            "author_id":"noyesr84",
            "author_name":"ficfan",
            "choices":[
                "she makes you her personal slave",
                "she wants yo to join them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see what appears to be a fox woman sitting on a throne. She is dressed similarly to the other females you've seen except that she is wearing a golden crown. Also  she is a very attractive and busty female who just exudes sexuality.</span></div></span></div>",
            "created":1322715600,
            "id":1232754,
            "title":"Sheila, the busty vixen"
        },
        "111":{
            "author_id":"razgreiz",
            "author_name":"Razgreiz",
            "choices":[
                "Of course, My Lady~!"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll think you'll make a fine personal servant for me.\" she says in a sexy voice.<br>\r\nThe sound of her voice just seems to send shivers up your spine! You can't help but eye her giant rack!<br>\r\n\"Umm, may I ask what my duties would be?\" You say in a calm, polite manner.<br>\r\n\"Yes. You'll be my personal slave. You will fetch me food, drink, bathe me, keep me company, clean my quarters ect. If you're a good servant, you'll receive extreme rewards. If you resist, try to rebel, or do anything rash, you'll be SEVERELY punished. So what do you say? Will you do it?\"</span></div></div>",
            "created":1336194000,
            "id":1329809,
            "title":"Congrats, your a Slave"
        },
        "1111":{
            "author_id":"blader",
            "author_name":"blader",
            "choices":[
                "The door to her bedroom bursts open",
                "She stands up \"I think I could use a bath\"",
                "A small smile spreads across her face"
            ],
            "content":"<div class=\"\"><div> <span>You really didn't like how she had said \"severely punished\" as easily as she had, so you knew that at least for now it would be best to go along with what she wanted, you were far from home, and outnumbered, so as humbly as you could you slid down onto one knee and said \"of course, my lady it would be an honour to serve you.\"<br>\r\n<br>\r\nSheila looked quite pleased with herself as she slowly stood up, \"yes it is quite an honour to serve me\" she says a small smile playing on her lips. She held her hand down to you, \"you may kiss your mistress' hand to show your loyalty\" she says. You take her hand and slightly lift your head so you can kiss it, having to stop yourself from trying to spit due to her fur. You saw Sheila's tail start to slowly sway behind her almost like it was a dog's as she reached down to caress your cheek. \"very good, you will make a fine servant\" she says. She lifts her head up and addresses the rest of the room \"I am going to \"test\" how loyal my new servant is, I want absolute privacy, and am not to be disturbed\" she says before gently tapping you on the shoulder, a sign for you to rise. She starts leaving the room giving no order for you to follow, you do so anyways, as you walked behind her you couldn't help but be entranced by her slender legs, her wide hips and her beautiful tail, all moving from side to side in perfect harmony. While your attention was focused on her well backside, you didn't see her take a glance backwards and smile slightly as she saw you were so enamoured by her body. After a minute of walking she pushes open a large mahogany door, taking a second to beckon you inside which you do.<br>\r\n<br>\r\nThe room before you was obviously Shela's bedroom, most of the wall opposite the door was taken up by a large 4-poster bed big enough for 3 people, as well as a small nightstand and a small bedside table. One wall was taken up by a dresser and a desk which flanked a small doorway leading out to an open balcony, the final door had a single mahogany door set in the exact middle \"that is my personal bathroom, you and I will be spending a lot of \"alone\" time there as well as my bedroom\" she says without you asking a question. She slowly and seductively walks over to the bed, her hips and tail swinging in that same perfect unison and this time she openly giggled as you gazed. You quickly stopped staring as it was obvious now that she knew you were staring, and you didn't want to be punished, but when you look at her she smiles slightly and waves one hand dismissively. \"I don't mind if you stare\" she states simply \"in fact i'd be quite insulted if you didn't\" she says. She sits down on the bed and pats a spot right next to her \"come sit with me\" she says, you slowly walk over and sit down next to her, nearly jumping out of your skin as you feel her body rest on yours.<br>\r\n<br>\r\n\"My lady?\" you say a bit confused as to what she wanted you to do. Instead of asking you felt her simply hug herself closer to you, she gave off a small sigh as her weight gently pushed you back onto the bed, and seeing no reason not to, you moved a bit so the both of you were laying fully on the bed. \"My lady, are you alright?\" you say again, really confused as to what she wanted, she had isolated the two of you, made herself vulnerable, you weren't the biggest guy ever but you were bigger than her 5 foot frame.<br>\r\n<br>\r\nAfter a few seconds Sheila speaks up \"do you like me?\" she asks. The question catches you completely off guard, and you look away for a few seconds, she sounds a little annoyed as she continues speaking \"I said do you like me?\" she repeats.<br>\r\n<br>\r\n\"You...you are a very beautiful vixen, my lady\" you reply.<br>\r\n<br>\r\n\"Yes, I am, do you enjoy watching my cute butt and my luxurious tail sway side to side\" she says, starting to run one clawed finger up and down your chest.<br>\r\n<br>\r\n\"Yes, my lady\" you reply starting to blush.<br>\r\n<br>\r\n\"How about my figure, is it appealing?\" she asks sitting up on your chest giving you a full view of her body. You weren't sure that your voice wouldn't betray you so you nod instead and she smiles reaching down to softly caress your cheek again. \"I am most pleased that you're being so honest with me, and you're so obedient as well, if you keep this up you will be greatly rewarded\" she says.<br>\r\n<br>\r\nYou slowly sit up a bit \"my lady, is there anything you need?\" you ask.<br>\r\n<br>\r\nSheila smiles \"not at the moment, all I wish for is your company\" she says. You nod slowly quite content with how things were working out at the moment, it wasn't like she was asking you to do anything difficult, all she was asking was for you to be near her. \"I should inform you of a few things now, so you don't make any mistakes later\" she says lightly stepping off you and sitting down so she was staring at you mostly eye-to-eye. \"First, when you are bathing me, you always go with the flow of my fur, so from head to foot, this applies for when you are cleaning me, and brushing me. Second when you are drying me, you shall dry me as lightly as possible and again it shall be with the flow of my fur, I hate it when my fur gets all poofy. You will accompany me everywhere, and when I say everywhere I mean everywhere, if I am to deliver a speech you will be sitting next to my feet, if I must go to the bathroom you will be right outside waiting for me, do you understand so far?\" she says. You nod , you didn't exactly like getting ordered around but you were appreciative she was telling you this now rather than expecting you to magically know it later.<br>\r\n<br>\r\n\"Do not think that just because you are my slave you will be treated poorly, you will have a special place next to me at the dinner table, and since you will always be in my company you will be privy to many of the island's most closely guarded secrets, however if you betray any of these responsibilities, you will not be severely punished, you will lose your head. Do I make myself clear\" she says suddenly becoming very serious. You nod enthusiastically for some reason only in that moment did you understand how much trust she was putting in you. Sheila smiled \"good, now for the special rules between you and me\" she says.<br>\r\n<br>\r\n\"Between me and you, my lady?\" you say.<br>\r\n<br>\r\nSheila smiles \"yes rules for just when it is the two of us. Rule #1 when it is just us, you will call me Sheila, not my lady\" she says. You nod your understanding, \"rule #2, when I allow you to pet me, you may do so at your leisure as long as I enjoy it, although if you mess up my fur, I will expect you to put it back in place, your are also allowed to...explore me, although only for the purpose of finding where I enjoy being petted most\" she says, and you nod again although you felt a little flustered. She looks around almost like she expected someone to be listening before continuing, \"finally, as a woman, I have certain needs, at times I will ask you to fulfill these needs, at these times, your one objective is my pleasure, I shall not ask you to do anything disgusting but if I ask you to do something such as squeeze my breasts, you shall do so without hesitation, if I say harder you will do so, if I say faster you will go faster, do I make myself clear\" she says. You nod slowly a little dumbfounded about what she had just said.<br>\r\n<br>\r\n\"My...Sheila, you'd wish for me to, lay with you?\" you say.<br>\r\n<br>\r\nSheila nods \"I still have needs, and as my servant you will be expected to fulfill those needs, however as queen I must keep up airs, so on pain of death you will tell no one of this\" she says. You nod slowly telling her you understand her most important instruction before</span></div></div>",
            "created":1339477200,
            "id":1358394,
            "title":"Of course, My Lady~!"
        },
        "11112":{
            "author_id":"windows.net",
            "author_name":"writing",
            "choices":[
                "Bathe me!",
                "Please me."
            ],
            "content":"<div class=\"\"><div> <span>Sheila stands up and starts to walk over to the bathroom door, when she stops and turns around to face you. She smirks. \"Sheila, do you need anything?\" You say, a bit flustered by the way she was looking at you. The vixen just says, \"Come. I said I needed a bath, didn't I?\" You get up and follow her into the bathroom. She turns on the water and gets in. You wait for another command. She tells you to get in. You seem hesitant at first but remember not to disobey her. The bath is quite big so it easily fits both of you. She just smirks and relaxes. You take off your clothes and hop in. She says:</span></div></div>",
            "created":1517634000,
            "id":2448957,
            "title":"She stands up \"I think I could use a bath\""
        },
        "112":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "\"...with me!\"",
                "\"...with Mei!\" (Thie skunk)",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>The empress vixen hummed and then, to every guard and servant's surprise, she rose from her throne and began to walk towards you. Immediately the skunk who held you started to object.<br>\r\n<br>\r\n\"My lady! You don't need to come forward to this weird creature!\"<br>\r\n<br>\r\nThe vixen closed her eyes and sighed, waving off her loyalist's concerns. \"Now now...this being is something new to this island. It appears to be male and humanoid too...except without fur. Interesting.\"<br>\r\n<br>\r\nThe vixen was now just feet from you. Although you were unsure of what was going to happen, you remained firm. Seeing her up close, you got a <i>big</i> idea of how big breasts were. She was unbelievably slim and stacked! Her breasts must be at least the size of her head...or even more. What was even crazier was that this empress was about six feet tall which brought your head about to her chest in comparison.<br>\r\n<br>\r\nThe express circled around you before she hummed and put a finger to her lips. She stared at you with narrowed eyes, almost as if trying to investigate him personally.<br>\r\n<br>\r\nShe smiled amused.<br>\r\n<br>\r\n\"You're not that muscular, aren't you? Tell me, what are you?\" she questioned with curiosity brimming in her voice.<br>\r\n<br>\r\nYou raised an eyebrow. \"I'm...um...human, maam...\"<br>\r\n<br>\r\nSuddenly, you felt a jab to your side. You gasped and fell to one knee. The skunk behind you seemingly hit you without warning.<br>\r\n<br>\r\n\"Call the empress before you correctly, scum!\" she warned.<br>\r\n<br>\r\nThe empress narrowed her eyes at the skunk. \"Now Mei, I would prefer if you not damage him. It did not seem he meant badly of me.\"<br>\r\n<br>\r\nThe skunk widened her eyes before leaned back and bowing.<br>\r\n<br>\r\n\"I'm sorry, my lady,\" she apologized.<br>\r\n<br>\r\nYou took note of the skunk's name. She was definitely quite the feisty one.<br>\r\n<br>\r\n\"I do believe the best thing we can do is give this person a home. You came afar, haven't you?\" she asked.<br>\r\n<br>\r\nYou slowly rose, recovering from the skunk's jab. You didn't want to look back but you could practically feel the skunk glaring at you, clearing not trusting.<br>\r\n<br>\r\n\"I did...my lady. My boat crashed while I was on vacation,\" you answered, this time addressing properly for fear by getting hit by the skunk again.<br>\r\n<br>\r\nThe vixen chuckled. \"I see. I do not know what you mean by 'vacation'. Regardless, you do not have to force yourself to address me properly. As the empress of this island, some of my loyalist can be a little over-protective.\"<br>\r\n<br>\r\n\"I...can see that,\" you answered, not daring to look at the skunk behind him.<br>\r\n<br>\r\n\"Well then, for someone unique as you. I feel it isn't proper to not welcome you warmly to our island. We take you in as a part of the anthro life that inhabits this island.\"<br>\r\n<br>\r\nYou widened your eyes. While you were happy to see that you weren't going to be in any danger, you knew that you couldn't stay on this island. Despite the humanoid animals with their fit and beautiful figures.<br>\r\n<br>\r\n\"Um...while I'm thankful. I would prefer to leave this island and go back home,\" you explained.<br>\r\n<br>\r\nSheila paused for a moment before her eyes softened and she gave a sad smile. \"I'm afraid I cannot let you go. Even if you traveled her by accident, you're the first being we've seen that is humanoid and different from the rest. Do not be alarmed when I say that you've become a rather prized possession of this island.\"<br>\r\n<br>\r\nYou smiled to be polite but inside, you felt rather scared. Prized possession? Was he an item to them all?!<br>\r\n<br>\r\nThe vixen continued. \"You will have to get used to your life here as there is no other options. We would prefer you not to decline as that would result in rather unfortunate events...\"<br>\r\n<br>\r\nYou shivered and you could've sworn you heard some venom in her voice. You shakily nodded not wanting to seem disobedient.<br>\r\n<br>\r\nThe vixen smiled once again, happy that you agreed. \"Excellent! Now I know the perfect place you can start settling in which is...\"</span></div></div>",
            "created":1388552400,
            "id":1718714,
            "title":"Join us"
        },
        "1121":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "\"'my personal guard!\"",
                "\"...my mate!\"",
                "\"...my advisor!\""
            ],
            "content":"<div class=\"\"><div> <span>Everyone grew shocked as the empress declare that you would be in her company. Immediately, the skunk objected once again.<br>\r\n<br>\r\n\"My lady! That's unnecessary! This...man...could do well on his own in the village!\" she argued.<br>\r\n<br>\r\nSheila scoffed, waving her Mei's objections. \"You know as well as I do that we must protect him. If he lives with the common folks, chances are higher that he will be killed quicker than you can say 'meow'. We can better learn from him and protect him if he is with me.\"<br>\r\n<br>\r\n\"B-but...he can't be with you! The only way he can be with you is if he holds some status in relationship!\"<br>\r\n<br>\r\nSheila sighed. \"Then I'll just declare a status for him...\"<br>\r\n<br>\r\nYou were heavily confused but what came next would certainly affect your future on the island.<br>\r\n<br>\r\n\"He will be my...\"</span></div></div>",
            "created":1388552400,
            "id":1718720,
            "title":"Life with the empress."
        },
        "11212":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>Sheila pulled you close to her in a tight hug.  \"I shall make him my mate.\" she said.  Everyone was surprised at Sheila's decision.  \"Why do you feel the need to make him your mate, your majesty?\" the skunk asked, confused.  \"I have my reasons.\" Shelia said, smiling \"And I expect him to be treated like royalty.\" she added sternly.  The skunk bowed \"As you wish, your highness.\" she said.  You felt relaxed knowing you'd be respected while on the island.  \"Come, my love.\" Sheila said as she lead you out of the throne room and into a maze of hallways.  Several minutes later, she led you to, <br>\r\n<br>\r\n</span></div></div>",
            "created":1395810000,
            "id":1768333,
            "title":"\"...my mate!\""
        },
        "112121":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Kiss her back",
                "Ask her some questions"
            ],
            "content":"<div class=\"\"><div> <span>Sheila led you to a pair of double doors.  She pushed them open to reveal a large room.  There was a large 4 poster bed with violet sheets and hangings.  There was also some oak furniture.  You could only assume it was Sheila's bedroom.  \"Come in.\" she said, beckoning you with her finger \"Don't be shy, sweetheart.\".  You walked in and sat on the end of the bed with Shelia.  \"You OK.\" Sheila said, noticing your nervous demeanor.  \"I'm just trying to get use to the idea of living with creatures like you.\" you said.  Sheila giggled.  \"I understand how you feel.\" she said, caressing your shoulder \"I felt a little awkward around you as well when you were brought here.\".  You smiled in response as you looked into her sapphire blue eyes.  Shelia than leaned in and pecked you on the cheek.  You blushed at this.  You decided to, </span></div></div>",
            "created":1396242000,
            "id":1771188,
            "title":"Her private bedroom"
        },
        "1121211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "You decide to show her a good time",
                "One of the palace guards opens the door"
            ],
            "content":"<div class=\"\"><div> <span>You leaned forward and gave her a kiss on the cheek back.  Shelia giggled at this.  She moved a little closer to you and started caressing your legs.  You blushed as you wrapped your arm around her and pulled her closer to your chest.  Shelia blushed.  The two of you gently held each other for several minutes.  A little while later, </span></div></div>",
            "created":1441170000,
            "id":2029019,
            "title":"Kiss her back"
        },
        "11212112":{
            "author_id":"lucanari29",
            "author_name":"GoldenKitsune",
            "choices":[
                "Explore The Place While You Wait For The Feast Together",
                "She Want's Some Personal Attention"
            ],
            "content":"<div class=\"\"><div> <span>After a moment of conversation, mainly more about your species the door opens with a quiet squeak. \"M-Ma'am, we may have a problem.\" Looking you would see a, rather fluffy, anthro wolfess at the door... their outfit being any indication they were higher in status than some of the other guards you had seen.<br>\r\n<br>\r\n\"What is it Sarashi?\" The empress would glance over, seeming partially annoyed by the disturbance... especially if it's going to be bad news...<br>\r\n<br>\r\n\"The chef managed to lose a finger my lady... lunch has been postponed to prevent contamination.\" The large wolf would bow. The look on your new mate's face would be one of exasperation as she slowly closes her eyes; somewhere in her own thoughts she would be trying to come up with a solution. As her eyes open she would be smiling, likely having devised a solution in the short silence.<br>\r\n<br>\r\n\"Let the chef get it checked out, and tell the prep staff to put together appetizers. The back-up chef should be here before the people are done with those and it will be like nothing happened... I also believe he should get a little compensation since he won't be able to use that hand for a while.\" Her smile would dim as she recalls once again how her guard had just barged in... \"And knock next time please...\" With that the guard would bow again and depart, closing the door behind her, and as it does the vixen turns to face you. \"Now... where were we?\"</span></div></div>",
            "created":1495602000,
            "id":2324585,
            "title":"Internal Affairs"
        },
        "112121121":{
            "author_id":"lucanari29",
            "author_name":"GoldenKitsune",
            "choices":[
                "Gardens First",
                "The Courtyard Is Nice"
            ],
            "content":"<div class=\"\"><div> <span>\"I believe we were in the middle of a discussion... albeit I was too lost in your voice to hear the words.\" You smile, blushing gently. Wow you're a hopeless romantic, but it was true, and you couldn't remember anything other than that you two were now bound... mates, a form of marriage of two souls that now entwined the two of you forever- or until one of you died... She would look unperturbed however, smiling even at the remark before she finally responds.<br>\r\n<br>\r\n\"It's alright, if it is important I will remind you.\" She replies dismissively, but still caring as she begins to stand. \"Would you like to join me on a walk? I hear the garden is lovely right now.\" She would extend a hand to you, finding you were having trouble getting out of her bed. Accepting the assistance you would take her hand- or paw?- and let her help pull you up, soon standing beside her as you now.<br>\r\n<br>\r\n\"It would be great to look around... I wasn't brought in under the best of circumstances after all...\" A faint remembrance would hang in your tone, leaving her ears drooping somewhat... her tail less active as she silently stews over what to do about that, only to break her silence with a smile.<br>\r\n<br>\r\n\"Yeah, it's not the best of circumstances... but at least we got to meet, and now you are safe from them... I will keep you safe...\" Ominous as that sounded you decide to put your faith in her, trusting her in this new and strange land to keep you safe and sound among all these strange creatures.</span></div></div>",
            "created":1496120400,
            "id":2328171,
            "title":"A Lovely Time"
        },
        "1123":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "To the village to let you explore while she follows",
                "To drag you with her while she patrols the palace",
                "Back to her room to give you a test run"
            ],
            "content":"<div class=\"\"><div> <span>\"Gina, come in here.\" The empress shouts. On that order, a massive lioness woman entered the room from behind the empress' throne. Standing at six and a half feet and wearing golden armor from the shoulders down, she struck an intimidating figure. \"Human, this is Gina, my personal bodyguard, closest friend, and your new caretaker.\"<br>\r\n<br>\r\nGina began to speak. \"My lady, with all due respect, my duty is to protect you and you alone. Not to babysit some hairless ape.\" The empress silenced her with a wave of a hand. <br>\r\n<br>\r\n\"This is not up for debate. You will protect the human and let him live with you. Besides, I know how long it's been since you've felt the touch of a man. Give him a chance, he might just prove to suprise you. Now then, both of you dismissed.\" She returns to her throne while Gina grabs your shoulder and pull you out of the throne room.<br>\r\n<br>\r\nWhere does she take you?</span></div></div>",
            "created":1542081120,
            "id":2577006,
            "title":"Someone else"
        },
        "14":{
            "author_id":"devent",
            "author_name":"Psychopath",
            "choices":[
                "To be cleaned and hace dinner with Persia",
                "To be fitted and put with the other slaves",
                "To be cleaned and used as Persia private slave",
                "You don't trust Persia, try to escape!"
            ],
            "content":"<div class=\"\"><div> <span> Stumbling you walk two feet before falling onto your knees at the feet of the empress. \"Who are you?\" she asks fearing punishment for looking up, you say to her feet \" L-Leo ma'am\". \"What? O just stand up I can't hear people when they're talking to my feet.\" you have trouble standing because your arms are still tied, so a guard pulls you up. \"Now, Who are you?\" she repeats, but you are bewildered at her image. Able to see her better, sitting in-front of you was a white furred cat no less then 6ft 2in, with long black hair with two small white ears coming out from under her hair, she was clothed in a shinny silk black dress, but the most interesting thing about her was a crystal necklace around her neck, it had a heavily worn black omost gray metal backing with carving on it that went around the entire gem. The crystal its self was dark blood red in color which oddly matched her eye color, there was something scarey about it, a cold feeling started to feel your soul the longer you looked at it. \"e-hem\" she went then you snapped out a the trance you fell into looking at the necklace.\" Wh- O yay, my name is Leo ma'am.\" you say. \" that's not what I mean, what are  you?\" she restates. \"what am I?\" you say in your head then you remember all the strange looks on all the women's faces in the city. \"I'm human\" you reply, \"a hum-man\" she says in an odd tone, standing from her throne walking around you tracing your eyes with a finger and examining your lack of tail, coming to your front she puts her hand on your lower jaw and pulling down forcing you to open you mouth she peered inside at your teeth\" why have can you eat with such small teeth?\" she says jokingly as she smiled right at your eye level extremely close, showing you her knife sharp white teeth, to which you try to jump back form, then before sitting back down she took a peek into your pants which quickly made yo squeak you legs together. smirking as her sad down her expression quickly went from interest to concern \"how did you find my island Leo!\" she demands angerly. As you tell her your story her face turns from anger to joy. When you were done she asked \"so no one knows you're here, correct?\", \"yes mis... , I'm sorry I didn't get you name\" you say \"I'm Persia, empress of this island\" she proclaimed proudly. she stepped down from her throne once more walked behind you and put her hands on your shoulders and asked \" how would you like to be mine honored guest?\", they was something in her tone of voice that scared you but you really had no were else to go so you accept her offer. \"good\" she says as she cuts the vines holding you arms with one of her claws. She snapped her fingers and two guards stared leading you out of the room. As you walk down the hall you wonder were they're leading you    </span></div></div>",
            "created":1372482000,
            "id":1619981,
            "title":"meeting Persia"
        },
        "141":{
            "author_id":"furrycub",
            "author_name":"YandereFurry",
            "choices":[
                "More guests showed.",
                "Just the both of you."
            ],
            "content":"<div class=\"\"><div> <span>The two guards lead you to a large guest room and show you around the room.<br>\r\nThey tell you where the robes and other clothing were as you weren't wearing your \"filthy rags\" to dinner.<br>\r\nThey show you the bath and they turn it on for you to get bathed.<br>\r\n<br>\r\nThe guards left and you stripped yourself of the torn up and filthy clothes you had on.<br>\r\n<br>\r\nYou got into the hot bath and cleaned yourself.<br>\r\nYou were happy to be in a hot bath after the trip you had.<br>\r\n<br>\r\nAfter about 20 minutes or half an hour you got out and dried yourself off.<br>\r\n<br>\r\nYou went to the big wardrobe and pulled out a large robe, a fancy blouse, and a long pair of pants.<br>\r\n<br>\r\nTwo guard came over and knocked on your door.<br>\r\nYou opened up and told them that you were ready. They nodded and walked you through the halls into the feasting area.<br>\r\n<br>\r\nThere sat a bored Persia tapping a spoon on her glass.<br>\r\n<br>\r\nPersia smiled as you walked in. <br>\r\n\"I felt like I was waiting for ages for you to finally get ready. You look absolutely handsome.\" She purred.<br>\r\n<br>\r\n\"Thank you. I am very grateful for your kindness.\" You tell her politely trying to shake off the flirting.<br>\r\n<br>\r\n\"You are quite welcome, my guest. Please. Sit.\" Persia told you.<br>\r\n<br>\r\nYou sat down when she told you to and arranged your napkin on your lap trying to be very polite so you wouldn't be in trouble.<br>\r\n<br>\r\nThe food was mostly Seafood. Of course it was, she's a cat.<br>\r\n<br>\r\n<br>\r\nDo more guests show or is the dinner just for the two of you?</span></div></div>",
            "created":1538629200,
            "id":2559340,
            "title":"To be cleaned and have dinner with Persia"
        },
        "1411":{
            "author_id":"tinyhumanfan",
            "author_name":"TinyHumanFan",
            "choices":[
                "My Wedding.",
                "My Birthday.",
                "My personal guest."
            ],
            "content":"<div class=\"\"><div> <span>\"If you are wondering, More guests shall attend our meal.\" Persia told you before taking a sip of her wine.<br>\r\n<br>\r\n\"Oh. I actually was wondering.\" You told her.<br>\r\n<br>\r\nShe laughed at your comment but before she said anything else two servants opened two large doors for the guests to come in to.<br>\r\n<br>\r\nSeveral lavishly dressed Anthros walked in and greeted Persia with a bow.<br>\r\n<br>\r\nA bobcat Anthro came directly to you and greeted you with a warm handshake.<br>\r\n<br>\r\n\"I am Ms Piston. I am humbled to see a new party guest.\" The bobcat greeted you.<br>\r\n\"May I ask, Who are you?\" She added<br>\r\n<br>\r\n\"Andy. Andy Todd. I'm glad to meet another guest as well.\" You told her with a small smile.<br>\r\n<br>\r\nMs Piston smiled back, her bright red lip stick shining off the candles.<br>\r\n\"I think I'll sit next to you, tonight.\" She said before sitting beside you.<br>\r\n<br>\r\nThe Anthros consisted of different animals including Cats, Cougars, and other feline creatures.<br>\r\n<br>\r\n\"Alright, everyone. We shall all sit and enjoy the meal the kitchen has beautifully prepared for this special occasion.\"<br>\r\nPersia told her guests.<br>\r\n<br>\r\nThe servants came and poured wine for the guests before going to their own table in the room and pouring a glass for themselves.<br>\r\nIt seemed that servants definitely were treated quite nicely.<br>\r\n<br>\r\nThe guests sat down and started to dig in.<br>\r\n<br>\r\nYou and Persia did so as well.<br>\r\n<br>\r\nYou drank some of the wine poured out for you.<br>\r\nThe wine was rich and you had never tasted a wine as amazing as the glass poured for you.<br>\r\n<br>\r\nYou started to eat. You picked out the crawfish because you didn't like fish. <br>\r\n<br>\r\nThe food was very nice and made you think your life might be much better being on the island. <br>\r\n<br>\r\nPersia got up from her seat and clinked her knife several times to her glass.<br>\r\n<br>\r\n\"Tonight, my guests we celebrate a special occasion.\" She started with a grin. <br>\r\nShe continued with \"Tonight; we celebrate...<br>\r\n</span></div></div>",
            "created":1538888400,
            "id":2560570,
            "title":"Greeting Guests."
        },
        "14111":{
            "author_id":"furrycub",
            "author_name":"YandereFurry",
            "choices":[
                "A hand grabs you.",
                "Your chased down by a guard."
            ],
            "content":"<div class=\"\"><div> <span>You were wondering what she was going to say next. She was probably going to talk about your arrival but what happened next shocked you.<br>\r\n\"We celebrate my Wedding, to the cutest man I've ever seen.\" She said with a large smiling turning to you.<br>\r\n<br>\r\n\"She must be joking\" you thought.<br>\r\nYou awkwardly laughed at what she said hoping It was a joke. <br>\r\n<br>\r\n\"Congratulations!\" The whole table yelled in celebration.<br>\r\n<br>\r\nPersia came over to you and tried to grab you to give you a large smooch but you backed away much to her anger.<br>\r\n<br>\r\n\"What's wrong, my groom? We'll be married. Why do you seem so upset?!\" She said in surprise.<br>\r\n<br>\r\n\"I-I can't marry you! I..\" you tried to tell her but you couldn't find the words.<br>\r\n<br>\r\nTears started to form at Persia's eyes and she started to growl.<br>\r\n\"Not again! This time I will be married no matter how my groom thinks!\" She yells in Anger.<br>\r\n<br>\r\nMs Piston came over to you and put her hand on your shoulder.<br>\r\n\"Please. You'll be happy. I promise you.\" She begged.<br>\r\n<br>\r\nYou tried to run away but a servant tried to block you.<br>\r\nYou pushed the servant out of your way and ran out of the dining hall running as fast as you could. There was no way you were marrying that madwoman.<br>\r\n<br>\r\nYou heard Persia scream \"My groom is running away! After him!\"<br>\r\n<br>\r\nThis made you book It out of the pallace entrance.<br>\r\nThe servants and the guests including Ms Piston ran out looking for you.<br>\r\n<br>\r\nYou ran into the village.<br>\r\nSeveral Anthros tried to congratulate you on your marriage but you ran as fast as you could from them.<br>\r\n<br>\r\nFatigue began to infect your body and you felt like your whole chest was being put on fire.<br>\r\n<br>\r\nYou tried to hide and tried to get to the forest.<br>\r\nMaybe you could hide there.<br>\r\nYou were able to get into the forest just in time when you heard the guards looking for the you.<br>\r\n<br>\r\nWhat happened next?<br>\r\n</span></div></div>",
            "created":1539032760,
            "id":2561198,
            "title":"I'm not getting married!"
        },
        "141111":{
            "author_id":"furrycub",
            "author_name":"YandereFurry",
            "choices":[
                "Shook your hand.",
                "Guided you to the table."
            ],
            "content":"<div class=\"\"><div> <span>You looked around the large desolate looking forest. You heard yelling. \"I smell him over here!\" You heard a boastful female voice yell to her crew.<br>\r\nYou ran violently, not looking back. You were not able to have a reaction when furry hands wrapped around your waist and mouth. They jumped in the deep bushes below you. You looked up at your new captor and saw they were a male fox. \"Shh.\" The fox told you as he hid you and him from the guards. He grabbed some dirt and rubbed it on you to protect you from being smelled by the guards. You were greatful he did as a guard ran past you before turning back and giving up after a minute of looking around.<br>\r\n\"Follow me, if you wish to live.\" The fox told you as he looked at you up and down making sure you were male. You nodded frantically.<br>\r\nThe fox smiled and showed you to a secret path leading to a hidden village filled with the males trying to hide from the vicious females from the island.<br>\r\nOf course you were the only human, but you were just glad you were away from the madwoman that was the queen. You owed the fox your life.<br>\r\n\"My name is Sir. Sinet, but you my friend can just call me Edward.\" The fox smiled and shook your hand. \"Now. What happens to be your name?\" He inquired. \"Todd. Andy Todd. But just call me Andy.\" You smiled back and answered him.<br>\r\nYou walked down to the village and were taken to a large temple with several males sitting together at a table looking at a map and marking it with ink. \"We attack those witches here!\" One boastifully yelled.<br>\r\nAn old Anthro, a wolf to be exact looked at you with an excited look in his eyes.<br>\r\n\"Hello. We are lucky to have heard news of another male. We need as many as we can get. There's only about 27 of us left.\" The wolf greeted you.<br>\r\nThe wolf stood up and walked up to you. <br>\r\n<br>\r\nThe wolf then...</span></div></div>",
            "created":1543041360,
            "id":2581258,
            "title":"A savior?"
        },
        "15":{
            "author_id":"humanturian",
            "author_name":"HumanTurian",
            "choices":[
                "Calysta the Horse",
                "Talia the Hyena",
                "Genice the Dolphin",
                "Valerin the Rabbit",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the empress is one of these?</span></div></span></div>",
            "created":1312693200,
            "id":1163698,
            "title":"More?"
        },
        "151":{
            "author_id":"humanturian",
            "author_name":"HumanTurian",
            "choices":[
                "You are prepped and presented to Joran",
                "The skunk pays you a visit later"
            ],
            "content":"<div class=\"\"><div> <span>The throne itself was beautiful: a tall-backed golden creation with flowing scenes of a humanoid animal bestowing a crown upon another such creature in a repeating tale of the divine right of kings. Seated on the throne, conversing with a kangaroo, was a horse. <br>\r\n<br>\r\nIt was a mare, with a rich mane of black in ringlets to bolster the chestnut-colored coat, which glistened in the daylight. Her snout ended with a powdering of white, which her humanoid hands and hoof-style feet shared. On the feminine side, her breasts (a full C-cup, you were sure) were kept behind a veil of yellow semi-sheer cloth, giving you a bit of a peep; she also wore a matching double-strap thong, accentuating her hips. Despite the situation, you couldn't help but become aroused by her practically-exposed pussy; her thong was all but molded to her lower lips. <br>\r\n<br>\r\n\"What sort of man did you catch this time?\" she asked distractedly, still analyzing a sheet of parchment the kangaroo-woman was holding. <br>\r\n<br>\r\n\"A <i>human</i> man, my lady,\" the vixen replied. <br>\r\n<br>\r\nThe mare finally waved off her attendant and rose, and you realized she was as tall as you, an even six feet. She descended from the throne, hooves gently clapping against the polished marble that comprised the small set of stairs in front of the golden seat of power. Her hips swayed as she moved, and you felt yourself grow harder; you were like a submissive about to be disciplined by his dominant mistress. <br>\r\n<br>\r\nReaching you, she stopped and began to visually examine you, paying close attention to your flat abs and moderately-muscular arms. After a moment of thinking, she began to circle you, the fox and skunk stepping back to give her enough room; you noticed her tail was done up into three separate braids, with small emeralds tying off each end. <br>\r\n<br>\r\n\"Not muscular enough to do any of the hard labor, and not fragile enough to assign clerical work,\" she commented. \"I suppose we <i>could</i> be playful and give him to Atriala to service out in her brothel---\" <br>\r\n<br>\r\nYou notice the skunk-woman lick her lips, eyes glinting with anticipation that her empress will give that very order.<br>\r\n<br>\r\n\"---But he isn't as athletically-refined as the last two we gave her, and she'll complain about having to get him into shape before letting any buyers have their way with him.\" She sighed, and then addressed you. \"What skills do you possess, male?\" <br>\r\n<br>\r\nIt really rankles you that she refers to you by your sex, not even bothering to ask your name, but you answer her anyway, rattling off some of the finer points of your education. You leave out things like cars and electricity, naturally, since these people clearly don't have any.  <br>\r\n<br>\r\nThe empress raised an eyebrow when you mentioned your degree in architecture. \"We can use that,\" she said with a nod. \"Joran mentioned just last week that she needs a competent aide to assist with the construction papers, for that new temple, since her last helper almost lost them once and nearly destroyed them another time.\" <br>\r\n<br>\r\n\"I told her after that first time to take better precautions,\" the vixen muttered. <br>\r\n<br>\r\nThe empress waved the remark away. \"It doesn't matter. Wash the male up, dress him properly, and make sure he has a guard when he's escorted to Joran in the morning.\"<br>\r\n<br>\r\n\"As you wish, Empress Calysta,\" your captors respond, bowing their heads. <br>\r\n<br>\r\n\"Now may we please remove these stupid grass skirts?\" the skunk requested angrily. \"I look like such an idiot with it on.\"<br>\r\n<br>\r\nCalysta cocked an eyebrow at her. \"Why are you wearing them to begin with? You don't need camouflage to patrol your own jungle.\" <br>\r\n<br>\r\nEven with the fur on her face, you could tell the skunk was blushing furiously. \"Captain Sulla told us to put these on! She said we could better blend into the tall grass if we threw them over ourselves!\" <br>\r\n<br>\r\nCalysta rolled her eyes. \"I will speak with the captain about this idiocy, then. Take the male and go.\"<br>\r\n<br>\r\n\"Where am I?\" you blurted out. \"I wash up after some freak storm on an island with animal-people, who take me hostage and bicker whether to whore me out as a sex toy or work me to death filing papers, with no idea where I am or who the hell any of you are, and you don't even have the decency to ask my name or give me a say in any of this.\"<br>\r\n<br>\r\nIt took a lot for you to say that: Calysta's voluptuous and scantily-clad body and your previous arousal made it hard for you to keep your voice even. <br>\r\n<br>\r\nFor a moment, the women stared at you, and then the skunk's face twisted in anger and the fox shifted her spear for a thrust. <br>\r\n<br>\r\nCalysta, though, merely snorted.  \"You're a male,\" she said disdainfully. \"Your kind has caused enough harm to the world. Females are in charge now, and will remain so until time itself ends.\" She waved her hand. \"Take him away.\"<br>\r\n<br>\r\nAs the other two grabbed you by the arms and dragged you away, you caught a glimpse of the ceiling high above and the detailed map painted on it, and realized with a chill that none of the landmasses were the same.<br>\r\n<br>\r\nYou hadn't just been water-tossed, but space-tossed as you.<br>\r\n<br>\r\nYou were on another goddamn planet.</span></div></div>",
            "created":1312779600,
            "id":1164481,
            "title":"Calysta the Horse"
        },
        "152":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "She sees you as a threat to her civilization, and you must be delt with.",
                "She sees you as a potential Ally, you are treated to a feast.",
                "You are killed. Humans are of the evil one."
            ],
            "content":"<div class=\"\"><div> <span>  Lifting your eyes from the floor, the empress sits wearily upon her throne, almost anticipating the worst possible outcome. Your thick humid hair obstructs your sky blue eyes from her gaze as she scans you up and down. Thoughts are racing through your mind as your heart rate skyrockets.<br>\r\n<br>\r\n  The empress stands from her throne and dutifully approaches you.</span></div></div>",
            "created":1598249880,
            "id":2890446,
            "title":"Talia the Hyena"
        },
        "1522":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "Speak, \" untie me.\"",
                "Speak, \"yes, I feel pretty hungry...\"",
                "You are mute."
            ],
            "content":"<div class=\"\"><div> <span>  \"Are you hungry?\" The empress asks as she lifts your chin with her paw. You were pretty sure you \"expelled\" most of your last meal into the ocean, and are feeling quite unsatisfied. Your drawn out silence was almost insulting to her. She was beginning to wonder if you even spoke at all.</span></div></div>",
            "created":1598250540,
            "id":2890456,
            "title":"A feast."
        },
        "15221":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "I am a human",
                "<lie> I am an angel, sent to save your crumbling civilization."
            ],
            "content":"<div class=\"\"><div> <span>  Your deep voice was sudden and reverberant through her throne room. \"Unbind me.\" A simple demand. Her smug expression was pissing you off, even if your face didn't show it. Her subtle nod was all it took for your binds to be cut with the tip of a spear. <br>\r\n<br>\r\n  She waved her guards away as she began to circle you. Still on your knees, you took notice of the red marks left in your skin from the vines. \"You have such a beautiful voice...\" She trailed off, clearly searching for a word to call you. She stopped circling you, and knelt to your level. What are you called?</span></div></div>",
            "created":1598251500,
            "id":2890461,
            "title":"Demanding"
        },
        "152212":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "Show her the intricacy of your clothing.",
                "Show her the detailed \"holy\" tattoos on your body."
            ],
            "content":"<div class=\"\"><div> <span>  Her expression shifted to one of shock and disbelief. \"A- an angel!? How can I be sure?\" Her demeanor had crumbled before your very eyes, no longer was she so sure about her position of power. You were very entertained by the situation at hand and decided to play along. Removing your button-up flower print shirt, you begin to speak; \"I have been sent with very little, and have very little to show you. But I have this...\"</span></div></div>",
            "created":1598252280,
            "id":2890464,
            "title":"An angel"
        },
        "1522121":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "This reminds the empress of her nation's water issue.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>  Having removed your shirt, you show her how this shirt could not have been created by human hands, while refusing to tell the awestruck empress how the shirt was infact mass-produced by a large company back home. Before, she thought you dressed strangely, but now she fully believed that you were an angel, whatever an angel was. <br>\r\n<br>\r\n  Your slim torso was now exposed to the damp, heavy air in the throne room, and you were beginning to sweat. This quickly drew the attention of the empress.</span></div></div>",
            "created":1598253060,
            "id":2890468,
            "title":"Show her the intricacy of your clothing."
        },
        "15221211":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "Miles of ruin, this once great city had fallen.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>   The sight of your sweat struck a critical chord with the empress. You had not quite caught on with why she was suddenly so tense. She took your five fingered hand in her furry paw, and started tward a balcony. She began speaking in a very serious voice. \"My nation has been unsustainable on rainwater alone, and the ocean is not good to drink. My people are thirsty.\" You both arrive at the balcony, and she drops your hand. You both look out over the village to see:</span></div></div>",
            "created":1598254140,
            "id":2890473,
            "title":"Water water everywhere..."
        },
        "152212111":{
            "author_id":"jake115",
            "author_name":"Jake",
            "choices":[
                "Use your technical know-how to take over from here.",
                "Continue gently guiding their society."
            ],
            "content":"<div class=\"\"><div> <span>  Miles of barely standing structures lie inhabited by (from what you can see) females, very basic rain collectors are dotted around the city with lines. You watch as young male \"cubs\" are loaded onto a cart and hauled to the outer gates of the city. The entire city is filthy and covered in various grime. <br>\r\n<br>\r\n  Taking it all in, you exhale disappointedly. Keeping up the angel facade, you speak again. \"Your civilization is falling apart. If your people do not take immediate action, you will all starve off.\" A look of horror and dread creeps into the empres'es face as she digests those words. \"What should we do angel?\" Her body language has become frail and timid.</span></div></div>",
            "created":1598254980,
            "id":2890474,
            "title":"Ruin."
        },
        "154":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "She decide to give you, her head of guards, Hera the Hare",
                "She decides to give you to Malica the Lyna, the head priestess",
                "She decide to keep her to herself. "
            ],
            "content":"<div class=\"\"><div> <span>Surrounded by tall, muscular female guards, and smaller attentants, you see  a female rabbit is sitting down on a regal throne.  Unlike the other females that you seen, she is wearing a light blue tunic, and a long purple cloak that held by a golden pin.  She is wearing a golden, bejewel crown, and have golden bands on her arms and legs.  Her long ears were tied down, resembling a a ponytail of sorts. She had white fur with brown spots, in her arms, and legs She had big eyes, a small nose, a big bucky teeth.  She is small, looking even smaller in her big throne, but even sitting you can tell that she has a busty firgure.  In the right light, she can be very attractive<br>\r\n<br>\r\n\"I am Empress Valerin, ruler of the fine empire of Sulna.  So, why has my scout, brought this creature before me  \"  The female antho stated as she got up from her throne.  The female skunk bow her need.<br>\r\n<br>\r\n\"We found him in one of our traps, m'lady.  \"  the shunk answered.<br>\r\n<br>\r\n\"Him?  So you say that this creature is male, well, that is good, we been having a male shortage, so why is not in one of the auction house or the markets?  \"  the rabbit empress demanded.<br>\r\n<br>\r\nSuddenly a tall, robed figure appeared before the empress.  Even covered in robes, you can tell that she is female as well.  Come to think of it, all the attendants and guards are female. She take off her hood and you can tall, she a feline, a lynx by the looks of it. <br>\r\n<br>\r\n\"I believe that this is a new male species, my lady.  He has fur only on the top of his head, and he look different in other ways, as ways.<br>\r\n<br>\r\nA taller rabbit appear,  She looks a lot like the empress, but is taller, leaner, and more built.  It look like she wearing a bronze torso armor, a red sash, and a leather skirt with metal studs. \"But is he truely male, that the important.  He may be just a no-breast female,  We had that before. Take down his lower garment.\" <br>\r\n<br>\r\nThe guards  handling you pull down your short and boxers, reveal your gentitas.  You hear from gasp from the audience. <br>\r\n<br>\r\n\"Well, that answer that.  \"  The Empress slyly said.  Alright he is male.  One of us should take him.  Then we will deside what to do with him later.  <br>\r\n<br>\r\n  </span></div></div>",
            "created":1364274000,
            "id":1558052,
            "title":"Valerin the Rabbit"
        },
        "1541":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Hera, decide that you will be her daughter Beautice's slave",
                "Hera decide to take you to the autions",
                "Hera decideto give you to Zara the skunk after all. "
            ],
            "content":"<div class=\"\"><div> <span>Two large female anthro guards, a black panther, and a smaller guard, a lean coyote,  take your arms and drag you to the tall rabbit with the red sash.  Unlike the fox, and skunk that brought you eariler, these guards are also wearing armor as well.  The two are wearing body-fitting bronze armor, and a type of helmet as well.  You notice that they are not carrying spears but halberds instead.  Despite this, they are somewhat attractive, you are glad that your pants are back up.<br>\r\n<br>\r\nAs the two guards move you forward, you see that the tall rabbit and the smaller one are having an argument.<br>\r\n<br>\r\n\"M'lady, pardon my objections, but what will I do with this...male.  I lost my Huron, years ago that last thing I want is another male in my life\"  <br>\r\n<br>\r\nThe smaller one, the empress, place her hand on the bigger rabbit's shoulders.<br>\r\n<br>\r\n\"Hera, Hera, HERA.\"  Valerin started.  \"It been a while since you had any males, I hear you hadn't even been renting.  I'm insteresting in this male, as well, but I enjoy Rat-boy so much, I don't think I could want a replace  Even if you don't want him yourself, you can alway give to your daughter, Beautice. I pretty sure that that this male is a different species.  You told me that Beautice is look for a slave, that won't give her babies.  With a little training, he's perfect.  <br>\r\n<br>\r\nThe taller rabbit lady groan at this.  \"M'Empress,, Renting?  I heard that you haven't renting a rabbit male either.  You must have hiers, and Rattus can not give you any.\"<br>\r\n<br>\r\nThe taller rabbit paused.   \"Beautice has many needs, and I don't know it this male can satisfied them.  <br>\r\n<br>\r\n\"Well, You can help her out.  He'll be your slave, as much as her's\"  The Empress stated.  \"  and even if you can't work it out, you can always go to the market forum, and sell him there. Now, are you going to take him, or do I have to give you the order to take him.\" The rabbit empress's face become serious.  <br>\r\n<br>\r\n\"As you command, my empress. \"  She sighs.  The bigger rabbit was the three of us over.  \"Alright, I take him to my quarters.\"<br>\r\n<br>\r\nYou leave the palace at a slow steady pace, watching the group of attentants, look at you as a curiousity.  You again notice that all the anthros, you see are all females.  As you are match out to the street, a large crowd appears.  As the guards that are holding you are pushing their way through the crowd, you see the first male anthros.  They are a varied as the female, tall, short, fat, and lean, but all of this have little clothing.  Most have nothing more than a loincloths, or bottom of a tunic.  They also have some sort of collar around their necks.  This is so curious that you feel compel to talk.<br>\r\n<br>\r\n\"Are all the males here,... Slaves? \"  you bravely asked.<br>\r\n<br>\r\nThe taller rabbit that you have been trailing, turn her head.  \"Yes, as par, since this empire founding, ever male that enters or live here, become a slave to a female.  My name is Hera by the way. Hera, the hare.\"<br>\r\n<br>\r\n\"Oh, I thought you were...\"  you start, but the seriously face on the rab-no hare tell you to shut up. <br>\r\n<br>\r\nSuddendy, a female anthro break through the crowd.  It a female skunk, as you look at her body, leather bra and clothes, you realized that it's same skunk that captured you.  <br>\r\n<br>\r\n\"My lady, I hear that you don't want this male.  I can take off your hands.  I could use a new sitting slave..\"  She start.<br>\r\n<br>\r\nThe skunk's too eager face make you nervous.  \"Perhap if he misbehaves.  I rather give him to my daughter.  Now, Zora, Please be kind enough TO GET OUT OF THE WAY!!\"<br>\r\n<br>\r\nThe skunk's face quickly turn from disappointment to fear.  She stand there stun.  The four of you leave the crowd and enter a large Villa.  <br>\r\n<br>\r\n\"Palma, Glaive, that enough now girls.  I got it from here.  Go home to you Hurons, and children.  I got it from here.\"  The Hare stated.<br>\r\n<br>\r\nYour two guards take a short bow before they turn and leave.  You enter the Villa's gates, where a small army of what you assume are servants gathers.  The hare grab your cuffed wrists and take you an old cat anthro<br>\r\n<br>\r\n\"Doma, take this male to the slave sleeping quarter.  \"  I will decide what to do with him Tommorrow.  <br>\r\n<br>\r\nThe old cat take you to a small building where you see, several straw mats, with various collared males.  She put you down to a empty one, and then lock the door.  You won't be leaving tonight.  You hope you can handle what going to happen tommorrow. <br>\r\n<br>\r\n</span></div></div>",
            "created":1364360400,
            "id":1558589,
            "title":"She decide to give you, her head of guards, Her..."
        },
        "15411":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "You tell Doma what happen to you last night..in full detail",
                "Doma has to convince you to tell you what happen"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n You are pulled out of doorway of the small building that you was staying for the night. You watch the anthros that was in the buildings, the male slaves of the amazons leave the building and   go to their various task.  Doma, the older cat that had put you in there take the cuffs and lead you to a even smaller building.  She pull you inside<br>\r\n<br>\r\n\"Ah, here we are.  This is the bathhouse.  We need to clean you up before, you meet Mistress Beatrice.  You need to impress her if you want to take you as a slave.  If she doesn't then Hera would have no choice but to sent you to the auction house, and believe me, you don't want that to happen.\"<br>\r\n<br>\r\nDoma, pull you through a small doorway to a room covered by steam, and there a small pool of water.   She un-cuff you, and as you rub bed your sore wrist,  You see one of the male anthro that you see before, a rat male name Zonk.  In his hand is a pair of towels, and he is wearing just tiny loincloth.<br>\r\n<br>\r\n\"Well Zonk,  I enjoy that little show that you are give me, but I don't think our new guest appreciate it as much as I do.\"  She signal Zonk to leave. \" I going to be bathing the new male now.  \"  Go help Mun at the storage room.\"<br>\r\n<br>\r\nThe little rat anthro give the older cat lady the two towels are quickly leave the bathhouse leaving you alone.  The Older cat remove her tunic, revealing her nakedness to you.  Doma has blue fur, large eyes, large, usually firm breast, and very wide hips waist and belly.  She signal you to remove your clothing as well.<br>\r\n<br>\r\n\"Alright boy, I want to see why the attendants at the palace was looking at.  Remove your clothing, now.\"<br>\r\n<br>\r\nSlowly, you shyly take off your clothes.  Despite her size, you are surprise at Doma's graceful steps as she slander to the pool. She sit down, lowering herself until you can't see her body clearly anymore.  She wiggles a finger to you.<br>\r\n<br>\r\n\"C'com, I can't bathe you if you just standing there. Get in.\"<br>\r\n<br>\r\nYou get in the pool.  It very warm, almost hot.  You are surprise to find that the pool is rather deep.  Doma come over you and stand up. As the water dripped from her furry body, you can't help to notice Doma's huge breast are right in front of your face.  You wonder how such large breasts can be some upright.  Suddenly Doma grab your hair and neck.  She pull your head up from her breasts to her intuited face.  You hear and smell her take long deep sniff.  She stick out her long tongue and lick your face.  She does thing several times, and by the time she is done, you face is cover with cat saliva.  She stop sit down for a while and sighs.<br>\r\n<br>\r\n\"There's no doubt about it.  You have a taste of a female on you.  If I know anything about the girls around here.  One was on your face.  While the other is...\"  She wink at you.  \"I think I know what she was doing.\"<br>\r\n<br>\r\nYou blush in embarrassment.  Last night was some experience, you never felt so helpless, so dominated.  It was the best sexual experience in your life.<br>\r\n<br>\r\nShe get up, and pull you and herself out of the pool.  She lay on top of you.  She shorter than you all, but you can feel the soft weight of her breasts.  She sit up, and for the first time you notice her nipples.  They are sticking out beyoud the fur on her chest.  She is straddling you with her arms cross.<br>\r\n<br>\r\n\"Now something very interesting happen last night.  You can tell me now, and I say if I Hera need to know.  Or..\"  <br>\r\n<br>\r\nDoma move forward and presses her big breasts over your face, and surrounding a good deal of your head. You can still hear her, but with her leavage you can push her off, at least no easily.<br>\r\n<br>\r\n\"Or I can convince you.  We might have some fun along the way, but only if I feel like it. \"<br>\r\n<br>\r\nShe move back, and returned to her pervious position.  <br>\r\n<br>\r\n\"Now what's it going to be?\"<br>\r\n</span></div></div>",
            "created":1365656400,
            "id":1569707,
            "title":"Before you meet Beautrice, you need a bath."
        },
        "154111":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "It a horny guard, watch out",
                "It just a male slave that didn't get caught for curfew"
            ],
            "content":"<div class=\"\"><div> <span>The night before you find out that a small buildings that you have been staying at is the local tempary holding spot for all the local males. You find out all the male are slaves subject to the mistress's of the house demands, and getting no pay.  One, an older cat anthro, name Mun, is the first to greet you.  He is an older tabby cat as well.  Beside a tunic, he is also wearing what look to be a toga.  The other anthros just look at you in amazement<br>\r\n<br>\r\n\"Welcome stranger\"  he greet, the moment that the door to the small building is close.  \"Welcome to your the empire of Sulla, where every male is a slave.\"<br>\r\n<br>\r\nA large group of anthros surround you.  They are different sizes, and species, but all to them where tunics, collars, and for some reason, bracelets.<br>\r\n<br>\r\n\"Uhh,\"  You start.  The cloness of your new roomates make you nervous.<br>\r\n<br>\r\n\"You are a strange one, stranger.\"  a small mice anthro stated.  You notice that all he wearing is a short pants.<br>\r\n<br>\r\n\"Don't crowd him.\"  Mun stated as he push the other anthros away.  \"So how did you get into the house of Hera, friend.\"<br>\r\n<br>\r\nYou slowly explain the events that lead you here.  From your cruise ship, lost trek in the jungle, and to the palace of the empress.  By the time you are finish, it is already dark outside<br>\r\n<br>\r\n\"Interesting,\"  The cat anthro said when you done talking.  All the other males are very interested in way you say, and stay silent. \" I don't know how your \"cruise ship\"  you called it got here.  But most of the males here was captured in the jungle.\"<br>\r\n<br>\r\n\"Captured?\"  You asked.  Why are the males captured, why in the jungle, why are all the male slaves?..Why...?<br>\r\n<br>\r\nMun stop you.  \"Whoa, Whoa, you have a lot of questions, my friend. I been part of Hera's household for decades, and I don't think I can answer all the question you might have.  You remind me of ...who?\"<br>\r\n<br>\r\n\"Tody\"   a guff looking male..pig answered.  He was a tall, bulky character, with scar around his eyes, and small tusks.  Come to think of it, he look more like a boar, maybe a feral pig.<br>\r\n<br>\r\n\"Ahem, Yes, Toby was as curious as you.  See he, like Daks here, and I guessing you,  I can answered the  question right now, but the others are going to wait.  It been a long custom that the males of Empire, are sent to the jungle, the plains, and the forest are a young age to toughen them up.  The males are captured and sent back to the city and villiages as slave to the females there.<br>\r\n<br>\r\nSuddenly the young mice male come up.  \"Mun, the curfew..\"<br>\r\n<br>\r\nMun wave him away.  \"Of course, well my friend it time for light out. We talk more in the morning.<br>\r\n<br>\r\nMun lead you to the straw bed, and you and the other males turn the fires out.  You are worried about your fate, but you are sure that everything will work out.<br>\r\n<br>\r\nIt in the middle of the night when you are suddenly awoken.  You realized that someone is sitting on your chest.  She is light, but you can feel her feel.  Of, course you can't see anything.<br>\r\n<br>\r\n\"Oh, Inna, Another male, and he unclaimed too.  \" You hear a voice.<br>\r\n<br>\r\n\"Well, what is he?\"  another voice asked.<br>\r\n<br>\r\n\"I think he some sort of monkey.  Do you see the resemblance?\"  a complete different voice answered.<br>\r\n<br>\r\nYou are a little miffed to be considered a \"monkey\" but when you come to think about it. What the difference between a monkey anthro and a human anyway?  You open your eyes, and see a group of anthro around you, The fire at the end of a torch that one of them is carrying show who they are a rat, a dog, maybe a lab, and a tabby cat. They all wear loose tunic with long necklines.  You can tell from each of the generous cleavage of the anthro, that they are all females with some sexy curves. The tabby takes your cuffs, and with a single hand, pulls your hands above your head.  Now you are helpless.<br>\r\n<br>\r\n\"Hey, all you Huerons out there.\"  The cat anthro yell out.  \"I suggests you stay quiet, and leave us alone.  If anyone, try to tell on us, or try to stop us.. I going to say that you got rape us.\"<br>\r\n<br>\r\nYou hear a collected moan from the room.  Then... total silence.<br>\r\n<br>\r\n The rat is the one who is sitting on your chest. She is straddling you, her thin legs around your stomach.  You can tell that she, and the others that are with you are all female.  She is wearing a short tunic, and apparently nothing else.  She had big buck teeth, Mostly gray fur, and short triangle ears.  You can't help to notice that she has sharp teeth and yellow eyes. You can tell, that she wet where she is sitting on your stomach.  <br>\r\n<br>\r\nSuddenly you feel furry hands...over you clothed cock. Hands pull down your shorts, and you feel furry hands on your cock.  The hand move up and down. You become harder and harder.  Back in the hometown, you didn't considered yourself a \"furry\"  but when you are bored you something try to find the more exotic nature of anthro and furries.  Unlike many people, you understand that most aspect of furriness or furry are not sexually, but...well... your current situation, with three randy anthro females have their way with you well, you can't ignore your feelings. You find yourself become hard<br>\r\n<br>\r\n\"Be careful, we don't want to be caught.\"  The rat said.  She flashes your eyes on you.  \"So, how many females had your cock in them.\"<br>\r\n<br>\r\nWow, they are realized forward here.\"  You think to yourself.  You think back to \"successful\" relationship you had back, where, they are no anthros.  \"<br>\r\n<br>\r\n\"I laid with a couple of girls.\"<br>\r\n<br>\r\nAll three female look at each other.  \"Just a couple, you seem too old to be just a couple of girls?<br>\r\n<br>\r\nYou don't quite understand.  Before you can answer, the rat move back and rubbed her pussy over your cock.<br>\r\n\"Hey, I'm still working here.\"  The dog said.  You realized that it the dog that stroking your cock.<br>\r\n<br>\r\nThe rat move to your stomach. \"Is he ready yet, I am SO wet.\" The female rat anthro give you a nasty lustful toothy grin, and slip and clawed finger under her skirt.  She brought the wet fingers, and push it through your mouth.<br>\r\n<br>\r\n\"Taste it.\"  She demanded.<br>\r\n<br>\r\n\"Wow, he's bigger than I thought he would be.  \"  You here the dog say.\" Alright, I think he's ready to go.\"<br>\r\n<br>\r\nYou feel furry hand leave your cock.  You can't see it, but you assume that you eight inch cock is hard and straining.  She took her furry hand took your cock and pull it up. , you watch the rat girl lower her self down.  She slow about it, feeling impact of your cock inch by slow inch. You are amazed at the feel of her hot box.  There are so many unfamiliar sensesations, like the way her fur rubs against your thighs.  The way she move and grinds however is just as you remember/. The rat lady stayed to ride you, going up and down.  With you hands above your head, you are unable to stop here.  Not at this point would you want to.  <br>\r\n<br>\r\n\"You can all the fun.\"  You hear the cat say.  You see that she had raised her tunic, showing her pussy's pussy.  She straddled her legs over you, and slowly lower herself on your face. She sit complete down.  Your mouth is under her pussy, and you realized you nose in middle of her butt.  The first thing you feel is the intense feeling of your first facesitting.  The next thing that you feeling the that lack of air in your lungs.  The cat anthro's butt is blocking your air.<br>\r\n<br>\r\n\"Alright male, I want to feel you licking.  If I don't cum, then you don't breathe.\"  She demanded. <br>\r\n<br>\r\nYou hear the dog anthro voice.  \"Don't kill him, We get in so much trouble.<br>\r\n<br>\r\n\"Well the cat anthro's whose butt in still on your head. \"He know the stakes.\"<br>\r\nNow lick me!\"  She demanded.<br>\r\n<br>\r\nThe female sat still on your face.  She smell like wet fur, and as time passed your arousal go down.  You forced your tougne out from your mouth and push your tougne up her pussy.  Luckly for you, you have experience from previous girls, and soon the female cat anthro is moaning above you.  <br>\r\n<br>\r\n\"Oh, Oh,  That's right, that feels good.\"  <br>\r\n<br>\r\nThe female dog is obviously upset. <br>\r\n <br>\r\n\"Oh, where, am I going to go?\"  She asked.<br>\r\n<br>\r\nYou hear, or feel the cat anthro sitting on your face, answered her.<br>\r\n<br>\r\n\"Had you ever had a spit roast before?  Just get on him.  I uncuff him and...<br>\r\n<br>\r\nSuddenly, you hear the door.  It seem like someone is open the door to the building.  The room is illuminationing. You can see your captors clearly now.  The rats that is riding you is still going strong. She is pumping and bouncing up and down on you  hard.<br>\r\n<br>\r\n\"Oh, crap. \" You hear the cat say.  She give off you and pull the dog away.  \"We got to get out of here.  Hey, you rat, we got to go.  If we get caught...<br>\r\n<br>\r\n\"Oh, Oh, just block the door, or somethhhhiiiinnng. OHhh, I so close!\"<br>\r\n<br>\r\nYou tell Doma that the cat anthro's facesitting had taken your arousal down near to zero.  However seeing the rat girl on yo, pumping, grinding and bouncing on your body, had given you the hardest erection that you have ever felt.  The two of you start thrust maddly against one another.  The female cat and dog come to the door and push their bodies against it.<br>\r\n<br>\r\n\"What the hell? C'com open please!.  \"<br>\r\n<br>\r\nThere is loud banging on the door, but the two of you are too close to stop now.  The rat anthro bouncing on your cock erupt first, followed by you.  You pump the rat's pussy with your cum as you explode.<br>\r\n<br>\r\n\"Are you done yet?\"  THe female cat anthro as she leave the door and come toward you.  <br>\r\n<br>\r\n\"Ahh, Ahh, AHHH\"  The rat anthro says as she slowly get off.  \"Yeah, I done.  Man that was great.  I can't wait to do that agian.\"<br>\r\n<br>\r\n(BALM)(BLAM)(BLAM)<br>\r\n<br>\r\n\"We won't be able to do anything if we get caught.\"  The female dog anthro said as she was the only one holding the door.  \"Let's go!!\"<br>\r\n<br>\r\nSuddenly the light went out, and you can hear fantic footsteps fainting away.    At last the door open, light pour in and someone else enters..<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1367902800,
            "id":1585937,
            "title":"You tell Doma what happen to you last night..in..."
        },
        "1541112":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "The next day, in the morning",
                "The next day, in the afternoon."
            ],
            "content":"<div class=\"\"><div> <span>\"(PANTS) (PANTS)(PANT)  MY...my..fellow males, what was all that?\"  you hear a youthful, obviously male voice say.<br>\r\n<br>\r\nIn the light of the room enter a tall and lanky character.  His coat is white with black spots, and his long arms and short legs make him seem more like a gorilla at first glace.  However, his horn, and snout make him different.  As a final touch, you look down and see his hooves-ed feet.<br>\r\n<br>\r\nA Minotaur,..maybe.<br>\r\n<br>\r\n\"Toby!!\"  the crowd exclaims as the group move closer to the door, and bringing him into more into the room.  You watch as Dars take a good look outside and quietly closed the door.<br>\r\n<br>\r\n\"So, so Toby the bull calf is back.\" he said quietly.<br>\r\n<br>\r\n\"Bull calf?\"  you asked.  <br>\r\n<br>\r\n\"Aye...if he was a full bull than he would have been worth a lot more...still he would be a teenager for much longer.<br>\r\n<br>\r\nThe males began talking in quietly but rushed voices.  There seem to be a lot questions being asked because as soon as he sat down, he raise is hands.<br>\r\n<br>\r\n\"Alright, Everyone, Alright!  I'm fine.\"  He smiled.  \"I'm fine.\"<br>\r\n<br>\r\n\"Well Tody\"  Mun smiled back.  \"I sure that you had fun with your 'special' lady.  but you are playing a dangerous game.\"<br>\r\n<br>\r\nToby's smile disappear as he went into a thoughtful glare.  \"Don't worry if didn't go too far.  I still 'pure'  if that what you are wondering.  Still, It not fair that we do not choose who we want to be with.  I will be sold soon, and I might never see her again.\"<br>\r\n<br>\r\nMun came close a place a hand over Toby's shoulders.\"I know that it hard, and it harder since you was born outside the empire, but things will work out.  I will talk with Hera. Your friend is good with Mistress Hera.   By the way, we have a new guest. Like you...he rather different.  Despite your look, the two of you might have more similarities than differences...\"<br>\r\n<br>\r\nToby walk up to you.  Even through Toby is not\"full ground,\" he still taller than you. He take you hand and shake it pretty hard.  \"My name is Toby...Toby Hard-Iron.\"<br>\r\n<br>\r\n\"Oh\"  he say as you look at his \"hand.\"  While all the anthro you met only had three fingers and a thumb.  Toby's hand is similar to yours.<br>\r\n<br>\r\n\"Look at that, Toby said as notice your hands as well.  \"I guess we are more alike than I thought.\"<br>\r\n<br>\r\n\"Yeah,  My name is ---------, I'm a human, and I crashed land here\".<br>\r\n<br>\r\n\"A human,\"  he said slowly.  \"I hadn't heard of that species in a long time.\"<br>\r\n<br>\r\n\"Really?  you asked  \"You heard of humans before?\"<br>\r\n<br>\r\n\"Yes,  apparently one was my grandfather.\"<br>\r\n<br>\r\nBefore you could ask questions about that,  Mum look at the others in the room. <br>\r\n<br>\r\n \"Alright everyone, let's get some sleep.  I think we have enough excitement tonight.\"<br>\r\n<br>\r\nOne of the other male anthro leave you to thankfully, another bed, and you lay down.  You think about your new life, a possible slave to anthropomorphic animals.Some sexy, curvy, more womanlike females, but anthros nevertheless.    A intense sexual experience, while usually, it not something that you objected too.    <br>\r\n<br>\r\n\"What going to happen tomorrow?\"  you say to yourself before falling asleep.  <br>\r\n</span></div></div>",
            "created":1493528400,
            "id":2313299,
            "title":"It just a male slave that didn't get caught..."
        },
        "15413":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "Accpet that you are going to be a slave to Zara",
                "RUN!!"
            ],
            "content":"<div class=\"\"><div> <span>The old cat take to a small building on the side of the largest building.  She pull you in and silently locks the door.  You won't be leaving tonight.<br>\r\n<br>\r\nAs time passes, you become more curious about your surroundings.  You watch the various anthos going through the various task.  Even from the small window in the door, you noticed the less clad male are doing a lot more physically work than the females are.<br>\r\n<br>\r\nSuddenly you hear an intense conversation coming from next door.<br>\r\n<br>\r\n\"Beatrice, what this MALE doing here?\"  you hear a stern voice say.<br>\r\n<br>\r\n\"Gods, mom, do you ever knock!?\"  a young voice screamed.<br>\r\n<br>\r\n\"I didn't need to knock just to see that you are With another male.\"  There was a pause.  \"Just how old are you?\"<br>\r\n<br>\r\n\"I...I\"  you hear a male voice start to stammered.  \"I am of age..\"<br>\r\n<br>\r\n\"Well I don't care.  OUT!\"  <br>\r\n<br>\r\nYou hear the sound of quickly scampering feet, then the slamming of a door.  There is a lot of noise, but you can't understand what is being said.  Suddenly the door open up.<br>\r\n<br>\r\n\"That it, I had a gift for you, but screw it.  I going to give your new slave to..to Zara \"  You hear Hera's angry voice.  \"Dorma, where that new slave?!\" <br>\r\n<br>\r\nThis is not good ! As you wait, wondering if you going to be given to the shunk that capture you, you wonder..should you try to run.  It's dangerous, but better than being a really eager Zara.</span></div></div>",
            "created":1423285200,
            "id":1929003,
            "title":"Hera decideto give you to Zara the skunk after ..."
        },
        "1542":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "Green , the Forest goddess",
                "Red, the Predator goddess",
                "Blue, the Sky Goddess"
            ],
            "content":"<div class=\"\"><div> <span>The tall robed figure that you saw before, move closer to you.  She is slightly taller than you and look down with her silted yellow eyes.  She turns to the empress. <br>\r\n<br>\r\n\"Perhaps Cello, the sky  goddess, or Layna, the forest goddess can be \"serviced' by this new species.  They may have an answer to us.\"<br>\r\n<br>\r\nValeria look down on the priestess.  \"So, Malica, what do you suggest?\"<br>\r\n<br>\r\nYou are unpleasant surprise when Malice lift her hand-paws to your cheek.  She also give you an uncomfortable smile.  <br>\r\n<br>\r\n\"I suggest, my empress, that this male should be sent to the grand temple Gala Asure.\"  I should that the various priestess then would put him to good use.\"<br>\r\n<br>\r\n\"I see.\"  Valeria giggled.    \"I sure, the novices there would have even more use for him than the priestess would.  Alright, It is agree, Malica, you make that this male and do what you deem necessary.  \"<br>\r\n<br>\r\n\"As my empress commands.\"  Malica stated as she bows down the the rabbit.   She turn away as start to leave the room.<br>\r\n<br>\r\nMalica leave your side as Two large female anthro guards, a black panther, and a smaller guard, a lean coyote each take a armor.  Unlike the fox and shunk that brought you here in the throne room.  The two are wearing body fitting bronze armor, and are carrying halberd, rather than spear.  You surmise that this two are part of some royal guard of some sort.  Despite this you notice that the two are attractive, and you are glad that you have the pants up.  Between the two of them, you are forced to follow the robed Lynx.<br>\r\n<br>\r\nAs you leave the room in a slow, steady pace, you notice that the group of figures in the room, are all well dressed and groom, Perhaps they are some sort of attendants?  One of them, a mouse-like one come close to you and whisper to your ear.<br>\r\n<br>\r\n\"Beware the Hall of Oraca\"  She stated.  As you look at her, you notice that she had one of the most blank face you seen  here.  Before you can inquire further, you are push through the crowd.<br>\r\n<br>\r\nBy the time you leave the Palace ground themselves, you see and hear a large crowd of anthros surround, but they push back by the guards.  As you are pulled, you notice several things about your crowd.  The vast majority are female.  Some are wearing short dress, while other wear the similar two piece of the scout that capture you.  The few male that you see, are different.<br>\r\n<br>\r\nThey are as varied as the females that you see in size and species, but they wear little clothing, nothing more than loincloths really.  All of them have some sort of collar around their neck.  This bother you so much that you feel like you have to ask some questions. <br>\r\n<br>\r\n\"Are all the male here..captured?\"  you bravely asked.<br>\r\n<br>\r\nMalica, who you had lost track in the crowd, appears and give you an answer.<br>\r\n<br>\r\n\"Something like that, it more complicated than that.  Since the empire founding, every male  that enters our cities and live in our settlements become a slave under the care of female.\"<br>\r\n<br>\r\n\"Oh\"<br>\r\n<br>\r\nYou stay silent as you notice the crowd becoming smaller and smaller.  Before you know it, it just you, the two guards, and the priestess.<br>\r\n<br>\r\n\"Where are you going?\"  you asked after some time has passed.<br>\r\n<br>\r\n Malica turns her head.  I plan to take you to the grand temple of Gala Asure, but before, we going to make a stop to the other temple first.  Now, I suggest that you wait until we are on the road before you have ask any more questions.  Oh, here we are.\"<br>\r\n<br>\r\nMalica move out of your feild of vision and you see a large group of robe figures in front of you.  That are divided into three groups.  Malica turn around and spread her arms.<br>\r\n<br>\r\n\"Well, male, these female are the priestess of the various goddess of the empire, Those in green follow the Goddess  of the Forest, Those in Blue follow Cello the Goddess of the sky, and those in red follow Oraca, the Predator goddess.  Now normally I choose where I would go, but, I quite curious about you, male.  So I let you choose.\"<br>\r\n<br>\r\nAll eyes suddendy turn to you. Choose carefully.<br>\r\n</span></div></div>",
            "created":1395637200,
            "id":1766630,
            "title":"She decides to give you to Malica the Lyna, the..."
        },
        "15421":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "Escape into the woods",
                "Stay where you are"
            ],
            "content":"<div class=\"\"><div> <span>\"Ummm...the Goddess of the Forest\"  you answered.<br>\r\n<br>\r\n\"Vera...\"  Malina commented.  \"That's an interesting choice.\"  She seem to give a signal of some sort, and the small group of green hooded figures came forward.  You noticed that the green robed figures are shorter than the other group is.<br>\r\n<br>\r\n\"Vera is the goddess of the Forest, particular the main goddess of the Lagomorph Parthenon.\"  Malina stated as the hooded  figures grabbed your limbs and pull you forward.   Many of Empire's rabbits, hare, mice, and rat worship her.\"<br>\r\n<br>\r\nSuddenly, Malica grab you chin, forcing to look straight into her stilted eyes.  \"  I had hope that you have chosen Oraca, the Predator Goddess.  It would have been interesting to see how a...hairless monkey like yourself would have done.  \"<br>\r\n<br>\r\nYou are pulled further away from Malica, as the green robe figures surround you.<br>\r\n<br>\r\n\"As head priestess of the Empire...\"  Malica said as you was lead away.  \"I will see you again.at the Gala Asure and I will report your progress to the empress.\"<br>\r\n<br>\r\nAs the small group leave with you. a hood figure talk direct to Malice.  \"We, the actololys of Vera will take care of this gift from the empress. \"<br>\r\n<br>\r\nOnce again you are lead, and pulled to your new destination.  The small group of green robed travelers travel some time in silence. You take a look at your captors, and realized after a while, that most of them are female. Even under their thick robes and hoods, you can see their busty figures.  The one in front, has a especially round butt.  Seeing it move, keep you going for a while.   After a while of hour of straight walking you're tired.  You then worry that you have to walk a long way just to get anywhere.  Just when your feet are swore from walking.  The small group stop at a clearing, surrounded by fallen logs<br>\r\n<br>\r\n\"I think this should be the best place to stop. \"  you heard a voice say. <br>\r\n<br>\r\nThe green robe figures, who have been hold you up for sometime.. set you down on a fallen log.  Other green hood figures sit down as well.  Some of them take off their hoods, revealing their faces.  As you look around, you notice that nearly all the green clad anthro around you are rodent-like in some way.  Squirrels, rats, mice, rabbits and etc. As stated before, most of them are definite female, but you notice that a few are male, or at least you think they are.  They are clad in green as well, but they have metal bracelets and leggings on their limbs.  Did one of them had a ball and chain?  You are not quite sure.   They are also breathing as hard as you.<br>\r\n<br>\r\n\"I thought the Vera Carriage was supported to meet us at the Field of three Goddess\"  one of the rat complained.<br>\r\n<br>\r\n\"I heard that it had a primary mission before,\"  a rabbit says as she point to you.  \"This happen.\"  <br>\r\n<br>\r\nWith that, everyone take an uncomfortable long look at you.  There is silence for a while, Then there was a long collective sign.  Firnal the Group seem to scatter away.  Even your the two hood figures that been holding your arms the whole time began to relax.  They take off their hoods, and you are slightly impressive that it was a mice and squirrel that been gripping the whole time.  A quick look at their bodies tell you that they are female as well. They stay right next to but release your arms.   For the moment you are free.  The three of you stay there, trying to rest.  The one on the right stiffen a yawn.  The other laid to the side, almost falling off the long.   As the two have been have carry the whole time, they take a much longer time to recovered than you.  When you slowly give up, the two don't move.  You look around, and you notice that no one is even looking at your direction.  this is your chance!<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1453352400,
            "id":2092099,
            "title":"Green , the Forest goddess"
        },
        "154211":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "To the trees",
                "To the pig brother's hideout."
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\nMoving slowly, you take you time moving away from the clearing where the green roble creatures are.  Making sure that they everyone is not paying attention to you, you go deeper into the wood.<br>\r\n<br>\r\nWhen you were younger you had hike with your family, so you not totally helpless., but these wood aren’t like the one you know.  The trees ware large thick wood that remind you the pictures of the Redwood forest you saw in that book. After wandering for a while, you hear some light feminine voices.  Looking back where you came, you see flash of green. You turn ot the left and run.<br>\r\n<br>\r\n Within an hour, you are pretty sure that you have escape you captor.  You are also pretty sure that you are totally lost.  Even if you wanted too, you couldn’t go back into that clearing.  Just when it reaching dusk time. You are beginning to regret your decision.  You are tired and hungry.  You sit down to catch your breathe when you hear a voice in the air.<br>\r\n<br>\r\n“Mine, Mine you little monkey.”<br>\r\n<br>\r\nYou look around.<br>\r\n<br>\r\n“Up here, monkey!”<br>\r\n<br>\r\nYou look up and see the owner of a voice.  It is a cat-like anthro. She limber down, showing her slim flexible body. She gracefully land in front of you From what you can see, you can tell that she is a female, with her small, but full fur-covered breasts. She also taller than you, through not by much.   She has light orange fur, with black spots. With the exception of some armbands, anklets and a braid necklace, she wearing nothing a all.  She give a sharp teeth grin.<br>\r\n<br>\r\n“Well it look like I was wrong,  You not a monkey.”  She said as she walk around you.  “So what are you?”<br>\r\n<br>\r\n“I’m….I’m a human.”<br>\r\n<br>\r\n“Human, never heard that?”  She said quickly.  “Well ..does HU-man.. has a name?”<br>\r\n<br>\r\nYou give her your name, and also ask if she has any water.<br>\r\n<br>\r\n“Mine name is Val Sona, and I don’t have any water, but, well, you have been out here in the wood for a while. I guessing….that you are not just lost.  Are you trying to run away?”<br>\r\n<br>\r\nYeah, they was some green robed…”<br>\r\n<br>\r\n“Say no more.  So those priestess want another scholar-confessor.  Well, I supposed I could help you, for a price.  “<br>\r\n<br>\r\n“I..I don’t have anything…”<br>\r\n<br>\r\n“Well, I don’t have any water,  I suppose I can give you some milk from these babies.”  <br>\r\n<br>\r\nShe grabbed her non clothed breasts and rubbed them against your chest.  Though you couldn’t see them, you can defiantly feel her nipples.<br>\r\n<br>\r\n“Oh I just teasing” she says as she see the look on your face.  “I couldn’t give you much with these anyway.<br>\r\n<br>\r\nThe air is full of the sounds of sharp feminine voice.<br>\r\n<br>\r\n“I guessing that they are looking for you?  Val asked. You nodded.<br>\r\n<br>\r\n “I guess we got you take you somewhere where they won’t find you, if you are willing to do what I say.” <br>\r\n<br>\r\nShe grabbed your hand and drag you off to the side, near some bushes. You tried not to worry about the sarcastic tone in her voice, as a group of green robed figures appear soon where you were just at.  It’s defiantly the same group that you escape from, but it seem that they are them.  Most are smaller than the first group, but you see a couple of tall, large figure that just tower over everyone else.  <br>\r\n<br>\r\n“Quite the party,” Val whistled.  “If you want to get away, now would be the time.”<br>\r\n<br>\r\nYou stare at her like she crazy, maybe she is. “I don’t know where I am, I was lost”  <br>\r\n<br>\r\n“Don’t worry I haven’t forgotten,” Val teased again.  “I could take you up the tree and lose them there, but that a lot of work, I want a good payment.  Or,,, there some pigs to the north of here that have a good hideout.  They haven’t been caught, and I could convince them to help you.”<br>\r\n<br>\r\nYou peek through the bushes and realized that your hiding spot won’t last much longer.  <br>\r\n</span></div></div>",
            "created":1465534800,
            "id":2161947,
            "title":"Escape into the woods"
        },
        "1543":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "She take you straight to the bedroom have her way with you",
                "Welcome to the royal baths",
                "Stay in the throne room and set some ground rules."
            ],
            "content":"<div class=\"\"><div> <span>Valerin leap from the throne and look closer at you.  Somewhat to your surprise, she pressed her rabbit finger to you chest.  Her finger go from your clothed nipple down, down, down to your crotch.  She smiles and give you a lustful glare.<br>\r\n<br>\r\n\"Hmm, well it seem that you're well built-ed. What is your name, male, and what species are you?\"  Valerin asked.<br>\r\n<br>\r\n\"Majesty,\"  The taller rabbit says. \"you can't be seriously considering..\"<br>\r\n<br>\r\nValerin raised her hand.  \"I just curious.  Now let the male speak.\"<br>\r\n<br>\r\n\"My..My name is (your name) and I am a human.\"  you state.<br>\r\n<br>\r\n\"Hmm\"  Valerin says as she continue to press her hand and finger on  your body.  \"What a human?\"  <br>\r\n<br>\r\nThe Lynx in long robes answered her.  \"I believe is some sort of ape or monkey.\"<br>\r\n<br>\r\nValerin walks around you.  \"He is not like any monkey I seen. \"  She smiles.  \"Bring me Rat boy.\"<br>\r\n<br>\r\nThe crowd of attendants and couriers part ways as a tall, lanky, thin male rat appeared.  He was wearing a purple cape as well, but was not wearing much else but a lioncloth.  He bowed down low, on all four.<br>\r\n<br>\r\n\"Valerin did you call for me?\"  The rat asked.<br>\r\n<br>\r\nValerin walk around you again before she grab your cock through your short.  There is a collective grasp from the throne room couriers and attendants.<br>\r\n<br>\r\n\"Rat-boy, you are going to my cousin's place and staying there You're are dismissed.  \"<br>\r\n<br>\r\n\"Majesty?\"  The male anthro said.<br>\r\n<br>\r\n\"This..human insterest me.  You have been a great lover, and I sure my cousin will apprecaite you, but..I need a new project.  \"<br>\r\n<br>\r\n\"Empress, are you sure you want to new species here in the palace, the heart of our empire.\"  A female dog stated.<br>\r\n<br>\r\n\"I sure he not a spy, and what better way to explore this..human than to have him here in the most protected space in the Empire. Now, Human male you are considered to be mine, to do what I wish.  Everyone else.  Leave. I require privacy.\"<br>\r\n<br>\r\nAs you are left one with the rabbit empress, you can't help to see the ulgy glares and stares that the couriers are giving you.  Or the lust glaces of your new Mistress.</span></div></div>",
            "created":1365742800,
            "id":1570313,
            "title":"She decide to keep her to herself. "
        },
        "15433":{
            "author_id":"tharris2",
            "author_name":"dragoness seeker",
            "choices":[
                "To the bedroom, duh",
                "to the dugueon for some kinky fun. "
            ],
            "content":"<div class=\"\"><div> <span>You watch the rabbit empress get back on her throne, gesturing you to come to her.  Realizing your position, you kneed in front on your new mistress.  Please with you, the rabbit place her hand under your chin and looks into your eyes<br>\r\n<br>\r\n\"Alright, (your name)\"  The rabbit empress start.  \"Before we get to the nitty-gritty, I going to set some ground rules.\"<br>\r\n<br>\r\n\"rules?\"  You asked.  You are suddenly surprise of how loud your voice is, in the empty hall.<br>\r\n<br>\r\n\"Yes, Rules. First of all, I want you to understand that you're not a king.  Our empire has never had a emperor, or a king, and I don't entent to start now.  \"<br>\r\n<br>\r\n\"Oh\"  <br>\r\n<br>\r\nShe seat back into her seat.\"You be a consort, my escort, and of course, my own personal servant.\"<br>\r\n<br>\r\nYou began to wonder if the empress choosing you was the greatest option in the world.<br>\r\n<br>\r\n\"Well, are you going to ask what that means?\"  Valerian asked.<br>\r\n<br>\r\n\"Um, what are my duties...you Majesty?\"  you quickly say.<br>\r\n<br>\r\n\"Much like Rattus, you'll be my personal slave. You will fetch me food, drink, bathe me, and  keep me company. Any other work can be done by the other servants, but if I command you to do something, I expect to do as quickly as possible If you're a good servant, you'll receive extreme rewards. If you resist, try to rebel, try to leave,  you'll be SEVERELY punished. \"<br>\r\n<br>\r\nYou don't like the way she said SEVERELY punished.  From the way she lick her lips as she said it, it look like she would really enjoy it.<br>\r\n<br>\r\n\"Given the differences that you  are I, I guess we can skip the part of providing children and such.  Still, I choose to adopt, you will be in charge of taking care of the kids.  Naturally, I expect you to remain loyalty to me.  You will not lay, dance or even speak to another female, unless you have my permission. \"<br>\r\n<br>\r\nYou take her hand and kiss it.  \"It would be a honor to serve you, ma'am\"<br>\r\n<br>\r\nValerian jumps up and giggles \"Well, well it seem that you are getting the hang of this.\"  She take your hand and go up the stair of the palace.<br>\r\n<br>\r\n\"Since you have please me, I let you choose where to go first.\"</span></div></div>",
            "created":1396414800,
            "id":1772517,
            "title":"Stay in the throne room and set some ground rules."
        },
        "154331":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "No this is my first time. (truth)",
                "No, I had sex with a furry (lie...maybe)"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"Well,...my Empress?\"  you start.  \"I don't know...\"<br>\r\n<br>\r\nYou see the lust in the Valerian s eyes, and you see her pout.  \"Are you nervous?\" she asked.  \"It’s not everyday that a servant has a choice of where to go or what to do.\"<br>\r\n<br>\r\n\"Uh...the bedroom?\"  you asked.<br>\r\n<br>\r\nHer smile returns.  \"Good choice.\"<br>\r\n<br>\r\nGiggling, the small rabbit woman gave you hand and lead you out of the room and into the staircase of the palace.  You pass through several females, all of them looking in you in amazement.  You don't recognize any off them.  Perhaps they was not in the throne room when you arrive.  One, a big, no, large bovine-like creature block the way.  Even through she is wear some long layered robe, you can see that it not big enough to hide her figure.  She has an enormous, gravity defining chest, and very wide hips. Her horn on her head are rather small, almost invisible to the big bun  of hair she has.   However, you can tell by her posture, that she has some authority. <br>\r\n<br>\r\n\"Empress,   what is that thing, and where are you going to it?\"  She haughtily demands.<br>\r\n<br>\r\nThe Empress pull you to the side, \"Well, Hanthor, my dear stewardess,  this is a human, a male who will be with me as a consort...for the time being.\"<br>\r\n<br>\r\n\"A consort?\" the cow woman gasp. \"What about Rattus, and…this creature…Sure you can't.. I don’t…someone need to..” <br>\r\n<br>\r\nYou can heard what the rest of the cow woman says as you are dragged off .  “Don’t worry about her.”  Valerin says.  “Hanthor was my Nanny, and is currently the head of my household staff, but I will get her to understand why Rattus had to go.”<br>\r\nThe both of you are running full til now, and you are surprise of her speed.  You passed through several well armed females, what you assume to be guards, through the silence tell you make you unsure.  At some point you come across a grand door.  The guard here are the tallest yet, one a massive polar bear, another, a Grizzly.  Both are obviously female, with their large breast-shape armor.  <br>\r\n<br>\r\n“This is Needa, and Nadia.  They are the best of the Palace guards.  Valerin stated as she push open the double doors.  “They will make sure that we are not disturbed…”<br>\r\n<br>\r\nThe bedroom itself is rather massive, with all kind of fancy furniture, dressers, statues and plants. To the side you could even see a large bath.  In the middle Valerin lead you to a massive bed, it silky company is transparent and glittery with precious stones.  The rabbit woman drags, and push you onto the bed.<br>\r\n<br>\r\n“Take off your garments,”  she said lustfully.  I want to see you bare body..”<br>\r\n<br>\r\nYou take off your clothes as fast as you can, but she can see you are struggling.”<br>\r\n<br>\r\n“What wrong?”  she asked..” Have  you mated with a furry before?”<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1482814800,
            "id":2254911,
            "title":"To the bedroom, duh"
        },
        "155":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Sanja the Monkey",
                "Jasmin the Snake",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1348030800,
            "id":1431003,
            "title":"More"
        },
        "1552":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "\"My perssssonal sssservant.\"",
                "\"My husssband.\""
            ],
            "content":"<div class=\"\"><div> <span>Sitting on the throne is one of the strangest beings you've ever seen, and that's saying something considering that you just got captured by a skunk-girl. Her body has curves that would leave any porn start with a feeling of inadequacy, with breasts easily twice the size of your head, a slim, toned waist, and hips wider than your torso, with only an extremely form-fitting wine-red robe that honestly looks more like a sling bikini keeping her decent. Emerald green scales cover every inch of the woman's body, with stripes as black as obsidian going down her back. Her legs long and smooth looking, with three toes on each foot equipped with sharp curved talons, and a long, sinuous serpentine tail extends from her rear and coils around the base of her throne. Her neck is long and serpentine, ending in the head of a gigantic serpent, crowned with a cobra's hood marked with black and purple on its underside and with two piercing slit-pupiled golden eyes sizing you up like a scientist examining a very interesting specimen.<br>\r\n<br>\r\n\"What is thissss, Zubria?\" The snake-woman asks, her voice as smooth as a silken scarf.<br>\r\n\"I-I do not know, Empress Jasmin.\" The skunk-woman - apparently her name is Zubria - replies, looking down ashamedly. \"He is clearly a man, but not of any species known in our kingdom.\"<br>\r\n<br>\r\n\"U-um, I'm a human.\" You nervously speak up. \"I'm sorry for intruding upon your lands; I-I got shipwrecked off your coastline, and-ow!\"<br>\r\nZubria whaps you over the head with the butt of her spear, cutting you off. \"Insolent outsider!\" She shouts. \"You dare speak in such a way to the empress?!\"<br>\r\n<br>\r\n\"Leave him be, Zubria.\" The empress interrupts, raising a hand placatingly; with a grunt, Zubria quickly stands down. \"He is not of these landssss; it is improper to except him to know our waysssss.\"<br>\r\n<br>\r\n\"Um, th-thank you, your highness.\" You reply, kneeling down somewhat awkwardly before her, thanks to your wrists still being sore from bondage. \"I, uh, don't suppose that you have a way to help me get home?\"<br>\r\n<br>\r\nJasmin shakes her head sadly. \"I am afraid not, 'hu-man'. Many have tried to leave the land of Anthronia; all have failed.\"<br>\r\nYour shoulders slump in despair. Crap; you're stuck here. You didn't exactly <i>have</i> much of a life back home, but it was still your home and your life; a life that you're never going to see again.<br>\r\n<br>\r\n\"Do not dessspair, hu-man.\" Jasmin hisses soothingly. She uncoils herself from her throne and slithers towards you; as she draws nearer, you realize that she towers over you, your head just barely the same level as her massive tits. \"I will ensure that your sssstay here is a pleassssant one. Scribes!\" She barks to a pair of official-looking fox women wielding scrolls and quills. \"Write down the following proclamation: I, Empressss Jasmin of Anthronia, hereby place the hu-man known as...\" She looks to you expectantly.<br>\r\n\"Um, Jeremy, ma'am.\" You reply.<br>\r\n\"Known as Jeremy under my persssonal protection. He shall ssstay in the royal palace for as long as he wishessss, for he shall be....\"</span></div></div>",
            "created":1485320400,
            "id":2269089,
            "title":"Jasmin the Snake"
        },
        "1553":{
            "author_id":"2wakawakalol",
            "author_name":"1WAKAWAKALOL",
            "choices":[
                "Alexandra,the mouse ",
                "Livia, the Wolf",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>some more choses</span></div></span></div>",
            "created":1374210000,
            "id":1630658,
            "title":"More"
        },
        "15532":{
            "choices":[
                "It's a large feast, not everyone is so friendly to you though",
                "The ceremony involves you and Livia fighting each other, GULP"
            ],
            "content":"<div class=\"\"><div> <span>You gaze up and see a large anthropomorphic wolf lady, she was your typical grey wolf with grey fur covering most of her body but some white fur on her well endowed chest and belly. The wolf lady smiles at you warmly, 'Hello there strange human, do you have a name?' You give her your name and she chuckles, 'You look so frightened, you have nothing to be afraid of human, we do not wish to harm you. In fact, it's a blessing that you've come here. You see this island used to be populated by humans and anthros many centuries ago, but one day humanity broke away, claiming to be the dominant species of the planet and left to explore and dominate the rest of the world, little did we and they now, while we all lounged peacefully on this island humanity had already taken a powerful grab at most of the worlds land. So we stayed on this island but the problem was it was customary for the empress' by the way that's me' to marry a human, it was like a trust bond between humans and anthros. The well has run dry so to speak but we have found way of grabbing humans males of interest such as crashing planes in what you humans call the Bermuda triangle.' <br>\r\n<br>\r\nYou look up in shock, 'Wait so we're in'' The wolfess giggles, 'Yep, we are in the exact center of the Bermuda triangle, you've heard of Amelia Earhart right?' You nod your head, 'Of course.' The wolfess continued, 'She was a close friend of my mother. Back then only male humans could fly aircrafts, she thought it would be the perfect opportunity to grab a mate and a king to rule beside, instead she got a lifelong friend' and she crashed the plane of our last king a few weeks afterwards.' This was all amazing to you, 'Wait but how do you crash the planes?' The wolf giggled, 'Magic of course, you humans never did like using magic, always relying on technology, in a way it's a different form of magic, our magic stems a little bit closer to nature than science, facts and data, but they both comes from the same source if you think about it.' She then held out a paw for you to shake, you take her paw, 'I'm Livia by the way' and your new wife.'<br>\r\n<br>\r\nYou gasp and pull away, 'What?' Her ears flatten, 'What's wrong, you don't think I'm pretty.' You try to catch yourself, 'No it's not that at all, it's just, I mean' I just got here and' you're a wolf, I'm a human'' She puts a claw up to your lips and hushes you, 'It's ok I understand, humans tend to be a jumpy bunch and this is probably very shocking to you, but I will say this, you WILL be my mate, if you do not so choose then I will have to eat you alive, do you understand. Magic isn't easy to perform and we are not letting you leave this island to threaten our society, nor are we going to let you just live on the island as some kind of guest. You were brought here to serve a purpose and you will serve it.' <br>\r\n<br>\r\nYou quiver a bit, for the first time you are noticing the general size difference between you two, Livia being almost seven feet tall. She notices this and her stern expression softens, 'Oh I'm sorry little guy, I didn't mean to scare you, it's just we're kind of afraid of other humans finding us and I need you. I need you as my mate, it's tradition and if I don't have you, who will rule the island?' You're a bit more comforted now even though she also left the part out of you becoming wolf chow if you don't become her husband. You nod your head, 'I'd love to be your husband Livia.' The wolfess chuckles, 'That's empress Livia, but I'll let it slide King (your name).' <br>\r\n<br>\r\nYou smile, you're kind of glad that you just became king of an island of anthropomorphic animals, even though that sounds kind of freaky. You are snapped out of your thoughts at Livia grabs you and holds you in her furry arms, licking you affectionately, 'My cute little human king. We must begin the ceremony.' You ask her, 'What ceremony?' She grins, 'It's the ceremony that will make you king my dear.' How does the ceremony go?</span></div></div>",
            "created":1395205200,
            "id":1763142,
            "title":"Wolf for a Wife"
        },
        "155322":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "Plan things out with Livia first",
                "Surprise her!"
            ],
            "content":"<div class=\"\"><div> <span>\"Long story short, you and I are going to fight.\"<br>\r\n<br>\r\n\"Wait, what?!\" You exclaim. You're not exactly scrawny, but you have zero experience with combat, and Livia definitely has the advantage in terms of bulk - her curvy figure still has plenty of muscle on it, and she's over a foot taller than you are.<br>\r\n<br>\r\n\"Oh, calm down, it's not that bad!\" Livia assures you, placing a calming hand on your shoulder. \"I'll go easy on you, don't worry. It's more meant to put on a show for the people than anything else, anyway.\"<br>\r\n<br>\r\n\"Alright, I... guess that makes sense.\" You finally say. \"But what exactly do we do in this event?\"<br>\r\n<br>\r\n\"It's quite similar to wrestling, I suppose. There's no weapons involved, just the king and queen grappling slash hugging it out until one finally cries uncle.\"<br>\r\nOkay, that doesn't sound so bad - not that different from most professional wrestling, honestly.<br>\r\n\"While naked.\"<br>\r\nOh. That's.... different from what you were expecting.<br>\r\n<br>\r\n\"What's the matter?\" Livia jokes, playfully nudging you with her elbow and leaning down a bit to expose her considerable cleavage. \"Don't like the idea of wrestling me to the ground? It's not uncommon for the combatants to get... intimate with one another.\"<br>\r\n\"Well, when you put it <i>that</i> way...\" You jest, earning a giggle from your bride-to-be. \"You sure that you won't do that to me, though?\"<br>\r\n\"I shall neither confirm nor deny anything.\" The wolf empress clears her throat, getting back down to business. \"Anyways, there's two ways we could do this - it's not uncommon for the combatants to plan out their match beforehand, practice it a few times before starting, or we could just go in and make it up as we go, so to speak. I honestly don't have any particular preference. What do you want to do?\"</span></div></div>",
            "created":1483419600,
            "id":2258686,
            "title":"The ceremony involves you and Livia fighting ea..."
        },
        "1553222":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "She is superior to you. She toys with you for the crowds amusement ",
                "You actually give her a hard fight, giving you a strong start"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's just wing it. It'll be more fun if we don't know what's coming.\" You were never really that good at acting anyway, so not having to fake it will work in your favor. <br>\r\n<br>\r\n\"Very well then. Let us go to the arena, my people are waiting for us.\" She takes you by the hand and leads you deeper into the jungle. On the way there, you start to wonder. <br>\r\n<br>\r\n\"If I just arrived, how do your people already know about the fight?\" She chuckles at your question. <br>\r\n\"Simple, I told them that today was the day I took a mate from a wreck and that they should await us in the arena.\" That made sense. \"We're here.\" She says, pointing to a large coliseum like the one in Rome. She leads you through a back door guarded by 2 anthro lionesses, to a hallway intersection. She stops and turns to you. \"This is where we must part for now. You go down the left path to your dressing room, there will be attendants there if you need anything. They will tell you when it's time. I will see you soon my love.\" With that, she walks down the right path, presumably to her own room. You do as you are told and follow the left side to your room. Inside were 2 cougar girls wearing nothing more than golden bikinis. They walk towards you with sway in their hips.<br>\r\n<br>\r\n\"My my sister, looks like our queen sunk her fangs into a cute one.\" The first says with a purr in her voice. \"Indeed sister, now then mister...?\"<br>\r\n<br>\r\n\"(Your name)\".<br>\r\n<br>\r\n\"(Your name), it is our duty to help strip you and provide to any need you have until the fight starts.\" At that, she begins to pull at the belt of your pants while her sister works on your shirt. Before you could even comprehend what they were doing, they had already stripped you to as naked as the day you were born. The cougars looked at what was between your legs and began to lick their lips. \"A cute one <i>with</i> a nice package to boot? Queen Livia got quite the catch.\" You blush at the compliment. \"Is there anything else you require?\"<br>\r\n<br>\r\n\"Nah, I should be fine.\" <br>\r\n<br>\r\n\"Very well then. You should make your way to the starting door. We will inform the queen that you are ready.\" They leave the room while you walk towards what you can only assume is the right way. You see a doorway leading somewhere, looking outside you see a stadium full of anthro girls cheering, waiting for the event to start.<br>\r\n<br>\r\nLooking across the field, you see Livia walking out, just as naked as you were, her hips swaying and breasts bouncing with every step. She stops and looks to clear her throat. \"Ladies, as you are all aware, today is the day I have chosen my mate and your king. As is tradition, my new husband and I will battle before you to celebrate our newfound unity. Here he is now, your new king, (Your name).\" You tak that as your cue and walk out to the hoots and whistling of the audience. <br>\r\n<br>\r\n<br>\r\nHow does the fight play out?</span></div></div>",
            "created":1534827600,
            "id":2536478,
            "title":"Surprise her!"
        },
        "15532221":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Worship my tits",
                "Eat me out to climax"
            ],
            "content":"<div class=\"\"><div> <span>The bell rang. You tried to get an early advantage by rushing Livia. You grab her arm and try to sweep her legs to knock her down. However, you find that your efforts are in vain as not only is she still standing, she is completely unmoved from when the match started.<br>\r\n<br>\r\nNow it was her turn to attack. Removing her arm from your grip, she wraps it and it's partner around you, pinning your arms to your sides and squeezing you in a tight bear hug and forcing your face into her breasts. She then starts leaning her body forward, giving you bedroom eyes while she does so. This forces you to lean back in turn. Eventually, your legs give out from the strain and you fall on your back with her landing on top of you, the impact of which knocks the air out of your lings for a second. <br>\r\n<br>\r\nWith you now on the ground, she releases her grip on you and sits up on your chest. She wraps her legs around your head and puts you in a scissor-lock, forcing your head up against her dripping snatch. Meanwhile, the audience was loving watching their queen turn you into her punching bag slash sex toy. You look into the audience and even see some getting themselves off on this.<br>\r\n<br>\r\nLivia decides it's time to end it. She let's go of your head and repositions herself around your left arm. Uh oh. You don't know much a wrestling, but you know what's coming next. She pulls your arm straight, putting you in an armbar. The pain was immense, but judging by the loving look in her eyes you assume that she is holding back to not cause any permanent damage. Meanwhile, she pushes her padded paw in your face. The paws themselves seemed clean based on the smell and the pads were soft, but it was still humiliating to be in this position. Coupled with the pain of the armbar, you decide to tap out with your free arm.<br>\r\n<br>\r\nThe bell rings and the crowd cheers again. Livia releases your arm and begins to stand up. You start to do the same, but Livia pushes you back down and sits on your chest. All around you you hear the crowd chant. \"Submit. Submit. Submit.\"<br>\r\n<br>\r\n\"Uh Livia, what's going on here?\" You ask to end your confusion. <br>\r\n<br>\r\n\"You see, when the fight is over, the loser must commit a display of public submission to the winner. Upon completion, we will be officially mates. The act is chosen by the winner every time. For us, I choose...\"</span></div></div>",
            "created":1541109060,
            "id":2571651,
            "title":"Livia never learned not to play with her food"
        },
        "155322212":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Go back to her private chambers ",
                "Go see the masseuse "
            ],
            "content":"<div class=\"\"><div> <span>\"You're going to eat me out until I climax.\" Livia says, scooting up until your face is between her thighs. \"Ready?\" Before you can respond, she grabs the back of your head and pulls you into her crotch. <br>\r\n<br>\r\nSeeing no other option, you get to work. You start by kissing your way around her inner thighs. This makes her let out a moan of satisfaction as her legs tighten around your head. You move things along before she starts to crush your head. <br>\r\n<br>\r\nYou give her outer lips a lick all the way up, making her shudder in pleasure. You kiss and lick your way up and down her lips until you decide it's time for the big part. Taking a deep breath, you dive in and pierce her pussy with your tongue. She lets out a moan that echoes throughout the arena. You rub your tongue all around her inner walls, all the while her moaning is all you hear.<br>\r\n<br>\r\nThe crowd must be taking a liking to the show. What was previously just a handful of women masterbating turned into a lesbian orgy. The anthros in the audience were masterbating, eating each other out, 69ing, full-on lesbian sex. Perhaps as queen Livia gave off some sort of aphrodisiac pheromone when she was aroused. <br>\r\n<br>\r\nThat was a question for later. You saw your final target, her clit. You reposition yourself and begin to suckle on it like a child feeding from his mother. That did it. With one last deafening shriek, Livia came into your mouth. The crowd joined in as they were all climaxing as well.<br>\r\n<br>\r\nPanting, she got off you and pulled you to your feet. She grabbed your hand and raised it up like a champion. \"Ladies, your new king.\" With a final cheer from the crowd, Livia leads you to her dressing room.<br>\r\n<br>\r\n\"That was fun, wasn't it?\" She asks.<br>\r\n<br>\r\n\"Apart from the fact that I'm still sore from that armbar, it was a blast.\" You joke. She gives you a look of both lust and concern. <br>\r\n<br>\r\n\"Awww, did my new mate get hurt? We can always go back to my privileged chambers and I can look at it. Or, I could send you to the royal masseuse. She can<i>take care</i> of you.\"<br>\r\n<br>\r\n\"Wait, aren't I your mate now? Doesn't that mean me and my... parts are for your use only?\"<br>\r\n<br>\r\n\"Not exactly. You see, males are rare on this island. While we have mating rituals like these, they are mostly to determine priority. You can fuck my whole village until none of them can walk straight, but when I say 'Fuck me', I expect you as my mate to answer the call without hesitation.\" That all made sense you guess. \"So, who will it be?\"</span></div></div>",
            "created":1541131800,
            "id":2571764,
            "title":"Eat me out to climax"
        },
        "1553222121":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "It's time to officially consimate our marriage ",
                "*She blushes \"Could you pet me?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go back to your room. I'd rather get to know my new wife better before I let a complete stranger give me a rub down.\"<br>\r\n<br>\r\n\"Very well then my king. Follow me.\" Livia takes you by the hand and leads you out of the colosseum. She leads you through a small tribal-looking village. As you pass, the anthros around you stop what they are doing and cheer their queen and her new king. You see several of them sizing you up, licking their lips at the sight of you. It was only then that you realized that you were both still naked from the fight. You blush and try to cover yourself, making the women around you start to giggle at your modesty. \"Do not worry,\" Livia starts, \"we are a clothing optional society. You will not be judged for roaming in public nude. <i>Besides, with what you're packing,you certainly have little to be ashamed of.</i>\" She whispers in your ear.<br>\r\n<br>\r\nShe finally brings you to your destination, a massive palace on the other side of the village. The walk here was by no means uneventful. You were stared at, cat called (you hope that isn't a rasist slurr here), and one bold vixen even smacked your bare ass, and when you turn to face her, she grabbed you and pulled you into a kiss, making her friends giggle.<br>\r\n<br>\r\nShe leads you inside to a fancy-looking door. When it opens, it reveals a massive room. It looked like something out of those fictional Arabian palaces with the fancy drapes and carpet. Livia speaks up\"So now that we're here...\" </span></div></div>",
            "created":1541189700,
            "id":2572120,
            "title":"Go back to her private chambers "
        },
        "15533":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Rolijna, the lioness",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices?</span></div></span></div>",
            "created":1390366800,
            "id":1731454,
            "title":"More"
        },
        "155331":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall make him my mate.\"",
                "\"He will be my personal guard.\""
            ],
            "content":"<div class=\"\"><div> <span>You saw an anthro lioness sitting on the throne.  She had tan fur and the best body of any female you'd ever seen.  She was wearing a dark brown robe and a golden tiara.  She was about an inch taller than you were.  She rose from the throne and approached you.  You tensed, wondering what she would do.  The lioness began to look over you.  \"Who are you?\" she asked.  \"M....m...Michael.\" you stuttered nervously.  \"How did you come upon this island?\" she asked.  You explained how you'd washed up on shore, unsure of what she would do when you are finished.  \"Let me fill you in on where you are.\" the lioness said \"You are on the island of Furonica.  I am their ruler, Rolijna.  We have been living on this island for many years, hidden from your kind.  I intend to keep it that way.  I'm afraid you must remain on the island.\".<br>\r\n<br>\r\n\"What!?\" you exclaimed, but Rolijna ignored you.  She then turned to the fox and skunk that brought you here.  \"What shall we do with him, your highness?\" the skunk asked.  Rolijna thought for several minutes.  Then she said, </span></div></div>",
            "created":1395896400,
            "id":1768629,
            "title":"Rolijna, the lioness"
        },
        "1553311":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The palace hot spring"
            ],
            "content":"<div class=\"\"><div> <span>Rolijna smiled as she caressed your shoulder.  \"I feel a sudden attraction to this male.\" she said as she pulled you into a tight hug \"I've decided to make him my mate.\".  You were surprised at this. \"I promise you will be well respected, human.\" she said.  You started to feel better, knowing you'd be cared for.  \"Maybe, living here won't be so bad after all.\" you thought to yourself.  \"Come, my love.\" Rolijna said, pulling you out of the throne room.  You followed her through a maze of hallways.  You wondered where she was taking you.  Several minutes later, she brought you to, <br>\r\n<br>\r\n</span></div></div>",
            "created":1395896400,
            "id":1768632,
            "title":"\"I shall make him my mate.\""
        },
        "155332":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Sinjota, the kangaroo",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1390366800,
            "id":1731494,
            "title":"Readers Choice"
        },
        "1553321":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall keep him as my guest.\"",
                "\"He will be my mate.\""
            ],
            "content":"<div class=\"\"><div> <span>You looked up to see a female kangaroo sitting on the throne.  She had dark brown fur on most of her body, an light brown fur on her chest.  She had the greatest body you'd seen on any girl.  She was wearing a bright pink robe laced with white, and a golden tiara sat atop her head, her ears sticking out of the top.  Dark brow hair went from her head, down to her shoulders.  <br>\r\n<br>\r\nYou watched as she rose from the throne and approached you.  You tensed slightly, not knowing what she would do.  She bent down as she looked over you thoughtfully.  \"I see this is a human male.\" the kangaroo said \"Interesting.\".  \"With all due respect.\" you said, stuttering slightly \"Would you mind telling me where I am?\".  The kangaroo smiled and chuckled slightly.  \"I suppose an explanation is overdue.\" she said.  \"You are on the island of Furtonia.  I am Sinjota, the emperess of the island.\".  \"OK.\" you said, surprised.  \"I understand you must be confused right now, but things will be fine.\" Sinjota said.  She then turned to the skunk that brought you here.  \"What should we do with him, your highness.\" she said.  You tensed, wondering what Sinjotas answer would be.  </span></div></div>",
            "created":1395378000,
            "id":1764445,
            "title":"Sinjota, the kangaroo"
        },
        "15533211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her sleeping quarters",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>\"I propose that he shall stay as my personal guest.\" Sinjota said after several minutes.   You looked at her in surprise.  \"What exactly do you mean, your highness?\" you asked.  \"I mean you'll be living here in the palace with me.\" Sinjota answered with a smile \"And don't worry, I'll make sure you're treated well while you're here.\".  You smiled, feeling relieved that you would be taken care of while you were on this island.  \"Come with me, dear.\" Sinjota said as she lifted you to her feat.  She then led you out of the throne room and through several hallways until she brought you to, </span></div></div>",
            "created":1409806800,
            "id":1852368,
            "title":"\"I shall keep him as my guest.\""
        },
        "155332111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private hot tub",
                "The palace garden"
            ],
            "content":"<div class=\"\"><div> <span>Sinjota brought you to a pair of double doors.  The female kangaroo pushed them open to reveal a fairly large room with a very large bed and several other furniture items.  You assumed this was Sinjota's bedroom.  \"This is our private chambers\" Sinjota said.  She looked at you and frowned, seeing that you were still in your wet clothes, and that you were starting to feel chilly.  <br>\r\n<br>\r\n\"We'd better get you out of these old garments and into something better.\" Sinjota said as she helped strip you of your clothes.  She then went to her dresser and pulled out what looked like a large purple bathrobe.  She slipped it over your shoulders and smiled.  \"This should fit you nicely\" she said with a grin.  You smiled, knowing that the female kangaroo would take care of you.  Sinjota then led you out of the bedroom.  \"Come dear.\" she said, tugging on your arm \" There's still more of the palace to see.\".  Sinjota then led you through a series of hallways until you eventually reached,</span></div></div>",
            "created":1438232400,
            "id":2014410,
            "title":"Her sleeping quarters"
        },
        "1553321111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Chocolate ",
                "Whipped Cream"
            ],
            "content":"<div class=\"\"><div> <span>Sinjota eventually led you to a large room.  You walked in to find there was a tub in the center of the room that was the size of a small pond.  \"I was considering taking a nice soak in my hot tub, and I was hoping you'd join me.\" The female kangaroo said.  You nodded, feeling somewhatt exhausted from the days events.  Sinjota stripped herself of her gown while you slipped out of your robe.  Sinjota then walked to a small lever and pulled on it.  Minutes later, the tub was starting to fill.  However, it wasn't being filled with water.  Instead it was being filled with,</span></div></div>",
            "created":1438232400,
            "id":2014413,
            "title":"Her private hot tub"
        },
        "15533212":{
            "choices":[
                "The town square",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>The large Kangaroo women smiles down at you, “I like him, I think I will keep him as a mate, we haven’t had a male in this kingdom for years anyway.” The large kangaroo leans over and grabs you, pulling you up onto her furry lap. She starts rubbing her paw across your head, petting you. You just laid back against the large wall of fur and flesh behind you and relax, after all of the insanity that has gone on in the last few hours you need it. Sinjota giggles and turns to her skunk guard, “Isn’t he so cute, I think he likes me too.” The skunk girl grins, “Um-it would appear so my mistress, do you need anything else?”<br>\r\n<br>\r\nSinjota looks down at you, “Hmm, he does seem a bit pale, even for a human, go fetch me some fresh water and some food for me and my mate.” The skunk bows to her, “Yes my ruler.” She quickly runs off to get the items her mistress demanded. Sinjota then brings her gaze down to you, you look back up at her, hoping being her mate means no harm will be dealt to you. You just can’t be too sure considering you’re dealing with a twenty foot tall female anthro. An anthro with considerably sharp claws that could cut you in two and feet large enough to crush every bone in your clearly weaker body.<br>\r\n<br>\r\nSinjota then picks you up and starts to bring you somewhere, “Where are we going,” you ask? Sinjota giggles, “We’re going to…”<br>\r\n</span></div></div>",
            "created":1395810000,
            "id":1768043,
            "title":"\"He will be my mate.\""
        },
        "1553322":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Pirene, a bear",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this what you want?</span></div></span></div>",
            "created":1390366800,
            "id":1731656,
            "title":"Readers Choice"
        },
        "15533221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall keep him as my guest.\"",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You saw a large brown bear sitting atop the throne.  She had the best body of any female you'd ever seen.  She was wearing a large purple robe that went down to her ankles and a golden tiara that was decorated with dozens of large crystals.<br>\r\n<br>\r\n\"Come closer.\" the bear said.  You walked a few steps toward her.  \"Who are you?\" the bear asked.  \"M....m......Michael.\" you said, stuttering nervously.  The bear seemed to ignore your nervousness as she rose from her throne and examined you.  \"How did you get here?\" the bear asked.  You explained your story to her, wondering what would happened when you were finished.  \"Let me fill you in.\" the bear said \"You are on the island of Furonia.  I am their ruler, Pirene.  We have been living here for many years, hidden from your kind.  We intend to keep it that way, so I'm afraid you won't be leaving.\".<br>\r\n<br>\r\n\"What!?\" you exclaimed, but Pirene ignore you.  She then turned to the fox and the skunk.  \"What do you intend to do with him, your highness?\" the fox asked.  Pirene thought for several minutes.  Then she said, </span></div></div>",
            "created":1395205200,
            "id":1763125,
            "title":"Pirene, a bear"
        },
        "155332212":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall make him my mate.\"",
                "\"He will be my slave.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Pirene do with you?</span></div></span></div>",
            "created":1395896400,
            "id":1768636,
            "title":"Readers Choice"
        },
        "1553322121":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>\"I've decided to make you my mate and prince of the island.\" Pirene said, taking your hand.  \"I assure you, you will be treated like royalty while you are here.\" she added, caressing your shoulder.  You started to relax, knowing you would be taken care of while on the island.  \"Come with me, my prince.\" Pirene said, as she led you out of the throne room.  She led you though a maze of hallways until she brought you to, </span></div></div>",
            "created":1397883600,
            "id":1782580,
            "title":"\"I shall make him my mate.\""
        },
        "15533222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Shamali, the elephant ",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this one?</span></div></span></div>",
            "created":1391922000,
            "id":1742551,
            "title":"Keep going"
        },
        "155332221":{
            "choices":[
                "You're Her Slave",
                "You're Her Consort"
            ],
            "content":"<div class=\"\"><div> <span>You look up as the fox and skunk holding onto you bow. Staring down was an anthro that was taller than they were, at least seven feet tall. The anthro was a large elephant woman with darkish brown skin and long black hair. Judging by her tusks, she was obviously an African elephant as a female Asian elephant wouldn't have tusks. She was wearing a black metal bra over a pair of F cup breasts that rested on top of a stomach that had to reach at least five feet out and a rear that took up two thrones covered in a blue metal thong.<br>\r\n<br>\r\nThe elephant woman raises her trunk and trumpets slightly as you look in awe and surprise. Then the empress looks down and stares at you. \"What form of creature is that?\" she asks. \"We have no idea Empress Shamali,\" says the fox woman. \"But we do know that this is a man.\" Shamali looks down at you and gets up. You step back but Shamali picks you up with her trunk and lifts you in the air screaming before she starts to inspect you. \"Interesting,\" the elephant empress says. \"This is obviously a male but unlike any I've seen before. There hasn't been a man on this island for some time. The only males we have here are still children. Perhaps this... whatever he is... has his uses.\"<br>\r\n<br>\r\nYou gulp as you look up in Shamali's amber eyes and the large ruby embedded in her forehead. What use does the empress have for you?</span></div></div>",
            "created":1394773200,
            "id":1760471,
            "title":"Shamali, the elephant "
        },
        "155332222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Rimaljo, the rhino",
                "Keep going."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this one?</span></div></span></div>",
            "created":1391922000,
            "id":1742578,
            "title":"Readers Choice"
        },
        "1553322222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Acorna, the squirrel",
                "Keep Going."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this one?</span></div></span></div>",
            "created":1392440400,
            "id":1746125,
            "title":"Keep going."
        },
        "15533222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Sasha, the dog.",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1392786000,
            "id":1748444,
            "title":"Canine Ruler"
        },
        "155332222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Brindota, the beaver",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1392958800,
            "id":1749326,
            "title":"Readers Choice"
        },
        "1553322222222":{
            "choices":[
                "Sahara the Hippopotamus",
                "Next Option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this option?</span></div></span></div>",
            "created":1394773200,
            "id":1760477,
            "title":"Maybe a Massive Mistress"
        },
        "15533222222221":{
            "choices":[
                "You're A Guest on the Island",
                "You Become Her Slave"
            ],
            "content":"<div class=\"\"><div> <span>You look up and see that the empress of the anthros is exactly ten feet tall. She is a huge hippopotamus who had to weight at least four tons judging by her body shape. The empress had bright green skin and bluish black hair with a pierced lip and ears. She had black symbol tattoos and her lips and nails were painted black. The empress had what looked like a pair of E cup breasts resting on an 8-foot wide stomach and appeared to be sitting atop two thrones.<br>\r\n<br>\r\nShe was wearing what looked like a black pearl necklace and a chain mail bikini that looked tight on her obese body. The fox and skunk bow down as the empress looks down at you and opens her mouth to speak, revealing her terrifyingly large teeth in the process. \"So this is the man you caught in the jungle.\" She says in a young woman's voice. \"Yes Empress Sahara,\" says the fox guard. \"We have no idea where he came from, not what species he is.\"<br>\r\n<br>\r\nSahara brings her massive hulk up from both of her thrones and the amazon hippopotamus walks down and you see just how small you are compared to her. She then lowers her huge snout to inspect you as you're shaking with fear. What does the hippo empress decide to do with you?</span></div></div>",
            "created":1398488400,
            "id":1787450,
            "title":"Sahara the Hippopotamus"
        },
        "155332222222212":{
            "author_id":"sky-dragon",
            "author_name":"Soulslayer",
            "choices":[
                "Get bathed",
                "sit beside your mistress"
            ],
            "content":"<div class=\"\"><div> <span>The empress stares at you from head to two, thinking of what to do with you. Then came to a decision with a look that made you more nervous. \"I find this creature very interesting and cute, I shall keep him as my personal slave, or pet as either is no different.\" Smiles at you.<br>\r\n<br>\r\nYour eyes open wide as plates and attempted to make a run for it but she grabbed you by the arms and pulled towards her. Lifted you in her strong hands up to her enormous bosom. \"Listen well creature, for the rest of your days you serve me and obey my every command as your empress and owner. Do well to please me and you will be rewarded, but disobey and there will be punishment. Understand boy?\" Staring directly at you if you understood.<br>\r\n<br>\r\nYou nodded eagerly in response and earned a smile form the hippo. \"Good boy, now to make sure you would not dare to wonder off.\" She puts you back down as a guard brought her a collar and chain leash and put it on around your neck and the chain in her other hand while holding you. You feel like some sort of pet to the Emperess with this collar on and unable to take it off.<br>\r\n<br>\r\nSahara smiles at her newest slave and holds firmly to his leash and ponders what to do with him on his first duties for her. \"Now then, what shall I do for you for your first duties to your empress?\"</span></div></div>",
            "created":1442034000,
            "id":2033571,
            "title":"You Become Her Slave"
        },
        "1553322222222121":{
            "author_id":"sky-dragon",
            "author_name":"Soulslayer",
            "choices":[
                "Wash the Empress",
                "Pleasure your mistress"
            ],
            "content":"<div class=\"\"><div> <span>Sahara took thought of what to do with you as her new slave, fearing what she had in mind and unable to go anywhere with the collar around your neck. Watching the empress walk about, you could not help but stare at her huge cleavage and belly jiggle and sway by her movement. Taken by surprise by her voice when she had thought of something. \"I know, I shall take a bath and you will join me in the bath chambers.\" Not much of a choice as she pulled you by the leash. Almost chocked on the firm grasp of the collar against your neck and followed the massive anthro-hippo until they reached a large bath chambers filled with some steam in the room and huge tub that could be for the empress. <br>\r\n<br>\r\nThe empress begun to strip the scantily clothes and gave them to the servants who were making sure the bath was perfect. You stood there seeing her all naked and see those large nipples, making you blush as how huge she was. Watching the flesh jiggle with the way she walks and enters the tub, now waiting for you to join her. You did not know it was warm in the chambers with all the steam, nor did you take notice the servant girls came up to you and took hold of your arms. Trying to struggle and break free but they easily took your clothes until you were naked, only to have the collar on. You tried your best to hide the fully erect cock with your hands but you felt Sahara pull your leash again.<br>\r\n<br>\r\nStaggered a bit until you reluctantly gave in to join her, not wanting to make her angry. Climbing in the tub and was immediately pulled to her by the large arm. Pressed against her huge girth and your head by the massive breast. \"Isn't this nice, much better without those rags.\" You can feel the hippo looking down at you and stroking her stubby fingers softly on your naked body. \"Even your little friend seems very excited.\" Hearing the tone of her voice, you believe she would want you to..</span></div></div>",
            "created":1449723600,
            "id":2072689,
            "title":"Get bathed"
        },
        "15533222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Kolina, the cheetah",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1394773200,
            "id":1760480,
            "title":"Next Option"
        },
        "155332222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I will make him my mate.\"",
                "\""
            ],
            "content":"<div class=\"\"><div> <span>Sitting atop the throne was a cheetah.  She hat tan fur with black spots all over her shapely figure.  She also had black stripes around her eyes, and face.  She was wearing a bright green dress and a golden tiara.  She rose from the throne and approached you.  You started to become nervous, not knowing what she would do.  She walked around you, examining your body.  \"Interesting.\" she said, before turning to the skunk \"How did you manage to capture this male?\" she asked.  \"We found him in one of the pit traps.\" the skunk replied.  \"So you aren't from around here, are you?\" the cheetah said, turning back to you.  \"How did you happen to come upon this island?\" the cheetah asked.  \"I'm sorry.\" you said, stuttering slightly \"I was washed ashore after my boat crashed in a severe storm out at sea.\".  The cheetahs expression softens at your words.  \"Could you tell me where I am?\" you asked.  The cheetah chuckled slightly.  \"You are on the island of Anthronia, and I am Kolina, the ruler of the island.\" .  <br>\r\n<br>\r\nKolina smiled as she looked at you.  \"For someone as unique as yourself, I feel it wouldn't be proper not to welcome you warmly to our island.\" Kolina said  \"We shall take you in as part of the anthro life that inhabits this island.\".  You were surprised at these words.  \"While I am grateful, I would much rather return home.\" you said.  Kolina frowned slightly.  \"I'm afraid we cannot allow that.\" Kolina said \"You see, our island has been secluded from your own kind.  We cannot risk you leaving and exposing us.\".  You gaped in shock and looked down.  Kolina then gently lifted your chin up to her face.  \"I assure you that you will be perfectly fine here.\" she said.  You smiled, understanding that you'd be taken care of.  \"What shall you do with him?\" the skunk asked.  Kolina stood an thought for several minutes.  Then she said, </span></div></div>",
            "created":1406869200,
            "id":1836119,
            "title":"Kolina, the cheetah"
        },
        "1553322222222211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her personal bedroom",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>\"I propose that he shall be my mate.\" Kolina said after several minutes.  You looked at her, surprised.  \"What do you mean by that, your highness?\" you asked, confused.  Kolina chucked and said \"Your basically being made the new king of the island.\".  You stared at her.  \"I assure you, you'll be treated like royalty.\" Kolina added as she pulled you up to your feet.  She then led you out of the throne room and into a series of hallways.  After several minutes, she led you to,  </span></div></div>",
            "created":1409806800,
            "id":1852371,
            "title":"\"I will make him my mate.\""
        },
        "15533222222222111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"We'd better get you cleaned up.\"",
                "\"We'd better find you some new clothes.\""
            ],
            "content":"<div class=\"\"><div> <span>Kolina led you to a pair of large oak doors.  She pushed them open to reveal a fairly large room.  There was a large four poster bed with deep purple hangings, a mirror hanging off of one of the walls, and several pieces of furniture that were made of oak wood.  You assumed this Kolina's bedroom.  She waked over the edge of the bed and sat down and beckoned you over to her.  You sat down next to her.  You sighed deeply.  \"Is something wrong, my dear?\" Kolina asked.  \"I'm just a little overwhelmed.\" you replied \"I suddenly go from washing up on an unknown island, to becoming the ruler of it's inhabitants.\".  Kolina chucked and caressed your shoulder gently \"It's OK.\" she said \"You'll get used to things around here quite quickly.\".  You smiled, knowing Kolina would help you adjust to life on this island.  Then Kolina stood up and said \"Now before we announce you as the new ruler,\"</span></div></div>",
            "created":1409806800,
            "id":1852375,
            "title":"Her personal bedroom"
        },
        "1553322222222212":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She makes you one of the palace guards",
                "She aranges you to live with another anthro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Kolina plan to do with you.  </span></div></span></div>",
            "created":1406869200,
            "id":1836124,
            "title":"Readers Choice"
        },
        "155332222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Onkolia, the oscelot",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1395810000,
            "id":1768326,
            "title":"Keep going"
        },
        "1553322222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Tingerta, the tiger",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this option?</span></div></span></div>",
            "created":1396587600,
            "id":1773520,
            "title":"Keep going"
        },
        "15533222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Conjota, the cougar",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1396587600,
            "id":1773521,
            "title":"Keep going"
        },
        "155332222222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall make him my mate.\"",
                "\"I shall make him one of the palace guards.\""
            ],
            "content":"<div class=\"\"><div> <span>You looked up to see a female cougar sitting on a large marble throne.  Most of her body was covered in tan fur, except for her chest fur, which was white.  She had the best body of any female you'd ever seen.  She was wearing a bright pink cloak laced with gold, and a golden tiara.  She rose from the throne and approached you.  As she came closer, you could see she was a foot taller than you were, bringing your head up to her chest.<br>\r\n<br>\r\nShe leaned in toward you, examining you.  \"Excuse me, maam.\" you said nervously \"But would you mind telling me where I am?\".  The cougar simply chuckled and said \"You are on the island of Anthromia.  I am the ruler Conjota.\".  \"It's nice to meet you.\" you replied.  \"How exactly did you come upon my island?\" Conjota asked.  \"I was accidently swept onto the shore during a storm.\" you said.  \"So your not from here.\" Conjota said \"Then it wouldn't be fitting to take you in as part of the anthro life that inhabits this island.\".  You were surprised to hear this.  \"I am thankful, but I'd much rather leave the island and go back home.\".  Conjota's eyes softened as she gave a sad smile.  \"I'm afraid that won't be possible.\" she said gently \"It would be extremely difficult to find your way back.\".  Your face fell at this, but Conjota caressed your chin and smiled.  \"Trust me, I'm sure you'll enjoy life her much more than before.\". she said.  You smiled, knowing you would be given a home.  Conjota then walked up to the skunk and fox that had brought you here.  \"So what do you plan to do with him, your highness.\" the skunk asked, looking at you suspiciously.  Conjota looked at you for several minutes, before she said, </span></div></div>",
            "created":1398661200,
            "id":1788185,
            "title":"Conjota, the cougar"
        },
        "1553322222222222211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The dinning hall"
            ],
            "content":"<div class=\"\"><div> <span>\"He will be my mate.\" Conjota said.  You stared at her at these words.  \"What does that mean?\" you asked, nervously.  \"I mean that you will rule Anthromia alongside me.\" Conjota said with a smile.  Your eyes widened in surprise.  Conjota took your hand and led you out of the throne room and through a series of grand hallways.  Eventually, she led you to, </span></div></div>",
            "created":1405400400,
            "id":1828230,
            "title":"\"I shall make him my mate.\""
        },
        "15533222222222222111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "The dining hall",
                "The palace wardrobe"
            ],
            "content":"<div class=\"\"><div> <span>Conjota led you to a pair of large oak doors.  They swung open to a large beautiful room.  Judging by the well crafted furniture, you assumed it must be Conjotas bedroom.  There was a large four poster bed with velvet hangings.  A large chandelier hung from the ceiling.  Several other furniture items that were in the room appeared to be made out of oak.<br>\r\n<br>\r\nConjota led you over to the bed and gestured for you to sit.  You sat down on the bed, which was unbelievably comfortable.  You'd never felt something so soft.  You smiled as you looked around the room.  You then looked down at the floor, starting to feel slightly nervous.  \"Is something wrong, my king?\" Conjota asked.  You looked at Conjota and shrugged.  \"I'm just trying to get myself used to the fact that I'll be living here the rest of my life.\" you said.  Conjota smiled and caressed your shoulders gently.  \"There's no need for you to worry.\" she said \"As you are the new king, you will be treated like royalty.\".  You smiled, knowing you'd be taken care of.  Conjota then stood you up and led you out of the bedroom.  Several minutes later, she brought you to,   </span></div></div>",
            "created":1406091600,
            "id":1832726,
            "title":"Her private bedroom"
        },
        "15533222222222222112":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "Her private hot tub",
                "The palace gardens"
            ],
            "content":"<div class=\"\"><div> <span>The female cougar eventually led you to a pair of large doors.  She opened them to reveal a massive dining hall.   A long golden table stood in the middle of the room.  Numerous anthros were seated all along the table.  The table was piled with every kind of food you could imagine.  Conjota led you to a pair of golden chairs at the far end of the table.  Conjota sat in one while you sat in the second one.  <br>\r\n<br>\r\nConjota then stood up and cleared her throat, gaining everyone's attention.  \"I have an announcement that I need to make.\" she said \"You're probably questioning what this human has been doing with me.  I'm hereby announcing that he will be my mate and the new king of Anthromia.\".  <br>\r\n<br>\r\nMuch to your surprise, everyone stood up and applauded.  You noticed quite a few of the females were looking at you with a dreamy look in their eyes.  \"Now let us feast in celebration.\" Conjota said as she sat down.  Everyone then dug into the food.  You joined in.  Most of it was fruits and vegetables that had been grown on the island.  Everything was delicious.  <br>\r\n<br>\r\nSeveral minutes later, you were so full to bursting.  \"You must've enjoyed that.\" Conjota said, smiling, as she helped you to your feet  \"Why don't I show you around the palace.\".  You nodded and followed the female cougar out of the dining hall and into the palace halls.  After several minutes, she led you to, </span></div></div>",
            "created":1446267600,
            "id":2055183,
            "title":"A Welcoming Meal"
        },
        "155332222222222221121":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "You agree",
                "You decline for the moment"
            ],
            "content":"<div class=\"\"><div> <span>Conjota led you to a pair of large oak doors.  She opened them to reveal a magnificent bedroom.  There was a large four poster bed, and some exquisite hand carved furniture.  \"This is our bedroom.\" Conjota said as she led you over to the bed.  \"You know, you had a pretty big meal.\" Conjota said, smiling \"Any chance I could offer you some desert.\".  You watched as her eyelashes fluttered, flirtingly.  You knew very well where she was going with this.  How do you react?</span></div></div>",
            "created":1446267600,
            "id":2055184,
            "title":"Her private bedroom"
        },
        "155332222222222221122":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"Where are we going now?\" You asked as you walked alongside her.<br>\r\n<br>\r\n\"The royal family's private hot tub.\" She replied. \"Only those that are of royalty or our personal guard are allowed to bathe in its warm water.\"<br>\r\n<br>\r\nShe opens the door to the tub.<br>\r\n<br>\r\nIs there anyone else already in there?</span></div></div>",
            "created":1507870800,
            "id":2400710,
            "title":"Her private hot tub"
        },
        "1553322222222222211221":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Royal Guard",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you stepped into the room, you see it's already occupied by another.<br>\r\n<br>\r\nWho was it?</span></div></span></div>",
            "created":1507870800,
            "id":2400711,
            "title":"Yes"
        },
        "15533222222222222112212":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her daughter?</span></div></span></div>",
            "created":1507870800,
            "id":2400712,
            "title":"Someone else"
        },
        "155332222222222221122121":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Reserved",
                "Open"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(Leaving a choice incase someone else wants to do something different)</span></div></span></div>",
            "created":1507870800,
            "id":2400713,
            "title":"Yes"
        },
        "1553322222222222211221211":{
            "author_id":"kerion27",
            "author_name":"Kerion",
            "choices":[
                "Joy",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The figure you made out was that of a female, a cougar just like Conjota, except her tan fur looked abit darker, a dress the color of lime-green and laced with gold was pooled at her feet. Apparently you and Conjota interrupted her in the middle of undressing.<br>\r\n<br>\r\n\"Ah, what perfect timing.\" Conjota said. \"My love, this is my daughter, Ariea. Ariea, this my new mate.\"<br>\r\n<br>\r\nHow does Ariea react?</span></div></div>",
            "created":1507870800,
            "id":2400715,
            "title":"Reserved"
        },
        "15533222222222222112212112":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Angry",
                "Confused",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Ariea react?</span></div></span></div>",
            "created":1557248760,
            "id":2656598,
            "title":"Something else"
        },
        "155332222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Dinjolia, the deer",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1396587600,
            "id":1773523,
            "title":"Keep going"
        },
        "1553322222222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I will make him my mate.\"",
                "\"He will be my slave.\""
            ],
            "content":"<div class=\"\"><div> <span>You looked at the throne to see a large female deer sitting on it.  She had light brown fur covering her head, but the rest of her shapely body was covered in a thick layer of green moss.  Two small antlers poked out of her head, both hidden behind a golden tiara.  The deer rose from her throne and walked toward you.  You tensed, unsure of what she would do.  You watched as she looked you over.  She then turned to the skunk.  \"Where did you find this man?\" the deer asked.  \"He was caught in one of the pit traps.\" the skunk replied.  \"Interesting.\" the deer said as she looked at you.  \"Young man, how did you managed to reach this island?\".  \"I was washed ashore during a storm after I was thrown overboard.\" you said, your voice shaking.  \"So your an outsider.\" the deer said.  You nodded.  \"Would you mind telling me where I am?\" you asked.  <br>\r\n<br>\r\n\"This is the ancient island of Anthronia.  I am the ruler, Dinjolia.\" the deer said.  You let the information sink in.  \"Is there any way that you could help me get back home?\" you asked.  Dinjolia frowned slightly.  \"I'm afraid that is impossible.\" she said sadly.  \"But why?!\" you asked, surprised.  \"This island has been hidden from your kind for centuries.  We can't risk letting you go and revealing our island.\" Dinjolia said \"Plus, even if we did let you leave, it would be extremely difficult to find your way back.\".  You lowered your head, realizing you were stranded on this island.  You watched as Dinjolia walked up to the skunk.  \"What will you do with him, my empress?\" the skunk asked.  Dinjolia thought for several minutes, then said, </span></div></div>",
            "created":1407387600,
            "id":1838824,
            "title":"Dinjolia, the deer"
        },
        "1553322222222222222":{
            "choices":[
                "Daria the dragoness",
                "More empress"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1396674000,
            "id":1773682,
            "title":"Dragoness empress?"
        },
        "15533222222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Jangolia, the jaguar",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1397451600,
            "id":1778985,
            "title":"More empress"
        },
        "155332222222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Frizola, the polar bear",
                "Keep going"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1397451600,
            "id":1778988,
            "title":"Readers Choice"
        },
        "1553322222222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Rishina, the raccoon",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1403758800,
            "id":1817989,
            "title":"Keep going"
        },
        "15533222222222222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I will make him my mate.\"",
                "\"He will be one of the palace guards.\""
            ],
            "content":"<div class=\"\"><div> <span>You looked up to see a raccoon sitting upon the throne.  She had an extremely curvaceous figure.  Her body was mostly covered in black and grey striped fur, with black fur covering most of her face, and a long black and grey striped tail.  She was wearing a pink silk dress that covered most of her body, and a golden tiara sat on top of her head.  The raccoon rises from the throne and approaches you.  You start shaking, not knowing what she would do to you.  The raccoon walked around you, examining you.  \"Interesting.\" she said to herself, looking thoughtful.  \"Who are you and where do you come from?\" the raccoon asked, leaning down to look at you.  You explain to her how you had washed ashore and how you'd been captured by her guards.  The raccoons expression softens when your done.  \"Can you please tell me where I am?\" you asked, your voice shaking.  <br>\r\n<br>\r\nThe raccoon smiled and replied \"You are on the island of Anthronia, and I am the ruler, Rishina.\".  \"It's a pleasure to make your acquaintance, but is there any way you could help me get home.\".  Rishina frowned slightly and said \"I'm afraid that we cannot allow you to leave.\".  \"What!?\" you almost shouted.  \"We have been hidden from your kind for centuries, and we do not want to risk you exposing us to your kind.  Plus, even if we did let you leave, it would be extremely difficult for you to find your way back.\".  You lowered your head, realizing you were most likely stranded here.  Rishina caressed your chin and raised your head so your eyes met with hers.  \"There's no need to be upset.\" she said, smiling \"Just because your here, doesn't mean you'll be taken care of.\".  \"What do you mean?\" you asked, slightly puzzled.  \"You will taken in as part of the anthro life that inhabits this island.\" Rishina said.  You started to feel better, realizing you'd be given a home.  Rishina then turned to the guards that had brought you here.  \"What do you plan to do with him, your highness?\" the skunk asked.  Rishina thought for a while, while you watched her.  Several minutes later, she said, </span></div></div>",
            "created":1411621200,
            "id":1861907,
            "title":"Rishina, the raccoon"
        },
        "155332222222222222222211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The feasting hall"
            ],
            "content":"<div class=\"\"><div> <span>\"I've decided to make him my mate.\" Rishina said, smiling.  You looked at her, confused.  \"What do you mean by that?\".  Rishina chuckled and said \"You will rule Anthronia along side me.\".  Your jaw dropped at these words.  \"You're making me your king, are you sure about this?\" you asked.  \"Don't worry about a thing.\" Rishina said as she walked up to you \"I'm certain that you'll do fine.\".  She then caressed your shoulders, making you blush slightly.  \"Come with me.\" Rishina said as she led you out of the throne room \"I must show you around the palace.\".  Rishina then led you through a series of grand hallways.  Several minutes later, she brought you to, </span></div></div>",
            "created":1411621200,
            "id":1861914,
            "title":"\"I will make him my mate.\""
        },
        "1553322222222222222222111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private hot tub",
                "A secret room beneath the palace"
            ],
            "content":"<div class=\"\"><div> <span>Rishina eventually led you to a large pair of oak doors.  They opened to reveal a grand bedroom that you assumed was Rishina's private bedroom.  All the furniture was made out of oak wood, and a grand chandelier hung from the ceiling.  The bed was covered in dark purple sheets.  Rishina walked up to the edge of the bed and gestured for you to sit down.  You sat down, surprised at how soft the bed was.  You looked at Rishina, who was smiling at you.  You smiled slightly before you looked down and sighed deeply.  \"Is something wrong, my dear?\" Rishina asked.  You sighed a second time and looked at the female raccoon.  \"I guess I'm just a little overwhelmed by everything that's happened so far.\" you replied \"One minute, I'm thrown into the sea.  Next thing I know, I'm taken in by a group of animal women living on an unknown island and they make me their leader.\".  Rishina giggled and replied \"You have no need to worry, my love.  I assure you you'll do just fine.\".  You smiled and looked into her bright green eyes.  Rishina then rose from the bed and pulled you toward her.  \"Come, my dear.\" she said, smiling \"There's something I'd like to show you.\".  She then led you out of the bedroom and into the halls of the palace.  Several minutes later, she led you to, </span></div></div>",
            "created":1417842000,
            "id":1898709,
            "title":"Her private bedroom"
        },
        "15533222222222222222221111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Rishina pulls something out of the nearby cabinets",
                "A palace guard comes to the door"
            ],
            "content":"<div class=\"\"><div> <span>Rishina led you to a pair of double doors, which she pushed open to reveal a large room.  There was a pool in the center of the floor that was large enough to fit 11 people.  The pool was completely filled with water and was apparently heated, judging by the steam rising off of the waters surface, creating a thick mist that filled the room.  There were also several small cabinets next to the tub.  \"This is my private hot tub.\" the female raccoon said \"Would you care to join me?\".  You shrugged, blushing slightly.  \"There's no need for you to worry.\" Rishina said, smiling and caressing your chin \"I assure you it'll be very relaxing.\".  You nodded in agreement.  You could use some time to relax after everything you'd been through so far.  You watched as Rishina slipped out of her pink silk dress, revealing more of her shapely figure.  You watched as she stepped into the tub.  She then gestured for you to come in as well.  You slowly stepped into the tub, the water coming just up to your waist.  To your surprise, the water was at just the right temperature for you.  You waded over to Rishina and sat down next to her.  You sat with her for several minutes, as the warm water helped you relax.  Then, </span></div></div>",
            "created":1420088400,
            "id":1910562,
            "title":"Her private hot tub"
        },
        "15533222222222222222221112":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"Some friends of mine live here and I'd like you to meet them.\"",
                "\"This is where I come when I need some privacy.\""
            ],
            "content":"<div class=\"\"><div> <span>Rishina eventually led you to a section of the palace that was empty.  \"Where are you taking me?\" you asked.  The female raccoon smiled and put a finger to her lips, signaling for you to be quiet.  You complied and covered your mouth.  Rishina then bent down and grabbed a hold of a loose tile on the floor.  She lifted it up, revealing a hole just big enough for you to slip through.  \"You go first.\" Rishina whispered.  You nodded and slid your feet into the hole's opening.  You then dropped into the hole and fell for several seconds before you landed with a soft thump.  You looked around at the room you were in.  There were several lit torches, allowing just enough light to see.  You could see that there were several tunnels that branched off from this room.  You heard a soft clatter from above, followed by Rishina landing next to you.  \"Are you OK, dear?\" Rishina said as she rose to her feet.  \"I'm fine.\" you replied \"But where are we?\".  \"This room connects to various underground passageways that lead all over the island.\" Rishina said, grabbing one of the torches.  \"Are you the only one that knows about this?\" you asked as Rishina led you into one of the tunnels.  \"Yes.\" Rishina replied \"My mother, who was empress before me, knew about them as well.  She often used them as shortcuts to reach the areas of the island where we find food.\".  You nodded in response as you followed the female raccoon through the narrow tunnel.  Several minutes later, you reached the end of the passage.  Rishina pushed on a rock covering the exit hole above you.  You both climbed out and looked around you.  You must be miles away from the city.  \"Follow me.\" Rishina said, leading you into a dense thicket of bushes.  You followed her for several minutes before you reached the opening of a large cave.  \"What are we doing here?\" you asked.  </span></div></div>",
            "created":1418014800,
            "id":1899757,
            "title":"A secret room beneath the palace"
        },
        "15533222222222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Panthena, the Panther",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this choice?</span></div></span></div>",
            "created":1416373200,
            "id":1889498,
            "title":"Readers Choice"
        },
        "155332222222222222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"He will be my mate.\"",
                "\"He will be my personal guard.\""
            ],
            "content":"<div class=\"\"><div> <span>Sitting atop the throne was a large female panther. She had black fur all over her body, and a pair of bright green eyes. She was wearing a bright red dress, and wore a golden tiara on her head.  She rose from her throne and approached you. You began shaking nervously, not knowing what she was planning to do. She stood front of you and looked at you closely. \"Interesting.\" she muttered to herself. She then turned to the guards that had brought you here. \"Where did you find this male?\" she asked. \"We caught him in one of the pit traps.\" the skunk replied.  The panther then turned to you. \"Where exactly did you come from?\" she asked. \"I was thrown off of the boat I was traveling on and I eventually washed up on this island.\" you replied, your voice trembling. \"Would you please tell me where I am?\". The panther smiled and replied \"You are on the island of Anthronia. I am the leader of the island, Panthena.\".  <br>\r\n<br>\r\n\"It is nice to meet you.\" you replied \"But is there any way you could send me back home?\". Panthena's smile faded slightly. \"I'm sorry, but I'm afraid we cannot allow you to leave the island.\" she said \"We've been hidden from your kind for centuries, and we can't risk you exposing us to your kind.\". Your face fell at these words. \"What shall we do with him?\" the fox guard asked. Panthena thought for several minutes before she replied,<br>\r\n</span></div></div>",
            "created":1416373200,
            "id":1889501,
            "title":"Panthena, the Panther"
        },
        "1553322222222222222222211":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Her private bedroom",
                "The palace garden"
            ],
            "content":"<div class=\"\"><div> <span>\"I will make him my mate.\" Panthena said.  You looked at her in confusion.  \"What do you mean by that?\" you asked.  \"I mean that you'll live with me in the palace and rule the island along with me.\" Panthena said, smiling.  You looked at her in surprise.  \"Why choose me?\" you asked \"Isn't there someone else more fit for the job.\".  Panthena smiled and wrapped her arms around you.  \"There is no need for you to fret.\" she said \"There is a lot about you that I like.  That is why I have chosen you as my mate.\".  She then gave you a quick peck on the cheek, making you blush.  \"I assure you that you'll enjoy living on this island.\" she said, smiling.  <br>\r\n<br>\r\nYou looked at Panthena and smiled, knowing that she would look after you.  \"Now come with me.\" she said, pulling on your arm and leading you out of the throne room.  She then led you through a series of large hallways.  Several minutes later, she led you to, <br>\r\n<br>\r\n</span></div></div>",
            "created":1416373200,
            "id":1889504,
            "title":"\"He will be my mate.\""
        },
        "15533222222222222222222111":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "She pulls you onto the bed.",
                "One of the guards walks in"
            ],
            "content":"<div class=\"\"><div> <span>Panthena led you through a large pair of oak doors, bringing you into a large room that you assumed was her private bedroom.  There was a large bed that had a wooden frame, velvet sheets and hangings.  There were several pieces of furniture made of oak, plus a large chandelier, which lit up when they entered, hanging from the ceiling.  There was also a large bathroom in an adjoining room.  Panthena stood at the foot of the bed and pulled you up close to her.  You looked at her and sighed deeply.  <br>\r\n<br>\r\n\"Is something wrong, my love?\" Panthena asked.  You shrugged in response.  \"I'm just a little overwhelmed, I guess.\" you replied.  Panthena smiled and caressed your chin.  \"Don't worry, dear.\" she said \"I assure you everything will be fine.\".  You smiled as you looked into her eyes.  You were lost in her gaze for several minutes until, <br>\r\n</span></div></div>",
            "created":1416373200,
            "id":1889509,
            "title":"Her private bedroom"
        },
        "155332222222222222222222":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "Jangela, black jaguar",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this option?</span></div></span></div>",
            "created":1418014800,
            "id":1899462,
            "title":"Readers Choice"
        },
        "1553322222222222222222221":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "\"I shall make him my mate.\"",
                "\"I'll find someone on the island who will take him in.\""
            ],
            "content":"<div class=\"\"><div> <span>Sitting atop the throne was a female black jaguar.  She had black fur covering most of her body.  She was dressed in a white silk dress and was wearing a golden tiara atop her head.  She rose from the throne and approached you.  She bent down and looked over you closely.  You began shaking slightly, seeing her bright green eyes staring at you.  \"Interesting.\" the jaguar said under her breath as she examined you.  \"How did you come upon my island?\" the jaguar asked, making you jump slightly.  You explained to her how you'd been thrown into the sea and washed ashore.  The jaguars stern expression softened as you spoke.  \"So you aren't from around here?\" the jaguar said as you finished.  \"I suppose you are wondering where you've ended up?\" the jaguar said, looking at you with a slight smile \"This is the island of Anthronia.  I am the ruling empress of the island, Jangela.\".  \"I do apologize for intruding into your territory, miss.\" you said, bowing slightly.  \"There's no need for you to apologize.\" Jangela said, smiling \"I don't consider you to be an intruder, just an unexpected guest.\".  You smiled slightly, knowing she wouldn't be upset with you.  \"I would greatly appreciate it if you could somehow send me back home.\" you replied.  Jangela frowned slightly.  \"I'm sorry, but that cannot be possible.\" she said.  \"Why not?\" you asked, surprised.  \"This island has been hidden from the human world for centuries.  We can't allow you to leave and risk exposing our island to your kind.  Plus, even if we did let you go, it would be impossible to find your way back.\" Jangela replied.  You looked down in shame, knowing you were stranded on this island.  \"There, there.\" Jangela said, holding your chin in her paw \"There's no reason for you to feel disappointed.  I assure you, that you'll enjoy living here.\".  \"So what do you intend to do with him, your highness?\" asked the skunk guard that had brought you here.  Jangela thought for several minutes.  She then replied,  </span></div></div>",
            "created":1418014800,
            "id":1899466,
            "title":"Jangela, black jaguar"
        },
        "1553322222222222222222222":{
            "choices":[
                "Marina the Koala",
                "Try Again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm just in a koala mood so I'll throw in this possibility.</span></div></span></div>",
            "created":1421125200,
            "id":1917325,
            "title":"Just in a Koala Mood"
        },
        "15533222222222222222222221":{
            "choices":[
                "She Puts You to Work Hard Labor",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>You look up and see the empress atop a golden throne. She was a fat, 5 feet tall blue furred koala hear with a light pink underbelly and a white mane around her neck. What was startling was that aside from a regal looking cape and a tiara, she was completely naked.<br>\r\n<br>\r\n\"Your Highness,\" says the fox. \"Empress Marina. \"We found this trespasser on the island. We don't know what kind of species he is.\" The koala empress scratches the inside of her pouch as she looks down on you and then she seems to recognize what you are and gives you a nasty glare as you shake in place. \"That's a human male,\" says the empress. \"We haven't had one on the island for years. Fortunately.\" She said that with venom in her voice, leading you to believe that she had it in for you.<br>\r\n<br>\r\nMarina gets off her throne and stomps up to you as she looks up. The sight of this koala staring up at you with angry eyes completely intimidated you. \"I was hoping that one of your kind wouldn't wash ashore ever again. The last time a human was on the island, it was when my mother was the empress. I convinced her to let him live. After all, we had never seen a human before and I tried to be diplomatic. I trusted him and it wasn't long until both of us were engaged. Unfortunately my trust was proven to be undeserved to that castaway.\" Marina then grit her teeth as you looked in fear and then she continued.<br>\r\n<br>\r\n\"<i>The heartless bastard left me at the alter</i>!\" You couldn't believe it. Of all the rotten luck. Then Marina held her stomach. \"I was so heartbroken and embittered at what happened, I put on all this weight. It taught me that humans were cruel and cowardly creatures. But that raises the question, how should I deal with you?\"<br>\r\n<br>\r\nWhat does she do with you given that she doesn't seem to like humans?</span></div></div>",
            "created":1421125200,
            "id":1917327,
            "title":"The Koala Queen"
        },
        "15533222222222222222222222":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "Victoria the cow",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1422162000,
            "id":1923027,
            "title":"Try Again"
        },
        "155332222222222222222222221":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "...We´ll have a beautiful ceremony\"",
                "...We´ll have a night-long mating in bed!\""
            ],
            "content":"<div class=\"\"><div> <span>You couldn't believe your own eyes. Sitting on the throne is a cow. She´s wearing a black robe that displays the wast cleavage of her gigantic breasts and a golden tiara. She rose from her throne and approached you. You began shaking nervously, not knowing what she was planning to do. She stood front of you and looked at you closely. \"Interesting.\" she muttered to herself. <br>\r\nShe then turned to the guards that had brought you here. \"Where did you find this one?\" she asked. \"We caught him in one of the pit traps.\" the skunk replied. <br>\r\nThe cow then turned to you. \"Where did you come from?\" she asked. \"I was thrown off of the boat I was traveling on and I eventually washed up on this island.\" you replied, trying not to stare at her breasts. \"Would you please tell me where I am?\". The cow smiled and replied \"You are on the island of Anthronia. I am Victoria, empress of this island\".<br>\r\n\"It is nice to meet you.\" you replied \"But is there any way you could send me back home?\". Victoria's smile faded slightly. \"I'm sorry, but I'm afraid we cannot allow you to leave the island.\" she said \"We've been hidden from your kind for centuries, and we can't risk you exposing us to your kind.\". Your face fell at these words. That´s when she hugged you for comfort, letting your head rest on her breasts.<br>\r\nVictoria; \"There´s no need to be sad. I´ll make sure you´ll get a happy life here\"<br>\r\nYou; \"How?\"<br>\r\nVictoria; \"Easy. You´ll be my mate!\", and she pressed your head deeper into her cleavage. You were surprised by her words and this. You pulled yourself out and asked \"What do you mean by that?\", \"I mean that you'll live with me in the palace and rule the island along with me.\"<br>\r\nYou; \"Why choose me?\" you asked \"Isn't there someone else more fit for the job\". Instead of answering she kissed you right on the lips, leaving you in complete shock! But then you started to relax and kissing her back. Unbeknownst to you everyone else, including the guards, left the throne room, leaving you both undisturbed.<br>\r\n<br>\r\nWhen you and Victoria finished kissing, she whispered \"now we shall make you my mate\". \"How?\" you asked. She replied smiling \"it´s easy...</span></div></div>",
            "created":1447650000,
            "id":2063016,
            "title":"Victoria the cow"
        },
        "1553322222222222222222222212":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "Start off slow - we've got all night, let's make it last",
                "Go in thrusting - start this mating off with a BANG!"
            ],
            "content":"<div class=\"\"><div> <span>\"We... consummate our love.\" She says in a low husky voice, trailing one thick finger down the side of your neck. Your mouth drops open in shock; you kind of expected something like this, but not so fast. Nevertheless, despite the fact that this is a cow that's putting the moves on you, you begin to feel a distinct shifting in the downstairs region of your body - given your position crushed against her immense chest, Victoria feels it, too.<br>\r\n<br>\r\n\"Looks to me like you're raring to go, little man.\" She croons, extracting you from between her immense breasts and taking your hand, leading you into a doorway located behind your throne. \"Come; the night is young, is it not? Let's not waste it.\"<br>\r\n<br>\r\nHardly able to believe that you aren't in some crazy dream, you quicken your steps to keep up with the massive cow-woman, your dick straining to escape the confines of your shorts.<br>\r\n<br>\r\nVictoria leads you down a wide hallway lined with plush carpeting and with torches set in the walls; as you walk, you take the opportunity to get a good look at the empress - your mate, you realize with no small amount of giddiness. The first thing you notice about her is the height - you're a tall man, around six and a half feet tall, but Victoria is towering over you by at least two feet. Her thick figure, easily visible through the thin fabric of her robe, resembles that of an ancient fertility goddess come to life - wide hips with an ass that you could cover more than your hips if she sat down on you, a small soft belly, waist not thin or fat, thighs thicker around half your torso. Finally, your eyes drift higher up to her breasts - seems that you saved the best part for last. Sticking out in front of her like a great doughy shelf, they display none of the stiffness associated with breast implants, instead proudly jiggling and bouncing with her every step like great bags of Jell-O three times the size of your head. Her nipples are proudly standing up underneath the black cloth, each one almost as wide around as your thumb.<br>\r\n<br>\r\nTearing your eyes away from your wife's immense tits (You still can hardly believe that you got this lucky), you let your eyes roam up and down the rest of the empress' body. Her figure is thick, yes, with considerable padding around her arms, legs, back, and, well, her everywhere, but you can still see quite a bit of muscle underneath those juicy curves. In terms of other features, it's pretty obvious that Victoria isn't human: her body is covered in relatively thin, smooth fur, dark orangey brown on the back and milky white on her front, her thick legs end in cloven hooves instead of feet, and each hand ends in three thick fingers and a thumb, each tipped with a large dull hoof-like nail. Her head is unmistakably that of a cow, complete with a pair of foot-long upwards-curving horns, but her facial features are still somewhat human - emerald green forewards-facing eyes, somewhat higher forehead, etc. - and a full head of long, rich dark brown hair tumbles down to a little past her shoulders.<br>\r\nYou can tell that the empress knows you're staring - as she walks, she starts swaying her hips with every step, causing her immense behind to jiggle slightly, causing a fresh bout of straining from your little 'volunteer' to escape the oppressive bonds of your shorts.<br>\r\n<br>\r\nFinally, you reach a large, round room, most of which is taken up by an immense round bed, piled high with pillows and blankets. It looks incredibly comfortable, but something tells you that sleep isn't in your immediate future.<br>\r\n<br>\r\n\"Well, little man, let's begin.\" Victoria coos into your ear as she enters, giving your butt a light squeeze as she walks by. You hurriedly cast off your shirt and pull off your pants, letting your cock spring out fully erect. The empress smiles and licks her lips seductively at the sight of your proudly erect penis, a lusty chuckle escaping her as you quickly toss your shoes and socks to the floor. \"My turn now,\" She lows, reaching for the first button on her robe.<br>\r\nSlowly, but surely, she peels the black fabric from her body, letting it fall to the floor behind her as she stands before you in all her naked glory, causing more than a little bit of pre to dribble out from your cock. Looking down at her nethers, you can see that her vagina is already leaking quite a bit - she's just as excited for this as you are.<br>\r\n\"Come, my little king.\" Victoria orders seductively, sitting down upon her mammoth bed and beckoning with one finger. \"It's time for your... <i>coronation</i>.\"<br>\r\nYou dash over to the bed as fast as you can, your dick raring to sink itself into the cow's juicy pussy. But how to start your royal 'coronation'?</span></div></div>",
            "created":1483419600,
            "id":2258715,
            "title":"...We´ll have a night-long mating in bed!\""
        },
        "155332222222222222222222222":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "Rena, the Renamon.",
                "Reader's Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this?</span></div></span></div>",
            "created":1449205200,
            "id":2069941,
            "title":"Reader's Choice"
        },
        "1553322222222222222222222222":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "Tyraelia, the Tyrannosaurus rex",
                "More choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's try something a bit more in line with the theme of lost islands...</span></div></span></div>",
            "created":1483246800,
            "id":2257568,
            "title":"Reader's Choice."
        },
        "15533222222222222222222222222":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "Sebekali, the Crocodile",
                "More options..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another option appears....</span></div></span></div>",
            "created":1483246800,
            "id":2257569,
            "title":"More choices..."
        },
        "155332222222222222222222222221":{
            "author_id":"lediblock",
            "author_name":"Lediblock",
            "choices":[
                "\"...Save us all.\"",
                "\"...Become the empress' mate.\""
            ],
            "content":"<div class=\"\"><div> <span>Lounging on the throne in front of you is a massive blend of woman and crocodilian. Dark green scutes and scales cover her back like armor, with dirty yellow scutes protecting her front, which sports a truly huge pair of breasts nearly twice the size of your head. Partially see-through silvery robes hug the woman's body closely, barely concealing her curvy, muscular body. A long crocodilian tail extends from just above her wide hips and ample rear end, and four sharp claws sprout from each of her feet. Similar sharp talons adorn the tips of the crocodile-woman's fingers, and she clutches a simple wooden staff carved to look like a rearing cobra on the top, its inset ruby eyes seemingly boring into yours. Her head is crown with a golden tiara studded with lapis and jade, and sports an elongated snout bristling with razor-sharp teeth. Above all, though, two piercing slit-pupiled yellow eyes gaze down at you, burning like twin pits of molten gold in the absolute best poker face you have ever seen. You can't help but feel intimidated by the reptilian woman's gaze, like a mouse staring down a tiger. Even if the skunk-woman hadn't said that this was the empress of wherever it was you've gotten stuck in, you would easily be able to figure it out - the crocodile-woman practically <i>oozes</i> royalty from every cell of her being.<br>\r\n<br>\r\nSo mystified are you by the empress' gaze that you don't hear the skunk woman talking until she jabs you in the side with the butt of her spear.<br>\r\n\"H-hey!\" You protest.<br>\r\n\"Snap out of it, stranger.\" The warrior snaps, glaring down at you as if you just insulted her mother. \"I asked you a question. What. Are. You?\"<br>\r\n\"Not someone who takes orders from you, Captain Hardass,\" You snap back. \"How does that stick up your ass feel?\"<br>\r\n\"Y-you insolent cur!\" The skunk shouts, drawing her spear. \"I should gut you like a fish for your rudeness!\" You start to go into a sweat; you have a habit of mouthing off when your scared, and your big fat mouth just might have won you a free impaling<br>\r\n\"Stand down, Captain Silora.\" The crocodile woman interjects; despite her bestial appearance, her voice is as clear and smooth as a running stream. <br>\r\nImmediately, your captor snaps to attention, her head cast downwards. \"Yes, Empress Sebekali,\" She replies, clearly ashamed with herself at being rebuked by her monarch. Huh. So she actually was a captain - probably of the guard or something, given the spear.<br>\r\n\"Thank you.\" The queen replies, rising from her throne and slowly walking towards you - as she does so, you suddenly notice just how tall this 'Sebekali' really is: she easily towers over you by at least a couple of feet, and you're not exactly short. The empress leans down to get a better look at you, giving you a very nice view of her cleavage that you desperately try not to look at.<br>\r\n\"You are a strange one, no doubt about that.\" She muses, cupping your chin and looking you over with what you could swear is a gleam of amusement in her yellow eyes. \"But you are an interesting one nonetheless.\"<br>\r\n\"Um, thanks?\" You manage to say, mentally slapping yourself even as the words leave your mouth. Idiot! Could you have <i>possibly</i> sounded even more boring?!<br>\r\n\"You are very welcome.\" Sebekali replies. She reaches behind your back; with a flick of her claws, your bonds are cut through, and the crocodile-woman offers you a hand to pull you up. <br>\r\n\"Th-thank you, ma'am-uh, Your Highness.\" You hesitantly reply, accepting the extended hand and standing back up. Now that you're upright again, you can definitely confirm it: yep, she is <i>definitely</i> taller than you by at least a couple of feet, your eyes coming up just below her massive mammaries. You file away the question of how a reptile can even have those for another day and tear your eyes away from the empress' breasts to look up at her face - shockingly, she actually <i>smiles</i> a little bit at your slight blush. <br>\r\n\"You are welcome, stranger.\" The crocodile woman replies. \"Now, I believe that a more... proper introduction is in order. I am Empress Sebekali Aruwa, Thirty-sixth imperial ruler of the kingdom of Anthroparis. What is your name, strange one, and what manner of being are you?\"<br>\r\n\"Um, I-I'm... I'm John. John Harris, Jr.\" You manage to stammer out. \"I'm a human.\"<br>\r\n<br>\r\nSebekali's eyebrows (Or, well, the ridges where her eyebrows would be) raise at this. \"Really?\" She asks, her curiosity piqued. \"A human? And... where did you come from, if I may ask?\"<br>\r\n\"From the sea, Your Highness.\" You reply truthfully - you don't think that lying is going to go over well with this woman, especially considering all those teeth of hers. \"I was out sailing, and a storm blew me here, wrecking my ship.\"<br>\r\n<br>\r\nFrom behind you, Silona lets out a gasp, her spear clattering to the floor in shock. \"Y-you mean...?\" She asks.<br>\r\nThe empress nods sagely. \"So it seems. It is as the prophecy foretold: In the dawn of the thirty-sixth empress' reign, the son of Harris shall come from the sea and...\"</span></div></div>",
            "created":1483246800,
            "id":2257587,
            "title":"Sebekali, the Crocodile"
        },
        "155332222222222222222222222222":{
            "author_id":"speedy1242",
            "author_name":"speedy",
            "choices":[
                "Foxy the vixen",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this </span></div></span></div>",
            "created":1489813200,
            "id":2291592,
            "title":"More options..."
        },
        "1553322222222222222222222222221":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "May, the Parasaurolophus."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So here is a different one. How about this?</span></div></span></div>",
            "created":1507870800,
            "id":2400671,
            "title":"Oops, there already is a vixen choice."
        },
        "1553322222222222222222222222222":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Pen Ling the panda",
                "Foxy the red panda",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this two?</span></div></span></div>",
            "created":1557258480,
            "id":2656692,
            "title":"Something else"
        }
    },
    "info":{
        "author_id":"falcon",
        "author_name":"Falcon",
        "brief_description":"You are stranded on an island with Furry amazons, ruled by a empress",
        "created":1301772660,
        "description":"<td align=\"left\" class=\"norm\">Your boat is caught in a violent storm and you are thrown overboard. You wash up on a island, populated by furry amazons. The amazons ruled by their empress. Where the story goes, depends on who that furry is.<br>\r\n<br>\r\nSome rules:<br>\r\n<br>\r\n1. The main character must not be killed<br>\r\n<br>\r\n2. You can have the empress be any species you want<br>\r\n<br>\r\n3. At least a paragraph per chapter<br>\r\n<br>\r\n4. Most of the amazons are five feet tall, there are a few that are bigger. The empress is always in the same size as the other amazons.<br>\r\n<br>\r\n5. In most storylines, the males of the island are either slaves, hiding in the jungle, or non-existent. If there are males inhabiting the city, as citizens or not, make it evident early in the storyline<br>\r\n<br>\r\n6. Sorry to any females reading this, but the main character is always males<br>\r\n<br>\r\n7. Sex IS allowed (Rated 18+)<br>\r\n<br>\r\n8. Have fun!<br>\r\n<br>\r\n<br>\r\nReward: 1000 Gift Points per chapter<br>\r\n<br>\r\n<br>\r\nThat's all for now. Enjoy!</td>",
        "id":1764611,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598254980,
        "modified":1598254980,
        "pretty_title":"Island of the Furries"
    }
}