{
    "chapters":{
        "1":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "A Crib, in a nursery. ",
                "An Open Field",
                "In a castle.",
                "On a cloud",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up one day and look around. Everything looks much bigger. <br>\r\n<br>\r\nWhere are you?</span></div></span></div>",
            "created":1354078800,
            "id":1477206,
            "title":"From Humble Beginnings!"
        },
        "11":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "One of the Mane Six",
                "Background Pony",
                "Ditzy Doo",
                "Cheerilee",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose home are you in? (If you are even in somepony's home)</span></div></span></div>",
            "created":1354078800,
            "id":1477212,
            "title":"A Crib, in a nursery. "
        },
        "111":{
            "choices":[
                "Twilight/Rarity/Rainbow Dash",
                "Fluttershy/Applejack/Pinkie Pie",
                "All of them (maybe they each takes turns?)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the Mane Six is going to care for you?</span></div></span></div>",
            "created":1366088400,
            "id":1573127,
            "title":"One of the Mane Six"
        },
        "1111":{
            "choices":[
                "Twilight Sparkle",
                "Rarity",
                "Rainbow Dash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Twilight? Rarity? Rainbow Dash? You choose which one. </span></div></span></div>",
            "created":1366088400,
            "id":1573128,
            "title":"Twilight/Rarity/Rainbow Dash"
        },
        "11111":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Twilight. Ok. Now, what gender are you?</span></div></span></div>",
            "created":1537881900,
            "id":2553592,
            "title":"Twilight Sparkle"
        },
        "111111":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Pony",
                "non-pony"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of pony are you? Or are you even a pony?</span></div></span></div>",
            "created":1537881900,
            "id":2553593,
            "title":"Male"
        },
        "1111111":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Pegasus/Earth Pony",
                "Unicorn/Alicorn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And finally what type of pony are you?</span></div></span></div>",
            "created":1537881960,
            "id":2553595,
            "title":"Pony"
        },
        "11111112":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Alicorn",
                "Unicorn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wings and a horn, or just a horn?</span></div></span></div>",
            "created":1539352020,
            "id":2562882,
            "title":"Unicorn/Alicorn"
        },
        "111111121":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Twilight walks in",
                "Spike or someone else enters"
            ],
            "content":"<div class=\"\"><div> <span>You grunt and whine as the beams of faint sunlight brush against your face.  They weren't even that bright, but they were enough to wake you and you were not happy about it.  <br>\r\n<br>\r\nYou finally concede defeat and your eyes flutter open with a yawn.  You blink rapidly disorentied from just waking up and you try ot roll out of bed to start your routine.  Much to your shock though you couldn't find the strength to do so.  Looking down, as much as oyu could anyway, you see that a thick flannel blanket (that was surpisingly comfey) was wrapped aorund you.<br>\r\n<br>\r\nAnd to your growing shock and confusion it was keeping your from moving.  A few tired grunts and some kicks though sees the entraping blaket kicked away from you, and thats when you notice the other changes.  Looking above you saw a series of colorful shapes spining above your head.  To either side of you were bard that seemed to stretch for miles upward.<br>\r\n<br>\r\nThats when you noticed just how <i>huge</i> everything was. The bed you were lying in had to be huge, and all the furnature, the room even, was massive!  Finally finding the energy to stand up, you hear a soud like crinkeling plastic.  Confused oyu shift again trying to figure out the noise, and realsie that the noise gets louder and faster as you move!<br>\r\n<br>\r\nKicking the blanket off all the way you find the souce of the noise.  A thick fluffy light blue diaper hugging your waist.  You gasp in shock your wings flapping instinctavly.  Wait wings?  You look aroudn and grab one of the appendeges, yes you had wings.  And there was a weight on your head that you confirm was a horn.<br>\r\n<br>\r\nWings, horn, a diaper?!?  You were in a giant nursery!  Or was it normal sized and you were just tiny?<br>\r\n<br>\r\nAt that though you release a loud piercing wail involentary.  You try to stop, but you jsut can't and that just makes you cry harder.  Crying like the foal you are you realise that you have indeed become a foal again, an alicorn at that.<br>\r\n<br>\r\nYou crys continue untill<br>\r\n</span></div></div>",
            "created":1542596640,
            "id":2579427,
            "title":"Alicorn"
        },
        "11112":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what gender are you?</span></div></span></div>",
            "created":1366088400,
            "id":1573129,
            "title":"Rarity"
        },
        "111121":{
            "choices":[
                "Earth Pony/Unicorn/Pegasus",
                "Alicorn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What pony race are you? Earth Pony? Unicorn? Pegasus? Or maybe even an Alicorn/Pegacorn?</span></div></span></div>",
            "created":1366088400,
            "id":1573131,
            "title":"Male"
        },
        "1111211":{
            "choices":[
                "Earth Pony",
                "Unicorn/Pegasus"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1366088400,
            "id":1573134,
            "title":"Earth Pony/Unicorn/Pegasus"
        },
        "11112111":{
            "choices":[
                "Rarity enters the room.",
                "Sweetie Belle, Rarity's little sister, enters the room."
            ],
            "content":"<div class=\"\"><div> <span>Your eyes slowly flutter open as beams of light suddenly stream into the room, shining over your pale face. Disoriented for only a moment, you try to sit up, but for some reason you don't have the strength to pull yourself up. You look down and see thick, flannel blankets restraining you to the strange bed you are in. You look to your left and right and are confused to see hollow plastic bars surrounding you. <br>\r\n<br>\r\nYou finally manage to wiggle out of the tight blanket. You are extremely and utterly shocked to see that you've...shrunk!...well, at least that's what you think happened. You finally gain the strength to sit up, but a strange noise that almost sounds like plastic distracts you. You shift from side to side, and the crinkling noise increases as you move around faster. You look down and gulp. It was worse than what you expected; a fluffy white diaper was neatly hugging your legs and waist. You try to shake yourself out of this 'illusion', thinking it's all just a dream.<br>\r\n<br>\r\nBut moments later, you let out a sharp, piercing wail that involuntarily escapes your mouth. You try to stop crying, but you can't control yourself, as you now know your newly-christened baby body was too weak and undisciplined. <br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1366088400,
            "id":1573138,
            "title":"Earth Pony"
        },
        "111121111":{
            "choices":[
                "Let's you down on the floor (playtime)",
                "Takes you to the kitchen (breakfast)"
            ],
            "content":"<div class=\"\"><div> <span>Rarity soon walks in. She turns to you and lifts you up with her magic.<br>\r\n<br>\r\n\"Good mourning, darling.\" She says as she pulls you closer to her. \"Up from your nap I see?\"<br>\r\n<br>\r\nYou continue to cry, still confused and lost, worrying how you ended up here.<br>\r\n<br>\r\n\"Oh don't cry, sweetie!\" Rarity began to rock you and levitated a pacifier from a nearby counter and placed it in your mouth. \"Momma's here... Don't worry...\"<br>\r\n<br>\r\nYou calm down. The rocking, and surprisingly, the pacifier calms you down and you look up at Rarity, smiling behind the pacifier.<br>\r\n<br>\r\n<br>\r\n<br>\r\nRarity thens...</span></div></div>",
            "created":1367211600,
            "id":1580830,
            "title":"Rarity enters the room."
        },
        "1111211112":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Sets you in a playpen (playtime)",
                "Puts you in a carrier (a shopping trip or meeting somepony)"
            ],
            "content":"<div class=\"\"><div> <span>That’s my happy colt. Rarity coos smiling at you. Rarity carries you downstairs in her magic as you wonder.  Why had you acted that way? Rarity had just started cooing and rocking you, and the pacifier had calmed you down instantly.<br>\r\n<br>\r\nYou knew you had acted exactly like an upset foal would have, and that just made you upset again wanting to cry or kick. And then you realized this was also the response of a foal and you reigned it in. Still you were confused and wondering just what had happened.<br>\r\n<br>\r\nYour confusion and questions were temporarily banished when you see the bright padded highchair set up in the kitchen and you realize what was happening.  The unicorn strapped you in despite your struggles. Its breakfast time sweetie. The mare coos tying a bib around your neck.<br>\r\n<br>\r\nA moment later Rarity returned with a bowel in her grip. Open wide sweetie! Here comes the train! She said removing your pacifier and holding out a spoon full of foal food. <br>\r\n<br>\r\nYou gape at her. There was no way you were eating! “Gulp!” The alabaster mare quickly shoed a spoonful into your mouth.  You gag at first, then stop licking your lips.<br>\r\n<br>\r\nThis, wasn’t the mass-produced goop you had feared. It, was actually good! You had no trouble eating the rest of the bowel bit of food ending up on your bib.<br>\r\n<br>\r\nRarity uses it to clean your face off then gives you a bottle.  Feeling thirsty after that you take it without hesitation and soon the bottle was drained. Rarity gives you a few pats on the back afterwards and before you knew it a massive belch is escapes your mouth.<br>\r\n<br>\r\nRarity makes a face and you can’t help but giggle at it. The mare just sighs and shakes her head. Of the joys of raising a foal. She mutters though she is grinning the whole time.<br>\r\n<br>\r\nRarity replaces your pacifier grabs you in her magic again. You briefly find it odd that she didnt eat anything, but maybe she ate before you woke up? Now. Let’s get you dressed and then get your day started! Rarity says happily already levitating a entire variety of foolish outfits over. Onesies, sleepers, suits, even diaper covers. <br>\r\n<br>\r\nOf course, Rarity would have plenty of outfits for you. It took her only moments to select an outfit and get you dressed.<br>\r\n<br>\r\nHumming Rarity then<br>\r\n</span></div></div>",
            "created":1523235600,
            "id":2477033,
            "title":"Takes you to the kitchen (breakfast)"
        },
        "11112111121":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Try to speak to Rarity",
                "Play!"
            ],
            "content":"<div class=\"\"><div> <span>Dressed in a onesie the alabaster mare sets you down in a playpen in the main room, the padded enclosure filled with toys. Rarity strokes your head before moving off to her sewing machine which soon hums to life.<br>\r\n<br>\r\nGiven a moment to think you wonder what just happened. You woke up as a pony, a foal at that and somehow Rarity is taking care of you? What was going on?<br>\r\n<br>\r\nSomehow though you didn’t feel scared. Worried, confused, and freaking out why you’re suddenly a tiny pony wearing a diaper, but not scared. Maybe it’s just your foolish mindset again like how the pacifier calmed you down earlier but seeing Rarity close buy calms you down.<br>\r\n<br>\r\nOf course the question was what did you do now? All thoughts of a grand escape were out. Not only were the pens walls to high but you felt a deep instinctual fear at the thought of leaving by yourself. Besides dream or not you were a foal so you wouldn’t get far.<br>\r\n<br>\r\nAfter a few minutes you decide you can either try to get Rarity’s’ attention and try to get some answers from her. You still haven’t tried just talking to her yet after all. <br>\r\n<br>\r\nOr you could play with the toys which were growing more and more appealing by the moment and hope the universe gives you some answers.<br>\r\n<br>\r\nYou decide to<br>\r\n</span></div></div>",
            "created":1534243200,
            "id":2533385,
            "title":"Sets you in a playpen (playtime)"
        },
        "111121111211":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "You speak normally. ",
                "You babble like a baby"
            ],
            "content":"<div class=\"\"><div> <span>You decide to get some answers first. As appealing as the toys were you wanted to know what had happened first.<br>\r\n<br>\r\nYou manage to stand up, using the playpen railings to keep your balance. Of course then the next issue was actually getting her attention. Rarity seemed pretty focused on her work.<br>\r\n<br>\r\nWell nothing to do except yell. You thought taking a deep breath. You wanted to shout, but what escaped your mouth was a loud foals wail. That shocked you so much you lost your balance and fell. Your diaper broke your fall, but it only reinforced that you were now a foal.<br>\r\n<br>\r\n<br>\r\nIt worked though and Rarity was soon over picking you up. What's wrong sweetie? The alabaster mare coos concern clear across her face.<br>\r\n\"Nows my chance.\" You think getting ready to speak.<br>\r\n</span></div></div>",
            "created":1534719900,
            "id":2535819,
            "title":"Try to speak to Rarity"
        },
        "1111211112111":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Shocked!",
                "Calm."
            ],
            "content":"<div class=\"\"><div> <span>Wawity. Why me a ba-be? Wat appen?<br>\r\n<br>\r\nMuch to your shock you find yourself able to form words. You have an annoying lisp but you can talk. You clap your hooves happily at the realization and look to the mare for an answer. <br>\r\n<br>\r\nYou blink.<br>\r\n<br>\r\nRarity doesn't answer right away, only shifting you to rock you a bit more before she speaks. <br>\r\n<br>\r\nThe alabaster mare is</span></div></div>",
            "created":1535599080,
            "id":2540617,
            "title":"You speak normally. "
        },
        "1111211112112":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Rarity",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"Rarity, what's going on? Why am I a foal?\" Is what you wanted to ask. What you said was something closer to: Aba gab ba pbbtthhhh!<br>\r\n<br>\r\nYou cover your mouth is shock realizing that you can't talk, only babble like a foal. You try to speak again, slowly as the mare rocks you, but you only make infantile coos and gurgles. Growing more frustrated you start to whine and flail your hooves, acting just like an upset foal.<br>\r\n<br>\r\nWhat wrong sweetie? Rarity asked as she stopped rocking you. She places you over her shoulder and pats your back comfortingly, as you get more upset.<br>\r\n<br>\r\nA moment later though you pause suddenly feeling a strange pressure which vanishes soon afterwards. A moment later your diaper is suddenly a lot heaver. You feel Rarity stiffen at your accident.<br>\r\n<br>\r\nOh. She said tonelessly before hiding her disgust. Was that it? Does my little pony need dis diaper changed? She cooed trying her best \"mother\" voice.<br>\r\n<br>\r\nHer question and the realisation of what you have just done combined with just recently discovering oyu cannot talk causes soemthing to snap. You begin bawling like an upset foal, only stopping when Rarity places a pacifier in your mouth before she begins chaning your diaper. The pacifier does calm you down, but that dosn't stop your whining and squirming as the unicorn changes your diaper.<br>\r\n<br>\r\nI think somepony needs a nap. Rarity comments noticing how you were still upset. A moment later you are tucked into your crib and Rarity kissing you goodnight. Despite everything you soon found yourself dozing off.<br>\r\n<br>\r\nYou woke up some time later, yawning and dropping your pacifier. As you wake up you notice that your diaper is wet and you start to cry again.<br>\r\n<br>\r\nThe door opens a moment later and in walks<br>\r\n</span></div></div>",
            "created":1535598780,
            "id":2540613,
            "title":"You babble like a baby"
        },
        "111121111212":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "You need a diaper change",
                "The door opens"
            ],
            "content":"<div class=\"\"><div> <span>After thinking for a moment the toys just looked to enticing to pass up. Much like what has been happing \"foolish instincts\" seemed to take hold of you and you only wanted to play. Giggling you toddle over figuring that you can find some answers after you had played a bit.<br>\r\n<br>\r\nSome blocks look fun so you started building a tower, laughign when they inevetably fell over. After building a few more towers you suddenly grew bored with them and looked around. Oh that looked pretty! So colerful, and it made funny noises! Soon you were chewing on a toy keyring giggling and loosing yourself to the simple action.<br>\r\n<br>\r\nSuddenly you found yourself hovering wrapped in Raritys' magic. Well, I see my little colt like his toys. The unicorn smiled at you and booped your nose, making you laugh again. The alabaster unicorn set you on the ground and covered her face with her hooves.<br>\r\n<br>\r\nWhere's mommy? She cooed. Where is she? She asked making you focus on her before suddenly throwing her arms wide and gasping. Here she is! You laughed, a babies laugh at the game as Rarity repeats it a few more times. You were kind of surprised that the high class mare would play this type of game but you weren't questioning it. She plays with you for a few minutes more before picking you up again just to cuddle.<br>\r\n<br>\r\nYou are too cute. The mare says nuzzling you. You coo happily starting to suck on a hoof as you are held the confusion and worry of the last few hours fading away. The moment was broken however when suddenly</span></div></div>",
            "created":1535238000,
            "id":2538828,
            "title":"Play!"
        },
        "11112112":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Unicorn.",
                "Pegasus."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1457067600,
            "id":2112923,
            "title":"Wings or a Horn?"
        },
        "1112":{
            "author_id":"ponycutie",
            "author_name":"Alexandrite Lavender",
            "choices":[
                "Fluttershy",
                "Applejack",
                "Pinkie Pie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it? Animal lover Fluttershy, Hard worker Applejack or Party planner and Perky Pinkie Pie?</span></div></span></div>",
            "created":1374901200,
            "id":1635352,
            "title":"Fluttershy/Applejack/Pinkie Pie"
        },
        "11121":{
            "author_id":"froggyab2",
            "author_name":"Fluttershy lover",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No which gender are you?</span></div></span></div>",
            "created":1417842000,
            "id":1898692,
            "title":"Fluttershy"
        },
        "111211":{
            "author_id":"froggyab2",
            "author_name":"Fluttershy lover",
            "choices":[
                "Unicorn",
                "Pegasus"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>unicorn or pegasus? (Sorry I can't do more than two options)</span></div></span></div>",
            "created":1417842000,
            "id":1898695,
            "title":"male"
        },
        "1112112":{
            "author_id":"froggyab2",
            "author_name":"Fluttershy lover",
            "choices":[
                "Fluttershy enters in",
                "Angel bunny tries to comfort you"
            ],
            "content":"<div class=\"\"><div> <span>You flutter open your eyes and Jump as you see a big fluffy white bunny staring right at you. You relax as you realize it's just angel bunny. You can't remeber Angel bunny being at your place thought, come to think of it you can't remember Angel being that big. You look around and realize you were in fluttershys house. You slowly look down and realize you were sleeping in a crib. You then realize that you shrunk! But that wasn't all you also seemed to have regressed to the age of a foal. With Angel Bunny still staring at you it starts to get uncomfortable. You start to cry and can't stop</span></div></div>",
            "created":1417842000,
            "id":1898715,
            "title":"Pegasus"
        },
        "11121121":{
            "author_id":"pinkielicious",
            "author_name":"Lightning Strike",
            "choices":[
                "Continue (Readers Choice)",
                "Continue (Readers Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Angel Bunny. You're scaring him.\" The rabbit hopped away. \"Shh It's ok he's gone now.\" Fluttershy said trying to calm you down. It kind of works.</span></div></span></div>",
            "created":1433480400,
            "id":1988337,
            "title":"Fluttershy enters in"
        },
        "111211211":{
            "author_id":"jacquespaul",
            "author_name":"Jacques Jones",
            "choices":[
                "You point outside. Maybe someone can help you!",
                "You open your hooves and return her affection."
            ],
            "content":"<div class=\"\"><div> <span>You murmur, ears folded as your eyes look up at the kind Pegasus. You try to speak, but all you can hear is \"Bah~\" <br>\r\n<br>\r\nThe pegasus gently picks you up, her hoof brushing your mane. \"Would you like play outside, or have a cuddle?\" She asks, in her sweet voice.</span></div></div>",
            "created":1552736640,
            "id":2630920,
            "title":"Continue (Readers Choice)"
        },
        "11123":{
            "author_id":"ponycutie",
            "author_name":"Alexandrite Lavender",
            "choices":[
                "Unicorn/Pegasus/Earth",
                "Alicorn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What pony type are you?</span></div></span></div>",
            "created":1374901200,
            "id":1635370,
            "title":"Pinkie Pie"
        },
        "111232":{
            "author_id":"ponycutie",
            "author_name":"Alexandrite Lavender",
            "choices":[
                "Male ",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female?</span></div></span></div>",
            "created":1374901200,
            "id":1635375,
            "title":"Pinkie and the Royal Foal"
        },
        "1112321":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "You have an accident. ",
                "You are hungry. "
            ],
            "content":"<div class=\"\"><div> <span>You awake in a completely pink room. Which is normal. Mommy does not like redecorating. You smell a chocolate cake being baked right below you, which is also normal. Your room is right above the royal kitchen. You notice a pink pony staring right at you. You jump a bit. That's not normal. It doesn't look like Auntie Celestia, and it definately isn't mommy. Maybe it's one of the nannies. You haven't seen this one before. Normally they have all that armor and stuff. And they definitely aren't pink. \"Hi I'm Pinkie Pie!\" She said. Your stomach rumbles a little. </span></div></div>",
            "created":1376283600,
            "id":1644840,
            "title":"Male "
        },
        "11123211":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Breakfast time. ",
                "Playtime. "
            ],
            "content":"<div class=\"\"><div> <span>You begin to cry as you feel a warm mush enter the seat of your diaper. \"I think somepony has a stinky diaper!\" Pinkie said cheerfully. You try to get away from the strange pony, but she catches you quickly. \"Where do you think you're going? I still need to change you.\" She said. After a quick diaper change...</span></div></div>",
            "created":1376370000,
            "id":1645276,
            "title":"You have an accident. "
        },
        "1112322":{
            "author_id":"ponycutie",
            "author_name":"Alexandrite Lavender",
            "choices":[
                "She takes you to meet her friends",
                "She keeps you in Sugarcube Corner for a bit to play with you"
            ],
            "content":"<div class=\"\"><div> <span>You look around the room trying to take in your surroundings. Just as a perky pink pony bounces in and smiles at you. \"Hi,\" she smiled, you stay silent. \"I'm Pinkie Pie.\" You continue to look at her and start to smile a little. Pinkie still had that cheerful smile of hers, she takes you to lower level of her house Sugarcube Corner. You smile at her as she sets you down in front of her. Pinkie then trys to think about where to start the day.</span></div></div>",
            "created":1376283600,
            "id":1645094,
            "title":"Female"
        },
        "112":{
            "choices":[
                "Yes!",
                "Nah",
                "How about Octavia instead?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about our favorite DJ, Vinyl Scratch?</span></div></span></div>",
            "created":1367211600,
            "id":1580833,
            "title":"Background Pony"
        },
        "1121":{
            "author_id":"shygras",
            "author_name":"daemion",
            "choices":[
                "earth pony ",
                "unicorn/pegasus",
                "alicorn"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK  but first what type of pony are you.</span></div></span></div>",
            "created":1405054800,
            "id":1826015,
            "title":"Yes!"
        },
        "113":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Unicorn",
                "Pegasus",
                "Earth Pony"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of Pony are you?</span></div></span></div>",
            "created":1354078800,
            "id":1477214,
            "title":"Ditzy Doo"
        },
        "1131":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Male",
                "Female",
                "It's all screwed up down there."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Filly or Gentlecolt?</span></div></span></div>",
            "created":1354078800,
            "id":1477218,
            "title":"Unicorn"
        },
        "11311":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Accept the muffin. ",
                "Do not accept the muffin. "
            ],
            "content":"<div class=\"\"><div> <span>You wake up and see two golden eyes staring at you, facing in opposite directions. You gasp in surprise and jump back a little. Attached to those eyes was a gray pegasus mare with a golden blond mane. She frowned a little. \"Don't be scared. I don't want to hurt you.\" She said. \"Are you hungry? Cuz I got something for you.\" She smiled. She reached into her saddlebag and pulled out a muffin. She put it next to you in the crib. \"I didn't know what kind you would like, so I just got chocolate chip. Everypony loves chocolate chip!\" She said cheerfully, already munching on a similar muffin. </span></div></div>",
            "created":1354078800,
            "id":1477220,
            "title":"Male"
        },
        "113111":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "She finds you something else to eat. ",
                "You aren't really hungry. "
            ],
            "content":"<div class=\"\"><div> <span>You decide to accept the muffin. After all you didn't want to be rude. You attempt to eat it, but quickly discover you have no teeth yet. You look up at the cross-eyed pony. \"Oh, right. Too young for solid food.\" She muttered. You facehoof. </span></div></div>",
            "created":1354165200,
            "id":1478488,
            "title":"Accept the muffin. "
        },
        "1131112":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Press her for info. She must know something. ",
                "Let it go. She probably doesn't know anything. "
            ],
            "content":"<div class=\"\"><div> <span>\"What's your name, little buddy?\" The cross-eyed pony asks. You reply, happy to find out that you aren't too young to speak. \"That's a silly name.\" She giggles. \"My name is Ditzy Doo.\" She replied. <br>\r\n\"Why am I a unicorn colt?\" You ask. <br>\r\n\"Well, I guess either your mommy or your daddy is a unicorn.\" Ditzy replied. You sigh.</span></div></div>",
            "created":1354510800,
            "id":1480885,
            "title":"You aren't really hungry. "
        },
        "11311121":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "\"I think somepony has a dirty diaper!\"",
                "\"I still haven't gotten the soot out of your coat yet.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well, why am I here then?\" You asked. <br>\r\n\"That's actually kind of a funny story.\" Ditzy replied. \"You see, I was delivering the mail when I heard a loud bang from inside somepony's house. The door was unlocked, so I decided to see what happened. I found you covered in soot laying in the middle of the floor. No one else was home, and I knew I shouldn't leave a foal without anypony to care for you. So I took you home.\" Ditzy said cheerfully. <br>\r\n\"So, you foalnapped me?\" You asked. <br>\r\n\"Well, I was going to see if anypony was home tomorrow...\" Ditzy muttered. She suddenly picked you up and put you on her back. <br>\r\n\"What are you doing?\" You asked. She giggled. <br>\r\n\"Well...\" She began. </span></div></div>",
            "created":1360731600,
            "id":1531704,
            "title":"Press her for info. She must know something. "
        },
        "113111211":{
            "choices":[
                "There's a large, yellow wet spot on the front of your diaper.",
                "There's a slightly-brownish lump in the back of your diaper."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Once the grey mare announced this, your eyes widened in horror and embarrassment. You look down and indeed...</span></div></span></div>",
            "created":1363669200,
            "id":1554168,
            "title":"\"I think somepony has a dirty diaper!\""
        },
        "1131112111":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Try to Escape",
                "Sit Quietly"
            ],
            "content":"<div class=\"\"><div> <span>You stay silent on the way to the changing table, too embarrassed to say anything. Ditzy puts you down on the changing table and turns around to get the changing supplies. \"We can't have you waddling around in a wet diaper, can we? You'd get a rash.\" Ditzy asked you while her back was turned.</span></div></div>",
            "created":1363842000,
            "id":1555043,
            "title":"There's a large, yellow wet spot on the fro..."
        },
        "1131112112":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Sit quietly. ",
                "Try to escape. "
            ],
            "content":"<div class=\"\"><div> <span>You blush as you smell your accident. You stay silent on the way to the changing table, too embarrassed to say anything. Ditzy puts you down on the changing table and turns around to get the changing supplies. \"You certainly are a stinky little colt, aren't you?\" She asked. </span></div></div>",
            "created":1363842000,
            "id":1555039,
            "title":"There's a slightly-brownish lump in the bac..."
        },
        "11311121121":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "\"Yes, they are very freaky.\"",
                "\"No, your eyes are fine.\""
            ],
            "content":"<div class=\"\"><div> <span>You stay quiet, blushing slightly as Ditzy began to change your diaper. \"I said, 'You certainly are a stinky little colt, aren't you?' Are you going to answer me?\" Ditzy said. <br>\r\n\"Um, yes?\" You replied. Ditzy paused. <br>\r\n\"Is something wrong? You seem scared.\" Ditzy said. \"Is it because my eyes are weird?\" She asked. </span></div></div>",
            "created":1364014800,
            "id":1556174,
            "title":"Sit quietly."
        },
        "113111211211":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "...You're going into time-out, mister!\"",
                "...it's playtime.\""
            ],
            "content":"<div class=\"\"><div> <span>Ditzy gasps and flips you onto your stomach. \"That is very rude! Don't make fun of other pony's disabilities!\" Ditzy said, scolding you. Before you can react, she quickly spanks you. You yelp a little. She calmly tapes the clean diaper onto your sore rear. \"Okay, now...</span></div></div>",
            "created":1364014800,
            "id":1556183,
            "title":"\"Yes, they are very freaky.\""
        },
        "113111211212":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "\"Yes, please!\"",
                "\"Um, no thanks.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Well, thank you!\" Ditzy said, securing the fresh diaper on your butt. She gave you a small hug. \"Are you still hungry? I bet I could find <i>something</i> for you to eat.\" She offered. </span></div></span></div>",
            "created":1364014800,
            "id":1556185,
            "title":"\"No, your eyes are fine.\""
        },
        "1131112112122":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Another unicorn foal is staring at you. (Dinky)",
                "Ditzy found a jar of baby food. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No way mister. I don't want you to starve to death.\" She said. She carried you into the kitchen, putting you in a high chair.<br>\r\n\"No, really. I'm not hungry.\" You reply. You suddenly notice something. </span></div></span></div>",
            "created":1376283600,
            "id":1644958,
            "title":"But I insist!"
        },
        "11311121121221":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "\"Special\" Chocolate Milk",
                "Foal Formula"
            ],
            "content":"<div class=\"\"><div> <span>The other unicorn looks to be at least 5 years old. Way older than you at least. \"Mommy, who's that?\" The unicorn asked, pointing at you. <br>\r\n\"Well, during work, I peeked in a window and saw a foal sleeping in the middle of the floor. No one was home so I took him. Tomorrow I'll try to find his parents.\" Ditzy explained. <br>\r\n\"Shouldn't you have tried to find his parents earlier?\" Dinky asked. <br>\r\n\"But then I wouldn't have had so much fun with him!\" Ditzy said. <br>\r\n\"I was asleep until ten minutes ago. I woke up, attempted to eat a muffin, and then got a diaper change. How is that fun for you?\" You asked. A bottle was quickly shoved in your mouth. <br>\r\n\"That's how.\" Ditzy replied. You begin to suck on the bottle. It's filled with</span></div></div>",
            "created":1376370000,
            "id":1645279,
            "title":"Another unicorn foal is staring at you. (Dinky)"
        },
        "113111211212211":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "...And suddenly fill your diaper. ",
                "...And nothing happens (...yet)"
            ],
            "content":"<div class=\"\"><div> <span>You can't resist the chocolate milk. You quickly suck it all down, barely even tasting it. \"I thought we were out of chocolate milk.\" Dinky said. <br>\r\n\"We are.\" Ditzy replied with a grin. <br>\r\n\"Wait, what did I just drink?\" You asked, suddenly filled with dread.<br>\r\n\"You know, I'm not really sure... I hope it wasn't dangerous.\" Ditzy said, looking concerned for a moment. You pause for a bit...</span></div></div>",
            "created":1423458000,
            "id":1930339,
            "title":"\"Special\" Chocolate Milk"
        },
        "1131112112122111":{
            "choices":[
                "Picks you up for a change",
                "Passed out"
            ],
            "content":"<div class=\"\"><div> <span>It's too late to do anything.<br>\r\nBefore you knew it, you begin to evacuate you bladder and bowels at an impossible rate.<br>\r\nAs your diaper rapidly fills with pee and poop, you cry in embarrassment and incomfort.<br>\r\nIt's a solid three minutes until you finished.<br>\r\nYou look down at your diaper to see its no longer white. Just yellow in  the front and brown in the back.<br>\r\nEach move you make only caused you're situation to be worst. You continue to cry until Derpy walks in. She notices your mess and-</span></div></div>",
            "created":1433134800,
            "id":1986188,
            "title":"...And suddenly fill your diaper. "
        },
        "1131112112122112":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Ignore them, talk to Dinky.",
                "Continue Listening. "
            ],
            "content":"<div class=\"\"><div> <span>You hear a weird noise outside. A brown-coated stallion came trotting in the door. \"Ditzy! I'm-\" he paused when he saw you and turned to Ditzy. \"Did we make that?\" He asked, pointing in your direction. <br>\r\n\"No, that Dinky's old high chair. I bought it at a flea market-\" Ditzy replied. <br>\r\n\"I mean the thing in the high chair.\"<br>\r\n\"No, I found him today. I think he fell down a chimney or something.\"<br>\r\n\"It's a he?\" <br>\r\n\"It can hear you.\" You said, slightly annoyed at being ignored. <br>\r\n\"It can talk. How can it talk? Why can it talk?\" The stallion asked. <br>\r\n\"You act like you've never seen a foal before.\" Ditzy said. </span></div></div>",
            "created":1423458000,
            "id":1930364,
            "title":"...And nothing happens (...yet)"
        },
        "113111212":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Run while she's distracted. ",
                "Stay and take your bath. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pause for a moment. \"So?\" You ask. <br>\r\n\"That means its bathtime!\" Derpy said. She set you down in the bathroom and began to get the bath ready. </span></div></span></div>",
            "created":1363928400,
            "id":1555565,
            "title":"\"I still haven't gotten the soot out of..."
        },
        "113112":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Suck on the bottle. ",
                "Spit it out"
            ],
            "content":"<div class=\"\"><div> <span>You look at the muffin in disgust. Chocolate chip? You hate chocolate chip. \"What's wrong? Don't you want it?\" The cross-eyed pony asked. You shake your head. You decide to ask her what is going on. <br>\r\n\"Wha goob baba?\" You say. You almost freak out. You can't even talk. You are about to scream when a bottle is shoved in your mouth. <br>\r\n\"There! Better?\" The pony asked. She sounded annoyed.  </span></div></div>",
            "created":1354510800,
            "id":1480881,
            "title":"Do not accept the muffin. "
        },
        "1132":{
            "author_id":"harley092001",
            "author_name":"Harley092001",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you a male or a female?</span></div></span></div>",
            "created":1457476260,
            "id":2114790,
            "title":"Pegasus"
        },
        "115":{
            "choices":[
                "AppleBloom",
                "Scootaloo",
                "Sweetie Belle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of the CMC?</span></div></span></div>",
            "created":1357794000,
            "id":1505807,
            "title":"Other"
        },
        "12":{
            "choices":[
                "Unicorn?",
                "Pegasus?",
                "Earth?",
                "Alicorn?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1358139600,
            "id":1508716,
            "title":"An Open Field"
        },
        "124":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Male?",
                "Female?",
                "Or are you some freak herm?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are an Alicorn, but are you male or female?</span></div></span></div>",
            "created":1360645200,
            "id":1530590,
            "title":"A child of royalty."
        },
        "1241":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Celestia?",
                "Luna?",
                "Cadence?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright so you're a colt foal. Which princess is your mother?</span></div></span></div>",
            "created":1360645200,
            "id":1530593,
            "title":"One of the princesses' son."
        },
        "12412":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Apple Jack, the most honest and hard working mare around?",
                "Big Mac, the elder brother or Apple Bloom the adventurous little sister?"
            ],
            "content":"<div class=\"\"><div> <span>After are an alicorn colt with a dark mane like your mother, but you had a lighter sky blue coat. You had been raised in secret by your aunt, Princess Celestia for 1000 years, You had finally seen your mother Princess Luna. She was so happy to see you again and you were happy to see her, but she was saddened that she had missed you growing up. But one day, after a year or so of Luna's return, Princess Celestia had made a proposition. She would use her alicorn powers to regress you to the age of a foal again so that Luna could have a chance to raise her only son.<br>\r\n<br>\r\nAt first you're not to sure about doing this, but the more you thought about it, the more you seemed to like the idea, and you understood what it would mean to your mother. For starters, no one really knew who you were, and for good reason. If it had been revealed of your existence, you would have been in serious danger, for the hatred towards your mother's dark side that once had consumed her. <br>\r\n<br>\r\nTo be brought back to the age of a foal again, no one would suspect a thing. To add to it, you would get to be raised by your mother and share the lifetime of 1000 years ago. The only thing that troubled you was would your mind stay the same. Celestia then told you that your memory of your current life would last for only a two or three days, after that, the foal mind would take over. Once you finally agreed, Celestia had regressed you to a foal once more.<br>\r\n<br>\r\nAnd so our story begins. You wake up in an open field, an apple orchard to be precise, and you were laying in a basket, but with no idea how you got there. The last hing you remember was that you had just been woken up by a noise on your second night as a foal, and somepony grabbed you. You realized stragiht away it wasn't your mother or the other two Princesses and you cried out for help in a babyish fashion since you could do nothing else at your current age of a newborn foal. <br>\r\n<br>\r\nYou remember your mother screaming, \"My baby!\" and were soon in the air. Your mother had been in pursuit of your kidnapper after take-off , but then you remember as she was battling him to get to you, the Stallion had lost his grip on you and you fell, remembering nothing afterwards. It then hits you, your mother must have still been battling with him and didn't realize til after you were gone that he didn't have you, so you must have fallen from the tree above you into the basket.<br>\r\n<br>\r\nWho left it there was anypony's guess, for you have no idea where you are. You figure it is best to get your self out of the basket and explore you surroundings a bit. You didn't realize til after you were out of the basket that you couldn't even walk yet, or even talk for that matter. You look around and feel all alone, and this makes tears start welling up in your eyes. You begin to whimper, for no pony is there right now to take care of you.<br>\r\n<br>\r\nYou don't know how long you had been crying for, but somepony in the orchard was there and had heard you. Who was it though?</span></div></div>",
            "created":1360645200,
            "id":1530595,
            "title":"Luna?"
        },
        "124121":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Apple Bloom with the first aid kit?",
                "Big Macintosh, surprised to see you there?"
            ],
            "content":"<div class=\"\"><div> <span>It was Applejack and she was heading back to the farmhouse with a basket of apples, when she spots you.\"Wow, Nelly. Where in the applesauce did ya'll come from little one?\" She asks you rhetorically, knowing you could not answer.<br>\r\n<br>\r\nYou look at her with a tear covered face and she just couldn't stand the sight. She comes over to you, pulls you close to her and says in her deep country accent, \"Oh, there, there little guy, it's gonna be okay. Let's getcha back ta my house and take care of ya til we find yur mama.\"<br>\r\n<br>\r\nYou give her a smile and she smiles back, hoists you up onto her back and gives you a apple to suck on since you were to young to chew. As she trots back to the farmhouse, careful not to drop you, she wonders how you got onto the farm. She figured she would focus on that later, right now, she had to get you back to the farmhouse and check you over to make sure you weren't hurt. When the two of you got to the farmhouse, Applejack knocks on the door and she hears little hooves coming towards the door. Apple Bloom soon opened the door and Applejack says, \"Apple Bloom, go fetch me the first aid kit.\"<br>\r\n<br>\r\n\"What's going on sis?\" Apple Bloom asks.<br>\r\n<br>\r\nApplejack turns to let Apple Bloom see you lying on her sister's back and passed out from the ride to the farmhouse. \"Oh, wear did he come from?\" Apple Bloom asks.<br>\r\n<br>\r\n\"I'll tell you later little sis. Just go find me the first aid kit while Ah check this little guy for injuries, ya know, just in case,\" Applejack replies.<br>\r\n<br>\r\n\"On it sis, Ah'll be back in a sec,\" Apple Bloom says.<br>\r\n<br>\r\nApplejack then takes you into the family den (living room) of the farmhouse and lays you gently down on the couch as you wake up from your little nap. She sets down the apples she had brought in near the window and comes back over to check on you. As she inspects you for any injuries, that's when she notices your wings. She had thought you were a baby unicorn upon first glance but now knew you were an alicorn. She continues to look over you, only finding minor scrapes and a bruise on you right shoulder. Soon you hear a set of hooves coming. Who is it?</span></div></div>",
            "created":1360645200,
            "id":1530603,
            "title":"Apple Jack, the most honest and hard working ma..."
        },
        "1241211":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "The princesses of day and night.",
                "One of the other Mane Six."
            ],
            "content":"<div class=\"\"><div> <span>\"Ah have the first aid kit sis,\" Apple bloom says.<br>\r\n<br>\r\n\"Good, bring it here and Ah'll start cleanin' this little one's cuts,\" Applejack says.<br>\r\n<br>\r\nApple Bloom brings the first aid kit over and lays it next to her sister. Applejack proceeded to take out a cloth and some disinfectant to clean your cuts. \"Now hold very still little guy. This is gonna sting a bit,\" Applejack says.<br>\r\n<br>\r\nAs she put's a hoof around you to keep you from fidgeting too much, she applies the cloth to your cuts and she was right, it did sting, only a bit, and you shed a few tears. After that was said and done, she pulled out some healing lotion and applied it to your bruise. It was cold to your fur and skin, but right now you knew they were only trying to help you. after puting some band aids on your deep cuts, Applejack says, \"There, all better little guy. Now to answer your question Apple Bloom, I found this little foal out in the orchard. I have no idea how he got there, but I think this little colt is of royalty.\"<br>\r\n<br>\r\nApple Bloom looks at you and sees the wings and horn as well. \"Wait, Ah don't remember hearing about one of the Princesses having a foal.\"<br>\r\n<br>\r\n\"Well Apple Bloom, he is only a few days old at most. It's highly possible that the one princesses had a foal. The question is, which one?\" Applejack says.<br>\r\n<br>\r\n\"Well maybe we should ask them,\" Apple Bloom says.<br>\r\n<br>\r\nApplejack was about to say it was a good idea when there was a knock at the door. It was.....</span></div></div>",
            "created":1360731600,
            "id":1531230,
            "title":"The Apple Family's kind hearted welcome."
        },
        "12412111":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Once at the castle.",
                "During the bath."
            ],
            "content":"<div class=\"\"><div> <span>When Apple Bloom goes to open the door, she sees Princess Celestia and Princess Luna standing before her along with their guards and a pegasus that was in chains. She bows in respect and says, \"Your Majesties, welcome, this is a might unexpected visit.\"<br>\r\n<br>\r\n\"Good morning to you Apple Bloom, we were wondering if we might come in. We must speak with you and your sister,\" Celestia says.<br>\r\n<br>\r\n\"Of course, your majesty,\" Apple Bloom says.<br>\r\n<br>\r\nAs soon as you had heard the mention of your mother and aunt, you were relieved they were here. Apple Bloom soon walks in with the princesses and a few guards. As soon as your mother saw you she couldn't hold back and ran straight to you. As she nuzzles you, she says, \"Oh, Night Shine, thank goodness you are okay.\"<br>\r\n<br>\r\nAs your mother continues to nuzzle you, you hug her nose with all four hooves and she lifts her head only a little bit of the couch, just in case you lost your grip and you begin to put on your baby routine that would soon take over your mind as well and giggle, making your mother smile. \"Awwwww,\" the Apple sisters say in unison.<br>\r\n<br>\r\n\"Princess Luna, Ah didn't know you had a child,\" Applejack says.<br>\r\n<br>\r\nAfter your mother has you let go and sit on the couch again, she says, \"Forgive me, Applejack. My foal was only born a few days ago, so we just haven't informed the kingdom yet. But last night, we had a pegasus who is traitor to the land in our castle who we currently have in custody.\"<br>\r\n<br>\r\n\"Wow, but how does that tie in with your son showing up on our farm, if you don't mind me askin, your majesty?\" Applejack asks.<br>\r\n<br>\r\n\"That's why we are here. Last night he tried kidnap my son and I being a loving mother wasn't going to let him get away. By the time I had realized my baby was no longer in his grasp I made sure he wasn't able to get away by giving him a leg lock enchantment. Once my sister showed up, I was searching frantically for my little one,\" Luna says with guilt in her voice.<br>\r\n<br>\r\n\"So that's how he got here? Ah'm sure glad Ah found him. Ah can understand how you're feelin' Princess Luna. Ah don't know wut Ah'd do if Ah couldn't find Apple Bloom. (Apple Bloom nuzzles her big sister) Ah see now why you were here so unexpectedly your highness,\" Applejack says.<br>\r\n<br>\r\n\"Quite, I apologize for any trouble,\" Luna says.<br>\r\n<br>\r\n\"Twas no trouble at all. The little guy wasn't a handful at all. In fact, he was a might quite while he was here, but Ah guess when you're only a few days old, ya'll don't know what to think. He has the cutest little smile too, and Night Shine is a very cute name for a cute and handsome colt like your son your highness,\" Applejack says.<br>\r\n<br>\r\n\"Don't be getting any ideas in the future Applejack. He is too young for you,\" Luna says, as she and Applejack laugh.<br>\r\n<br>\r\nThe princess and Applejack look over at you, which you did not notice, for you were watching Apple Bloom play picka boo with you, and even though you still had the mind of an adult, you found it funny the way she did it and were laughing.<br>\r\n<br>\r\n\"He had a bit of a bruise on his shoulder and a few minor cuts, but I already took care of it your highness,\" Applejack says.<br>\r\n<br>\r\n\"Thank you very much Applejack. It is very much appreciated. I will have to drop by once in a while to let you see my son. He already seems to like all of you,\" Luna says.<br>\r\n<br>\r\n\"Eeeyup, Sounds fine to me your majesty, but Ah reckon you want to get him back to the castle right now and have some time alone with him,\" Applejack says.<br>\r\n<br>\r\n\"Indeed I do. Thank you once again Applejack,\" Luna says.<br>\r\n<br>\r\n\"Anything for the princesses,\" Applejack says as she bows.<br>\r\n<br>\r\n\"Come little one, time for us to go,\" Luna says as she comes to grab the back of your neck gently and Apple Bloom bows as well once more.<br>\r\n<br>\r\nSoon you are carried onto the royal carriage and Luna sets you down next to her as she lays down to curl her body around you. Celestia mounts another royal carriage and the pegasus guards soon take off dragging the prisoner behind them. Right now you felt safe and secure with your mother laying next to you. One thing you looked forward to back at the castle was a nice warm bath with your mother.</span></div></div>",
            "created":1360731600,
            "id":1531594,
            "title":"The princesses of day and night."
        },
        "1242":{
            "author_id":"ponycutie",
            "author_name":"Alexandrite Lavender",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So your a princess. Are you alone?</span></div></span></div>",
            "created":1374901200,
            "id":1635313,
            "title":"Female?"
        },
        "12421":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Princess Celestia/Princess Luna.",
                "Princess Cadence/Princess Twilight."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which princess is you mother?</span></div></span></div>",
            "created":1391230800,
            "id":1736628,
            "title":"You're all alone (for now)"
        },
        "124211":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Celestia.",
                "Luna."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is your mother the princess of the Sun or the princess of the Moon?</span></div></span></div>",
            "created":1391230800,
            "id":1736629,
            "title":"Princess Celestia/Princess Luna."
        },
        "124212":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Cadence.",
                "Twilight."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is your mother the princess of Love or the princess of Magic?</span></div></span></div>",
            "created":1391230800,
            "id":1736632,
            "title":"Princess Cadence/Princess Twilight."
        },
        "14":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "A pony",
                "A structure",
                "Nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You open your young eyes to a clear blue sky, and feel your body comforted by an unbelievably cushy substance. What else do you see?</span></div></span></div>",
            "created":1377838800,
            "id":1654744,
            "title":"On a cloud"
        },
        "141":{
            "choices":[
                "Rainbow Dash",
                "Fluttershy",
                "Twilight Sparkle (Alicorn)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the pony picks you up. which pony is it?</span></div></span></div>",
            "created":1413003600,
            "id":1870164,
            "title":"A pony"
        },
        "1411":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Twilight",
                "Spike"
            ],
            "content":"<div class=\"\"><div> <span>What's a baby doing up here?!? A raspy voice askes as you are suddenly raised seemingly miles into the air.<br>\r\n<br>\r\nBlinking and gasping you find yourself in the grasp of one Rainbow Dash. The prismatic pegasus expression mixes confusion with anger as she looks around.<br>\r\n<br>\r\nAfter a moment the giant mare looks at you with a grin. Well, untill we find your parents little guy I guess your sticking with me. Little guy? What did she mean?<br>\r\n<br>\r\nYou were pondering that when Dash suddenly tossed you onto her back and speed off. Come on, Twilight will probably know who you belong to. <br>\r\n<br>\r\nYou let out a surprised gasp and held on for dear life as she sped towards Twilights home.<br>\r\n<br>\r\nMinutes later Dash burts thrugh the doors. Hey Twilight you home? She calls placing oyu on the floor. You were shaking eyes wide, but it was kind of fun actually.<br>\r\n<br>\r\nA minute later a figure enters. It was<br>\r\n</span></div></div>",
            "created":1535599680,
            "id":2540623,
            "title":"Rainbow Dash"
        },
        "14112":{
            "author_id":"dragonknight52",
            "author_name":"Sybriss3",
            "choices":[
                "Go along quietly",
                "Cry!"
            ],
            "content":"<div class=\"\"><div> <span>A moment later a small purple baby dragon enters the scene. Spike looks like he was just woken from a nap from his expression and the way he rubbed his eyes.<br>\r\n<br>\r\nRainbow? What's with the yelling? He askes with a yawn. Then he notices you and his eyes widen. Um, Rainbow. Why do you have a foal with you?<br>\r\n<br>\r\nYou can hear the scowl in the mares voice as she responds. I found this little guy all by himself on a cloud! No parents, older siblings, baby sitter or even a diaper! Like some jerk just abandoned him!<br>\r\n<br>\r\nSpike gasped. That's horrible! I know. RD said patting your head. So I was wondering if Twilight had, I don't know, any records or something that can tell me who this little guy belongs to. I'm hoping that its just a mistake, or the little guy decided to go flying and got lost. She finished ruffling your hair a bit making you whine.<br>\r\n<br>\r\nThen her words clicked.<br>\r\n<br>\r\nThey thought you were an abandoned foal! <br>\r\n<br>\r\nThat wasn't right! You had to sort this out. <br>\r\n<br>\r\nAbah! You cover your mouth in shock. Mam-pthhbaa! A-gah bah! A hole seems ot open up in your stomich when you realise you couldn't talk. A few more attempts only gets you more infantile babbling, and a smile and head pat from RD. <br>\r\n<br>\r\nTalkative little guy arn't ya? She aske playfully before turnign back ot Spike completly unaware of your impending freakout. So yeah, can ya help me out?<br>\r\n<br>\r\nThe dragon scratche his head. I don't know. Probably but Twilight is probably your best bet. But she won't be back till this afternoon.<br>\r\n<br>\r\nThe mare shrugs. Ok, cool. I just gotta watch over this little guy till then. I can do that. She said sounding, not that confident. Was she afraid to look after you? Not that you needed it! You wern't a foal!<br>\r\n<br>\r\nSo yeah, I guess I better get this guy into a diaper. She said suddenly changing the subject. You got any from when you and Twilight babysit Spike? Your eyes widen at that. No way! You were not a foal and oyu didn't need diapers!<br>\r\n<br>\r\nI think its a little to late for that. Spike suddenly said pointing at you. You blink, and suddenly became aware of. No way! You couldn't have! You didn't even feel the need!<br>\r\n<br>\r\nAh man! Sorry Spike, I'll clean it up. RD said apologetically stepping away from the puddle growing around you. Something inside you snapped. You didn't know why or how but when you came to again you were crying, the high pitched wail of a very upset foal.<br>\r\n<br>\r\nTo her credit Rainbow sprung into action almost immedatly rocking you, and hiding her grimmace. Hey, its ok. No need ot cry. She said trying to sooth you. To everyones shock it worked and you wails became whimpers.<br>\r\n<br>\r\nThats better! Dash said fixing a smile. Ok Spike can oyu give this little guy a bath while i get this cleaned up and some supplies? Sure thing Rainbow. Spike said holding you at arms length as you were passed to him.<br>\r\n<br>\r\nCome on, lets get you a bath. He said walking away. The prismatic pegasus gives you a wave as you are carrid away.<br>\r\n<br>\r\nAs you get further away from Rainbow though you feel a sparp, almost pain in your chest as she gets further away. You<br>\r\n</span></div></div>",
            "created":1537881660,
            "id":2553586,
            "title":"Spike"
        },
        "15":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Alleyway",
                "House",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You slowly open your sleep filled eyes to examine your surroundings.</span></div></span></div>",
            "created":1374642000,
            "id":1633379,
            "title":"Other"
        },
        "151":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Cry",
                "Look for help"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You seem to be in the space between two houses. There is nopony around, and you feel an uncomfortable feeling in your stomach and throat. What do you do?</span></div></span></div>",
            "created":1374642000,
            "id":1633483,
            "title":"Alleyway"
        },
        "1511":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wail out for attention, hoping to attract somepony to your location. Are your screams of sorrow enough to get yourself noticed?</span></div></span></div>",
            "created":1374642000,
            "id":1633723,
            "title":"Cry"
        },
        "15111":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "DJ.",
                "Pastry chef."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Somepony walks up to you and picks you up. \"Now who would leave a perfectly good foal out here?\" She wondered. She carried you inside. You think you recognize her. She is the local...</span></div></span></div>",
            "created":1374728400,
            "id":1634064,
            "title":"Yes"
        },
        "151111":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Their arguing makes you cry.",
                "You have an accident."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Tavi! Come here!\" The mare yells. You hear a voice from the other room.<br>\r\n\"Did you find out what was making that racket?\" The voice asked. A grey earth pony entered the room. \"Vinyl, where did you find a baby?\" she sighed. <br>\r\n\"The alleyway.\" Your savior replied.<br>\r\n\"You can't keep him.\" Tavi stated. \"He probably has parents somewhere. And I don't think raves are very child friendly.\"<br>\r\n\"We'll figure out something...\" Vinyl said. \"We'll find a babysitter.\"<br>\r\n\"We can barely afford this crappy apartment. We can't afford a foal.\" </span></div></div>",
            "created":1374728400,
            "id":1634293,
            "title":"DJ."
        },
        "1511112":{
            "choices":[
                "Vinyl has a last second gig (Leaves you with Octy)",
                "Caller looking for Octavia"
            ],
            "content":"<div class=\"\"><div> <span>Midway through the two arguing <i>whether</i> you stay or not, you feel your diaper grow warmer. At the same time, you <i>notice</i> a foul stench in the air. By the time you realized what was happened, you begin to cry.<br>\r\n<br>\r\nVinyl is the first to respond. \"Aw, what's wrong?\" She says in a cute voice as she levitates you off the ground and into a cradle <i>hug</i> motion.<br>\r\n<br>\r\n\"Ugh!\" Octavia said as she covered her snout with her hoof. \"I think the problem is that he needs a change!\" She said with disgust.<br>\r\n<br>\r\nVinyl began to take a sniff and look at you. \"Geez. Aren't you a stinker?\"<br>\r\n<br>\r\nYou continue to cry as the diaper is causing discomfort.<br>\r\n<br>\r\nVinyl looked over to Octavia. \"Hey Octy. Those supplies we got for when we had to look after your little nephew. Where are they?\"<br>\r\n<br>\r\n\"In the bathroom.\" Octavia then began to trot out of the room. \"<i>Ugh</i>! I need air!\"<br>\r\n<br>\r\n\"Drama <i>queen</i>\" Vinyl said as she hovered you behind her as she trotted <i>you</i> to the bathroom. She opened a cabinet to find a few foal supplies. \"Ah here we go.\"<br>\r\n<br>\r\nShe then lays you onto the bathroom rug and lifts your hind legs. The tapes of your diaper then begin to glow blue as they are ripped of by Vinyl's magic. Your used diaper then ascends from the ground and Vinyl throws it in the trash.<br>\r\nYou begin to squirm a little but <i>Vinyl</i> holds you down with her magic as she wipes and powders your lower half.<br>\r\nYou then see her magic lift a fresh diaper from the package and it then wraps around you.<br>\r\n<br>\r\n\"There we go!\" She says as you levitate to her face. \"All better!\" She kisses your forehead and lays you on her back as she walks back to the living room.<br>\r\nShe sits on the couch and sets you on the carpet in front of her.<br>\r\n\"<i>We'll</i> figure out a way to keep you...\" She says. \"I know it...\"<br>\r\n<br>\r\nSuddenly the phone rings<br>\r\n<br>\r\n(Edit: Bro, learn to grammar)</span></div></div>",
            "created":1374728400,
            "id":1634344,
            "title":"You have an accident."
        },
        "15111121":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Bath time",
                "Dinner time"
            ],
            "content":"<div class=\"\"><div> <span>Vinyl picks up the phone. \"Oh my gosh, really? That's today? I'm kind of busy right now... Well for that much, I guess I can fill in for him. I'll be there soon.\" She hangs up the phone. \"Come here, little guy...\" She said, scooping you up with her magic. <br>\r\n\"Has the smell dissipated yet?\" Octavia asked, entering the room. <br>\r\n\"Yup.\" Vinyl replied. She dropped you on Octavia's back. \"See ya. I got a gig.\" She smirked, trotting off before Octavia could reply. Octavia sighed. <br>\r\n\"Well, I guess I'm stuck with you for the night.\"</span></div></div>",
            "created":1374814800,
            "id":1634585,
            "title":"Vinyl has a last second gig (Leaves you with Octy)"
        },
        "151111212":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "You have another accident. ",
                "Octavia brings you into the bathroom. "
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, now what can I feed you...\" Octavia wondered idly to herself. She began looking through cabinets until she found something. She pulled out a box of Mac and Cheese. \"A bit unrefined, but it'll work.\" She said. She turned to you. \"If you tell Vinyl that I'm eating this with you, you are getting such a spanking, you won't be able to sit for a week.\" She said, staring into your eyes, trying to intimidate you. Unfortunately, it works, and you begin to cry. Octavia sighed. Eventually she is able to calm you down and finish making dinner. You eat it quickly and manage to get it all over your face. Suddenly...</span></div></div>",
            "created":1374901200,
            "id":1635118,
            "title":"Dinner time"
        },
        "1511112121":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "She attempts to change you. ",
                "She can't handle the smell and leaves you for Vinyl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You notice the front of your diaper is now unusually warm, and all of a sudden, there is a lot less room in the back. \"Oh no...\" Octavia sighed, smelling what you just did. </span></div></span></div>",
            "created":1374901200,
            "id":1635119,
            "title":"You have another accident. "
        },
        "15111121211":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "She can do this.",
                "She can't do this. (Just leaves you there.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Octavia gags a bit, carrying you to the bathroom. She sets you down on the floor, getting out another diaper. Octavia untaped your diaper, gagging once more. \"I can do this. I can do this.\" Octavia repeated to herself. </span></div></span></div>",
            "created":1374901200,
            "id":1635122,
            "title":"She attempts to change you. "
        },
        "151111212112":{
            "choices":[
                "Try to change yourself",
                "Walk out of the bathroom without a diaper"
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh!\" Octavia said as she opened your diaper, receiving the full smell.<br>\r\nShe hacked and coughed as she quickly walked out of the bathroom, leaving you there.<br>\r\n<br>\r\nYou notice that all the supplies you need to change yourself are on the floor now.<br>\r\n</span></div></div>",
            "created":1376110800,
            "id":1643508,
            "title":"She can't do this. (Just leaves you there.)"
        },
        "1511112122":{
            "author_id":"megamatt215",
            "author_name":"Megamatt215",
            "choices":[
                "Gets a bath ready for you. ",
                "Tries to make you use the potty. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Octavia carries you on her back to the bathroom. She then...</span></div></span></div>",
            "created":1374901200,
            "id":1635120,
            "title":"Octavia brings you into the bathroom. "
        },
        "15112":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Ponies walking past",
                "Nopony"
            ],
            "content":"<div class=\"\"><div> <span>Minutes turn to hours as you desperately cry for help, but it's no use. Everypony is already asleep. Finally seeing the futility of your situation you slowly drift into a slumber, re-opening your eyes a little every once in a while to see if somepony came by.<br>\r\n<br>\r\nWhen you awoke you saw...</span></div></div>",
            "created":1374814800,
            "id":1634402,
            "title":"No"
        },
        "1512":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Somepony notices you",
                "You check your surroundings"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You move your tiny pony legs one after another towards the opening in the alley. When you get there...</span></div></span></div>",
            "created":1374642000,
            "id":1633725,
            "title":"Look for help"
        },
        "15122":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Sugarcube Corner",
                "Ponyville Library"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look around and see...</span></div></span></div>",
            "created":1374728400,
            "id":1634235,
            "title":"You check your surroundings"
        },
        "152":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Yours",
                "Mane 6",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are surrounded by walls and furniture. Everything is so big and intimidating. It's somepony's house! But whose?</span></div></span></div>",
            "created":1374642000,
            "id":1633493,
            "title":"House"
        },
        "1522":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Twiligh/Rarity",
                "Rainbow Dash/Fluttershy",
                "Pinkie Pie/Applejack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of the Mane 6's houses are you in?</span></div></span></div>",
            "created":1374987600,
            "id":1635438,
            "title":"Mane 6 House"
        },
        "15221":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Twilight's",
                "Rarity's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which unicorn's house are you in?</span></div></span></div>",
            "created":1374987600,
            "id":1635439,
            "title":"Twiligh/Rarity"
        },
        "15222":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Rainbow Dash's",
                "Fluttershy's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which pegasi's house are you in?</span></div></span></div>",
            "created":1374987600,
            "id":1635440,
            "title":"Rainbow Dash/Fluttershy"
        },
        "15223":{
            "author_id":"xremeidiot",
            "author_name":"Xreme",
            "choices":[
                "Pinkie Pie's",
                "Applejack's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which earth pony's house are you in?</span></div></span></div>",
            "created":1374987600,
            "id":1635441,
            "title":"Pinkie Pie/Applejack"
        }
    },
    "info":{
        "author_id":"megamatt215",
        "author_name":"Megamatt215",
        "brief_description":"You are a pony who has suddenly become a foal. What do you do?",
        "created":1354085280,
        "description":"<td align=\"left\" class=\"norm\">You are a resident of Ponyville who has (for mysterious reasons yet to be determined) been shrunk to the size of a foal. Who will take care of you? How did you get this way? Will you ever turn back?<br>\r\n<br>\r\n<b>RULES:<br>\r\n</b>1: Stick to Second Person Perspective. Don't use \"I\", use \"you\". <br>\r\n2: You are a baby. Deal with it. <br>\r\n3: Use proper grammar and spelling. No paragraph long run-on sentences. <br>\r\n4: Whoever takes care of you cannot be a pedophile. Please don't rape the baby.<br>\r\n5: The narrator must remain anonymous to the reader. The narrator is a non-specified pony. </td>",
        "id":1905787,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1552736640,
        "modified":1552736640,
        "pretty_title":"MLP Age Regression"
    }
}