{
    "chapters":{
        "1":{
            "author_id":"jgp1492",
            "author_name":"jgp1492",
            "choices":[
                "Tiny",
                "Normal size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First question, are you a tiny or a normal size boy?</span></div></span></div>",
            "created":1330146000,
            "id":1283727,
            "title":"Tiny or normal?"
        },
        "11":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "Young Child",
                "Pre-Teen",
                "Young Teen",
                "Older Teen / Young Adult",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now what age range are you in?</span></div></span></div>",
            "created":1334898000,
            "id":1319540,
            "title":"Tiny"
        },
        "111":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "9",
                "8",
                "Younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is your age?</span></div></span></div>",
            "created":1334937780,
            "id":1319547,
            "title":"Young Child"
        },
        "1113":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "7",
                "6",
                "5"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is your age?</span></div></span></div>",
            "created":1334937840,
            "id":1319548,
            "title":"Younger"
        },
        "112":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "12",
                "11",
                "10"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1334898000,
            "id":1319541,
            "title":"Pre-Teen"
        },
        "1123":{
            "author_id":"tinytopher",
            "author_name":"doglefox",
            "choices":[
                "Kaleb, a 12 year old looking for a new toy.",
                "Vince, a horny 14 year old who has a different kind of \"toy\" in mind.",
                "Alder, a 17 year old looking for a slave to do all of his work."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a tiny 10 year old boy, kept inside a cramped jar while you wait to be sold as a tiny slave.<br>\r\n<br>\r\nThe bell rings as a boy comes in, seeking to purchase a boy of his own...</span></div></span></div>",
            "created":1344223740,
            "id":1398598,
            "title":"10"
        },
        "11231":{
            "author_id":"tinytopher",
            "author_name":"doglefox",
            "choices":[
                "Make you play a game of chess against him... With a \"twist\".",
                "Put you in a model town and play \"hide and go seek\"."
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, Kaleb.\" the 17-year old shopkeeper says. \"What can I do for you?\"<br>\r\n<br>\r\n\"My last toy broke. Can I get a new one?\" Kaleb says, with no sympathy for the poor \"toys\" like you.<br>\r\n<br>\r\n\"That happens a lot with you, doesn't it? I'll tell you what. I'll make your next toy unbreakable, for only $10 extra!\" the shopkeeper said, grabbing a potion off the shelf from right next to you. The bottle had been labeled Immortality Potion. \"Is it a deal?\"<br>\r\n<br>\r\n\"Sure!\" Kaleb said, a youthful grin on his face.<br>\r\n<br>\r\n\"Now, just pick out a toy, any one you want!\" the giant shopkeeper said. \"We've got tiny boys from all across the multiverse!\"<br>\r\n<br>\r\nKaleb looked around the high fantasy-ish store, at all the jars of boys. Some were failing their arms, some were beating upon the glass walls, some were sobbing, and some were sitting in a fetal position having abandoned all hope. They all appeared to be from entirely different cultures and technological/magical levels.<br>\r\n<br>\r\nHis eyes then lock on you. \"What's that?\"<br>\r\n<br>\r\n\"This one?\" the shopkeeper says, taking down the jar. You bounce around painfully inside the glass chamber. \"This little guy is from Gearmesh, a universe of amazing magical artifacts powered by fire and water! He is incredibly smart and could do your homework for you if you want him to, you'd never have to lift a finger; just sit back and watch him struggle with the pen as he tries to lift it and write at the same time. And he's a bit unique; you see, most of these little guys give up any illusions of freedom after a few hours. But every once in a while, you come across one like this, who will never give in no matter what you do to them. Which is all the better for an unbreakable toy, because you can have so much fun punishing your disobedient little slave and he'll feel all the pain without ever getting injured! Great for relieving stress and satisfying urges of cruelty.\"<br>\r\n<br>\r\n\"Wow!\" Kaleb's eyes widen. \"Can I have him?\"<br>\r\n<br>\r\n\"You're a loyal customer, so I'll give him to you for 10 cents.\"<br>\r\n<br>\r\n\"Deal!\" the boy says, taking some coins out of his purse.<br>\r\n<br>\r\nYou're horrified at what you're hearing. He just sold you for 10 cents! That's all you're worth to these giants!<br>\r\n<br>\r\nKaleb hands over the money, and the shopkeeper opens the cork on the potion. He then unscrews the lid on your jar, and a heavy torrent of liquid pours down upon you. You try to swim upwards to get air, but then the jar is closed again, full to the brim with the potion. You struggle for air, beating on the lid in vain. Suddenly, your world is rocked as the shopkeeper shakes the jar vigorously. Just when you think you're going to drown, you let a lungful of water in and find you don't need to breathe.<br>\r\n<br>\r\nThe shopkeeper opens the lid and pours the potion into a bucket through a strainer so you can't escape. He turns the jar open end up again and screws the lid on tight. \"Here you go, Kaleb. Enjoy your new toy!\"<br>\r\n<br>\r\n\"I sure will!\" Kaleb says. He leaves the shop and hurries home. When he gets there, he decides to...</span></div></div>",
            "created":1344227100,
            "id":1398620,
            "title":"Kaleb, a 12 year old looking for a new toy."
        },
        "11232":{
            "author_id":"tinytopher",
            "author_name":"doglefox",
            "choices":[
                "Unscrewed the jar lid and puts his dick inside.",
                "Lets you out and commands you to make him cum."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Vince! What can I do for you?\" the shopkeeper asks.<br>\r\n<br>\r\n\"I- oh... -I'm, uh... I have some 'needs'... Oooh...that I need taken care of.\" Vince said, obviously in sexual frustration. \"Got any toys that can take care of my boyhood?\"<br>\r\n<br>\r\n\"Plenty. Got anything special in mind?\" the shopkeeper said.<br>\r\n<br>\r\n\"I need something eager to please, but- ohhh... -I also kind of want something that contradicts that...\" Vince moaned from his blue balls. \"I want a toy that dislikes me and everything I do to it, a toy that hates my guts, yet it also wants to satisfy it's master by pleasuring me at it's own expense.\"<br>\r\n<br>\r\n\"Hmm... That's a pretty tall order...\" the shopkeeper said. \"But I think I know just the thing. As you know, we get our toys from other universes where boys are much smaller and inferior to ourselves...\"<br>\r\n<br>\r\nHe takes down your jar, causing you to be bounced around painfully. \"This little guy comes from Tronic, a world where buildings are aglow with tamed lightning and people can talk from anywhere to anyone anywhere else.\" the shopkeeper explains. \"He doesn't know it yet, but he's exactly what you're looking for. A toy who seeks to demean itself to pleasure he who it hates most.\"<br>\r\n<br>\r\n\"I'll- Oooooh... I'll take him, just hurry...\" Vince said, shivering in arousal.<br>\r\n<br>\r\n\"Now, now...\" the shopkeeper said. \"I'm not quite doing so good in business. Normally that means I have to be competitive, but you are obviously desperate for release. And this boy is from a universe much like ours, where boys never grow into those ugly \"men\" you sometimes hear of. That's a rare quality out in the multiverse...\"<br>\r\n<br>\r\n\"Please... I NEED that toy...\" Vince said in agony.<br>\r\n<br>\r\n\"50 bucks.\" the shopkeeper said.<br>\r\n<br>\r\n\"But-\"<br>\r\n<br>\r\n\"100 bucks. Want me to double it again?\"<br>\r\n<br>\r\nVince groaned, and took a slip of green paper out of his coin purse and handed it to the shopkeeper, his other hand in his pants to fondle his genitals.<br>\r\n<br>\r\n\"Pleasure doing business.\" the shopkeeper said, and handed the jar containing you to Vince.<br>\r\n<br>\r\nVince ran home, a boner tenting his trousers, but he didn't care if any other boys saw it so long as he could climax sooner. When he got home, he...</span></div></div>",
            "created":1344228600,
            "id":1398633,
            "title":"Vince, a horny 14 year old..."
        },
        "113":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "13",
                "14",
                "15"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is your age?</span></div></span></div>",
            "created":1334898000,
            "id":1319542,
            "title":"Young Teen"
        },
        "1132":{
            "author_id":"chido3000",
            "author_name":"BeningZeus343",
            "choices":[
                "10",
                "14",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You are in a cage as a small human pet sale, your name is Frank, you are a boy with blond hair and a thin body, the last thing you remember is that you walked straight to your school house on the way you saw a store with no name but There was a sign that said selling small humans but you ignored it but then you felt dizzy and fell faint, after waking this step! You look for answers to your questions but your thoughts are interrupted when you hear that the door opened revealing a boy from ....</span></div></div>",
            "created":1496620260,
            "id":2331042,
            "title":"Shop!"
        },
        "11322":{
            "author_id":"chido3000",
            "author_name":"BeningZeus343",
            "choices":[
                "Watch TV",
                "Go to the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>A 14-year-old boy walks past the door waving to the shop owner, it's very strange, he has a cloak that covers everything and a black top hat, the young man says \"Hello, sir or madam? Is it true that they sell small humans here as pets legally?\" The gentleman answers with a very old voice \"Of course that if I sell youngsters of all ages for all ages, which you would like to buy, I sell them at a very low price and you I promise, it's legal\".<br>\r\n \"Well, that's enough for me, sir, I'll see which one I'll take\". The boy decides which one to pick until he takes a look at him (Luckily you have your underpants) and he says \"Sir I'll take this looks very interesting and also Is my age for what I see\". then picks up your cage and takes it to the counter next to the mysterious man (it will be 10 dollars young) (here is good sir) then he picks you up with the cage and leaves the store with you with a Fits over your cage.<br>\r\n<br>\r\nOn the way you have tremors for the reason that the boy is running, you say to yourself \"Oh I hope he can help me out of this problem\". You hear a door open, it must be the door of the boy's house, after 1 minute the savannah rises revealing the face of the boy smiling, he gets you and says \"Hello little do not be scared, I will not hurt you, I will buy you as a friend not as a pet\". <br>\r\nYou watch the young man and notes that he has an attractive Flashy, has black hair, big eyebrows and wide head with black eyes wearing a red shirt with blue shorts and some black tennis with red with white socks, you say <br>\r\n\"Why did you buy me and how do I get there?\" \"How did you come this way but I bought you because I needed a friend smaller than me to have fun with me, ah my name is Gerardo\". \"Well my name is Frank but that does not matter you must help me out of this situation please\". \"I know this is new for you but you I'll help you get back to normal if we become friends\".<br>\r\n<br>\r\nYou think better the situation, may be the last time you go through this, you only live once, you say \"Well now I think it better is great to be small and have someone like a giant friend, if I accept\". \"I promise I will not hurt you\". he picks you up with your 1 inch size, he tells you \"Well what do you want to do first?\" ...</span></div></div>",
            "created":1496624580,
            "id":2331063,
            "title":"Buy"
        },
        "113221":{
            "author_id":"chido3000",
            "author_name":"BeningZeus343",
            "choices":[
                "Go to your feet",
                "Go to the fritters"
            ],
            "content":"<div class=\"\"><div> <span>You answer \"Do you think if we watch TV?\" \"Agree\". then he takes you carefully in his hand to the living room of your house he teaches that his room has a TV, a sofa and a small piece of furniture in front of the sofa; Gerardo leaves you on your couch and goes to the kitchen, after 2 minutes he comes back with a plate full of fried foods, he says in a low voice \"You think my room\" \"Very nice and comfortable\". He says sitting next to you slowly \"Here you have little Frank\" \"Thank you!\" You shout at him.<br>\r\n<br>\r\nGerardo turns on the TV to see caricatures and then he takes off his sneakers to put his feet on the furniture and show his feet with socks, what do you decide to do?</span></div></div>",
            "created":1496629140,
            "id":2331091,
            "title":"Watch TV"
        },
        "114":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "16",
                "17",
                "Older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is your age?</span></div></span></div>",
            "created":1334898000,
            "id":1319543,
            "title":"Older Teen / Young Adult"
        },
        "1141":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "This story",
                "Another story"
            ],
            "content":"<div class=\"\"><div> <span>You are an ordinary 16 year old boy who goes to school. You have a dream to go to college, but it needs money. For a long time you saved them, and very little remained. But yesterday everything changed.<br>\r\n<br>\r\nYou walked down the hall to a lesson when suddenly you were grabbed by the hand. It was John a 17 year old bully and his gang.<br>\r\n“You haven't paid us for a long time, fagot,” said Sam, “a disgusting 14 year old badass.”<br>\r\n“I will pay, I promise,” you said, backing away to end the conversation.<br>\r\n- We're tired of waiting. Sam hit you in the face. It was very humiliating to receive a blow from a boy who was younger than you, but you could do nothing. Behind Sam stood tall and strong guys.<br>\r\n<br>\r\n“Better pay tomorrow,” John finished the conversation. They pushed you, so you fell and they left.<br>\r\n<br>\r\nThis is unfair. You almost saved up money. You can't give them away just like that. On the other hand, this gang will not lag behind you. Even if you don’t appear at school sooner or later they will beat you on the street. It was necessary to figure out how to disappear so that no one could find you. You should have thought about it.<br>\r\n<br>\r\nIn thought while walking around the school, you suddenly noticed an advertising poster. It depicted a boy lying on a couch, pushing forward his large dirty barefeet. Next to the heel was a naked tiny guy who licked clean giant boy's foot. One could guess about this, since in the place where the tiny slave was, the heel was clean and shiny. It was an advertisement tiny slaves for boys. They became slaves because of poor grades and bad behavior. But not for the whole life of course. It was a form of punishment, after which you returned to normal. But before returning, you experienced bullying and humiliation. You could become a slave voluntarily. In this case, you were paid for your \"work\". This option was used when there was no money.<br>\r\n<br>\r\nA thought arose in your head, but you immediately rejected it. But she came back time after time and by the end of the day you were already looking for the stories of guys who were tiny slaves. You came to the conclusion that this is the only right decision. So you save money and earn more. You should be just enough to transfer to college right after that.</span></div></div>",
            "created":1571669940,
            "id":2736270,
            "title":"voluntary slave"
        },
        "11411":{
            "author_id":"bofig",
            "author_name":"Riwert",
            "choices":[
                "His older brother shrinks you",
                "The boy shrinks you"
            ],
            "content":"<div class=\"\"><div> <span>In the evening you went to the address. You were hiding from passers-by because you didn’t want them to know where you were going. When you entered the building you saw a line of five guys. They did not want to be slaves, they wanted to GET slaves. Most people come to this place to buy a tiny boy for a certain time. Or get for some merit. <br>\r\n<br>\r\nThe second boy in the series was Charlie. He was 13 years old. By his age, he managed to win two inter-school karate tours. His school almost every two months allocated the right to free footlicker. And he willingly used it. He liked to humiliate someone older under his foot. And his sole was dirty and sweaty after every workout. With a shudder, you thought you might be under the heel of an equally cruel youngster. <br>\r\n<br>\r\nThe last in line was Steve, a 15-year-old student from a parallel class. He was interested in sociology and especially educational reforms regarding reduction and slavery. His school project was supposed to evaluate (but actually confirm the success) of such a method. To do this, he needed several slaves. Of course, humiliation was part of the experiment. You even heard that Steve doesn’t wash his feet on purpose and uses old socks to stockpile dirt and sweat.<br>\r\nThey all sat in the right room, the left was intended for those who wanted to be a slave. You understood that if you go there now they will notice you and then rumors can go about you. So you sat down with them and waited for them all to leave. After Steve left you very hesitantly headed for the left room. There was an old door in front of you. Very nervous, you opened it. A boy of 14 years old with short brown hair was sitting at the table. He was looking at the screen of a smartphone. He stared at you in surprise.<br>\r\n-Get slaves in the room opposite. - he said.<br>\r\n“I know ... I ... I ... volunteer ...” you mumbled softly, but he heard everything and smiled joyfully childishly.<br>\r\n-O MY .. SO YOU ... Cool .. So you're a voluntary slave.<br>\r\nSo don’t leave. You are ours now. - He spoke quickly, although you did not try to leave.<br>\r\nHe quickly went to the shelf with documents. You noticed that he had no shoes and socks, although the floor was dirty. STOP. Why do you think about the feet too much. It seems you are already subconsciously trying to prepare for humiliation.<br>\r\nThe boy with a perky look asked you several questions (Name, Surname, age, reason, and so on.) All these data were secret, the real identity of the slave was impossible to find out.<br>\r\n-OK it's all over Now. Still cool. Oh, why aren't all the guys so brave. - He suddenly carefully looked at you, squinting his eyes.<br>\r\n“You like feet, don't you?” - he asked.<br>\r\n-No. I don’t like sniffing and kissing the boys feet.<br>\r\n-I do not think so. But even if so, then you cannot survive in your new life.<br>\r\n-This is not life. I just need money and I want to earn extra money.<br>\r\n-As my brother says, a tiny slave is not a profession, but a life. He himself was a slave. Believe me, you will need a love of smell and sweat. Okay, let's go down. - and he led you deep into the building.</span></div></div>",
            "created":1573490400,
            "id":2745300,
            "title":"Where do the losers go"
        },
        "115":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about adult?</span></div></span></div>",
            "created":1386775680,
            "id":1706266,
            "title":"Other"
        },
        "1151":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "21",
                "30",
                "45"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how old are you?</span></div></span></div>",
            "created":1579192200,
            "id":2774497,
            "title":"the legal age"
        },
        "12":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "Young Child",
                "Pre-Teen",
                "Young Teen",
                "Older Teen / Young Adult",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now what age range are you in?</span></div></span></div>",
            "created":1334898000,
            "id":1319523,
            "title":"Normal size"
        },
        "121":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "9",
                "8",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1334898000,
            "id":1319531,
            "title":"Young Child"
        },
        "1213":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "7",
                "6",
                "5"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1334898000,
            "id":1319532,
            "title":"Other"
        },
        "122":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "12",
                "11",
                "10"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1334898000,
            "id":1319529,
            "title":"Pre-Teen"
        },
        "123":{
            "author_id":"sleipmon",
            "author_name":"Jotunheim",
            "choices":[
                "13",
                "14",
                "15"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is your age?</span></div></span></div>",
            "created":1334898000,
            "id":1319524,
            "title":"Young Teen"
        },
        "124":{
            "author_id":"jgp1492",
            "author_name":"jgp1492",
            "choices":[
                "16",
                "17"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old are you?</span></div></span></div>",
            "created":1336719660,
            "id":1334369,
            "title":"Older Teen / Young Adult"
        },
        "125":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Sure",
                "nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about adult?</span></div></span></div>",
            "created":1386775500,
            "id":1706264,
            "title":"Other?"
        },
        "1252":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay.. senior?</span></div></span></div>",
            "created":1386775560,
            "id":1706265,
            "title":"nah"
        }
    },
    "info":{
        "author_id":"jgp1492",
        "author_name":"jgp1492",
        "brief_description":"You are either a tiny or a normal size boy and you get sold or buy and exchange tiny boys",
        "created":1330156020,
        "description":"<td align=\"left\" class=\"norm\">You are either a normal sized boy, show goes shopping for tiny boys, or sell your old one's to the shop, or exchange him for a new one.Or a tiny boy about to be sold, to a boy or back to the shop, or to be exchanged for a new tiny boy.<br>\r\n<br>\r\nNO GIRLS<br>\r\nAge limit is 5 and 18</td>",
        "id":1850536,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579192200,
        "modified":1579192200,
        "pretty_title":"Buy,Sell and Exchange"
    }
}