{
    "chapters":{
        "1":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Legendary",
                "Epic",
                "Rare",
                "Uncommon",
                "Battle Pass"
            ],
            "content":"<div class=\"\"><div> <span>“Yawn!” You had a pretty exhausting day. Work or school, it didn’t matter. They take too long and you pray they would be over quickly. They won’t and they eat up your hours. At least your job got you money to buy all your skins. Your parents don’t like the idea of you using your money on Fortnite but leaves you alone for now.<br>\r\n<br>\r\nYou sit down in your comfy chair and ready up Fortnite. Fortnite is great! It’s the one game you are ok with dying a lot. Well, it would be nice actually killing people. But you have gotten a lot better since you started.<br>\r\n<br>\r\nFortnite took a little to actually start up. It needed an update and it was a big one. The biggest you’ve seen too. You groan and took out your iPad and watch some Ninja streaming with IAmWildcat to pass the time.<br>\r\n<br>\r\nAfter 30 minutes, the game finally started. “Finally.” You said. You click Battle Royale and watch the loading screen. You wonder what you should try. You could contact your friends for some Duo’s or Squads. You know they would be happy to do that. Or you might Solo it first, remember the controls and stretch out those muscle memories.<br>\r\n<br>\r\nFortnite logs into the main menu. You look over and notice your character. Huh, why are you using the default skin? Oh, right. Your friends wanted to trick players yesterday by using the default skin, making them think they were totally noobs. It back fire, as it only made the other players more bold. Still fun though.<br>\r\n<br>\r\nYou look over the main menu and went to modes. You are going to need to switch from squads to Solo first. Click it, you notice additional modes. Smut’s Playground? What?<br>\r\n<br>\r\nPerplex by the lewd name, you look over the description. “Eliminate... blah blah...” It seems like a normal mode but clearly different.<br>\r\n<br>\r\nExcited by the surprise mode, you know you can’t wait to try it. But, before you do, you got to switch from the default skin. You go to your locker and you pick...</span></div></div>",
            "created":1531112400,
            "id":2516724,
            "title":"Fortnite: Battle Royale"
        },
        "11":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Red Knight",
                "Cuddle Team Leader",
                "Power Chord",
                "Triceratops Ops",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let’s use some Legenary skins. Show those other players how long you been playing! :3</span></div></span></div>",
            "created":1531112400,
            "id":2516728,
            "title":"Legendary"
        },
        "112":{
            "author_id":"iloveisabelle",
            "author_name":"Reader",
            "choices":[
                "You wake up in the final circle, you see Panda's foot hover above you.",
                "You wake up in darkness, you have no idea where you are."
            ],
            "content":"<div class=\"\"><div> <span>You decided to choose the Cuddle Team Leader, she is a very cute skin, pink fur, bowtie on the back. You decided to land at Snobby Shores, since almost no one lands there. You had just hoped to get an easy win. You hear footsteps above you, and carefully walk upstairs, you look up to see a Panda Team Leader aiming a some sort of ray gun at you! \"Aww, well if it isn't the cute little teddy bear... trying to eliminate me, I see?\" Little teddy bear? What's she talking about? Before you had a moment to ask, she shot you with what seems to be a shrink ray, because before you knew it, she had you in her hands, ready to play. She held you tightly, making sure you couldn't escape, you struggled in attempts to break free. \"Aww, don't worry little bear! I'll keep you safe!\" She patted you on the head softly. Strange, you expected her to kill you, not befriend you! You looked up at her with a trusting smile, and she smiled back! But this was no ordinary smile, this was an evil smile. She placed you down onto the floor, then softly smushed you under her ass. \"You like that, little teddy bear?\" She wiggled her enormous ass harder into the ground, it was starting to hurt. \"Aww, I hope I'm not being too rough for the little teddy bear!\" She chuckled, you though she didn't really care, but she finally got up off you. She looked down at you, smiling. You waved up at her shyly. You were just a mere bug compared to her, so small and innocent, but you could tell she loved you. \"Aww, you're so cute and innocent, I love it!\" She picked you up and stuffed you into her breasts, you blushed and felt her soft, warm fur against your body. And with that, you had fell asleep.<br>\r\n<br>\r\n(Sorry for making this so long until you can choose options! I'm actually typing this on mobile, and I'm fairly new to this website. I'll add more tomorrow on PC!</span></div></div>",
            "created":1538889060,
            "id":2560222,
            "title":"The Panda and the Bear"
        },
        "115":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Ravage",
                "P.A.N.D.A. Team Leader",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Those skins not to your liking? Try these!</span></div></span></div>",
            "created":1553474040,
            "id":2634336,
            "title":"More Legendaries"
        },
        "12":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Bunny Brawler",
                "Shadow Ops",
                "Ginger Gunner",
                "Mogul Master",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You got some pretty good-looking Epic skins to try out. Let’s see how they feel.</span></div></span></div>",
            "created":1531112400,
            "id":2516731,
            "title":"Epic"
        },
        "125":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Fable",
                "Scourge",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Scrolling... Scrolling...</span></div></span></div>",
            "created":1553474280,
            "id":2634337,
            "title":"More Epics?!"
        },
        "13":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Survival Specialist",
                "Recon Specialist",
                "Triple Threat",
                "Chromium",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Rare is a great start! There are many ways they can be used. For this new mode, it’s best to wet your feet a bit.</span></div></span></div>",
            "created":1531112400,
            "id":2516735,
            "title":"Rare"
        },
        "135":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "Skull Ranger",
                "Royal Knight",
                "Maki Master",
                "Dynamo",
                "More Rare Skins"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these Rare skins?</span></div></span></div>",
            "created":1573069860,
            "id":2743131,
            "title":"More"
        },
        "14":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Renegade",
                "Nog Ops",
                "Sgt Green Clover",
                "Nitelite",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>... ok. You are actually wiser with your money then your parents believe. Ok, so you don’t look cool but who cares? What is important is the game and the game play. Right?</span></div></span></div>",
            "created":1531112400,
            "id":2516736,
            "title":"Uncommon"
        },
        "15":{
            "author_id":"maria777",
            "author_name":"Maria777",
            "choices":[
                "Royale Knight",
                "Moonwalker",
                "Elite Agent",
                "Zoey",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You worked hard on your Battle Pass. So many grueling hours and deaths got you these skins. Be proud and show them off to the world!</span></div></span></div>",
            "created":1531112400,
            "id":2516739,
            "title":"Battle Pass"
        },
        "153":{
            "author_id":"versity",
            "author_name":"Versity",
            "choices":[
                "Land at Loot Lake",
                "Land at Retail Row",
                "Land at Lucky Landing"
            ],
            "content":"<div class=\"\"><div> <span>You pick Elite Agent. It's one of your favourite skins after all. Then you start the new game mode. You didn't even noticed that this game mode is female only. Loading... loading... then it finally starts but you notice something weird. Every character has underwear and not his normal outfit. But you thing that it's quite sexy. Finally the match begins! but where do you want to land?</span></div></div>",
            "created":1587912720,
            "id":2824955,
            "title":"Elite Agent"
        },
        "1532":{
            "author_id":"versity",
            "author_name":"Versity",
            "choices":[
                "Go to Tilted Towers",
                "Try to find a Bush and camp",
                "More?"
            ],
            "content":"<div class=\"\"><div> <span>You decide to land in Retail Row. It's a famous and good place to go to. You land at one of the shops and look for a  chest. After a couple seconds you'll eventually find one and open it. But what is that? Instead of getting a weapon and some Shield potions you get a... weird looking sniper rifle? You decide to take it and leave the building. After two minutes you see a defauld in the distance. You take out your sniper and aim for his head. PENG! You shoot and hit his head but what's this? Instead of killing him  his head blows up, and suddendly explodes. Weird. Where do you want to go next?</span></div></div>",
            "created":1587918120,
            "id":2825028,
            "title":"Land at Retail Row"
        },
        "15321":{
            "author_id":"versity",
            "author_name":"Versity",
            "choices":[
                "Try to eliminate more opponents",
                "Keep going to Tilted Towers"
            ],
            "content":"<div class=\"\"><div> <span>You have a feeling that something happened in Tilted Towers so you decide to go there. In the way there you remember the default from earlier because since you eliminated him you feel a bit strange. On the way to Tilted you make a stop at Loot Lake because you are thirsty. But the moment you wanted to have a drink and saw your mirror you screamed. You realized that your breasts got bigger. Instead of a B Cup you had a nice pair of C Cups. But that's not all because your lips got also a little bit bigger and applied a little bit pink lipstick. What do you want to do now?</span></div></div>",
            "created":1587923820,
            "id":2825077,
            "title":"Go to Tilted Towers"
        },
        "153211":{
            "author_id":"versity",
            "author_name":"Versity",
            "choices":[
                "Go to the save zone ",
                "Try to find a plane"
            ],
            "content":"<div class=\"\"><div> <span>You want to know what happens when you make more kills so you run to the nearest house take a trap that you got from the default   out of your backpack and place it up behind the door so no one can see it. After ten minutes you get a message that you eliminated someone with your trap. You are about to dance because he run into your trap when you feel that your underwear feels a bit tight. You quickly look down to your underwear when you realize that your butt got bigger and again your lips. First you looked like a random girl but now you are  a little bombshell. But then you see the storm coming and quickly move on...</span></div></div>",
            "created":1587925500,
            "id":2825111,
            "title":"Try to eliminate more opponents"
        },
        "15323":{
            "author_id":"versity",
            "author_name":"Versity",
            "choices":[
                "Search for more Chests",
                "Eliminate yourself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have something else in mind?</span></div></span></div>",
            "created":1587918300,
            "id":2825029,
            "title":"More?"
        },
        "155":{
            "author_id":"timmysmomsgas",
            "author_name":"Timmys Mom's Gas",
            "choices":[
                "Teknique",
                "More",
                "Redline"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe not them... What if you instead used...</span></div></span></div>",
            "created":1534568400,
            "id":2535280,
            "title":"More"
        },
        "1552":{
            "author_id":"timmysmomsgas",
            "author_name":"Timmys Mom's Gas",
            "choices":[
                "Sun Strider",
                "Rook",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe feeling the life guard?<br>\r\n<br>\r\nOr a teacher?</span></div></span></div>",
            "created":1534568400,
            "id":2535281,
            "title":"More"
        },
        "15523":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Calamity",
                "Dire",
                "Or..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a vampire-hunting cowgirl?  Or a werewolf?</span></div></span></div>",
            "created":1548888060,
            "id":2609984,
            "title":"More"
        },
        "155232":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Tilted Towers",
                "Polar Peak",
                "Paradise Palms"
            ],
            "content":"<div class=\"\"><div> <span>\t\"GGgrrr.  Good choice,\" Dire said as you selected him.<br>\r\n<br>\r\n\tYou blinked.  \"What the...\" Curious, you have Dire do some of the dances.  He did them as normal, although now he made comments as he did them.  <br>\r\n<br>\r\n\tFloss: \"I floss every day after EATING SOMEONE...\" <br>\r\n<br>\r\n\tTrue Heart: \"I feel damn silly... and yet so pretty...\" <br>\r\n<br>\r\n\tDisco: \"Disco is as dead as my enemies are when I'm done with them.\"  <br>\r\n<br>\r\n\tOrange Justice: \"Good way to work off the fat after I digest someone.\"  <br>\r\n<br>\r\n\tYou shake your head, making a WTF gesture at the screen.  After a moment, though, you realize something.  \"Holy hell... They've made the skins actual characters now...\"  You grin.  This would make the game more interesting, to see how the characters interact.  Making yourself more comfortable on your seat, you do some more changing of your loadout.  You give him his normal back bling, the katana, and decide to just give him the vampire set's glider (a giant bat), pickaxe (a silver pickaxe with purple gems in the shake of a bat), and landing contrail (energy bats flowing from his limbs).  You ready up, eager to see what would happen.<br>\r\n<br>\r\n\tThere was the usual readyup on the island as players joined, no special interactions.  When you got into the Battle Bus, though, things were different again.<br>\r\n<br>\r\n\tYou had a third person view of Dire as he sat on the seats of the bus.  All the various characters were around him, a Valor sitting next to him.  You could access the map to mark your spot, but the view was only the inside of the bus.  The characters were all chatting idly, inaudble to the players.  Sometimes, a character would get up and run to the back of the bus, jumping out with an excited cry, sometimes accompanied by the cheer of a pet if they were wearing one as a back bling.  <br>\r\n<br>\r\n\tAfter a few moments of watching this, you decided to jump out, having decided where you wanted to go.  </span></div></div>",
            "created":1548891420,
            "id":2610019,
            "title":"Dire"
        },
        "1552321":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Finisher",
                "Mercy",
                "Violate"
            ],
            "content":"<div class=\"\"><div> <span>\tYou decided to go to Tilted Towers, that everpresent city that always lost the same building in every new season.  With a snarl, Dire leaped off of the bus, diving towards the city.  Since you were right above the city when you left, you went straight down, popping the glider and heading towards the roof of a building you saw had a blue-ranked assault rifle on it.  You looked behind you, seeing a Triple Threat coming down on her basketball hoop-shaped glider.  Quickly steerign yourself towards the gun, you drop down closest to it and grab it.<br>\r\n<br>\r\n\t\"The hunt begins!\" Dire declared.  The Triple Threat landed near you a moment later and started chasing after you, swinging her basketball hoop-shaped pickaxe.  You kept backing away, jumping and firing, and eventually finished off the basketball player.  <br>\r\n<br>\r\n\tExcept instead of vanishing, she fell to her hands and knees.  Which wouldn't have been unusual, since that was the normal down position, but this was a solo mode.  People didn't go down in solos, they just vanished, a device appearing and reabsorbing them.  <br>\r\n<br>\r\n\t\"What the heck?\" you muttered.  You approach the Triple Threat, who was crawling around aimlessly on the roof, from her head, and to your surprise an action command appeared.  <br>\r\n<br>\r\n\tFinisher.<br>\r\n<br>\r\n\tConfused, you backed off.  You followed the Triple Threat around some more, approaching her from the side this time.  You got a new action command now.  <br>\r\n<br>\r\n\tMercy.<br>\r\n<br>\r\n\t\"...\" Approaching her from either the right or left side got the Mercy command.  Confused beyond all measure, you approach Triple Threat from her butt.  A third action command, one that sent chills down your spine.<br>\r\n<br>\r\n\tViolate.<br>\r\n<br>\r\n\t\"Smut's Playground,\" you say, remembering the mode.  You look around, checking out the other fights.  On a nearby rooftop, a Royale Knight (a female knight and one of the earliest skins) knocked down a Leviathan (an alien fish in a goldfish-bowl head with a robotic body).  Royale Knight approached the downed alien fish from the head, and after a moment, whipped out a broadsword that wasn't on her character model normally.  She brought it down HARD on Leviathan's head, impaling the fish through completely.  You gasped as you saw Leviathan squirming in pain, and then slump over... The elimination device appeared and collection Leviathan's body as Royale Knight let out a triumphant cry, raising her sword, and then going back to holding the double pistols she had used to knock down Leviathan.<br>\r\n<br>\r\n\tYou looked down at the ground, hearing the sound of explosions.  Part of the wall of the building you were standing on had broken down.  You spotted a Redline (helmeted racer girl) having knocked down a Sushi Master (a literal sushi chef).  She approached him from the side, and after a moment, holstered her rocket launcher, leaning down and helping Sushi Master up.  You could hear Redline's dialogue.  <br>\r\n<br>\r\n\t\"You aren't done yet, are you?\" she said.  \"Let's ride together this time.\"  Sushi Master and Redline then went off to attack more players.  <br>\r\n<br>\r\n\t\"What the heck...\" you muttered.  Scanning around, you saw someone take the final option on the rooftop of a higher building.  It was a Heidi (a girl in leiderhosen and a revealing dress), having just defeated a Jonesy (blonde white male default skin).  She approached him from behind, and after a moment, roughly flipped him over and yanked his pants down.  She fondled him to erection, and pulled off her own panties, mounting him, keeping a pistol trained on his face.  A Ramirez (female Latina default skin) tried to shoot them both, but her bullets passed through them.  The Ramirez after a moment decided to just move on.  <br>\r\n<br>\r\n\tYour eye twitched nervously, and you began to giggle.  \"Okay!  Um... Starting to understand this mode...\" You looked back to the Triple Threat, the female basketball player still crawling around the roof.  Honestly, you were uncomfortable.  But you couldn't just leave her.  You thought about just shooting her to finish her off... but you were too curious about the finishers.  You were wondering what Dire would do if you had him use them...</span></div></div>",
            "created":1551486420,
            "id":2625029,
            "title":"Tilted Towers"
        },
        "15523213":{
            "author_id":"timmysmomsgas",
            "author_name":"Timmys Mom's Gas",
            "choices":[
                "Something else happens",
                "You finish"
            ],
            "content":"<div class=\"\"><div> <span>After having approached the Triple Threat from behind, you take this chance to see what violate does to the downed opponent, not that you had a lot of time to decide, her downed health was fading fast. As you preform the violate action, you kneel behind her and yank down her shorts. And before your very eyes, dire starts eating triple threat's ass</span></div></div>",
            "created":1560063720,
            "id":2670670,
            "title":"Violate"
        },
        "155233":{
            "author_id":"mysterio",
            "author_name":"FFtheSnake",
            "choices":[
                "Zenith",
                "Lynx",
                "Or..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe someone from the season 7 pass...  The mountain climber or the high tech catgirl?</span></div></span></div>",
            "created":1548888120,
            "id":2609986,
            "title":"Or..."
        },
        "1552333":{
            "author_id":"timmysmomsgas",
            "author_name":"Timmys Mom's Gas",
            "choices":[
                "Rox",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe the new season 9's Rox? She's thicc</span></div></span></div>",
            "created":1558816440,
            "id":2664066,
            "title":"Or..."
        }
    },
    "info":{
        "author_id":"maria777",
        "author_name":"Maria777",
        "brief_description":"Oh! The lastest update has a new mode. Let’s check it out! (Cover image by bungee-gumu)",
        "created":1531119300,
        "description":"<td align=\"left\" class=\"norm\">You had a long day. It’s another day doing mundane school or work. The repetitiveness can get to you hard some days. But now you are home and you can finally play Fortnite: Battle Royale. Sure, there is a zombie mode but you don’t care about that. You rather drop into a map with 99 different people and come out as the last one standing.<br>\r\n<br>\r\nBut... what is this? A new mode? Smut’s playground? “Eliminate your way to the end.” Solo, duo, or squad. Well, it’s worth checking out. Let’s go!!<br>\r\n<br>\r\n<u><i>Ok, a few things:</i></u><br>\r\n<br>\r\nThis is a lewd interactive of the game, Fornite. Specifically, Battle Royale. In the game, 100 people flies down and kill each other till the last one is standing. That’s going to be pretty much the same but the lewdness is crank all the way up.<br>\r\n<br>\r\nInstead of killing, it’s even elimination. It can involve killing but sex could also use other methods. Basically, use your imagination. 😉 I pretty much allow anything, including Sex, Vore, weight gain, growing gigantic, shrinking, objectification, and... scat. Pretty much everything except Gore.<br>\r\n<br>\r\n<u><i>One more thing:</i></u><br>\r\n<br>\r\nWhen you die, that doesn’t mean the end of the interactive. Fornite is a video game and there is a player. Story begins solo, but after the player dies, or elimated, the player can come back in. Or play with friends, Duo or Squads.<br>\r\n<br>\r\nIf there is more things to clarify, I’ll put it in later. I hope you enjoy and get freaky! XD</td>",
        "id":2163106,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1587921913/item_id/2163106.jpeg",
        "last_full_update":1587925500,
        "modified":1587925500,
        "pretty_title":"Fortnite: Smutty Royale "
    }
}