{
    "chapters":{
        "1":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "She is being fed",
                "watching tv",
                "playing with Marley",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Let me give you a better description of the story and its charactors.<br>\r\n<br>\r\nthe sisters who is fattening name is Jenny. the reason she is making her sister fat is because she just wants to, she always wanted a fat little sister and also to make her look better. Like I said she is 8.<br>\r\n<br>\r\nThe sister who is getteing fattened name is Jordan. she knows her sister is fattening her up and is ok with it. She kind of likes the idea of being fat. She is not fat or even chubby yet. She is what I would call healthy. you know not chubby but not skinny. Anyway the has blonde hair that is goes down to the middle of her neck. She likes eating. and she is pretty quiet. She likes to be fed by her sister and to get her belly rubbed after getting fed. she is kind of a tanned color but you can tell she is white.<br>\r\n<br>\r\nAlso they have a dog that is a beagle names Marley, The reason I name dhim that is because that is she name of my dog, even before the movie.<br>\r\n<br>\r\nNow that you know more about the story, go crazy</span></div></div>",
            "created":1277010000,
            "id":902835,
            "title":"more explaining"
        },
        "11":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "There mom comes in",
                "Jenny sees something on tv",
                "Jenny decideds to try to feed her more",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on just one more bite and you will be done\" said Jenny holding a piece of pizza to Jordans lips<br>\r\n<br>\r\nJordan ate the last peice and started to rub her swolen belly. that was her 8th pizza and her belly was at least 3 times as big as before. Her sister made her take off her shirt so she could see how big she got. She was happy with what she saw.<br>\r\n<br>\r\n\"I love feeding you, you can eat so much, im surprised your not fatter\" said Jenny patting her sisters belly<br>\r\n<br>\r\n\"Ya, I love eating and being fed, and I love how big my belly is afterwards\" said Jordan also patting her belly.<br>\r\n<br>\r\nJenny got up and got Jordan's shirt.<br>\r\n<br>\r\n\"Here, put this on and lets see how much smaller it is\" said Jenny giving Jordan the shirt<br>\r\n<br>\r\nshe put it on, and it barley covered her belly button. Noticing this she also noticed how tight her pants were. She unbuttoned them and her belly came out more, pushing up her shir above her belly button.<br>\r\n<br>\r\n\"Good, mabey that wil get you some more pounds\" said Jenny<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1277010000,
            "id":902851,
            "title":"She is being fed"
        },
        "112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "start training",
                "go to the shop and check it out",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>A comercial came on the tv that was an advertisment for a new icecream place. It was called the \"Ice Cream Bar Buffet\" all you can eat Icecream. Also there is a challenge, the challenge is finishing a whole 8 gallon sunday in 2 hours. If you won then you got your name and picture on a wall and free ice  cream for 8 years. ( one for each gallon )<br>\r\n<br>\r\n\"Ready to train\" said Jenny with a wicked smile<br>\r\n<br>\r\n\"I cant finish that challenge, I would pop if I ate that much\" said Jordan looking wooried<br>\r\n<br>\r\n\"Thats what the training is for\"<br>\r\n<br>\r\n\"Now lets...</span></div></div>",
            "created":1277528400,
            "id":906884,
            "title":"New place to gain"
        },
        "1122":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "I can not eat anymore now I am so full I am about to pop I will do anything else",
                "I want more"
            ],
            "content":"<div class=\"\"><div> <span>Jenny takes Jordan to ice cream shop to check it out when they get there it amazes both of them .  They find out the shop has every kind of ice cream that you can imagine. Jenny and Jordan find a booth and sit down a waitress comes over and asks what they would like. Jenny asks how many flavors do you have the waitress says sixty Jenny says what sizes do you have waitress says we start in pints all the way to gallons Jenny smiles and says bring pints first she ask how much does a pint cost waitress says price is fifty cents including tax.  Jenny tells waitress to bring a pint and to keep bringing them until she tells her to stop. The waitress tells Jenny we have to bring six pints because management has a minimum order on the pints only Jenny says ok.  The waitress brings back six pints and Jordan starts eating. Jordan eats twelve pints in two hours totaling two quarts of ice cream Jenny pays the bill and she and Jordan leave to go home Jordan says she enjoyed the ice cream Jordan says she full. When they got home their parents were at work.  Jenny has Jordan change into her nightgown she rubs Jordan’s stomach they go to family room to watch tv while watching tv Jenny goes to kitchen brings bags of cookies into family room has Jordan lay down on floor and makes her eat bag after bag of cookies 🍪 she makes Jordan eat until Jordan says<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1579450800,
            "id":2775604,
            "title":"go to the shop and check it out"
        },
        "11221":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Ties Jordan to kitchen chair and feeds her first gallon of ice cream",
                "Makes Jordan drink litters of coke"
            ],
            "content":"<div class=\"\"><div> <span>Jenny says okay gets Jordan takes her into kitchen has her sit at table.  Jenny gets a tall glass out and a quart of whole milk 🥛 pours milk into glass and makes Jordan drink and drink until the quart is inside Jordan’ tummy, Jenny makes her sister drink three more quarts, now Jordan is also full of milk.  Jenny starts stuffing Jordan with loaf after loaf of bread.  Jordan asks Jenny to rub her tight tummy she does . Jordan starts to feel better when Jenny has Jordan drink a litter of coke Jordan burps and Jenny laughs.<br>\r\nJordan wants to lay down so Jenny takes Jordan to her room and let’s Jordan sleep.<br>\r\nWhile Jordan is sleeping Jenny gets more ice cream and when Jordan gets up Jenny forces her sister to eat ice cream from day and night so she can win prize. Jordan tells Jenny she is ready to eat eight gallons of ice cream Jenny says okay the next day Jenny </span></div></div>",
            "created":1580146680,
            "id":2779206,
            "title":"I can not eat anymore now I am so full I am abo..."
        },
        "11222":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "I have some big plans for you with a wicked smile and patting her tummy",
                "Drink this large bottle to settle your stomach "
            ],
            "content":"<div class=\"\"><div> <span>Jenny agrees to feed Jordan more and Jenny calls Ice cream shop and orders four quarts of ice cream each day for eight days then she makes Jordan eat all of the ice cream each day until Jordan has eaten thirty-two quarts.  In order to get Jordan to eat the ice cream along with her regular meals Jenny starts to force-fed Jordan stuffing her until Jordan’s stomach is so tight it is hard. Jordan is pleased that she  is could  actually eat that much.  Jenny tells Jordan she is ready to win the contest and that will be in a week.<br>\r\nFinally the day of the contest has arrived and Jenny takes Jordan down to the ice cream shop as the get inside Jenny signs Jordan in and she is assigned a number and and seat Jenny sits across from Jordan to cheer her on. There are three other people in the contest  the rules are told the contestants have to consume eight gallons of ice cream in two hours. The way most of the ice cream will be consumed will be by drinking milkshakes and having a funnel in mouth allowing the ice cream to enter the stomach faster.<br>\r\nThe contest started and Jordan started drinking the milkshakes after the first hour she had consumed four gallons of ice cream and two contestants had dropped out. Jenny was cheering For Jordan telling her she could do it Jordan smiled.  Jenny looked over at the other contestant and she raised her hand to signal that she was giving up. Jordan kept drinking the milkshakes she had now consumed two more gallons.<br>\r\nJordan finished the last two gallons had her picture taken and awarded eight gallons of ice cream over the next eight years.<br>\r\nJordan was so full she had to be driven home she put on her nightgown laid down and Jenny said</span></div></div>",
            "created":1585075260,
            "id":2806442,
            "title":"I want more"
        },
        "112221":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Jenny puts Jordan on a diet of eating just ice cream every time  she is hungry ",
                "Jordan is forced to eat  bags of candy bars until her stomach is huge"
            ],
            "content":"<div class=\"\"><div> <span>Jordan said  her stomach felt better since Jenny was patting her  and then asks Jenny  what big plans was she planning for  her. Jenny told Jordan that since  she could eat that much ice cream  she would see to it that she ate more than a gallon of ice cream a year by making her also eat a half a gallon of ice cream every week Jordan said in a month that would give her an extra two gallons a month along with the gallon in one year that would be 25 gallons of ice cream she said she would pop.  Jenny said she would make sure she did not pop but said She would make Jordan’s stomach so full that her stomach would be very tight after also being filled up with more food.two days later Jenny put her plan in effect so Jordan ate and ate from daybreak until into the night Jenny stuffed Jordan and when Jordan said no more food that she had no more room in her stomach Jenny felt Jordan’s stomach and told her she had just enough room to finish drinking the last two large milkshakes afterwards Jordan wanted to lay down so Jenny took Jordan to bed. Jenny said get some sleep because tomorrow we start again .<br>\r\nThe next day Jenny had a surprise for Jordan</span></div></div>",
            "created":1600362120,
            "id":2904866,
            "title":"I have some big plans for you with a wicked smi..."
        },
        "113":{
            "choices":[
                "feed you some more",
                " change your clothes"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what.\"Jenny said,\"I'm going to feed you more.\"<br>\r\n\"But Jenny I'm full.\"Jordan said.<br>\r\n\"Come on Jordan just a bit more.\"Jenny begged.<br>\r\n\"Alright.\"Jordan said.Jenny and Jordan walked into the kitchen.Jordan sat in a chair while Jenny grabbed some food from the fridge.<br>\r\n\"Here Jordan how about a nice big piece of cake?\"She asked.Jordan took the cake and began to eat.After awhile she stopped.\"I don't think I can eat anymore.\"She said.<br>\r\n\"Sure you can.\"Jenny said stuffing cake into Jordan's mouth.Jordan swallowed the cake.\"Jenny I'm really full.\"She whined.<br>\r\n\"Jordan you can stop after you eat the cake.\"Jenny said feeding her more.Jordan finished the cake on the plate.Her shirt was stretched over her taught tummy.\"See wasn't that fun?\"Jenny asked.<br>\r\n\"I guess.\"Jordan said,\"But my belly really hurts.<br>\r\n\"Here let me help you.\"Jenny said.She began rubbing Jordan's big belly.\"There is that better?\"she asked.<br>\r\n\"Yes.\"Jordan said.<br>\r\n\"Good.\"Jenny said,\"Let's</span></div></div>",
            "created":1277269200,
            "id":905053,
            "title":"Jenny decideds to try to feed her more"
        },
        "1131":{
            "author_id":"maffy2501",
            "author_name":"maffer2453",
            "choices":[
                "jordan eats 5 helpings",
                "jordan eats 10 helpings and then eat 3 liters of ice cream",
                "their mom comes back and bring they to an alll you can eat"
            ],
            "content":"<div class=\"\"><div> <span>you know i thiink you can eat more,said jenny<br>\r\njordan:no!!!<br>\r\njenny:i have your favorite<br>\r\njordan:lasagna??!!!!<br>\r\njenny:yep<br>\r\njordan:bring it!!!<br>\r\nand jenny give her the lasagna,it was a really big plate of it,and jordan finish it in 5 minutes,her pants where going to explode and her shirt doesnt covered her belly<br>\r\njenny:nice<br>\r\njordan:burppppppppppppppppppp<br>\r\naand then their mom comes in:<br>\r\nmom:sorry guys i have to leave but her you have some spaguetti with meatballs,bye i love you<br>\r\nand she leaves<br>\r\njordan:i am hungry<br>\r\nand jordan was rubing her belly<br>\r\n</span></div></div>",
            "created":1280638800,
            "id":928274,
            "title":"feed you some more"
        },
        "11311":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "falls asleep",
                "wants more coke"
            ],
            "content":"<div class=\"\"><div> <span>Thirty minutes later Jordan was laying back on the couch with her shirt lifted up showing how big her taught tummy was. Her sister was on her knees next to the couch rubbing her big sisters belly. It was smooth butnot squsshy because all the food inside it made it pretty hard.<br>\r\n<br>\r\n\"I bet you are thirsty\" said Jenny tapping on her belly<br>\r\n<br>\r\n\"A little\" said Jordan barley able to talk from the pressure in her belly<br>\r\n<br>\r\n\"I will get you some coke\" said Jenny getting up<br>\r\n<br>\r\nShe went into the fridge and pulled out a two littler of coke and pu it on the table. Then she got out two glasses and filled them both to the top. She was a little thirsty as well so thats what the second glass is for. She left the bottle on the table because she might use it later. she went into the living room and gave her gorgd sisted the glass. She chugged it and because of all the food in her belly there was no room so with every gulb her belly rose up a little more.<br>\r\n<br>\r\nThen Jordan...</span></div></div>",
            "created":1281243600,
            "id":932422,
            "title":"jordan eats 5 helpings"
        },
        "113111":{
            "choices":[
                "continue with the fattening",
                "jenny and jordan gain more than expected 20lbs extra than expected "
            ],
            "content":"<div class=\"\"><div> <span>after eating the the amount of that she did she fell into a food induced sleep were she dreams that shes on her bed..... she is waking up for <br>\r\n<br>\r\nthe morning (she is much than usall because the time has past a week in the dream world she streches wich reveals her belly rubs the sleep <br>\r\n<br>\r\nfrom her eyes and walks down stairs queitly not very tho cause of her weight she walks into the kitchen she sees her mam and sister <br>\r\n<br>\r\ncooking for her \"are there you do u now what time it is\" \"err\" \"its your fedding time\"  \"yeah\" now go sit in that chair\" ok that was a <br>\r\n<br>\r\nconversation bewteen her and her mam as u now her sister is normally the one fattening her up but now its x2 so have fun so she sits down <br>\r\n<br>\r\nwaiting for food ok her sister brings the food and puts it in front of her the first things she notices theres more than enough for 50 people <br>\r\n<br>\r\nhere the second is that her sister is fatter she then says \" jenny have u errr\" \"gained some weight\" \"yeah\" \"well i cant let u have all the fun <br>\r\n<br>\r\ncan i now\" \"well it is fun being fat\" \" why do u think i fatten u up\" \"so decided to gain weight to\"  ok so heres how it goes her mam feeds <br>\r\n<br>\r\njenny why jenny feeds jordan so it a fattening line <br>\r\n<br>\r\nin the dream all the food as weight gain powder so considering how lazy she is it should work quiet well the chair are weak under there <br>\r\n<br>\r\nweight did i mention there sitting on the same chair its a normal wooden chair so jordan is sitting on jenny at the table there nice sisters arent they<br>\r\n </span></div></div>",
            "created":1283749200,
            "id":951561,
            "title":"nice dreaming "
        },
        "113112":{
            "choices":[
                "Tie her sister to a chair and feed her a whole cake.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Jordan still wanted more Coke, so Jenny went and grabbed the rest of the bottle and a large beer bong that her mom thought she didn't know about. Bringing them back to Jordan, she proceeds to pour the rest of the huge bottle through the bong and into her sister's mouth. She can actually see her sis's belly expanding from the pressure. She begins to feel turned on. Once the rest of the Coke is gone, She decides to...</span></div></div>",
            "created":1297141200,
            "id":1050390,
            "title":"wants more coke"
        },
        "1131121":{
            "choices":[
                "Their father comes in...",
                "Their mother comes in..."
            ],
            "content":"<div class=\"\"><div> <span>\"What are you doing?\" asked Jordan.<br>\r\n<br>\r\n\"I'm gonna force feed you a whole cake,\" says Jenny, tying up her sisters hands and legs.<br>\r\n<br>\r\n\"Okay, I'm still hungry,\" said Jordan, even though her giant, enormous belly was literally rock solid from everything.<br>\r\n<br>\r\nOnce Jenny got the cake...</span></div></div>",
            "created":1339131600,
            "id":1355883,
            "title":"Tie her sister to a chair and feed her a whole ..."
        },
        "11311212":{
            "choices":[
                "Jenny feeds Jordan more ",
                "Jenny decides to run outside and begin filling up Jenny with a hose filled with "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then brings in a ton of grocerys  and tells the girls to help put it away because the mother has to go away for a business meeting in Toronto  Jenny eagerly took some of the many groceries out of her mothers hands</span></div></span></div>",
            "created":1478923860,
            "id":2235734,
            "title":"Their mother comes in..."
        },
        "113112121":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Jenny wakes Jordan up and walks her into kitchen has her sit down at table",
                "Jordan wakes up and finds her stomach is still full and hard"
            ],
            "content":"<div class=\"\"><div> <span>After the mother left Jenny had Jordan take off her clothes and put on her nightgown then she had Jordan sit in chair and tied her to the chair. Jenny made Jordan finish eating the whole cake then pulled out bags of cookies making her eat fifteen bags. Next Jenny got the beer bong out and made Jordan drink more coke Jordan’s stomach was now very hard and she said she was full and her stomach was about to burst.<br>\r\nJenny laughed and rubbed Jordan’s stomach having Jordan lay down on couch. Jenny let Jordan rest and said in eight hours she would continue to force fed Jordan. Jordan said okay.</span></div></div>",
            "created":1578587400,
            "id":2771527,
            "title":"Jenny feeds Jordan more "
        },
        "1131121212":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Jordan feels like a milkshake*",
                "Jordan has stomachache *"
            ],
            "content":"<div class=\"\"><div> <span>Jenny sees that Jordan is awake and tells Jordan time to eat Jordan says she was still full and that her stomach is hard Jenny feels Jordan’s stomach and agrees that her sister is full.  Jenny takes Jordan to kitchen sits her down and ties her to chair.  Jordan says she has no room in her stomach Jenny says that is okay her sister says then I do not have to eat more food Jenny said yes you will eat more food and you will eat until I think you have had enough.  Jordan says but I will burst her sister says I will not let that happen but I will force fed you ice cream and coke pastries pies.</span></div></div>",
            "created":1581532920,
            "id":2786456,
            "title":"Jordan wakes up and finds her stomach is still ..."
        },
        "11313":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Your tummy will become so big you will become my",
                "You are going to burst"
            ],
            "content":"<div class=\"\"><div> <span>Jenny starts feeding Jordan more food as Jordan says rub my tummy Jenny says not until you have eaten Jordan tells her sister she is full. Jenny force feds Jordan pies cakes ice cream cookies burgers and fries.<br>\r\nJordan eats meatloaf and potatoes eggs and bacon pancakes and bacon and to drink she has milkshakes.<br>\r\nShe eats banana splits and hot fudge sundaes.  Jordan is taken home puts on her nightgown then she ask her sister to rub her tummy but Jenny says not until you drink all six half gallon cokes.<br>\r\nJordan say no she has no more room in her tummy Jenny forces Jordan to drink coke saying yes you will.<br>\r\nJenny feels Jordan’s tummy and says</span></div></div>",
            "created":1583855940,
            "id":2799475,
            "title":"their mom comes back and bring they to an alll ..."
        },
        "113132":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Making plans for Jordan",
                "To take a nap "
            ],
            "content":"<div class=\"\"><div> <span>Jordan tells Jenny she is full and does not want anymore food.  Jenny smiles and tells Jordan to stand up and look down at her feet she asks Jordan do you see your feet Jordan says yes then Jenny tells her sister your are not full.  Jenny starts to force fed Jordan brownies by the dozen making her eat six dozen.  Jenny gives Jordan whole milk to drink by the quart Jordan drink four quarts. Jenny weighted Jordan and she weighed sixty- five pounds Jordan asked Jenny why was she making her gain weight so fast Jenny said she always wanted a fat sister Jordan said she was fat but Jenny said not fat enough Jordan said what is enough Jenny said when Jordan could bend over and not see her feet.  Jordan was forced to eat candy bars this gave her quick energy that did not last long and became sleep Jenny let Jordan sleep.<br>\r\nAfter Jordan woke up Jenny fed Jordan more candy bars giving her sister quick energy and making her sleepy.  Jordan thought her stomach was going to burst but Jenny smiled and told Jordan that she had changed her mind and instead was going to fed her sister all of the candy bars that she could eat her sister thought that would be great. Jenny smiled and started</span></div></div>",
            "created":1586880540,
            "id":2818729,
            "title":"You are going to burst"
        },
        "1132":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "rub your belly",
                "watch tv",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Your clothes are really dirty with food so lets go to your room and change your clothes\"<br>\r\n<br>\r\n\"Ok\"<br>\r\n<br>\r\nThey went up into Jordans room and jordan got undressed into her underwear. Jenny was looking in her closet for something for her to wear.<br>\r\n<br>\r\n\"Here, try this on\" said Jenny handing her a shirt an pair of pants<br>\r\n<br>\r\nShe put them on and the button would not snap and her shirt rode up all the way to her belly button.<br>\r\n<br>\r\n\"These dont fit\" said Jordan sadly and proudly<br>\r\n<br>\r\n\"Well at least we know your growing, here try these then\"\" said Jenny giving her another outfit<br>\r\n<br>\r\nThis went on for at least 30 min but nothing would fit.<br>\r\n<br>\r\n\"Well i guess you will eas to sit around in your underwear until your belly shrinks a little\"<br>\r\n<br>\r\n\"Ok\"<br>\r\n<br>\r\n\"While we wait lets...</span></div></div>",
            "created":1277442000,
            "id":906564,
            "title":" change your clothes"
        },
        "11323":{
            "author_id":"sirfatty",
            "author_name":"Pixel  ",
            "choices":[
                "See if Jenny has any large clothes",
                "Watch TV"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What next, if something else? Will Jordan and Jenny possibly...</span></div></span></div>",
            "created":1455598800,
            "id":2105357,
            "title":"something else"
        },
        "113231":{
            "author_id":"sirfatty",
            "author_name":"Pixel  ",
            "choices":[
                "Jordan willingly goes.",
                "Jordan resists, but is forced."
            ],
            "content":"<div class=\"\"><div> <span>\"You know what...\" Jenny said, perking up, \"my clothes might fit you!\"<br>\r\n\"Yeah!\" Jenny said enthusiastically.<br>\r\nThe girls went into Jenny's room and found a skirt that was just right, bit a shirt that rode up just under her belly button.<br>\r\n\"Great!\" Jenny said. \"Now let's feed you some more!\"</span></div></div>",
            "created":1455598800,
            "id":2105358,
            "title":"See if Jenny has any large clothes"
        },
        "1132312":{
            "author_id":"sirfatty",
            "author_name":"Pixel  ",
            "choices":[
                "Later that day...",
                "Citing feeding..."
            ],
            "content":"<div class=\"\"><div> <span>\"No, my tummy hurts too bad!\" Jordan said.<br>\r\nJenny  tried to go and grab her sister, but Jordan had a trick up her sleeve. She turned around and farted on Jenny. Jenny yelped, but pushed on and knocked her sister over and dragged her back into the kitchen. The girls found that their mother had been there and dropped off a ton of sweets she won at a convention or something. Jenny gave Jordan an evil smile, and before Jordan could get up, she found herself being stuffed again.<br>\r\n\"Mmph! No Jenny! Mmph! My belly hurts too much! Mmph!\" As she said it Jordan's belly gave a loud and sour gurgle. Jenny ignored and continued fattening up her sister...</span></div></div>",
            "created":1455598800,
            "id":2105366,
            "title":"Jordan resists, but is forced."
        },
        "114":{
            "choices":[
                "Her Sister is tired",
                "Her Sister is thirsty",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other choices:</span></div></span></div>",
            "created":1277010000,
            "id":903030,
            "title":"Something else"
        },
        "1141":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "She gets up",
                "there at the buffet",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"All this food in my tummy is making me tired\"said Jordan rubbing her eyes and her belly<br>\r\n<br>\r\n\"Well why dont you just take a nap here on the couch, I will get you a blanket\" said Jenny going to the hall closet<br>\r\n<br>\r\nShe got a blanket and put it over her gorged sister. You could see her belly poking up from the blanket, which made it look like she was trying to hide a ball under it.<br>\r\n<br>\r\n\"When you get up I am going to ask mom if we can go to that buffet down the street so I can stuff you up real good.<br>\r\n<br>\r\n\"Ok\" said Jordan not really paying attion as she fell asleep.<br>\r\n<br>\r\n<br>\r\nWhen...</span></div></div>",
            "created":1277182800,
            "id":904242,
            "title":"Her Sister is tired"
        },
        "11413":{
            "choices":[
                "Asked it they could go to the all you can eat place",
                "Seen her mother had already picked up a heaping bag of fast food for dinner"
            ],
            "content":"<div class=\"\"><div> <span>Jordan slept on the couch with a smile on her face. It wasn’t such a shock when you consider what had just happened to her. She had just been fed more than half of a very tasty pizza. She was filled to the brim and her fat belly was bigger than ever. All those things were more than enough to make a little feedee like her grin as her round belly went to work on the food inside it.<br>\r\n<br>\r\nShe wasn’t the only one grinning of course. Her feeder sister was more than pleased with the results of what had happened. You see the most amount of pizza Jenny could get little Jordan to eat was a 6 slices. Not only was she able to get her plump little sis to down an extra piece, but she was able to stuff her with TWO extra pieces! She was extremely excited about that. <br>\r\n<br>\r\nJordan sat there watching TV, waiting for their mother to arrive. She sat next to where her sleeping sister laid and she carefully fished under the covers until she found the large dome of Jordan’s fat little belly, rubbing it soothingly as the little girl slept. Jordan would only smile a little more in her sleep as her big 5 year old belly was played with. Jenny could only smile happily back at her sister, loving how good her fat tummy felt and how good she knew she made her little sis feel.<br>\r\n<br>\r\nAfter a while, the two children’s mother returned home. It was then Jenny….<br>\r\n<br>\r\n</span></div></div>",
            "created":1277787600,
            "id":908683,
            "title":"something else"
        },
        "114131":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "getting dressed",
                "skip to buffet"
            ],
            "content":"<div class=\"\"><div> <span>The second there mom walked in Jenny was right in front of her.<br>\r\n<br>\r\n\"Can we go to a buffet for dinner\" asked Jenny in her sweetest voice that no one could say no to<br>\r\n<br>\r\n\"Well, sure Why not\" said her mother<br>\r\n<br>\r\n\"Be readdy in 30 min\"<br>\r\n<br>\r\n\"Ok\" said Jenny running back to the living room<br>\r\n<br>\r\nShe gently shook her bloated little sister up<br>\r\n<br>\r\n\"What\" asked jordan a little irritated from being woke up<br>\r\n<br>\r\n\"i am about to get to feed you alot more food to make you alot fatter\" said Jenny<br>\r\n<br>\r\n\"You need to get dressed\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1278306000,
            "id":912177,
            "title":"Asked it they could go to the all you can eat p..."
        },
        "1141311":{
            "choices":[
                "“Yes, let’s go”",
                "“No, we’ve got to wait for your father”"
            ],
            "content":"<div class=\"\"><div> <span>Jenny had gotten Jordan changed from her “around the house” clothes into something more suitable to go out in. She was able to find her little sister a nice pink sleeveless shirt and pants combo. The only problem was Jenny couldn’t fit the poor stretched shirt completely over her younger sister’s bloated belly and a small sliver of blubber peeked out from beneath it. Neither minded this look, bit Jenny was a little concerned that her sister might not have enough room to grow from all the eating she knew she would do at the buffet.<br>\r\n<br>\r\nJenny was distracted from these thoughts as she heard her mother calling for her and Jordan to come downstairs. Both kids didn’t need any further encouragement, and quickly ran down the stairs. Well, Jordan could only waddle quickly, but with the promise of her chubby belly getting filled, the hungry child was more than willing to move quickly.<br>\r\n<br>\r\n“Can we go now?” Jenny asked her mother excitedly.<br>\r\n<br>\r\nHer mother quickly replied…<br>\r\n</span></div></div>",
            "created":1279083600,
            "id":917542,
            "title":"getting dressed"
        },
        "1141312":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "skip to Jenny",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>When they got there the place was very packed. Seeing this Jenny took her chance.<br>\r\n<br>\r\n\"Mom, you go take Jordan and sit down, I will make your plates\" said Jenny kindly<br>\r\n<br>\r\n\"Thanx Jenny, just remember, I hate chicken\"<br>\r\n<br>\r\n\"Ok\"<br>\r\n<br>\r\nI will go ahead and make me and moms plate and take it to the table because I will need both hands to cary Jordans.<br>\r\n<br>\r\nShe grabbed to plates and put a enough food on each to fill them. Ecept no chiken on her moms. Every time they went out to eat at a place thats sells any kind of chicken she made sure to make it very clear how much she hates chicken.<br>\r\n<br>\r\nShe took the two plates and put the first one in front of an empty spot and the second in front of  her mom.<br>\r\n<br>\r\n\"Dont worry Jordan, I am about to make yours\" said Jenny winking at Jordan<br>\r\n<br>\r\nThis made Jordan a little worried of how much food she would have to eat. Her and Jenny had made an agreement when all this started that if Jordan said to stop she would but she had to at least finish the first helping.</span></div></div>",
            "created":1279947600,
            "id":923628,
            "title":"skip to buffet"
        },
        "11413122":{
            "choices":[
                "Notices how much food Jenny brought",
                "Doesn’t notice or care"
            ],
            "content":"<div class=\"\"><div> <span>Jordan couldn’t help but be a bit worried. She might have been a hungry, big-tummied little girl, but she still had her limits. She knew Jenny would keep feeding her until she begged her to stop. Her older sister was usually pretty good about doing so but would often encourage her to eat more. However, Jordan knew Jenny would never hurt her and would make sure to stop before she got in pain.<br>\r\n<br>\r\nDespite all of these fears, Jordan was getting very egger to eat. That resting she did on the couch and the long drive over had allowed her fat tummy a bit of time to grow hungry again. It also didn’t help that her mother was eating a very delicious looking spread right in front of her. It was almost teasing the fat little girl as she sat empty handed and empty bellied. <br>\r\n<br>\r\nFortunately, Jenny soon arrived with her food. It was a good thing the older sis arrived when she did, as she caught Jordan trying to sneak a handful of her mother’s food without the adult knowing. Jenny could only giggle at this as she set down the first helping in front of Jordan: all 4 plates heaping full of delicious food.<br>\r\n<br>\r\nJordan drooled at the sight of so much tasty food and attacked the first plate before Jenny could even get it on the table.<br>\r\n<br>\r\nTheir mother….<br>\r\n</span></div></div>",
            "created":1281416400,
            "id":933717,
            "title":"something else"
        },
        "114131221":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "yes-choose how many plates",
                "no,to full-belly rub?"
            ],
            "content":"<div class=\"\"><div> <span>\"That sure is alot of food\" said there mom surprised<br>\r\n<br>\r\n\"Well I just want to make sure my little sister gets enough to eat,she is a growing girl\" said Jenny with a smile<br>\r\n<br>\r\nJordan didnt even notice the conversation,she just ate and ate. Soon she had eatin every single bite and was rubbing a very full tummy. Jenny oticed this and sprang into action.<br>\r\n<br>\r\n\"Would you like some more foodd\" asked Jenny with an eager look on her face<br>\r\n<br>\r\nJordan knew wha she was doing and was trying to decide. She had eatin alot and was pretty full,but on the other hand she did not want to disappoint her sister and she wouldnt mind have her belly a little big bigger.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1283662800,
            "id":950867,
            "title":"Notices how much food Jenny brought"
        },
        "1141312211":{
            "choices":[
                "Jordan plays with her tummy",
                "Jenny comes back with the food"
            ],
            "content":"<div class=\"\"><div> <span>Jordan thought for a moment more before she looked at all the yum food she hadn’t yet tried. Being such a big eater, she couldn’t wait to get her hands on more of the tasty treats this buffet offered, even if she was a bit full. She gave her belly a readying rub and looked back at her egger sister.<br>\r\n<br>\r\n“Okay. But get some new stuff for me to try.” The plump little girl said licking her lips at the thought.<br>\r\n<br>\r\nJordan watched as Jenny grinned happily and rushed off to fulfill her request. Jordan was starting to have some second thoughts about her decision, knowing her sister was probably going to bring back a great deal of food. However, she was looking forward to sampling some of the other dishes this buffet had. She had to admit, the food here was pretty good.<br>\r\n<br>\r\nShe looked down at her food stuffed belly and couldn’t help but grin. It was a sight she was getting used to seeing more and more and it was one she was beginning to interpret as good. This was mostly because of much her older sister loved her belly stuffed with food, but Jordan had to admit, she was beginning to love it too.<br>\r\n</span></div></div>",
            "created":1284354000,
            "id":956393,
            "title":"yes-choose how many plates"
        },
        "11413122112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "She brings more food- Surprise",
                "She giveher a nice tummy rub"
            ],
            "content":"<div class=\"\"><div> <span>\"Here you go\" said Jenny putting down a huge plate of different kinds of food.<br>\r\n<br>\r\nThis yanked Jordan out of her thoughts amking her just stare at the plate. For one it was hte biggest plate the buffet had and second all the food on it. She was right. Her sister overdid it. But she was now almost determined to eat it all. Besides, it would be wrong to let down her very excited sister. She picked up a fork andd began to eat. With every bite she felt more full, but she also felt more happy and more a need to take the next bite. She could feel her shirt tighten more and more as her tummy grew.<br>\r\n<br>\r\nBefore she knew it half of the plate was gone. She took a big sip of her drink and continued. Now her belly was clearly showing between her shirt and pants. You could see the indention of her belly button through her shirt from being so tight. She noticed Jenny justr watching her eat all the food and smiled<br>\r\n<br>\r\n\"My belly is gonna be so big when I finish\" said Jordan with a giggle<br>\r\n<br>\r\n\"Ohh yea it is, just wait til you finish\" said Jenny with a sly smile</span></div></div>",
            "created":1306472400,
            "id":1113917,
            "title":"Jenny comes back with the food"
        },
        "114131221122":{
            "choices":[
                "Jenny rubs Jordan’s belly",
                "Jenny gets more food for Jordan after the rubs"
            ],
            "content":"<div class=\"\"><div> <span>Jordan grinned at what her sister said. With this the rounded little girl had been given the motivation she needed finish the plate.<br>\r\n<br>\r\nShe quickly dove into her portion with renewed vigor. However, as much as she might have wanted to gobble down the rest of her food, this faster pace of eating slowly faded into a much slower one. That didn’t mean she wasn’t going to finish. She hadn’t stopped eating, only ate more slowly. <br>\r\n<br>\r\nShe got into rhythm of taking a bite, chewing for a long while and swallowing it down before repeating the process. While less quickly than before, this method seemed to work. Jordan finally put the last piece of food into her mouth, chewed for a really long time and slowly swallowed it down into her belly. She let out an overly full burp and moan as she looked down at her belly.<br>\r\n<br>\r\nThe instant second Jenny and Jordan’s eyes hit the stomach, both knew it had been worth the effort. It was quite tight and was more “rounded” than either had seen before. Not only that but the slight gap between pants and shirt had now turned into a large section of little girl blubber which now showed off the younger sibling’s belly button.<br>\r\n<br>\r\nJordan didn’t say a word but quickly began to rub her younger sister’s belly. She knew what to do to make Jordan feel more comfortable. Not only this, but Jenny couldn’t help but want to feel her younger sister’s belly a bit.<br>\r\n<br>\r\n</span></div></div>",
            "created":1306731600,
            "id":1116394,
            "title":"She giveher a nice tummy rub"
        },
        "1141312211222":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "She can do it",
                "She cant do it"
            ],
            "content":"<div class=\"\"><div> <span>After a few more minutes of rubbing Jenny stoped and looked up to her sister.<br>\r\n<br>\r\n\"Do you think you could eat a bit more\" asked Jenny sweetly<br>\r\n<br>\r\n\"Ummm, I think so, but not much\" said Jordan unsurely<br>\r\n<br>\r\nJenny got up and went to get to the line to get her chubby stuffed sister another plate of food. She ignored the \" little bit\" part and loaded her plate up like all the others. She got a variety of things and even filled up the large cup with more soda. She was really hoping that Jordan could push herself just a little more and be able to fit this last plate of food it her already tight round stuffed tummy. She walked back to the table and smiled when she saw her sister with her shirt half way up her belly and her hands craddling it like a baby. She could tell Her sister was really full. Even with that she could see a smile hint f a smile of her face. She always did love the feeling of being really full.<br>\r\n<br>\r\n\"here you go, one more plate of food and another cup of soda\" said Jenny layin the food down in front of Jordan<br>\r\n<br>\r\n\"thats alot of food, I only said  a little bit\"<br>\r\n<br>\r\n\"I kno, it is a little bit\" said Jenny with a giggle \"Come on you can do it\"</span></div></div>",
            "created":1306818000,
            "id":1117079,
            "title":"Jenny gets more food for Jordan after the rubs"
        },
        "11413122112222":{
            "choices":[
                "Rub your belly",
                "Rub your belly as I feed you the rest"
            ],
            "content":"<div class=\"\"><div> <span>Jordan gulped at the large plate that was set before her. She was really stuffed right now and her young tummy didn’t know if it could hold this much food. She knew her sister would do something like this. She was always trying to make her bigger, not that Jordan minded. I mean she knew Jenny would let her stop if she really needed to and she did love being fat.<br>\r\n<br>\r\nJordan decided the best way to start was to down the soda. She grabbed the cup with two hands and quickly began to drink it. Her belly sloshed forward slightly more with each and every gulp she took. Her tummy also got more and more “sloshy” with every gulp as well.<br>\r\n<br>\r\nThe cute fat girl let out a nice big burp as she took the empty cup away from her lips. Now that all that air was out of her, she felt she could fit a bit more inside. She quickly began in on the large plate, trying to eat fast to avoid being full.<br>\r\n<br>\r\nHer plan worked for a little bit. She was able to finish about half the plate before she had to slow down. She kept up her eating but not for long. As fat and hungry as Jordan was, she was still just too full to keep brining the food to her mouth. She let out an overly filled belch right at Jenny. She looked up at her older sister and quickly said,<br>\r\n<br>\r\n“I’m too full.”<br>\r\n<br>\r\nJenny just chuckled, knowing her sis might have trouble. She nodded at her and lightly placed a hand on her stuffed kid belly and replied,<br>\r\n<br>\r\n“Don’t worry. I’ll…”<br>\r\nJordan gulped at the large plate that was set before her. She was really stuffed right now and her young tummy didn’t know if it could hold this much food. She knew her sister would do something like this. She was always trying to make her bigger, not that Jordan minded. I mean she knew Jenny would let her stop if she really needed to and she did love being fat.<br>\r\n<br>\r\nJordan decided the best way to start was to down the soda. She grabbed the cup with two hands and quickly began to drink it. Her belly sloshed forward slightly more with each and every gulp she took. Her tummy also got more and more “sloshy” with every gulp as well.<br>\r\n<br>\r\nThe cute fat girl let out a nice big burp as she took the empty cup away from her lips. Now that all that air was out of her, she felt she could fit a bit more inside. She quickly began in on the large plate, trying to eat fast to avoid being full.<br>\r\n<br>\r\nHer plan worked for a little bit. She was able to finish about half the plate before she had to slow down. She kept up her eating but not for long. As fat and hungry as Jordan was, she was still just too full to keep brining the food to her mouth. She let out an overly filled belch right at Jenny. She looked up at her older sister and quickly said,<br>\r\n<br>\r\n“I’m too full.”<br>\r\n<br>\r\nJenny just chuckled, knowing her sis might have trouble. She nodded at her and lightly placed a hand on her stuffed kid belly and replied,<br>\r\n<br>\r\n“Don’t worry. I’ll…”<br>\r\n</span></div></div>",
            "created":1318827600,
            "id":1208225,
            "title":"She cant do it"
        },
        "114131221122222":{
            "author_id":"greenflashing",
            "author_name":"pencil",
            "choices":[
                "Jenny stuffs herself",
                "Jenny declines"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll rub your belly. It should make more room for you to finish the rest.\" Jorden liked that idea a lot and shook her head in agreement.<br>\r\n<br>\r\nJenny began to rub circles around her sisters little big gut. Jorden moaned a little from how wonderful it felt. This wasn't the first time this had happened. Any time Jorden was bursting at the seams, her sister was there for her.<br>\r\n<br>\r\n After 2 minutes the 5 year olds belly felt much better and she was able to finish her food. \"Good job sis, way to go.\" There mother was watching and thought it was very cute. \"Well seems my little growing girl is all filled up.\" There mother patted Jordens belly which made her wince in pain a little.<br>\r\n<br>\r\nJenny was surprised when her mother put a plate in front of her. \"Make sure you get your fill as well, Jorden isn't the only girl that has growing to do.\" Jenny was caught off guard and looked a little nervous. </span></div></div>",
            "created":1580181720,
            "id":2779413,
            "title":"Belly rub"
        },
        "1142":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "yes ",
                "no",
                "something happens while she is drinking"
            ],
            "content":"<div class=\"\"><div> <span>\"After all that food I am really thirsty\"said Jordan<br>\r\n<br>\r\n\"Ok I will get you some coke\" said Jenny walking into the kitchen<br>\r\n<br>\r\nWhen Jenny got back into the room she was holding a whole 2 littler of coke.<br>\r\n<br>\r\n\"Think you can finish this\" asked Jenny<br>\r\n<br>\r\n\"I think so\" said Jordan underesimating exacly how much drink it was<br>\r\n<br>\r\nJenny put the bottle to Jordan's lips and held it, so even if she wanted to stop she could not. With every gulp she took you could see her belly push up a little more. Between the amount of drink and the carbonation in the drink her already stuffed and bulging tummy was getting absoluly huge.<br>\r\nCan she finish it?<br>\r\n</span></div></div>",
            "created":1277096400,
            "id":903908,
            "title":"Her Sister is thirsty"
        },
        "11421":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "yes",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>Jordan finished the whole bottle and let out a giant burp, making her sister laugh. Jordan laughed too and began to think. \"You know,\" she said after a moment, \"getting fat like this is really fun. How about you let me feed you too and we can get fat together? We could even see which of us can become the fattest.\" <br>\r\n<br>\r\nJenny was surprised, having never thought of this before. She also liked the idea of friendly competition with her sister. But could she really do it?</span></div></div>",
            "created":1580193660,
            "id":2779467,
            "title":"yes "
        },
        "11422":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Jenny put up a goal list for Jordan",
                "She tries to feed Jordan more"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on drink it.\"<br>\r\n<br>\r\nBut then Jenny saw the look on Jordan's face. She looked troubled and a bit blue. Fast she stopped and Jordan was breathing very deep. Jenny looked worried at her. She did't wanted too hurt Jordan or let her choke.<br>\r\n<br>\r\n\"Is everything okay with you Jordan?\" She asked worried looking at her right in front of her face.<br>\r\n<br>\r\n\"BUUUUURRRRRRRP!!!\" Jordan belched right in her sisters face what caused Jenny to laugh.<br>\r\n<br>\r\n\"Jenny i don't.... think i can... finish it.\"<br>\r\n<br>\r\n\"Really?\" Jenny asked disappointed. \"Well all right then if your sure.\"<br>\r\n<br>\r\nShe put the bottle of cola back in the refrigerator. She walked back too Jordan. She looked smiling at her. <br>\r\n<br>\r\n\"All right Jordan it's time for... it.\"<br>\r\n <br>\r\nI think you all wonder what 'it' is. Don't worry it is't sex or porn.  It's something what Jenny liked too do since she started fattening Jordan exactly four weeks ago.<br>\r\n<br>\r\n\"Come on Jordan. Let's go you like it don't you?\"<br>\r\n<br>\r\n\"Well yeah. I think it's pretty funny.\" Jordan said and giggled.<br>\r\n<br>\r\nThey went up too Jenny's room. Jenny's room was't different from any other eight year old girls room. All right it was a mess but which room of a eight year old girl is't. There was a bed and one chair and two beanbag chairs. A bookcase filled with books for kids. Jenny liked reading. Especially stories about fat people. There was also a desk with a computer and a big box that was used to put in her toys that were lying everywhere in the room and further some posters on the wall. Nothing extraordinary.<br>\r\n<br>\r\nShe took her camera. She got one at her seventh birthday. She could make pretty good pictures. But the most important reason was that she liked fat girls. When she saw fat people somewhere she just took their picture and kept it in a small pile in a drawer. She always locked this drawer but now she opened it. She took out a small map. In it were a few pictures of her sister attached too some paper with up it her sister,s weight, height and measurements, and under that was another but now she was a bit heavier. Every two weeks Jenny weighed and measured her sister to see her process. When Jordan would be a obese girl she would have a beautiful report about her gaining. <br>\r\nThe only thing she did't like was that she had just one little sister. Well she planned to get kids. She could of course fatten them up. She also thought about babysitting when she was older and then fatten those kids up a bit but that had too wait until she was older.<br>\r\n<br>\r\nAll right Jordan look at me and say: i'm fat!\"<br>\r\n<br>\r\n\"I'm fat!\" Jordan said and Jenny took the picture.<br>\r\n<br>\r\n\"Great. Now without the shirt. All right Jordan take of that shirt so we can see your belly.\"<br>\r\n<br>\r\nJordan did as she was told and also unbuttoned her pants so they would't hold in her belly.<br>\r\n<br>\r\nJenny took another picture what clearly showed the bugle in her sisters belly. She took a few more. Some from the front and some from the sides and some in a sitting position.<br>\r\n<br>\r\n\"Yeah those look great.\"<br>\r\n<br>\r\nShe took a measurement and wrapped it around her sisters belly, thighs,chest and arms and wrote everything carefully on another piece of paper. and put it in the map and put it back in the drawer and closed it carefully and looked at her sister. <br>\r\n<br>\r\n\"Great Jordan you really gained.\"   <br>\r\n<br>\r\n'How will i look over two months?\"<br>\r\n<br>\r\n\"I hope a lot fatter.\"<br>\r\n<br>\r\n\"And over five, and over seven and over a year?\"<br>\r\n <br>\r\n\"Jordan sweetie i don't know. Everyone gains different. Some gain faster then others and of course how much and what you eat.\"<br>\r\n<br>\r\nJordan smiled and jenny tried to image a sister who was way fatter. She liked the idea.</span></div></div>",
            "created":1277269200,
            "id":904983,
            "title":"Jordans gaining process"
        },
        "114222":{
            "choices":[
                "Skip forward two months",
                "The next day- more stuffing!"
            ],
            "content":"<div class=\"\"><div> <span>Jenny took Jordan over to a bean bag chair and put her into it.<br>\r\n<br>\r\n\"Time to get started!\" she said, giggling.<br>\r\n<br>\r\nWith her sister settled comfortably Jenny went to her special drawer and took out a large box of cookies, loaded with chocolate chips. She also grabbed some of the pictures of fat people that she had collected and brought them both to her sister.<br>\r\n<br>\r\n\"Here Jordan, sit back like this.\" She carefully spread her legs and leaned her back in the bean bag so that she would stick her belly out more.<br>\r\n<br>\r\nWith that accomplished she opened the box of cookies, but first handed her sister the pictures of fat people.<br>\r\n<br>\r\nTeasingly she held out a cookie while she particularly showed a picture of a huge woman she had seen at the beach with a bikini (barely) on. All her fat was on show, but the woman looked happy.<br>\r\n<br>\r\n\"Imagine getting this big Jordan? Imagine all the wonderful food you could fit in your tummy....\"<br>\r\n<br>\r\nJordan gasped at the big ladys photo and looked down at her own (already stuffed) belly, as her sister brought the first fat-laden cookie closer. COuld she really be that big? But she wanted to make her sister happy, and the fat lady did look so happy....<br>\r\n<br>\r\nWith a swift move Jenny brought the cookie to Jordans mouth and her sister bit down happily, munching on it like she hadn't eaten all day.<br>\r\n<br>\r\n\"Good girl!\" her sister praised, and began to bring more to her mouth. Son they had settled into a rhythm- Jenny would bring more cookies up while rubbing her sisters belly, while Jordan greedily chomped on the treats and looked at her sisters stash of fat people pics with more and more interest.<br>\r\n<br>\r\nJenny continued to encourage her, especially as her sister was slowing down. She had so much food in her gut already it was a wonder she had fit anything in.<br>\r\n<br>\r\n'We are going to feed you every day, and you will get fat in no time!'<br>\r\n<br>\r\n'Mmhmm!' said a happy Jordan, who was thoroughly enjoying herself. She had already begun to think about what she would look like with a bigger, jiggly belly just like the pictures.<br>\r\n<br>\r\nFinally with a solid effort Jenny crammed the last cookie into her waiting sisters mouth and stepped back to look at her handiwork. Jordan laid back in the bean bag, had both hands holding onto her ever more swollen belly (covered in crumbs), and was moaning happily.<br>\r\n<br>\r\nJenny couldn't help but feel excitement at what she had created, her sister was clearly enjoying herself and had already begun to begin her fattening journey<br>\r\n</span></div></div>",
            "created":1573728420,
            "id":2746623,
            "title":"She tries to feed Jordan more"
        },
        "1142221":{
            "choices":[
                "A perfectly round, firm, pregnant like belly",
                "A hanging, flabby belly with rolls forming"
            ],
            "content":"<div class=\"\"><div> <span>It was early morning but you wouldnt have known it by Jennys' energy and happy smile, she was heading to her darling sisters room with an armful of food, as fatty as she could sneak in.<br>\r\n<br>\r\nShe carefully opened the door and closed it behind her just as quietly, walking over to her sisters' bed where the slumbering fatty in progress started to stir with her approach.<br>\r\n<br>\r\nJenny marvelled at what she had created. Jordan was almost always awake as soon as she entered, ready for her morning feeding. Carefully Jenny took the covers off as her sister sat up in bed with a sleepy smile on her face, spreading her legs automatically as though to let her belly spill out.<br>\r\n<br>\r\nWithout a word Jenny held out the first moresel- a greasy, moist chocolate cake, loaded with precious fat and sugar to bulk up Jordan more and more.<br>\r\n<br>\r\nSo the rythym began, as it had for two months. Jordan would messily eat down whatever Jenny gave her until she couldnt repeat the process anymore. But Jenny would always either coax her into eating more or force a little more in, reminding her that she couldnt get fat if she didnt put in the effort- no pain, no gain!<br>\r\n<br>\r\nAll throughout the days for the last two months Jenny had kept up her stuffing her sister silly, with anything fattening she could lay her hands on. And it showed. Every day Jenny would measure, weigh and take her pictures and each picture semed bigger than the next.<br>\r\n<br>\r\nOne day Jenny had gone into her room to prepare for the 'thing' only to find Jordan already in there, admiring her growing gut in the mirror and repeating 'im fatter!', happily jiggling it for her sister. The two had both enjoyed that measuring session and weigh in more than usual.<br>\r\n<br>\r\nIn the present, Jenny was dreamily thinking of her sisters progress as Jordan continued eagerly making a pig out of herself. Soon maybe she would have belly big enough to have a fat girls' waddle. The thought make Jenny weak at the knees- she could see it clear in her mind.<br>\r\n<br>\r\nThe sun was shining faintly through the curtain of Jordans' room, coating the two girls with soft light. The only sound was soft chewing and the occasional small moan from the hungry girl as she enjoyed her morning ritual. <br>\r\n<br>\r\nTheir mom had no inkling of why the youngest was looking softer and didnt seem to be fitting her clothes  properly anymore- or why the food bill was so high- but the girls were spending so much time together that she was just happy they were getting along so well.<br>\r\n<br>\r\nAfter the sustained feeding Jordan finally began to reach her limit, and Jenny was not inclined to push her too hard in the morning first thing- that was reserved for bedtime feeding, when Jordan would fall into a food coma painfully stuffed- bloated, messy and loving every second of it.<br>\r\n<br>\r\nWith the last morsel safely in her tummy, Jordan reclined back fully with a wonderfully blissful look on her face, preparing for the next stage of morning feeding. Jenny picked up a small bottle of lotion- which she would give her sisters growing belly a proper rub down with. This would help her skin stay soft and hope stretch better.<br>\r\n<br>\r\nWith a gentle effort Jenny lifted up Jordans shirt revealing her wonderful new belly. It was Jennys favourite kind as well-</span></div></div>",
            "created":1574047380,
            "id":2748093,
            "title":"Skip forward two months"
        },
        "11422212":{
            "choices":[
                "Go today!",
                "Fatten that lazy girl first!"
            ],
            "content":"<div class=\"\"><div> <span>Jenny rubbed the flabby rolls of her sisters' belly with tender care, getting lotion into every nook and cranny.<br>\r\n<br>\r\nJordan held her shirt up for her sister while this was ongoing, with a wonderfully relaxed smile on her face. Her flabbier face and puffier cheeks were giving her a natural pout, which Jenny absolutely loved- it made her gain more evident.<br>\r\n<br>\r\nThe sisters talked quietly as Jenny moisturized the flabby gut, deliberately jiggling it the whole time which made Jordan giggle.<br>\r\n<br>\r\n'You are getting more fat every day sis, I couldn't be happier with your progress!' Jenny cooed happily.<br>\r\n<br>\r\nTo her surprise, Jordan frowned. 'Jenny, I love being this fat, but I don't have a big enough belly yet! It needs to be faster!'<br>\r\n<br>\r\nHer sisters eyes' bulged. 'What do you mean?'<br>\r\n<br>\r\nJordan pouted her chubby face more. 'I want to look like THIS!' She pulled out from under her pillow the picture of the very fat woman in the red bikini which Jenny had shown her two months before. 'I love her so much! Look at her flabby tummy- you can't see her underwear from the front! Mine you can!'<br>\r\n<br>\r\nSuddenly Jordan heaved herself up from the bed, and stood in the room, taking off her shirt and leaving her in her underwear only.<br>\r\n<br>\r\n'See? You can see it still! I want it to hang down and cover completely!' Jenny had not seen her sister this sad since before she started gaining.<br>\r\n<br>\r\n'Oh baby don't worry, you will get that big!!' Jenny hugged her sister, which cheered her up. Secretly, Jenny was absolutely ecstatic, Jordan was basically demanding to be plumped up.<br>\r\n<br>\r\nJenny began thinking. Jordan was already being stuffed daily as best as she could. It then hit her- if Jordan was to be coached more into eating- or become lazier and move less- then the weight would pile on.<br>\r\n<br>\r\nIt was time to see what Jordan wanted. Jenny really wanted her sister to be happy. <br>\r\n<br>\r\n'Jordan, do you know the lady you have the photograph of?' Jordan nodded. 'Well, I know her and can take you to visit her!<br>\r\n<br>\r\nHer sisters' jaw dropped and all sadness went from her face.<br>\r\n<br>\r\n'If you want we can go today, as soon as mom leaves for work! Or....' Jenny grinned wickedly..'we can have a lazy day together and get you even fatter to see her!'</span></div></div>",
            "created":1574655600,
            "id":2751432,
            "title":"A hanging, flabby belly with rolls forming"
        },
        "114222122":{
            "author_id":"johnboy",
            "author_name":"happyone",
            "choices":[
                "Jenny puts Jordan to bed and gets her up the next day",
                "Jenny laughs "
            ],
            "content":"<div class=\"\"><div> <span>After their mother had left for work Jenny took Jordan had her put on her nightgown they went downstairs to the tv room. Jenny had Jordan lay down on floor she went to kitchen to bring more food to Jordan Jenny then started to force fed Jordan.  Jordan ate and ate then she said she was full Jenny continued forcing more food into Jordan’s tummy. Jordan moans saying she is about to burst. Jenny tells Jordan she will keep eating Jenny gets four two litter bottles of coke and makes Jordan drink she starts burping.  Jordan’s tummy is tight. Jenny makes Jordan eat ice cream. Jenny started to rub Jordan’s tummy while putting four stacks of pancakes in front of Jordan she had been moved to kitchen and was seated at table Jordan started to eat the pancakes then she ate donuts, pies, and cakes. Jordan drank more coke and keep burping she said if I eat or drink anymore My tummy will pop please let me rest.</span></div></div>",
            "created":1579630620,
            "id":2776655,
            "title":"Fatten that lazy girl first!"
        },
        "12":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Be fed",
                "feed myself-so you can rub my belly",
                "something happens"
            ],
            "content":"<div class=\"\"><div> <span>Jordan was on the couch watching tv. She had just woke up and this is what she did every morning. Her and Jenny got up earliy. so early that there parents were not even awake yet. Jenny did this to be able to feed her sister and Jordan got up hearing Jenny in the kitchen.<br>\r\n<br>\r\nSo that is what Jenny is doing. She is making a huge breakfast that would all go in her sisters soon to be big tummy. She also knew when there parents did get up that they would also make breakfast and Jordan would eat that too<br>\r\n<br>\r\n\"Jordan, do you want to be fed or do you want to feed yourself?</span></div></div>",
            "created":1278824400,
            "id":915923,
            "title":"watching tv"
        },
        "14":{
            "choices":[
                "Jenny fattens up her sister so Jordan can't move out of her room",
                "Jenny fattens up her sister so Jordan can become the fattest kid",
                "Jenny fattens up her sister so Jordan can't annoy Jenny anymore",
                "Another stories",
                "Another stories"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All right? Other stories?</span></div></span></div>",
            "created":1335675600,
            "id":1324972,
            "title":"something else"
        }
    },
    "info":{
        "author_id":"killercon",
        "author_name":"bsh101",
        "brief_description":"A 8 year old girl has stsarted to fatten up her little sister",
        "created":1277041200,
        "description":"<td align=\"left\" class=\"norm\">This is a story about a girl who has started to fatten up her little 5 year old sister.<br>\r\n<br>\r\nRules<br>\r\n<br>\r\nNo male weight gain<br>\r\n<br>\r\nNo unrealistic forms of weiht gain like magic<br>\r\n<br>\r\nNo unrealistc gains like 500 pounds in one day or in one siting<br>\r\n<br>\r\nNo instint efects like her arms started to get fatter while she is still eating, give it a day or two to take afect however she can get very bloated and her belly get bigger while eating.<br>\r\n<br>\r\nNo sex stuff, nudity is allowed but not deatailed<br>\r\n<br>\r\nPlease make as long as chapters as you can, no two line parts<br>\r\n<br>\r\nForce feeding is encouraged<br>\r\n<br>\r\nHave fun<br>\r\n<br>\r\n<br>\r\nThanks To The Following Authors For Adding<br>\r\ngirlfeeder,hi,<br>\r\n<br>\r\nPLEASE ADD PLEASSSSSSSSSE</td>",
        "id":1683678,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600362120,
        "modified":1600362120,
        "pretty_title":"sister feeder"
    }
}