{
    "chapters":{
        "1":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "an large muscular ape",
                "Sheena",
                "a Tiger ",
                "(your choice)"
            ],
            "content":"<div class=\"\"><div> <span>In 1929,Sherri was 12 years old flying in her parents' charter plane when they encountered bad weather and crashed into the south part of Africia near the Ivory Coast. Both of her parents and the pilot died almost instantly. But she miraculously survived but was unconscious for a few hours but recovered.<br>\r\n<br>\r\nFortunately she had enough rations for a week and various books to read that was somehow not burnt by the plane crash. The area was not urban but rural. Since she had some training in Jungle Survival, she built a fire and a decent lean-to. But she knew that her survival would not last that long unless someone help her. The next day she woke up to see a fairly friendly figure looking at her. She recognized it as</span></div></div>",
            "created":1333429200,
            "id":1308811,
            "title":"The Beginning of Sherrizan"
        },
        "11":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "She stayed with Boola another two weeks.",
                "She stayed with Boola for another two months",
                "She waved and headed for a nearby village.",
                "She waved and headed for a greater challenge"
            ],
            "content":"<div class=\"\"><div> <span>Boola was the leaders of the ape in that area and had lots of muscles and gymnastic skills due to tree swinging. He felt sorry for her and took her to the area where he lived to care for her. Sherri was terrified of him at first. But she quickly realized that he was giving her additional skills in the jungle as well as muscle strength.<br>\r\nWithin a month, she knew all of the plants and its good qualities, including the bad plants. <br>\r\n<br>\r\nWithin a couple of months, Sherri could swing on the vines easily too. She felt free training and playing with the apes. But she knew it was soon to time to leave.  Now, due to the excellent dieting and training, she was now 3X as good as when Boola first found her. But was it time for her to leave her allies? With hand signals, she asked Boola about it. But Boola suddenly spoke in broken English. ' Up to you, friend. You go or can stay bit longer'</span></div></div>",
            "created":1352437200,
            "id":1464511,
            "title":"an large muscular ape"
        },
        "12":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "communicate with the wild animals",
                "hand to hand/ spear combat",
                "navigating skills around this jungle",
                "get stronger physically",
                "(your choice)"
            ],
            "content":"<div class=\"\"><div> <span>Sheena was doing her morning jog to stay fit and strong. Living in Africa has not been easy in spite of her  training and great fighting skills and strength. Some people still look down on her since she was female. Even though she had her supporters, Sheena was upset last night at a village chief 's rejection for her help in finding a vile game hunter trespassing in his territory.<br>\r\n<br>\r\nWhile jogging, she thought <i>' well, let the chief lose his livestock one by one to that hunter' </i> After a hour jogging she was just breaking a slight sweat, Sheena heard an eagle calling to her about a lost young girl nearby at a campfire who might need her help. Quickly Sheena jogged in that direction and found the smoke from the fire. Sheena found Sherri eating an apricot with a worried face. Sheena approached Sherri with a smile and said<b><span class=\"cmagenta\"> Peace, I am not here to hurt you but to help you.</span></b><br>\r\n<br>\r\nSherri looked at her with a puzzled look on the face and said  'How could you help me? I am not helpless BUT not that good.' Sheena smiled at her initial skepticism and flexed slightly but not too much. Sheena did not want to scare her but quickly unflexed. She thought that there could be many things to train her. Sheena said  'Well, first, I will be willing to teach you to  </span></div></div>",
            "created":1333429200,
            "id":1308845,
            "title":"Sheena"
        },
        "121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Elephant",
                "Ape",
                "Cheetah"
            ],
            "content":"<div class=\"\"><div> <span>Sherri thought a minute and said ' I used to have a dog and wondered what they were thinking sometimes. It would have been great if I could have communicate with them back them. So communicating with the wild animals would be my first choice to learn.'<br>\r\n<br>\r\nSheena smiled and said 'Okay, which one would be your first choice?'</span></div></div>",
            "created":1333688400,
            "id":1310226,
            "title":"communicate with the wild animals"
        },
        "122":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Teach me Judo",
                "Teach me Spear training"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nSheena added ' Besides being strong, knowing how to fight is more important out here. Do you know Jungle Judo or how to use a spear/weapon well?'<br>\r\n<br>\r\nSherri shook her head and replied ' I know both of it just barely. Hey, I am just 12 years old, you know.'<br>\r\n<br>\r\nSheen proudly responded ' Well, I know it well and am an expert teacher. I know secrets that will help you learn it quicker than an average person. Since I could use a partner soon, I want to teach you now. What do you wish to learn first... the Jungle Judo OR how to use a spear/weapon?'<br>\r\n<br>\r\nSherri's eyes lit up. She was beginning to like Sheena. Sherri replied  to her excitedly </span></div></div>",
            "created":1390021200,
            "id":1729411,
            "title":"hand to hand/ spear combat!"
        },
        "124":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "They find the elders so they learn where to find the golden necklace",
                "They go on the journey to the Temple of the Gods in the mountains",
                "They decide to do something completely different instead"
            ],
            "content":"<div class=\"\"><div> <span>Sheena looked at Sherri and a smile formed on her face.<br>\r\n<br>\r\n\"You know something? Since nobody knows who you are... You have a great advantage! We can make you into a powerful female warrior who will defend the natives and the forest people and the animals... And the outsiders will have no clue to who you are! Hmmm...\" Sheena said to her, as she pondered what to do next.<br>\r\n<br>\r\n\"Is... Is that good... or bad?\" Sherri stuttered.<br>\r\n<br>\r\n\"A little bit of both! You need to become stronger so you can defend yourself... And those who are weaker than you! But, there is little time... I need to take you to the Temple of the Gods...\"<br>\r\n<br>\r\n\"Why? What? What's that?\"<br>\r\n<br>\r\n\"There, you will find a stream of water from the Gods... Drink from it, and you will become stronger!\" Sheena explained. <br>\r\n<br>\r\n\"Wow!\"<br>\r\n<br>\r\n\"Or... I must help you find the golden necklace... This is hidden away... Only the elders can tell us where it is located! Once you wear it, you will become powerful and strong! I must take you to meet with the elders!\" Sheena pondered.<br>\r\n<br>\r\n\"Uhh...\" Sherri stuttered, feeling confused. <br>\r\n<br>\r\nSo which do they do?<br>\r\n</span></div></div>",
            "created":1338699600,
            "id":1351844,
            "title":"get stronger physically"
        },
        "1241":{
            "choices":[
                "Sherri becomes similar to Sheena.",
                "Sherri become a amazon 12 feet high, muscular and sexy.",
                "Sherri become a large and muscular goddess with infinite powers."
            ],
            "content":"<div class=\"\"><div> <span>Sheena then decided to accompany Sherri to the hut of the elders, to know where it was possible to find the legendary gold necklace. The two girls, however, did not imagine that luck was on their side more than when they could ever hope to have. In fact, when they reached the entrance of the hut of the elderly, the guards, recognizing Sheena, enter both the left. It was then that the two girls came to know the elders that a cruel violator had dared to steal their gold necklace, but that was then stopped and the arrest by the warriors who were guarding the entrance of the hut and the artifact was now in possession of the elderly. When Sheena asked with respect to be able to take the necklace for Sherri, the elderly remembered everything the Amazon savanna had done to their land, and they agreed. Both satisfied and excited, the two girls came out of the hut with the artifact and returned to the place where they had met for the first time. Sheena diets necklace of gold at the young Sherri and said that would be enough to wear it to activate its mystical powers. Sherri, without hesitation, did what he had told her friend.</span></div></div>",
            "created":1423544400,
            "id":1931198,
            "title":"They find the elders so they learn where to fin..."
        },
        "1242":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "They noticed an injured giraffe  that was maimed.",
                "They spotted an escaped convict hunting there illegally",
                "They saw a  very small abandoned spinach garden."
            ],
            "content":"<div class=\"\"><div> <span>Sherri said  'Let's go to the temple and find the water to drink. If we got the necklace, there is a chance that I could lose it.' Sheena nodded in agreement. After a quick breakfast, they packed a few supplies and headed on the journey to the Temple.<br>\r\n<br>\r\nOn the way, Sherri was impressed with the reasonable size of  Sheena's biceps. It was about the size of an good female athlete. Sherri said ' Do you think that the water will get my biceps to your size?'<br>\r\n<br>\r\nSheena replied ' It depends on how much you drink, The size of the biceps can be more too.But, after all, surviving in the jungle is far more than just strength. It is building a decent shelter, finding food, water, recognizing animals and insects, and knowing where you are....and knowing how to fight.' <br>\r\nSherri nodded. After all, she knew some survival training but not much. She smiled and thought<b> 'I can get used to this.  City living can be too crowded.'</b><br>\r\n<br>\r\nSoon, they stood on top of a hill. In the distance, both of them could use the Temple. Sherri said ' It may take another hour or two before we can get there. But since we have been walking a while, let us take a break.'<br>\r\n<br>\r\nWhile resting, both of them noticed something/someone</span></div></div>",
            "created":1338786000,
            "id":1352321,
            "title":"They go on the journey to the Temple of the God..."
        },
        "12421":{
            "choices":[
                "The Temple!",
                "Some more wild animals!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, what's that over there?\" Sherri asked pointing to what looked like an animal a few yards away.<br>\r\n<br>\r\n\"That's a giraffe!  It looks like its hurt!\"  Sheena started running over to it with Sherri right behind her.  When they got up to it, Sheena placed a consoling hand on it trying to comfort it.  From the looks of it, the wound was very serious and was caused not by another beast, but by a human.  The giraffe was in serious pain and was growling almost non-stop.  Sheena said to the giraffe softly, \"I'm sorry, there is nothing I can do to heal you.  I can at least save you from the pain and give you a proper burial.  Would that be okay?\"  Sherri was surprised that Sheena was able to communicate with an injured animal like this, but was even more amazed that the giraffe seemed to nod at her.  <br>\r\n<br>\r\nWithout so much as a blink, Sheena took out her knife and stabbed the giraffe, ending its life.  Sherri cried out in shock and Sheena too was almost crying.  After giving it a proper burial and consoling each other, Sheena told Sherri, \"Sadly, this is the law of the jungle.  There are certain animals that we do not hunt nor prey on.  Giraffe's are one of them.  They are considered sacred creatures to this jungle.\"  <br>\r\n<br>\r\nThe two women looked at the small mound of earth where they had buried the animal and continued their hike through the mountains.  Along the way, Sheena began explaining the basics of survival, how to find food, water and shelter.  For example, determining the time of the day by the sun's position and determining where north was.  She also explained using the natural geography and features to pinpoint and locate oneself with respect to another location.  Sherri was quiet as the other athletic woman explained this to her.  She was still a bit shaken from what she saw earlier, but nonetheless steeled herself for what was about to come later on.  <br>\r\n<br>\r\nFinally after a long hike they finally come across... </span></div></div>",
            "created":1338958800,
            "id":1353954,
            "title":"They noticed an injured giraffe  that was maimed."
        },
        "12423":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Sherri gladly ate the rest of the spinach.",
                "Sherri refused so Sheena had to force it down Sherri's throat."
            ],
            "content":"<div class=\"\"><div> <span>The garden was very small. it was so small, the amount of spinach would be enough for one can only. There were just 4 tiny plants. Sheena knew that the spinach would just increase muscles temporarily. But she did not want it to go to waste.  She smiled. If they ate it, they would be more rested and alert when they arrive at the Temple. Sheena did NOT want for anyone else to eat it except for herself and Sherri.<br>\r\n<br>\r\nSheena said to Sherri <b>' I know that spinach taste yucky but it will give you some strength temporarily. Eat some,  To prove it that works, i will eat half first.'  </b>Sheena grabbed half of it and quickly swallowed it. Almost instantly, some 2 or 3 inches of muscles grew on her already fit body. Quickly, Sheena felt alert again and not tired.  Then Sheena took the rest of it to Sherri to eat.  <b>Now, it is your turn to eat and get some strength temporarily</b></span></div></div>",
            "created":1345611600,
            "id":1410802,
            "title":"They saw a  very small abandoned spinach garden."
        },
        "124232":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "They arrived but could not find an entrance.",
                "Something or someone blocked their way on the way to the Temple."
            ],
            "content":"<div class=\"\"><div> <span>Sherri was repulsed at the taste of spinach. She never liked the smell of it. Sheena flexed her biceps and told her to see how hard and strong it became.  Sherri felt it and noticed that it was harder than a solid rock.<br>\r\n<br>\r\nStill Sherri refused, thinking that she might throw up while eating it. Sheena smiled, understanding her fears. But Sheena could not wait. She grabbed the spinach and forced open Sherri's throat. Involuntarily, the spinach went in Sherri's mouth and down the throat. Sheena held Sherri's mouth open.<br>\r\n<br>\r\nSherri shook for a few seconds as the process of the muscles started growing in her. Almost instantly, some 2 or 3 inches of muscles grew on Sherri's own fairly fit body. She was now more alert too and felt much stronger.<br>\r\n<br>\r\nSherri smiled and said ' Hey, spinach is not so bad. I could learn to like it.' But before, they left. Sheena secretly stashed one more patch of spinach to take with them. <br>\r\n<br>\r\nSheena said 'Hey, let us go to the Temple of the God and drink the water now.' Are you ready to go now.'<br>\r\nSherri replied 'Sure, we could run there now' So they headed in the direction of the Temple. .</span></div></div>",
            "created":1355806800,
            "id":1490430,
            "title":"Sherri refused so Sheena had to force it down S..."
        },
        "1242321":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "go to the top of the temple",
                "try breaking through the wall/maybe door"
            ],
            "content":"<div class=\"\"><div> <span>The temple was not huge and fairly well concealed in the jungle. Sheena excitedly said to Sherri. 'Looks like we are here. Let me try to find an entrance. After 10 minutes of searching the ground, neither one of them could find it.  Sheena frowned and commented that maybe the door was concealed, somehow moved, or blocked off. <br>\r\n<br>\r\nSheena pointed to one section of the wall and said ' I am sure that the door used to be here. We could try breaking through it. But the door could be booby trapped or there was no door after all. Or we could try to get to the top and just break our way down to the ground. However the second option is more dangerous. We can't fly and just jumping down could kill us.<br>\r\n<br>\r\nSherri said 'Guess we will have to give up and go elsewhere. Sheena smiled ' Remember the Spinach. Take some more. Greater strength could help you here.' This time, Sherri swallowed it without resistance. Since it was a larger portion, both Sherri and Sheena took half each.  Each one of their muscles grew another 4 inches.<br>\r\n<br>\r\nYet Sheena felt that it was not enough. But Sherri wanted to try to get in. She said \" Sheena, both of us have some jungle survival training. Besides maybe we are stronger than we realized. This is wild spinach, not the domestic kind back in the US. I just realized that while reading the Survival Book a  week ago before the trip here. \"<br>\r\n<br>\r\nThen Sheena smiled. \"Well, I am willing to take a chance. How do you wish to get in the temple?\"<br>\r\nSherri looked back at the temple and decided to</span></div></div>",
            "created":1359867600,
            "id":1523435,
            "title":"They arrived but could not find an entrance."
        },
        "12423211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Sherrizan becomes a big, strong, powerful, muscular woman!",
                "Sherrizan becomes a young, powerful and beautiful Goddess!"
            ],
            "content":"<div class=\"\"><div> <span>Sheena examined the small hilltop from where she and Sherri were standing and saw that they could climb up to the top of the cavern and dig their way in from up above.<br>\r\n<br>\r\n\"Follow me!\" she instructed.<br>\r\n<br>\r\nSheena started to climb up the rocky walls of the outer cavern until she came to a patch of grass. Sherri was quietly behind her. <br>\r\n<br>\r\nThen Sheena started to wander around, looking for something she could pull on from the ground. She saw a small plant. She walked up to the plant and started pulling on it.<br>\r\n<br>\r\n\"Come! Help me pull it out of the ground!\"<br>\r\n<br>\r\nBoth her and Sherri started pulling on the plant until it came out completely, exposing the roots, and leaving a small hole in the ground.<br>\r\n<br>\r\n\"Get a rock with a sharp end so we can start digging!\"<br>\r\n<br>\r\nSherri got a rock and so did Sheena. After ten minutes of digging, the hole got deep enough, that it created an opening in the ground, leading to the upper ceiling of a hidden cavern!<br>\r\n<br>\r\n\"I hear running water!\" Sherri noted.<br>\r\n<br>\r\n\"Yes... The Spring of the Gods!\" Sheena smiled. <br>\r\n<br>\r\nThen Sheena slid down the hole, legs-first, and landed on the cavern floor. Sherri followed behind her, and they used the light from the hole in the ceiling to guide them through the darkness.<br>\r\n<br>\r\n\"Now that we got in... How will we get out?\" Sherri asked her.<br>\r\n<br>\r\n\"There is only one way... Through brute force, which you get from great strength!\" Sheena explained.<br>\r\n<br>\r\nThen, Sheena pointed at a small pond of water, which was before them.<br>\r\n<br>\r\n\"Drink the water from the Spring of the Gods!\" she ordered, as Sherri got down on her knees before the small pond. She dipped her hands in the water and drank a sip of the liquid.<br>\r\n<br>\r\n\"Ummm... I was so thirsty!\"<br>\r\n<br>\r\n\"Drink more! It will make you strong!\"<br>\r\n<br>\r\nSherri smiled as she took another sip of the enchanted spring...<br>\r\n</span></div></div>",
            "created":1369803600,
            "id":1599155,
            "title":"go to the top of the temple"
        },
        "124232111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "an enraged enhanced  strong Tarzan-type clone",
                "a lost biologist studying the plants there"
            ],
            "content":"<div class=\"\"><div> <span>Some more muscles appeared on Sherri's body. She now could look like a bodybuilder competitor. Sherri readjusted her hair and made it into a ponytail.<br>\r\n<br>\r\nShe laughed and said ' Wow, it really works. Feel this bicep.'  A 12 inch bicep popped up on her arms. And it was hard.But Sheena shook her head ' It is OK..but you need more. My biceps is 13 and 3/4. She revealed her biceps. Sheena continued ' I do not always reveal its bigness. But I want YOU to drink some more of it.'<br>\r\n<br>\r\nSherri was puzzled...But why don't you want to drink more?<br>\r\n<br>\r\nSheena said.... Well, I could but I have my reasons for not doing it.<br>\r\n<br>\r\nSherri drank a little bit more and now she looked like one of the best female bodybuilder, and perhaps possibly the best.<br>\r\nSherri laughed and said ' How about this ? It is bigger than your biceps now.<br>\r\n<br>\r\nSheena said ' Impressive but there are male that are stronger. But remember that I want you to be strong enough to break out of here through those walls. Not even Arnold Schzennagger can break through even in his prime.' Sheena found a discarded cup and filled it to the brim.  Sheena said ' This should do it without bruising or bleeding your hands. Drink up. Don't worry, It is OK to be stronger than me.'<br>\r\n<br>\r\nSherri pleaded to Sheena  'Okay, only if you drink a tiny bit more from the pond, even if it is a tiny bit. It would make me feel better since you are giving me this gift.'<br>\r\n<br>\r\nSheena sighed and said ' Okay, but just a tiny bit more' Sheena cupped her hand and drink a tiny bit.  The biceps on Sheena's arms grew another inch.   Sheena said ' That is enough for me. The pond is meant far more for you than me.'<br>\r\n<br>\r\nSherri then drank the entire portion from the cup. Then at the time, Sherri became a big, strong, young woman that could be compared to the Green Hulk....without the Green skin, of course.<br>\r\n<br>\r\nSherri then asked  ' is this OK now?'  Sheena smiled broadly and said YES.  <br>\r\nMeanwhile the pond of water disappeared so nobody else could drink except for Sherri and maybe Sheena too (if Sherri approves).<br>\r\n<br>\r\nSheena led Sherri to one of the cavern hardened walls and told her to punch away. Sherri was hesitating at first. But some of the rock in the wall gave way and a hole appeared.  Sherri gasped and said ' Hope that I am not too strong for you.'... Sheena laughed and said ' Nonsense, tell you what,let's pretend that an evil ruler trapped us in here and I needed medical help. Punch the wall as quickly and hard as you can.'<br>\r\n<br>\r\nSherri sighed and said ' okay, I will give it my best shot and as hard as I can.'<br>\r\nShe did want Sheena wanted. Getting out of the 100 yard rock wall took about 3 or 4 minutes since it WAS truly a hard challenge. Finally they could see the outside.   Sherri got excited and gave it one mighty kick this time. And her kick created a final hole that they both could get through. That final kick created a small boulder that rolled down into a valley before stopping. Then they both stepped through and gave each other a hug.<br>\r\n<br>\r\nSheena smiled ' Nobody would want to mess with you unless he was stupid'  They walked toward to the camp where Sheena first met Sherri. On the way, Sheena and Sherri saw someone standing in the trail blocking their way. It was <br>\r\n</span></div></div>",
            "created":1370062800,
            "id":1601524,
            "title":"Sherrizan becomes a big, strong, powerful, musc..."
        },
        "1242322":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "boa constrictors ",
                "the terrorists/ninjas"
            ],
            "content":"<div class=\"\"><div> <span>When they were almost at the temple, Sherri and Sheena decided to take a \"rest\" even though that they didn't really need one. They just wanted to feel the cool breeze in the air. Both of them wasn't really paying too much attention when suddenly <br>\r\n<br>\r\n1) a couple of boa constrictors wrapped themselves tightly around each one of them<br>\r\n2) one dozen of bloodthirsty  terrorists/ ninjas surrounded them</span></div></div>",
            "created":1420434000,
            "id":1913445,
            "title":"Something or someone blocked their way on the w..."
        },
        "1243":{
            "choices":[
                "A tree with magical fruit!",
                "A rare species of wasp sting from rivigorente!",
                "Next..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After meditating for a moment, Sheena remember there was another way to make Sherri physically stronger!</span></div></span></div>",
            "created":1347426000,
            "id":1425952,
            "title":"They decide to do something completely differen..."
        },
        "12431":{
            "choices":[
                "Sherri wants to test the strength of her new body!",
                "Sherri grows even more!"
            ],
            "content":"<div class=\"\"><div> <span>Sheena said to Sherri: - Wait for me here and do not move! I'll be back soon! - Sheena ran into the forest, while Sherri wondered what would bring. After a few minutes, Sherri saw Sheena back and had a most beautiful and bizarre fruit! It was a pear, when a large walnut trees, whose peel remembered an emerald glow. - Anyone who has the good fortune to eat this fruit can become very strong, big and muscular! - Sheena said, as he handed the result in the hands of Sherri. Sherri was thrilled! He had only to eat this fruit to become stronger and survive the Savannah! Without thinking twice, Sherri ate the fruit mystical and found the taste very sweet and tasty.<br>\r\n<br>\r\nWhen he had finished eating Sherri appearance for a minute, but nothing happened, then suddenly: - Ohmigod, it's as if my body was going to explode! - Sherri's legs slowly began stretching in length, her shorts creeping up her calves.  Her T-shirt began pulling tighter around her back, ripping in pieces by her shoulders.  Her breasts plowed through the front of her shirt, revealing huge melon-sized  tits. Massive, <br>\r\nfeminine muscle began growing as well, all over her titanic frame. The seams of her shorts came apart as iron-plated quadriceps grew right through them.  She looked down, admiring her newly formed amazonic body.<br>\r\n<br>\r\nSheena smiles pleased to see that his new protected area had already obtained excellent results thanks to the magical fruit. - This is unbelievable. This can't be MY body! - She flexed a mighty, massive bicep.  She marveled at its awesome, new size. - My arms are absolutely gigantic!  Hmmm, so's the rest of me! I gotta be over 10 feet tall! - Sherri was in seventh heaven for his new powerful body! Examining her body she was awed by just how big she had become. She loved it, feeling the rock-hard, immense muscles that she now possessed.</span></div></div>",
            "created":1373173200,
            "id":1624140,
            "title":"A tree with magical fruit!"
        },
        "124311":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "She challenges Sheena to wrestle her.",
                "She goes off to fight the most dangerous beast she can find."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she do it?</span></div></span></div>",
            "created":1375851600,
            "id":1641906,
            "title":"Sherri wants to test the strength of her new body!"
        },
        "124312":{
            "choices":[
                "Sherri eats all the other fruits!",
                "Sheena eating a magical fruit!"
            ],
            "content":"<div class=\"\"><div> <span>The growth of Sherri was still in place . Sheena did not imagine that the power of the magical fruit was so powerful at this point . - OMG! Again! I want more ! - Sherri screamed excitedly , and become ever more gigantic and muscular visibly . When finally the growth stopped abruptly , Sherri had become taller than fifteen feet high . More than fifty muscular male bodybuilders . More shapely and sensual Aphrodite . Sherri now looked like a young and beautiful woman with long golden hair and eyes that sparkled like diamonds. I no longer had any clothing on him. Given that all his clothes had been reduced to rags due to the incredible growth. Thus it was that Sheena got him a bikini , made with lion skin , big enough to cover his private parts. - Watch Sheena ! Now I'm the queen of Savannah ! - Sherri exclaimed excitedly , while doing bodybuilding poses in front of Sheena , who looked at her with admiration and envy.</span></div></div>",
            "created":1385960400,
            "id":1701990,
            "title":"Sherri grows even more!"
        },
        "12433":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Sheena decides to drink first and see if it's safe.",
                "Sherri drinks the potion first."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sheena just happened to have a potion she got from a grateful shaman. It was said to have been made with drops of blood from the most poweful animals in all the jungle. One drink was enough to turn anyone into a mighty warrior. Who drinks it?</span></div></span></div>",
            "created":1383022800,
            "id":1686079,
            "title":"Next..."
        },
        "124331":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Drank down the rest of the potion anyway.",
                "Refused so Sheena forced it down her throat."
            ],
            "content":"<div class=\"\"><div> <span>Sheena quickly took a portion of the potion ( 10%) of it. She smiled and replied to Sherri. \" Hmmm.  It tastes like apple juice. Hopefully it works like the shaman told me. \"  Sheena only had to wait a few seconds. Then more muscles appeared on her already fit body. Her abs were even more hardened. Soon Sheena was able to lift an couple ofAfrican elephantswith just some strain now, if she tried. At the same time, she was much more limber and fast. <br>\r\n<br>\r\nThe potion was able to give her martial arts skills  20% better than the best Olympics competitor. Sheena showed an impressive bicep flex as well as a couple of impressive martial arts moves.<br>\r\n<br>\r\nSherri was amazed that it worked so well. Sheena handed over the rest of it to Sherri. Sheena told her encouragingly to drink the rest of it .  Sherri paused a couple of seconds out of fear. Then</span></div></div>",
            "created":1383022800,
            "id":1686098,
            "title":"Sheena decides to drink first and see if it'..."
        },
        "124332":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "\"Try some!",
                "\"Let's Wrestle\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sherri only took a bit of the potion because she was nervous but it worked instantly.  she soon looked older with a body that was equal to Sheena. She felt strong and healthy and vital. She turned to Sheena and said...</span></div></span></div>",
            "created":1388984400,
            "id":1723282,
            "title":"Sherri drinks the potion first."
        },
        "1243322":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "They wrestle and Sherri wins. Sheena drinks the potion. ",
                "They wrestle and Sheena wins. Sherri drinks more potion."
            ],
            "content":"<div class=\"\"><div> <span>Sheena was a bit surprised by this rather bold challenge and tried to laugh it off. \"Don't be silly\" she told Sherri \"I'm much more experienced and skilled than you are. Besides, you only took a bit of the potion. I'll bet I'm still stronger.\" With that said, Sheena flexed her muscles fully this time, making them bulge to impressive size. She only meant to make Sherri see reason with this little bit of intimidation but the girl just laughed instead. <br>\r\n<br>\r\n\"You're just scared, that's what!\" Sherri teased \"you know I'm stronger than you now, the new Jungle Queen.\" The young girl then flexed her own muscles and they bulged even larger and more impressive than Sheena's! It seemed the potion was working more magic on Sherri even then.<br>\r\n<br>\r\nSheena was angry now. How dare this young girl who was only strong because of her challenge and then mock her!? \"Alright then, you're on\" Sheena declared \"let's wrestle!\"   <br>\r\n </span></div></div>",
            "created":1389070800,
            "id":1723319,
            "title":"\"Let's Wrestle\""
        },
        "13":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Use martial arts",
                "Eat a can of spinach",
                "Make a weapon",
                "Reader's choice",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The tiger growled and began to stalk forward. Sherri could sense it believed she was an enemy and needed to defend herself. What does she do?</span></div></span></div>",
            "created":1465448400,
            "id":2161373,
            "title":"a Tiger "
        },
        "132":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Sheena, the jungle queen",
                "Jane,TARZAN'S wife",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Sherri reached into her shirt and pulled out a can of spinach. Downing its  contents, she flexed a huge bicep with an image of a battleship before rushing towards the tiger. A single punch sent the big cat flying. Sherri smirked and  decided it was time to move on. She eventually met...</span></div></div>",
            "created":1465534800,
            "id":2161968,
            "title":"Eat a can of spinach"
        },
        "1321":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Jealous",
                "Intimidated",
                "Impressed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sheena had been hunting the tiger when it found Sherri. She had been prepared to step in when she saw what the new girl had done. How did she feel about a new girl possessing such power?</span></div></span></div>",
            "created":1594121040,
            "id":2863334,
            "title":"Sheena, the jungle queen"
        },
        "13211":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Find ways to become stronger",
                "Find ways to weaken Sherri"
            ],
            "content":"<div class=\"\"><div> <span>Sheena knew that she was mighty enough to match even the great Tarzan, but even she couldn't defeat a tiger with one blow. Though she knew her muscles were powerful, they weren't nearly as big as this new girl's. Could this stranger mean to challenge her for the title of jungle queen? Sheena refused to allow it. She quickly set about on a plan to dethrone this newcomer. What would she do?</span></div></div>",
            "created":1594121940,
            "id":2863346,
            "title":"Jealous"
        },
        "132111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "To town to a grocery store.",
                "To the temple praying to be stronger than Sherri",
                "To a crazy mad scientist who supposedly makes super soldier strength formulas."
            ],
            "content":"<div class=\"\"><div> <span>Sheena knew that Sherri ate some green stuff in a can but wasn’t sure what it was.  For now, she just grinned and endured it.<br>\r\n<br>\r\nShe wondered what to do as she departed. Sheena knew a few letters SPI and the can had a picture of a sailor on it<br>\r\n<br>\r\nShe decided to go</span></div></div>",
            "created":1596833460,
            "id":2881941,
            "title":"Find ways to become stronger"
        },
        "1322":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Jane showed her black eye that Tarzan did to her.",
                "Jane said that Tarzan spent too much time with his big animals and chimpanzee. ",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Sherri found some grapevines that led to a hut in the trees.  She climbed  a nearby tree and grabbed one of the vines.  Sherri swung across a few vines until she reached Tarzan's Hut.  Tarzan was not there.  But Sherri encountered a weeping Jane.<br>\r\n<br>\r\nSherri gently said to Jane  What Happened?</span></div></div>",
            "created":1466139600,
            "id":2165756,
            "title":"Jane,TARZAN'S wife"
        },
        "13223":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "A Jungle Gym {pun intended}",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Jane said that she was jealous of the powerful jungle women like Shena and wanted to be more like them so Tarzan would take her adventuring. Sherri understood and wished she could help but she was out of spinach. They decided to find other means to help Jane to help Jane bulk up. Where do they go? </span></div></div>",
            "created":1466139600,
            "id":2165832,
            "title":"something else"
        },
        "132231":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Workout",
                "Sign up for the \"Queen of the Jungle\" bodybuilding contest."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>{I know this is a bit cartoony but let's just go with it.} As it so happened, there was a kind of gym built into the treetops a ways from the Tarzan home. Sherri took Jane there to...</span></div></span></div>",
            "created":1466139600,
            "id":2165834,
            "title":"A Jungle Gym {pun intended}"
        },
        "1322311":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "A big ape",
                "Sheena, the Jungle Queen"
            ],
            "content":"<div class=\"\"><div> <span>They started lifting weights made of trees and rock. While Jane struggled quite a bit, Sherri was rapidly gaining muscle. She soon resembled a young Amazon warrior and everyone was impressed. As the crowd gathered round to cheer her on, Jane glared jealously. Suddenly, someone came up and challenged Sherri to arm wrestle. It was... </span></div></div>",
            "created":1467262800,
            "id":2173012,
            "title":"Workout"
        },
        "13223112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "nobody was budging.",
                "Sherri was almost already winning... almost."
            ],
            "content":"<div class=\"\"><div> <span>Sheena arrived with her hair done 'perfectly' and in a slim athletic body that revealed  impressive abs. Sheena said to Sherri  in a confident voice  ' Finally I found this place.  I need to find a good challenger and that person is YOU, Sherri.  Are you willing to take me on now?'<br>\r\n<br>\r\nSherri smiled coyly back at Sheena ' Sure, I welcome any challenge.'  Sherri turned back to whispered to Jane ' Watch and learn.  You will get your husband back. He loves muscles on girls.'<br>\r\n<br>\r\nThen Sheena and Sherri sat around a stone table and locked arms in place to start.  A gardener in the village was the referee and made sure that the girls were ready to begin.. Then he said  GO<br>\r\nThe match began.  After a minute,</span></div></div>",
            "created":1467349200,
            "id":2173644,
            "title":"Sheena, the Jungle Queen"
        },
        "14":{
            "choices":[
                "A giant lioness with the maternal heart!",
                "An old woman shaman by mystical powers!",
                "A pack of wolves!",
                "A group of indigenous local!",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Those who meet Sherri?</span></div></span></div>",
            "created":1347339600,
            "id":1425188,
            "title":"(your choice)"
        },
        "144":{
            "choices":[
                "Sherri and the natives come in a great golden palace!",
                "Sherri and the natives arrive at the foot of a majestic temple!",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>Sherri saw a group of indigenous Africans who approaches her with kind eyes and sempravanno not have bad intentions on her. One of them stepped forward, took her hand gently and Sherri said: - You are the \"Selected\"! Queen Shaila wants to see you now!<br>\r\n<br>\r\nWhile the natives and Sherri walked the savannah, the latter chiesse what it meant that she was the \"Selected\" and who was this Queen Shalia!</span></div></div>",
            "created":1347339600,
            "id":1425195,
            "title":"A group of indigenous local!"
        },
        "1441":{
            "choices":[
                "Yes!",
                "No!",
                "Sherri is in doubt!"
            ],
            "content":"<div class=\"\"><div> <span>After walking the savannah, the African tribe led Sherri front of the entrance of a palace made ​​all of gold, intimandola to get to meet the Queen Shalia.<br>\r\n<br>\r\nOnce inside the imposing gates of the palace, Sherri found himself in a large and beautiful room with walls, floors and ceilings of gold and everything was studded with jewels bright.<br>\r\n<br>\r\nSherri you look around in astonishment, then remained sciocata for what he saw in the back. There was a giant throne made of gold and sitting on it, there was the most amazing creature that Sherri had ever seen!<br>\r\n<br>\r\nIt was a beautiful African woman, which is about ten feet high and with muscles that would have ridiculed the greatest world champion of bodybuilding. That woman immense body Herculean sensual wore necklaces, bracelets and earrings made ​​of solid gold. the only dress she wore was a seductive bikini, whose fabric remembered the color of gold and the bandeau bra wrapped in a harmonious way and rushing the mighty breast of the queen. The queen had hair down to the bottom and blacks. her green eyes throwing glances of pride, sweetness, charm, wisdom and power!<br>\r\n<br>\r\nThe mighty queen then rose from his golden throne and approached Sherri steps with sensual and powerful, worthy of a panther! When he was a few steps from Sherri, the Queen knelt in front of the girl. Sherri could not do at least admire the incredible woman, whose eyes exuded strength, majesty and kindness.<br>\r\n<br>\r\nThe Queen said in a sweet voice and powerful: - So you're the little girl found from my sequaci and you're also \"She\" we've been waiting!<br>\r\n<br>\r\nSherri nodded, though he did not understand what he meant exactly the Queen!<br>\r\n<br>\r\nThe Queen said: - Let me introduce myself, I Shalia, the Amazon Queen of Africa! You must know that an ancient prophecy says: A young girl fell from the sky, from far blonde hair as the sun, bright as joy, as gentle as a flower, beautiful as a lioness, will bring salvation in Africa and will be then that we will be peace, courage and hope!<br>\r\n<br>\r\nAt these words, Sherri stroked her long blond hair!<br>\r\n<br>\r\nThe Queen Shalia went on to say: - If you choose to bring salvation in Africa, you will become bigger, stronger and better, than when it is me! - So saying, Shalia stood up and made a bodybuilding pose, so as to understand what Sherri would get if he chose to save the land of Africa: Beauty, strength, power, wisdom, royalty and would have been raised as a goddess!<br>\r\n<br>\r\n- So, accept small girl? - Churches Shalia The Queen!</span></div></div>",
            "created":1347339600,
            "id":1425217,
            "title":"Sherri and the natives come in a great golden p..."
        },
        "14411":{
            "choices":[
                "The choice is yours! (1)",
                "The choice is yours! (2)"
            ],
            "content":"<div class=\"\"><div> <span>- Yes! I accept what you asked me, Shalia! Protect Africa and bring order and peace! - Sherri said resolutely, as she loved Africa and would do anything for that land!<br>\r\n<br>\r\nHappy for the words of Sherri, Queen Shalia said proudly - Then give thee all the great power of Africa! - So saying, Shalia raised his arms to the sky and his eyes lit up with a golden light. then his whole body turned into energy shiny and golden and then enter the whole body of Sherri through the mouth. for a few seconds, Sherri of lifted upward by a force insisibile and his eyes became beams of blinding golden light. Sherri then back down to the ground and heard a voice became ethereal Shalia to echo in the room for a moment before disappearing:<br>\r\n<br>\r\n\"Now you have within you all the ABSOLUTE POWER AFRICA! <br>\r\nHave the power of the Virgin of beauty, love and sensuality.<br>\r\nThe power of the lion for courage, honor and kingship!<br>\r\nPower of the Rainbow for peace, joy and freedom!<br>\r\nthe power of the Blue Flower for happiness, wisdom and generosity.<br>\r\nPower of the Bue Red for strength, muscle and size!<br>\r\nFinally, the power of the Great Heart Aficano for Spirit, Wisdom, and the absolute Commando on plants, animals and elements!<br>\r\nNow everything depends on you, girl! Use these gifts to save Africa and make it strong and solid as a rock! Good luck! \"<br>\r\n<br>\r\nIt was then that Sherri began its transformation supreme!</span></div></div>",
            "created":1347339600,
            "id":1425229,
            "title":"Yes!"
        },
        "144111":{
            "choices":[
                "\"Take me to your village!\"",
                "\"Bring me the warrior brave and noble of your village!\""
            ],
            "content":"<div class=\"\"><div> <span>Sherri felt her body explode in a magnificent and terrible power! Her body then began to grow in height and filled with huge muscles and shapely feminine curves. Sherri could not do at least moan with pleasure at the transformation that was undergoing at the time. Her body was transformed into a little girl to a beautiful adult woman. His clothes were magically replaced by a gold-colored bikini, similar to that of Queen Shalia!<br>\r\n<br>\r\nHer legs stretched out, becoming more streamlined and attractive, then swell of muscle increasingly bulky and heavy. The calves and thighs were so big, muscular, sensual and powerful sound of steel. On her belly was discovered carved a series of twelve abdominal incredible, bigger, beautiful and powerful. The rest of the chest was filled with harmonious muscles, huge and powerful, from chest to back. The hips, buttocks and breasts Sherri became more attractive and shapely curves to that of Aphrodite. The shoulders was muscular, gigantic and robust. The arms became long, sensual, muscular and powerful.<br>\r\n<br>\r\nSherri continued to grow more and more in height and muscle. By then she had already exceeded twenty feet high and continued to grow. The blonde hair Sherri grew up with her body, becoming long knee-deep, voluminous and light. The foliage of Sherri had been transformed into a majestic and mighty river of gold. Sherri moaned pleasantly to hear the divine power that throbbed in her immense body and increased more and more. She was already over fifty feet high and his whole body was a huge mountain of muscle titanic and sensual curves. Sherri was becoming increasingly massive and powerful, that her head touched the ceiling of the palace of gold. The building then began to fill cracks and shaking and then fell abruptly after a few seconds, while Sherri continued to grow unabated and impressive.<br>\r\n<br>\r\nIn the end, from the rubble of the destroyed building, Sherri emerged, which continued to grow more and more. Sherri was now a huge mountain of power and sensuality and gold bikini she wore stood out on her divine body. Her face was beautiful and sweet mature woman, her eyes were like two suns fiery red lips and curvy, tanned skin and bright nails of hands and feet were painted gold. The growth of Sherri stopped when it was over one hundred feet high. The whole body of Sherri overflowing with muscle power and feminine sensuality endless. The natives of the first lent themselves to the new and colossal goddess, ready to obey his orders. With a woman's voice that reminded the harmony of nature and the fury of the storms, Sherri ordered:</span></div></div>",
            "created":1356152400,
            "id":1492820,
            "title":"The choice is yours! (1)"
        },
        "145":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Jane, Tarzan's wife.",
                "An amazon woman",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these?</span></div></span></div>",
            "created":1491627600,
            "id":2301542,
            "title":"Next!"
        },
        "1451":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Attack the snake with a weapon",
                "Eat a can of spinach",
                "Throw Jane a can of Spinach."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jane was out in the jungle after a fight with Tarzan, trying to prove she had developed into a mighty Jungle woman. This was when a giant snake attacked her and Sherri heard her scream for help. What could Sherri do?</span></div></span></div>",
            "created":1533431640,
            "id":2529114,
            "title":"Jane, Tarzan's wife."
        },
        "14512":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Sherri pulled out a can of spinach and downed it's contents. She proceeded to flex a huge bicep and bellow a mighty tarzan yell before lunging at the giant snake. Jane was shocked to see this young girl free her and easily beat up the massive predator. She began to feel very angry and jealous.</span></div></div>",
            "created":1533432180,
            "id":2529121,
            "title":"Eat a can of spinach"
        },
        "145121":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "She steals the spinach from Sherri",
                "She politely asks for some spinach"
            ],
            "content":"<div class=\"\"><div> <span>Jane watched Sherri for a moment and pondered what to do in order to gain such power for herself. She imagined growing muscles bigger than tarzan and besting both him and Sheena in combat. The jungle woman always made her feel jealous anyway. But how to get the incredible vegetable for herself?</span></div></div>",
            "created":1596631680,
            "id":2880907,
            "title":"Continue"
        },
        "14513":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "devour the entire can of spinach",
                "eat half of it before almost gagging  BLAH. But she ate half of it.",
                "only put down a spoonful in her mouth and threw it back at Sheri."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sherri shouted at her ' Swallow it quickly. It will help you defeat the snake.'<br>\r\nJane was unsure yet fearful decided to</span></div></span></div>",
            "created":1534535040,
            "id":2534929,
            "title":"Throw Jane a can of Spinach."
        },
        "145131":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Challenge Tarzan",
                "Challenge Sherri"
            ],
            "content":"<div class=\"\"><div> <span>Jane immediately burst from the snake's grip and landed on her feet as the change took place. Instantly, her proper English dress became the animal skin clothing of an Amazon warrior and her muscles swelled and bulged until they were equal to that of Tarzan herself. Jane proceeded to beat her chest and unleash a Tarzan yell of such force and power that it sent the snake flying away. She than gazed down at her new physique in awe. What does she do next? </span></div></div>",
            "created":1534547520,
            "id":2534979,
            "title":"devour the entire can of spinach"
        },
        "1451311":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "boxing.",
                "arm wrestling.",
                "pull ups until one of us drops"
            ],
            "content":"<div class=\"\"><div> <span>Jane groaned a little bit.  ' I did always like that English dress that made me look so proper.'  But she smiled ' I can find a tailor that can make a new one for me with room to spare.'  She flexed her biceps and smiled ' Wow, this does me make look more confident and healthy.  I may be able to challenge Tarzan now.  I hope that Tarzan will accept the new ME.'<br>\r\n<br>\r\nJane and Sherri baked a  few potatoes with some sour cream and shredded cheese on top for dinner later. Meanwhile, Jane and Sherri found some fighting sketches that Tarzan had in his room and practiced that for an hour.  They were barely tired when Tarzan came home.<br>\r\n<br>\r\nSherri beamed at  Jane and said to Tarzan ' Do you like the New improved Jane? She can help you out around the jungle.  Jane smiled seductively and flexed.  Tarzan was not that impressed yet not mad.  He said Mmmm, the jungle do not care about the females.  You will still have to survive out here.  And the warrior tribes, for the most part, are not friendly. That includes some animals that I haven't trained.<br>\r\n<br>\r\nJane boldly said to Tarzan ' Let us see how helpless I am. I want to challenge you...in</span></div></div>",
            "created":1535154900,
            "id":2538443,
            "title":"Challenge Tarzan"
        },
        "14513111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Jane and Tarzan are equally matched.",
                "The spinach wears off and Tarzan starts to win. Sherri steps in."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tarzan reluctantly accepted and put on some leapord skin boxing gloves. Jane did the same and the two began circling each other. Jane made the first move and the brawl was on! </span></div></span></div>",
            "created":1535180160,
            "id":2538549,
            "title":"boxing."
        },
        "1451312":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Boxing Match",
                "Wrestling match",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>The newly amazonian Jane suddenly felt intoxicated by her power. She felt as though she could do anything! It was then that she caught sight of Sherri and snarled \"what are you looking at, weakling? You think you can defeat me? I challenge you to a-!\" </span></div></div>",
            "created":1550024100,
            "id":2616931,
            "title":"Challenge Sherri"
        },
        "1452":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The amazon wants to challenge Sherri to a contest of strength!",
                "The amazon wants to adopt her?",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Sherri was shocked to see a woman approach her, but it was no ordinary woman! Tall and muscular with flaming red hairr, she was a true woman of the jungle. Sherri looked in her eyes and saw nothing but primal instinct. The question was, what did she want?</span></div></div>",
            "created":1491627600,
            "id":2301547,
            "title":"An amazon woman"
        },
        "14521":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Sherri accepts, but asks for a week to bulk up and train.",
                "Sherri accepts right there."
            ],
            "content":"<div class=\"\"><div> <span>The Amazon sneered at Sheri. \"I am Skyla of the Amazon! I come to challenge you to a warriors' trial. This will consist of a wrestling match, spear throwng competition, a flex-off, and a tarzan yell contest!\"<br>\r\n<br>\r\nSherri was shocked to be challenged this way, particularly to a flex-off. Skyla's muscles were far superior to her's. Yet, the girl was too proud to outright refuse. What could she do? </span></div></div>",
            "created":1491627600,
            "id":2301554,
            "title":"The amazon wants to challenge Sherri to a conte..."
        },
        "145211":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Magical means.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Skyla agreed and went off to hunt. Sherri was now wondering how she would bulk up by the end of the week. What did she choose? </span></div></span></div>",
            "created":1491627600,
            "id":2301598,
            "title":"Sherri accepts, but asks for a week to bulk up ..."
        },
        "1452111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The can of spinach.",
                "The magic word."
            ],
            "content":"<div class=\"\"><div> <span>Sherri knew she had some supposedly magical means at her disposal and decided to use them. She pulled out two items: a can of spinach and a piece of paper with a strange word on it. The word was supposedly a magical acronym that could bestow the combined abilities of mighty heroes onto whoever said it. Great strength, stamina, and power were key aspects of this transformation.  The spinach was also said to bestow great strength and belonged to a legendary sailor who had many adventures against various foes. Some stories described women getting a taste of the same power and reveling in it. Which should Sherri choose?</span></div></div>",
            "created":1491635160,
            "id":2301603,
            "title":"Magical means."
        },
        "14521111":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Skyla sees this and decides to cheat.",
                "Follow Sherri through a week of training and an all spinach diet."
            ],
            "content":"<div class=\"\"><div> <span>Sherri opened the can of spinach and downed it's contents. She then flexed up a huge bicep that had an image of a volcano on it! she knew that the boost from the spinach would allow her to gain even more muscle and strength from simply working out. Skyla wouldn't know what hit her!</span></div></div>",
            "created":1491637440,
            "id":2301617,
            "title":"The can of spinach."
        },
        "14521112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Skyla wanted to flee..",
                "Skyla wanted to still fight.",
                "Skyla wanted to try to be allies"
            ],
            "content":"<div class=\"\"><div> <span>Thanks to Mary Marvel's hint to her, Sherri smiled and simply said the word SHAZAM.  A bolt of lightning came from a nearby storm cloud and hit her. But it caused her no damage. It immediately gave her the great strength,stamina, and power she was hoping to obtain. She also had a Lightning logo on her shirt.<br>\r\n<br>\r\nSherri smiled and thought ' Looks like things are fairer now.  She flexed her biceps and examined her abs. Wow, I wonder how she would react to my figure now.  Will she back out, still fight me, or something else.<br>\r\n<br>\r\nWhen Sherri came back and announced that she was ready....</span></div></div>",
            "created":1492189140,
            "id":2305028,
            "title":"The magic word."
        },
        "14522":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "But that will take some time and discipline ",
                "Easy, piece of cake",
                "She says something else."
            ],
            "content":"<div class=\"\"><div> <span>The Amazon picked up the 12 years old Sherri and hugged her---<b> please let me adopt you.  I can teach and train you so that you can defend yourself out here too.</b><br>\r\n<br>\r\nSherri nodded and pointed at her biceps and said ' Can you help me get muscles and abs like that too.'<br>\r\n<br>\r\nThe Amazon replied </span></div></div>",
            "created":1494889140,
            "id":2320014,
            "title":"The amazon wants to adopt her?"
        }
    },
    "info":{
        "author_id":"hawksoup",
        "author_name":"Moe",
        "brief_description":"This is a different twist from the Tarzan stories on a new character Sherri",
        "created":1333490640,
        "description":"<td align=\"left\" class=\"norm\">This time, on another part of the jungle that Tarzan was unaware, someone else was marooned as a young rather fit girl before being rescued by ____. But Tarzan was not aware of it since they were miles and miles apart.<br>\r\n<br>\r\nPlease NO sex,bad language, nudity,or killing off Sherrizan (  Sherri as her nickname). Keep it up to PG13.<br>\r\n<br>\r\nYes, it is muscle growth but the amount is up to you. And not everything have to be MG. She do not have to be that strong if you wish that she is not. But she is somewhat intelligent.<br>\r\n<br>\r\n(this is just a fan fiction story. I do NOT make any money from it. This is just for fun and those who wish to show or practice their creative writing.)</td>",
        "id":1859148,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/100978.jpg",
        "last_full_update":1596833460,
        "modified":1596833460,
        "pretty_title":" Sherrizan the junglegirl"
    }
}