{
    "chapters":{
        "1":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Human women weight gain?",
                "Angel women weight gain?",
                "Monster female weight gain?",
                "Demon female weight gain?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, Internet user and TV viewer, what kind of female will gain weight?</span></div></span></div>",
            "created":1334034000,
            "id":1313061,
            "title":"Beginnings "
        },
        "11":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Jessica (Sam's girlfriend from the pilot)",
                "Jo (The Winchester's hunting buddy)",
                "Lisa (Dean's many-times lover and girlfriend)",
                "Carmen (Dean's girlfriend in his genie-created fantasy world)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, which sexy Earth-bound girl is going to end up plumping out?!<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1334034000,
            "id":1313066,
            "title":"Human weight gain"
        },
        "111":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Jess is cursed by the demon!(fast weight gain-supernatural)",
                "Jess overeats because she is anxious and misses Sam!( slow weight gain-natural)",
                "other choice"
            ],
            "content":"<div class=\"\"><div> <span>  (starts at the end of the pilot episode of the show, which ends quite differently this time!, spoilers for season 1))<br>\r\n<br>\r\n   \"Bam!\" The sound of Sam's shotgun blast rang out, with the rock salt JUST missing the yellow-eyed demon(who had teleported out of the way) and Jess's head! Jess screamed as the demon reappeared just a few few away and started saying a few words in a language she could not understand while gesturing toward her body. It was unclear whither he had finished what he was saying before Dean's shotgun blast hit the demon in the center of his chest, temporarily sending him away.<br>\r\n<br>\r\n  \"I guess it was a good thing we rushed you back home, Sammy. Apparently you where right, it wasn't just a dream!\" Sam just nodded and quickly closed the distance between himself and his seriously freaked out girlfriend, who quickly embraced him in a quick hug. Explanations could come later. For now, Jess was just happy to be alive.<br>\r\n<br>\r\nThe next morning...<br>\r\n<br>\r\n  The previous night;s events had, to put it mildly,been a real eye opener to Jess, as her boyfriend and his brother finally explained their families line of work, the dangers it entailed, why Sam had tried to leave that life behind, and why that was no longer possible:Obviously, the \"yellow eyed demon\" the brothers told her about was still gunning for the Winchesters' friends and loved ones. The only solution was for the two young men to get to their father and find a way to stop the demon who had changed their family's life forever. Understandably, Jess was more than a little upset that Sam had not told her any of this before, but calmed down after realizing she wouldn't have believed him before the events of tonight anyway. After coming to grips with the situation, Jess offered to travel with Sam and Dean and help them find their father. This offer was emphatically rejected by both hunters, who insisted she did not have the proper training to go on hunting missions, and would just get in the way. Furthermore, Sam reluctantly voiced his belief that Jess and him should break things off now, as the brothers would be traveling a lot, and ceasing their relationship might make Jess less of a target. Dean agreed that would be the smarter thing for the couple to do. But then again, Sam had always been the smart, cautious one in the relationship, Jess was the risk taker that kept the relationship interesting, fun, and resistant to Sam's overly-serious demeanor, and she would have none of it. \"No, I understand why you have to go, Sam, but I would rather have you over long distances than not at all! I understand the risks to my safety, and I'm willing to take them! Just stop by here whenever you can and call me every day, ok?\" Therefore, it was reluctantly decided that Sam and Jess would not break up, and she would stay in Palo Alto(she still had one more year of school to finish) while the Winchesters tried to find their father. Sam would keep in touch with her, but couldn't ever tell her where he was or what he was doing, just in case Jess was captured by the demon and interrogated. Furthermore, Jess's house was \"demon proofed\" with rock salt and holy water, and she was to keep plenty of both substances on her person at all times.<br>\r\n<br>\r\n   The boys left at dawn, and Jess was once again, alone, And this time she felt even less safe by herself than usual, knowing there actually were \"things that go bump in the night\" that, apparently, wanted her dead. Furthermore, Jess remembered the strange words  the demon had spoke in her direction. It almost sounded like a spell or something, She had forgotten to mention this to the boys, and she was not sure they had heard the demons speaking(the voice had almost seemed to come from inside her head). However, she couldn't be sure that she hadn't just imagined the voice, or if \"old yellow eyes\" chant had been completed, even if it were real.<br>\r\n<br>\r\n  All in all, Jess would have a great many things to worry about that year, and very soon she would have yet another thing to agonize over...<br>\r\n<br>\r\n    But right, now, Jess's stomach was rumbling. It was time for breakfast.<br>\r\n<br>\r\n   So....how will Sam's girlfriend gain weight?</span></div></div>",
            "created":1334271600,
            "id":1314053,
            "title":"Jess's expansion!"
        },
        "112":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "overeating(natural gain)",
                "demon or curse (supernatural gain)",
                "other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will this second-generation hunter \"expand her horizons\"?</span></div></span></div>",
            "created":1335393000,
            "id":1322661,
            "title":"Jo "
        },
        "113":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Overeating out of anxiety for Dean (natural weight gain)",
                "From a demon or curse Dean accidentally brings home(supernatural gain)",
                "other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Dean's on again, off again flame become plus sized?</span></div></span></div>",
            "created":1335393540,
            "id":1322668,
            "title":"Lisa"
        },
        "114":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "picks up Dean's eating habits",
                "starts out fat (Dean secretly likes big girls?)",
                "other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Dean's dream girl put on weight?</span></div></span></div>",
            "created":1335544680,
            "id":1323678,
            "title":"Carmen"
        },
        "115":{
            "author_id":"jcjonesacp",
            "author_name":"The jay",
            "choices":[
                "Hell yeah",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bella Talbot (the sneaky artifact thief)</span></div></span></div>",
            "created":1355586780,
            "id":1488511,
            "title":"other"
        },
        "1151":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Naturally? (laziness, eating too much, etc.)",
                "Supernaturally? (spell, demon, curse, etc.)",
                "Other choice?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But how will she gain weight?</span></div></span></div>",
            "created":1355608080,
            "id":1488687,
            "title":"Yes!"
        },
        "1152":{
            "author_id":"xander764",
            "author_name":"Xander764",
            "choices":[
                "Becky Rosen",
                "no thank i would like...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about Becky Rosen Sam fan girl and one time wife</span></div></span></div>",
            "created":1373472000,
            "id":1625838,
            "title":"What about...."
        },
        "11522":{
            "author_id":"gforce77",
            "author_name":"DragonofInsanity",
            "choices":[
                "Yes!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do you feel about Cassie Robinson, Dean's Old love from \"Route 666\"?</span></div></span></div>",
            "created":1382143080,
            "id":1681142,
            "title":"Cassie Robinson"
        },
        "115222":{
            "author_id":"gforce77",
            "author_name":"DragonofInsanity",
            "choices":[
                "Yes!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, how about Sarah Blake?</span></div></span></div>",
            "created":1382143500,
            "id":1681147,
            "title":"Sarah Blake"
        },
        "12":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Anna",
                "Raphael(female host)",
                "other choices (if there are any)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which celestial beauty is going to start looking more cherubic?</span></div></span></div>",
            "created":1334120400,
            "id":1313167,
            "title":"Angelic weight gain?"
        },
        "121":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Reborn as a fat, hungry woman! (supernatural weight gain)",
                "Overeating out of depression! (natural weight gain)",
                "other choice"
            ],
            "content":"<div class=\"\"><div> <span>(Takes place after Season five, spoilers for up to the end of that season!)<br>\r\n<br>\r\n  Anna was depressed. This wasn't a new emotion for her. She had felt it the last time she had been human. However, this time was definitely different. This time she actually knew why she felt that way, and this time, she knew she deserved to be unhappy. And it was all because of the Winchesters.<br>\r\n<br>\r\n   In short, she had betrayed them. Even after Sam and Dean had risked everything to help her keep her freedom and get her angelic powers back, she had had tried to kill their parents before they were born. Oh, she had good reasons, at least they seemed good at the time: She was going to stop the apocalypse and save the world. It didn't seem to matter at the time that she would have to erase a lover and a friend from existence in order to do that. But then...<br>\r\n<br>\r\n  Then she had been killed by the archangel Michael. Everyone else had thought that was the end of her story, but it wasn't. And that was the real tragedy.<br>\r\n<br>\r\n    It turned out angels didn't die the same way people did. When a human's body was destroyed, they went to heaven or hell. When an angel died(a rare occurrence) their soul had nowhere to go, since their heavenly form was destroyed, and their souls were still too pure for hell( although an exception had been made for the corrupt Lucifer. who had been caged). Therefore, angels who died became earthbound, taking on corporeal form and possessing fully grown human bodies, but usually no memories of what they had been or done. Many become homeless wanderers or were locked in mental institutions. Anna was different. She had been human before, and regained her celestial form for a time. Having made a similar transition once. she remembered everything, which only made things worse.<br>\r\n<br>\r\n   Oh, she knew how to survive as a human alright, but she was plagued with guilt over what she had done; especially after the apocalypse came and went. The world had been saved without the eradication of Sam and Dean from the timeline. In other words, the terrible actions that had made her a traitor and gotten her killed had been completely unnecessary!<br>\r\n<br>\r\n   Now Anna was once again earthbound; with few friends and no family to her name. She deserved neither. But the worst was yet to come for the fallen angel...  <br>\r\n<br>\r\nHow will Anna gain weight?<br>\r\n<br>\r\n </span></div></div>",
            "created":1334795280,
            "id":1318573,
            "title":"Anna"
        },
        "1211":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Vanessa, inviting Anna to an all-you-can-eat buffet!",
                "Castiel, who claims responsibility for Anna's current condition!",
                "The Winchesters, who have somehow found out about Anna's plight!"
            ],
            "content":"<div class=\"\"><div> <span>   Anna was now fat. VERY FAT. Remarkably, Anna's face and body looked exactly the same as her last form, except for the tiny detail that she now had 300 hundred additional pounds of fat covering her significantly larger frame, from her plump feet, ankles, thighs and waist all the way up to her pudgy face, complete with chubby cheeks and a large double chin. But the areas of Anna's new body hit the hardest by her new pudge were her bubble butt, large, sagging breasts, and her enormous belly, which always hung over her extra large pants from Lane Bryant.<br>\r\n<br>\r\n   Looking in her mirror while naked one morning, Anna sighed.The former angel knew that, for some reason, she had been reborn in this super obese body instead of her former human form, which had been considerably slimmer, and had woken up in the present, shortly after the apocalypse was over, instead of the year she had died in the past, but she didn't know why. Part of Anna thought someone, or something, was probably punishing her for her betrayal of the Winchesters by forcing her to be reborn in her present circumstances, but she couldn't be sure who. 'It would serve me right.' Anna admitted to herself with a sigh as she noted the modest 15 pounds she had managed to lose in the last 10 days through extreme levels of exercise (no easy feat at over 400 pounds) and carefully watching her diet. Normally, losing that much weight so quickly would be cause for celebration. The trouble was, Anna wasn't sure her resolve to lose weight would be able to last much longer.<br>\r\n<br>\r\n   One of the reasons Anna was almost certain she was being punished was that, unlike other angels who had fallen in similar circumstances, reality had seemed to warp to conform itself to Anna's presence as a human, and the circumstances that new reality had created for Anna were less than ideal for someone trying to lose weight. As a human, Anna had found out that she had a work from home job, that payed very well and required little physical exertion on her part, but was mentally taxing and did not give her much time to herself. This made it very difficult to find time to cook healthy food, and at the end of every day, Anna was so exhausted and hungry, she found it difficult to resist the urge to skip her evening jog and order pizza instead of cooking for herself.<br>\r\n<br>\r\n   Then there was Anna's \"old friend\", Vanessa, who. like her boss, who Anna had supposedly worked for over 10 years (even though she had only had this body for 2 weeks), Anna did not remember. However, the way \"V\" (as Vanessa liked to call herself) remembered it, she and Anna had been friends since elementary school, and it was easy to see one of the things that had supposedly bonded them together: They were both fat. Although V  weighed about 100 pounds less than Anna, she was still very obese. Unlike Anna, however, Vanessa was not ashamed of her size, and she loved to eat. In fact, whenever V would call Anna to hang out on the weekends, her suggested activities always involved food, and she would vehemently turn down any suggestion that Anna made that required exercise, or physical exertion of any kind. For this reason, Anna kept finding excuses to not spend time with V. This was becoming harder lately, however, since it was becoming clear Anna was starting to hurt her \"friend's\" feelings by her repeated refusals to spend time with her. Anna knew that, if she wasn't careful, she would lose the only friend she now possessed, and would be even more miserable and alone than she was now.<br>\r\n<br>\r\n  The worst part for Anna, however, was the hunger. Anna quickly found out the reason the Anna of this reality was so fat, she was always hungry. In fact, the very first memory Anna had of this body had been waking up ravenously hungry and making a big, greasy breakfast of eggs, toast, pancakes, sausage and bacon, all on auto-pilot, and eating her huge meal like a women possessed. This had been before Anna had taken a good look at herself, realized how fat she was now, and had resolved to lose weight, of course. Unfortunately, after over a week of dieting, Anna's hunger had not decreased in intensity. On the contrary, Anna's appetite had gotten worse, and the former angel was frequently bothered by her constantly growling stomach and daydreams of fast food, desserts, pizza, and other fattening foods. Despite Anna's iron will, which had been strong enough to allow her to defy heaven's will for decades, Anna felt it was only a matter of time before she gave into her food cravings and went on binge that would completely ruin her new diet.<br>\r\n<br>\r\n   As if to interrupt Anna's gloomy thoughts, her apartment phone rang. Idly wondering who would bothering calling her this early on a Saturday morning, Anna picked up the phone, not bothering to clothe herself to have a conversation with someone who couldn't even see her. \"Hello, this is Anna speaking. May I ask who's calling?\" As soon as Anna was done with her greeting, a voice greeted her on the other end of the phone line. It was...<br>\r\n<br>\r\n    </span></div></div>",
            "created":1360976940,
            "id":1532925,
            "title":"Weighted down to Earth!"
        },
        "122":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "incompatible with new host body(supernatural weight gain)",
                "new host has slow metabolism(natural gain)",
                "other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Raphael's newest host body gain weight?</span></div></span></div>",
            "created":1335544860,
            "id":1323679,
            "title":"Raphael"
        },
        "13":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Eve{(mother of all)",
                "Lenore(\"good\" vampire)",
                "Amy (a Kitsune, and Sam's boyhood friend)",
                "any Amazon woman",
                "other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which beastly beauty is going to be porking out?</span></div></span></div>",
            "created":1334120400,
            "id":1313175,
            "title":"Monster Gain"
        },
        "133":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Casts the spell! (it backfires, supernatural weight gain)",
                "Eats human food! (needs LOTS of it for nourishment, natural weight gain)",
                "other choice!"
            ],
            "content":"<div class=\"\"><div> <span>  (spoilers for season 7!)<br>\r\n<br>\r\nAmy Pond was a monster. More specifically, she was a kind of monster know as a Kitsune. Like the rest of her kind, Amy needed to feed on human brains(part of them anyway) to survive. For most Kitune, this would be a simple matter of finding  suitable humans, killing them, and taking what they needed to survive. For Amy, matters where not so simple. She had sworn to a boy name Sam Winchester that she would never kill a human being when she had been just a girl, and she intended to keep that promise. But she still needed brains to survive.That is why she worked at a morgue, so she could access the brains of dead humans and take those instead. After all, the dead didn't need them anymore!<br>\r\n<br>\r\n   But there was a problem with this plan: dead brains did not provide the same amount of nourishment as living ones, and Amy was starting to get HUNGRY, even after eating as many as five dead brains a day! Clearly, she needed to find a way to curb her monstrous appetites before she lost control of herself and started killing people like her mother had done. She needed a plan, and she had come up with two different possibilities.<br>\r\n<br>\r\n   The first involved magic. Being a supernatural creature herself, Amy had naturally been curious about other elements of the supernatural the world. Her search for such arcane information took her to many places: libraries, antique stores, \"occult\" shops (most stuff at these places was fake, but she occasionally got lucky), and even the internet. That is how she had come to possess a 13th century spell tome, which had been used by real witches for centuries. This book seemed to have spells for everything. In fact, there was even a spell for curbing supernatural appetites! However, Amy knew that using magic could be dangerous, and that spells would often backfire on the one who cast them. Therefore, she was more than a little nervous to take this path. Even so, she was still desperate enough to at least consider this option at this point!<br>\r\n<br>\r\n  The other option involved food. Human food. It was a little known fact that Kitsune could, in fact, eat regular food if the situation called for it. They just didn't need it in their diet, and could not survive solely on \"normal\" food for very long. However, she had read that Kitsune could survive on human food for short periods of time, if human brains where not available or easy to obtain. They could also supplement the diets of Kitsune who could only \"feed\" rarely, although the effects of such a diet on a Kitsune would vary from individual to individual. Amy wondered if she could survive on a combination of human food and morgue brains without getting hungry. But she couldn't help but wonder if that plan would work either. What if it didn't, and she got hungry again and killed someone? Furthermore, even if that \"diet\" did work, Amy had no idea how much human food she would have to eat to curb her appetite, or would that type of sustenance would do to her body. As far as she knew, no Kitsune had ever tried to live on such a special diet. But it still might be worth a shot...<br>\r\n<br>\r\nWhich option will Amy Pond choose? Or will something else happen to Sam's boyhood friend?<br>\r\n<br>\r\n      </span></div></div>",
            "created":1334877480,
            "id":1319136,
            "title":"Amy "
        },
        "14":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Meg",
                "Ruby (Sam's old \"flame\")",
                "Lust(one of the 7 deadly sins)",
                "other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Diabolical temptress won't be able to burn away the pounds?</span></div></span></div>",
            "created":1334120400,
            "id":1313178,
            "title":"Demon Gain"
        },
        "142":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Overeating! (out of boredom and frustration, natural gain)",
                "Weakened metabolism!(from all of Sam's bloodsucking, supernatural gain)",
                "other choice!"
            ],
            "content":"<div class=\"\"><div> <span> (This story starts during season 4 of the show, spoilers for throughout that season)<br>\r\n<br>\r\n 'Sam Winchester is so dull'!,Ruby thought to herself as the youngest Winchester brother once again spoke of his guilt over letting Lilith send his brother to hell, than having to lie to said brother about his relationship to her. The demon tried to appear sympathetic, but was barely able to suppress rolling her eyes. Truthfully, Sam's constant whining over his family issues and the permanent cloud of guilt that seemed to hang over the hunter were really starting to get on her nerves. But she had a mission to accomplish, and that mission included keeping Sam happy for the time being. Therefore, Ruby continued to nod and act sympathetic while Sam reiterated the same monologue once again, occasionally sucking blood from the wrists of the woman Ruby had possessed, demon blood.<br>\r\n<br>\r\n  That was another thing. Ruby knew that Lucifer's  plans for Sam would require her to feed the boy her blood, but she had not expected he would be taking so much so frequently! The hunter was a real blood junkie know, demanding for and more of her blood with greater frequency as time went on. As a result, Sam's abilities had increased in power much quicker than Ruby had expected, but the demon herself had never been weaker. Add this fact to the constant self-imposed guilt trips the addict forced her to overhear, Ruby had to admit she was going through the roughest time since she had been converted into a demon! Something had to give, and soon!<br>\r\n<br>\r\nSo...how will Sam's seducer become more...Rubenesque? </span></div></div>",
            "created":1334963400,
            "id":1319716,
            "title":"Ruby"
        },
        "144":{
            "author_id":"supercode4",
            "author_name":"supercode4",
            "choices":[
                "Yes!",
                "Something else, please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lilith, the \"big bad\" of seasons 3 and 4?</span></div></span></div>",
            "created":1336078380,
            "id":1328852,
            "title":"Lilith?"
        }
    },
    "info":{
        "author_id":"supercode4",
        "author_name":"supercode4",
        "brief_description":" Sexy females of all kinds from the TV show Supernatural pack on the pounds and get FAT!",
        "created":1334111340,
        "description":"<td align=\"left\" class=\"norm\"> Sexy females of various kinds (and species!) from the show supernatural gain weight (disclaimer: I do not own ANY of the rights to the SUPERNATURAL tv show, its characters, or any products affiliated with said show, This is not for profit, only fun.) <br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1) only adult female weight gain, BUT female humans, monsters, angels and demons from the show can gain weight!<br>\r\n<br>\r\n2)gains can be natural or supernatural <br>\r\n<br>\r\n3)no super-fast weight gain, even for supernatural gains (i.e 1000 pounds in 1 chapter)<br>\r\n<br>\r\n4)no killing of character gaining weight, no popping or vore<br>\r\n<br>\r\n5)Please add your own chapters!<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1860656,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1382143500,
        "modified":1382143500,
        "pretty_title":"Supernatural Female Weight Gain!"
    }
}