{
    "chapters":{
        "1":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Hero",
                "Villain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all, are you a hero or a villain?</span></div></span></div>",
            "created":1318827600,
            "id":1208271,
            "title":"Welcome to New Wolf City"
        },
        "11":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Ice Fang",
                "Redeemer",
                "Crimson",
                "The Tomcat Avenger",
                "More Heroes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your hero</span></div></span></div>",
            "created":1318827600,
            "id":1208273,
            "title":"Hero"
        },
        "111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Chaseing a Criminal.",
                "Patroling the City.",
                "Just resting."
            ],
            "content":"<div class=\"\"><div> <span>Name: Ice Fang<br>\r\nSpecies: Wolf<br>\r\nPowers: Water/Ice manipulation, hidden blades.<br>\r\nPersonality: When he was little he was aware of his powers and at times he couldn’t control them. One day a group of virulently came and they brought them into there group so they could train him. He rarely talks with others (Unless they are very close to him) and quite disciplined, however when he is under is mask he can (Once in a blue moon) become a little cocky and will crack a one liner or two if he feels like it.<br>\r\nDescription: He wears a black hooded clock with long sleeves (To hide his hidden weapons) and he wears a white Japanese style wolf mask with blue markings on the sides of the mouth and eyes. Weapon dispensers are hidden on his arms to ether shoot out throwing stars or dispense any blade he may need into his hand. (Safely) <br>\r\nNow what are you up to?</span></div></div>",
            "created":1319000400,
            "id":1209701,
            "title":"Ice Fang"
        },
        "1111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Looks like Konran found some friends.",
                "He's traped in an allay.",
                "Someone beat you to him."
            ],
            "content":"<div class=\"\"><div> <span>It’s a quiet night in New Wolf City, as things seem calm on a normal street. A young teenage cat girl is walking home when she is then grabbed by the arm and pulled into an allay. “Mhmmmhm.” the girl try’s to scream but her mouth is covered. “My my what an interesting specimen you are. Such nice soft fur.” the shadowy figure says as he proceeds to take a black marker and draw a few lines on her stomach “Now then where should I make the first incision.” The girl try’s to scream when she sees a scalpel in the figures hand. “Now shall we turn that smooth skin into sand paper?” the figure says as he rises the scalpel into the air. Then the scalpel is stuck by a throwing knife and the shadow drops the scalpel and releases the girl as she then runs away. You stand on the roof top looking down at the shadowy figure. “Mad Scientist Konran,!” you shout “You are under arrest!” “Oh come now fangy lighten up.” Konran steps out into the moonlight and you see a lizard wearing a lab coat and has stitches all over his head and arms “I was only going to examine her and let her go is that so much to ask?” “You can’t go around dissecting people Konran!” you shout as you have a sword drop out from your sleeve “Time to take you in.” “You have to catch me first.” Konran shouts as he starts running. “That guy is insane.” you say as you leap off the building and chase after him. You draw water from the air and you use it to slide across the surface of the water. “Hahahahaha lets see how you corner goody two shoes!” Konran shouts as he turns a corner. “As you slide by you grab a lamp post and turn the corner quickly.  Konran keeps this up turning multiple corners but you still manage to keep up some how. Soon he manages to lose you but you can see where he went. “You can’t hide forever Konran!” you shout as you walk. As you turn a corner you soon see…</span></div></div>",
            "created":1319000400,
            "id":1209747,
            "title":"Enter Ice Fang"
        },
        "112":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Stopping a theif from robbing a jewelry store",
                "Running around the city",
                "Waiting for something (restlessly)"
            ],
            "content":"<div class=\"\"><div> <span>Name: Redeemer<br>\r\nSpecies: Raptor<br>\r\nPowers: Wind manipulation, Hand to Hand ace<br>\r\nPersonality: When he was young he could always feel his powers. His emotions triggered his powers around that time. But as he got older he learned how to control his powers. When he gained control of his powers, he felt like everything was slow. But he was actually faster. He has a slightly hyperactive personality making him talk faster than normal. His speed is unrivalled as well as his hand to hand combat.<br>\r\nDescription: A slight breeze is always there when he is near. He wears a loose white shirt with black tracksuit pants. The loose white shirt is always rippling in the breeze. He always wears black biker gloves to show his combat expertise. He wears a a karate style headband around his head &amp; black sunglasses cover his eyes. <br>\r\n<br>\r\nNow what are you up to?</span></div></div>",
            "created":1319173200,
            "id":1210489,
            "title":"Redeemer"
        },
        "113":{
            "choices":[
                "Patrolling",
                "Lazing around",
                "Seeing to an escaped prisoner"
            ],
            "content":"<div class=\"\"><div> <span>Name:Crimson<br>\r\nSpecies:Dragon<br>\r\nPowers:Fire manipulator<br>\r\nPersonality:He`s not much of a talker and has a real cold outlook on things.He would prefer to laze around instead of fighting crime.He`s not really much of a hero but he certainly isnt a villain.He enjoys very little and at times its bringing other people down that can put him in a good mood.To put it easily he`s pesimistic,cynical,lazy and amoral.He could always control fire but he wasnt always a dragon when he was younger he was abducted by the military and experimented on.They thought that they had created a cold blooded killer but to their dismay he was very unmotivated.He escaped after they deemed him a failure and tried to kill him and has been seeking sanctuary in New Wolf City ever since then.<br>\r\nDescription:He wears a leather jacket that is torn at the elbows and shoulders because of spikes that emerge there.He wears black pants torn at the knees due to more spikes and torn at the back because of his tail.His shoes are torn because of claws on his feet.Finally he wears a gas mask.<br>\r\nPhysically he is strong,but he isnt ripping with muscles, he is pretty skinny.He has two horns on his head.His tail is long and whip like and he has full use of it.He doesnt have wings because he escaped before the experimenting got that far.Due to his fire powers he can breath it or use it from his hands.His clothes are fire proof.Despite the use of his tail as a whip he carries an actual whip with him as his weapon of choice.<br>\r\n<br>\r\nNow whats he up to?</span></div></div>",
            "created":1319346000,
            "id":1211666,
            "title":"Crimson"
        },
        "1131":{
            "choices":[
                "Investigate it",
                "Forget about it",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>I ran through the rooftops of the tall buildings that contributed to New Wolf Cities skyline.I can easily make the jump between each building and when it comes to a large gap some fire can give a boost.I stopped at the edge of one building and looked at my reflection in a window of the building opposite.My face concealed by the black gas mask.It had two eyeholes that were covered over by some material that prevented gas getting in and still enabling top vision.There were two small nozzle`s that stuck out of the underside of my snout.I chose to wear this mask,not to install fear or to protect myself from any kind of toxic fumes or gases, but just because I dont want the world to see me.<br>\r\nI jumped off the side of the building and fell towards an empty street.Just before hitting the pavement I used my whip and swung around a lamp post landing unharmed.This is one of the few streets that doesnt bustle with the cities night life and is why I spend most my time here.But sadly the quietness of this street also results in higher crime rates than other parts.Suddenly I hear sirens that are pretty close by.What should I do?</span></div></div>",
            "created":1319605200,
            "id":1213327,
            "title":"Patrolling"
        },
        "114":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Fighting crime",
                "Teaching a class",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Name: The Tomcat Avenger<br>\r\n<br>\r\nSpecies: Cat<br>\r\n<br>\r\nPowers: Gadgets<br>\r\n<br>\r\nPersonality: Schoolteacher, Johnathin Tabbis was once served in the army and is trained in engineering. In his unit he is trained in turning ordenary objects into extrodinary weapons. That served him well when his unit faced terrorists that took over a power plant threatening to distroy it and turned a area into a radioactive wasteland. Now he served his country he turns his attention to teaching children at New Wolf High, but he uses his talents to fight crime as The Tomcat Avenger.<br>\r\n<br>\r\nDescription: His costume is that he wears a altered milatary uniform with body armor for protection, he wears a bandana over his eyes with eyeholes to see. His signiture weapon is a wrist-whip. A wristband with an unbreakable fiberwire that extends when he flicks his wrist. Not only does it used like a bullwhip, but it can easily grab, and ties up crooks. Underneith his bandana is a high tech helmet with a wireless access to a crime computer and most of the gadgets he uses such as a tracer chip launched from his wrist device in for tracking crooks.<br>\r\n<br>\r\n<br>\r\nWhat's Johnathin Tabbis/Tomcat Avenger doing now?</span></div></div>",
            "created":1334638800,
            "id":1317459,
            "title":"The Tomcat Avenger"
        },
        "1141":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Tomcat is alerted that there's a hostage situation.",
                "An unfortunate criminal runs into Tomcat",
                "Someth"
            ],
            "content":"<div class=\"\"><div> <span>In an alley somewhere in New Wolf City, a fox wino is laying on the ground with a bottle of booze in one hand and singing a drunk song with no one else around,  Four anthro lizards comes in each wearing a white jumpsuits. One(their leader) carries a cane, they applaud to the fox as he finishes his song \"Bravo, bravo.\"<br>\r\n<br>\r\nFox: \"Care to spare some change friend?\"<br>\r\n<br>\r\nThe four lizards just laughs and suddenly the leader thrusts forward and pins the fox with the cane.<br>\r\n<br>\r\nFox: \"Well, go on, do me in you bastard cowards! I don't want to live anyway, not in a stinking world like this!\"<br>\r\n <br>\r\nGang leader: \"Oh? And what's so stinking about it?\"<br>\r\n <br>\r\nFox: \"It's a stinking world because there's no law and order anymore! It's a stinking world because it lets the young get on to the old, like you done. Oh, it's no world for an old man any longer. What sort of a world is it at all? Anthros on the moon, and anthros spinning around the world, and there's not no attention paid to earthly law and order no more.\"<br>\r\n<br>\r\nThe Fox begins singing again and the gang leader lifts the cane it hit the old vulpin and suddenly a whirring sound is heard as a string of cable came from the darkness, it's magnetic tip grabs the metal handle of the cane and retracts back to a figure wearing a modified uniform and bandana.<br>\r\n<br>\r\nTomcat Avenger: \"Does your mother ever tell you to respect your elders?\"<br>\r\n<br>\r\nGang member 1: \"How dare you spoil our fun?\"<br>\r\n<br>\r\nGang leader: \"I don't know you are, but challenging us is a big mistake! Get him boys!\"<br>\r\n<br>\r\nThe 3 gang members surround the Tomcat Avenger, one rushes him only to countered by two quick jabs.<br>\r\n<br>\r\nGang member 2: \"Time to clean your clock.\"<br>\r\n<br>\r\nThe 2nd. Gang member takes a crow bar and tries to hit Tomcat Avenger, but he ducks and the gang member ends up running into the wall.<br>\r\n<br>\r\nThe 3rd. gang member tries to ram him down only to be grabbed by Tomcat Avenger.<br>\r\n<br>\r\nTomcat Avenger \"*sniff sniff* Ugh, drencrom. No wonder your all so agressive. This synthetic drug not only makes your senses sharper. It also lowers your IQ.\"<br>\r\n<br>\r\nTomcat Avenger punches him out with a haymaker.<br>\r\n<br>\r\nTomcat Avenger turns to the Gang leader \"Now as for you.\"<br>\r\n<br>\r\nThe gang leader yells and runs towards Tomcat Avenger only to get flipped and land into a dumpster.<br>\r\n<br>\r\nTomcat Avenger: \"Just as I thought, nothing but garbage.\"<br>\r\n<br>\r\nFox: \"Thanks for saving me.\"<br>\r\n<br>\r\nTomcat Avenger: \"No problem, just doing my job.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1334811600,
            "id":1318797,
            "title":"Fighting crime"
        },
        "11413":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "An old enimy of Tiffany's strikes",
                "The dance goes uninterupted"
            ],
            "content":"<div class=\"\"><div> <span>As Tomcat Avenger left the alley, he suddenly remembered something. Johnathin Tabbis' best sudent Tiffany Tigre is supposed to be at the High School dance that night and he promised him that he'll be there for her. So he rushed over to New Wolf High and ducked into a storage shed to change back into Johnathing Tabbis. As he came out he's now dressed in a tuxido with a nicely comed headfur. He went to the school gym and found Tiffany.<br>\r\n<br>\r\nTiffany: Mr. Tabbis. I was wondering where you were.<br>\r\n<br>\r\nJohnathin: Sorry Tiffany, busy grading and lost track of time but I'm here as promised.<br>\r\n<br>\r\nTiffany: How do I look?<br>\r\n<br>\r\nTiffany is dressed like a southern belle much like Scarlette from Gone with the wind.<br>\r\n<br>\r\nJohnathin: You look mighty fetching, in other words beautiful. You'll have no trouble finding a partner to dance with.<br>\r\n<br>\r\nTiffany: Thanks, it means a lot to me, right now I fell nervous.<br>\r\n<br>\r\nJohnathing: Now go out there and have fun.<br>\r\n<br>\r\nTiffany goes out to near the dancefloor with the rest of the girls he smiles as the school jock, Leo Pufftail, a lion offers to dance with tiffany.</span></div></div>",
            "created":1345352400,
            "id":1408116,
            "title":"Back to school"
        },
        "114131":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Answer her",
                "Don't answer her"
            ],
            "content":"<div class=\"\"><div> <span>As Leo and Tiffany is about to dance, suddenly a yellow gas seeps in from the vents, \"Oh my god! We're being gassed!\" most of the dancers said and started to run in panic, even Leo but Tiffany is dumbfounded.<br>\r\n<br>\r\n\"That can only be Nightmare.\" Johanathing said to himself as he pulls out a gas mask hidden under his jacket. He quickly went behind the curtain and came out once again as the Tomcat Avenger and positioned himself by the door which was then kicked down when Nightmare came in.<br>\r\n<br>\r\n\"Hello Tiffany!\" Nightmare said in a low chuckle.<br>\r\n<br>\r\nTiffany screamed when she saw Nightmare and ran away.<br>\r\n<br>\r\nTomcat Avenger surprised Nightmare with a leg sweep and knocked her to the ground.<br>\r\n<br>\r\nNightmare looked directly at the Tomcat Avenger.<br>\r\n<br>\r\n<br>\r\n\"Who the hell are you?\" She snarled<br>\r\n </span></div></div>",
            "created":1345352400,
            "id":1408161,
            "title":"Nightmare attacks"
        },
        "1141311":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "She manages to free herself",
                "She's unable to free herself, she's going to jail."
            ],
            "content":"<div class=\"\"><div> <span>He answer \"I'm the Tomcat Avenger.\"  As he begins the fight he release his wrist whip and tied her legs good and tight.<br>\r\n<br>\r\nNightmare then tries to flick her tail in the Tomcat Avenger's face, but he dodged it easily.<br>\r\n<br>\r\nNightmare started to thrash and whinny violently, she couldn't figure out how to free herself.</span></div></div>",
            "created":1345352400,
            "id":1408193,
            "title":"Answer her"
        },
        "11413112":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "The next day",
                "Meanwhile throughout the night"
            ],
            "content":"<div class=\"\"><div> <span>Nightmare was unable to free herself, The Tomcat put handcuffs on her and took her away to jail.<br>\r\n<br>\r\nAs the door slammed shut you could hear Nightmare scream into the night<br>\r\n<br>\r\n\"NEXT TIME, TOMCAT AVENGER! ...NEXT...TIME!\"<br>\r\n<br>\r\nTomcat Avenger: I will be waiting Nightmare.<br>\r\n<br>\r\nFor that Tomcat Avenger heads back into the city as the sun rises to a new day.</span></div></div>",
            "created":1345352400,
            "id":1408206,
            "title":"She's unable to free herself, she's goi..."
        },
        "114131121":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "In front of the city museum",
                "On an intersection causing mayhem to the public"
            ],
            "content":"<div class=\"\"><div> <span>The following night Tomcat Avenger is on Patrol until he got a incoming call from his headset, it's Ice Fang.<br>\r\n<br>\r\nIce Fang: Tomcat Avenger, I need your help downtown a new villain is attacking.<br>\r\n<br>\r\nTomcat Avenger: Are you sure it's not Mad Scientist Konran?<br>\r\n<br>\r\nIce Fang: Unless he traded in his labcoat for a trench coat, it's not him.<br>\r\n<br>\r\nTomcat Avenger: I'm on my way.<br>\r\n<br>\r\nTomcat Avenger heads towards downtown and see's Ice Fang on a nearby rooftop.<br>\r\n<br>\r\nTomcat Avenger: Who is this new villain?<br>\r\n<br>\r\nIce Fang: He calls himself Jack-O-Lantern and believe me, he's a tough one.<br>\r\n<br>\r\nTomcat Avenger: If he's like Nightmare, he should be no problem.<br>\r\n<br>\r\nIce Fang shows Tomcat Avenger on where Jack-O-Lantern is.</span></div></div>",
            "created":1345525200,
            "id":1409880,
            "title":"The next day"
        },
        "1143":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Ruby tells him she is just tired",
                "Ruby confesses that she has a crush on him"
            ],
            "content":"<div class=\"\"><div> <span>Johnathin Tabbis just wrapped up History Class, topic is on how New Wolf City came to be. He spotted his co-worker, music teacher Ruby Tuesday<br>\r\n<br>\r\nJohnathin: Good Afternoon Ruby! Lovely weather we're having isn't it?<br>\r\n<br>\r\nRuby: Oh, The weather. Right. It's just...peachy.<br>\r\n<br>\r\nJohnathin notices that Ruby is behaving a little strangly.<br>\r\n<br>\r\nJohnathin: Are you all right Ruby? You look feverish.</span></div></div>",
            "created":1345784400,
            "id":1412695,
            "title":"A Talk with Ruby Tuesday"
        },
        "11431":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "He investigates trouble involving some new eco-terrorist",
                "Just a routine patrol, no signs of trouble"
            ],
            "content":"<div class=\"\"><div> <span>Ruby: Sorry, I'm just tired and need a rest.<br>\r\n<br>\r\nRuby ran off, Johnathing just shrugs and head out to his car.<br>\r\n<br>\r\nAs he drove on home, he should have a light dinner and go on patrol as the Tomcat Avenger, there are planty of heroes out there Like Melody, Massive and the Enforcer,  but even they need help every now and then. Who knows?<br>\r\n<br>\r\nLater that night.</span></div></div>",
            "created":1345784400,
            "id":1412708,
            "title":"Ruby tells him she is just tired"
        },
        "114311":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A fight between the Tomcat Avenger and the Eco-Terrorists starts",
                "Wrex joins in the fight"
            ],
            "content":"<div class=\"\"><div> <span>Just then, the readout of his H.U.D. reports that a tremor is in progress over at Wrex Industries so he went over and investigate, he landed on the roof across it and sees that the building is almost covered in weeds, looking down he sees Wrex facing a giant Venus Flytrap.<br>\r\n<br>\r\nTomcat Avenger: It seems that Wrex has a few weeds in his garden, time for some pruning.<br>\r\n<br>\r\nTomcat Avenger fires darts from his wrist device hitting the giant plant by it's roots causing it to roar with pain and fall to the side.<br>\r\n<br>\r\nA villainess fell out of the plants mouth, when she noticed her plant was in pain she stroked it tenderly and tried to remove the darts from the roots.<br>\r\n<br>\r\nVillainess: Who did this?<br>\r\n<br>\r\nTomcat Avenger: It was me.</span></div></div>",
            "created":1345870800,
            "id":1413184,
            "title":"He investigates trouble involving some new eco-..."
        },
        "115":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Sweet Charity",
                " Druid ",
                "Still More Heroes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some more hereoes.</span></div></span></div>",
            "created":1334811600,
            "id":1319144,
            "title":"More Heroes"
        },
        "1151":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Patrolling",
                "At the library",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Name: Sweet Charity<br>\r\n<br>\r\nSpecies: Cobra<br>\r\n<br>\r\nPowers: Healing (Of herself and others) and Venom<br>\r\n<br>\r\nPersonalty: Charity Serpentine was very shy and awkward in high school, due to the unsavory reputation surrounding snakes, Charity was bulled ruthlessly by kids who thought all snakes were evil, as the bullying got more and more viscous, Charity noticed something strange about her body, whatever wound she had healed quickly in a few minutes, she discovered she also had the power to heal others, she discovered this power when she put her hand on the scraped knee of a little cat boy who got hurt climbing trees. Charity now leads a double life, by day she is a mild mannered librarian at New Wolf City's Central Library, by night she calls herself Sweet Charity, her difference from most superheroes is her emphasis is not on punishing the guilty but protecting the innocent, she's more into helping people out of scrapes then beating up the wicked, however if she has to defend herself or others she can rely on the power all cobras have...venom. But if she has to bite anyone, she won't let them die, she'll always take them to the hospital, she's out to prove not all snakes are bad.<br>\r\n<br>\r\nDescription: Unlike most snakes, Charity has both arms and legs, she wears and orange jumpsuit and and an orange eye mask to conceal her identity,  she is pure reptile as she has no breasts and she is very slender she can squeeze into places most Anthros can't go.<br>\r\n<br>\r\nWhere is she now?</span></div></div>",
            "created":1345266000,
            "id":1407700,
            "title":"Sweet Charity"
        },
        "11511":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Take him the the Lost and Found",
                "Try to find his parents by scent"
            ],
            "content":"<div class=\"\"><div> <span>It was nighttime at the county fair, Charity was standing close by, making sure this would be a happy night for everyone, making sure no one would commit a crime tonight.<br>\r\n<br>\r\nJust then she heard the sounds of a crying child, she took out her binoculars and scanned the area.<br>\r\n<br>\r\nAmong the crowd wandering aimlessly was a little Rabbit Boy, he could not have been older then two or three, he was wandering around wailing his head off.<br>\r\n<br>\r\n'Why are they just ignoring him?' Charity thought 'Can't they see the poor thing is lost?!'<br>\r\n<br>\r\nShe quickly swooped into action, she made her way through the crowd, she followed the sound of the crying until she located the Rabbit Boy<br>\r\n<br>\r\n\"Hey Little Guy.\" She said soothingly \"Where's your Mom and Dad?\"<br>\r\n<br>\r\nThe Little Bunny seemed to upset to talk and just wailed some more<br>\r\n<br>\r\nAs delicately as she could, Charity took the Rabbit Boy into her arms, she wondered what she should do... </span></div></div>",
            "created":1345352400,
            "id":1407735,
            "title":"A Lonely Child"
        },
        "115112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "More work at the fair",
                "Skip to the next night"
            ],
            "content":"<div class=\"\"><div> <span>Charity decided since it was rather late, she would try to find the Rabbit Boy's parents by scent, her sense of smell worked better by night then by day for some reason.<br>\r\n<br>\r\nShe breathed in the scent of the Little Bunny like all Rabbits he had the scent of carrots on his breath, but he also had the scent of his family.<br>\r\n<br>\r\nHolding the squirming child closely, letting her cool dry scales soothe him, she focused the the many, many scents around her, the combined scents of Anthros, food, machinery and other things, and try to pinpoint that one scent that smelled like...<br>\r\n<br>\r\n\"Bingo.\" She said <br>\r\n<br>\r\nHolding onto the Bunny tightly, Sweet Charity took off, her slender reptilian feet were swifter then most warm blooded Anthros realized<br>\r\n<br>\r\nShe found the Bunny's parents by the Ferris Wheel, they had probably been searching for hours by this time and were looking pretty desperate.<br>\r\n<br>\r\n\"Oh thank you Sweet Charity!\" The Mother Rabbit said as she took her son into her arms <br>\r\n<br>\r\n\"It's OK.\" Sweet Charity said graciously \"It's all in a day's work.\" </span></div></div>",
            "created":1345352400,
            "id":1407744,
            "title":"Try to find his parents by scent"
        },
        "1151121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Go after The Hyena and use the venom",
                "Heal the injured"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly something is wrong! Charity senses an evil presence, she rushes off and see's The Hyena and his henchmen!<br>\r\n<br>\r\nShe has a big choice to make, should she use her venom? Possibly inject a lethal dose? Or should she focus on healing the people he has injured </span></div></div>",
            "created":1345438800,
            "id":1409165,
            "title":"Hyena Attack!"
        },
        "11511211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Just a little venom, enough to render him immobile ",
                "The Hyena is too dangerous! Inject a lethal dose!"
            ],
            "content":"<div class=\"\"><div> <span>Even though she loathed to hurt anyone Charity knew The Hyena was a completely unhinged and deeply disturbed individual.<br>\r\n<br>\r\nShe had no choice but to stop him!<br>\r\n<br>\r\nCharity leaped from building to building, she waited until she was on top of the concession stand, <br>\r\n<br>\r\nShe hid behind the giant plastic hamburger that decorated the concession stand. She waited until The Hyena and his goons were just underneath<br>\r\n<br>\r\n\"Heh heh! This is a good haul Eh Boys?\"<br>\r\n<br>\r\nThat was when she took action, Charity dove and landed on top of The Hyena, wasting no time she bit his face and pumped venom into his body.</span></div></div>",
            "created":1345525200,
            "id":1409432,
            "title":"Go after The Hyena and use the venom"
        },
        "115112111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Another Hero Appears",
                "Charity has to fight him on her own"
            ],
            "content":"<div class=\"\"><div> <span>Charity couldn't really hurt anyone, not even someone as awful as The Hyena.<br>\r\n<br>\r\nHowever before she could really inject her venom, Hyena punched her on the side of the face to get her off him.<br>\r\n<br>\r\n\"You really think a little venom could stop me?! He growled</span></div></div>",
            "created":1345525200,
            "id":1409731,
            "title":"Fight Back!"
        },
        "1151121111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Hyena breaks free of his bondage and fights the two heroes",
                "No luck he's going to jail"
            ],
            "content":"<div class=\"\"><div> <span>Just then a bullwhip wrapped around The Hyena's legs causing him to fall.<br>\r\n<br>\r\n\"Tomcat Avenger!\" Sweet Charity exclaimed<br>\r\n<br>\r\n\"Sorry I'm late.\" The Tomcat Avenger said as he appeared \"Had a little trouble with Jack O Lantern Downtown\"</span></div></div>",
            "created":1345525200,
            "id":1409775,
            "title":"The Tomcat Avenger"
        },
        "11512":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Bite! Use the venom!",
                "Call for help."
            ],
            "content":"<div class=\"\"><div> <span>Charity Serpentine was putting away some books on the shelf, she was tall enough that she could reach the top shelf without needing a stepstool. She was wearing a wool sweater with slate grey pants, when she was working at the library she wore thick glasses she didn't really need them, she just thought they made her look meeker and more unassuming, so no one would suspect  she was actually Sweet Charity.<br>\r\n<br>\r\nSuddenly, she felt a warm breath on the back of her neck, she turned around quickly, she saw an enormous Tiger, he had the smell of alcohol on his breath.<br>\r\n<br>\r\n\"My, my, my...\" He purred licking his lips \"Aren't you the pretty little reptile.\"<br>\r\n<br>\r\nCharity wasn't sure what to do, she could bite him, it was within her rights, however she could just scream for help and someone might come to her aid. </span></div></div>",
            "created":1345352400,
            "id":1407704,
            "title":"At the library"
        },
        "115122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Tiger gets up again and attempts to fight",
                "The Tiger passes out"
            ],
            "content":"<div class=\"\"><div> <span>Charity decided not to resort to using Venom, instead she called for help<br>\r\n<br>\r\n\"Help!\" She called \"Somebody help!\"<br>\r\n<br>\r\nSomebody did come to help her that person was a Cat Man.<br>\r\n<br>\r\nThe Cat Man didn't waste time he just delivered a quick judo kick to the tiger who fell down due to his inebriation<br>\r\n<br>\r\n\"Are you alright Miss?\" The Cat asked<br>\r\n<br>\r\n\"Yes.\" Charity said  </span></div></div>",
            "created":1345525200,
            "id":1409671,
            "title":"Call for help."
        },
        "1152":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Patrolling",
                "Doing his grocery shopping",
                "Something else   "
            ],
            "content":"<div class=\"\"><div> <span>Name: Druid<br>\r\n<br>\r\nSpecies: Wild Boar<br>\r\n<br>\r\nPowers: The ability to control the weather, rain, snow, wind all kind of weather<br>\r\n<br>\r\nPersonality: Rick Tusk is a firm believer in the old pagan religions. When he discovered a book of white magic within the cellar of his Grandmother's house he discovered the ancient secrets of the druid priests, He now has the ability to control the weather, he normally uses this to help the innocent rather then punish the guilty, bringing rain to where their are droughts and bringing sunshine to where there are floods, he is a kind and helpful if solemn personality.   <br>\r\n<br>\r\nDescription: Druid wheres a typical Celtic outfit, Earthy green ropes to emphasize his connection to nature, He is a strong healthy Boar with muscular frame and strong sharp tusks.<br>\r\n<br>\r\nWhere is he now? </span></div></div>",
            "created":1345611600,
            "id":1410511,
            "title":"Druid"
        },
        "11522":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Risk it, Use the powers!",
                "Call the police instead"
            ],
            "content":"<div class=\"\"><div> <span>Rick Tusk was in the middle of his grocery shopping when it happened.<br>\r\n<br>\r\nThe Boar was in the middle of picking out a carton of orange juice, when all of a sudden he heard a gun click.<br>\r\n<br>\r\n\"Put all you money in a bag Lady.\" An Ape Man said to the young Deer Woman at the cash register<br>\r\n<br>\r\nRick was in a sticky situation, should he use his powers when he is not is costume, risk compromising his secret identity? Or should he just go call the police?</span></div></div>",
            "created":1345611600,
            "id":1410518,
            "title":"When evil calls when you're not on duty"
        },
        "1153":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Captain cookbook",
                " Rabbit Run",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's even more heroes to pick from.</span></div></span></div>",
            "created":1345352400,
            "id":1408138,
            "title":"Still More Heroes"
        },
        "11531":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Fighting crime",
                "Eating lunch"
            ],
            "content":"<div class=\"\"><div> <span>Name: Captain Cookbook<br>\r\n<br>\r\nSpecies: Warthog<br>\r\n<br>\r\nPowers: Mutant, Abnormally fat even for a warthog.<br>\r\n<br>\r\nPersonality: Cocky, streetsmart  and a glutton, Captain Cookbook is proud of his enormous girth, he specializes in cooking fattening foods that will pack on even more pounds.<br>\r\n<br>\r\nAppearance: Dresses as a stereotypical chef, with a bandanna with eye holes around his eyes.<br>\r\n<br>\r\nWhere is he now </span></div></div>",
            "created":1345611600,
            "id":1410630,
            "title":"Captain Cookbook"
        },
        "11532":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Patrolling",
                "Practicing with his band"
            ],
            "content":"<div class=\"\"><div> <span>Name: Rabbit Run<br>\r\n<br>\r\nRace: Rabbit<br>\r\n<br>\r\nPowers: Super speed, can go as faster then the speed of sound<br>\r\n<br>\r\nPersonality: Wally Lapine was known in his youth as a rabbit who seemed to have it all, he was the star of his track team, He had a great girlfriend, his grades were good, he had it made, then one day his powers awakened, while running a race he suddenly left all everyone behind in a sonic boom. Wally didn't know what had happened, he had run right through the fence, two miles down the road and the other runners were  on the ground clutching their ears. Wally realized he had to control his powers after that, Now he only runs at top speed when it is an absolute emergency, However he is still very good natured, he is very paternal and loves children<br>\r\n<br>\r\nAppearance: Rabbit Run is a brown rabbit with cream under fur, his super hero costume is a blue jumpsuit with yellow stripes shaped like lightning bolts, since his powers make it impossible to pursue his dream of being an athlete, Wally instead chose a career as musician he plays the trumpet in an old fashioned big band.<br>\r\n<br>\r\nWhere is Rabbit Run now. </span></div></div>",
            "created":1345611600,
            "id":1410223,
            "title":"Rabbit Run"
        },
        "115321":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Hyena robbing a bank",
                "Jack O Lantern causing mayhem"
            ],
            "content":"<div class=\"\"><div> <span>Rabbit Run was doing his usual patrol for the night he leaped from building to building with ease, it wasn't too difficult for him because his big rabbit feet made it easy for him to hop, his training as an athlete made it even more easy.<br>\r\n<br>\r\nSuddenly his left ear twitched he heard something that sounded like an explosion<br>\r\n<br>\r\n\"Uh oh.\" He muttered \"Sounds like trouble Downtown.\"<br>\r\n<br>\r\nCareful not to go too fast. Rabbit Run rushed downtown to find...</span></div></div>",
            "created":1345611600,
            "id":1410226,
            "title":"Trouble Downtown"
        },
        "1153211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Hyena tries to run",
                "Hyena wants to fight"
            ],
            "content":"<div class=\"\"><div> <span>The Hyena and his two wolves Laurel and Hardy were robbing a bank, Rabbit Run knew he had to stop them!<br>\r\n<br>\r\nHe hopped down to the ground and thumped his foot to get their attention.<br>\r\n<br>\r\n\"Stop right there!\" He shouted<br>\r\n<br>\r\nThe two wolves looked at him and cracked stupid grins<br>\r\n<br>\r\n\"Hey Laurel!\" Hardy shouted \"Look who's trying to stop us!\"<br>\r\n<br>\r\n\"A bunny rabbit!\" Cackled Hardy.<br>\r\n<br>\r\n'Oh geez...' Rabbit Run thought to himself, once again he was facing the prejudice Herbivores like him faced from arrogant carnivores, not all carnivores held the view the herbivores were inferior but still some bigotries just refused to die.<br>\r\n<br>\r\n\"Look at his ears!\" Laughed Hardy \"Do you pick up radio signals with those ears Rabbit?\"<br>\r\n<br>\r\n\"Hey is it true that Herbivores wet their beds until their eight?\" Snickered Laurel<br>\r\n<br>\r\nRabbit Run decided he had enough of this and gave both wolves a super powered kick that sent them flying<br>\r\n<br>\r\nNow to face The Hyena   </span></div></div>",
            "created":1345611600,
            "id":1410277,
            "title":"The old Herbivore/Carnivore conflict"
        },
        "11533":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Melody",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this one</span></div></span></div>",
            "created":1345611600,
            "id":1410529,
            "title":"One More Option"
        },
        "115331":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Patrolling",
                "Out for a night of fun"
            ],
            "content":"<div class=\"\"><div> <span>Name: Melody<br>\r\n<br>\r\nSpecies: Lioness<br>\r\n<br>\r\nPowers: Possess a hypnotic voice, has power over males<br>\r\n<br>\r\nPersonalty: Leona Jenkins always knew her voice had strange properties, when she was a teenager, she could always get a boy to do favors for her, She knew she could use this power for good or for evil, she decided to use this power for good, she called herself Melody because of the Melodic power of her voice.<br>\r\n<br>\r\nAppearance: Leona dresses in a blue suit with a white cape, she wears a blue domino mask to conceal her identity.<br>\r\n<br>\r\nWhere is she  </span></div></div>",
            "created":1345611600,
            "id":1410532,
            "title":"Melody"
        },
        "1153311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Enforcer",
                "Massive"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Melody was having a quiet night, so far no one was out committing crimes since the whole fiasco with Mad Panth, she was thinking of visiting some of her favorite males...Who should she visit?</span></div></span></div>",
            "created":1345784400,
            "id":1412129,
            "title":"Patrolling"
        },
        "11533111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Dan accepts",
                "Dan delclines"
            ],
            "content":"<div class=\"\"><div> <span>Melody decided she would visit Enforcer that handsome German Shepard who was part of the police force.<br>\r\n<br>\r\nMelody causally strided up to  to the Dog's office.<br>\r\n<br>\r\nShe knocked dryly<br>\r\n<br>\r\n\"Come in.\" Was Dan's voice.<br>\r\n<br>\r\nMelody strided in most seductively.<br>\r\n<br>\r\n\"Hello...\" She said her most seductive of voices.<br>\r\n<br>\r\nDan frowned \"You know you're powers don't work on me Melody.<br>\r\n<br>\r\n\"Yeah I know.\" Melody said \"I was just wondering, if you needed any help.\"<br>\r\n<br>\r\n\"What kind of help?\" Dan asked<br>\r\n\"If you ever need heroine who has the power to make most men do whatever she tells them\" The Lioness said</span></div></div>",
            "created":1345784400,
            "id":1412331,
            "title":"Enforcer"
        },
        "115331112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Melody leaves in a huff",
                "Melody stops and thinks about what's been said"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry but no.\" Dan said \"First of all your powers are limited, they only work on males, not females and there is an increasing number of female villains in New Wolf City like that Eco-Terrorist Panda Flora. Also sometimes your powers just don't work if a villain is enraged enough, there was one time you tried to stop Mad Path down with your voice...she just knocked you over!\"<br>\r\n<br>\r\nMelody growled a little she knew he was right but it was still embarrassing to hear about her past failures   <br>\r\n<br>\r\n\"I'll be honest Melody.\" Dan said \"You're a good friend and all but your powers are not that good and don't seem to work half the time.\"</span></div></div>",
            "created":1345784400,
            "id":1412529,
            "title":"Dan delclines"
        },
        "1153311122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Dan offers to take Melody out for a drink",
                "Dan offers to have a suit commisened for her"
            ],
            "content":"<div class=\"\"><div> <span>Melody stopped and thought for a moment<br>\r\n<br>\r\n\"I hate to admit it but I think you're right.\" She said sadly \"My powers ARE pretty limited and a lot of the time they don't work as they should...Sometimes I wonder if being a superhero was the right thing for me to do, My hypnotic powers seem more effective on regular Anthros then they do on super villains.\"<br>\r\n<br>\r\n\"You do have other strengths.\" Dan said \"As a Lioness you have natural strengh as well as sharp teeth and claws.\"<br>\r\n<br>\r\n<br>\r\n\"Yes.\" Melody said \"But what you don't realize is that for a lion I'm pretty small..I was the runt of my litter.\" </span></div></div>",
            "created":1345784400,
            "id":1412637,
            "title":"Sad But True"
        },
        "115332":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Massive sounds good, let's go with him",
                "Someone else please"
            ],
            "content":"<div class=\"\"><div> <span>Name: Massive<br>\r\n<br>\r\nSpecies: Brachiosaurus<br>\r\n<br>\r\nPowers: Growth: Can grow to 100 feet tall<br>\r\n<br>\r\nPersonality: Milo Saurus  as one of the few dinosaurs in New Wolf City knew he was going to face prejudice, As a suaropod  He already stood at nine feet tall, he had to stoop to get into most doorways, then his powers awakened and he discovered he had the ability to grow to 100 feet in height. Whenever he grows he has to be very careful not to crush anyone,<br>\r\n<br>\r\nAppearance: Since there aren't many clothes that can easily grow with the user, Milo's super costume is nothing but a pair of magic shorts that can grow with him. Milo has blue grey scales with a cream under belly.<br>\r\n<br>\r\n</span></div></div>",
            "created":1345611600,
            "id":1410548,
            "title":"Massive"
        },
        "1153321":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Panther and the Mayor",
                "The Secretary "
            ],
            "content":"<div class=\"\"><div> <span>Massive heard on the Dino-Alarm that a crazy black panther was holding the mayor hostage. He had to do something!<br>\r\n<br>\r\nMassive rushed over the building where the hostage situation was taking place, He quickly threw off his baggy oversized cloak leaving him only in his magic shorts.<br>\r\n<br>\r\n\"Time to get big!\" Massive said He grew up to three stories high!\"<br>\r\n<br>\r\nHe peeked in the window and found</span></div></div>",
            "created":1345611600,
            "id":1410813,
            "title":"Deal with a Panther"
        },
        "11533211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Mad Panth is too terrified to respond",
                "Mad Panth bites the hand that holds him"
            ],
            "content":"<div class=\"\"><div> <span>Massive spots the Panther threatening the Mayor.<br>\r\n<br>\r\nAs delicately as he could Massive reached his hand (Which was no big enough to hold a person) Into the room and grabbed a hold of the panther, it looked like a scene from King Kong<br>\r\n<br>\r\n\"Ahhhh! What the hell's happening?!\" Mad Panth   screamed as the giant hand wrapped around him and carried him out of the building<br>\r\n<br>\r\n\"You are a very mean cat.\" Massive said in his deep rumbling voice as he looked at the Panther in his hand</span></div></div>",
            "created":1345611600,
            "id":1410848,
            "title":"The Panther and the Mayor"
        },
        "115332111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Next Day",
                "Later that night"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Most Anthros don't take their first macro sighting in stride, Panth was frozen with fear.<br>\r\n<br>\r\nMassive shrank back to his normal size and put some handcuffs on him.<br>\r\n<br>\r\n\"Take him away Boys!\" Massive said</span></div></span></div>",
            "created":1345611600,
            "id":1410916,
            "title":"Getting back down to size"
        },
        "1153321112":{
            "author_id":"bufflover",
            "author_name":"Jurrasic Pursuit",
            "choices":[
                "He shrinks back down and goes to bed.",
                "Same as 1 but he has to go and fight another crime."
            ],
            "content":"<div class=\"\"><div> <span>As the 9 ft tall dino crouched-walked through the door to the bathroom Massive took a deep breath and started to grow. He had this feeling which was now so strong he couldn't fight it any more. He could hear the floor creak and feel the foundations bend under his enormus weight. <br>\r\nHe kept a mental log of his growth.<br>\r\n<br>\r\n12ft-sink damaged. Floorboards creak.<br>\r\n<br>\r\n15ft-sink destroyed. Floorboards begin to break.<br>\r\n<br>\r\n20ft-shower and toilet damaged. Begin to fill room.</span></div></div>",
            "created":1354338000,
            "id":1479399,
            "title":"Massive Muscles"
        },
        "1153322":{
            "choices":[
                "Trouble at the mayors office",
                "New character"
            ],
            "content":"<div class=\"\"><div> <span>Name:Enforcer<br>\r\nSpecies:German Shephard Dog<br>\r\nPowers:He wears a cybernetic enhancement suit, that significantly raises his strength, agility and reaction time.<br>\r\nPersonality:Sergeant Dan \"Dutch\" Shephard is a member of NWPD`s SWAT team and is the only member of the K-9 unit. He has lived in New Wolf City his entire life, he had always wanted to be a police officer, so he could follow in his fathers footsteps. The Government was not too fond of the heroes of New Wolf City taking the law into their own hands, so their response was to create a better hero, the best suited officer was chosen to become the first cybernetic law enforcement officer.<br>\r\nAppearance:The armor doesnt make it hard to figure out what animal he is. It is light blue and has the NWPD emblem enscribed on the right shoulder. He has a standard issue pistol strapped to his left thigh.The armor has a built in thruster pack on its back for sustained flight. Dan himself resembles any other Shephard dog.<br>\r\n<br>\r\nWhat is his first mission?</span></div></div>",
            "created":1345611600,
            "id":1410862,
            "title":"Enforcer"
        },
        "11533221":{
            "choices":[
                "A hero has Panth distracted",
                "Panth is starting a countdown"
            ],
            "content":"<div class=\"\"><div> <span>Dan was sitting in the station, relaxing after a long day, and in came the police chief. He said \"Sergeant Im afraid theres some trouble at the Mayors Office\" \"What kind of trouble, sir?\" Dan replied. The Chief said \"Panth has gone insane, hes strapped a bomb to the mayor and is threatening to detonate it unless hes reinstated\" This struck Dan momentarily as Panth used to be his partner before he was forcefully retired to his unstable condition. The Chief continued \"Your job is to get there quickly, the mayor is your first priority, try to get him to safety before dealing with Panth\". Dan replied \"Sir! Yes Sir!\" Dan ran into the locker room, all the lockers were hand print recognition, he approached one at the end of the row of lockers, when he pressed his hand up against the scanner, the locker raised up, and his suit was behind it. He put it on then ran to the roof of the station. He activated the thruster pack and leapt of, and flew in the direction of the mayors office. When he gets there he sees?</span></div></div>",
            "created":1345611600,
            "id":1410889,
            "title":"Trouble at the mayors office"
        },
        "115332211":{
            "choices":[
                "Back at the station",
                "The next day"
            ],
            "content":"<div class=\"\"><div> <span>Dan lands just outside the mayors office, in the middle of a mass of spectaters, they all step back in awe, all of them wondered who he was. A reporter ran over to him, \"Excuse me, are you a hero?\". He replied \"I am NWPD Enforcer, Ma`am I am going to need you to step aside\" It was only then that he saw the Hero named Massive, who was currently three stories tall and he had Panth clutched in his hand. He used this to his advantage as Panth was distracted from the Mayor, Enforcer flew through the open window to the Mayors office and said \"I am here to help you sir\" He approached the Mayor and the mayor said \"No, get back, that maniac strapped a bomb to me\" Enforcer began studying the bomb and then came up with a solution. He said \"Sir, you may feel a slight tingle\" as the suit channeled power to his hand and when he placed it on the bomb, it short circuited. Enforcer then grabbed the bomb and ran to the windo, he tossed it high into the air, pulled out his pistol and shot it, safely detonating it. There was then a cheer from the crowd as Enforcer land in the middle of the crowd with the mayor in his arms. The Mayor was then rushed away in a security vehicle, Enforcer was swarmed by reporters, he then took off, leaving the other officers to deal with the Massive, Panth situation.</span></div></div>",
            "created":1345611600,
            "id":1410908,
            "title":"A hero has Panth distracted"
        },
        "1153322111":{
            "choices":[
                "Later that night",
                "Next day"
            ],
            "content":"<div class=\"\"><div> <span>Back at the station Dan was praised for a job well done. He then took the suit off and got back into his uniform, he wanted to go see Panth, before he left the room he grabbed his sergeants cap.<br>\r\nWhen he arrived at Panths cell, he saw Panth was sitting in the corner, Dan coughed lightly to get Panths attention.<br>\r\nPanth looked at him and said \"Hey Dan, long time no see, hows my favourite partner?\". Dan replied \"Thats former partner and Ive been doing good, wish I could say the same for you, you really got yourself into a mess this time Panth\"<br>\r\nPanth sighed \"Lapse of weakness, I havent thought straight since they kicked me off the force\". Dan said \"You didnt think straight when you were on the force, thats why they made you leave\". Panth looked Dan in the eyes, then noticed his sergeants cap, \"They made you a sergeant, when did that happen?\". Dan tried to avoid eye contact and said \"The day you were removed\" under his breath. Panth stood up \"But the day I was removed, I found out that it was the sergeant, that signed off on the papers to have me removed\"<br>\r\nDan sighed and said \"I did for your own good Panth, I was worried something like what happened today, was going to happen\"<br>\r\nPanth stood up and approached the bars of the cell, he reached out and grabbed Dans tie and yelled \"You screwed me over, we were friends, partners\"  Dan eventually got free from his grasp and said \"Im sorry\" and then left. </span></div></div>",
            "created":1345611600,
            "id":1411014,
            "title":"Back at the station"
        },
        "11533221111":{
            "choices":[
                "He gets a visit from a hero",
                "He sees a crime"
            ],
            "content":"<div class=\"\"><div> <span>Dan was about to head home after an even more stressful day, all that waited for him at home was his shabby apartment. As he was about to head out the door the Chief called him back. \"Since most heroes can find and deal with villains and criminals by patrolling in their own way, I want you to patrol the city as Enforcer, alot of people are happy to see the law is finally up to speed with these lawless villains and vigilantes\" . Dan sighed and replied \"Yes Sir\"<br>\r\nWithin minutes he was in the air patrolling the city, keeping an eye out for troubles. Although he was new to being a hero, he was still a cop and he knew what trouble looked like. He landed on a rooftop, and sat on the ledge overlooking the rest of the city, he was beat.<br>\r\nThen?</span></div></div>",
            "created":1345784400,
            "id":1412189,
            "title":"Later that night"
        },
        "115332211111":{
            "choices":[
                "Dan agrees for help",
                "Dan disagrees"
            ],
            "content":"<div class=\"\"><div> <span>Later on, after his patrol Dan was back in his office, he couldnt leave because there was a swarm of reporters outside the office, apparently it wasnt hard for them to identify Enforcer as a German Shephard and to notice he was the only Shephard in the NWPD. So instead of heading home to relax, he sat in his office and did paper work. There was a dry knock on the door. \"Come in.\" Dan said.Dan watches as the liones heroine Melody strided into the room in a seductive manner. \"Hello...\" She said her most seductive of voices. Dan frowned \"You know you're powers don't work on me Melody.\"Yeah I know.\" Melody said \"I was just wondering, if you needed any help.\"<br>\r\n\"What kind of help?\" Dan asked <br>\r\n\"If you ever need a heroine who has the power to make most men do whatever she tells them\" The Lioness said.<br>\r\nDan thinks about it and says.</span></div></div>",
            "created":1345784400,
            "id":1412517,
            "title":"He gets a visit from a hero"
        },
        "1153322111112":{
            "choices":[
                "Melody leaves in a huff",
                "Melody thinks about what Dan said"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry but no.\" Dan said \"First of all your powers are limited, they only work on males, not females and there is an increasing number of female villains in New Wolf City like that Eco-Terrorist Panda, Flora. Also sometimes your powers just don't work if a villain is enraged enough, there was one time you tried to stop Mad Path down with your voice... he just knocked you over!\"<br>\r\nMelody growled a little she knew he was right but she seemed embarrassed to hear about her past failures.<br>\r\n\"I'll be honest Melody.\" Dan said \"You're a good friend and all but your powers are not that good and don't seem to work half the time.\"</span></div></div>",
            "created":1345784400,
            "id":1412607,
            "title":"Dan disagrees"
        },
        "11533221111122":{
            "choices":[
                "Ask Melody out for a drink",
                "Offers to have a suit commissioned for her"
            ],
            "content":"<div class=\"\"><div> <span>Melody stopped and thought for a moment. \"I hate to admit it but I think you're right.\" She said sadly \"My powers ARE pretty limited and a lot of the time they don't work as they should...Sometimes I wonder if being a superhero was the right thing for me to do, My hypnotic powers seem more effective on regular Anthros then they do on super villains.\"<br>\r\n\"You do have other strengths.\" Dan said \"As a Lioness you have natural strengh as well as sharp teeth and claws.\"<br>\r\n\"Yes.\" Melody said \"But what you don't realize is that for a lion I'm pretty small..I was the runt of my litter.\" <br>\r\nDan feels bad for what he had said so he...</span></div></div>",
            "created":1345784400,
            "id":1412692,
            "title":"Melody thinks about what Dan said"
        },
        "115332211111221":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Dan stood up out of his chair and approached Melody, who was staring at the ground in an upset manner. He put his hand under her chin, and got her to look at him, the seriousness in his eyes left, and was replaced by something much warmer.<br>\r\nHe then says \"How about we go out for a drink, and a bite to ....\" Suddenly there was a high pitch alarm. \"Damn it!\" Dan said angrily, he then turned away from Melody and pushed a button on the intercom on his desk \"Whats going on, why is the alarm blaring?\". The reply was \"Sir, it appears \"The Hyena\" is attempting a break out of Grey Vault Prison it also seems that there are explosives going off all over the prison\"<br>\r\nDan swore under his breath, then looked to Melody \"As soon as I get back, Ill take you back to my apartment and treat you to my specialty, Day old hot dogs\". Melody chuckles and says \"Maybe we should just order a pizza\". Dan replied \"That works. Will you wait for me?\". Melody looked him in the eyes, and approached him slowly and brought her mouth close to his, but not close enough to kiss, and whispered \"Always\".<br>\r\nDan left and got into his suit, and took off towards the prison. Once there he was informed by the warden that all inmates were accounted for, except the Hyena, a few others and Panth. While standing outside the prison, multiple explosives went off and the prison began burning. Dan immediately took off into the prison despite the orders of the warden. It didnt matter to him, he had to find Panth, he had to make sure Panth was safe. Does he find Panth?</span></div></div>",
            "created":1348722000,
            "id":1435947,
            "title":"Ask Melody out for a drink"
        },
        "1153322111112212":{
            "choices":[
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>He runs through the prison, checking cell by cell, and calling the name of his former partner. He then bumps into two timber wolfs, one wearing an intimidating mask, the other only a child. \"Who are you, are you alright?\" Dan asks. \"The masked wolf replies \"My name is Jack Im an inmate here, this is my younger brother, he came here to visit me, do you know the way out?\" Dan takes off his helmet and gives it to Jacks younger brother \"This should keep the smoke off your face\" Dan then takes a locator off his belt \"Follow the directions on this it`ll get you out of here\". Jack said \"Thank you\" As he and his brother ran off.<br>\r\nDan continued to run through the prison. He doesnt find Panth though, he becomes surrounded by flames, and confused by smoke. He wanders into a room with a bomb in it and the timer is counting down \"5...4...3...\" Dan turns and begins to run \"...2...1...0...BOOM!!\" Dan lays on the ground, disorientated, bleeding, coughing, and everything around him becomes darker and darker.</span></div></div>",
            "created":1348722000,
            "id":1435949,
            "title":"Out in a blaze of glory"
        },
        "11533221111122121":{
            "choices":[
                "At his apartment",
                "After hes done at the apartment"
            ],
            "content":"<div class=\"\"><div> <span>The next day... There was a crisp, winter breeze throughout the city and there was no crime that day. Dan was given a state burial, his coffin covered with his countries flag, carried by his fellow officers, and through a Guard of Honor. All officers wore black as a sign of respect. The mourners gathered at his grave, family, friends, co-workers, and some heroes. Even Jack was there with his brother on his shoulder. People stood to say kind words, and share warm memories. Then the crowd dispersed, one by one. Finally the only one left there was Melody who knelt at his grave and between the bouquets of flowers, she laid a single rose, and wept for Dan, she said hoarsely \"Im... still waiting... for you\"<br>\r\nOn a rooftop, overseeing the graveyard, stood an ebony feathered bird anthro, to his side was a shepard anthro. \"Thanks again, Raven, I owe you one\". Raven looked at the shepard \"No Dan, now we`re even\" Raven then flew off. Dan felt bad for Raven, he always had a burden to carry. Raven was in some words a hero, he had the supernatural ability, to see into the future, and call forth the spirits of the dead. He did this for Dan, he called his spirit back to the world of the living, and gave him a body identical to his one, that was just buried. Dan took in a deep breath of fresh air, then looked at Melody weeping over his grave and sighed. He decided not to regain his old life, at least not so soon, he felt it would be very hard on the emotions of those he cared about. Dan was heading to his apartment, he needed to get some things there, before moving into a new place, however since everyone in the city knew what he looked like, he needed to keep things on the down low.<br>\r\nNext?</span></div></div>",
            "created":1348722000,
            "id":1435953,
            "title":"Next"
        },
        "115332211111221211":{
            "author_id":"inuwolf",
            "author_name":"Max Wolf",
            "choices":[
                " Someone he knew from the police?",
                "Other hero?"
            ],
            "content":"<div class=\"\"><div> <span>When The shepard enter to his apartmen he start to pack everything he can trying to no attrak the atention, when he got everything he found which were afew photos and clothes then he start to move to a old build where no one can found him....<br>\r\n<br>\r\nLater that night....<br>\r\n<br>\r\nThe shepart was patroling the city in dark clothe hiding his face when he walks into someone...</span></div></div>",
            "created":1452142800,
            "id":2085847,
            "title":"At his apartment"
        },
        "1153322111112212111":{
            "author_id":"jakobscove",
            "author_name":"Shaved_Space_Monkey",
            "choices":[
                "Melody; the lioness wearing civilian clothing",
                "Black Panth; who somehow escaped before the explosion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"OOF\" says Dan as he stumbles back and regains his composure. \"Sorry about tha-,\" Dan was about to finish apologizing when he looks back to the anthro who he walked into, when his eyes go wide when he realizes who it was: </span></div></span></div>",
            "created":1582522080,
            "id":2791982,
            "title":"A familiar face"
        },
        "11533222":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Go with her",
                "New Character"
            ],
            "content":"<div class=\"\"><div> <span>Name: Crocodilla<br>\r\n<br>\r\nSpecies: Nile Crocodile<br>\r\n<br>\r\nPowers: Telepathy, Telekinesis<br>\r\n<br>\r\nPersonality: Ruby Tuesday, comes from a long line of powerful psychics, her family has had mystical powers since they lived in the time of the Mighty Pharaohs, These days Ruby is a mild mannered Music Teacher at New Wolf High, she has a secret crush on her co-worker Jonathan Tabbis,  but she believes he would never except her due to the fact she is a plain reptile woman, Ruby does not know that Jonathan is the Tomcat Avenger. When she uses her psychic powers she tends to be much more confident and aggressive then she is as a Teacher<br>\r\n<br>\r\nAppearance:  Crocodilla wears a Gypsy outfit to lure her enemies in before she clobbers them, her outfit is kind of simpler to the dress Esmeralda wore in Disney's The Hunchback of Notre Dame, white and purple dress, with gold bracelets on her wrists and ankles<br>\r\n<br>\r\n</span></div></div>",
            "created":1345611600,
            "id":1410996,
            "title":"Crocodilla "
        },
        "115332221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Tell Him You're just tired and need a rest",
                "Confess your crush"
            ],
            "content":"<div class=\"\"><div> <span>It had been a long day at school, Ruby was ready to go home and put her feet up, suddenly she saw her crush Jonathan Tabbis coming down the hall.<br>\r\n<br>\r\n\"Oh my gosh!\" She said \"Keep it cool Ruby! Don't make a fool of yourself.\"<br>\r\n<br>\r\nRuby tried to walk by the Cat Man without so much as blinking an eye, then Jonathan turned and said<br>\r\n<br>\r\n\"Good Afternoon Ruby! Lovely weather we're having isn't it!\"<br>\r\n<br>\r\n\"Oh!\" Ruby said \"The weather! Right! It's just...peachy!\"<br>\r\n<br>\r\n\"Are you all right Ruby?' Jonathan asked \"You look feverish\"</span></div></div>",
            "created":1345611600,
            "id":1411001,
            "title":"After a Long Day"
        },
        "1153322211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "That night there is some trouble",
                "Nothing happens that night, time for some R&R"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Sorry.\" Ruby said \"I'm just tired and need a rest.\"<br>\r\n<br>\r\nWith that Ruby ran off<br>\r\n<br>\r\n\"Oh...\" She muttered under her breath how could I ever confess my love to him!\"</span></div></span></div>",
            "created":1345698000,
            "id":1411374,
            "title":"Shy"
        },
        "115332222":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Go with him",
                "Next superhero please."
            ],
            "content":"<div class=\"\"><div> <span>Name: superdog<br>\r\n<br>\r\nSpecies: Beagle dog<br>\r\n<br>\r\nPowers: super strength, flying, super speed, super smarts<br>\r\n<br>\r\nPersonality: Bark kent comes from a long line of sumo wrestlers, his family is world reknowned for competing in sumo wrestling since it started in feudal japan, These days Bark is a mild mannered sumo wrestler known throughout all of new wolf city, he's also a ladies dog, but he believes he really deserves to have a girlfriend, Bark didn't know it but as superdog his enemies include the hyena and new wolf city's rogues gallery of villains including the doggy doughgirl herself. When he uses his superpowers he tends to be even more confident and agressive then when he's sumo wrestling.<br>\r\n<br>\r\nAppearance: Superdog wears a costume that's very similar to superman's costume but much bigger due to superdog's massive weight.</span></div></div>",
            "created":1345870800,
            "id":1413399,
            "title":"New Character"
        },
        "1153322221":{
            "author_id":"bufflover",
            "author_name":"Jurrasic Pursuit",
            "choices":[
                "Prove those Super- Smarts!  Chose the safer choice and knock out the Security"
            ],
            "content":"<div class=\"\"><div> <span>Bark sprinted for the secret dressing room. He slipped on his costume and did a quick flex to show off those enormous car-lifting muscles. He had just found out that there was a major bank heist doing on Downtown. Stepping out the door of his dojo, Superdog lept up into the sky with those tremendous leg muscles. Flying at the speed of sound, Superdog reached the bank in a minute. Landing on the ground by a group of SWAT officers including the super-cop, Enforcer. \"What's the situation?\" \"The robbers have laser rifles and they've taken hostages. \"Don't worry, I'll rescue them.\" And with that he lept up into the air and flew up to the roof. Looking through the skylight he saw the poor hostages tied up. Ready for an execution. Superdog gave out an intimidating growl and plotted his next move. The snipers on the balcony or the goons in the security office?</span></div></div>",
            "created":1352264400,
            "id":1463089,
            "title":"Go with him"
        },
        "11533222211":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "A visitor arrives at Bark's sumo stable.",
                "A flyer for a sumo tournament is delivered to Bark Kent.",
                "Open Choice Chapter."
            ],
            "content":"<div class=\"\"><div> <span>At that moment Superdog thought to himself as he started to use his super smarts in order to plot his next move.<br>\r\n<br>\r\n\"First I'll knock out the snipers on the balcony, then I'll knock out those goons in the security office and after that I'll untie the hostages and proudly escort them out of the bank.\" Superdog thought to himself as he was about to take down the snipers on the balcony.<br>\r\n<br>\r\nSuperdog then flew over to where the balcony was as he knocked out the snipers themselves by using his hundred paw slap technique.<br>\r\n<br>\r\nUpon knocking the snipers out, Superdog quickly made it over to the security office as he knocked down the security office's door with ease as the goons themselves were taken by surprise.<br>\r\n<br>\r\n\"H-h-h-how'd you get in here so quick?! Those snipers should've taken you out by now!\" One of the goons exclaimed.<br>\r\n<br>\r\n\"Let me put it this way those snipers were easy to get past, and I'm gonna stop you goons as I'm going to rescue the hostages themselves.\" Superdog proudly said.<br>\r\n<br>\r\n\"All right boys get em!\" The goons leader said as he ordered his goons to attack Superdog.<br>\r\n<br>\r\nSuperdog at that very moment did his traditional Sumo stomp as he then charged at the goons themselves as he used his hundred paw slap technique and beat those goons silly as Superdog then untied the hostages themselves and proudly escorted them out of the bank themselves.<br>\r\n<br>\r\n\"Fear not everyone for I've stopped the bad guys and rescued the hostages themselves.\" Superdog heroically said as he leaped into the air.<br>\r\n<br>\r\n\"Up up and away!!\" Superdog barked as he flew back home to his Sumo stable and went back into his secret dressing room as he took off his costume as Bark Kent put on his Kesho Mawashi as he started eating sumo Sumo stew and sushi for dinner until someone or something got his immediate attenion.<br>\r\n<br>\r\n</span></div></div>",
            "created":1550873640,
            "id":2621563,
            "title":"Prove those Super- Smarts!  Chose the safer cho..."
        },
        "1153322222":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Go with him",
                "Next hero please"
            ],
            "content":"<div class=\"\"><div> <span>Name: Thundershock<br>\r\n<br>\r\nSpecies: Timberwolf<br>\r\n<br>\r\nPowers; Electric blast and manipulation<br>\r\n<br>\r\nPersonalities: Hunter Bradley is your typical bicycle messenger until one day he received an important delivery from an unknown client promesing extra if the package is delivered by 7:00 PM, but unknown to him the mob also wants it and will kill for it. So they made a trap for Hunter by changing the destination to one of New Wolf City's power stations. Where he was lured between two tesla coils of the systems electrical transformer and then receiecved almost 10,000 volts of electricity but instead of killing him, it tured him into a walking battery that's where he vowed to use his powers to help people and fight crime.<br>\r\n<br>\r\nNote: His weakness is when he uses his powers that it drains him, so he needs to recharge by going to any electric source such as a transformer or a battery.<br>\r\n<br>\r\nAppearance: He wears a jet black costume with a white cape and a lightning insignia on his chest. And he wears a black mask.</span></div></div>",
            "created":1347944400,
            "id":1430693,
            "title":"Thundershock"
        },
        "11533222222":{
            "author_id":"bufflover",
            "author_name":"Jurrasic Pursuit",
            "choices":[
                "Working out (bending steel bars, ripping trucks in half, shaking the earth).",
                "Fighting crime."
            ],
            "content":"<div class=\"\"><div> <span>Name: Charger<br>\r\n<br>\r\nSpecies: Bull<br>\r\n<br>\r\nPowers: Size, Super Strength, Super Speed, Horns, Stampede, Skill in Military vehicles and weapons<br>\r\n<br>\r\nPersonality: Private David Hefferson was a modest, kind soldier in the NWC Military. An accident in his base's R&amp;D Lab changed his life forever. Assigned for defense with his Sargent he was attacked by a traitor and injected with a toxin. But instead of killing him he began to transform into a 15ft tall muscle hulk! When he woke up in hospital he found he was gifted with immense size and strength and speed. Working with the other team members he vowed to bring the evil to justice.<br>\r\n<br>\r\nNote: As much as he uses his speed and strength for attacks, using his size is a great advantage for defense.<br>\r\n<br>\r\nApperance: He wears a very flexible military suit with the Belltower Logo to avoid it shredding when he flexes. (See Deus Ex:Human Revolution for more info on the Logo).<br>\r\n<br>\r\nWhere is Charger at the moment?</span></div></div>",
            "created":1355288400,
            "id":1486755,
            "title":"Next hero please"
        },
        "115332222222":{
            "author_id":"vgm765",
            "author_name":"UlitmateNeo",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure that is what you want?</span></div></span></div>",
            "created":1423285200,
            "id":1929178,
            "title":"The choices, the choices!"
        },
        "1153322222222":{
            "choices":[
                "Bunny Boy sounds cool",
                "How about a new hero"
            ],
            "content":"<div class=\"\"><div> <span>Name: Bunny Boy<br>\r\n<br>\r\nSpecies: Rabbit<br>\r\n<br>\r\nPowers: Anything that a rabbit can naturally do plus flight<br>\r\n<br>\r\nPersonality: An ordinary Teenage rabbit by day and a crime fighter by night. Ever since Ben Bunsley was a little boy he could use use his ears to fly into the air. His parents were shocked at this development and sent him to Rebecca Barker's Institute for the Abnormal. While attending classes Bunny Boy was taught how to fight by great instructors such as Massive and Slicilla, a female wolverine with a foul attitude. After Years of training he join the Anima-Men, a superhero team who fights for equal rights for all superheroes.<br>\r\n<br>\r\nCostume and Appearance: Buuny Boy wears a white battle suit and a red mask. He has black fur, stands at 5'1\" since he's still fairly young and has blue eyes.</span></div></div>",
            "created":1468546860,
            "id":2180348,
            "title":"We want some other heroe"
        },
        "11533222222222":{
            "choices":[
                "Enter Jumbo-Tiger, Master sumo and crimefighter",
                "More heroes please"
            ],
            "content":"<div class=\"\"><div> <span>Name: Jumbo-Tiger<br>\r\n<br>\r\nSpecies: Tiger<br>\r\n<br>\r\nPowers: Gravity manipulation, super strength, and an excellent healing factor<br>\r\n<br>\r\nPersonality: A Tiger who is over 200 years old but appears to be in his mid 20s. Sebastian Clawmine first discovered his mutant powers at age 10. Upon growing up his healing factor caused him to become very obese. Yet being as old as he is he traveled to Japan and became a sumo wrestler. After being a yokozuna for 10 years and weighing 1,200 lbs. Jumbo-Tiger decided to retire, lest anyone discovers that he's a mutant. It was then he moved to New Wolf City and started a booming sumo dojo. He's even aware that Bark Kent is Superdog due to them encountering each other while fighting crime and their student master relationship. Besides his friendship with Bark he also helps the Anima-Men. Sebastian even has a crush on a Tigress known as Teresa Monrow aka Psychic Tigress.<br>\r\n<br>\r\nAppearance: 7'2\" and currently weighs 1,500 lbs. His super hero costume is strictly a black mawashi and a black mask that goes to his nose. He has the typical coloring of a tiger and yellow eyes.</span></div></div>",
            "created":1468549440,
            "id":2180365,
            "title":"How about a new hero"
        },
        "12":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "The Hyena",
                "Nightmare",
                "Jack-O-Lantern",
                "The Reynard",
                "More Villains"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your villain</span></div></span></div>",
            "created":1318827600,
            "id":1208280,
            "title":"Villain"
        },
        "121":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Robbing a bank",
                "Seeking revenge against his old partner",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Name: The Hyena<br>\r\n<br>\r\nSpecies: Hyena<br>\r\n<br>\r\nPowers: Uses enhanced novelty itims for his crimes<br>\r\n<br>\r\nPersonality: A failed comic turned criminal, he's a flunky for a crime boss until he was left behind on a chemical plant caper, he was double crossed and left for dead, now totally insane, he became the super criminal known as the Hyena.<br>\r\n<br>\r\nDescription: He wears a blue and white striped suit with a flower on the lapel, in which emits a gas that causes anyone gassed to laugh uncontrollably.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat's he doing now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1318827600,
            "id":1208285,
            "title":"The Hyena"
        },
        "1213":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A hero intervenes",
                "The Heist goes off without a hitch",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It's fair time, you see the rides and attactions are all lit up but ouside the fairgrounds sits a customed van, on the grill it's a smiling mouth complete with teeth and on the side of the van says \"Slapstick pie co.\" inside it is 3 figures the Hyena and two wolves one overwheight and the other slightly skinny resempling two old fashioned comics.<br>\r\n<br>\r\nThe Hyena: Ahh, don't you two love fairs? The smell of popcorn and the greasepaint?<br>\r\n<br>\r\nHardy(the fat wolf): Why are we here Hyena?<br>\r\n<br>\r\nThe Hyena: Simple sense fairs draw a crowd, that leaves a lot of money. There's a fortune in there and we're gonna take it all. Ahh HAHAHAHAHA!<br>\r\n<br>\r\nLaurell(the skinny one): What if a hero appears like Ice Fang, Tomcat Avenger or Sweet Charity?<br>\r\n<br>\r\nThe Hyena: I'll worry about it when time comes, come boys let's have our fun, at the people's expense.<br>\r\n<br>\r\n<br>\r\nThe Hyena and his henchmen leaves the van and heads towards the entrance<br>\r\n<br>\r\nThe Hyena: Remember where we're parked.</span></div></div>",
            "created":1345352400,
            "id":1408356,
            "title":"Fair amount of trouble"
        },
        "12131":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Captain cookbook vs the hyena ",
                "Someone tries to intervene"
            ],
            "content":"<div class=\"\"><div> <span>As soon as the hyena was done adressing his two goons, a new superhero in town arrived at the fair and started to confront the hyena and his gang.<br>\r\n<br>\r\nCaptain cookbook: Stop right there hyena, you're not gonna rob the fair while i'm here.<br>\r\n<br>\r\nThe hyena: Yeah right big boy like you're gonna stop me and my two goons, by the way who are you anyway? i've never seen someone like you around here before.<br>\r\n<br>\r\nCaptain cookbook: My name's captain cookbook and you're right about me being big but whatever, anyway i'm going to enjoy kicking your bad guy butt and that goes double for your two goons as well.<br>\r\n<br>\r\nThe hyena: That's what you think, alright boys get em<br>\r\n<br>\r\nLaurel and hardy: yes sir.<br>\r\n<br>\r\nAnd so laurel and hardy came running towards captain cookbook until captain cookbook took both of them down with ease and left the hyena wondering what to do next.<br>\r\n<br>\r\nCaptain cookbook: Well hyena you vile fiend i've taken down your two goons, now it's just between you and me.<br>\r\n<br>\r\nThe hyena: Oh i forgot to mention i have this corset on and in case my two goons fail to beat any superhero we're up against i've got my secret weapon with me at all times so here it is.<br>\r\n<br>\r\nAt that moment the hyena took off his corset and somehow he appeared to be just as big and fat as captain cookbook was and began to heavily stomp towards captain cookbook as they were about to do battle with each other </span></div></div>",
            "created":1345352400,
            "id":1408408,
            "title":"A hero intervenes"
        },
        "12132":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A hero stops them",
                "They rob everyone"
            ],
            "content":"<div class=\"\"><div> <span>The fair entrance is guarded by s grizzaly bear morph while the Hyena and his two henchmen disguised as pastery chefs hauling a cartful of pies.<br>\r\n<br>\r\nSecurity guard: No one comes in without paying.<br>\r\n<br>\r\nThe Hyena: We're delivering some pies for the pie eating contest.<br>\r\n<br>\r\nSecurity guard: The pies was delivered this afternoon.<br>\r\n<br>\r\nThe Hyena holds up his hand palm facing up while Hardy places one of the pies in his hand.<br>\r\n<br>\r\nThe Hyena: Oh these are special pies.<br>\r\n<br>\r\nSecurity guard: What so special about them?<br>\r\n<br>\r\nThe Hyena: They're sleeping cream and nuts.<br>\r\n<br>\r\nSecurity guard: Sleeping cream and nuts?<br>\r\n<br>\r\nThe Hyena: Nuts to you.<br>\r\n<br>\r\nThe Hyena splats the pie in the guard's face and laughts menacingly as the guard falls asleep.<br>\r\n<br>\r\nThe Hyena and his henchmen enter the park placing the cart by one of the booths and opens it<br>\r\n<br>\r\nThe Hyena: Alright boys, It's funtime. You all know what to do.  Grab some pies, split up and go at it.<br>\r\n<br>\r\nThey all soon go all over the park splatting pies at everyone and rob them while they're sleeping until.</span></div></div>",
            "created":1345438800,
            "id":1409161,
            "title":"The Heist goes off without a hitch"
        },
        "121321":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "The Hyena and his henchmen are defeated",
                "The Hyena fights back"
            ],
            "content":"<div class=\"\"><div> <span>Tne Hyena and his henchmen continues to splat pies at the fair goers and rob them of their money starting from the rollercoaster and makes their way to the concession stand. The Hyena looks over the ill gotten gains and smiles at the amount he and his henchmen stolen so far.<br>\r\n<br>\r\nThe Hyena: Heh heh! This is a good haul Eh Boys?<br>\r\n<br>\r\nLaural and Hardy nods in agreement but then a figure drops down on top of The Hyena. It's Sweet Charity, she bites him in the face.</span></div></div>",
            "created":1345525200,
            "id":1409725,
            "title":"A hero stops them"
        },
        "1213212":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Another Hero intervenes",
                "Sweet Charity fights Hyena on her own."
            ],
            "content":"<div class=\"\"><div> <span>However, Hyena noticed that Sweet Charity is holding back on his venom injection, this gives him the oppotunaty to fight back.<br>\r\n<br>\r\n Hyena punched her on the side of the face to get her off him.<br>\r\n<br>\r\nThe Hyena: You really think a little venom could stop me?!</span></div></div>",
            "created":1345525200,
            "id":1409754,
            "title":"The Hyena fights back"
        },
        "12132122":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "The punch lands",
                "He evades and counters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sweet Charity rubs the side of her face where Hyena punched her. \"No just thought I settle this the old fashion way\" she said as she chargened at him aming a punch right for his face.</span></div></span></div>",
            "created":1441774800,
            "id":2032196,
            "title":"Sweet Charity fights Hyena on her own."
        },
        "122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Robbing a jewelry store",
                "Getting revenge on some rich girl she knew from high school?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Name: Nightmare<br>\r\n<br>\r\nSpecies: Horse<br>\r\n<br>\r\nPowers: Uses chemicals to make her victims see their worst fears<br>\r\n<br>\r\nPersonality: Andrea Equine was a shy, nerdy, chubby girl who was teased mercilessly in high school. Boys often tried to take unfair advantage of her because she was so shy and reserved, Andrea was terribly afraid of fire, she didn't want anyone to find out about that, unfortunately the bullies did find out about that and some thugs decided to torment her by burning her with matches, that was the final straw for Andrea, from point forward she dedicated her life to getting revenge on those her tormented her, she called herself  'Nightmare' she developed a chemical that can cause someone to see their worst fears.<br>\r\n<br>\r\nDescription: Andrea is brown and white paint horse, When is costume she dresses like a Scarecrow in baggy brown clothes and cowboy hat.<br>\r\n<br>\r\nWhat is she doing now? </span></div></div>",
            "created":1345352400,
            "id":1407824,
            "title":"Nightmare"
        },
        "1222":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A Hero investgates",
                "The plan goes uninteruptted",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Nightmare was getting ready for her biggest revenge scheme yet, This was the night she got her revenge on Tiffany Tigre, the Tiger who was her biggest enemy in high school.<br>\r\n<br>\r\nNightmare was dressed in her scarecrow costume, complete with cowboy hat, no one would mistake her for a ravishing beauty at the Belle Ball!<br>\r\n<br>\r\nHer two henchmen were two Ape Men, The White Ape Nigel, and the Red Ape Anthony, they were wearing gas masks to protect themselves from the toxin<br>\r\n<br>\r\n(Nightmare herself had developed immunity to the fear gas) They approached the Ballroom.<br>\r\n<br>\r\n\"Remember be careful!\" Nightmare said firmly \"We don't want any heroes ruining our fun!\"    </span></div></div>",
            "created":1345352400,
            "id":1408088,
            "title":"The Belle Ball"
        },
        "12221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Cat answers",
                "The Cat doesn't answer he just fights"
            ],
            "content":"<div class=\"\"><div> <span>Nightmare started by getting her fear gas pumped into the air system, she could hear the screams \"Oh my god! We're being gassed!\"<br>\r\n<br>\r\nThat's when Nightmare kicked the door down with her hoof to make her grand entrance!<br>\r\n<br>\r\n\"Hello Tiffany!\" Nightmare said in a low chuckle<br>\r\n<br>\r\nTiffany screamed when she saw Nightmare and ran away.<br>\r\n<br>\r\nSuddenly, Nightmare felt someone pull a leg sweep on her she fell to the ground,<br>\r\n<br>\r\nShe looked up and saw a Cat wearing a gas mask<br>\r\n<br>\r\n\"Who the hell are you?\" She snarled </span></div></div>",
            "created":1345352400,
            "id":1408128,
            "title":"Battle"
        },
        "122211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "She kicks herself free of the whip",
                "No luck, she's taken to jail"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm the Tomcat Avenger.\" The Cat says with that he begins the fight he takes out his bullwhip and ties up Nightmares ankles with it.<br>\r\n<br>\r\nNightmare however was no pushover, she flicked her long tail in the Cat's face to irritate his his eyes.<br>\r\n<br>\r\nThe Cat however quickly dodged the attack.<br>\r\n<br>\r\nNightmare started to thrash and whinny violently, she couldn't figure out how to free herself.</span></div></div>",
            "created":1345352400,
            "id":1408165,
            "title":"Epic Fight"
        },
        "1222111":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "What is his worse fear"
            ],
            "content":"<div class=\"\"><div> <span>Nightmare keeps thrashing eventually kicking the whip out of the Tomcat Avenger\"s paws freeing herself. Quickly getting up she gave no chance to counter using her tail to irritate his eyes.<br>\r\n<br>\r\nThe cat rubs is eyes at the same time Nightmare throws a small chemical bomb at the cat that goes off in his paws.<br>\r\n<br>\r\n\"ha ha\" now lets see how you face your worse fears\" she said as she whinnied in delight.<br>\r\n<br>\r\n</span></div></div>",
            "created":1442466000,
            "id":2035857,
            "title":"She kicks herself free of the whip"
        },
        "1222112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "content":"<div class=\"\"><div> <span>Nightmare was unable to free herself, The Tomcat put handcuffs on her and took her away to jail.<br>\r\n<br>\r\nAs the door slammed shut you could hear Nightmare scream into the night<br>\r\n<br>\r\n\"NEXT TIME, TOMCAT AVENGER! ...NEXT...TIME!\"</span></div></div>",
            "created":1345352400,
            "id":1408197,
            "title":"The End...For now"
        },
        "123":{
            "choices":[
                "Out for some fun",
                "Contemplating something big",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name:Jack-O-Lantern<br>\r\n<br>\r\nSpecies:Timber Wolf<br>\r\n<br>\r\nPowers:Can create illusions, Objects created also have physical mass to further the illusion.<br>\r\n<br>\r\nPersonality:As a young child Jack was perfectly happy, he lived with his family, he had a roof over his head, and was never hungry. But when his powers came to surface he was treated as an outcast by society, friends, and by his family. His family didnt want him anymore, so he spent a majority of his youth living on the streets trying to survive. He hitchhiked to New Wolf City for a fresh chance, as in this large city, with its busling masses, people wouldnt assume him to be the same \"freakshow\" they heard about in the news. He began using his powers to create optical illusions to earn money from passerbys, and if he was ever strapped for cash he was not above using his abilities to scam people.<br>\r\n<br>\r\nDescription:Jack is tall and thinly black furred wolf. He wears a trench coat, gloves, claw tipped boots. He wears a bullet proof vest under the coat, he also wears a pair of formal trousers.<br>\r\nBefore he started out using his abilities for the detrement of his fellow species, he witnessed a hero battling against a villain, and during the battle a toxin that was meant to hit the villain missed and got him in the face. It was the day he decided that if that the hero could be careless, so could he. To prevent himself from being wrapped up in morality, he decided to be a villain. Since his face was badly scarred by the toxin, he wore a steel helmet, with intimidating eye holes carved into it, and a mouth with jagged teeth carved into it. He added something to the helmet which made the carved areas shine with a luminescent yellow, to increase the fear of those who see him.<br>\r\n<br>\r\nWhat is he doing now?</span></div></div>",
            "created":1345438800,
            "id":1409187,
            "title":"Jack-O-Lantern"
        },
        "124":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Reynard is robbing some store",
                "Reynard is busy with another caper",
                "Something else   "
            ],
            "content":"<div class=\"\"><div> <span>Name: The Reynard<br>\r\n<br>\r\nSpecies: Silver Fox<br>\r\n<br>\r\nPowers: Super Intelligence<br>\r\n<br>\r\nPersonality: Zorro Foxworthy fancies himself the new Reynard and tries his best to outwit his fellow Anthros. Unfortunately he also has a pitiable compulsion to leave  clues at every crime scene for the police and superheroes to find, This stems from Zorro's childhood when his belligerent father would beat him for not telling the truth, Zorro now has to leave clues in the form of riddles because of this childhood trauma.<br>\r\n<br>\r\nDescription: The Reynard wears a green jumpsuit with blue paw prints  on it he has pure silver fur and blue eyes<br>\r\n</span></div></div>",
            "created":1345611600,
            "id":1410497,
            "title":"The Reynard"
        },
        "125":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Mad Panth",
                "Sorrow",
                "Still More Villains"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these bad boys/girls</span></div></span></div>",
            "created":1345611600,
            "id":1410628,
            "title":"More Villains"
        },
        "1251":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Setting bombs in a clothing store",
                "Holding the Mayor hostage at City Hall"
            ],
            "content":"<div class=\"\"><div> <span>Name: Mad Panth<br>\r\n<br>\r\nSpecies: Black Panther<br>\r\n<br>\r\nPowers: Bombs, Hand to hand combat<br>\r\n<br>\r\nPersonality: Samual 'Panth' Panther used to work for the police bomb squad disarming bombs was is speciality, up until he got laid off. He protested to the city officials but he was ignored because of his unstable condition. Now he takes matters in his own hands.  As Mad Panth, he now sets bombs and sets them off using a remote detonator. On top of that he has issues with many of things in which he thinks that should exhist. With a very short temper he can be quite impossible to reason with.<br>\r\n<br>\r\nDescription: He wears a black battle suit with a remote detonator in his vest pocket, he's known to carry large amount of bombs in a backpack.<br>\r\n<br>\r\nWhat is he doing now?</span></div></div>",
            "created":1345611600,
            "id":1410656,
            "title":"Mad Panth"
        },
        "12512":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A Hero to the rescue",
                "Panth's old unit stops him"
            ],
            "content":"<div class=\"\"><div> <span>Downtown New Wolf City<br>\r\n<br>\r\nA large crowd is gathered around City Hall with police gathered at the entrance trying to keep the crowd calm, A tigress morph holding a Microphone <br>\r\n<br>\r\nNews Tigress: This is Wanda Tigre of W.O.L.F TV in front of City Hall where an hour ago, a maniac calling himself Mad Panth has made is way into the Mayor's office and holding him hostage, with this strange ultimatum.<br>\r\n<br>\r\nA recording is played<br>\r\n<br>\r\nMad Panth: To the officials of New Wolf City. I'm currently holding the mayor hostage. He's currenly tied to his desk with a bomb in front of him. I demand my job back. If my demands aren't met. I will set off the bomb and the city will be looking for a new mayor. You got until nightfall.<br>\r\n<br>\r\nWanda: The officials haven't responded yet but any heroes out there, we sure could use some help. Tomcat Avenger, Ice Fang anyone. Please save the Mayor. <br>\r\n<br>\r\nInside the Mayors office<br>\r\n<br>\r\nMad Panth: Why arn't they responding?<br>\r\n<br>\r\nHe holds up the detonator<br>\r\n<br>\r\nMad Panth: Don't they know I hold your life in my hands?<br>\r\n<br>\r\nA wolf morph in a business suit is tied up behand the desk with bomb on the desk in front of him and he looks nearly paniced.<br>\r\n<br>\r\nMayor: Mr. Panther, please be reasonable think of what your doing.  Don't do this.<br>\r\n<br>\r\nMad Panth: Oh I have thought about it and it's the only sane solution. The only way I get what I want.<br>\r\n<br>\r\nMayor: You know you won't get away with this.<br>\r\n<br>\r\nMad Panth looked steamed and runs to the mayor but a sound of a window shattering draws his attention where he sees.</span></div></div>",
            "created":1345611600,
            "id":1410726,
            "title":"Holding the Mayor hostage at City Hall"
        },
        "125121":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Mad Panth is too terrified to respond",
                "Mad Panth bites the hand that grabbed him."
            ],
            "content":"<div class=\"\"><div> <span>A huge grey scaled hand reached in and grabs Mad Panth.<br>\r\n<br>\r\nMad Panth: Ahhhh! What the hell's happening?!<br>\r\n<br>\r\n<br>\r\nMad Panth is soon carried out the window where he is soon see his captor, A Brachiosaurus 3 stories tall.<br>\r\n<br>\r\n\"You are a very mean cat.\" it said in a deep rumbling voice.<br>\r\n<br>\r\n</span></div></div>",
            "created":1345611600,
            "id":1410913,
            "title":"A Hero to the rescue"
        },
        "1251211":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "His former partner Dan",
                "The Police chief"
            ],
            "content":"<div class=\"\"><div> <span>Mad Panth is too scared to even respond but in the corner of his eye he can see another hero hopping into the window where in a few minutes he saw the bomb being tossed out and exploding in mid air safly. He heard the crowd cheer as the hero comes out of the window with the Mayor. The hero soon disapppeared.<br>\r\n<br>\r\nThe Massive dinosaur soon shrank down and Mad Panth is found himself handcuffed.<br>\r\n<br>\r\n\"Take him away boys.\" he said<br>\r\n<br>\r\nMad Panth is soon escorted to a waiting patrol car, in which he got shocked looks from his former officers.<br>\r\n<br>\r\nHe found himself back in his presinct, in a holding cell. He is not alone, outside the cell is..</span></div></div>",
            "created":1345611600,
            "id":1410957,
            "title":"Mad Panth is too terrified to respond"
        },
        "12512111":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "That night he is sent to prison",
                "The Next Day"
            ],
            "content":"<div class=\"\"><div> <span>Mad Panth looked up and saw his partner Dan.<br>\r\n<br>\r\nMad Panth: Hey Dan, long time no see, hows my favourite partner?<br>\r\n<br>\r\nDan: Thats former partner and I've been doing good, wish I could say the same for you, you really got yourself into a mess this time Panth.<br>\r\n<br>\r\nMad Panth: *sigh* Lapse of weakness, I haven't thought straight since they kicked me off the force.<br>\r\n<br>\r\nDan: You didn't think straight when you were on the force, thats why they made you leave.<br>\r\n<br>\r\nMad Panth notices that Dan is wearing a sargent's cap.<br>\r\n<br>\r\nMad Panth: They made you a sergeant, when did that happen?<br>\r\n<br>\r\nDan tries to avoid eye contact<br>\r\n<br>\r\nDan: The day you were removed.<br>\r\n<br>\r\nMad Panth stood up.<br>\r\n<br>\r\nMad Panth: But the day I was removed, I found out that it was the sergeant, that signed off on the papers to have me removed.<br>\r\n<br>\r\nDan: *sigh* I did for your own good Panth, I was worried something like what happened today, was going to happen.<br>\r\n<br>\r\nMad Panth appoached the bars reached out and grabbed Dan's tie.<br>\r\n<br>\r\nMad Panth:You screwed me over! we were friends! partners!<br>\r\n<br>\r\n Dan eventually got himself free from Mad Panth's grasp.<br>\r\n<br>\r\nDan: I'm sorry.<br>\r\n<br>\r\nDan leaves the area leaving Mad Panth with a look of vengance in his eyes.<br>\r\n<br>\r\nMad Panth: Oh, you will be sorry Dan, oh yes you will be sorry.</span></div></div>",
            "created":1345611600,
            "id":1411059,
            "title":"His former partner Dan"
        },
        "125121111":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "He eventually escapes",
                "He waits out his sentance"
            ],
            "content":"<div class=\"\"><div> <span>Two officers comes in, <br>\r\n<br>\r\nOfficer 1: Time for you to go, your being transferred to Grey Vault Prison.<br>\r\n<br>\r\nMad Panth is once again handcuffed and as he leaves the police cheif stops the two officers<br>\r\n<br>\r\nThe Chief: Panth, I always knew that temper of yours will get yourself in trouble, what you did earier is unforgivable. Take him away boys.<br>\r\n<br>\r\nMad Panth is escorted to a prison bus, he looks back as he sees his former partner see him off at the bus pulls away.<br>\r\n<br>\r\nThe bus soon arrives at Grey Vault Prison where he his met by the Prison warden, A lion morph <br>\r\n<br>\r\nWarden: Welcome to Grey Vault Prison Panth, or should I say Mad Panth. The Mayor already has passed sentance, 25 to life.<br>\r\n<br>\r\nTwo guards arrive<br>\r\n<br>\r\nWarden: Show him to his cell.<br>\r\n<br>\r\nThe prsion is full of inmades most of them are defeated villains like Nightmare and Mad Scientist Konran, he is shown to a prison cell which is next to The Hyena's as he is locked in his cell The Hyena went to the bars between his cell and Mad Panth's<br>\r\n<br>\r\nThe Hyena: Well well, if it isn't the Panth. Where's your partner Dan? You two are always good for a laugh.<br>\r\n<br>\r\nMad Panth grabs The Hyena by the shirt.<br>\r\n<br>\r\nMad Panth: Listen up Hyena! I'm sick of looking at you and as for Dan, he and I are partners no longer, ever sense he betrayed me!<br>\r\n<br>\r\nThey Hyena: Oooh, there's that Panth temper I know and love.<br>\r\n<br>\r\nMad Panth let go of the Hyena.<br>\r\n<br>\r\nMad Panth: Your not worth my time.<br>\r\n<br>\r\nMad Panth just sits on the cot.</span></div></div>",
            "created":1345698000,
            "id":1411083,
            "title":"That night he is sent to prison"
        },
        "1251211112":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "The Hyena makes an escape and offers Mad Panth to join him",
                "Remain in prison"
            ],
            "content":"<div class=\"\"><div> <span>Mad Panth remembers the time when he was still partners with Dan, of course when they first faced the Hyena. Dutch and Panth responded to a lunatic setting bombs throughout the city until we caught up to the insane bomber.<br>\r\n<br>\r\nThe Hyena: Well well, what do we have here? Two police officers. What are your names?<br>\r\n<br>\r\nDutch: Daniel 'Dutch' Sheppard. Officer. 832197424<br>\r\n<br>\r\nPanth: Samual 'Panth' Panther. Officer. 326218243<br>\r\n<br>\r\nThe Hyena: Name, Rank and Serial Number eh? Okey Dutch and Panth why don't we play a game?<br>\r\n<br>\r\nPanth: We don't have time for your games, we're here to bring you in.<br>\r\n<br>\r\nThe Hyena: Oh, but you'll love this game. I planted bombs throughout the city and you have a short amount of time to find the bombs and disarm them, I will provide the clues. And the first clue is 'It's a main ingrediant in a dishonist shortcake.' You have 10 minutes. Go.<br>\r\n<br>\r\nBoth Panth and Dutch made it to the library with 2 minutes to spare but as they progressed the clues got harder and it it's starting to mess with Panth's mind. It's like the Hyena was taunting them, laughing at their efferts almost he wanted them to fail but in the end they beat the Hyena's challenge but at what cost?<br>\r\n<br>\r\nBack to the present</span></div></div>",
            "created":1345698000,
            "id":1411717,
            "title":"Rememberance of the past"
        },
        "12512111121":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "An Isolated beach overlooking the prison",
                "In the Subway line"
            ],
            "content":"<div class=\"\"><div> <span>Panth came to with a series of explosions.<br>\r\n<br>\r\nHyena: Did you plan this Panth?<br>\r\n<br>\r\nPanth was a little dumbfounded, because when he was arrested he was stripped from his arsonal of bombs so he shook his head.<br>\r\n<br>\r\nPanth: \"No, I didn't plan this.\"<br>\r\n<br>\r\nHyena: \"Then who did.\"<br>\r\n<br>\r\n\"I did\" said a young voice, both Hyena and Panth look around and sees 2 timber wolf anthros, one wearing an imtimidating mask and the other just a child but it was the child that did the talking.<br>\r\n<br>\r\nPanth: \"A child is breaking us out? But why?\" <br>\r\n<br>\r\nChild: \"My name's Cub Alpha and I'm more then just a child.\"<br>\r\n<br>\r\nHyena: \"Cub Alpha? I remember you, you're Wrex's arch-rival in the gang wars.\"<br>\r\n<br>\r\nCub: \"Yes, and I'm making a comeback starting with my brother Jack. You two make excellent additions, the escapse is through there.\" <br>\r\n<br>\r\nCub points to the door to the laundry room \"Nightmare and Konran are already outside waiting, why don't you join them Hyena. As for you Panth, I need you to help me set a trap. No dount a hero is on the way to ivestiage the explosions I like for you to seal his fate. There's a bomb that needs to be set, it is rigged to tick down and explode when a door is open all you need to do is set the timer.\"  Cub and Jack goes throught he door, Panth sees the bomb next to it and looks at it. He says to himself as he sets the timer \"10 seconds will do, not enough time to escape.\" Soon Panth went into the laundry room and escape through the tunnel and ends up at</span></div></div>",
            "created":1348722000,
            "id":1436094,
            "title":"Jailbreak"
        },
        "1252":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Sorrow is wandering downtown",
                "Sorrow spots a wife beater",
                "She is somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Name: Sorrow<br>\r\n<br>\r\nSpecies: Unicorn<br>\r\n<br>\r\nPowers: Has powers over darkness, can turn into a shadow at will<br>\r\n<br>\r\nPersonality: Primrose Xavier was happy housewife, with a happy family, her husband was wealthy, her children were getting a good education, she had it all. Then tragedy struck, her younger child, her six year old daughter Heather caught a mysterious illness and died. Her older child, her sixteen year old son Alabaster dropped out of school and became and gangster, that's when Primrose's powers awakened<br>\r\nPrimrose is unique among villains as she doesn't want to bring suffering and mayhem, she just wanders the world, searching for her  son Alabaster, the problem occurs when she sees someone she thinks needs to be punished, like a wife beater, her form of punishment is rather...extreme. She uses her shadows to send a person to a realm of eternal darkness, so while her motives are sympathetic, she  clearly is a dangerous individual.<br>\r\n<br>\r\nAppearance: Sorrow wears a black gown, still mourning her daughter, she is unusual among unicorns as her has black fur with a white mane and deep purple eyes  </span></div></div>",
            "created":1345611600,
            "id":1410706,
            "title":"Sorrow"
        },
        "1253":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Wrex",
                "Flora",
                "More villains still"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still more eh? How about these?</span></div></span></div>",
            "created":1345784400,
            "id":1412363,
            "title":"Still More Villains"
        },
        "12531":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Plotting a crime",
                "Overseeing a weapons test"
            ],
            "content":"<div class=\"\"><div> <span>Name: Wrex<br>\r\n<br>\r\nSpecies: Komodo Dragon<br>\r\n<br>\r\nPowers: Criminal Mastermind.<br>\r\n<br>\r\nPersonality: Wrex isn't your ordinary villain who has a few or no henchmen, he has many henchmen including named generals for his crime network and his two bodyguards. But he's is publicly known as a C.E.O. for Wrex Industries, best known for security and police weaponry. But any criminal activity he has is kept secret to the public and he makes sure any evidence is distroyed.<br>\r\n<br>\r\nAppearance: Wrex usually wears a suit, usually a white dress shirt with a red neck tie, black jacket and matching trousers. He carries a cane with a W on the handle(Wrex Industries insignia).<br>\r\n<br>\r\n<br>\r\nWhat is he doing?</span></div></div>",
            "created":1345784400,
            "id":1412388,
            "title":"Wrex"
        },
        "125311":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Wrex overhears a hero intervening",
                "The Heist goes smoothly."
            ],
            "content":"<div class=\"\"><div> <span>Wrex is sitting at his desk with his two bodyguards, Sampson and Golliath standing by the door.<br>\r\n<br>\r\nWrex: Monitor, are you in place?<br>\r\n<br>\r\nOn the intercom: This is Monitor, yes, I'm in place along with my men. Are you sure this is a good idea to rob the 1st. National Bank after that Mad Panth incident?<br>\r\n<br>\r\nWrex: Yes, they won't expect an attack like this. That's why we planned this. Remember, if you get caught. Don't leave any clues that  I masterminded this.<br>\r\n<br>\r\nMonitor: Yes boss.<br>\r\n<br>\r\nOn the intercom, a sound of a door being forced open followed by gunfire.<br>\r\n<br>\r\nMonitor: THIS IS A STICK UP! EVERYONE PUT YOUR HANDS UP!<br>\r\n<br>\r\nMutiple sounds of screaming is heard on the intercom.<br>\r\n<br>\r\nWrex smiles wickedly on what he's hearing.<br>\r\n<br>\r\nMonitor: OKAY LADY, GIVE US ALL THE MONEY AND KEEP YOUR FINGER OFF THE SILENT ALARM!</span></div></div>",
            "created":1345784400,
            "id":1412404,
            "title":"Plotting a crime"
        },
        "1253111":{
            "author_id":"quetzalcoatl",
            "author_name":"jdstephens",
            "choices":[
                "Shortly later, at the SSF HQ.",
                "Something else(He decides to contract some famous criminals to nullify the heros"
            ],
            "content":"<div class=\"\"><div> <span>Monitor: \"Move it, boys! We don't want the SSF to catch us! Get those bags in the truck and-hay! I said <i>down</i>!\" His final pronouncement was punctuated by the sound of a shoe hitting flesh rather hard, followed by distant groaning.  <br>\r\n<br>\r\nThug:\"Hey, Boss, there's some mind of vault back here. Looks like it could hold a lot of loot, but it'll take a few minutes to break into.\"<br>\r\n<br>\r\nThe Monitor considered for a moment, chewing his lip lightly.<br>\r\n<br>\r\nMonitor:\"...No. It'll take to long. Let's get back to the truck on the double. \"<br>\r\n<br>\r\nThe large group of criminals began scrambling back for the relative security of their vehicle, dragging bulging bags of cold, almost untraceable cash behind them. <br>\r\n<br>\r\nOther anonymous thug: \"Okay. I'll just grab this last bag and-Oof!\" The hefty gorrila criminal collapsed to the ground, and the Monitor took a cautious step back. <br>\r\n<br>\r\nMonitor:\"Mike?\" <br>\r\n<br>\r\nOne hoof out the door, the leading crook was similiarily dropped. A golden blur was visible next to him for the lesser part of a second. Guns went up anxiously, and the bulk of the scofflaws bunched together nervously. <br>\r\n<br>\r\nWith a blood-freezing roar the door was blown in, the shrapnel followed by the two men who had been waiting inside the gettaway car. A female wolf in ornate silver armor, holding a lance, and astride a white timber wolf the size of a rhino, charged into the room, knocking over the group of thugs with uncanny semblance to a bowling ball. <br>\r\n<br>\r\nMonitor: \"Monitor to Mind! Monitor to Mind! We've been attacked! It's the Society of  Super-Furs!\"<br>\r\n<br>\r\nAnother villian was felled as they tried to crawl away, but this time a cheetah wearing a bright yellow costume stopped long enough to be visible as he palnted a paw on the robber's lower back. <br>\r\n<br>\r\nLightning Strike:\"I'd stay down if I was you, pal.\"  <br>\r\n<br>\r\nThe monitor backed away, looking frantically for a way out. Something big, metallic, and impossibly strong grabbed onto him from behind, easily holding him in a bear-hug with two arms. A robotic voice spoke from over his shoulder, directed at his fairly cheap, easily disposable cell-phone.<br>\r\n<br>\r\nAquatron: \"Admittedly, I will only become aware of your indentity in approximately 4.52 seconds, but rest assured that your henchbeing will soon find a lovely new prison cell to call his own, and you will be reunited shortly.\"<br>\r\n<br>\r\nSeveral glistening wires extended from the wrist of the mechanoid's upper right arm and buried themselvs in the Monitor's intercom. <br>\r\n<br>\r\nWrex realized what the hero was posibly trying to do, and calmly he killed the connection before his location could be traced. The last he heard from the scene of the crime was the groans of several wounded henchmen and the protests of others as they were rounded up.   <br>\r\n   </span></div></div>",
            "created":1352091600,
            "id":1461529,
            "title":"The S of S-F intervene!"
        },
        "1253112":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A hero investigates",
                "An eco-villain attacks"
            ],
            "content":"<div class=\"\"><div> <span>Wrex: Good, this heist is going better then I thought.<br>\r\n<br>\r\nSuddenly, a tremor is felt in the building and things get a bit shakey.<br>\r\n<br>\r\nWrex: WHAT THE BLAZES IS GOING ON?! AN EARTHQUAKE?!<br>\r\n<br>\r\nSampson and Goliath hears something in their headsets.<br>\r\n<br>\r\nSampson: Boss, we need to get you out.<br>\r\n<br>\r\nGoliath: The building is unstable, there's some kind of plant growth effecting the building's structure. If we don't get you out of here. The whole bulding with collapse around us.<br>\r\n<br>\r\nHis two bodyguards escort Wrex to his private staircase and ended up outside as paniced workers ran out of the front door.<br>\r\n<br>\r\nWrex: Who is responsible for this?<br>\r\n<br>\r\nScientist: We don't know, we are investiaging the possibilities but we got a sample, he holds up a weed.<br>\r\n<br>\r\nWrex: A weed? We've been attcked by a weed?<br>\r\n<br>\r\nScientist: Not just any weed, this one is been geneticly engineered, the tensil strength is amazing.<br>\r\n<br>\r\nJust then someone came</span></div></div>",
            "created":1345870800,
            "id":1412840,
            "title":"A shakey situation"
        },
        "12531122":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "A hero appears",
                "A furious fight starts, starting with Wrex's bodyguards "
            ],
            "content":"<div class=\"\"><div> <span>As Wrex examines the weed, he can only guess this is bio-engineered somehow but who, but as he looks around he  hears a voice<br>\r\n<br>\r\nFamiliar voice: Hello Wrex, Looking for me?<br>\r\n<br>\r\nWrex looks up and sees a giant venus flytrap but in it's mouth, is a panda he recognizes.<br>\r\n<br>\r\nWrex: Oh God...it's you.<br>\r\n<br>\r\nDr. LI: Yes! It's me! Jia Li! The bio-scientist you fired for being too ethical! Well who's laughing now?!<br>\r\n<br>\r\nThe plant lets out a terrible roar and then<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1345870800,
            "id":1413138,
            "title":"An eco-villain attacks"
        },
        "125311221":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Wrex is escorted to safty by his bodyguards.",
                "Wrex joins in the fight"
            ],
            "content":"<div class=\"\"><div> <span>Just then several darts were shot into the root of the plant, causing it to roar with pain and fall to the side.<br>\r\n<br>\r\nWrex looks up and sees that it's the Tomcat Avenger, normally he's been a thorn on Wrex's side for stopping most of his planned crimes but he sure glad to see him.<br>\r\n<br>\r\nDr. Li  fell out of the plants mouth, when she noticed her plant was in pain she stroked it tenderly and tried to remove the darts from the roots.<br>\r\n<br>\r\nDr. Li: Who did this?!<br>\r\n<br>\r\nTomcat Avenger: It was me.</span></div></div>",
            "created":1345870800,
            "id":1413379,
            "title":"A hero appears"
        },
        "12532":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Growing a new kind of super weed",
                "Plotting revenge against the lumber industry"
            ],
            "content":"<div class=\"\"><div> <span>Name: Flora<br>\r\n<br>\r\nSpecies: Giant Panda<br>\r\n<br>\r\nPowers: Ability to control plants.<br>\r\n<br>\r\nPersonality: Jia Li Wong was an immigrant from the Far East, she was tricked by a mad scientist into being one of his experiments, now calling herself Flora she is an Eco-Terrorist who seeks revenge on those who would harm the Earth<br>\r\n<br>\r\nAppearance: Due the the experiments performed on her, Flora has bright green eyes and green head fur, she wears a bathing suit made out of leaves as her costume.<br>\r\n<br>\r\nWhat is she doing now?</span></div></div>",
            "created":1345784400,
            "id":1412374,
            "title":"Flora"
        },
        "125321":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Wrex ",
                "A Nuclear Power Pant"
            ],
            "content":"<div class=\"\"><div> <span>Flora was in her greenhouse putting the new touches on a bio-engineered weed.<br>\r\n<br>\r\n\"Of course!\" She cackled \"This will be the perfect thing to get rid of the WEED of civilization.\"<br>\r\n<br>\r\nDue to the fact that she was an Eco-terrorist  and cared little about anything other then saving the environment, Flora did not care about her fellow villains as she considered them selfish idiots while she genuinely cared about nature, tonight she was planning on attacking </span></div></div>",
            "created":1345784400,
            "id":1412712,
            "title":"Growing a new kind of super weed"
        },
        "1253211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A hero stops her",
                "Wrex stops her"
            ],
            "content":"<div class=\"\"><div> <span>As suicidal as it seemed she was going after the criminal mastermind Wrex as she heard a rumor he had been dumping toxic waste in the forest.<br>\r\n<br>\r\nWith her cloak of genetically engineered flower  petals that would render her invisible, she made her way to Wrex's lair<br>\r\n<br>\r\nThere she planted the weed seeds that would eat the building</span></div></div>",
            "created":1345784400,
            "id":1412716,
            "title":"Wrex "
        },
        "12532112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A Hero appears",
                "There is a furious fight"
            ],
            "content":"<div class=\"\"><div> <span>She saw that Wrex and his workers got out of the building safely, she growled<br>\r\n<br>\r\n\"I guess we'll just have to go toe to toe.\" She said<br>\r\n<br>\r\nShe got out her trusty steed, an enormous mutant Venus Flytrap that could walk using its roots for legs, she climbed into the 'mouth' of the flytrap took the bridle and went to face Wrex<br>\r\n<br>\r\n\"Hello Wrex?\" She purred \"Looking for me?\"<br>\r\n<br>\r\n\"Oh God...\" Wrex said \"It's you!\"<br>\r\n<br>\r\n\"Yes!\" Flora said \"It's me! Jia Li! The bio-scientist you fired for being too ethical! Well who's laughing now?!\"<br>\r\n<br>\r\nThe Plant let out a terrible roar.<br>\r\n<br>\r\nJust then<br>\r\n<br>\r\n</span></div></div>",
            "created":1345870800,
            "id":1412855,
            "title":"Are you asking for a challenge?"
        },
        "125321121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Fight between Flora and the Avenger",
                "Wrex adds himself to the mix"
            ],
            "content":"<div class=\"\"><div> <span>Just then several darts were shot into the root of the plant, causing it to roar with pain and fall to the side.<br>\r\n<br>\r\nFlora fell out of the plants mouth, when she noticed her plant was in pain she stroked it tenderly and tried to remove the darts from the roots.<br>\r\n<br>\r\n\"Who did this?!\" She growled<br>\r\n<br>\r\n\"It was me.\" Said the Tomcat Avenger</span></div></div>",
            "created":1345870800,
            "id":1413170,
            "title":"Tomcat Avenger"
        },
        "12533":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "The doggy doughgirl",
                "Next supervillain in line please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok you still want more eh? alright how about these supervillains?</span></div></span></div>",
            "created":1345870800,
            "id":1413384,
            "title":"More villains still"
        },
        "125331":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Terrorizing new wolf city.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Name: the doggy doughgirl <br>\r\n<br>\r\nSpecies: Poodle <br>\r\n<br>\r\nPowers: Dough blaster and her appetite<br>\r\n<br>\r\nPersonality: A baker accidentally turned into a giant rampaging monster, She was always one to experiment with certain cakes and other goodies, until one fateful day she used too much yeast and transformed into a giant dough monster with a massive appetite for food and destruction, she became the doggy doughgirl.<br>\r\n<br>\r\nDescription: She doesn't wear anything at all, because she's a dough monster and appears to be like the stay puft marshmallow man.<br>\r\n<br>\r\nWhat's the dreaded doggy doughgirl doing at this very moment?</span></div></div>",
            "created":1347771600,
            "id":1429184,
            "title":"The doggy doughgirl"
        },
        "125332":{
            "choices":[
                "Yes",
                "Next Villain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about this supervillain? Bad Omen?</span></div></span></div>",
            "created":1355115600,
            "id":1485706,
            "title":"Next supervillain in line please."
        },
        "1253321":{
            "choices":[
                "Still trapped in the book waiting to be freed",
                "Out and about attempting to conjure up a demon"
            ],
            "content":"<div class=\"\"><div> <span>Name: Bad Omen<br>\r\n<br>\r\nSpecies: Owl<br>\r\n<br>\r\nPowers: Black Magic, Can Control monstrous from the underworld<br>\r\n<br>\r\nPersonality: Have you heard of the boogeyman? Well, he was actually conjured up by an ancient wizard to be one of his many demonic minions. But the boogeyman is nothing compared to his master who was sealed within the infamous, black book of spells. Let's hope nobody ever releases the Bad Omen, or he will plunge the world into chaos, just for the sake of it.<br>\r\n<br>\r\nDescription: Bad Omen is an owl magician in a black colored cloak with a talon like symbol on the hood. He also wears a mask like the phantom of the opera. He is abnormally skinny and has glowing green eyes. He always speaks in rhyme.<br>\r\n<br>\r\nWhere is Bad Omen?</span></div></div>",
            "created":1355115600,
            "id":1485712,
            "title":"Yes"
        },
        "1253322":{
            "author_id":"dragonstomper",
            "author_name":"Life in HD",
            "choices":[
                "Yes...",
                "No..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Daemon? He sound good?</span></div></span></div>",
            "created":1357794000,
            "id":1505839,
            "title":"Another villain..."
        },
        "12533221":{
            "author_id":"dragonstomper",
            "author_name":"Life in HD",
            "choices":[
                "Getting ready to steal from a museum...",
                "Employing himself out to a crime lord..."
            ],
            "content":"<div class=\"\"><div> <span>Name: Daemon<br>\r\n<br>\r\nSpecies: Hell-hound (Imaging a wolf with horns)<br>\r\n<br>\r\nPowers: Chaos magic, sword fighting skill using a massive two handed sword, sheer strength and willpower.<br>\r\n<br>\r\nPersonality: Born many hundreds of years ago, Daemon is an old and powerful being. One of the last few Chaos Hell-hounds still alive, Daemon spent many of his younger years in the guidance of some of the most powerful Demons in the underworld. Often bullied by those who are more powerful, it left him with a craving for power. This hunger is his main motivation for anything he does. This makes him untrustworthy and at times even unstable. He would easily cast aside an ally if he no longer needed them in order to get more powerful items or artefacts. Despite all these faults, he is not heartless, no one living as long as he has can be. He often ignores civilians during a heist or job, only hurting those who stand in his way. He is also prefers quick and painless with his killings to long and painful. And to be honest, he's lonely. He hasn't even had a decent conversation in about 1600 years, so he doesn’t kill all that often. But most importantly, he's smart. You never find him breaking anything on the evil overlord list, and he always thinks through his plans, weighing up the best solution for him and occasionally others.<br>\r\nFor combat purposes he uses his own custom sword ‘Fatesplitter’, a massive two-handed sword with a 6 foot long blade and 5 foot long hilt. He will also use chaos magic (not the traditional kind) for defence and offence. On a side not, Daemon hates Clichés with a passion, and if anyone uses on in his vicinity he is likely going to give them a good smack on the head.<br>\r\n<br>\r\nDescription: Daemon is very tall, about 7 feet 8, easily towering over others. He is also very muscular. Other things about him include his clawed hands and horns in the side of his head pointing forward. In terms of clothing, he does not normally wear a shirt, going bare chested, and keeps on purple armoured leggings for his lower body, and purple armoured shoulder pads. His fur is a blood red and out of his back are two blackened wings that allow flight when he summons them using magic. As for his head he looks like a wolf with large horns in the side of his head. He also wears a wooden mask that hides his face with glass eye holes and demonic markings. When needing a disguise, he can make himself look like a wolf man with coal fur and yellow eyes.<br>\r\n<br>\r\nSo what's he doing right now?</span></div></div>",
            "created":1357794000,
            "id":1505847,
            "title":"Daemon..."
        },
        "12533222":{
            "author_id":"segatasaturn",
            "author_name":"SharknifeXL",
            "choices":[
                "Heckz yes!",
                "No, I don't want that"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dr. Monkey-Swap?</span></div></span></div>",
            "created":1373864400,
            "id":1628735,
            "title":"How about..."
        },
        "125332221":{
            "author_id":"segatasaturn",
            "author_name":"SharknifeXL",
            "choices":[
                "In his lab with a couple of superhero hostages",
                "Hiding in a supervillain hideout ready to swap everyone"
            ],
            "content":"<div class=\"\"><div> <span>Name: Dr. Monkey-Swap.<br>\r\n<br>\r\nSpecies: Spider-Monkey (Duh)<br>\r\n<br>\r\nPowers: Has a mind-swap machine that he uses to swap the minds of two people. He also has the ability to swap minds with any anthro using a psychic ability. He can only maintain the swap for three hours. He also has a laser gun that tricks two people into thinking they've swapped bodies.<br>\r\n<br>\r\nPersonality: Dr. Monkey-Swap is an evil insane simian who believes anthros shouldn't get used to their current forms, because they deserve new ones every weak! His personality is highly volatile, and he mind-swaps anyone, ally or enemy. He has a fixation with giant robot shows, and has been known to shout out the names of his attack from time to time. He is very eccentric and believes people should beg him not to swap them. Although, he would do it anyway.<br>\r\n<br>\r\nDescription: A merciless monkey who loves mind migration. He believes everyone deserves a second chance... Or form... Or stature. He swaps because he loves it, simple as that. No allies, only enemies and targets. He sees you, he swaps you without mercy.<br>\r\n<br>\r\nSanity: Not included.<br>\r\n<br>\r\nYou: Now a human mind inside a dog's body. Enjoy, Fido!<br>\r\n<br>\r\nWhere is Dr. Monkey-Swap?</span></div></div>",
            "created":1373950800,
            "id":1628739,
            "title":"Heckz yes!"
        },
        "1253322211":{
            "author_id":"segatasaturn",
            "author_name":"SharknifeXL",
            "choices":[
                "The two fools get swapped! This is going to put a damper on their \"friendship\"!",
                "I get caught in a mishap and join in on the fun! Oh how I love a plot twist!"
            ],
            "content":"<div class=\"\"><div> <span>          I was ready to begin the ultimate experiment. Operation: Everyone gets a body transplant... I really need to work on my evil plan names. My name is Dr. Monkey-Swap and I am madness incarnate! I had recently captured two superheroes to use as bait and as experiments. I pulled on my lab-coat the only piece of clothing I wear, besides the biter mask I still wear from my asylum escape! As a reminder, that I bite people! Also, I don't button my lab-coat, I have no need for buttons, I tore them all off! Geez, stop asking! Anyway, I stepped briskly into my lab to meet my captors, Sweet Charity and Ice Fang. \"You'll never get away with this you... Guy!\" He said while struggling helpless in his steel fashioned chair. Charity was in a similar predicament, fastened to a chair, albeit with a small twist. She was wearing a biter mask, one I developed that is completely sound-proof and venom-proof.<br>\r\n<br>\r\n          She muttered incoherently as I turned to respond to Ice-Brain. \"Well, Frosty the snow-wolf, you'll see that I have gotten away with it. Also my name is Dr. Monkey-Swap.\" I said proudly, I couldn't afford to let the riff-raff know I have identity issues. It happens when you have the power to mind-swap with any fool who happens to cross your path. \"Let me out of here, you villain wannabe! I'll end you! And my name is Ice-Fang!\" He said trying to sound threatening in his steel shackles. \"Say... Frost-Woof, do you like Sweet Charity?\" I ask, while grinning like the cheeky little monkey I was. \"I like her as a friend and ally! What are you implying?\" He responded, trying to sound like the wolf he pretended to be. However, I knew that he was a little girly sheep in wolf's clothing.<br>\r\n<br>\r\n          \"Say, what would you do if you were Sweet Charity? Say, if you had her body?\" I ask in a deviously creepy voice. \"While I would... Uh... Condone from doing anything she wouldn't do! Yeah!\" He stated in a somewhat half-hearted manner. He would totally grope himself if he was her. I think I'll give him the chance. I walk over to a machine and press a button. Two silver helmets fall quickly from the ceiling stopping right above both of their heads. It was so fast, they didn't even get the time to see it coming! Ice-Frappe Bark-Wolf the fifteenth was freaking out, especially because he had no idea what was about to happen. The silver helmet on top of his head made his girly barks reverberate. It annoyed me, so I cut the drama short and pull the level swapping them. What happens next?</span></div></div>",
            "created":1373950800,
            "id":1629209,
            "title":"In his lab with a couple of superhero hostages"
        },
        "125332222":{
            "author_id":"tomboydragon15",
            "author_name":"tomboydragon15",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How's about Chimera, a fused up Villian</span></div></span></div>",
            "created":1391922000,
            "id":1742500,
            "title":"3-in-1"
        },
        "1253322222":{
            "author_id":"snakeboy89",
            "author_name":"Michael Bianchi",
            "choices":[
                "Yes.",
                "Next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Death Strike, terror of the dark.</span></div></span></div>",
            "created":1422075600,
            "id":1922710,
            "title":"Nope"
        },
        "12533222221":{
            "author_id":"snakeboy89",
            "author_name":"Michael Bianchi",
            "choices":[
                "Story Start",
                "Never mind."
            ],
            "content":"<div class=\"\"><div> <span>Name: Death Strike<br>\r\n<br>\r\nSpecies: Hybrid King Cobra/Green Anaconda<br>\r\n<br>\r\nPowers: Hypnosis and ability to control other snakes.<br>\r\n<br>\r\nAge: 21<br>\r\n<br>\r\nLength: In excess of 100 feet<br>\r\n<br>\r\nClothing: Death Strike has a spike color around her neck and around her arms.<br>\r\n<br>\r\nWeapons: Fangs, coils and claws.<br>\r\n<br>\r\nBio: Lady Nightfang was a wealthy female snake that had it all but she had someone watching her who was jealous and one night, the culprit pushed her into a vat of chemicals and it changed her behavior drastically. Now, she walks a fine line between being a hero and a villain as she searches for whoever did her in.</span></div></div>",
            "created":1422075600,
            "id":1922717,
            "title":"Yes."
        },
        "12533222222":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "She fights her brother",
                "She gasses out a bank, and robs it"
            ],
            "content":"<div class=\"\"><div> <span>Skunkette the gassiest villainess around.<br>\r\nAge: 27<br>\r\nGoal: Make her adoptive brother Vixen aka Red Blitz, her fart slave, and take over the city. <br>\r\n<br>\r\nWears: White skin tight short shorts that barely contain her ass, and a White tank top.<br>\r\nFavorite food: Tacos<br>\r\n</span></div></div>",
            "created":1465880400,
            "id":2164358,
            "title":"Next."
        },
        "125332222221":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "She fights one on one",
                "She has set some traps"
            ],
            "content":"<div class=\"\"><div> <span>On the top of a building a figure was scanning the city looking to stop any that want to disturb the peace. He was the Red Blitz the fastest superhero around and as he is about to call it a night he sees Skunkett entering a warehouse with some stolen goods. Taking the pre-emptive approach he quickly rushed down the building and into the warehouse. \"Ok Skunkette make this easy on yourself come along quietly\" he said.</span></div></div>",
            "created":1466053200,
            "id":2165486,
            "title":"She fights her brother"
        },
        "1253322222211":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Fart in his face",
                "Tease him"
            ],
            "content":"<div class=\"\"><div> <span>Skunkette smirked at her brother, giving him an uneasy feeling. She only got that smirk when she had the upper hand; what could she have been planning?<br>\r\n<br>\r\nRed Blitz was quite naive if you asked Skunkette, believing he had the last say in their encounters. Well, he was about to get a real doozy of a reality check. She wordlessly turned around, raised her tail, and pointed her butt at Red Blitz. By the time he caught on, the damage was done.<br>\r\n<br>\r\nPPPPPPHHHHHBBBBTTTTTT!!!!!<br>\r\n<br>\r\nSkunkette blasted a fart at him that easily brought him to his knees, with watery eyes, and his hands covering his nose and mouth. As he retched at his sisters gas, she walked up to him and put her butt in his face.<br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1466053200,
            "id":2165498,
            "title":"She fights one on one"
        },
        "12533222222112":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Torture him some more",
                "Put a mock one sided battle for her henchmen/onesided atch against her henchman"
            ],
            "content":"<div class=\"\"><div> <span>Red Blitz looked up after getting hit by his sisters gas only to have her but on his face.<br>\r\n<br>\r\nSkunkett giggled \"Oh brother look at you some hero taken down by once shot so pathetic\" she said rubbing her butt on his face as she teased him. \"Oh what should I do to you now so many choices\" she mused as he gaged on the leftover fumes from her fart.  </span></div></div>",
            "created":1466053200,
            "id":2165505,
            "title":"Tease him"
        },
        "125332222221121":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Answer her",
                "Try to get away"
            ],
            "content":"<div class=\"\"><div> <span>Skunkette used her tail to push Red Blitz face further into her ass, while she rubbed it against his face. He gagged, and retched from the stench, trying to get away, but his sister's tail and butt were too strong. It wasn't long before he heard her grunting.<br>\r\n<br>\r\nPPPPPPHHHHHRRRRRRBBBBTTTTTT!!!!<br>\r\n<br>\r\nAnother fart, longer and smellier than the last was blasted into his face. Skunkette was laughing, and in turn letting loose smaller and smellier farts in the process.<br>\r\n<br>\r\n\"Oh come now bro,\" grunt and fart \"don't you like being,\" grunt and fart \"up my ass, sniffing my gas?\"</span></div></div>",
            "created":1466053200,
            "id":2165516,
            "title":"Torture him some more"
        },
        "1253322222211212":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "More sniffing or something else",
                "FIght and beat him again making sure he remembers who is the strongest"
            ],
            "content":"<div class=\"\"><div> <span>Red Blitz  struggled at her sisters words but like the last time he fails to escape from the grip of his sisters tail and ass.<br>\r\n<br>\r\nHe was forced to gag and sniff his sisters farts getting weaker and weaker as his sister laughed.<br>\r\n<br>\r\nSkunkette was enjoying the torture of her brother. \"You really are sad now sniff like a good fart sniffer\" she taunted.</span></div></div>",
            "created":1466139600,
            "id":2165519,
            "title":"Try to get away"
        },
        "12533222222112122":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Give in",
                "Refuse!"
            ],
            "content":"<div class=\"\"><div> <span>Red Blitz let out a protest that was muffled my Skunkette's ass, broug by  his hands to her butt cheeks and began pushing. Skunkette's tail was proving to not be as string as it's owner would like, as his heas was beginning to leave her ass.<br>\r\n<br>\r\nNot one to panic, she put her hands on her shorts waistband,and after his face was a safe inch from her butt she spoke again <br>\r\n<br>\r\nShe doesn't want to hurt him brutally or badly, just fart on him and dominate him. Any type of burning hurt after all.<br>\r\n<br>\r\n\"My, my, if you wanted to be in my bare ass you should've just asked bro\" She quickly pulled down her shorts, revealing her big bubble butt in all of it's smelly glory, all the while ignoring Red Blitz disgusted groans. Blitz hands had stayed where they were, meaning that he was spreading her ass cheeks, revealing her butt crack and the source of his torture.<br>\r\n<br>\r\nSkunkette put her hands on Blitz, keeping them in place, and making them spread her cheeks even more. <br>\r\n<br>\r\n\"I knew you wanted my butt bro, but not THIS badly,\" she teased her brother, giggling at his current predicament, and used her tail to push him into her ass crack. Because his hands were now useless, and being used against him, Blitz was left to use his neck to try and push against the tail, and like last time he failed.<br>\r\n<br>\r\nRed Blitz face was buried into his sisters ass crack, as he and her ass were now \"cheek to cheek\" he dreaded what was to come.<br>\r\n<br>\r\n\"Now bro, I got some more farts for you to smell, here's what we're going to do: if you willingly sniff and become my fart slave for life, I'll let you out of my ass. But if you don't, then I'll get Sabrina in here; or as you know her ass: Stink Bug.</span></div></div>",
            "created":1466139600,
            "id":2165656,
            "title":"FIght and beat him again making sure he remembe..."
        },
        "125332222221121222":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Enter the Stink Bug"
            ],
            "content":"<div class=\"\"><div> <span>Blitz's voice was muffled as his face was forced to remain in her sisters bare ass so any comebacks would not be heard. He felt his nose burn as the stink assaulted his entire face.<br>\r\n<br>\r\nWhen he heard her make her demand and the ultimatum should he refuse he knew of her but he was to full of himself so he manage to get out a few words. \"I will not give in\" he said as he was forced back into her ass.<br>\r\n<br>\r\nAt those words Skunkette let out a evil laugh followed by a fart that sailed up her brothers nose. \"Oh I was hoping for you to say that now after a few rounts with Stink Bug you will be begging to become my fart slave for life\" she said.</span></div></div>",
            "created":1466139600,
            "id":2165732,
            "title":"Refuse!"
        },
        "1253322222211212221":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Stink Bug gets some alone time with Red Blitz while Skunkette eats a taco.",
                "Red Blitz gets tied up so he can't escape their gassy vengence."
            ],
            "content":"<div class=\"\"><div> <span>Despite her super villain name, Stink Bug was NOT an anthropomorphic stink bug, she was a cream colored cat with a HUGE ass, wearing a green leotard that had a buttoned fold over her asshole. She was Skunkette's best friend, and unlike her, she did more than just fart. She hardly ever bathed, granting her atrocious BO that only Skunkette and herself could breath in like oxygen. She won 13 consecutive burping contest in a row, granting her the title of Burp Queen, her foot stink was horrid, and she could fart just as bad as Skunkette. The only non-gross thing about her was her breath and mouth, which she regularly kept minty fresh, and clean by brushing and Listerine.<br>\r\n<br>\r\nOf course, she was in the same warehouse as her best friend as part of their plan to trap Red Blitz.<br>\r\n<br>\r\n\"You can come out now Stinky.\" As soon as she heard her nickname, she came out from behind some nearby crates and walked over to Skunkette and her butt-bound brother, letting out a nonchalant burp as a greeting. Something Skunkette was used to.<br>\r\n<br>\r\n\"What's up skunky?\"<br>\r\n<br>\r\n\"Oh nothing, just letting loose the nightly gas,\" she paused to let out a fart, \"my bro wanted to be with my bare ass so much that he spread my cheeks himself.\"<br>\r\n<br>\r\n\"Nice,\" Stink Bug bent down and patted Blitz head, shoving him further into Skunkette's ass, \"your sis told me all about you, and what you did to her; consider what I'm going to do to you as payback on MY behalf \"hero\".\"</span></div></div>",
            "created":1466139600,
            "id":2165761,
            "title":"Enter the Stink Bug"
        },
        "12533222222112122211":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Lights Camra Action",
                "Just the two of you"
            ],
            "content":"<div class=\"\"><div> <span>Blitz groans as he hears Stink Bugs voice and is mortified at his sisters words as he gaged on another fart. It got worse when his face was pushed further in from Stink Bug patting his head.<br>\r\n<br>\r\nStink Bug looked at her friend \"my dear you must be exhausted why don't you go eat a few tacos and let me have some fun with the so called \"hero\" she said with a grin.<br>\r\n<br>\r\nSkunkette smiles and removes her brother from her ass and shoves him into Stink Bug who quickly pined him. \"that's a good idea thanks\" she said as she covered up her bare ass and walked into the kitchen.<br>\r\n<br>\r\nBlitz groaned and weakly struggled as he heard Stink Bug speak.<br>\r\n<br>\r\nStink Bug looked at the poor skunk in her arms \"You know I been looking forward to this now how should I get vengeance should I make you suffer and humiliate you on camera for all the villains to see or  do it by myself\" she mused.</span></div></div>",
            "created":1466139600,
            "id":2165772,
            "title":"Stink Bug gets some alone time with Red Blitz w..."
        },
        "125332222221121222112":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Burping frenzy to the face",
                "More farts"
            ],
            "content":"<div class=\"\"><div> <span>Stink Bug brought her face closer to Red Blitz and burped. As he groaned in disgust and tried to move his head away from the stink, Stink Bug got a good laugh.<br>\r\n<br>\r\n\"No, it'll be much better doing this without any lights, cameras, or THAT much action.\" She burped in his face again, got off him and dragged him over to the crates she was hiding behind by his tail. Blitz was too weak to do much of anything, not even when he saw what was behind the crates was he able to muster the strength to do much; other than moan.<br>\r\n<br>\r\nWhat was behind the crates was a king size bed with hand cuffs on all four post, opened and ready for Blitz wrist and ankles. It didn't take long for Stink Bug to lock all of the cuffs around his wrist and ankles, nor did it take long to get him on his back in order to do so. When she finished Stink Bug's stomach growled, and she gave him an evil smirk.</span></div></div>",
            "created":1466139600,
            "id":2165776,
            "title":"Just the two of you"
        },
        "1253322222211212221122":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Stay awke",
                "Pass out and recive a smelly wak up call."
            ],
            "content":"<div class=\"\"><div> <span>Blitz could only moan as he saw her grin and knew this was not going to me good. \"p please don't\" he weakly begged.<br>\r\n<br>\r\nStink Bug only chuckled ignoring his begging she took her bottoms off and placed her bare ass right on his face and grinded it further till blitz nose was right in the center. \"Get ready for a whiff of heaven loser\"<br>\r\n<br>\r\nAt those words she released a fart that was worse then the two his sister did but could only weakly struggle much to the kitties delight as she sighed in relief.<br>\r\n<br>\r\n\"Stay awake boy we are not done yet she said as she squeezed out another fart.</span></div></div>",
            "created":1466226000,
            "id":2166151,
            "title":"More farts"
        },
        "12533222222112122211221":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Apologize and Submit",
                "Refuse!"
            ],
            "content":"<div class=\"\"><div> <span>As much as he wished he could, Blitz did not pass out. Leaving him to endure Stink Bug's farts. Big ones, small ones, smelly ones, airy ones, wet ones, silent ones, and loud ones were all blasted into his face, and up his nose. It got to the point where he could TASTE the farts; and they tasted as bad as they smelled.<br>\r\n<br>\r\n\"Hmph, your a pathetic excuse for a skunk you know that?\"<br>\r\n<br>\r\nBlitz could only give a muffled \"What?\" as a reply.<br>\r\n<br>\r\n\"Skunks are supposed to embrace their stink; Skunky does, yet you don't. Your both a part of the smelliest species on the planet, and yet here I am, a cat, out doing you in what YOU'RE supposed to be and be doing.\" She punctuated the end of that sentence with a bassy fart.<br>\r\n<br>\r\nSkunkette came back, patting her stomach, amd gave a kiss to Stink Bug's cheek.<br>\r\n<br>\r\n\"It's really sad when denizen of another species out does you in what your own species does bro; of course Stinky and I are equals.\"<br>\r\n<br>\r\n\"Damn right we are.\" The two hugged and quickly kissed while Stink Bug farted in Blitz face. After that, she lifted her ass enough to allow Blitz to speak, but not get away.<br>\r\n<br>\r\n\"So bro, are you ready to apologize for what you did to me, and be my fart slave?\" Skunkette's stomach growled, \"Or do we have too show you how pathetic you are even more?\"</span></div></div>",
            "created":1466226000,
            "id":2166259,
            "title":"Stay awke"
        },
        "125332222221121222112212":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "personal time with one of them",
                "Double stink punishment"
            ],
            "content":"<div class=\"\"><div> <span>Blitz silently cursed himself for being outdone but gladly took a breath of what little fresh air he could. Hearing his sister repeat her offer he wanted to maintain what shred of dignity he had. \"No you got what you deserved and I will do it again\" he said defiant.<br>\r\n<br>\r\nBoth females laughed at his refusal as if they where hoping for it. Then his sister  gave him a evil glare.<br>\r\n<br>\r\nSkunkette looked at Stink Bug and nodded \"Then I guess you need to be reminded how pathetic you are\" she said.<br>\r\n<br>\r\nStink Bug purred  \"I think another round in the gas chamber might make him change his mind\" she said.<br>\r\n<br>\r\nSkunkette smilled \"a excellent idea now you think pne of use should do it or give him a double gassing\" she asked.</span></div></div>",
            "created":1466226000,
            "id":2166379,
            "title":"Refuse!"
        },
        "1253322222211212221122122":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Blitz manages to stay awake after a double gas chamber",
                "Blitz barely makes it past ten farts before begging them to stop"
            ],
            "content":"<div class=\"\"><div> <span>Stink Bug let loose a small fart and answered Skunkette.<br>\r\n<br>\r\n\"No, I think it's best we both do it, he took a gassing from each of us separately and is still stubborn.\" She grabbed Skunkette and brought their faces closer. \"Bsides, this way we'll be closer,\" She finished that sentence with a burp to Skunkette's face.<br>\r\n<br>\r\nSkunkette blushed, and removed her shorts completely. Stink Bug turned around and took a seat on the lower part of Blitz face, while Skunkette took a seat on his forehead; his nose was right in between their butt holes. Skunkette's stomach growled.<br>\r\n<br>\r\n\"Oh boy, those tacos don't seem to agree with me, but I bet they're going to agree with you even less bro,\" she punctuated that sentence with a big, loud, brassy fart. Stink Bug in turn let loose her own fart equaling Skunkette's in every way.</span></div></div>",
            "created":1466312400,
            "id":2166393,
            "title":"Double stink punishment"
        },
        "12533222222112122211221222":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Ready to serve?"
            ],
            "content":"<div class=\"\"><div> <span>Blitz groans as they each kept farting his poor nose burning from the combine stench.<br>\r\n<br>\r\n\"Hey Skunkette I am at 9 how about you\" she asked much to Blitz's dismay.<br>\r\n<br>\r\nSkunkette just smile \"I only at 8 but I think \"hero\" she punctuated the word with a fart \"is close to breaking. It a shame really that he is a pathetic excuse for a skunk\" causing both girls to laugh.<br>\r\n<br>\r\nUnfortunately for Blitz she was right as they farted he was gaging as is nose was assaulted. After ten farts he could not take it anymore. \"Please stop I do anything, anything\" he said finally broken by his sister and a cat you bested him in what skunks to best.<br>\r\n</span></div></div>",
            "created":1466312400,
            "id":2166554,
            "title":"Blitz barely makes it past ten farts before beg..."
        },
        "125332222221121222112212221":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Submit to her",
                "Compromise: He gives in, but they have to teach him how to be a \"real\" skunk."
            ],
            "content":"<div class=\"\"><div> <span>After hearing this the two stinky villains got off of Blitz, and Skunkette put her bare butt in his face, spreading her cheeks, revealing her butt crack and butt hole.<br>\r\n<br>\r\n\"If you'll really do anything, then swear to be my fart slave, apologize for what you did, and. Kiss. My. Butt hole.\"<br>\r\n<br>\r\n\"You sound so sexy when you talk like that Skunky,\" Stink Bug hugged Skunkette and gave her a kiss .<br>\r\n<br>\r\nSkunkette blushed, hugged and kissed her back, \"Thanks Stinky.\"<br>\r\n<br>\r\nBlitz was both disgusted, awkward, and strangely happy for his sister when hearing that exchange. But that didn't change the fact that he had to answer.</span></div></div>",
            "created":1466312400,
            "id":2166626,
            "title":"Ready to serve?"
        },
        "1253322222211212221122122211":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Start of a new life"
            ],
            "content":"<div class=\"\"><div> <span>Blitz shuddered then taking a deep breath. \"I am sorry for what I did and I swear to be your fart slave\" he said as he kissed her butt hole.<br>\r\n<br>\r\nBoth girls laughed at the display and Stink Bug looked at Skunkette \"A fitting place for one that gets out skunked by a cat\" she said kissing her friend.<br>\r\n<br>\r\nSkunkette laughed as she heard then felt her brothers lips on her butt. \"Good slave\" she teased.</span></div></div>",
            "created":1466398800,
            "id":2166977,
            "title":"Submit to her"
        },
        "12533222222112122211221222111":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Say nothing, pay attention to your sisters ass.",
                "Talk back to her."
            ],
            "content":"<div class=\"\"><div> <span>Blitz was changed into a skin tight leotard that revealed his ass, and was kneeling before Skunkette's butt.<br>\r\n<br>\r\n\"Lick my ass bro.\"<br>\r\n<br>\r\nBlitz stuck his tongue out, and licked his sister's ass crack, only to get a fart to the mouth for his trouble. He was disgusted, but swallowed the fart, and thanked his sister.<br>\r\n<br>\r\nStink Bug was watching, and burst out laughing, \"Wow you really ARE pathetic if you get used to this THAT quickly; so quickly that one might wonder if you REALLY disliked our farts to begin with.\"</span></div></div>",
            "created":1466398800,
            "id":2166996,
            "title":"Start of a new life"
        },
        "125332222221121222112212221111":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Share with Stink Bug",
                "Give him to some henchman for a bit"
            ],
            "content":"<div class=\"\"><div> <span>Blitz chose to ignore Stink Bug's insult and instead focuses on licking his sisters ass and thanking her every time she farts causing him to gag.<br>\r\n<br>\r\nSkunkette just relaxed enjoying the control over her brother.<br>\r\n<br>\r\nStink bug looked at them and purred \"Skunkette what you think since he is enjoying himself you think he actually likes our farts\"<br>\r\n<br>\r\nSkunkett thought for a moment \"I think he dose look at him he even says thank you\" she teased as she farted hearing a thank you from her bother.</span></div></div>",
            "created":1466398800,
            "id":2167277,
            "title":"Say nothing, pay attention to your sisters ass."
        },
        "1253322222211212221122122211111":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Stink Bug fart tortures Blitz",
                "Stink Bug decides to change to burping"
            ],
            "content":"<div class=\"\"><div> <span>\"Why don't you come and try him out.\" <br>\r\n<br>\r\nBlitz eyes widened, and before he could even think to protest Stink Bug's butt collided with his face. Skunkette giggled at her friends over enthusiasm and kissed her on the cheek.<br>\r\n<br>\r\n\"I'm going to bed, be sure to put him in my blanket when your done.\"<br>\r\n<br>\r\n\"Okie Dokie Skunky.\"<br>\r\n</span></div></div>",
            "created":1466398800,
            "id":2167286,
            "title":"Share with Stink Bug"
        },
        "12533222222112122211221222111112":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "More burps",
                "Putt him in the gass chamber"
            ],
            "content":"<div class=\"\"><div> <span>Blitz did nothing but waited like a good servant.<br>\r\n<br>\r\nStink Bug walked over to where Blitz was and grinned. \"You know since you can not out stink me instead of my farts eat this\" she said as she picked him up and burped in his face.<br>\r\n<br>\r\nBlitz gaged but sniffed it up like he is suppose to. \"Thank you\" he said.<br>\r\n<br>\r\nStink Bug laughed \"you are pathetic now how should I have you serve me\" she mused. </span></div></div>",
            "created":1466398800,
            "id":2167294,
            "title":"Stink Bug decides to change to burping"
        },
        "125332222221121222112212221111121":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "He manages not to cough and says thank you.",
                "Fail; Burp torture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Stand in front of me, and take my burps slave.\"<br>\r\n<br>\r\nBlitz winced, and stood in front of Stink Bug. Stink Bug grabbed his head, and released a big burp. Blitz tried his best not to cough, or say anything other than thank you.</span></div></span></div>",
            "created":1466398800,
            "id":2167303,
            "title":"More burps"
        },
        "1253322222211212221122122211111211":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "More fun",
                "Placing him under his sisters covers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Blitz gaged as she burped in his face and with what little strength he has he dose not cough and manages to say thank you.<br>\r\n<br>\r\nStink Bug laughed at that \"you are one lowly skunk\" she teased.</span></div></span></div>",
            "created":1466485200,
            "id":2168005,
            "title":"He manages not to cough and says thank you."
        },
        "12533222222112122211221222111112112":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Wait, wasn't she a sleep farter?",
                "You only have to deal with her BO."
            ],
            "content":"<div class=\"\"><div> <span>Stink Bug burped in his face one more time before grabbing him by the tail, and dragging him to his sisters bed. She lifted her covers and stuffed him under there.<br>\r\n<br>\r\nWhen his eyes got used to the dark, he saw that his sisters ass was completely bare and pointed at his face. Thankfully though she was fast asleep.</span></div></div>",
            "created":1466485200,
            "id":2168011,
            "title":"Placing him under his sisters covers"
        },
        "125332222221121222112212221111121121":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Hope you like \"eggs\" for breakfest"
            ],
            "content":"<div class=\"\"><div> <span>Blitz was about to fall asleep when he remembered she is a sleep farter. At that moment with the covers tucked in when she farted it was like she was giving him a duch oven.<br>\r\n<br>\r\nHe coughed and gaged from the smell as she farted off and on through the night. When she woke up she saw a lump under the covers and knew it was her brother.</span></div></div>",
            "created":1466485200,
            "id":2168033,
            "title":"Wait, wasn't she a sleep farter?"
        },
        "1253322222211212221122122211111211211":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "You pass out.",
                "How did you stay awake!?"
            ],
            "content":"<div class=\"\"><div> <span>\"You know bro, I had some boiled eggs along with the tacos I had last night.\"<br>\r\n<br>\r\nBlitz eyes widened in horror at the implications of what she just said.<br>\r\n<br>\r\n\"I hope you like eggs bro.\"<br>\r\n<br>\r\nPHHHHBBBBTTT!!!!!!<br>\r\nBBBBBVVVVRRRTTTTT!!!!<br>\r\nPPPPBBBBFFFFFTTTTTTHHHHHHRRRRRSSSSSSSVVVVV!!!!!</span></div></div>",
            "created":1466539560,
            "id":2168037,
            "title":"Hope you like \"eggs\" for breakfest"
        },
        "12533222222112122211221222111112112111":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Pose as modles taking down Blitz and make a scrapbook for ourselves",
                "Wake him up for some other fun ideas"
            ],
            "content":"<div class=\"\"><div> <span>Blitz did not have time to reply because halfway through his sisters fart he passed out much to her amusement.<br>\r\n<br>\r\nShe laughed then called over Stink bug who after hearing what happen laughed with her.<br>\r\n<br>\r\n\"Hey girlfriend you know what we should do\" she asked.<br>\r\n<br>\r\nSkunkette looked at her friend \"what\" she asked<br>\r\n<br>\r\nStink Bug smiled \"We could...</span></div></div>",
            "created":1466540220,
            "id":2168041,
            "title":"You pass out."
        },
        "125332222221121222112212221111121121112":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "Wrestling: Skunkette wins",
                "Wrestling: Stink Bug wins."
            ],
            "content":"<div class=\"\"><div> <span>\"What kind of fun?\" Skunkette let loose an eggy fart that even Stink Bug had to cover her nose for.<br>\r\n<br>\r\nAfter the smell subsided, Stink Bug took Blitz out of the covers and tied him up.<br>\r\n<br>\r\n\"We could have a system where we each have him for certain days, and share him for the weekends and Wednesdays.\"<br>\r\n<br>\r\n\"And how do we decide that?\"<br>\r\n<br>\r\n\"We wrestle in the nude; 3rd base. If I win I get him on Mondays and Fridays; while you get him on Tuesdays and Thursdays\" Stink Bug took off her clothes, leaving nothing but her panties, leans forward until she and Skunkette are face to face, and burps. \"The winner is decided by whoever passes out or gives up first,\" She burps in Skunkette's face again, \"deal?\"</span></div></div>",
            "created":1466541540,
            "id":2168050,
            "title":"Wake him up for some other fun ideas"
        },
        "1253322222211212221122122211111211211122":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Stink Bug takes her prize"
            ],
            "content":"<div class=\"\"><div> <span>Both females wrestled each getting clos to win. In the end though after a tough match Stink Bug wins yet Skunkette did not seem disappointed.<br>\r\n<br>\r\nStink Bug smiles \"well looks like I win\" she says giving a victory pose.<br>\r\n<br>\r\nBlitz did not seem to happy or disappointed only cared about his new life which made the two villains laugh.<br>\r\n<br>\r\nSkunkette got up \"Well good match\" she said giving her a kiss.</span></div></div>",
            "created":1466572140,
            "id":2168384,
            "title":"Wrestling: Stink Bug wins."
        },
        "12533222222112122211221222111112112111221":{
            "author_id":"hcb88",
            "author_name":"BCM",
            "choices":[
                "\"Cook me a nice big meal!\"",
                "\"Go set up the torture rack in the basement!\""
            ],
            "content":"<div class=\"\"><div> <span>PHHHHHHHHHHHHHHHHHHRRRRRRRRRRRRRBT!<br>\r\n<br>\r\nBlitz gagged before thanking Stink Bug once again as he hung over the cat's shoulders, his head swinging in such a way that it would keep on impacting with that volatile rear. By now he had been taken away from the bedroom and to where Stink Bug lived. Having been ordered not to look at anything else the captive skunk had little bearings of where he was though it really didn't matter by this point.<br>\r\n<br>\r\n\"So, were you counting?\" Stink Bug asked. Blitz tried not to cough as he answered; \"yes Ma'am. 59, Ma'am.\"<br>\r\n<br>\r\n\"Told you I was going easy!\" the cat mocked before letting out fart number 60. She waited to be thanked for it before laying Blitz down on her couch and untying him.<br>\r\n<br>\r\n\"Now, as the good slave that you are I expect you to do more than be a pathetic fart-sniffer! Here's what you get to do first...\"</span></div></div>",
            "created":1466631240,
            "id":2168676,
            "title":"Stink Bug takes her prize"
        },
        "125332222221121222112212221111121121112211":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Be my cusion ",
                "Message my feet"
            ],
            "content":"<div class=\"\"><div> <span>Blitz nodded obediently as he was told to make a nice meal and went to the kitchen. He grabbed a few things and started cooking as Stink Bug relaxed.<br>\r\n<br>\r\nStink Bug sat in her chair as she waited for her meal \"After your done come here I have other uses for you\" she said.<br>\r\n<br>\r\nBlitz finished the meal and brought it to her \"I hope you enjoy\" he said with a bow.<br>\r\n<br>\r\nStink bug smiled \"good slave now I want you too...\"</span></div></div>",
            "created":1466700600,
            "id":2169363,
            "title":"\"Cook me a nice big meal!\""
        },
        "1253322222211212221122122211111211211122112":{
            "author_id":"hcb88",
            "author_name":"BCM",
            "choices":[
                "whilst in a phone call with Skunkette",
                "whilst recording Blitz on her phone"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes Ma'am!\" <br>\r\n<br>\r\nAt first Blitz felt that this was okay for him. Sure, the feet probably did stink but it'd be the first break from farts he would have been granted since agreeing to be a fart slave. As he moved a footstool in front of Stink Bug and knelt down he started to rub before the feline had even stretched her feet out properly! For about half a minute he rubbed as Stink Bug ate; Blitz wondered if he had overdone it with the spices given that he woud be the recipient of the consequences, and then...<br>\r\n<br>\r\nBRRRRRRRRRRRRRRRRRRRRPPPPPPPPPPPPPPPPT!<br>\r\n<br>\r\nBlitz paused a bit as he heard the fart, and then the smell hit him. He quickly turned a groan into a \"thank you\" before massaging again, knowing what was to come. The farts weren't frequent but when they did come it made the skunks' toes curl! He hoped that it wasn't obvious as he dutifully continued to rub, taking the farts without complaint and much gratitude, as was expected of him in his new life.<br>\r\n<br>\r\nStink Bug was quick to finish her meal but farted down on Blitz for another couple of minutes...</span></div></div>",
            "created":1466706900,
            "id":2169427,
            "title":"Message my feet"
        },
        "12533222222112122211221222111112112111221122":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Keep going",
                "I have other jobs for you"
            ],
            "content":"<div class=\"\"><div> <span>Blitz said thank you every time she farted as he messaged her smelly feet.<br>\r\n<br>\r\nAs he messaged her feet and said thank you Stink Bug was recording the full thing for her own reasons<br>\r\n<br>\r\nBlitz kept up the tasks without stopping knowing she has control over him.<br>\r\n<br>\r\nStink Bug purred and looked at the former hero \"Good now slave ...\"</span></div></div>",
            "created":1466707920,
            "id":2169443,
            "title":"whilst recording Blitz on her phone"
        },
        "125332222221121222112212221111121121112211222":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "He kisses her ass like he means it.",
                "Refuse!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Stink Bug raised her legs, revealing her ass to Blitz, letting loose a fart to punctuate her order.<br>\r\n<br>\r\n\"And do it like you mean it.\"</span></div></span></div>",
            "created":1468467600,
            "id":2179908,
            "title":"I want you to kiss my ass."
        },
        "1253322222211212221122122211111211211122112221":{
            "author_id":"sky11",
            "author_name":"DeSoto",
            "choices":[
                "Stink Bug has more in store",
                "Stink Bug decides to humiliate him a different way."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He coughed as Stink Bug's fart chokes him. Upon hearing her order he thanked her for the fart and without hesitation began to kiss her ass right in the center as if it was a reward.</span></div></span></div>",
            "created":1468514520,
            "id":2180167,
            "title":"He kisses her ass like he means it."
        },
        "125332222222":{
            "author_id":"lonelybeast",
            "author_name":"SwayingChoice",
            "choices":[
                "Let's try this slithering snake.",
                "Someone else",
                "Continue with the previous one: \"She gasses out a bank, and robs it.\""
            ],
            "content":"<div class=\"\"><div> <span>Whoever wrote the previous chapter didn't leave an option to refuse. Anyone actually wanting to go down the farting bank robbery. Go click the three option (and make it if it's not written). <br>\r\n<br>\r\nVillain Name: Slithering Ghost<br>\r\nReal Name: Madaga Isle (Female)<br>\r\nAge: Unknown<br>\r\nSpecies: Snake<br>\r\nJob: Master Thief for Hire.<br>\r\n<br>\r\n<u>Powers:</u><br>\r\n<b>Low Detection:</b> She is somehow able to configure her body to be hard to detect from scanners, cameras, etc.<br>\r\n<br>\r\n<b>Size Reduction:</b> She is able to shrink herself vastly. This can cause her to look like a normal snake, like a 'harmless' garden snake.<br>\r\n<br>\r\n<b>Possession:</b> Her favorite trick. She enters a person's body and takes control of them. No time limit. She can possibly read their mind and memories for impersonation.<br>\r\n<br>\r\nSkilled with Close Combat and stealth.<br>\r\n<br>\r\n<u>Goal:</u> <br>\r\nWhatever she wants to do when she isn't stealing something. She is a <u>thief for hire</u> and has a reputation for ruining people who double-crossed her. However, she does like trying on new bodies and information gathering on others that catch her eye either they are another villain, hero, or civilian. <br>\r\n<br>\r\n<u>Some other details:</u><br>\r\nNo one has figured out who she is but know her reputation. She has successfully avoided confrontation with police and alluded any heroes that have.</span></div></div>",
            "created":1550864160,
            "id":2621512,
            "title":"That Last one Did leave a 'No' Option."
        }
    },
    "info":{
        "author_id":"hertzman",
        "author_name":"Hertzman",
        "brief_description":"Play a super hero or super villain",
        "created":1318890780,
        "description":"<td align=\"left\" class=\"norm\">This is a anthro version of an RPG I used to play, called Villains and Vigilantes(<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Villains_and_Vigilantes\" target=\"_blank\">http://en.wikipedia.org/wiki/Villains_and_Vigilantes</a>), much like the MMO City of Heroes and City of Villains. You play either a Superhero or Super villain. It takes place in the Fictional city of New Wolf City, much like our cities with a high crime rate. Can you stop the crimes or help commit them?</td>",
        "id":1819304,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1582522080,
        "modified":1582522080,
        "pretty_title":"Anthro Villains and Vigilantes"
    }
}