{
    "chapters":{
        "1":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa was coming to and she could sense the sun beating down on her even before opening her eyes. She could feel the sand beneath her as she lay on her back. She could hear the waves of the ocean lapping against the shore in the distance. She could also hear birds, seagulls most likely, making the usual noise when on the beach. What she couldn't do is move. In a panic she opened her eyes and immediately squinted from the high sun directly above her. Her eye sight was a blurry sun spotted daze as she remembered the events before she lost consciousness. She was with her family on the rental boat on vacation. The last things she remembered was that boat captain alerting them of a rogue storm and to prepare for rough seas. She was scared but her father seemed to be calm in the face of the growing bad weather and it gave her a semblance of courage. They had been scuba diving and enjoying themselves one minute and frantically preparing for the worst the next. Alyssa, nine years old, and her older brother who was seventeen were below deck as her mother and father helped the captain get the boat ready for the storm. Then it hit.<br>\r\n<br>\r\n The boat was tossed around like driftwood as mountainous waves seemed to come from nowhere. The last thing she remembered was seeing her mother struggling to get below deck and Alyssa broke free of her brother's grip to help her. Then the ship seemed to groan and crack as the waves were splitting it in two. Water rushed in from every direction and she was soon drug out to sea. When she surfaced she could see the ship as it was hit by a huge wave and then there was nothing but debris in the water. She screamed for her family and the name of the kind captain but nothing was answered back but the roar of the storm. She grabbed onto a nearby chuck of boat and rode out the waves as best she could before passing out from exhaustion.<br>\r\n<br>\r\n Now… the sun was out and she seemed to be on a beach. She tried to sit up but couldn't. At first she thought maybe she was injured but she didn't feel hurt. She tried lifting her arm but it wouldn't budge. Alyssa turned her head to look at her limb and saw it was covered in some kind of thin grass…. or vines. Blinking her eyes they began to focus and she saw those tiny vines were connected to the ground. No that wasn't right…. they were anchored by tiny pins that were driven into the sand. Her arm was covered in them. They criss-crossed her arm from her wrist to her shoulder. Following her body, she she was completely covered with them and it was holding her down. She started to panic. Was she captured by pirates, her young mind reasoned. She struggled and started to whimper in fright. Why was she tied down? Who tied her down? Where was she? What happened to her family? Finally she broke her silence despite her captors might be nearby.<br>\r\n<br>\r\n \"He-…..*cough cough*\" Alyssa croaked from her parched throat. \"Help!! Somebody! Anybody!\" She struggled again against her bindings. \"Mommy! Daddy!\"<br>\r\n<br>\r\n Nothing but the caw of birds somewhere near. She turned her head and saw up the beach to a forest that met the border of sand in the distance. But it looked weird. Like it was far away but…. not? She angled her head to look down her body... even her feet were secured with vines looped around some of her toes. She started to hyperventilate with worry as she struggled. Then she saw them. Flying above her she saw little bugs... buzzing around her. But it seemed like the bird sounds were coming from their direction. She squinted and saw that they weren't flies…. she thought they looked like white birds. It looked far away and yet, again…. not. Were her eyes playing tricks on her in the bright sunlight? But then as she had ceased struggling, the birds actually came and landed on her chest. She could see them now. They looked like seagulls but they were tiny. Almost like white feathered gnats. How was that possible?! She started to freak out again and the tiny birds scattered into the sky again cawing in annoyance.<br>\r\n<br>\r\n \"Somebody help me, please!\" Alyssa screamed as she started to weep.<br>\r\n<br>\r\n \"Silence, monster!\" came a voice from somewhere.<br>\r\n<br>\r\n Alyssa darted her head around looking for the person but saw no one. \"Please…. help me!\" She begged whoever. She then felt something on her outer left thigh. Then she felt something moving on her hip. She looked down expecting some kind of small creature, but what she saw silenced her in shock. Walking up her stomach was a man. No bigger than perhaps her thumb. He was dressed in a short toga and armor. If Alyssa had to describe him she'd have to say he resembled a roman soldier with molded chest armor and a helmet with a bright red bristle mohawk. He brandished a long spear pointed at her face as he walked slowly towards her. \"What are you?!\" Alyssa asked in excited confusion. \"Why are you so tiny?!\"<br>\r\n<br>\r\n \"I-I am not tiny!\" the little man stuttered trying not to show his fear. \"You, giantess, are enormous!\"<br>\r\n<br>\r\n \"What?!\" Alyssa questioned. \"Where am I? Why am I stuck to the ground?!\"<br>\r\n<br>\r\n \"Y-you don't ask any more questions!\" The tiny soldier ordered as he reached Alyssa's chest and stood defiantly between the triangle sections of her bikini top. Alyssa understood now that the tiny vines were in fact rope. This tiny person, and possibly others, tied her down. Out of fear? Were they afraid of her?<br>\r\n<br>\r\n \"Please, mister…. I won't hurt you.\" Alyssa assured. \"Just let me go, please.\"<br>\r\n<br>\r\n \"Ha! You lie!\" The soldier seemed to be gaining confidence the more he realized their rope work was holding fast. \"You are a monster…. possibly sent from Blefuscu to destroy us!\"<br>\r\n<br>\r\n \"No! I'm just a girl!\" Alyssa pleaded. \"Please, mister…. let me go.\"<br>\r\n<br>\r\n \"Quiet!\" The soldier barked. Feeling nothing more to discuss he made his way back to the ladder he propped against her thigh.<br>\r\n<br>\r\n \"No wait!\" Alyssa begged. \"Come back! Don't leave!\"<br>\r\n<br>\r\n The soldier just made a dismissive gesture with his hand not even bothering to turn around. The tiny man disappeared and Alyssa was relatively alone again. She cried. Afraid and in sorrow for the chance her family was gone.</span></div></div>",
            "created":1540184400,
            "id":2567106,
            "title":"Alyssa's Adventure Begins"
        },
        "11":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa lay there immobilized and crying. In nothing but her two piece bathing suit she felt vulnerable, exposed, and afraid. Even if her family survived the storm, she was most definitely separated from them. Possibly forever. She even felt for the poor captain who was nice enough to spend time showing her how to make various knots. It had been an hour since she last saw the tiny soldier. She'd come to find out he was beside her out of sight the entire time she just didn't know it until another tiny soldier had rode up on a horse and they both left together. If it weren't for her current situation she would have found the miniature horses adorable. But she was absolutely alone now. As she lay there, the sun shining down on her, she felt movement again down by her thigh. She craned her neck so she could see and saw a tiny person standing on her hip. It was a girl. She had long black hair braided down her back and was wearing a white toga that was tied around her waist with a belt. She was staring down Alyssa's body at something for a few minutes. Alyssa didn't say anything for fear of frightening her off. The tiny girl then turned to make her way up the length of Alyssa's body when she saw the giant girl's face looking at her. She froze in her tracks and let out a gasp. Alyssa could see she was thinking of running when she tried to stop her.<br>\r\n<br>\r\n \"Hello.\" Alyssa said quietly. \"Please don't leave.\"<br>\r\n<br>\r\n The tiny girl took a step back. The thought that this monster of a person could scoop her up and eat her was very much at the forefront of her mind but she remembered she was tied down. She hoped the Queen's guard had done a good job. The tiny girl slowly made her way up Alyssa's stomach towards her face. The tiny feet made Alyssa almost giggle as they tickled with every step. When the girl got to Alyssa's bikini top she stopped and just stared at her in awe. Closer now, Alyssa was able to get a better look at her. She appeared young. Older than herself but not yet a woman. She had skin bronze from a long time out in the sun. Her eyes, big as they were staring at her, were a deep blue that were very striking in contrast to her tanned skin. Her white toga showed signs of wear and came down to just mid thigh. She wore leather sandals on her feet, which were fidgeting in her apprehension.<br>\r\n<br>\r\n \"Hello, giantess.\" The girl said quivering.<br>\r\n<br>\r\n \"What? I'm not a giant.\" Alyssa said. The tiny girl gave her a look that mocked her comment as she made a slow glancing gesture down Alyssa's body. \"You're all just tiny.\" Alyssa said defensively.<br>\r\n<br>\r\n \"Well…. you are a giantess to me, miss.\" The girl rebutted. \"If you do not mind me saying so, giantess… but you are amazing.\"<br>\r\n<br>\r\n Alyssa blushed. Being referred to as a giantess and amazing were not things a nine year old was accustomed to. \"My name is Alyssa. You can just call me that.\" She told her trying to keep from using the term 'giantess'. It made her sound like a monster.<br>\r\n<br>\r\n \"I prefer Giantess, if you do not mind.\" The girl answered. \"I do not yet know you well enough to forgo formalities. You are a giantess. And amazing. I have no qualms about expressing both when addressing you.\"<br>\r\n<br>\r\n Alyssa had no idea what she was talking about but it made her blush more just the same. \"Ok…. Whatever.\" Alyssa said dismissively. \"What's your name?\"<br>\r\n<br>\r\n \"I am Amara, Giantess.\" Amara said bowing slightly.<br>\r\n<br>\r\n \"Amara…. that's pretty.\" Alyssa said. As she did she noticed it was now Amara's turn to blush.<br>\r\n<br>\r\n \"Thank you, Giantess. Alyssa is also a beautiful name.\" Amara walked a bit closer to Alyssa's face as her courage was now stronger. \"You are not the horrible monster the royal council has claimed. In fact…. Giantess, how old are you?\"<br>\r\n<br>\r\n \"I'm nine.\" Alyssa answered.<br>\r\n<br>\r\n \"By the gods…. You are just a child! I knew it….\" Amara said as she pounded her fist into her hand.<br>\r\n<br>\r\n \"I'm not a monster!\" Alyssa barked. The sudden anger in Alyssa's voice spooked Amara for a second. \"Why is everyone afraid of me? I'm just a girl.\"<br>\r\n<br>\r\n \"You could crush an entire house to splinters with one foot.\" Amara explained. \"You could grab me and gobble me up without a second thought.\"<br>\r\n<br>\r\n Alyssa got undeniably offended as she gasped. \"I would never do that!\"<br>\r\n<br>\r\n \"But you could.\" Amara went on.<br>\r\n<br>\r\n \"Wh….what?!\" Alyssa was shocked.<br>\r\n<br>\r\n \"You COULD. And that is what frightens people.\" Amara explained calmly. \"You are immense. You could do anything anything you wanted and no one would be able to stop you. That frightens people.\"<br>\r\n<br>\r\n Alyssa's bottom lip trembled as she listened to herself be described as a horrible monster. \"Do I scare you, Amara?\" She asked, afraid of the answer.<br>\r\n<br>\r\n \"Honestly?\" Amara asked. Alyssa was slow to nod her head. \"A little. Yes. You are just so….\" Amara fought to find the word to describe being in the presence of unfathomable enormity.<br>\r\n<br>\r\n \"But you're here…. talking to me.\" Alyssa pointed out.<br>\r\n<br>\r\n \"I…. I just had to see you with my own eyes.\" Amara explained.<br>\r\n<br>\r\n \"Amara…. please let me go.\" Alyssa begged. \"I promise I'll just…. run away…. or something.\"<br>\r\n<br>\r\n \"I can not….\" Amara said. In her mind she asked herself. 'Can not…. or will not?'. \"The Queen has decreed you in league with our sworn enemies. If I helped you I could be tortured and killed.\" Alyssa was about to plead when they both heard the sound of horns and the stampede of horses.<br>\r\n<br>\r\n \"The royal guard!\" Amara jumped. \"I am not supposed to be here! If they find me I will be beaten…. Or worse!\" She looked around desperately for somewhere to hide. They were in the middle of the beach with nothing but sand and Alyssa. Then she noticed Alyssa's shoulder length blonde hair. \"I may be able to hide amid your hair.\" Amara started to make her way to the ground. She used Alyssa's bikini top strap to shimmy down her shoulder. She looked up at Alyssa's fearful eye. \"Please do not tell them I am here, Giantess.\"<br>\r\n<br>\r\n \"I-I won't.\" Alyssa said, unsure what was happening.<br>\r\n<br>\r\n The young giantess looked up the road and saw many tiny people, more horses, and large wooden contraptions making their way towards her. She couldn't see but felt Amara burying herself in her hair beside her neck. It wasn't long before she found herself surrounded by more of these amazing teeny people. Most were armored like the soldier earlier, but there were some in long luxurious robes and togas. She saw one woman sitting atop a platform that was carried by many men in simple clothes not unlike Amara's. On the platform was an elaborate throne where she sat. She was beautiful and the expensive looking jewelry and baubles only added to this. Atop her head was a crown signifying Alyssa was looking upon their queen.<br>\r\n<br>\r\n \"Oh! Are you the queen?\" Alyssa asked, hoping to finally be able to reason with someone in command.<br>\r\n<br>\r\n \"Silence, monster!\" a soldier in the front line of yelled. He was covered in golden armor plates and a large red plume on his helmet. He must be the leader of the military. \"You will not address her royal highness. You will answer only to me.\"<br>\r\n<br>\r\n \"I-I'm not a monster. I'm just a girl.\" Alyssa corrected.<br>\r\n<br>\r\n \"You are a monster and you clearly were sent from Blefuscu to destroy Lilliput.\" The soldier ignored her.<br>\r\n<br>\r\n \"I'm not…. I'm just…. lost.\" Alyssa answered trying to understand what was going on. \"I don't know any…. Blef….. wherever.\"<br>\r\n<br>\r\n The soldier smiled. \"I so was hoping you'd resist.\" He turned and looked at the Queen. She stared at Alyssa with cold eyes and then… she nodded her head. The soldier waved his arm and then motioned at Alyssa. \"Now…. monster… now we make you talk.\" Alyssa saw the large wooden contraptions being pulled towards her into position.</span></div></div>",
            "created":1540184400,
            "id":2567108,
            "title":"Alyssa Meets Amara"
        },
        "111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa looked anxiously among the various wooden portable structures that line up beside her. The soldiers were pulling levers and moving parts as the Captain, as she came to find out, paced impatiently to begin. The Queen watched all this with a look of both determination and hesitancy. She trusted her royal guards when they claimed she was immobile, but a sliver of doubt grew in her when she saw her actual size firsthand. They also claimed she was a dangerous monster, but when she saw this 'monster' it didn't take her long to realize she was in fact a young girl. She was conflicted in her order to pursue stronger tactics in interrogations. She was an enormous, imposing creature… but she was, still, what appeared to be a scared little girl. Her motherly instincts were fighting to change her mind. But in the end her royal duties to protect her land won out.<br>\r\n<br>\r\n \"Please, mister….\" Alyssa pleaded. \"I promise not to hurt anyone. I'm not a bad person.\"<br>\r\n<br>\r\n The tiny Captain was about to bark back when another guard came and whispered to him. He smiled and turned to face Alyssa. \"Now, monster….. we find out what you know.\" He moved closer to her face, causing Amara to push further into Alyssa's hair in hiding. \"Who sent you here?\"<br>\r\n<br>\r\n \"I told you….\" Alyssa wept. \"I was on a boat and it sank…. Then I woke up here.\"<br>\r\n<br>\r\n The Captain smiled as he raised his arm up. \"Is this your final word?\" Alyssa just looked around for anyone to help her, but all the tiny people looked intent on seeing her punished for something. The Captain quickly dropped his arm. The soldiers awaiting signal pulled their levers and the wooden structures sprung long spear projectiles. They struck Alyssa's arm and left side, causing her to yelp out. The Queen cringed when they impacted and turned away. Turning back slowly she saw that every spear was on the ground in splinters. Not a blemish was to be seen anywhere on the giantess' young skin. The entire crowd stood in silence with mouths agape at the monumental failure of the attack. Alyssa was wailing despite not being injured in the least. The very fact they were attacking her scared her to the point of sobbing. She fought against her bindings in an attempt to get away from her attackers. The Captain, completely flustered, ordered a reload.<br>\r\n<br>\r\n \"Please!\" Alyssa pleaded. \"Somebody, please!\"<br>\r\n<br>\r\n The ballista shot again and again they shattered and fell useless. The Captain gulped hard. He suddenly thanked the various gods that this monster was tied down. He raised his arm again and it was visibly shaking. He lowered it and again splintered spears.<br>\r\n<br>\r\n \"Please! Stop! I'm sorry I'm so big!\" Alyssa screamed. Amara, huddled in her shoulder length locks, cupped her hands over her ears. Both to block out the deafening volume of Alyssa's cries, but also to close herself off from the atrocities against this helpless girl not much younger than herself. The Captain raised his hand again.<br>\r\n<br>\r\n \"Stop!\" The cry this time came from the throne. The Queen had stood and was practically leaning over the edge of her platform. \"That is enough!\"<br>\r\n<br>\r\n \"B-but…. Your Highness, we…\" the Captain stammered.<br>\r\n<br>\r\n \"I said enough.\" The Queen said behind clenched teeth. The soldier backed off and bowed. The Queen regained part of her composure and realized she should not appear sympathetic to a possible enemy. \"We can ill afford any further waste of munitions, Captain.\" She sat back in her throne and straightened her robes nervously. \"We will continue again tomorrow.\" She waved her hand and the men surrounding her platform rushed to grip their stations and lift it off the ground to return her to the castle. As the throne slowly turned the queen made eye contact with Alyssa who was slowly coming down from sobbing. For an instant, on the Queen's face, there was sympathy and regret that broke her royal demeanor. Alyssa never saw it being that she was so tiny and at a distance, though.<br>\r\n<br>\r\n The soldiers gathered themselves, leaving the ballista and marching back led by the defeated Captain. A few were left to stand watch and were, for the moment, down by Alyssa's feet. Amara emerged from her hiding spot and refused to look Alyssa in the face from shame of what her people had done to her.<br>\r\n<br>\r\n \"Amara… are you ok?\" Alyssa whispered as she dealt with the last of her tears. The words made Amara stop in her tracks. The words stung. She turned and faced the huge concerned eyes on her. Alyssa saw that she too had red eyes from crying.<br>\r\n<br>\r\n \"Giantess, I….\" She searched for words as she rested a hand on Alyssa's shoulder. \"I am… so sorry.\" Alyssa was almost brought to tears again from a combination of her new little friend distraught and remembering what had just happened.<br>\r\n<br>\r\n \"It's not your fault, Amara.\" Alyssa assured. \"But…. please help me. Maybe you could untie a few strings for me.\"<br>\r\n<br>\r\n Amara's hand drifted to one of the 'strings' that was in fact hardened hemp rope practically as thick as her wrist. She glanced down at where it was anchored and doubted she would be able to wrench it free. She knelt and tried, anyway. Alyssa's eyes widened seeing her attempting to free her. She craned her neck to see where the guards were and they were still by her left foot talking. She returned her attention to Amara who was pulling with all her might. The tiny girl was amazed that with her enormous size that Alyssa couldn't simply snap these like the strings she claimed them to be. Standing out of breath she kicked the anchor with her tiny sandal clad foot in frustration. Even if she had something to cut the ropes with, there were maybe a hundred criss-crossing the giantess' body. Alyssa looked back down her body and gasped.<br>\r\n<br>\r\n \"What is it?\" Amara asked.<br>\r\n<br>\r\n \"The guards are walking back up here.\" Alyssa whispered.<br>\r\n<br>\r\n Amara almost thought to dive back into the long locks of golden hair. \"I can not let them find me!\" She whispered back. \"I am sorry, Giantess…. but I have to leave you.\"<br>\r\n<br>\r\n \"No, please! Stay with me!\" Alyssa whispered trying not to raise her voice.<br>\r\n<br>\r\n \"They will find I am missing from the slave camp if I do not return.\" Amara walked to Alyssa's face and rested her hand on her giant chin. She wiped a large tear away that was now drifting down Alyssa's cheek. \"I will be back, Giantess. I promise you.\" Alyssa's lip trembled but she nodded. As much as she didn't want to be left alone, she also didn't want her little friend to get into trouble. Amara hugged Alyssa's cheek and scurried off low to the ground until she reached the cover of the nearby brush.<br>\r\n<br>\r\n Alyssa watched until she was out of sight and sniffed back tears. She saw the guards come into view beside her left hand. \"H-hello….\" Alyssa said trying to make new friends. But all her friendly greeting did was frighten them as they raised their spears and back away further from her huge hand. Ship wrecked in a strange land, her family possibly gone, tied down as a prisoner, but it wasn't until now with Amara gone that she truly felt alone.</span></div></div>",
            "created":1546923600,
            "id":2600693,
            "title":"Hostile Interrogations"
        },
        "1111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa, finally settling down from the day's earlier attempt to harm her, looked around herself. There was only so much she could see by moving her head around. Thankfully they didn't tie down her hair allowing for some motion but not much. But every where else along her body was little strong strings securing her to the beach. She looked over at the guard down by her left hand. He stood a mere feet of their distance from her fingers. She couldn't believe just how tiny these people were. She noticed his height relative to just one of her fingers and it just about dwarfed him. She lifted her index finger and slowly moved it next to him, as his back was turned, and it looked huge next to him. The guard sensed movement behind him and turned. When he saw Alyssa's giant fingertip next to him he almost dropped his spear. He held it defensively aimed at the gigantic index finger making little jabs towards it…. his knees almost shaking.<br>\r\n<br>\r\n Alyssa, annoyed by his response to her, flicked her finger and knocked the spear out of his hands. \"That's not very nice.\" Alyssa said as she waved her finger at him scolding the tiny man. She felt around the ground and plucked up his spear and held it out for him to take. \"Go on.\"<br>\r\n<br>\r\n The guard cautiously took his spear and stepped back. He bowed. \"Th-thank you, Giantess.\" He said as he removed his helmet. \"Forgive me.\"<br>\r\n<br>\r\n \"It's ok.\" Alyssa said, appreciating his politeness. \"Just be careful where you poke that thing from now on. K?\"<br>\r\n<br>\r\n The guard bowed further. \"Y-yes, ma'am.\"<br>\r\n<br>\r\n Some of these people, even the guards, weren't all bad Alyssa thought. Since leaving, the other soldiers had come back and were milling about around her. The kept busy checking ropes and standing around her talking in hushed tones about her size and how badly the interrogations had gone. Alyssa watched the ones she was able to see in fascinated wonder. She could feel them working around her, a few of which had climbed up onto her. She couldn't believe she had full grown adults walking around her body. They would sometimes tickle her skin with their tiny feet, but she kept her giggles in check as best she could. As wondrous as it all was she still couldn't really enjoy any of it. She was still their prisoner. She was sure they were devising a new way to hurt her to force her to talk. She rested her head back on the warm sand. She missed Amara.<br>\r\n<br>\r\n Before long she felt something she was sorely dreading would happen. She felt the urge to pee. No doubt from all the sea water she inadvertently swallowed as she struggled to stay afloat. She bit her bottom lip. She had to ignore it because there was no way they were going to allow her to get up. Her entire body squirmed, fighting her body's urge. Something the tiny people around and on her didn't fail to notice.<br>\r\n<br>\r\n \"You there! Giantess!\" A guard emerged from her lower abdomen towards her face. \"Cease your struggles. It is pointless.\"<br>\r\n<br>\r\n \"But…. I have to…. Go….\" Alyssa whined, too embarrassed to actually say out loud.<br>\r\n<br>\r\n \"We have been over this countless times.\" The soldier huffed. \"You are not going anywhere until we have…\"<br>\r\n<br>\r\n \"No!\" Alyssa cut him off, making him noticeably jump.\" \"I have to…. pee….\"<br>\r\n<br>\r\n The guard stood confused for half a second until the realization dawned on him. \"Oh! I…. order you to…. not.\"<br>\r\n<br>\r\n \"I can't!\" Alyssa squirmed. \"Please…. Mister, please….\"<br>\r\n<br>\r\n The soldier paced her chest as he debated what his next action should be. Finally he leaned over Alyssa's side and ordered a man on horseback to send urgent news to the castle. He returned to Alyssa's chest. \"Giantess…. I ord-…. I ask that you…. Please hold.\" He pleaded.<br>\r\n<br>\r\n \"Hurry!\" Alyssa demanded. This caused the tiny man to stumble backwards from her outburst.<br>\r\n<br>\r\n What seemed like an eternity later a carriage followed by a garrison of troops came speeding down the road. Getting out of the carriage were the Captain from earlier and a new person. A woman dressed almost as fine as the Queen had been just minus the crown. They all congregated out of Alyssa's eye sight. It wasn't long before she felt movement down between her inner thighs. The Lilliputians stood between the massive walls of flesh staring at the wall of brightly colored material in front of them.<br>\r\n<br>\r\n \"I do not see the problem.\" The captain muttered in disdain. \"Simply let it soil itself. The humiliation would more than deserving.\" He smirked at the thought.<br>\r\n<br>\r\n The finely dressed woman glanced at him and frowned. \"Your Queen will be returning on occasion.\" She scolded. \"I will NOT submit her to the stench of urine baking in the noon day sun.\"<br>\r\n<br>\r\n The captain rolled his eyes but kept silent. He knew better than to argue with the Queen's special advisor. She was the closest person to Her Highness in the entire country of Lilliput. \"Well…. there is no way we are allowing it to get up and free.\" He added.<br>\r\n<br>\r\n \"Of course not, Captain.\" The advisor answered, aware of the obvious.<br>\r\n<br>\r\n \"Then what?\" The Captain asked. He truly wanted to hear how they planned to accomplish this. The advisor seemed to ignore him as she turned to the guards and spoke and made hand gestures towards the giantess. They all looked at her funny before bowing and running off towards the nearby supplies. She turned to another group and then went towards the outlying forested area.<br>\r\n<br>\r\n \"Um…. Hello?\" Alyssa called out. \"I really, really have to go.\"<br>\r\n<br>\r\n The Captain, in a fit of annoyance, kicked the wall of young thigh. The surface of the otherwise soft skin didn't so much as indent. But the Captain muffled a yelp as his toes crumpled painfully by the force. Soon ropes were thrown over the massive hips and dangled down for guards between Alyssa's thighs to grab and pull down. Attached to the ends were iron grapple hooks. The attached them to the far hem of the bikini bottoms. The usually stoic soldiers were very hesitant of getting so close to this particular area. Even if it was the 'area' of a monster. They reached into the crevice between Alyssa's groin and inner thigh and pulled up the hem that had been tucked into it and attached the hooks. The greater number of guards on the far side beside Alyssa's hip began pulling. They strained and pulled with all their might, their feet searching for footholds in the sand. The elasticity of the bikini bottoms did little to help them, but eventually more and more of Alyssa's skin was revealed. It wasn't long before the bikini began inching it's way aside and her lighter toned privates emerged, contrasting to her tanned legs that saw the sun more.<br>\r\n<br>\r\n Alyssa felt this and it suddenly became clear what they were doing. \"Oh my gosh….. what are you doing?!\" Alyssa panicked. \"Please! Just let me get up! I promise not to hurt anyone!\" She struggled against her restraints as she could feel the warm sun on her exposed privates. The advisor stood watching the giantess' massive nethers as they were slowly revealed.<br>\r\n<br>\r\n \"By the gods….\" She uttered breathlessly. Eventually the stretchy material was pulled aside enough that the guards between her thighs called for them to stop. The guards pulling collapsed exhausted onto the beach almost sighing in unison. The advisor, once she regained her composure, cleared her throat. \"It… would be…. b-beneficial…. if she had her…\" the Advisor stumbled over words. The Captain had never seen her so flustered and he just looked at her with an odd expression. The Advisor motioned with her hands at Alyssa's twitching privates. \"If they were… *ahem*. Spread…. open.\"<br>\r\n<br>\r\n The Captain looked at her completely appalled. \"We are NOT doing any such thing!\"<br>\r\n<br>\r\n \"If you do not, it is going to-…\" the Advisor started.<br>\r\n<br>\r\n \"I'm sorry!\" Alyssa whimpered. Cutting off the debate she wasn't aware was happening between her legs. Both the Captain and Advisor turned towards Alyssa's voice just in time to see the gigantic vagina in front of them spray it's first spurt of urine as the giant girl tried her hardest to keep herself clenched tight. The spray caught both tiny Captain and Advisor, plus a few guards, directly with it's squirt. They both yelled in disgust and they all ran down the long corridor of legs. But now that Alyssa's bladder felt release, it resumed to the embarrassment and relief of Alyssa. The stream shot out and seemed to chase the scurrying Lilliputians as they fled by hitting them all squarely in the backs, knocking some of them down. Not until they reached Alyssa's knees did the torrential stream stop dousing them. The group rounded her foot and watched from behind it as Alyssa sighed in relief. When it finally stopped, embarrassment set back in for the giant girl. It wasn't until they emerged on her right side and into view that she realized what happened. They were drenched and utterly disgusted. The Advisor was wringing out her robes.<br>\r\n<br>\r\n \"Oh…. oh no.\" Alyssa said ashamed. \"I'm so, so sorry!\"<br>\r\n<br>\r\n They avoided eye contact as they hurried into the carriage and sped off down the road. The few guards left split up into groups. One group busied themselves removing the offending sand from between her legs, while the other used buckets of sea water to splash clean Alyssa's skin. The giant girl wished she wasn't exposed like this, but there was a lot she wished hadn't happened. She just added it to the list. She saw the friendly guard from earlier who was laughing with a group of fellow guards. They were acting out the reactions their superiors had being urinated on by a giant little girl and laughing hysterically. They looked over to Alyssa and gave a thumbs up and clapped. Alyssa smiled and blushed.</span></div></div>",
            "created":1547096400,
            "id":2601701,
            "title":"Number One"
        },
        "11111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> The rest of Alyssa's day went rather uneventful. She never saw anyone else besides the changing of the guards watching over her. Every so often people would gather on the outskirts of the beach to get a glimpse of her, but they were ordered away by the guards. Evening came and, wearing nothing but a bikini, she found herself shivering slightly despite the warmth of the day's sun earlier. Some of the more sensitive guards saw this and decided to build their fires closer to her, at the protest of the less concerned larger group of fellow guards. Alyssa was apparently causing a rift between the little people it seemed. Some saw her as a monster sent by their hated enemies, Blefuscu. Others saw her as a young girl, albeit a HUGE young girl, who may have actually came to Lilliput by accident from some wondrous far away land filled with giants.<br>\r\n<br>\r\n It was a mixture of both these theories that was also fueling another offset of people who viewed her as a deity. Unknown to Alyssa, these fanatics were trying to sway the people to worship her to appease their old gods. They had members all the way into the royal house staff who believed she was sent by the gods to judge their devotion. Earlier in the day the guards had actually fed Alyssa. They gave her a food base that was fed to the slaves. It was very bland, square shaped, and almost completely tasteless aside from a slight bread flavor. But the little they gave her filled her completely. It was almost like magic. That was the food's purpose. To feed a huge amount of people for almost nothing. It was devised by the same contingent who were currently worshiping her. Their religion dealt with sacrifices and strange magic that was really nothing more than the use of alchemy and hallucinogens. They created this amazing concoction and was in part why they rose to prominence with the royal family all those years back.<br>\r\n<br>\r\n As darkness crept over her beach, Alyssa began to nod off. What else could she do? Sleep seemed the only thing she had a choice in anymore. In the morning she could feel something crawling around on her. She looked down her body and saw flocks of tiny birds using her for a rest spot. They looked like tiny gnats. She blew a gust of wind down herself and they scattered, cawing annoyed.<br>\r\n<br>\r\n \"Giantess!\" Alyssa heard whispered urgently beside her ear. She recognized the voice and turned to see Amara standing by her shoulder.<br>\r\n<br>\r\n \"Amara! I'm so glad to see you again!\" She whispered back. But there was a look on Amara's face that even Alyssa could see. \"What? What happened? You weren't caught were you?\"<br>\r\n<br>\r\n Amara shook her head. \"No, nothing like that.\" Amara was carrying a satchel with her and she set it on the ground opening it. It contained saws and other tools. \"Yesterday…. You… relieved yourself on the Advisor and Captain?!\" Amara said, still worry upon her face but a smile cracked momentarily before she covered it up again with a serious look.<br>\r\n<br>\r\n \"It was an accident!\" Alyssa explained.<br>\r\n<br>\r\n \"They did NOT take it well.\" Amara stood brandishing a saw. \"All day they were devising a way to eliminate you. They argued for hours into the night, but they think they have a way. They plan to burn you.\" Amara paced as she explained, but then approached an anchored rope and began to saw away at it. \"I have to free you! Before they come I have to help you!\"<br>\r\n<br>\r\n Alyssa lay there in stunned shock. They were going to burn her alive. Because of an accident. She started to feel tears return down her cheeks. When she turned to thank Amara, her eyes saw down the road and a garrison was making it's way towards them. \"They're coming!\" Alyssa said no longer whispering. \"Amara…. please hurry! Don't let them hurt me, please!\" Amara sawed faster and cut through the rope and moved to another. Her hands were shaking as she worked and her own tears were flowing now.<br>\r\n<br>\r\n The large garrison, accompanied by a royal carriage and a crowd of people in white flowing robes, reached the beach and spread out along Alyssa's prone body. They began lining up burning material along her body. The robed people began to sway and chant, to the annoyance of the Advisor. The Captain was barking orders, and the Advisor was watching with a steely look on her face. Clearly yesterday's dousing had made her less cordial than before.<br>\r\n<br>\r\n \"What are you doing?!\" Alyssa cried out as she struggled against her bindings.<br>\r\n<br>\r\n \"You are being disposed of.\" The Advisor called out, still refusing to make eye contact. \"Whether you are an ally of Blefuscu, or simply a monster with no allegiances to either, you are not something we want in our land anymore. You are a disgusting monster and your time here is over.\"<br>\r\n<br>\r\n The Captain simply laughed as he continued to direct placement of the flammable material. One guard rounded Alyssa's shoulder and saw Amara feverishly working on one of the ropes. \"Hey, you there!\" He shouted. Amara didn't even bother to look up. \"Stop that! Captain over here!\" The guard started to rush towards the slave girl.<br>\r\n<br>\r\n \"Amara! Run!\" Alyssa cried.<br>\r\n<br>\r\n But Amara stayed until the guard reached her and shoved her away from the rope. Amara scrambled and ran back down the length of Alyssa's arm with the guard in pursuit. Rounding the giant hand she saw the Captain and more soldiers advancing. She shot a glance towards the outlying trees but there were more guards closing in from that direction as well. She shuffled her feet in panic, unsure where to go.<br>\r\n<br>\r\n \"A slave?!\" The Captain said disgusted. \"Aiding this.... thing?! Kill this traitor!\"<br>\r\n<br>\r\n \"No!! Don't you hurt her!\" Alyssa screamed.<br>\r\n<br>\r\n The guards shot a volley of spears but Amara dodged them and huddled beside Alyssa's wrist screaming. The archers near the edge of the beach notched arrows and took aim, they would not miss like the clumsy guards had. Their arrow heads were alight having been preparing to launch at the debris to burn the giantess. As they pulled back their arrows, Amara covered herself crying knowing her life was surely ending.<br>\r\n<br>\r\n \"No!!\" Alyssa cried out. She summoned all her strength, fueled by her friend in danger, and ropes along her arm began to snap. Her arm shot up free from the beach. Just as the archers let loose, Alyssa brought her hand down and cupped it around Amara. The volley struck Alyssa's hand and bounced off. But the fuel used to light them splattered her hand leaving small spots of burning flame. Alyssa cried out as she began pushing up from the weakened ropes and the few Amara had cut. The soldiers began to panic as she seemed to be impossibly freeing herself. Alyssa's other arm wrenched up from the beach. Everywhere there were anchored ropes either snapped or dislodged and flinging sand around her lifting body as the young giant grunted in effort. Alyssa's legs were free and as she sat up on her elbows, her attention returned to her hand's burning speckles and she stamped it out with other. She opened her cupped hand slightly and saw Amara huddled in fear.<br>\r\n<br>\r\n \"Are you ok, Amara?\" Alyssa asked.<br>\r\n<br>\r\n Before she could get an answer, the Captain seemed to finally regain his senses. \"Fire!!\" He yelled. \"Kill them! Kill them both!!\" A fresh volley sliced through the air and struck Alyssa in various spots over her entire body. The arrows fell harmlessly but again she was pock marked with spots of flame. She squealed and brushed herself off with her free hand. She scooped up Amara, and a good bit of beach sand, and rose to her feet. She stood and the soldiers, despite the Captain's orders, started to scatter at the sight of her immense size fully realized as she stood for the first time. She held Amara in her hand close to her chest. In a panic she turned and ran down the empty beach before the army could regain their courage. The very ground shook with each footfall as she escaped leaving huge sunken footprints in her wake.</span></div></div>",
            "created":1547478060,
            "id":2603342,
            "title":"Consequences Of Yesterday"
        },
        "111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa ran, not knowing where she was going but as long as it was away from the dangerous tiny people. One tiny person was riding along in her hand as she held on to giant fingers for dear life. Amara looked up and saw Alyssa crying as she stumbled around the small land features blindly. She poked her head out from Alyssa's fingers cupped around her and saw where they were. She thought fast where they could be safe. She recognized some features on the ground, before Alyssa's massive feet plowed into them leaving craters as she ran.<br>\r\n<br>\r\n \"Giantess! I know where we are….\" Amara shouted up to the sobbing youngster. Alyssa slowed to a stop as she opened her hand. \"Just over there, beside that cliff, is a huge cavern. We will be safe there, I think.\"<br>\r\n<br>\r\n Alyssa looked and from her height could see an opening in the mountainside. She closed her fingers around her tiny friend and ran for it. She stood before the deep cavern and the sloped entrance as the cave seemed to sink into the ground. Hesitant of the foreboding cave, she looked back up the beach and could see the small army charging down the beach in the distance. She furrowed her brow and entered the cave. The ceiling was just high enough for her to walk in without bending but it eventually curved down and she was forced to her knees. She was far enough inside to be hidden from the entrance as she sat huddled in fright. She lowered her hand and Amara hopped off. The tiny slave girl ran to the entrance to look to see if the army would pass. Alyssa saw her leaving and she panicked.<br>\r\n<br>\r\n \"No, Amara! Please…. Don't leave me.\" For a second Alyssa's hand motioned to grab her again, but she thought better of it and it retreated.<br>\r\n<br>\r\n \"Do not worry, Giantess.\" Amara said as she stopped to calm her. \"I am just seeing if they pursue us. I doubt they will dare enter this place, though.\"<br>\r\n<br>\r\n \"W-what…?!\" Alyssa asked, not liking what that may have meant. But Amara rounded a corner and was out of sight before she could press further about it. Alyssa just sat, huddled with her knees pressed to her chest and lowered her head and tried to stop shaking in fear. People tried killing her. She hadn't done anything to these people and they were going to burn her alive. She clenched her eyes tight and fought back any more tears.<br>\r\n<br>\r\n At the cave entrance, Amara was hiding behind a rock outcropping watching for movement. She saw the soldiers rush up to the cave, following Alyssa's massive footprints. Once they realized where she'd chosen for sanctuary, the stopped in their tracks. The Captain's horse paced back and forth in front of the entrance before they all cautiously backed away. The few robed people who followed their chase got down from their horses and fell to their knees and began chanting. Amara almost laughed. She knew they wouldn't follow them in here. Alyssa was a mere few meters out of sight of them and they halted their pursuit immediately. They argued among themselves very heatedly but in the end they retreated down the path again. Amara, satisfied, returned down the cave to her huge friend.<br>\r\n<br>\r\n \"They are gone.\" Amara said rather proud of herself. \"They dare not follow any further.\"<br>\r\n<br>\r\n \"Why? What's in here?\" Alyssa asked, her eyes darting around nervously.<br>\r\n<br>\r\n \"Nothing. This cave is just….\" Amara searched for an explanation her giant friend would understand. \"This cave is a holy place. Our people believe giants once roamed these lands.\" She looked up as she craned her neck to see Alyssa's gigantic body. She always found the old stories as foolish myths, but looking at Alyssa made her rethink all of them. This cavern is enormous, and Alyssa was having trouble fitting in it. \"We believe this cavern is where they first emerged from. And when they left forever, it is where they returned to wherever they came from until the need for them arose once more.\" Amara continued. \"Those people in the white robes?\" Alyssa nodded indicating she'd noticed them. \"They believe you are a god.\" Alyssa's eyes widened, making Amara chuckle. \"You entering this cavern must be causing all kinds of arguments on whether they are correct.\" Alyssa thought for a moment before she lowered her head into her knees again. Amara noticed her rubbing her hand where the fires burnt her. She got up and started walking to the entrance.<br>\r\n<br>\r\n Alyssa shot her head up. \"Amara…?!\" She cried.<br>\r\n<br>\r\n \"Do not worry, Giantess. I will never leave you.\" Amara assured. \"I will be back in just a moment. I promise.\"<br>\r\n<br>\r\n Alyssa smiled weakly and sat huddled in the back of the cave watching her leave. When Amara returned she was carrying various plant leaves and flowers. Alyssa looked at her curiously. The tiny slave girl sat beside Alyssa's feet which were crossed one over the other. Amara began putting some of the plants into her mouth and started chewing. Putting her mouthful aside in her mouth she called up to the young giantess.<br>\r\n<br>\r\n \"Let me see your hand, Giantess.\" Alyssa lowered her hand palm up and Amara giggled and went to lift it to flip it over and wasn't until Alyssa understood and turned it over that Amara was able to go to work. She examined the burn marks and she almost cried. They were barely more than pinkish red marks, but it was WHY she had them that hit Amara. She got them saving her from death. She took some of the mixture from her mouth and spread it on the red areas. Alyssa felt immediate relief as it seemed to cool and numb the irritations.<br>\r\n<br>\r\n \"Thank you, Amara.\" Alyssa said gratefully.<br>\r\n<br>\r\n Amara paused in her work and her shoulders slumped. She looked up at Alyssa. Her eyes fighting tears. \"You saved my life, Giantess.\" She said as her voice cracked in emotion. \"I owe you my life.\" Amara leaned on the back of Alyssa's hand and tried to hug her.<br>\r\n<br>\r\n Alyssa's cheeks burned at show of appreciation. \"I didn't…. I mean…\" She stuttered. \"I mean you helped me, too. You could have been hurt helping me.\"<br>\r\n<br>\r\n It was Amara's turn to fail at words. \"Well… let us just appreciate each other then.\" They both laughed.<br>\r\n<br>\r\n It felt good to laugh for Alyssa. The last few days had been a nightmare. But now she found herself able to calm herself. She sat watching this tiny, kind person seeing to her hurting hand. She was so tiny. It was almost like this was her first time fully realizing just how small these people were to her. Amara finished and patted Alyssa's hand and the giantess lifted it and examined it. The redness was already subsiding. \"Thank you again, Amara.\" Alyssa said to the tiny girl moving around beside her. Amara smiled and hoisted herself up onto Alyssa's foot and sat. The giant girl cringed a bit. Did her feet smell, she wondered. But she allowed it hoping her feet were cleaner than they seemed. \"So…. what do we do now?\" Alyssa asked.<br>\r\n<br>\r\n Amara's smile faded as she contemplated what their next action would be. She wasn't sure how long hiding here would keep protecting them. Eventually their attackers would probably decide to forgo beliefs and hunt them again. \"Let us just…. enjoy our safety for now?\" Amara said remaining hopeful. \"Tell me about where you are from, Giantess.\"<br>\r\n<br>\r\n \"I wish you'd stop calling me that.\" Alyssa said in a hushed tone. \"I'm not some monster. I'm just a kid.\"<br>\r\n<br>\r\n Amara patted Alyssa's foot to get her attention. When the huge girl looked her way, Amara smiled. \"Know that when I call you 'Giantess', that it is NEVER out of anything but awe and respect for you.\" Alyssa looked away, but a smile crossed her lips as she did. \"So… tell me of the land of giants.\"<br>\r\n<br>\r\n \"I don't know… it's not that different than here.\" Alyssa shrugged. \"Just bigger. And…. I don't know. Your country looks old. Like how people looked a long time ago.\"<br>\r\n<br>\r\n Amara looked down at herself. \"How so?\"<br>\r\n<br>\r\n \"Well…. like your clothes and stuff. Do you guys even have cell phones?\" Amara was completely baffled as she shook her head. \"I mean it's cool, though. I think it's neat.\"<br>\r\n<br>\r\n Amara felt her arms. \"Cool….?\"<br>\r\n<br>\r\n \"No I mean… I think it's neat that everything looks old.\"<br>\r\n<br>\r\n \"Looks neat…\" Amara still was lost.<br>\r\n<br>\r\n Alyssa giggled. \"Nooo…. I mean it's…. interesting.\"<br>\r\n<br>\r\n \"Oh.\" Amara understood. \"Giants talk strange.\"<br>\r\n<br>\r\n \"Hey!\" Alyssa laughed as she poked Amara with her finger. Amara laughed and play fought with the giant index finger pretending to poke at her.<br>\r\n<br>\r\n \"And your family?\" Amara asked as the finger moved away.<br>\r\n<br>\r\n Alyssa sat thinking and her happy face drifted away and was replaced by a somber one. \"My family…. were on the boat…\" Alyssa said quietly. Amara instantly regretted the question. Alyssa saw this and shrugged. \"I don't know. They might be out there somewhere. I mean…. I'm here. I made it, so….\"<br>\r\n<br>\r\n \"I lost my family very young, also.\" Amara spoke. \"War with Blefuscu. They died when we were invaded. I was made a slave and have worked for the wealthy land owners ever since.\" Both girls sat quietly regarding each others tragic tale as the sun was setting outside the cave entrance. Amara wiped away a tear as she climbed down off Alyssa's bare foot. \"I will gather wood for a fire. I will be back.\" She said as she turned to leave. \"Thank you, Giantess.\"<br>\r\n<br>\r\n \"I thought we agreed. We saved each other.\" Alyssa chuckled.<br>\r\n<br>\r\n \"No.\" Amara said as she continued towards the entrance. \"I mean for freeing me.\" Alyssa sat speechless at that thought as she watched Amara leave.</span></div></div>",
            "created":1547566080,
            "id":2603607,
            "title":"Sanctuary Among the Gods"
        },
        "1111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> After Amara had returned with wood and built and started a fire, Alyssa went on for an excessive amount of time on how the little slave girl was able to do that without the use of matches. Amara just smiled awkwardly, bewildered people didn't know this basic survival skill. They sat around the flickering flames as Amara listened to Alyssa describe her homeland. Most of it, admittedly, she didn't understand. But rather than stop her every few minutes to explain what something like a television was, she just let her ramble on. She enjoyed listening to her talk without despair or tears like she had known her the past few days. Plus she simply sat and was awestruck at her size. It was unimaginable how big she was. She thought she was going to be caught just staring, but either Alyssa didn't notice or she just allowed it. Eventually both were yawning and decided to turn in. Amara looked for a spot near the fire as she pushed aside as many pointy jagged rocks as she could. She laid down but got up again as the ground was less than even and deep rooted rocks jutting out here and there. A shadow fell over her and when she looked over she saw Alyssa's hand beside her palm up. Amara looked up and saw Alyssa smiling and nodding. Amara climbed into her hand and she was lifted up to the young giantess' chest.<br>\r\n<br>\r\n Alyssa was cramped as she was propped up behind her with one sloping wall of the cavern while her feet were resting, knees bent, along the opposite wall. She cradled her tiny friend in her hand next to her chest. She smiled warmly down at her. \"Better?\" Alyssa asked.<br>\r\n<br>\r\n \"Yes, Giantess. Thank you.\" Amara smiled. She noticed Alyssa didn't flinch at 'Giantess' anymore. The warmth radiating from Alyssa's hand and nearby body was intoxicating and felt like a hundred animal skin blankets. Her eyes grew very heavy as the last thing she recalled before falling asleep was she thought she heard Alyssa humming.<br>\r\n<br>\r\n In the morning, Amara woke first. So used to the grueling slave schedule she was up at dawn while Alyssa was still snoring away. Amara sat up in her giant hand and stretched her muscles as she yawned. She looked around her surroundings. She was way up above the cave floor in Alyssa's hand. Everywhere she looked she seemed to see more of the young giantess. She crawled over to the edge of Alyssa's hand and looked down. Between her position and the ground was seemingly a wall of lightly tanned flesh that rose and lowered with her snoozing. She needed to get down but didn't want to wake Alyssa if she could help it. Plotting a course to climb she lowered herself over the side of Alyssa's hand. Her sandal clad feet touched the giant child's stomach as she stood trying to keep her balance on the shifting body. She crept down Alyssa's tummy hoping her little feet wouldn't tickle her. Alyssa shifted a bit in her sleep but that was all. Amara reached the giantess' bikini bottoms and she stepped onto the spandex material. She knelt down and grabbed the bikini strings tied in knots at Alyssa's hips. Amara went spelunking down Alyssa's hip until she felt she was low enough that she jumped down. When she landed on her feet, she stood rather proud of herself. She suddenly heard clapping and she looked up to see Alyssa giggling and clapping her hands. Amara's face turned a shade of pink.<br>\r\n<br>\r\n \"Good job!\" Alyssa cheered.<br>\r\n<br>\r\n \"How long have you been awake?\" Amara asked avoiding eye contact.<br>\r\n<br>\r\n \"Your feet on my belly woke me up.\" Alyssa confessed.<br>\r\n<br>\r\n \"And you just watched me not bothering to help?\" Amara pretending to be annoyed to hide her embarrassment.<br>\r\n<br>\r\n \"Uh-huh.\" Alyssa giggled. \"You were so cute climbing I didn't want to spoil it.\"<br>\r\n<br>\r\n Amara smirked and kicked Alyssa's hip, knowing it didn't even register. But Alyssa feigned injury anyway and laughed. Amara had never been referred to as 'cute'. She'd never been referred to anything but insignificant and lowly her entire life. She didn't know how to process it…. or any compliment really. Even among her own slaves, they were so downtrodden and subservient, compliments weren't something people passed around. She had yet to be completely broken in spirit because of her young age. Most other slaves were older and had been at it for decades. Children didn't tend to make it long before they were simply taken and abandoned somewhere, viewed unfit for use in society. But Amara was of very good stock and was rather strong and resilient for her youth and so was 'a keeper'.<br>\r\n<br>\r\n As Alyssa's giggles died down, they both heard sounds from outside. They both went silent and from inside the cave it almost sounded like… singing. \"I am going to take a look.\" Amara said as she crept towards the entrance.<br>\r\n<br>\r\n \"Be careful!\" Alyssa whispered to her.<br>\r\n<br>\r\n Alyssa sat watching her disappear. It seemed like an eternity and she was still not back yet. \"Amara?!\" Alyssa tried whispering. Just as she was about to go search for her, the little slave girl came back into view. She walked back to Alyssa with a strange look on her face. \"Well…. what is it?\" Alyssa asked nervously.<br>\r\n<br>\r\n \"I….\" Amara was at a loss for words. \"I believe those religious zealots have returned.\"<br>\r\n<br>\r\n \"The weirdos who think I'm a god or something?\" Alyssa asked. Amara nodded. \"What do they want?\"<br>\r\n<br>\r\n \"Apparently…. They've brought you a gift.\" Amara said.<br>\r\n<br>\r\n Alyssa heard 'gift' and became hopeful. \"Really? What is it?\"<br>\r\n<br>\r\n \"They brought you…. a virgin.\" Amara said in disbelief.<br>\r\n<br>\r\n  \"…….. what?\" Alyssa asked in a flat tone.<br>\r\n<br>\r\n \"I overheard some of the words to their chanting. They speak of feasting.\" Amara looked up at Alyssa dumbfounded. \"They intend to feed her to you.\"<br>\r\n<br>\r\n Alyssa gasped long and her face grimaced. \"Eeeeew!\" She said in disbelief. \"What?! Nooo….!\" Amara just shrugged. \"I'm not eating someone! No way! That's gross!\"<br>\r\n<br>\r\n \"There is also another problem.\" Amara explained. \"If you, obviously, refuse to eat her…. they will kill her anyway.\" Alyssa became very serious hearing this. \"They will view her as unsatisfactory and need to eliminate the poor choice in offering and kill her regardless.\"<br>\r\n<br>\r\n Alyssa sat fidgeting in stressful indecision. \"Amara…. What do I do?!\"<br>\r\n<br>\r\n \"I…. honestly I do not see a way around this. Unless you plan on killing all the cult members, you have to let them kill her.\" Amara could see the hurt in her big eyes. \"I am sorry, Giantess. I just do not…\"<br>\r\n<br>\r\n \"I know what I need to do.\" Alyssa said. She had a grim look on her face as she got to her knees and made her way to the cave entrance. All Amara could do was follow….</span></div></div>",
            "created":1547925660,
            "id":2604881,
            "title":"Goddess Alyssa"
        },
        "11111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Alyssa approached the cave entrance and she could hear the robed figures chanting away. It was almost hypnotic. When she reached the opening, she saw all of them. Swaying and gyrating to their own music. To the side she saw a small woman who was tied with her arms above her head to a post that looked aged and covered in growth. This was probably not the first time it was used, unfortunately. But it was the first time, Alyssa was sure, that a giant answered their calls. The bound woman didn't look terrified. Rather she was singing along with the others and swaying as best she could being tied up. Alyssa advanced and fully emerged from the cave and the chanting suddenly stopped. All eyes were on her as she stood up to her full height. All the robed cultists backed away from her in fear. As devoted as they all were, when confronted with a real giant, their resolve faded. Some cried out as Alyssa took a heavy step towards them.<br>\r\n<br>\r\n Alyssa looked down at the bound woman and her once serene composure was replaced with frozen fear. Alyssa knelt down and examined the tiny pillar and female Lilliputian. The inescapable reality of being eaten was rushing to the tiny woman's thoughts and it was all she could do to keep from collapsing unconscious. Alyssa inched a finger towards her and she retreated in the opposite direction until her bindings halted her. Alyssa delicately touched her with the tip of her finger and it glided down the tiny cultists frame. She played with the flowing sheer wraps that consisted of some sort of robe that did a poor job covering her. The Lilliputian turned to her fellow cultists and screamed in fear.<br>\r\n<br>\r\n \"Please!! I can not do this!!\" She begged. But none of the robed figures dared come near as they all watched in fear. \"Please!!\"<br>\r\n<br>\r\n Alyssa moved her hand and pinched the ropes binding the tiny sacrifice. She snapped the ropes effortlessly and lifted the struggling woman off her feet. The tiny woman began kicking her legs as she was lifted by her wrists tied to the rope in Alyssa's fingers. She screamed, almost unintelligible pleas, as she was lifted to Alyssa's smiling face. As the sacrificial woman looked her titanic captor in the face, Alyssa licked her lips. The woman screamed as her eyes fixated on the soft lips grinning hungrily. The giant youngster lifted her higher and tilted her head back. She dangled the kicking woman over her face as she opened her huge mouth wide. The tiny woman glanced down and saw the gaping maw of teeth an the pink cavern leading down her gullet.<br>\r\n<br>\r\n \"Nooooo!!\" She screamed as she struggled with renewed vigor. \"I do not want this!! I am sorry!! Please, gods, noooooo!!\" Alyssa held her dangling above her salivating mouth before she released the rope and the poor woman went into free fall before bouncing onto her waiting tongue. She scrambled her hands over anything that would pull her out and they gripped the large white teeth. It was the only thing keeping her from sliding backwards down Alyssa's throat. The cultists cries were then silenced as Alyssa closed her mouth, shutting the woman off from the world in humid, slippery, darkness.<br>\r\n<br>\r\n \"Mmmm.\" Alyssa mumbled as she moved the woman around her mouth with her tongue, tasting her.<br>\r\n<br>\r\n Amara watched in utter horror as her once sweet giant friend was now devouring an innocent woman. \"Giantess…..!!\" She finally regained her senses. \"Gods, noooo!\"<br>\r\n<br>\r\n Alyssa tilted her head slightly and everyone below could not only hear, but also see her throat muscles flex, as she gulped. \"Mmm-Mmm.\" Alyssa said she rubbed her bare stomach.<br>\r\n<br>\r\n Amara quickly looked away, imagining the poor woman's final moments, and clenched shut her eyes. Alyssa stood up and the crowd of robed cultists scattered as some ran back towards the city while others fell to their knees and worshiped her. Both groups did so out of complete unadulterated fear. The young giantess stooped and retreated back into the cave, giggling. Amara sat in her hiding spot in terror as she watched the giant girl stroll by. She gathered her courage and followed. This giant monster had saved her life…. She supposed she owed the giantess her allegiance. But her blood ran cold as she followed the thundering footsteps back into the cavern.</span></div></div>",
            "created":1548083400,
            "id":2605551,
            "title":"The Unthinkable Happens"
        },
        "111111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Amara followed the deep thumping footsteps of the young giantess she thought was a sweet and kind little girl. But after witnessing her devour an innocent person like so much a snack, her resolve to remain quiet was fading with every shuddering footfall back to the rear of the cavern. Amara stood as she watched Alyssa settle onto her rump with an even more thunderous rumble of the earth. Her eyes were red but not with tears but anger. She believed in her. Trusted her. Would have fought off the royal army for her. And now she was as frightened of her as she was loathing her.<br>\r\n<br>\r\n \"How could you?!\" Amara demanded. She walked up to Alyssa's shin as the giantess was just settling into an Indian style sit and began to pound her fists against her. \"She was innocent! How could you do that?!\"<br>\r\n<br>\r\n Alyssa cleared her throat, making Amara look up with eyes raging. The young giantess had a smirk on her face as she grabbed the rope still dangling from the corner of her mouth. She pulled slightly and the virgin maiden slide out with a wet pop and swung from the rope. She was breathing heavy having been screaming the entire time but was muffled by Alyssa's cheeks. The giantess giggled as she watched the soaked with saliva woman swing from the rope. Looking down at Amara who was staring with eyes wide in astonishment.<br>\r\n<br>\r\n \"Fooled ya!\" Alyssa said triumphantly as she lowered the poor woman to the ground. When the cultists feet touched ground she immediately scrambled to get away, but was jerked to a stop by the rope still clenched in Alyssa's fingers. \"I fooled you and the weirdos!\" Amara watched as the drenched woman ran around the length of the rope terrified, and then back up at the grinning giant. \"Um… Amara?\" Alyssa said finally becoming serious. \"Could you, maybe…. calm her down?\"<br>\r\n<br>\r\n Amara glanced back at the hysterical woman struggling for freedom. She rushed to her with her hands out as if trying to calm a spooked animal. \"It is all right, miss. Calm down.\" Amara tried assuring.<br>\r\n<br>\r\n The frantic woman flinched from Amara's touch not sure what to make of any of this. She had just spent the last couple minutes in the giant girl's wet, pitch black mouth. Why she wasn't swallowed she had no idea. Was the giant monster toying with her before she chose to eat her? As she avoided this new young smaller girl she fell backwards onto her rear. She stayed there motionless as she hung her head and wept. Amara took a step forward and the woman threw her hands up defensively, her wrists still bound by rope.<br>\r\n<br>\r\n \"Please! Let me go!\" She pleaded. \"I do not want this anymore! I am sorry to displease you. Please do not feed me to her!\"<br>\r\n<br>\r\n Amara just stood there shocked as she turned to look at Alyssa who simply shrugged. Amara looked back at the cowering woman and sighed as she knelt beside her and began to explain what was happening. As she spoke, the woman started to calm and give Alyssa unsure glances. Amara reached slowly for her wrists and untied the rope. The woman scooted back to the wall behind her the second she was free. \"So you understand?\" Amara asked. \"By making them believe the Giantess ate you, they will not harm you.\" The woman looked up at Alyssa and the young girl waved a friendly gesture to her. \"You understand?\" Amara asked again.<br>\r\n<br>\r\n \"Th-the…. Giantess…. saved me?\" The woman said unbelievably. Amara smiled and nodded. The woman stood up and gathered her still damp robes that were falling around her from their ordeal in Alyssa's mouth. \"I…. I owe you my life, Giantess.\" This was the second time someone thanked her like this and she simply blushed.<br>\r\n<br>\r\n \"Let me build us a fire.\" Amara said. \"You must be cold.\" Amara remarked. Mostly from being covered in the child's saliva, but also because the sacrificial robes didn't do much to cover her body. That was mostly due to enticing the hoard of dirty old men in the cult. As Amara left, the cave was eerily silent as the two sat awkwardly in the cave together. Alyssa watched the tiny woman meander around the floor below in front of her, trying not to stare at her.<br>\r\n<br>\r\n \"Sorry I had to put you in my mouth.\" Alyssa said breaking the silence. Her voice made the maiden jump a bit in surprise. \"I hope it wasn't too bad.\" The tiny woman just smiled up at her nervously. \"I would never eat somebody, though. That's just nasty. Not that…. you're nasty or anything. Just… you know….\"<br>\r\n<br>\r\n The woman couldn't help it and just laughed. \"Thank you, Giantess. For saving me.\" She said as she bowed before her.<br>\r\n<br>\r\n \"Aw, it's ok.\" Alyssa said as she blushed again. \"But…. you were gonna let them do that to you? I mean... willingly?!\"<br>\r\n<br>\r\n The woman sat beside the cold fire pit and looked down at her bare feet. \"I… thought I knew what I needed to do. I had been part of the sect for a while now. I thought they were speaking to the gods and passing down judgement from a higher calling.\" The woman tried to wrap herself more closely with her flowing sheer robes. \"Now I see the Divine One is actually just a giant child.\" Her eyes got wider. \"No offense intended!\" Alyssa just chuckled. \"But they are all just…. misguided perverts. I was such a fool.\"<br>\r\n<br>\r\n \"Well…. now you're safe with us.\" Alyssa pointed out. \"I won't let them hurt you.\" The woman looked up at her and smiled warmly.<br>\r\n<br>\r\n Amara returned to see the two speaking and laughing. Apparently they were getting along. 'That was quick...' she though. She built a fire and the maiden scooted closer to it and sighed. \"I see you two have gotten to know each other.\" Amara said as she sat by the flickering fire.<br>\r\n<br>\r\n \"Yes. She is quite amazing.\" The maiden replied. Alyssa just smiled at the compliment. \"Alyssa is nothing the monster they play her out to be.\" Amara looked at her oddly when she heard Alyssa's name. \"What?\" The woman asked.<br>\r\n<br>\r\n \"Oh…. Amara insists on calling me \"Giantess\" instead of my real name.\" Alyssa explained.<br>\r\n<br>\r\n \"Truly?\" The maiden asked. \"That is a bit…. Oh my!\" The maiden exclaimed. \"I never introduced myself. My name is Isabella.\"<br>\r\n<br>\r\n \"Isabella. What pretty name.\" Alyssa grinned. \"It's nice to meet you! This my friend, Amara. I'm Alyssa. Or \"Your Giantess\".\" Alyssa said in a mocking royal tone. Amara just harrumphed and laughed.<br>\r\n<br>\r\n Isabella got up and extended her hand. Alyssa saw and lowered her finger and Isabella gripped her fingertip with her hand and bowed in greeting. Amara rolled her eyes. Clearly Isabella was from the ruling class. Her involvement in the religious cult was proof enough of that. Isabella held Alyssa's fingertip and laughed nervously as she took in just how massive this girl was. It was like making contact with a mythical being from the old tales. She could see how people, including herself at one point, thought she was just one of those many deities. But when the dust cleared, she realized she was in fact a simple little girl. If 'simple' could be used when describing her. The slave girl was amazed how fast Isabella had adapted. Minutes ago she was screaming for her life. Now she was instant friends with Alyssa. The giant child had a way with people.<br>\r\n<br>\r\n \"I am going to find something for us to eat.\" Amara said as she got up. \"Something besides virgins.\" Alyssa blew her a playful raspberry at her comment.<br>\r\n<br>\r\n \"Can I help?\" Isabella asked. \"It is the least I could do for the hero who saved me.\" She grinned up at her new gigantic savior.<br>\r\n<br>\r\n Amara almost laughed at the notion before catching herself. \"No. That is not necessary. You just… rest. You had a trying day to say the least.\" The slave girl was relieved when Isabella silently obeyed and sat back down. She didn't want to imagine trying to hunt with this pampered woman tagging along.</span></div></div>",
            "created":1548257160,
            "id":2606420,
            "title":"The Ruse"
        },
        "1111111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Alyssa takes them back for some kinky playing.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Amara crept back to the outskirts of town to grab some things. A bow, some arrows, a hunting knife. It was easier than she anticipated. Apparently the town was in chaos with the recent events surrounding Alyssa's escape and then perceived sacrifice acceptance. She was able to raid what she needed from the slave camp without anyone of authority noticing. As she exited back into the forest treeline she glanced back and witnessed a group of white robed people in a heated argument with guards. Alyssa seemed to be causing a rift in the upper classes and it made Amara smirk.<br>\r\n<br>\r\n She went about hunting and was able to flush out two large rabbits who her arrows both found easily. As she skinned and dressed the kills she cursed herself for not taking a horse when she was in town. She slung the rabbits over her shoulder and trudged back towards the cave. When Amara reached the cave entrance she glanced at the familiar huge footprints of her giant friend but then she stopped in her tracks. She saw the sunken earth where she had entered the cave and there was a new set of tracks leading away. Her eyes followed the sunken impressions that to the untrained eye would never have appeared to be footprints. No one would have ever imagined something could leave impressions so massive unless you knew there existed a mountain sized nine year old girl. They lead through the forest away from the cave, leaving a path of overturned trees and brush like a hurricane had landed and made it's mark. Turning back to the cave she shouted. \"Isabella?!\" She got no reply. She dropped the rabbits and took off down the path of destruction.<br>\r\n<br>\r\n Alyssa walked through the trees like they were tall grass, pushing aside some of the older taller trees as she did. In her cupped hand Isabella was watching the nonchalant destruction below with wondrous eyes. She leaned over the edge of the great hand and rested her hands on Alyssa's fingertips as she tried to see as far as she could from her elevated perch.<br>\r\n<br>\r\n \"See, Alyssa?\" She said as she pointed. \"Just there. At the tree's edge.\"<br>\r\n<br>\r\n Alyssa looked and saw a large lake. Smiling she trudged towards it. When she cleared the trees her feet came to rest on the edge of the water. Her immense foot falls sending ripples in the lake surface. Back at the cave, Alyssa had noted that her saliva had turned to a sticky residue all over poor Isabella. The small woman mentioned a lake she knew was not far. Alyssa decided it was worth the trip to let her wash off from being in her mouth. She felt it was the least she could do. Alyssa took a step into the lake, her foot sinking in to the ankle of the soft lake bed. Her other foot splashed down further out and she lifted her other to meet it as it crashed down next to it. Alyssa squatted down and lowered her hand holding Isabella until it was just submerged enough to allow her to begin rinsing off her dried spittle. Alyssa watched in silence as this tiny woman sat in her palm and washed her face and body. Isabella kept her sheer robes on as she bathed, not wanting to offend. But the material of the cloth was becoming practically transparent in the water as it clung to the tiny maiden. Alyssa wanted more than anything to help Isabella wash herself. Like a little doll. But she restrained herself thinking she would be insulting her to treat her as if she were a toy. So instead she sat and watched her with dinner plate eyes. The small brunette was scrubbing her tiny feet and toes. Alyssa's fingers curved closer and made contact with Isabella's slender back. The giant girl gulped as she gently rubbed her smooth skin. Isabella simply grinned up at her as she continued to wash away the sticky residue.<br>\r\n<br>\r\n \"I believe I am clean now, Alyssa.\" Isabella said in a sigh feeling refreshed as she leaned back against the giant fingers behind her. \"Thank you. I feel so much better.\"<br>\r\n<br>\r\n \"I'm glad.\" Alyssa said as she stood. Lifting Isabella along with her hand as water drained from her cupped palm back into the lake below.<br>\r\n<br>\r\n Alyssa walked back to shore and sat on the bank letting her toes remain in the cool water. She held Isabella as she watched her wring out her flowing robe. Alyssa lowered her hand down to her raised knees and tilted and Isabella slid off onto the plateau of her left knee. The tiny woman straightened her robe and smiled up at the giantess just as she was blasted with a long warm wind. Alyssa was blowing on her as if to dry her more quickly. She was leaned forward and slowly blowing on the tiny woman on her knee. Isabella was sitting still in shock as warm breath flowed over her, blowing back her long dark brown hair. When it subsided she regained her senses and was about to protest, or at the very least tell the young giant she didn't need to. She raised a hand up, but then another blast washed over her and she leaned back involuntarily as the warm air engulfed her entire body. Alyssa giggled as she watched the tiny maiden enjoy her blow drying, inhaling and then softly blowing again. Isabella was overcome with how amazing it felt on her wet body. She moaned a bit, catching herself as she tried to remain quiet. The giantess was surrounding her body in a torrent of lovely warm wind that was almost sensual.<br>\r\n<br>\r\n Alyssa sat admiring her ingenuity when she caught a glimpse of Isabella's light robe layers billowing up with her breath now that they were drier and not clinging to her little body. They were threatening to flutter up dangerously revealing areas little girls weren't meant to see. She looked at Isabella and she was too engrossed in the wind's sensation to notice. Alyssa angled a bit differently and blew, now trying to get the stubborn robes to flutter in her favor.<br>\r\n<br>\r\n Isabella was leaning back on her hands, small almost inaudible sighs and moans left her mouth. She had no control over them anymore. She was overcome with this completely new sensation washing over her. After each of Alyssa's exhales she opened her eyes to remind herself where this wonderful wind was coming from. The mouth of a cute gigantic young goddess of a girl. It was all overwhelming. It was like being blessed by one their old gods. The thought made her breathing become heavy with excitement. Meanwhile, Alyssa was trying her best to 'accidentally' cause Isabella's robes to fluff up just right. Her mouth was becoming dry from the anticipation. The last blast made the little folds flutter and she almost caught a flash of the naughty bits between Isabella's legs. But she did notice that the thin cloth covering the tiny maiden's breasts seemed to perk at two points a bit. Did that mean she was cold? But she thought her breath was warming her. She blew again and the robe flapped up and it happened. Alyssa saw a small patch of brunette hair. She almost choked on her breath as it surprised her.<br>\r\n<br>\r\n \"Giantess!\" A voice cried out angrily. Alyssa jumped in full on guilt, thinking Isabella caught what she was doing. But the voice came from below. Isabella also almost lost her balance up on Alyssa's knee. She took a second to snap back from the euphoric warm wind tunnel she was reveling in. Both giant and Lilliputian looked down at the ground and saw an irate Amara stomping through the downed forest of Alyssa's path. \"What in Lilliput do you think the two of you are doing?!\"<br>\r\n<br>\r\n \"What? Nothing!\" Alyssa blurted ashamed. \"I was just letting Isabella wash up. Why?\"<br>\r\n<br>\r\n \"Why?!\" Amara repeated astonished. \"The entire Lilliputian army is hunting you! That is why!\"<br>\r\n<br>\r\n \"No….\" Alyssa said, with all the bratty inflection of a child being reprimanded. \"Isabella says they are afraid of me.\"<br>\r\n<br>\r\n \"It is true.\" Isabella confirmed as she hastily straightened her robes. \"They will not pursue Alyssa. The majority of their numbers are not yet back from their assault on Blefuscu. The last attempt to harm Alyssa failed so miserably, the Queen dare not lose any of her forces should Alyssa ever decide to retaliate.\" Amara just threw her hands up in annoyance. \"Also…\" Isabella continued before Amara could speak. \"The Order I belonged to refuses to allow them to enter holy land. That being….. the cave.\" She suddenly realized they were no longer IN the cave and quieted, defeated by her own argument.<br>\r\n<br>\r\n \"What if they see you?\" Amara asked.<br>\r\n<br>\r\n \"Isabella just said…\" Alyssa started. Annoyance starting to emerge in her voice.<br>\r\n<br>\r\n \"Not YOU. You, I am certain, they could see from far away Blefuscu. YOU.\" Amara rebutted as she pointed to Isabella up on Alyssa's knee. \"They think the Giantess ate you, remember?!\" Both Isabella and Alyssa fell silent. Alyssa had tears of guilt forming. The tiny slave girl scolding her, as huge as she was, she still felt the need to obey her.<br>\r\n<br>\r\n \"I'm sorry, Amara.\" Alyssa said quietly as she wiped her damp cheek.<br>\r\n<br>\r\n Amara felt guilty having raised her voice the way she did. \"Alyssa…. I am sorry I yelled.\" Amara apologized as she approached the girl's huge hand resting on the ground. \"I just do not ever want you to be in danger.\" She knelt down and wrapped her arms around Alyssa's index finger making the giant girl smile.<br>\r\n<br>\r\n \"I know, Amara. I'll be more careful.\" Alyssa starting giggling. Amara and Isabella looked at her questioning. \"Amara…. she called me Alyssa.\" Amara's face turned red at her slip in etiquette.<br>\r\n<br>\r\n \"Careful, slave girl.\" Isabella said teasingly from up on her perch. \"You are in danger of relaxing.\" Alyssa laughed and Isabella practically fell from her knee.<br>\r\n<br>\r\n \"See what being bratty gets you?\" Amara laughed. Alyssa scooped up her two tiny friends and made her way back to their cave.</span></div></div>",
            "created":1548704340,
            "id":2608957,
            "title":"The Lake"
        },
        "11111111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Back in the capital city, the forces that remained to guard the city led by the Captain were relieved to see the remaining bulk of their forces return from the recent attempts to rally the outlying islands between Lilliput and Blefuscu to their side they had stubbornly remained neutral and refused to take part in the years long war. Matching up the road to the castle the impressive army was led by their general, Kassandra. Truth be told it wasn't the army the Captain was happy to see returning, but the general alone. He'd never admit it, of course…. being that she was a woman. But she was no average woman. She stood a good head and shoulders over most average height Lilliputians, and all men. Including the Captain. He almost never looked her straight in the eye, for disgust of having to crane his neck to do so. Something Kassandra would chastise him for out of lack of respect and protocol on his part.<br>\r\n<br>\r\n General Kassandra was an imposing sight even without the height advantage. She stood as a massive form in her Roman styled Lilliputian armor. It was golden with swaths of red fabric to show her ranking in the Queen's royal army. Many battles had been won under her short but impressive tour as their leader. Kassandra was almost the sole reason why Blefuscu's flag wasn't flying along the road they were marching to the castle. And now the Captain had to try and explain to her what had been happening in her absence. He swallowed hard and visible sweat was trickling down his brow. The Captain told General Kassandra of the giantess. The efforts they took to secure her and eventually eliminate her. All failures. Kassandra listened with an incredulous look on her face, half expecting this otherwise humorless droll man to be joking. She had seen disrupted earth on their way past the beach that she had thought odd. Then the Captain spoke of the sacrifice and Kassandra's face went pale. The Captain had never seen her look shaken before, even in the heat of battle. He explained how the woman was snatched up by the giantess and taken into the cave where she was surely devoured. Kassandra gripped the hilt of her gladius, her knuckles almost pale white from her iron grip. The look on her face transitioned from pale horror to unhinged rage. But she remained silent as the Captain continued. When he was finished she spun on her heels and stormed for the audience chamber doors.<br>\r\n<br>\r\n \"Hold! General…. What do you-….\" The Captain asked.<br>\r\n<br>\r\n \"I am heading for this... 'giantess' cave.\" Kassandra said behind gritting teeth that sounded more like a growl than words.<br>\r\n<br>\r\n \"Ser…. She is nigh invulnerable to even our heavy artillery.\" The Captain reminded her as he chased behind her.<br>\r\n<br>\r\n \"It eats.\" Kassandra said as she threw open the double doors.<br>\r\n<br>\r\n \"W-what?!\" The Captain asked.<br>\r\n<br>\r\n \"If it eats, it is mortal.\" Kassandra said as she mounted a steed.<br>\r\n<br>\r\n \"General, please listen to reason.\" Captain said, hoping his half-hearted attempt wasn't obvious. Actually her meeting her demise at the hands of the monster was to his favor.<br>\r\n<br>\r\n \"I go to slaughter this false god.\" Kassandra said, then hesitated as she checked her gear. \"Or…. this is where I finally meet my end.\" She sped down the road at full gallop.<br>\r\n<br>\r\n \"You!\" The Captain pointed to two of her guards. \"Go with her. We can not afford to lose her.\" The two looked at each other and saluted the Captain and raced after her.<br>\r\n<br>\r\n \"How are we supposed to stop her?\" One asked the other.<br>\r\n<br>\r\n \"I have no idea. But more to the point…. is there really a giant monster we ride to meet?\" The other answered. They slowed their pursuit. Just a little.</span></div></div>",
            "created":1551282000,
            "id":2623859,
            "title":"General Kassandra"
        },
        "111111111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>(Stupid chapter count limit.....)<br>\r\n<br>\r\n Back at the cave, Alyssa was sitting bored and playing with rocks that were in fact boulders. Amara and Isabella had left to gather wood for the fire. Amara was going to leave alone but Isabella insisted to help. When Alyssa pointed out that she could just snap a tree in half and bring it into the cave, Amara wasn't having any of it. The slave girl knew the wondrous giant could accomplish any task 100 times more efficiently, but she wanted to be as independent as her new found freedom allowed. And Isabella was eager to pull her own weight despite being perceived as a pampered rich woman. That left Alyssa alone and bored. The cave was a ways from the edge of the forest so it would be a bit before her little friends would return. She passed the time clinking boulders off the wall of the cave.<br>\r\n<br>\r\n General Kassandra approached the clearing outside the cavern as her eyes scanned for any movement. She could hear rolling crashes of rock from inside and her grip tightened on the horse's reigns. She dismounted and ducked behind cover as the two guards took position behind a good distance behind her. The looks on their faces were of complete terror hearing the crashes inside. Their imaginations ran wild with what could possibly be making such noises from inside the dark cavern. Kassandra's face, on the other hand, was one of pure hatred. The Captain's stories couldn't have possibly been true. A human the size of mountain was preposterous. But she'd seen the upturned trees on her way here. She'd seen what could only have been gigantic tracks of the monster's footprints in the earth. And she knew one virgin had already met her demise to it. The thought made her strong features tense with unbridled rage. She decided she would see this monstrosity face to face. She stood out from her hiding spot and took steps cautiously forward.<br>\r\n<br>\r\n \"Giantess!!\" She growled, as it echoed off the cavern walls. The crashing sounds came to a stop and the interior fell silent. \"Answer me you monster!!\" Kassandra was about to advance toward the cave when she felt the ground shudder beneath her feet. It took a moment for her to realize… it was footsteps. Inside the darkness of the cave a huge shadow was moving. A shadow that had difficulty fitting in the expansive entrance. Then a body and face began to come into the light. Kassandra's jaw dropped as she watched as a girl emerged from the cavern. A girl that was, in fact, as large as a mountain. From behind the general the two guards screamed and ran for further cover.<br>\r\n<br>\r\n Alyssa looked down and saw a woman in golden armor. She had long brunette hair that was braided down her shoulder. She wasn't sure but she seemed bigger than the average Lilliputian. \"Hello.\" Alyssa said as she came to a seated position on her knees in front of the tiny female soldier.<br>\r\n<br>\r\n Kassandra snapped out of her shock. Seeing Alyssa she could now imagine her tossing the virgin into her mouth like so much a candied treat. Her eyes almost went red with rage as she drew her sword and screamed a blood curdling battle cry. She ran for the nearest spot on her body she could reach and began clashing her gladius against her skin. Reason had left her. She knew deep down there was no way she could fell such a monster. Especially now that she saw her sword was just bouncing off as if she were striking steel. But she didn't care. If this was to be her legacy, to die here and now… so be it. What else was there for her anymore?<br>\r\n<br>\r\n Alyssa jerked back in shock witnessing this tiny person attacking her knee. She was of course immune to such a feeble attempt against her, but the normal little girl in her still flinched instinctively. \"Hey! What are you doing?!\" Alyssa asked. \"Stop that!\" Kassandra didn't even hear anything over the sound of metal against the flesh of an impenetrable god. \"Stop! You're gonna hurt yourself!\"<br>\r\n<br>\r\n Alyssa reached down her hand. Kassandra saw and spun around with her gladius out defensively. She swung wildly at Alyssa's massive fingers, connecting a couple times to no avail. Alyssa arched her index finger to her thumb and then flicked the sword out of Kassandra's hand, shocking the little warrior. The giant hand then wrapped around Kassandra as she was still faltering from being disarmed. The tiny general fought against the huge hand. She gripped the tip of Alyssa's thumb that crossed over her with both hands and pushed. Her muscles flexed every ounce she had and Alyssa's thumb nudged. Alyssa held the small woman in her fist, amazed. She could actually feel her resisting. Everyone else was so weak and tiny they were simply not even registered. But this amazing little woman was actually putting up a fight. Alyssa noticed the two guards standing frozen in fear as their glorious leader was being handled like a child's doll. The young giantess made a lunge for them and made a scary growl. They fell backwards before scrambling for their horses and sped away at top speed. Alyssa giggled and returned her attention to the little warrior woman in her hand. She opened her hand and allowed the small general to sit in her palm. Kassandra stood and swung her fists wildly at Alyssa's face as it hovered close so she could see her clearly.<br>\r\n<br>\r\n \"Settle down. You're gonna fall.\" Alyssa warned. She watched her stagger back and fall against her cupped fingers. Kassandra slumped to her knees exhausted. Not from exertion but from the futility of her attacks.<br>\r\n<br>\r\n \"Just kill me.\" Kassandra said as her head hung and she got on her hands and knees breathing heavily.<br>\r\n<br>\r\n \"W-what?!\" Alyssa stammered in shock.<br>\r\n<br>\r\n \"Eat me!\" Kassandra screamed as she rose her face to meet the giantess. \"Get it over with! I will not let you drag this out for your amusement, you vile monster!\"<br>\r\n<br>\r\n \"But I…. I'm not….\" Alyssa stuttered.<br>\r\n<br>\r\n Kassandra calmed herself and stood back up. She readjusted her armor with a calm determination before looking back up at this impossible beast of a girl. \"If you will not…. then I will not stop attacking you until you do.\" From a hidden strap on her inner thigh, Kassandra drew a secret dagger and dove for her thumb. She repeatedly drove the blade against the enormous digit trying to pierce the thick flesh of her captor. Alyssa was about to restrain her again when a voice from below halted both of their actions.<br>\r\n<br>\r\n \"Kassandra?!\" The voice was Isabella's. The two had returned from gathering wood and were standing frozen in confusion.<br>\r\n<br>\r\n The tiny general dropped her dagger and leaned over the edge of Alyssa's palm. \"I-…..Isabella?!\" Kassandra said. Uncommon to the general were the tears beginning to streak her face.</span></div></div>",
            "created":1551282780,
            "id":2623863,
            "title":"Kassandra vs Alyssa"
        },
        "1111111111111":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "choices":[
                "Reserved for my story.",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span> Isabella ran to Alyssa's knee and reached her arm up in the direction of the giant girl's hand above her. \"Please, Alyssa!\" Isabella pleaded. \"Do not hurt her!\"<br>\r\n<br>\r\n \"What? But, I'm not….\" Alyssa said confused. \"She attacked ME.\"<br>\r\n<br>\r\n \"Lower me this instant!\" Kassandra demanded. Alyssa looked unsure. She wasn't positive if she could trust this new person to not harm her friends. She seemed very violent.<br>\r\n<br>\r\n \"Please, Alyssa.\" Isabella pleaded.<br>\r\n<br>\r\n The young giantess trusted Isabella's judgement and began slowly lowering her hand. Before it lowered fully, Kassandra leaped to the ground, startling Alyssa. The little general and Isabella immediately embraced each other tightly. Isabella began weeping and Kassandra showed the hint of weakness in her usual stony facade.<br>\r\n<br>\r\n \"I thought I had lost you, Bella.\" Kassandra confessed.<br>\r\n<br>\r\n Amara recognized the infamous general of the Lilliputian army. Even if you'd never actually seen her before, no one was mistaking a woman of such stature. Isabella was your average height for a young woman, and she barely came up to Kassandra's breasts that were molded into her armor. Were they not held back by bronze she was sure they'd be comically resting atop Isabella's head.<br>\r\n<br>\r\n Kassandra, as if suddenly remembering the giant girl behind her, released Isabella and turned to face the giantess. She stood between the diminutive maiden and the giant girl as she moved them both back away from Alyssa. Amara, sensing the growing tension, stepped up with her hands up. \"Hold a moment everyone. Alyssa, do nothing rash….\" Amara said.<br>\r\n<br>\r\n Alyssa huffed and threw her hands up in disgust. \"I didn't do anything!\" The huge girl insisted.<br>\r\n<br>\r\n Kassandra continued to move backwards, picking up her discarded gladius and holding it up, pointed at Alyssa. \"We are leaving.\" Kassandra said. She felt sudden opposition from behind. Isabella was standing firm.<br>\r\n<br>\r\n \"No.\" Was all she said.<br>\r\n<br>\r\n Kassandra turned, her face showing how infrequently she was denied. \"Yes.\" Kassandra growled.<br>\r\n<br>\r\n \"I'm staying.\" Isabella stepped to the side and crossed her arms defiantly.<br>\r\n<br>\r\n \"What?!\" Kassandra fully turned her back to Alyssa towards this new obstacle. \"Bella….\"<br>\r\n<br>\r\n \"No, Kassie.\" Isabella defied her. \"You do not know the full story here.\"<br>\r\n<br>\r\n Kassandra stood closer to her allowing her immense stature to push her argument forward. \"What is to know?!\" She asked. \"I am saving you from this monster.\"<br>\r\n<br>\r\n \"Hey!\" Alyssa said annoyed.<br>\r\n<br>\r\n \"No, Kassie.\" Isabella said as she leaned in to explain. \"Alyssa…\" she motioned up to the giant young girl behind Kassandra, who turned and looked up at her warily. \"Your 'monster' saved me.\"<br>\r\n<br>\r\n Kassandra jerked her head back to Isabella confused now. \"Have you lost what common sense you possessed?!\" Kassandra said, grabbing the small woman's arms trying to snap her out of her delusion. <br>\r\n<br>\r\n \"Um.... let me explain.\" Amara, after introductions, and Isabella both explained what brought them all together. The entire long story Kassandra just kept her eyes on Alyssa, who sat fidgeting under such a steely stare. When they finished they both expected the general to still insist to leave. They all sat in silence waiting for some reaction from Kassandra.<br>\r\n<br>\r\n \"Well?!\" Isabella blurted finally.<br>\r\n<br>\r\n Kassandra lowered her stare from Alyssa and down to her sandaled feet. She shook her head. \"How could you be so naive, Bella?\" She finally spoke. \"I told you those fanatical zealots could not be trusted. I could drag you from this crazy situation, kicking and screaming like the spoiled brat that you are the entire way, I am sure.\" Isabella just huffed and crossed her arms. \"But as much loyalty as I have with the royal council members and army…. these cultists hold far more.\" Kassandra threw the gladius still in her hand into the dirt in disgust. \"You are stuck with this ruse. And now I am part of it, as well.\" Kassandra looked back up to Alyssa. \"I thank you, giantess… for saving this spoiled brat. Although I almost wish you had eaten her now.\"<br>\r\n<br>\r\n \"Ewww…\" Alyssa laughed. Just glad everything calmed down again.<br>\r\n<br>\r\n Kassandra just stood taking in the enormity of this young girl. That's what she was, now that she was calm and understanding what was what. Hardly the fearsome monster she was told. Kassandra had to think all this could have been avoided had that incompetent worm of a captain had just gone into this whole thing with a level head. His brash, often imbecilic, judgement calls were the entire reason he was left to babysit the royal throne while Kassandra was away. Kassandra shook her head and laughed. The others looked at her. \"I am not used to looking up at people. Let alone a child.\" Kassandra confessed. \"You are truly amazing, young lady.\" Alyssa blushed and nudged the tiny general with her finger. Kassandra fell backwards on her heels. Another feat not easily accomplished, and this child did it with one enormous fingertip. She wasn't accustomed to such unbridled power. She wasn't positive if she felt intimidated…. or enamored. Maybe both.<br>\r\n<br>\r\n \"So, you two appear to know one another well.\" Amara stated as the two were rather close to each other's side. They immediately separated.<br>\r\n<br>\r\n \"Yes, we…\" Kassandra started.<br>\r\n<br>\r\n \"We are lovers!\" Isabella blurted as she threw her arms around the statuesque woman. Kassandra sighed and shook her head. \"What? I truly believe we are beyond secrets here.\" Isabella said as she giggled. Alyssa didn't understand. The secrecy or, honestly, the girl girl thing either. Amara, completely shocked by the revelation, understood the secrecy, though.<br>\r\n<br>\r\n \"We are…. lovers, yes.\" Kassandra admitted as she was assaulted by the diminutive maiden's gushing hugs at her confession. \"I may be something of a…. revered leader.\"<br>\r\n<br>\r\n \"A hero!\" Isabella corrected, grinning. Kassandra just grunted in disapproval over titles.<br>\r\n<br>\r\n \"At any rate,\" Kassandra continued. \"this spoiled brat is of a much higher social class. I was born of simple farm people. Bella was born of a long line of aristocracy. It is frowned upon for me to even be seen with her cordially.\"<br>\r\n<br>\r\n Isabella made a very un-ladylike sound with her mouth. \"I don't care for any of that nonsense.\" She said.<br>\r\n<br>\r\n \"Says the one who would simply be denied another palace for her birthday if they found out.\" Kassandra said. \"I, on the other hand….\"<br>\r\n<br>\r\n \"What?\" Alyssa asked. \"What would happen to you?\"<br>\r\n<br>\r\n Kassandra just laughed. \"I would probably be a bit shorter.\" She motioned with her hand across her neck. \"Or longer. Depending on how they decided to punish me.\" She looked up at Alyssa who was clearly shocked at the answer. Kassandra pantomimed a rope around her neck and made a funny face to her with her tongue stuck out in mock death throes.<br>\r\n<br>\r\n \"That's horrible!\" Alyssa exclaimed. She was clearly distraught by the notion of a penalty so sever just for liking someone. \"If I was in charge that would be first thing to go.\"<br>\r\n<br>\r\n Kassandra smiled up to her. Her smile faded to seriousness as she contemplated a world Alyssa would change for the better. \"I believe you could, Alyssa.\" Kassandra said, smiling. \"Alyssa the Great!\" They all laughed. Except Kassandra. They found humor in this sweet giant girl being a dominating conqueror. Kassandra saw a opportunity.</span></div></div>",
            "created":1551283860,
            "id":2623868,
            "title":"Reunited "
        },
        "11111111112":{
            "author_id":"gulliverstoy",
            "author_name":"gulliverstoy",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> That's just lazy writing. Try again.</span></div></span></div>",
            "created":1548704460,
            "id":2608960,
            "title":"Alyssa takes them back for some kinky playing."
        },
        "1112":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Agree to be our weapon against our enemy",
                "Leave this village and never show your face again along with Amara",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>Alyssa then decided for now that for the best that she should just rest out her trouble. Because there was really no use in fighting this whole battle that she might not be able to possibly win. Even though she was really big, the tinies were really well prepared for the giantess, and had tied her up very well. Her friend couldn’t really be out there for long as she was part of a slave camp, so it was understandable that she had to go straight back. For now, Alyssa decided to sleep through the night, hopefully something good can come out of a sleep.<br>\r\n<br>\r\nThe next morning after Alyssa woke up, she sees all the soldiers around the area again, weapons and everything, and also the Captain and the Queen. There was a very angry look this time on the Queen, and an even more enraged look at the Captain as well. Alyssa then gulped, as this cannot be good at all. What was even more horrifying is that there was Amara also there, being held by the soldiers there, and at blade point as well. Did she got caught helping Alyssa trying to escape, or what not? That really cannot be good.<br>\r\n<br>\r\n“Well, it seems you had someone try to free you, is this true?” The Queen asked, now angered.<br>\r\n<br>\r\n“No, not really.” Alyssa gulped, and then saw Amara. “BTW, what are you doing to her?”<br>\r\n<br>\r\n“So now you care about the slave now. We caught her as she made her way out, and found out that she sneak in to try to free you.” The captain then revealed to her, and then they bring the girl right up to the captain. “Do you have any idea what could have done to this village?”<br>\r\n<br>\r\n“It didn’t matter, you had her all tied up pretty well. Besides, y’all weren’t showing any sypmhanty at all!” Amara then growled right at the captain and the queen. “And yes, it is true I tried to free her, because what if what you are saying is true, and this girl is in fact lost?”<br>\r\n<br>\r\n“LIES!!!!!” Captain then shouted just as she slaps Amara in the face. This leaves Alyssa completely scared and horrified, and that kindness that the queen had show for her was now gone. “And of all things a slave showing kindness to this foul beast before us, that is even worse than a simple disobedience. I should have you hanged for this... but no matter... The Queen likes to have a word with you.”<br>\r\n<br>\r\n“Okay.... so... Queen... what do you want out of me?” Alyssa asked, now pleading for mercy. “Anything that can spare my friend over there.”<br>\r\n<br>\r\n“Oh, so you show kindness to her, well then... perhaps I could put someone like you to good use, or just let you leave with this girl in a exile, and showing your face again would result in your death. Or... perhaps I might have some use myself for you. I will let you pick. You could agree to help us in an ongoing war with our neighbors, or just leave the village with this slave, never to be seen again. But if you are curious to hear my last offer, I could tell you.”</span></div></div>",
            "created":1546923600,
            "id":2600894,
            "title":"An Offer"
        },
        "12":{
            "author_id":"doodad",
            "author_name":"smallprint",
            "choices":[
                "Caelia, curious, sisterly, and wanting to chat",
                "Paulus, also curious, and thinks Alyssa is kind off cute.",
                "Empress Aemilia, awestruck and actually quite intrigued.",
                "Caius, begging Alyssa to behave for both of their live's sake.",
                "Someone she didn't knew (yet)."
            ],
            "content":"<div class=\"\"><div> <span>A few hours went by, the sun was starting to set, having dried her tears long ago.<br>\r\nWherever the soldier came from must either be a long distance (or long distance for ... er... thumb people?), or maybe they weren't planning to return.<br>\r\nWhile thankful for no longer being baked in the burning daylight, Alyssa was now starting to get cold.<br>\r\nThe temperature of wherever she was was tropical, but with the evening came a cold breeze and the tide came in, washing up against her side.<br>\r\nThen came the good news.<br>\r\nThe crashing of the inch \"high\" waves on the coast was loosening the pins holding the ropes down.<br>\r\nA few minutes in, she could move her hand up and down.<br>\r\nA few moments later, she had managed to pry loose her entire right arm.<br>\r\nAfter that, it didn't take too long for Alyssa to free herself entirely, moving inland a little, she sat down to catch her breath.<br>\r\n\"WHOO!\" she cheered, happy to be free and moving again.<br>\r\nShe was about to stand up and move inland, when she noticed she wasn't alone anymore, shifting around, she faced her company.<br>\r\n<br>\r\nThe soldier from before was back. Now riding a teeny tiny horse. And he was not alone.<br>\r\nWith him was a big (in numbers) army, looking a lot like the drawings from the Roman empire from the history books.<br>\r\nAll the soldiers, having seen the \"giant\" free herself from their best bindings, were obviously nervous and a little scared, some squadrons slowly backing up, even.<br>\r\nThey were armed, but didn't look like they were expecting a fight.<br>\r\nEven in the diminishing light and size difference, Alyssa could see the soldier form before was just as afraid, but instead goaded his horse to move in closer.<br>\r\nHe stopped only an couple of inches near her thigh.<br>\r\nAlyssa thought the soldier was being brave for getting so close, then thought about how this inches would be a couple of yards for the tiny soldier, who, from his point of view, might be keeping his distance.<br>\r\nHe spoke up.<br>\r\n<br>\r\n\"MONSTER!\" he was yelling. Despite the size difference, Alyssa could hear him just fine. He didn't sound loud or intimidating, but it was like someone yelling through a phone; just not necessary.<br>\r\n\"My name is Alyssa.\" She corrected him, causing the thumbling to recoil a little. \"And you don't need to yell.\"<br>\r\nThe tiny soldier hesitated. No longer shouting, but still talking loudly, he continued, a little intimidated by Alyssa, but carrying himself proudly.<br>\r\n\"A- Alyssa. The Imperial family has granted you an audience; a chance to explain yourself an- and prove you mean no harm to the Empire of Lilliput!\"<br>\r\nAlyssa thought about it. It wasn't like she knew where she was. And even if she did, she couldn't just swim across the ocean to get home.<br>\r\nShe was also thirsty, cold, and tired.<br>\r\n\"Show me the way, bring me to your leader.\" she answered.<br>\r\nThe soldier was quiet, surprised the monster would agree that easy. She heard some murmuring in the army.<br>\r\n\"All right... F-follow us...\" the soldier guided the horse around, and hesitantly signaled Alyssa to follow.<br>\r\nAs the girl stood up to her full height, she saw some horses run wild and soldiers panic. This got worse when she actually started walking.<br>\r\nWhile she felt bad, she did think it funny that she, a nine year old girl who was a little short for her age, was that scary to them.<br>\r\n<br>\r\nWhat Alyssa didn't expect, was the soldier stopping by some encampment less than a couple of yards, to Alyssa, inland.<br>\r\nShe could see some wooden towers on wheels with seemingly improvised cranes built on top. Were they planning on carrying her?<br>\r\nMost of the tents, small and smaller, were plain and boring, and as Alyssa approached, soldiers and poorer dressed others (servants?) came looking outside, only to panic at the giant approaching their camp.<br>\r\nAmong the few wooden buildings, Alyssa saw somethings she recognized: water towers.<br>\r\nStill parched, Alyssa put up a little jog, unwittingly causing major tremors for the tiny army around her, and picked them up, one by one pulling off the roof like it was a lid and downing the ounce-fulls of water.<br>\r\n<br>\r\nFeeling a little better, Alyssa returned her attention on the camp. By this point, people were panicking and running around.<br>\r\nA number of soldiers had started pointing crossbow-like siege weapons at her, the soldier from before actually trying to talk them down.<br>\r\nIn the center of the camp, Alyssa could see a larger, fancy, purple tent.<br>\r\nOutside of the purple tent, there was what looked like a family in fancy clothes, surrounded by soldiers in black, decorated armor.<br>\r\nShe assumed this was the imperial family the soldier had talked about, and decided to move closer and introduce herself.<br>\r\nAlyssa tiptoed through the widest of the narrow pathways of the camp, apologizing to the tiny people for the inconvenience, which traded a lot of the blind panic for uneasiness and mild confusion.<br>\r\nEventually, miraculously having managed to not wreck anything, she squatted down, waved and introduced herself.<br>\r\n<br>\r\n\"Hi there, I'm Alyssa! Nice to meet you!\" it was a little rude to speak to royalty like that, but they were just so non-threatening, she only realized when they fell silent.<br>\r\n\"Hi, I'm Caelia.\" A girl of about 15, a princess, Alyssa assumed, spoke back, waving at the giant, together with who she figured was her brother, about 10, \"I'm Paulus.\" he said. Neither sounded scared, which was a welcome change.<br>\r\nThe two averted their eyes, however, when the fancy dressed middle aged man, presumably their father, turned to them, not amused.<br>\r\n\"CAIUS!\" the man then yelled.<br>\r\nThe soldier who had so far spoken and escorted Alyssa approached, took his helm in one hand, and knelt down in front of the man. \"Yes, my liege.\"<br>\r\n\"Why is it here!\" (it?!) the emperor spoke. \"Why is it free?!\"<br>\r\n\"The ocean herself loosened the bindings, lord Drusus. By the time we got close, the giant had already cast off her bonds.\" the soldier answered, head still down. \"But she agreed an to audience with your highness.\"<br>\r\nThe emperor sighed in frustration, took a deep breath and resumed.<br>\r\n\"Dismissed, Caius. But this rests on you.\" the soldier nodded (impressive, with his had already hanging low), turned around, stood up and walked away.<br>\r\n\"You there, giant!\" the emperor had turned (up) to Alyssa. \"I am Drusus Aelius Donicus, grand commander of the legion, and emperor of Lilliput.\" the emperor didn't seem scared either, and seemed to try and intimidate Alyssa instead. \"These are my children, Caelia, my first born, and Paulus, heir to the throne.\" both smiled and waved at Alyssa when mentioned, their father too distracted to reprimand them this time \"And my wife, empress Aemilia Dolabella, fairest in all the lands!\" the little emperor had stuck out his chest in an attempt to look bigger. \"I rule the land before you, and command all it's people. My word is law.\"<br>\r\nBy now, Alyssa was trying hard not to laugh at the display of power by a person no bigger than her thumb, but her efforts were too obvious to the tiny people below, to the point that the imperial family (barring the increasingly angry emperor), many of the imperial guards, and most soldiers had started laughing themselves, even if quietly, in fear of their emperor.<br>\r\n\"Now you explain yourself.\" he finished, face red with indignation.<br>\r\n<br>\r\nTaking a little time to calm down and not burst into laughter, Alyssa told her story, trying to dumb it down a little, since the tiny people didn't seem to have electricity or anything; her family, the ship, the storm, trying to help her mother, getting caught in the waves, and washing up here, in Lilliput.<br>\r\nBy the time she was done, it was properly dark, the tiny lamps and torches of the Lilliputians not doing a whole lot for Alyssa, though without the ocean wind she wasn't <i>that</i> cold. Maybe she could ask the Lilliputians to make her some clothes... She was also starting to get hungry, which could be a bigger problem.<br>\r\nShe had sat down cross legged, some tents had to be moved just for that, more were being removed still.<br>\r\nFrom the corner of her eyes, she could see squares of cloth, actually empty tents, being put down to make a bed, and some more being sown together to make a simple blanket.<br>\r\nIt was getting late. Unwillingly, she yawned.<br>\r\n<br>\r\n\"Well then-\" \"Can we stop?\" Alyssa cut off the emperor, who was at a loss for words by someone who dared talking back to him.<br>\r\n\"It's getting dark, we'll talk tomorrow.\" she wasn't trying to sound intimidating, but to the Lilliputians this must've been less a suggestions, more a command.<br>\r\n\"It is getting rather late, dear.\" This was the first time Alyssa heard the empress speak. She sounded disinterested. At everything.<br>\r\nThe emperor mumbled something, but apparently he agreed, as the site started to clear out.<br>\r\n<br>\r\nA large number of what Alyssa started to suspect were slaves moved closer and handed her the improvised blanket, quickly retreating after she accepted it.<br>\r\nLooking at what was going to be her bed for tonight, the tiny folk did seem very industrious. Maybe they really could make her some clothes.<br>\r\nA basic dress shouldn't be that difficult, she thought to herself. Or at least something more covering than her swimwear.<br>\r\nShe nestled in, as gentle as possible. She felt some of the ground give as she lied down, and even in the dim light she could see some of her foot prints from earlier, and her butt print from sitting down, telling the story. She really was a giant around here.<br>\r\nShe crawled under the \"covers\". They weren't that warm, but they were really soft to her, despite being fairly course cloth for the Lilliputians.<br>\r\nThe ground giving under her like a mattress, and the sheet surprisingly comfortable, all she missed was a pillow...<br>\r\n<br>\r\nAlyssa couldn't sleep, though. She was exhausted, but not tired; she'd been lying down all day by now.<br>\r\nSomeone else couldn't sleep, either.</span></div></div>",
            "created":1540789200,
            "id":2570327,
            "title":"Unconventional Audience"
        },
        "123":{
            "choices":[
                "Empress Aemilia Dolabella starts talking first.",
                "Alyssa whispers to the empress Aemilia Dolabella.",
                "They make plans to meet somewhere."
            ],
            "content":"<div class=\"\"><div> <span>Along with Alyssa being sleepless, the  Empress Aemilia was equally struggling with any kind rest.<br>\r\n<br>\r\n Empress Aemilia's mind was consumed by the young giantess, all alone on the course sand.<br>\r\nHer heart went out to the young giantess, along with her curiosity of how and why she had washed up on their shore.<br>\r\n Empress Aemilia, had always admired the soft look of women in general, the sweet scent of their natural body and she imagined how the giant young girl would feel and smell.<br>\r\n<br>\r\nThese thoughts alone was enough to deprive her of any possibility of sleep this night, although she did love her king and husband  emperor Drusus Aelius Donicus, she was more excited by the young giant.<br>\r\nEmpress Aemilia Dolabella's thoughts had wandered to the young girl asleep on the beach \" I wonder if I snuck out of the castle and down to the beach, if the young giant would agree to my visit ?\"<br>\r\nStruggling with the thoughts in her head, she finally decided to just go down to the beach and look at the sleeping giantess.<br>\r\n<br>\r\nCreeping out of her plush king size bed, careful not to wake her husband up, she threw on only a royal robe on herself and slipped out a secret passageway that only the King and herself ever knew about, exiting outside of the castle, the empress Aemilia Dolabella, was able to make it to the tree line without being observed.<br>\r\nWithin only a few minutes she was on a path that led straight down to the beach where the young giantess was sleeping.<br>\r\nNow standing just within the tree line staring at the sleeping young girl, the empress Aemilia Dolabella found herself breathing harder and more rapidly, looking about the sleeping giantess she saw a number of soldiers on watch duty, although they had all congregated about the giant girls small feet, they had even built a small fire to stave off the nights slight chill.<br>\r\n<br>\r\nNow thinking to herself out loud and to herself \" This is my chance, I believe that I could make it to her giant head and tuck under her long blonde hair\" as she set out on a quiet yet speedy sprint towards the young giant's head.<br>\r\nMaking it there undetected, the empress Aemilia Dolabella was equally startled when right before she was going to duck inside the young girls hair, the young girl shifted her body towards the empress Aemilia Dolabella and with wide eyes and an open mouth, she was beginning to speak until empress Aemilia Dolabella, shushed her with her lips and finger, the young giant shook her head yes and lay still.<br>\r\nEmpress Aemilia Dolabella made a straight line to her ear and tucked under her long hair, as both girls remain in hush tones, they speak about .........</span></div></div>",
            "created":1547227440,
            "id":2602115,
            "title":"Empress Aemilia, awestruck and actually quite i..."
        },
        "1231":{
            "choices":[
                "The Empress word comes in the form of a slave girl.",
                "Readers Choice",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>Empress Aemilia Dolabella was safely tucked away behind Alyssa's long blonde hair and right up almost inside her ear, the Empress spoke first \" Please young giant hear me out ... I mean you no harm at all, and after some talk to my husband, the King ... He will also do you No harm, he is just scared .... we have never had a Giant right here in Lilliput, let alone a 'Giant Young Girl' ( As Alyssa could hear a different tone in the Empress's voice) as the Empress stroked Alyssa's ear...<br>\r\n<br>\r\n \" Th...tha ...Thank you Empress for your kind and reassuring words, but I don't feel very safe here at all.<br>\r\nLeaning even more in towards Alyssa's ear the Empress told her \" I would really like to spend more time with you sometime soon to get to know you \" as she once again stroked the young girls ear, \" I will send you word of where and when we should meet\" as the Empress Aemilia Dolabella took a few steps outside of Alyssa's hair and looked for the guards, seeing them still at the bottom of the giant girls feet, the Empress Aemilia Dolabella  now stood in front of Alyssa's face in the sand and Alyssa noticed that the Empress's royal Robe had all but come undone.<br>\r\nStanding there in front of the giant's eyes, the Empress said in a hushed tone \" until we meet again young giant\" and smiled and bowed.<br>\r\nAlyssa was stunned as she could see the Empress's long slender legs sticking out of the luxurious robe along with the open view of almost all of her cleavage  ... Giggled and smiled once again at Alyssa and ran back in the direction of the trees , leaving Alyssa laying there with many thoughts of the Empress, which made her smile and blush .</span></div></div>",
            "created":1547944620,
            "id":2604983,
            "title":"Empress Aemilia Dolabella starts talking first."
        },
        "12312":{
            "choices":[
                "The meeting takes place in an open field.",
                "The meeting takes place in the near open Cave.",
                "More Ideas "
            ],
            "content":"<div class=\"\"><div> <span>Empress Aemilia had safely made it back to her secret passage and had gone back to her bedroom and disrobed, and just as she had lay back down in their king size bed, her husband Emperor Drusus Aelius Donicus had woken up \" Aemilia what are you doing up ? Are you okay my wife ?\"<br>\r\n<br>\r\n\" Oh Husband, I had the most wonderful Vision in my sleep, the young Giantess came to me in a vision and I believe she means us no harm, in fact I had seen in my vision, the young Giantess living among us in peace, and she would protect us from our enemies \" as Aemilia leaned in and kissed her husband and ran her soft hand down his warm torso, letting her hand linger just above the Emperor's rapidly growing Royal penis...<br>\r\n<br>\r\nHer husband Emperor Drusus Aelius Donicus began to protest but quickly was silenced as Aemilia's hand gripped his now fully engorged penis, \" Dear Husband, BELIEVE IN ME and let me speak to the Giantess in a safe and secure location, the Gods will protect me from any harm, I am SURE of that \" .<br>\r\n<br>\r\n .... and so after an early morning and very exhausting love making, the Emperor Drusus Aelius Donicus had agreed to a meeting with the young Giantess and his lovely wife Aemilia , against his better judgment.<br>\r\n<br>\r\n\" Thank you my King for believing in Me, send word for her to be allowed to meet me privately and have No One follow us, I will prove to you my husband that my vision and our might and victory over all else will prevail. \" as the beautiful Empress Aemilia, heads off to bathe and gather herself up in her finest garments, yet the lingering urge and desire of the young giantess's touch encompassed her mind.</span></div></div>",
            "created":1567335420,
            "id":2711637,
            "title":"Empress Aemilia's Vision ..."
        },
        "123122":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Empress Aemilia begins upwards",
                "Empress Aemilia begins downwards",
                "Empress Aemilia disrobes herself",
                "More ideas"
            ],
            "content":"<div class=\"\"><div> <span>… And so it was decided that the Empress Aemilia would have a private meeting with the giant nine year old Alyssa and it would be on the outskirts of town near an open cave , once both Alyssa and Empress Aemilia were alone, Empress Aemilia suggested that they delve deeper inside of the cave to make sure that they would be alone and in private conversation.<br>\r\n<br>\r\nAlyssa happily picked up Empress Aemilia and walked deeper inside of the cave, Empress Aemilia had butterflies inside of her stomach , she felt like a little girl again and several places in her body had a very warm feeling just being held by the young giantess.<br>\r\n<br>\r\nOnce they were completely alone, Alyssa brought Empress Aemilia up to her lips and gave the beautiful small woman a kiss and thanking her for their private meeting and for getting her off the cold ground, Empress Aemilia smiled and said \" Honey I never wanted anything bad to happen to you, in fact I really like you … REALLY LIKE YOU  !<br>\r\n<br>\r\nThey discussed the plans of convincing the king that Alyssa would protect Empress Aemilia's people and then they wanted to discuss themselves, \" Alyssa... I would very much like to explore your giant body if that's okay with you ?\" <br>\r\nAlyssa just giggled and placed Empress Aemilia on the ground in front of her as she took off the modest clothing and layed down and placed Empress Aemilia on her belly saying \" Explore away my lady, my body is yours for helping me \" .<br>\r\n<br>\r\n</span></div></div>",
            "created":1592130000,
            "id":2851048,
            "title":"The meeting takes place in the near open Cave."
        },
        "13":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "We actually help Littlput as their servants",
                "We actually terrorize Littlput as monsters",
                "We rule Littlput as goddesses (Good)",
                "We rule Littlput as goddesses (Bad)",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>A few hours then soon passes by since Alyssa has landed onto the island, wearing nothing but her two piece bikini outfit that she was wearing, and soon she then wakes up. Alyssa felt more free as this time she wasn’t tied at all to anything as she was able to wave her hands into the air without any problems. Her eyes then begin to adjust as she takes in the blind sunlight as she begins to see 3 people looking down right at her. She then gulped and gasped as she takes in the sight of the strangers, thinking they might do harm to her.<br>\r\n<br>\r\n“Who, who are you, I don’t want any trouble?” Alyssa panicked just as she ties to back away by moving her freed feet.<br>\r\n<br>\r\n“No, there is no trouble at all.” One of them said, and it sounded like a very young girl around the age of 7. She has totally black hair that was medium in length and was wearing a two-piece pink bikini outfit. Her skin was also pale and had green eyes. “My name is Koyuki, but everyone here calls me Koyukizilla.” She giggled just as she helps Alyssa up.<br>\r\n<br>\r\n“That is true my friend, they call us monsters around here for some funny reason. But call me Haruka, or as they call me, Harukagon, or Harukazilla.” Haruka then said, and then the girl revealed to be a girl around the age of 10, wearing a blue bikini, and had brown hair and blue eyes. Also look quite attractive for a girl her age, with a slim look.<br>\r\n<br>\r\n“And I am the leader of this group before you, Soyumi.” Soyumi then said, another black hair girl who looks asian, and was 11 year in appearance, wearing a white bikini, with orange eyes. “We and more girls like you live on Littlput here, and we are pretty well known here. That soldier that came out to visit you, he is always a jerk around here, but here....”<br>\r\n<br>\r\nWhat is the giantesses roles? Alyssa will learn it.</span></div></div>",
            "created":1553525940,
            "id":2634615,
            "title":"Freed At Last"
        }
    },
    "info":{
        "author_id":"gulliverstoy",
        "author_name":"gulliverstoy",
        "brief_description":"Young Alyssa gets stranded in Lilliput",
        "created":1540221600,
        "description":"<td align=\"left\" class=\"norm\"> Nine year old Alyssa, while vacationing with her family, their boat is caught in a horrible storm. Thrown from the boat and clinging to debris, she somehow survives. When she wakes she's stranded on the Lilliputian beach, she realizes she's been tied down by people no bigger than her thumb. Alone, separated from her family, and viewed by the tiny people as a monster sent to destroy them.... will she ever find anyone willing to help her? Or will she simply decide she's had enough and conquer them?<br>\r\n<br>\r\n(I tried a story somewhat similar once before with a boy, but it never really went anywhere. I'm here to try it again, mostly because I love the idea of a land of tiny people.... hence my name. LOL But I'm going to try a completely different approach this time. Hopefully it grows into a bigger story. Feel free to add whatever you want. I just ask that you leave the branches labeled \"Reserved for my story\" for me....)</td>",
        "id":2172658,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1592130000,
        "modified":1592130000,
        "pretty_title":"Young Gullivera"
    }
}