{
    "chapters":{
        "1":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck",
                "Captain Awesome",
                "Colnel Casey",
                "Morgan Grimes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be the foot slave?</span></div></span></div>",
            "created":1277182800,
            "id":904200,
            "title":"Aaaaaaaaand GO1"
        },
        "11":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Captain Awesome",
                "Colnel Casey ",
                "Morgan Grimes ",
                "Big Mike",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's feet will Chuck worship?</span></div></span></div>",
            "created":1277182800,
            "id":904205,
            "title":"Chuck"
        },
        "111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "I'll stay the night, in your bed.\"",
                "You could have Morgan do the other.\"",
                "Just continue"
            ],
            "content":"<div class=\"\"><div> <span>There was a knock at the door and went to check it out. He cautiously looked through the peephole to see Devon.  He opened the door.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://3.bp.blogspot.com/_lLsdaCVk3Kk/R6jgNT-jF8I/AAAAAAAALbY/ovHom8ugBpA/s1600/RyanMcpartlin34.jpg\" target=\"_blank\">http://3.bp.blogspot.com/_lLsdaCVk3Kk/R6...</a><br>\r\n<br>\r\n\"Hey Chuck, you wanna hang out? Ellie's out on a late shift with the hospital and I was wondering if we could hang out or something...\" Devon asked, with his regular cute hesitency.<br>\r\n\"uh...um... Sure Devon. Why not!\" chuck replied.<br>\r\n   Devon walked in but chuck stopped him.<br>\r\n\"shoes, no shoes past here.\" chuck said pointing at the rug.<br>\r\n\"uh, sure.\" Devon said, taking off his huge size 14's. Chuck almost drooled at the scent and smell of Devon's entrancing feet.  Apparently it had been more than enough staring at his feet because Devon started to ask,<br>\r\n   \"uh, Chuck, are you okay? You've been staring at my feet a d drooling for about ten seconds now. Are you okay or are my feet too stinky?\" he asked.<br>\r\n\"no!\" chuck almost yelled in his trance, \" I love it, and the feet themselves aren't too shabby either!\"<br>\r\n  Devon was taken aback and asked, <br>\r\n   \"Do you have a foot fetish Chuck?\"<br>\r\n\"um, yes, sorry if I stared too long.\"<br>\r\n   \"no, I welcome it,\" he said. \" how about we start a movie and you can do whatever you want to my feet and...   </span></div></div>",
            "created":1277182800,
            "id":904223,
            "title":"Captain Awesome"
        },
        "1111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lick and suck on his bare feet first",
                "Pick a costume",
                "Who has time for a costume!"
            ],
            "content":"<div class=\"\"><div> <span>   \"no, I welcome it,\" he said. \" how about we start a movie and you can do whatever you want to my feet and I can stay the night. In your bed.\" Devon smiled. Chuck just awkwardly smiled as Devon turned on the tv and swinging massive feet up onto Chucks lap. Chuck could tell, even through the gold toed docks that his Size 14's were perfect just like the rest of him. Chuck massaged Awesome while the opening credits rolled. Awesome was staring at  the tv screen, silently gasping and moaning at Chucks massage. Soon enough chuck decided he just had to get a whiff of Awesomes feet up close and personal. So he lifted them both up and pressed his face into the large pile of sweaty fabric, inhaling loudly, this sound for whatever reason got Devon very hot. He stared at chuck whose face was just drinking up his manly foot scent. Devon wiggled is toes and cupped chucks face with his feet so his heels were cupping his chin, forcing him to stare at his Captain Awesome as he shed his shirt slowly, revealing another reason why Devon was Chuck's perfect man. Chuck moaned. <br>\r\n          \"While we're on a bit of a roll with you being okay with all this I was wondering. If we could have some fun playing characters like you being a Greek god or you can wear your Adam costume with the little leaf.\" <br>\r\n          \"sure buddy just tell me what to be and I'll grab the costume.\" </span></div></div>",
            "created":1384446960,
            "id":1694155,
            "title":"I'll stay the night, in your bed.\""
        },
        "1112":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Star Wars- Shirtless Devon gives foot job to one and one worships caps pecs",
                "Lord of The Rings- Take turns Rimming Captain Awesome and licking his feet",
                "Indiana Jones- Hogtied Naked Devon"
            ],
            "content":"<div class=\"\"><div> <span>   \"No, I welcome it,\" he said. \" How about we start a movie and you can do whatever you want to my feet and you can offer the other to Morgan if he'd like it.<br>\r\n<br>\r\n          \"That sounds amazing Captain. Actually I know just how to give him the good news. You know he's wanted this for so long.\"<br>\r\n          \"I thought so. I don't remember ordering the last three memory cards. Or the following stares at my feet as I did pull ups.\"<br>\r\n          \"Yeah. If you ever saw his phone's camera roll you'd see how obsessed he is. But before we ask him can I get a little taste of that amazingly delicious big toe right there\" <br>\r\n          \"Go ahead!\" With that chuck dove down and sucked on that beautiful meaty toe. Everything about this man was awesome. Devon smiled and called over his shoulder.<br>\r\n          \" Hey Morgan! It's Devon. Wanna come in here and share with chuck before he takes both of them?\" Devon smiled as did Chuck around the toe. Morgan came in quickly.<br>\r\n          \"What is it-Oh! Nice! So you're saying that...well that...I can...\"<br>\r\n          \"That you can just go wild on my meaty, salty, big, size 14 feet, doing anything you want all night? Yes. That's what I'm saying.\" Devon said with that ever so arousing smile. Morgan then wasted time on sticking as many toes in his mouth as he could. Chuck had begun to lightly gnaw and bight down on the well manicured meaty heel. Devon released a moan before pulling back his feet.\"<br>\r\n          \"Okay guys. We have to make a choice. You have three choices of movies and each one comes with a different consequence.</span></div></div>",
            "created":1384387560,
            "id":1693914,
            "title":"You could have Morgan do the other.\""
        },
        "112":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck loses- wakes up at colnel's house at his feet"
            ],
            "content":"<div class=\"\"><div> <span>Chuck worsh Casey<br>\r\n<br>\r\nChuck got to castle and saw Casey bored, sitting at the table. <br>\r\n\"what's wrong Casey\"<br>\r\n\"nothing\"<br>\r\n\"well...do you wanna fight?\"<br>\r\n\"I've fough with you tons of times.\"<br>\r\n\"not without the intersect...it'll make things interesting... And to make it even better...let's make a wager.\"<br>\r\nCasey got interested.<br>\r\n\"okay. If I win you have to worship me and especially my feet\" Casey said, putting his feet on the table. Chuck smiled and agreed to the vice versatile as well. They shook on it and left for the training room...</span></div></div>",
            "created":1310578920,
            "id":1146869,
            "title":"Colnel Casey "
        },
        "113":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Only while I watch Star Trek",
                "No but I'll take ur penis"
            ],
            "content":"<div class=\"\"><div> <span>Chuck and Morgan were alone at home while Sarah was out on a solo mission. Chuck had been very bored and began looking stuff up on the Internet.  He searched \"male feet\" as he was on his bed with his laptop staring at his feet. So he googles it and it came up with a few videos of male foot worship. He then called Morgan in.<br>\r\n\"what!? I was watching the Star Trek marathon. What's so important?\" Morgan asked as he entered. Chuck said nothing but turned the screen around to show Morgan a video:<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://v13.lscache3.googlevideo.com/videoplayback?id=e4b75c5327b15f1c&amp;itag=7&amp;begin=0&amp;ratebypass=yes&amp;title=Dawson+Worshiped+-+JockFootFantasy.com&amp;ip=0.0.0.0&amp;ipbits=0&amp;expire=1310479435&amp;sparams=ip,ipbits,expire,id,itag,ratebypass,title&amp;signature=6FDD44F97635FA44CA2A0D21EDB1265BAB0DBCF7.B01589316F9F5D46EC9202AE3A0C56125A73AC&amp;key=ck1\" target=\"_blank\">http://v13.lscache3.googlevideo.com/vide...</a><br>\r\n<br>\r\n\"Well what do oh think? I wanna do that to you? I wanna know why they like it so much! The taste of feet? Can I... Worship you?\"<br>\r\nMorgan looked at Chuck oddly and replied...\"</span></div></div>",
            "created":1310461860,
            "id":1146010,
            "title":"Morgan Grimes "
        },
        "115":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lester",
                "Jeff",
                "Shaw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More masters for chuck</span></div></span></div>",
            "created":1277182800,
            "id":904207,
            "title":"More"
        },
        "12":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck",
                "Colnel Casey",
                "Morgan",
                "Big mike",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will Captain Awesome be a slave to</span></div></span></div>",
            "created":1277182800,
            "id":904209,
            "title":"Captain Awesome"
        },
        "121":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "..began massaging the size13's...",
                "... lifted the socked foot and sniffed it...",
                "...took the socks off and licked..."
            ],
            "content":"<div class=\"\"><div> <span>Chuck knocked on Ellie's apartment door.  He waited a few seconds until the door was swung open by Devon (AKA Captain Awesome).  <br>\r\n          \"Hey Chuck\" The perfectly sculpted, as much as he could tell through the bathrobe.<br>\r\n          \"Hey Awesome, i'm here, why did you invite me over?\"<br>\r\n          \"I told you i would tell you when you got here. step in, and don't tell ellie what happens here, kay?\"<br>\r\n          \"Uh sure big man\" Chuck said entering.  He stepped in until Devon stopped him.<br>\r\n          \"Wait, sit down in this chair and i'll take your shoes off for you...\" Chuck sat down. and Devon kneeled down and began untying Chuck's Chucks.  Devon then</span></div></div>",
            "created":1299214800,
            "id":1064709,
            "title":"Chuck's Foot Licker"
        },
        "1211":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Took chuck to bed",
                "Full on worshipped him",
                "Kissed him"
            ],
            "content":"<div class=\"\"><div> <span>Chuck looked at awesome, his sisters husband taking off his shoes.  <br>\r\n\"I'm gonna treat you right, chuck.\" Devon said smiling as he took chucks socks off and began rubbing his feet lovingly.'h took a sniff and licked them for a makeshift lotion and once chuck was relaxed Devon...</span></div></div>",
            "created":1310515140,
            "id":1146390,
            "title":"..began massaging the size13's..."
        },
        "123":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "devon kisses something else",
                "chuck walks in",
                "morgan wants to try"
            ],
            "content":"<div class=\"\"><div> <span>Devon is at home alone reading a magazine and pedaling when the door rings. He opens the door and sees Morgan standing with a clipboard and a nervous(ish) look on his face. <br>\r\n\"um, hey Morgan...whats up?\"<br>\r\n\"oh! ya...um im here to ask a few questions about yours and ellie's relationship.\"<br>\r\ndevon stood behind the counter, his golden abs and other assorted muscles that in a word were \"Awesome\"<br>\r\n\"like what, morgan?\"<br>\r\n\"like would she...would she cheat on you?\" morgan blurted out nervously.<br>\r\n\"NO! shed never?\"<br>\r\n\"why not?\"<br>\r\n\"Well i...(he went on about all the amazing treatments he does for her)...and i massage her feet, and-\"<br>\r\n\"foot massage! sure i`ll take one!\" morgan said waking up from his open-eyed sleep.<br>\r\n\" uh...sure...give em here.\" awesome agreed. morgan gave devon his shoed feet of which devon untied with his beautiful teeth. then the socks. now his size 9 1/2 bare feet were being massaged gently. then out of nowhere (once morgans head was back and relaxed) devon ran his tongue  up the small sole, startling morgan but not without a jolt of pleasure.<br>\r\n\"how about we take this to the bed.\" devon said, lifting morgan and carrying him away. he set him on the bed and licked until...</span></div></div>",
            "created":1280725200,
            "id":928710,
            "title":"Morgan"
        },
        "125":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lester",
                "Jeff",
                "Shaw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More master for Captain Awesome...</span></div></span></div>",
            "created":1277182800,
            "id":904210,
            "title":"Other"
        },
        "13":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck",
                "Captain Awesome",
                "Morgan ",
                "Big Mike",
                "More feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Masters for Colnel Casey.</span></div></span></div>",
            "created":1277182800,
            "id":904213,
            "title":"Colnel Casey"
        },
        "133":{
            "choices":[
                "Morgan takes his socks off",
                "Morgan makes Casey suck his dick",
                "your choice"
            ],
            "content":"<div class=\"\"><div> <span>Casey enters chucks and Morgans apartment.<br>\r\n<br>\r\n- \"Where's chuck, Morgan\" Casey asked demandingly.<br>\r\n- \"I dont know.  I thought he was with you.\" morgan replied.<br>\r\n- \"No, hes not, now where is he really, Morgan.\" casey demanded.<br>\r\n- \"I dont know.\"<br>\r\n- \"look u insect, if you dont tell me where he is i will kill you\"  casey threatened.<br>\r\n<br>\r\nMorgan got up and went to the kitchen<br>\r\n<br>\r\n- \"where are you going you little fuck I'm talking to you!\"<br>\r\n- \"im sick of this,\" Morgan said bringing out a gun and aimed at Casey<br>\r\n- \"just take it easy Morgan. ok?   Casey said,  going down on his knees<br>\r\n- \"Youu know what Casey i like this sight. For the first time im looking down on you.\"<br>\r\n- \"Please, Morgan.\"<br>\r\n- \"look i wont kill you but only if you become my foot bitch.\"<br>\r\n-\"bu..bu...but...\" casey stuttered<br>\r\n- \"but what Casey!\"<br>\r\n- \"nothing ...........sir...\"<br>\r\n- \"thats a good boy, said Morgan with a cocky look on his face, \"now take off my sneaks. Ive been working for 8 hours straight\"  then he sat on the sofa.\"<br>\r\n- \"yes sir,\" said Casey with a scared voice and took of Morgans sneakers and as the shoe dropped on the floor Morgan shoved his sweaty socked foot on Caseys face<br>\r\n- \"how does it smell. bitch!\"<br>\r\n- \"it smells great Sir!\" he said with his soldier voice, \" but cant i just massage your feet instead?\"<br>\r\n- \"SHUT UP slave,\"  Morgan said,  hitting Casey, \"you do not have the permission to talk to me anymore suck my socks.\"<br>\r\nwith no wrods Casey started to suck on Morgans socked toes <br>\r\n</span></div></div>",
            "created":1277787600,
            "id":908817,
            "title":"Morgan "
        },
        "135":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lester",
                "Jeff",
                "Shaw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More beautiful guy feet...</span></div></span></div>",
            "created":1277182800,
            "id":904215,
            "title":"More feet"
        },
        "14":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck",
                "Captain Awesome",
                "Colnel Casey",
                "Big Mike",
                "More Masters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Morgan, who's feet will his tounge touch?</span></div></span></div>",
            "created":1277182800,
            "id":904211,
            "title":"Morgan Grimes"
        },
        "141":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "smelled Chucks socks",
                "massaged Chucks feet",
                "took off Chucks socks and licked his feet"
            ],
            "content":"<div class=\"\"><div> <span>Chuck and Morgan are sitting are sittin on the couch watching TV when a commercial for a male-male foot worship for Pay-per-view.  <br>\r\n\"looks interesting.  wanna see what its all about buddy?\" morgan asked.<br>\r\n\"sure, maybe itll be something to look in to whil im not spying.\"  chuck replied.  they bought and began to watch it.  every lick or suck brought morgans little thick prick out of his pants.  he looked over to chuck grinning, already rubbing his 9 incher.  morgan looked down at chucks size 13 cherry chucks.  <br>\r\n\"ch...chu...chuck?\" morgan asked, entranced.<br>\r\n\"yeah morgan?\" chuck asked, entranced.<br>\r\n\"can i worship your feet?\" he asked, a little worried.<br>\r\n\"sure morgan...go ahead. please.\"  chuck said as he put hi shoed feet on morgans lap, inches from his cock.  morgan took them and took the shoes off.  Next he...</span></div></div>",
            "created":1293598800,
            "id":1025102,
            "title":"Chuck"
        },
        "1413":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "\"Gnaw on my meaty man foot.\"",
                "\"Get a friend in the fun\"",
                "\"Take the next step...sexua relations...\""
            ],
            "content":"<div class=\"\"><div> <span>Morgan slipped chucks socks off the 13 inch feet and brought the cloth up to his nose.  he sniffed it deeply.<br>\r\n          \"Morgan...\" chuck started, \"Are you ever gonna taste my feet? the guy on the TV seems to like the flavor...\" with that morgan smiled and his tongue slithered out.  Chuck helped his heel onto his best friends tongue and glided his foot down the warm, wet, taste-buds.  Chuck and morgan both went into a fit of moans and ecstasy.  <br>\r\n          \"How about my toes? Why don't you suck those meaty lollipops?\" Morgan looked at the long thumb like toe vigorously and moved down them all on both feet.  <br>\r\n          \"So,\" morgan asked, \"What's next?\"<br>\r\n<div align=\"center\"></div><br>\r\n<a rel=\"nofollow\" href=\"http://i8.tinypic.com/8a0spjp.jpg\" target=\"_blank\">http://i8.tinypic.com/8a0spjp.jpg</a></span></div></div>",
            "created":1299214800,
            "id":1064700,
            "title":"took off Chucks socks and licked his feet"
        },
        "14131":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Do a little role-play ",
                "Have some fun in bed"
            ],
            "content":"<div class=\"\"><div> <span>\"Hows about you gnaw on my meaty man foot?\" Chuck Said. He looked at Morgan who was now naked.<br>\r\n\"mmmmmmm. Sounds delicious.\" he took chucks foot and began chewing on each individual toe. The big toe was the meatiest. Morgan kept on gnawing on it, his teeth squeezing the meat of it in all different directions he then switched to the other foot and moaned with pleausure and looked up at chuck who was beating his meat which was just over half his foot size. Morgan stopped and looked up at chuck. <br>\r\n\"what do you want to do. This is great but what do you want to do to make it more interesting?\"<br>\r\n\"how about we...\"</span></div></div>",
            "created":1310360400,
            "id":1145711,
            "title":"\"Gnaw on my meaty man foot.\""
        },
        "141311":{
            "choices":[
                "prison inmate convinces his new cellmate that he's gay (no sex)",
                "teenage boy gives his little brother his first orgasm (NO incest)"
            ],
            "content":"<div class=\"\"><div> <span>\". . . do a little roleplay?\"<br>\r\n<br>\r\nMorgan drops his jaw.  \"What?\"<br>\r\n<br>\r\n\"You don't like it?\"<br>\r\n<br>\r\n\"No, no, it's not that, Chuck.  I was just . . . surprised.  I never knew you were into that.\"<br>\r\n<br>\r\n\"I'm not, I just thought—wait, you mean <i>you're</i> into it?\"<br>\r\n<br>\r\nMorgan blushes.  \"Well . . .\"<br>\r\n<br>\r\n\"It's okay, man.  Let's act out one of your fantasies.  Mine was lame anyway.\"<br>\r\n<br>\r\n\"Chuck, that is the nicest offer anyone's ever given me.\"  Morgan drops Chuck's foot and clambers over his legs and towards him.  \"Let me thank you properly.\"<br>\r\n<br>\r\n\"Come on, enough with the sappy stuff.  Hey, get off me, man.  What are you—\"<br>\r\n<br>\r\nMorgan clutches Chuck's sides and kisses him slowly.  He gently squeezes and tickles him.  When Chuck laughs, Morgan tongues him and feels the roof of his mouth.<br>\r\n<br>\r\nChuck shoves him off.  \"Okay, okay, you're welcome!  Wow, where'd you learn that?\"<br>\r\n<br>\r\n\"Just another fantasy of mine,\" Morgan says and grins.<br>\r\n<br>\r\n\"So, back to my overwhelming generous offer . . .\"</span></div></div>",
            "created":1310441100,
            "id":1145814,
            "title":"Do a little role-play "
        },
        "141312":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "He goes straight for the reward",
                "Suggestion: play a game of worship the god"
            ],
            "content":"<div class=\"\"><div> <span>Chuck pulled his foot from Morgans mouth.<br>\r\n\"wha- I was eating that haha\"<br>\r\n\"well. I was thinking we'd try going a little farther.\"<br>\r\n\"how so?\" Morgan asked, hunger in his eyes.<br>\r\n\"well,\" Chuck started, sex in his tone. \"We are gonna have some fun, you know?\"<br>\r\nChuck slid off the couch onto the floor, landing on Morgans lap. He strongly grasped Morgans ribs and pulled him onto him, falling onto his back. Morgan, now on top of Chuck leaned in tentatively stopping just 2 inches before his best buds pink lips. <br>\r\n\"what's wrong buddy?\" Chuck asked, horny as a trombone.<br>\r\n\"I just don't know if I should... I mean like what if-\"<br>\r\n\"Oh shut up and kiss me you sexy beast!\" chuck interrupted then pulled Morgans face onto his and sucked and tongued.  The moans and \"mm!\" sounds stopped as Morgan stepped back.<br>\r\n\"what is it now babe?!\" chuck asked.<br>\r\nWithout an answer, or hesitation, Morgan ripped chucks shirt off leaving his hot muscular bro-bud in nothing but his boxers. Morgan licked his lips and stared at Chucks abs and pecs. He stepped forward and ran his hand around his childhood friends muscles. He lifted Chucks arm and traced the massive muscles in it. He stopped and stuck his face in chucks pit, whiffing loudly.  He then began sucking the perfect pecs and started slithering his hands down into chucks boxers but was stopped just before entering the underwear.<br>\r\n\"Uh-Uh your gonna have to catch me for that special set.\" Chuck said as he smiled and tapped Morgan on the nose and ran away saying, \"give me 20 seconds and come after me. Like hide and seek but with a special prize when u find me.<br>\r\n Minute later and 3closets searched later...<br>\r\nMorgan opened the door to chucks room and saw him lying  on his side, propped up, only a sheet barely hiding his sausage and meatballs.</span></div></div>",
            "created":1310458920,
            "id":1145979,
            "title":"Have some fun in bed"
        },
        "1413121":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Help him - it works",
                "Worship more "
            ],
            "content":"<div class=\"\"><div> <span>Morgan grinned and ran at chucks bed. He jumped and tackles him. The sheet fell off, revealing a manly rod and a package of two beautiful orbs. <br>\r\n\"why don't you stop staring, stop straddling my waist, and cook up some love with some spicy Morgan sausage and chuck buns. Name a nice man meat sausage sandwich.\" chuck said happily. Morgan stood up and walked over to the foot of the bed and lifted chucks feet. He pulled chucks feet up and put them on his shoulder. This opened up prime butt real estate. <br>\r\n\"go ahead buddy. Do it. Make a chuck and Morgan love sandwich.\" with that Morgan inserted himself.'. Chuck moaned and groaned as Morgan began pumping and licking chucks 13 inches of man foot meat a the same time. He then came inside of chuck and kept licking his feet as he laid down. He positioned himself and he and chuck fell asleep kissing.<br>\r\nThe next day:<br>\r\nMorgan woke up to a sensation in his ass. He turned and saw chuck forcing his foot in Morgans ass...</span></div></div>",
            "created":1310464620,
            "id":1146041,
            "title":"He goes straight for the reward"
        },
        "14131211":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Devon \"captain awesome\"",
                "Colnel casey"
            ],
            "content":"<div class=\"\"><div> <span>\"good morning babe\" Morgan smiled.<br>\r\n\"oh. Hey hot stuff.\" chuck said. Still working on getting his foot in there. <br>\r\n\"um...whatcha doin'?\" <br>\r\n\"trying to fuck you with my foot.\" chuck said, matter-of-factly. \"is that ok?\"<br>\r\n\"Uh: why not? let's give it a try.\" Morgan said. He the rolled over onto his back and spread his legs wide open. Chuck then began sliding his foot in, inches at a time. After glorious moans or pleasure he got it all the way in. The sight of chucks ankle being all that's was showing turned him on. He then began wiggling his toes inside Morgan who was practically screaming with pleasure. The two were busy and they heard a knock at the door. Chuck tried to pull his foot out but it wouldn't budge. They decided to have Morgan crawl and chuck would answer the door with Morgan behind it. <br>\r\n\"oh hey...\"<br>\r\n</span></div></div>",
            "created":1310490180,
            "id":1146195,
            "title":"Help him - it works"
        },
        "141312111":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "...and not in me?",
                "And why aren't you worshipping me Morgan?"
            ],
            "content":"<div class=\"\"><div> <span>\"hey devon...what's up?\"<br>\r\n\"dude; I really need to come in.\"<br>\r\n\"I don't know. It's just-\" and Devon entered forcefully. He looked around and noticed naked chuck, smiled, then looked down and saw Morgan, then scratched the back of his neck and asked<br>\r\n\"what's goin on'? Why is your foot in Morgan...\"</span></div></div>",
            "created":1310493000,
            "id":1146214,
            "title":"Devon \"captain awesome\""
        },
        "1413121112":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Morgan worships Devon and chuck",
                "He disobeys (torture to Morgan)"
            ],
            "content":"<div class=\"\"><div> <span>Morgan looked at Devon in awe. He then traced down his body and ended at his feet. Which were in a nice pair o flip flops.  He licked his lips ten asked<br>\r\n\"wait a minute. Why are you asking me to worship your feet? How do you know shot this?\"<br>\r\n\"well there was this commercial for pay per view for it and I got interested so I planned to talk to you guys about it in the morning... By the way would you like some help getting chucks foot out of your butt Morgan?\"<br>\r\n\"yes, please my lord.\" he replied.<br>\r\nDevon brought chuck and Morgan over to the Couch and layed them down on it. He then led for the kitchen and came back a minute or so later with a stick of butter, a rubber spatula, and a big smile. He then slathered a huge glob of butter on Morgans ass and rubbed it around. He smiled  and then looked to chuck mischievously and began tickling his naked body until pop! Out came his foot<br>\r\n\"so Morgan. Get to it..:\"</span></div></div>",
            "created":1310509380,
            "id":1146344,
            "title":"And why aren't you worshipping me Morgan?"
        },
        "143":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "He massages Colnel's feet",
                "Smells Casey's socks",
                "Off go the socks. In comes the tongue"
            ],
            "content":"<div class=\"\"><div> <span>there was a knock on the door of caseys apartment.  the colnel grunted and got out of his chair and walked to the door.  He opened it to see Morgan Grimes waiting anxiously.<br>\r\n\"What do you want Morgan?\" Casey asked.<br>\r\n\"i want to win you over.\" morgan replied.<br>\r\n\"How so?\" Casey asked.<br>\r\n\"Well sit down, put your feet up, and i'll show you.\" Morgan smiled.<br>\r\ncasey went to the couch, sat down, and put his feet (clad in all-black vans) on the coffee table. where morgan sat down after Casey.  Morgan picked up the left foot, moved where it used to be and untied it.  he slid the shoe off of the foot of a scowling Casey.  Morgan then ensconced his nose with the pleasently aromatic shoe, which made Casey a bit hard and happy with morgan. he smiled at his worshiper, took off his shirt, unbuckled his pants (which where then pulled off by Morgan) opened his folded arms and asked:<br>\r\n\"Whats next?\"<br>\r\n </span></div></div>",
            "created":1293858000,
            "id":1027183,
            "title":"Colnel Casey"
        },
        "1431":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Was stopped and brought to bed",
                "Stopped and began foot-licking",
                "Wasn't stopped, blowjob"
            ],
            "content":"<div class=\"\"><div> <span>Morgan took off the other shoe and again took in casey's manly foot stench. <br>\r\n\"how's that for a scent little man?\"<br>\r\n\"almost as beautiful as you.\" Morgan responded lovingly.<br>\r\nNow sit back and relax as I massage your beautiful feet. Now let's get these socks off.\" he took the sock off to reveal some semi-pale, 12 inch, man meat.  He then put the sock to his nose and took amenity before neatly placing them in their shoes. Morgan grabbed one of the feet and rubbed the soft feet.  Casey smiled and moaned from relaxing rub. He kept going and suddenly Morgan lifted the leg closest to him and got in-between casey's muscled man legs and began rubbing the calves, then the thighs, then right as he got to the crotch area he...</span></div></div>",
            "created":1310460180,
            "id":1145992,
            "title":"He massages Colnel's feet"
        },
        "14313":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Let's go to bed",
                "Role play? Ie King-servant?"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nMorgan kept massaging casey's thighs until he reached his boxers.  Casey just nodded and leaned back again. Morgan slipped his hand into the underwear and pulled out casey's dick and put it in his mouth and blew him. He took it ou and sucked his balls...</span></div></div>",
            "created":1310848680,
            "id":1148920,
            "title":"Wasn't stopped, blowjob"
        },
        "145":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Lester",
                "Jeff",
                "Shaw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More pairs of feet...</span></div></span></div>",
            "created":1277182800,
            "id":904212,
            "title":"More Masters"
        },
        "15":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Big Mike",
                "Lester",
                "Jeff",
                "Daniel Shaw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More slaves</span></div></span></div>",
            "created":1277182800,
            "id":904202,
            "title":"Other"
        },
        "151":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "chuck",
                "captain awesome",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will he worship?</span></div></span></div>",
            "created":1293858000,
            "id":1026891,
            "title":"Big Mike"
        },
        "1513":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "morgan grimes",
                "colnel casey",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more selish feet...</span></div></span></div>",
            "created":1293858000,
            "id":1026892,
            "title":"more"
        },
        "15133":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "lester and jeff",
                "everyone on the list"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>last list for feet that big mike can love on</span></div></span></div>",
            "created":1293858000,
            "id":1026894,
            "title":"more"
        },
        "151331":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "took off their socks ",
                "massaged the socked feet"
            ],
            "content":"<div class=\"\"><div> <span>jeff and lester stormed into big mikes office.  \"this is too much torture from mr. casey.\"  lester said.  to which jeff agreed.  \"guys what can i do to get you to keep silent?\" big mike pleaded.  \"well,\" lester began, \" our feet have had a certain pain from standing all day and we know your desperate...so...you are going to worship our feet.\"  big mike looked athem...\"okay.\" he surrendered.  thy closed the doors and shut he shades.  then they sat in chairs with mike on the ground as he took off their shoes.  next he...</span></div></div>",
            "created":1293858000,
            "id":1026897,
            "title":"lester and jeff"
        },
        "152":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Chuck",
                "Morgan",
                "Devon \"captain awesome\" woodcomb"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's feet will his tongue touch?</span></div></span></div>",
            "created":1310585820,
            "id":1146975,
            "title":"Lester"
        },
        "1523":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Going to worship my feet",
                "Going to be fucked by me",
                "Get a nice torture for being a peeping tom"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\nDevon was sitting at home alone while watching tv when an error warning flashed on the screen. He decided to call up the buy more to get some help. <br>\r\n\"hey is thus the nerd herd?\" Devon asked.<br>\r\n\"yes milord. This is Lester...of jeffster. How can I help you?\"<br>\r\n\"Lester...it's Devon. I'm having problems with my tv and wondered if you would fix it...\"<br>\r\n\"ah. Captain awesome!  I will be right over. By the way is Ellie there?\"<br>\r\n\"Uh no. She'll be out for a week.\"<br>\r\n\"great...I'm on my way.\"<br>\r\nAbout 5 minutes later Lester was knocking on the door. He walked in and Devon followed him in the tv. Devon was barefoot, showing of his 14 inch pair of meat. Lester kneeled down to put his  tools on the floor and began to stare at devons feet. He stared for about 5 seconds until:<br>\r\n\"Lester...why are you staring at my feet?\"<br>\r\n\"well who wouldn't want to stare at your Greek god-like feet.\"<br>\r\n\"well I never thought of them that way...wait do you have a foot fetish?\"<br>\r\n\"yes I do sir\" Lester replied confidently.<br>\r\n\"ahem... Well why dot you fix my tv now...\" Devon said as he walked back to the couch. He sat down and put his feet on the foot rest. Lester kept looking back over his shoulders to look at devon's feet while he want looking until he finished and turned the tv on and said.<br>\r\n\"I'm done I'll leave now...\"<br>\r\n\"actually lester your not going anywhere........you are...\"</span></div></div>",
            "created":1310614380,
            "id":1147360,
            "title":"Devon \"captain awesome\" woodcomb"
        }
    },
    "info":{
        "author_id":"xaviergrey",
        "author_name":"Xavier grey",
        "brief_description":"Male characters of \"Chuck\" have foot fetishes!",
        "created":1277195280,
        "description":"<td align=\"left\" class=\"norm\">Characters :<br>\r\nCharles \"Chuck\" Bartowski- size 13<br>\r\nDevon \"captain awesome\" woodcomb-size 14<br>\r\nColnel John/Alex Casey- size 12 <br>\r\nMorgan Grimes- size 9.5<br>\r\nBig mike- size 11<br>\r\nLester Patel- size 10.5<br>\r\nJeff Barnes- size 11.5<br>\r\nDaniel shaw- size 10   <br>\r\n<br>\r\n—-—-—<br>\r\nrules    /<br>\r\n---------<br>\r\nno killing characters in list<br>\r\nNo one else worships feet other than the person picked earlier<br>\r\nSex allowed<br>\r\nTorture allowed<br>\r\nMo shrink or growth<br>\r\nmail me if you want to end it first or I WILL delete it <br>\r\nno shrink / grow<br>\r\nyes on tickling, in moderation<br>\r\ndo what you want other than that :D</td>",
        "id":1684190,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1384446960,
        "modified":1384446960,
        "pretty_title":"Chuck Male Foot Fetish"
    }
}