{
    "chapters":{
        "1":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Tara",
                "Catherine",
                "Jazmin",
                "Kayla ",
                "Another family member or different family entirely!"
            ],
            "content":"<div class=\"\"><div> <span>One woman has to be chosen to be the main character, or focus of the story. The girl chosen will be the girl that is humiliated throughout their story line. They won't necessarily be the only one to be humiliated, but the story line will follow that specific woman out of the family. To start off, we have four options: <br>\r\n<br>\r\nTara (mother): Tara is a shorter woman with straight brown hair cutting off nicely just below her shoulders. She has similarly beautiful brown eyes and soft white skin, and a nice fit frame. Sporting a surplus of breast-size and a large round bouncing bottom, Tara is ripe for eyes to lay upon, and even riper to be humiliated, as the mom of the family! Her more submissive nature tends to make her an easy target. Tara works in a cubicle as a Human Resources manager in an office building. She can't be easily publicly humiliated, but her subordinates and co-workers could/would mock her for days if they saw her being humiliated.<br>\r\n<br>\r\nCatherine (mother): Catherine, partnered with Tara, is the second mom of the family. She's a taller woman with very slightly curly brunette hair, flowing down gracefully just past the center of her back, leading one's eyes naturally down to her large bubble butt. Catherine has a slightly curvier figure than Tara, and slightly smaller breasts as well, but makes up for it with her massive rear end. Catherine tends to seem more dominant and aggressive, but is secretly quite submissive, and becomes putty in the hands of whoever attempts to humiliate her. Catherine is a cashier at a local grocery store, and could be easily publicly humiliated at work.<br>\r\n<br>\r\nJazmin (older sister): Jazmin is the older sister of two, despite being shorter than her sister. She has straight black hair that goes down just past her shoulder blades on her back, and slightly tanned white skin. She's quite popular at school, meaning whoever humiliates her has a lot of \"ammo\", especially when dealing with public humiliation. Jazmin has arguably the best body of the entire family, with a fit frame and hourglass figure, seductively large breasts, and a huge bouncing bottom that strains against the fabric of pants and skirts she wears. Jazmin is on the cheer squad, and her fellow cheer leaders would never let her live down humiliation.<br>\r\n<br>\r\nKayla (younger sister): Kayla is the younger sister, and thus youngest of the family, as well as the only blonde in the family. Her straight blonde hair flows down gently to just past her shoulders, slightly reminiscent of Tara's hair length. Due to being the youngest, Kayla may seem an easy target, but has an imaginative mind and a lot of motivation. Kayla is also quite popular at school, and thus could also be easily heavily humiliated or blackmailed. Kayla's body is excitingly curvy, with large breasts on a perfect curvy hourglass figure leading down to a large, thick bottom and fit legs.<br>\r\n<br>\r\nIf none of these appeal to you, feel free to add another member to the family, or shift focus to a different family entirely if you'd like!<br>\r\n</span></div></div>",
            "created":1522990800,
            "id":2475850,
            "title":"Where To Start"
        },
        "11":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Tara's daughter(s) humiliate her in the morning.",
                "A friend of her daughter's slept over and woke up in time to humiliate Tara.",
                "Someone surprises Tara at the front door.",
                "Someone at work manages to humiliate their boss, Tara.",
                "Tara's wife humiliates her!"
            ],
            "content":"<div class=\"\"><div> <span>Tara, the short, brown-haired woman, was just hours away from having her world flipped upside down on her head, and she was none the wiser. <br>\r\n<br>\r\nTara's day began as normal, waking up in her bed to the sensation of her wife, Catherine, kissing her on the forehead as she left for work, and Tara giving a playful slap to the taller woman's large rear end as she left, leaving Tara with a smile. She sighed to herself, and, after a few moments of wondering if she could go back to sleep, resolved to get up and get ready for the day. After all, it was her job to wake the girls up in just half an hour or so. <br>\r\n<br>\r\nSo she got out of bed, and walked over to the dresser she shared with Catherine to pick out her outfit for the day. For her underwear, she decided on some yellow panties with the words \"Spank Me\" on them, and a matching yellow bra. Blushing just slightly as she slid the underwear up her legs, thinking of how embarrassing it would be if someone somehow saw them. As she gave the final tug to settle them onto her big bottom, the panties clung to her round ass tightly, even as it wobbled around inside of them. She then picked out a white tank top for an undershirt, straining slightly against the weight and size of her breasts, a white blouse threatening to lose some buttons, and finally slipped on a gray cardigan on top in case it was cold in the office. On bottom, she slipped on some simple slacks, which fit her large bottom more like leggings, making an obvious panty line, and grabbed a pair of black heels to boost her short stature, and headed out of her bedroom door. <br>\r\n<br>\r\nAs she left, Tara glanced at the clock, and noticed that she took far longer than she thought to pick out her outfit, and decided to quickly get the girls up so they could get ready for school, and neglected going to the bathroom, hoping she could sneak in time after breakfast. So, Tara quickly headed down the hall to start her day with an unusually full bladder. </span></div></div>",
            "created":1523077200,
            "id":2476234,
            "title":"Tara"
        },
        "111":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Tara's spanking wakes Jazmin up!",
                "Kayla gives Tara a new dress code and \"house uniform\".",
                "Something else entirely happens! "
            ],
            "content":"<div class=\"\"><div> <span>Tara walked briskly down the hallway, making sure her footsteps were light, her breasts bouncing tightly in her shirt as she did, then bumbling down the stairs to get breakfast started before waking the girls. She put together a nice and simple breakfast for the three of them, omelettes with toast and bagels. As she began to warm the stove up and got the cooking supplies out, she headed upstairs to wake up her daughters.<br>\r\n<br>\r\nShe knocked gently on Kayla's door first, seeing if she was awake, which she wasn't. When she got no response, Tara slowly opened the door, now pushing her free hand down between her legs, the urge to pee getting stronger and stronger. She slowly walked to Kayla's bed, over the messy clothes-strewn floor, and gently pushed on her shoulder, whispering, \"Kayla, sweetie, it's time to get up! Come on, I'm getting breakfast ready!\" Her voice was cheerful and calm but in the back of her mind she was urgent. She shook Kayla's shoulder again, \"Come on sweetie, I still need to get Jazmin up and I need to use the bathroom, please get up.\" She pleaded hopefully.<br>\r\n<br>\r\n\"Five more minutes...\" Kayla murmured into her pillow, her blonde hair partially covering her face, a small corner of her mouth curling into a smile as she spoke. She was dressed sloppily and sluttily at the same time. Wearing nothing but a pair of black booty shorts that revealed much of her large rear end and a skimpy, thin white spaghetti strap tank top, clearly with no bra underneath, her large breasts pushing passively against the thin, almost see-through, fabric. <br>\r\n<br>\r\n\"No, not five more minutes,  come on, you need to get up for school!\" Tara insisted, oblivious to her daughter's intentions. Kayla playfully and gently pushed her mother, causing her breasts to bounce slightly and a warm gentle smile to come over her face, \"Come on, let's get up, okay?\" Tara asked again fruitlessly. <br>\r\n<br>\r\n\"I don't want to. I want to sleep.\" Kayla moaned more, with another playful push, almost sending Tara off-balance.<br>\r\n<br>\r\n\"I know you don't want to but you need to, just like Jazmin needs to. Come on, I'm leaving the room now so you need to get up.\" Tara responded, slowly standing up, her hand cupping her crotch as she turned around, her bladder panging constantly to release.<br>\r\n<br>\r\nKayla saw her opportunity and took it, not knowing the full extent of her mother's need to use the restroom, and pushed her mother's bottom with her hand, pushing her roughly forward a few steps, causing her to bounce several times. Her desperation to pee combined with the sudden unexpected movement finally did it, and Tara quickly felt a warm trickling liquid wash over her hand and down her legs, and a large wet spot spread across her pants just as much as red spread across her face, blushing profusely. \"Oh my god...\" she whispered to herself, paralyzed by her embarrassing state.<br>\r\n<br>\r\nKayla's eyes shot open and her smile widened, her jaw dropping as she shot up in bed, seeing her mother standing in her room, knees bent, hand between her legs, clearly having just wet herself. \"Uh, mom?\" Kayla asked with the smile on her face. Tara slowly turned to her daughter, still holding her hand in place, as if it would do anything, and smiled gently, \"Yes, sweetie?\" Kayla couldn't contain her laughter at the front view, and burst out laughing as she saw her own mother standing there in such a position. After a few moments of breath-taking laughter, she stood up quickly, brushing past Tara. \"Wait until Jazmin sees this!\" <br>\r\n<br>\r\nTara grabbed her arm with her free hand, \"Please, Kayla, don't tell Jazmin! Shut the door shut the door please!\" She said quickly, eyes wide at the prospect of BOTH of her daughters seeing her like this. \"Please don't tell Jazmin, or anyone, please!\" <br>\r\n<br>\r\nKayla smirked, shutting the door slowly and crossing her arms. \"What are you gonna do for me if I don't?\" Kayla replied slowly. Tara's mouth dropped slightly at the surprise of the situation, her daughter milking her embarrassing position for as much as she could. \"I'll... I'll give you an allowance! Or, uhm... I'll take you shopping whenever you want!\" Kayla shook her head, \"No, I don't think so mom. I think that it's time you listened to me for a change. I think, in exchange for not telling anyone, you become my slave. Does that seem fair?\"<br>\r\n<br>\r\nTara gasped, \"Ah! Kayla, no that doesn't seem fair! I'm enslaved to you just because you saw me wet myself? Ab-\" \"Exactly! That's the spirit!\" Kayla smiled again, walking past her stunned mother and grabbing her phone. \"Come on, I want photo evidence so you can't back out on me.\" Tara stood dumbfounded, looking at her daughter. \"You have to be kidding! You're taking pictures of me in the pantsI peed in now?!\"<br>\r\n<br>\r\nSuddenly Tara found herself doing just that, even posing for Kayla with her hands on the back of her head, with her feet spread shoulder width apart, the tight pants cupping her big bottom well, clinging to her skin tightly, now wet. Kayla took a total of ten pictures and saved them all multiple times before tossing her phone, now locked, back onto her bed. <br>\r\n<br>\r\nAs her daughter snapped the photos of her, Tara thought to herself, reflecting on her situation. Will she really be enslaved to her own daughter because of this? Her thinking was cut short when Kayla spoke up.<br>\r\n<br>\r\n\"So mom, peeing yourself is pretty naughty, don't you agree?\" Tara very slowly answered, \"Yyyeeessss. Why?\" at this point her heart was racing, having no clue what her daughter had planned for her. \"Well, everytime I do something naughty, what do you do to me?\" \"I take you over my knee for a spank- no! Kayla I am your mother and you will not spank me! That is final!\" <br>\r\n<br>\r\nWHACK WHACK WHACK<br>\r\n<br>\r\nTara stared at the bed sheets of her daughter as her bottom bounced around in the tight pants. Kayla had bent her mother over her knee on her bed, now delivering the spanking she had proposed. \"Mom, you have no idea how long I've wanted to do this.\" Kayla smiled as she delivered the next few whacks, Tara gasping in surprise at both the words and the smacks. Kayla was surprisingly strong, each swat leaving the painful sting of a hand print, even over her panties and pants. At this point, Tara just hoped that Kayla wouldn't see her panties.<br>\r\n<br>\r\nKayla's breasts bounced around in her tank top as she hammered into her mother's large rear end, moving her hand up and down and all around to cover the wide surface area of the bottom in front of her. Tara was having trouble connecting to the ground with her feet, only causing her to blush more and feel even more embarrassed - she was entirely over her daughter's lap, humiliated and being spanked.<br>\r\n<br>\r\nWHACK WHACK WHACK!<br>\r\n<br>\r\n\"Owie!\" Tara moaned into the bed sheets. \"Kayla, sweetie, how long are you going to spank me for?\" She asked hopefully. \"How long am I what?\" Kayla asked with a smirk. \"I asked how long are you going to spank - owie owie owie!\" Tara cried from the abrupt swats interrupting her. \"How long are  you going to spank me? It's been ten minutes already! My bottom is getting so tender!\"<br>\r\n<br>\r\nKayla rubbed her mother's big behind with her hand to soothe a small amount of the pain, her gentle and small hands not able to cover much of the area at once. \"Well, I suppose I could stop now...\" Kayla said. Tara sighed and began to stand up, \"Thank y- AH!\" she shrieked as Kayla pulled her back down. \"Stop on your pants, that is.\" Tara's eyes shot open and her heart skipped a bit. \"No no no, Kayla, come on! That's ridiculous, I'm your mother, you can't spank me over my panties!\" \"I can and I will. Stand up.\"<br>\r\n<br>\r\nTara reluctantly stood, quickly attempting to make an attempt for herself, \"Now Kayla, I-\" she was cut off by Kayla yanking her pants to the ground, discovering the yellow fabric, now stained in the front. Kayla burst out laughing again, barely containing herself at the sight of it. \"Come on, I want the full view.\" She leaned back with a sly smile, resting with her hands on the bed. \"Kayla! Are you really going to make your mother underwear-pose for you like a model?\" Kayla nodded wordlessly and twirled her finger in the air to represent a turning motion. Tara blushed and took a deep breath, stepping out of her pants and beginning to turn slowly. She barely made it two steps before Kayla butted in, \"Tut tut tut! Hands on your head.\" Tara sighed again, blushing, but subserviently laid her hands on the back of her head before continuing. <br>\r\n<br>\r\nTara bit her lip as she finally turned around 180 degrees, her big, now red, bottom on display for her daughter in the mortifying \"Spank Me\" panties. Kayla erupted in laughter, holding her stomach and falling over on the bed as Tara stood there obediently, her face burning red hot with embarrassment. After nearly three minutes of Kayla laughing, she finally settled herself down and said, \"Okay mom. Love the panties! And I'd be happy to oblige. Over my knee.\" Tara turned again and gently laid herself over her daughter's knee once more, her feet again lifting off from the ground as she was pulled onto Kayla's lap.<br>\r\n<br>\r\nKayla's first slap stung like hell, and caused Tara to shriek quietly after the WHACK \"Owie!\" she moaned. After that, Kayla rained down countless slaps, enjoying how her mother's bubble butt shook and wobbled after the impacts of the slaps, especially when she got right on the seat of Tara's bottom. With every sharp slap, Tara exclaimed again and again, \"Ouch! Ooh! Mmph! Owie! Owieeee!\" She cried.<br>\r\n<br>\r\nKayla stopped for a moment. \"Quiet mom. You don't want to wake Jazmin up to come find you being spanked, do you?\" Tara shook her head, already subconsciously fitting into the position of slave, being so obedient, \"No, not at all.\" She spoke, mostly to herself. Then the spanking continued.<br>\r\n<br>\r\nWHACK WHACK WHACK<br>\r\n<br>\r\nKayla smirked, not pausing the spanking to speak. \"I think you'll call us out of school today, and you'll call into work. I have a lot of fun things planned for us.\" Kayla giggled as her mother's big behind got more and more tanned, quickly becoming a deep shade of red, burning hot.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1523163600,
            "id":2476766,
            "title":"Tara's daughter(s) humiliate her in the mor..."
        },
        "1112":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "A french maid's outfit. ",
                "An adult diaper and nothing else. ",
                "Something else entirely! "
            ],
            "content":"<div class=\"\"><div> <span>Tara nodded quickly, putting her arm in front of her face on the bed to brace the impact after the hard slaps, \"Yes, I think I will as well. Not like I could sit down after this anyways...\" She spoke the second sentence to herself as her voice was drowned out by the loud slaps. As Kayla's arm swung up and down, causing her mom's bottom to bounce along with Kayla's breasts, and to redden along with Tara's face, she smirked to herself, making sure she got every square inch of her mother's bottom with the spanking. <br>\r\n<br>\r\n\"Owiiiie!\" Tara softly cried again, her legs dangling above the carpet as her bottom wobbled around in her daughter's lap. By now, she had been spanked on her panties for nearly twenty minutes, and her bottom was getting a deep shade of red. \"Quiet mom! If Jazmin walks in on you getting spanked, you know she'll want to spank you, too.\" Tara blushed deeply, now thinking of the thought of BOTH of her own daughters sharing her bottom across their knees. \"You're right sweetie.\" She replied softly, before another \"Ouchie! You're just spanking me so hard!\" Kayla smiled as she gave a few swift smacks, \"Well, I have to get you broken in to prepare you for later.\" Tara eyes widened a bit as her daughter spoke, wondering what she meant about that exactly. <br>\r\n<br>\r\nNearly ten more minutes went by, the echoing of the slaps around Kayla's enclosed room, combined with the soft exclamations erupting from Tara's mouth as her bottom was properly tanned. But finally, Kayla's smacks began to slow, and eventually stop, until she was rubbing her mother's tender bottom gently on her lap. \"Okay mom. Your first spanking is done, now it's time to get down to business. Stand up.\"<br>\r\n<br>\r\nTara quickly did so, \"What do you mean get down to business? Come on sweetie, a spanking is one thing, but any more than tha-\"<br>\r\n<br>\r\n\"Quiet! Unless you want another trip over my knee, you'll do what I say. Am I understood?\"<br>\r\n<br>\r\nTara nodded silently, her face beet red from the order. Kayla continued, \"On that topic, any time you do something I don't like, I think I'll pull you over my knee then and there. It doesn't matter if we're in the mall, at a restaurant, or at home. Naughty girls need to be spanked, don't they?\" Kayla asked, giving another firm slap to Tara's bottom for good measure.<br>\r\n<br>\r\nPushing her hips forward from the force of the slap and nodding, Tara reluctantly replied, \"Yes they do.\" <br>\r\n<br>\r\nKayla smirked, standing up and pushing up close to her mother, who averted her gaze slightly. \"So, since we're on the topic of ground rules, I think I should introduce a dress code.\" Tara gasped and look at her daughter, their breasts brushing against each other, causing Tara to blush a bit, \"Kayla! You're going to enforce a dress code on me? What, I need to wear a nice pretty skirt and blouse for you now?\" <br>\r\n<br>\r\nSMACK SMACK SMACK \"Ouchie!\"<br>\r\n<br>\r\nKayla giggled a bit, \"You should know better than to speak to me like that by now mom. I told you, I will spank you whenever I want to.\" Tara nodded just a bit with a stern look on her face, blushing as deep as ever. \"But no, the dress code will not be a specific outfit, that comes later. Just some requirements. Firstly, these.\" Kayla smiled as she generously groped her mother's breasts. Tara gasped slightly, but said nothing. \"No more bras for you. Only low-cut, tight shirts. If anything is left to the imagination, I will spank you immediately. Got it?\" \"Kayla that's just ridi-\" WHACK \"Understood.\" Tara gulped.<br>\r\n<br>\r\n\"Secondly,\" Kayla continued smoothly, \"These.\" and she ran her fingers into the waistband of her mother's panties, all the way around to the back, pulling up, giving her a small wedgie. \"I want your panties to be visible at all times. This means if you're wearing pants, the panties are showing at least two inches above the waistline, with your shirt tucked in, so everyone can see them.\" Tara thought of protest, but decided against it, simply nodding. \"And if you're wearing a skirt or dress, the back of it is completely tucked into the panties, so anyone and everyone can see this nice big red bottom.\" Kayla firmly grabbed her mother's large rear end as she spoke.<br>\r\n<br>\r\n\"But that's for out in public. To tease the town.\" Kayla smirked. \"I have a special outfit I thought up for you when we're inside.\" Tara's heart pounded inside of her chest, anxious to see what her daughter had picked out for her. \"Kayla, sweetie, won't Jazmin and Catherine pick up on this whole deal if they see me in some skimpy outfit all the time?\"<br>\r\n<br>\r\nKayla paused for a moment, sitting back on her bed. \"I suppose they would. But they were going to find out eventually. At least this way you've been eased into it instead of the three of us getting you all at the beginning.\" Tara gasped at her daughter's flippant attitude to exposing her to the family like this. But she was powerless to resist; she didn't want another spanking! She would at least see what the outfit was before attempting to resist, but she felt it was futile anyways. Her daughter had been stronger than her for at least a year now. If anyone was getting spanked at this point, it was Tara. <br>\r\n<br>\r\n\"Okay, I suppose I have no other choice, what with those pictures you took of me...\" Tara responded, lowering her face a bit. \"Glad to hear you're on board! Go check it out, it's in my closet. Put it on and then come back out to pose for me. I'll be waiting.\"<br>\r\n<br>\r\nStepping into the closet, Tara found: </span></div></div>",
            "created":1523336400,
            "id":2478091,
            "title":"Kayla gives Tara a new dress code and \"hous..."
        },
        "115":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Catherine has mercy on her wife (for now).",
                "Catherine spanks Tara privately.",
                "Catherine spanks Tara in front of Jazmin and Kayla!"
            ],
            "content":"<div class=\"\"><div> <span>Tara jumped slightly as she entered the hall, seeing a figure standing at the end of it, but her heart calmed down when she recognized her wife's face. \"Hey!\" She smiled, holding a hand to her chest and walking towards Catherine, \"what are you still doing here?\" Catherine smiled, embracing Tara as she replied, \"Oh, they called me, said I didn't need to come in today, so I figured I could have breakfast with you and the girls.\" Tara smiled up at her tall partner and smacked her bottom once, \"That would be great! I'll get started on breakfast, you wake them up.\"<br>\r\n<br>\r\nSo Tara got set on making a simple breakfast. Some scrambled eggs, some pancakes, orange juice and milk, all of the simple things. A few minutes into her preparations, Catherine came down, dressed in pajama shorts that clung tightly to her big bottom, and a white tank top that was a little too tight to wear out in public. Catherine came up behind Tara, gripping the shorter woman's bubble butt and smacking it a few times. \"Smells delicious. Can't wait.\" Catherine's tone was low and seductive, causing Tara to blush a little bit as she heated up, but she tried to control herself; her daughters would be here soon, after all. \"I hope you'll enjoy it.\" She replied, smiling and looking down at the meals. \"I think I will. It's gonna be a lot of fun.\" Catherine responded in a whisper, giving one last slap to Tara's ass before heading to the table and sitting down.<br>\r\n<br>\r\nTara raised an eyebrow when Catherine wordlessly got up, fixing herself a quick bowl of cereal. \"Don't you want to eat what I'm making?\" She asked. Catherine reassured her, \"Yes, I do! Don't worry, I will.\" Catherine then stood behind Tara, carefully listening for the sounds of footsteps from up the stairs. Soon enough, as Tara was finishing breakfast, Catherine heard the pitter patter. <br>\r\n<br>\r\nShe quietly turned to her wife, hooked one finger into Tara's pants and panties, and poured the contents of the bowl of cereal out into them, causing Tara to immediately gasp and exclaim, \"Oh my god!\" dropping the spatula and stepping away from the stove, looking down at herself as the milk ran down her legs, soaking her pants. As she did, Jazmin and Kayla slowly came downstairs. \"... mom?\" they asked with half smiles on their faces. <br>\r\n<br>\r\nCatherine smirked and turned to the girls, \"Oh, girls! It seems like your mother's had an accident! Or, a couple, really...\" she motioned to Tara's pants, which were slightly bulged out with cereal. Tara's eyes widened as she realized what was happening. \"Honey! You can't tell them that!\" She insisted, blushing deeply as she realized that her wife was making her seem like a child in front of their daughters, who were beginning to laugh. <br>\r\n<br>\r\n\"Jeez mom, really? You couldn't hold it? We have like three bathrooms in this house! Want me to show you where they are?\" Jazmin giggled to Tara's dismay. \"Jazmin, that is very inapprop- Kayla!\" Tara was interrupted as she saw her younger daughter take out her phone, now taking pictures of Tara. \"Sorry mom, I definitely have to keep proof of this. It's absolute gold!\" Kayla laughed, showing Jazmin the pictures, who laughed in return. <br>\r\n<br>\r\n\"Now honey, it's okay.\" Catherine smiled warmly, gently grabbing Tara's arm. \"I'm sure a lot of women have accidents now and then.\" \"Catherine!\" Tara replied, \"You can't do this in front of our daughters!\" \"Listen honey, I'm sorry, but what you've done is very naughty, and you need to be punished for it!\" Catherine smirked, gently holding Tara by the waist. <br>\r\n<br>\r\nTara's eyes widened as she looked up at her wife. \"Catherine, NO!\" she attempted to defuse the situation, but was met with a swift stinging smack to her bubble butt. Jazmin and Kayla laughed once more, covering their mouths. \"I'm sorry honey, but you know the rules of the house. If you do something naughty, you get a spanking.\" Tara gasped, \"Those rules are for our daughters, not for us!\" Catherine shook her head with a smile, \"And if Jazmin or Kayla had done this, then I would spank them, too.\" <br>\r\n<br>\r\nThe two girls giggled uncontrollably as the sight of the situation, truly believing that Tara had wet and messed herself, their faces turning red from laughing, tears of joy streaming down their faces. \"Alright girls, settle down, I know it's humorous, but let's just try to have a nice, relaxing breakfast.\" Catherine smirked, bringing the prepared dishes to the table. \"After we eat, I'll decide what to do with your mother.\" <br>\r\n<br>\r\nTara reluctantly sat down, blushing profusely as Jazmin and Kayla stole looks at her and laughed throughout the meal, Catherine happily humming and smiling as she ate. Tara had to admit she was absolutely mortified, but the sudden submission she felt, and the domination from Catherine, it excited her a little bit. But she couldn't display that in front of her daughters, especially now. <br>\r\n<br>\r\nChoice 1: Catherine takes Tara upstairs after telling the girls that she'll give her a spanking, but lets her go with a \"warning\" and that she'll be dealt with when she gets home from work.<br>\r\n<br>\r\nChoice 2: Catherine takes Tara upstairs and gives her a sound spanking, loud enough for both daughters to hear it happening. <br>\r\n<br>\r\nChoice 3: Catherine takes Tara over her knee right there at the table, spanking her in front of their daughters, perhaps even letting the two young girls join in! </span></div></div>",
            "created":1526792400,
            "id":2496069,
            "title":"Tara's wife humiliates her!"
        },
        "1152":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Catherine hears the girls laughing and brings them in to help her!",
                "Catherine hears the girls laughing and brings them in to spank them!",
                "Tara's spanking continues!"
            ],
            "content":"<div class=\"\"><div> <span>As the meal came to a close, Jazmin and Kayla both feverishly typing who-knows-what into their phones, Catherine cleared her throat: \"Alright girls. It's off to school for you, and before your mother heads off to work, I'm going to give her a sound spanking. Have a good day!\" The girls slowly stood as they laughed, very slowly getting their backpacks and other belongings ready to leave. <br>\r\n<br>\r\nTara sat in shame for a moment before Catherine grabbed her ear and brought her up, leading her through the halls by her ear. \"Ow! Ow ow ow! Catherine, owie! You can't do this, I'm not one of the girls!\" Catherine laughed, \"Like I said sweetie, you did something naughty, you're going to get punished.\" Tara merely winced in pain as she was brought into her bedroom, the door closing behind her. \"But I didn't do it! You did something to me!\" Tara whispered hotly, motioning down to her pants, which clung to her skin tightly as they were still soaked through. Catherine giggled, \"Yes, I did. I just feel like there's needs to be some more order and structure in this house! And that order and structure begins with you, at the bottom.\" Tara stoop up straight. She was surprised to hear her wife speak those words, but felt herself aroused by them at the same time. \"A-at the bottom?\" She asked. \"You mean... even the girls are above me?\" Catherine nodded slowly as she sat down on the bed. \"Yup! Now come over here for your first spanking.\" \"First...?\" Tara asked, slowly walking towards Catherine. <br>\r\n<br>\r\nTara yelped as Catherine quickly pulled the short brunette over her knee and immediately began spanking.<br>\r\n<br>\r\nSMACK SMACK SMACK!<br>\r\n<br>\r\n\"Owie! Sweetie you're hitting really har- ouch ouch ouch!\" Tara whined as Catherine's swats rained down, the short woman lurching forward with the sting of each spank. As much pain as it was, and as embarrassing as it felt, Tara loved the feeling of her wife's hand firmly slapping down against her bubble butt, making it bounce around even in the tight pants she was wearing. Very quickly into the punishment, Tara decided to accept her fate and took her spanking with minimal fuss, albeit once in a while yelping \"Owie! Ouch!\" due to a particularly good spank.<br>\r\n<br>\r\nOutside the bedroom door, Jazmin and Kayla stood laughing quietly, Jazmin even taking out her phone and recording a video \"My mom is spanking my other mom right now!!!!\" with the sounds of the event very noticeable even from the audio of her phone, the loud sharp smacks echoing through the room and into the hallway. <br>\r\n<br>\r\nTen minutes later, Catherine slowly stood her wife up with a smile. Tara rubbed her bottom gingerly, \"Ugh... it's probably so red! It'll be so sore to sit down on...\" Tara whined. \"Oh, don't worry! It'll get better. Pants down.\" Tara gasped. \"Catherine!\" she exclaimed in a hushed tone. \"Spanking me is one thing, but over my panties? What's next?\" \"On your bare bottom?\" Catherine responded as if it was obvious. <br>\r\n<br>\r\nJazmin and Kayla barely contained themselves at the advancement in conversation they were overhearing. <br>\r\n<br>\r\n\"Come on, sweetie,\" Catherine said, \"if you're going to be on the bottom - and you will be, trust me - you can't fight me on every order I give you. Now drop your pants before I pull them down for you.\" Tara opened her mouth to speak, but was quickly silenced by a firm swat to her rear end. Blushing, she slowly unbuttoned and unzipped her pants and stepped out of them, leaving her in only the yellow \"Spank Me' panties. Catherine laughed loudly, \"Interesting choice of panties, babe. 'Spank Me'? Really? Well, I suppose I'll just have to.\" Catherine smirked, Tara blushing profusely before obediently bending back over her wife's knee. <br>\r\n<br>\r\nOutside, Jazmin was covering Kayla's mouth with one hand, and recording with the other as she got all of the embarrassing encounter on video. Then the halls were once again filled with the sharp smacks of Tara's spanking: <br>\r\n<br>\r\nSMACK SMACK SMACK!<br>\r\n<br>\r\n\"Mmph! Okay, that huu-URTS a bit more!\" Tara whined softly, gripping the bed sheets as her bottom bounced around excessively in the tight cute panties. \"It's a spanking, it's supposed to hurt.\" Catherine lectured with a smile as she continued. \"And you'd better get used to it, because it's only the first of many. I know I'm looking forward to it.\" Tara sighed and pressed herself into the bed as Catherine smacked her bottom repeatedly, her previously pale white bottom now turning a beautiful deep shade of red under the yellow panties as it bounced around. </span></div></div>",
            "created":1526965200,
            "id":2497230,
            "title":"Catherine spanks Tara privately."
        },
        "12":{
            "author_id":"bimbofuta",
            "author_name":"BimboFuta",
            "choices":[
                "Tara wakes up and decides to \"try new things\" with her wife.",
                "One of her own daughters - absolutely mortifying! ",
                "A stranger on her morning commute to work.",
                "Someone at work - whether customer of co-worker!",
                "A thief broke in and subsequently humiliates Catherine!"
            ],
            "content":"<div class=\"\"><div> <span>Catherine, the more dominant-seeming mother of the family, is about to have her world changed forever.Some way or another, she will become the laughing stock, or visual pleasure, of the rest of the world and her own dismay. <br>\r\n<br>\r\nCatherine woke up as usual, her alarm clock blaring in her ear as she lay in bed, warm and cozy next to her wife, Tara. She quickly silenced the alarm so as to not wake up her partner, rubbing her eyes and sighing gently. She sits up slowly, groggy, smiling at her slumbering wife, who's breasts are barely contained in the tight white bra she wore to sleep, her matching panties likely looking beautiful as usual on her. <br>\r\n<br>\r\nCatherine slowly shifted out of bed, heading to the dresser, her feet pressing softly against the carpet, wood scraping against wood as she pulled the drawer out to get her outfit nice and ready. She found a pair of pink panties with hearts on them and slipped them on, finding a matching bra and fitting it tightly onto her breasts before clasping it, and assembling her work uniform. She put on her store's standard T-shirt, and got on a pair of black skinny jeans, struggling to fit them onto her large rear end, jumping slightly to get her wobbling bottom into the tight black fabric. After a few moments of struggle, she managed to get them on, albeit very tightly, noting how the crease in the back wedges firmly between her fat cheeks, giving her a bit of a pants-wedgie. She dismissed it, knowing it wouldn't be a problem, and began to get ready to head downstairs for breakfast, unknowingly tucking her shirt into her panties, the waistband of which was above her jeans, leaving the embarrassing pink fabric on display. <br>\r\n<br>\r\nWho humiliates Catherine?</span></div></div>",
            "created":1522990800,
            "id":2475853,
            "title":"Catherine"
        }
    },
    "info":{
        "author_id":"bimbofuta",
        "author_name":"BimboFuta",
        "brief_description":"A story about a family of women that are constantly put into humiliating situations.",
        "created":1523051820,
        "description":"<td align=\"left\" class=\"norm\">In this story, one or more women will be the center-focus of all of the rest of the chapters. That girl will either be humiliated or humiliate others, not necessarily restricted to just women in the family. <br>\r\n<br>\r\nAny given fetish is allowed, but there are a few rules: <br>\r\n<br>\r\nNo death (if you want to remove a character, write them out, don't kill them. This way they can return if someone wants them to and it doesn't get messy.)<br>\r\n<br>\r\nBe grammatically competent. Chapters can be as long or short as you'd like, but they need to be readable.<br>\r\n<br>\r\nDon't ruin a line of chapters by shifting focus to another character. Either follow that character's line, or make an option to shift focus as an addition to a chapter for that character - don't ruin other people's chapter lines.<br>\r\n<br>\r\nIf you want to include a fetish that \"doesn't fit\", or is otherwise \"out there\", make it one of the options at the end of a chapter so you don't \"ruin\" the chapter(s) for anyone uninterested in that fetish.<br>\r\n<br>\r\nNo males. Pretty simple.<br>\r\n<br>\r\nAs I said before, any fetishes are allowed, from spanking to wedgies to watersports! As long as it involves humiliation in even the slightest way, it's fine! Have fun! </td>",
        "id":2154632,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1527028500,
        "modified":1527028500,
        "pretty_title":"Female Family Humiliation"
    }
}