{
    "chapters":{
        "1":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin goes home",
                "Kevin goes to the mall",
                "Kevin attends a sporting event",
                "Kevin visits his friends",
                "Kevin goes somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Kevin Staples has always been a guy with a big heart.<br>\r\n<br>\r\nWhen he was fifteen years old, he jumped in a lake and rescued his dog Rover, after the dog slipped into the lake, which was right behind the house where he lived. <br>\r\n<br>\r\nWhen Kevin was sixteen, he spotted an oncoming truck when a little toddler had strolled onto the street in front of his house. The toddler never saw the truck coming, but Kevin ran and grabbed the little boy just before the truck slowed down.<br>\r\n<br>\r\nAfter his seventeenth birthday, Kevin rescued a boy during a weekend-long camp which was organized by the Boy Scouts. The boy got lost during a long hike up a mountain, and Kevin searched for the lost scout until he found the boy, while he was hiding in a cavern. The younger scout was tired and hungry, but Kevin had given him food and water, and he led the lost scout back to camp.<br>\r\n<br>\r\nRight after Kevin's eighteenth birthday, he came to the aide of a boy in school, who was being bullied by a senior in high school. Kevin had stopped the fight and he had persuaded the bully to leave the boy alone. The bully decided to leave, and the boy thanked Kevin repeatedly.<br>\r\n<br>\r\nWhen Kevin was about to leave the schoolyard, the boy called out his name.<br>\r\n<br>\r\n\"Kevin! Kevin!\" the boy shouted to him.<br>\r\n<br>\r\nKevin stopped and turned around, thinking that the boy probably had wanted to thank him one last time. <br>\r\n<br>\r\n\"There is something I need to tell you...\"<br>\r\n<br>\r\n\"What is it?\" Kevin wondered. \"I need to get home and work on a paper, which is due tomorrow. I don't have much time...\"<br>\r\n<br>\r\n“My name is Nuncio…” the boy replied. “I have seen your good deeds, and I have come to grant you your reward for your compassion and generosity!”<br>\r\n<br>\r\n“What?”<br>\r\n<br>\r\n“I’m a messenger from heaven…” Nuncio continued. “I have watched you since you were young, and I have seen how you have helped and saved lives of others. Plus, your father and mother have done a tremendous amount of volunteer work, so the sense of compassion has been instilled in you as well…”<br>\r\n<br>\r\nKevin’s father was a doctor and his mother worked for the hospital. In fact, his mother would ride in an ambulance and help those who needed medical assistance. After his parents got divorced, he continued to live with his mother and he often spent weekends at his father’s house, whenever his father didn’t have to be in the hospital.<br>\r\n<br>\r\n“How do you know all that? What do you want from me?” Kevin stuttered, as he listened to the strange boy.<br>\r\n<br>\r\n“From now on, you will have the power to assist other young men who are the same age as you, or younger! You may only use your power as long as it is beneficial to those, who you use it on. You cannot use your power to harm or hurt anyone. Your powers will not work if you use them for evil or selfish purpose. Other than that, you will have the ability to change and grow any young male, who is your age or younger. Your powers will not work on girls or young women!”<br>\r\n<br>\r\n“You must be joking, right?”<br>\r\n<br>\r\n“No, Kevin… I’m very serious.” Nuncio replied. “Use your new powers wisely. Help the boys and young men. Make them into athletes, workers, and men, who will contribute something useful to society. Don’t worry about the women, for they will have their own angels, who have the ability to change them, just like you have the ability to change men or boys. Focus on helping young men, and you’ll do fine!”<br>\r\n<br>\r\n“But… What if I screw up? What if I make a mistake?”<br>\r\n<br>\r\n“I will follow you and watch what you do. If you need me, I’ll be there!”<br>\r\n<br>\r\nThen, the boy slowly faded away. Within moments, Nuncio had disappeared.<br>\r\n<br>\r\nKevin was left standing alone in front of his school. What was he going to do now?<br>\r\n</span></div></div>",
            "created":1166158800,
            "id":365993,
            "title":"Kevin gets his powers from an angel named Nuncio"
        },
        "11":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin meets another boy on the street",
                "Kevin spots a boy with a basketball",
                "Kevin spots a boy carrying a football",
                "Kevin walks past a gym",
                "Kevin sees a small group of boys"
            ],
            "content":"<div class=\"\"><div> <span>As Kevin started walking down the street, he spotted one of his classmates from the distance. He saw John, who was one of the freshmen in high school. Kevin was a senior, so he was one of the oldest kids in school. He knew john from band practice and from the swim team at school.<br>\r\n<br>\r\nKevin had wanted to stop and talk but John walked right by him, just uttering “Hi” as he passed him. Kevin just turned around and stared at the boy, who just continued to walk straight ahead, heading past the school’s entrance where Kevin had just come from.<br>\r\n<br>\r\n“I wanted to talk to him” Kevin thought to himself. He wished that John was standing in front of him.<br>\r\n<br>\r\nSuddenly, John disappeared from where he was walking, and he popped up standing right in front of Kevin!<br>\r\n<br>\r\n“What the heck??” John gasped, when he realized that he had somehow been teleported to stand in front of Kevin.<br>\r\n<br>\r\n“Hi John… How are you?” Kevin asked him.<br>\r\n<br>\r\nJohn wanted to turn around and walk away, but somehow it seemed as if something was making him stand and talk to Kevin.<br>\r\n<br>\r\n“I’m okay…”<br>\r\n<br>\r\nKevin looked down and stared John in the eyes. Somehow, he suddenly knew everything that John was thinking and feeling at that point in time. Not only that, but he felt what John’s thoughts and feelings are. He learned what he liked and disliked, and what his dreams and wishes were. Kevin immediately realized that John was on the swim team and that he had always wished he was taller.<br>\r\n<br>\r\n“You wish you were taller, don’t you?” Kevin grinned.<br>\r\n<br>\r\n“How did you know that?” John piped up. He took a step back, because he was just in shock. How did Kevin know something that he has never told anyone before?<br>\r\n<br>\r\n“Don’t be afraid of me, John… Just relax…” Kevin said.<br>\r\n<br>\r\nSuddenly, a feeling of silence and calmness came over his body. No longer was he feeling anxious or scared or nervous, after he learned that Kevin had mentioned one of his deepest secrets.<br>\r\n<br>\r\nKevin just smiled as he stared at him. He knew everything about the boy, who was now standing before him. In fact, he realized that with his divine powers, he was able to make John whatever he wanted.<br>\r\n<br>\r\n“I can make you a few inches taller right now…” Kevin whispered to him.<br>\r\n<br>\r\nSuddenly, a warm feeling came over John’s body. Instantly, his legs started to grow longer and longer, and his torso grew longer as well. Within a matter of moments, John had grown almost six inches taller, all in a matter of just six seconds!<br>\r\n<br>\r\n“Wow!” John gasped. “How did you do that?” <br>\r\n<br>\r\nJohn just looked down at his legs and immediately noticed that he was a bit taller. Everything and everyone seemed shorter, since he had now grown a bit taller.<br>\r\n<br>\r\n“Are you happy?” Kevin asked him. Of course, he already knew the answer.<br>\r\n<br>\r\n“I want you to be back at your house now…” Kevin said. <br>\r\n<br>\r\nInstantly, John disappeared and reappeared in front of his own house. He was teleported there in a fraction of a second!<br>\r\n<br>\r\nKevin just smiled. <br>\r\n<br>\r\n“Wow… This is such incredible power!” he thought to himself. “I changed him and teleported him, and it was incredibly easy!”<br>\r\n<br>\r\nHe just smiled as he pondered what to do next.<br>\r\n<br>\r\n</span></div></div>",
            "created":1166245200,
            "id":366129,
            "title":"Kevin experiments with John"
        },
        "111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "He helps somebody else on the street",
                "He meets a friend from school"
            ],
            "content":"<div class=\"\"><div> <span>Kevin started walking down the street and saw a boy walking towards him, who seemed really skinny. <br>\r\n<br>\r\n\"Poor kid...\" he thought to himself. \"He'd look better if he'd only add ten more pounds of muscle on him...\"<br>\r\n<br>\r\nSuddenly, the boy stopped and gasped, as his muscles started to grow just slightly! He stopped and looked at his arms and legs. They appeared to bulk out a little. His arms grew just a little thicker, and his quads and calves became more defined. His chest suddenly pushed out by two inches. <br>\r\n<br>\r\nKevin noted how the boy was examining his newly formed muscles and chuckled to himself.<br>\r\n<br>\r\n\"That was awesome! It worked!\" he whispered, as he passed the boy, who was only wearing a pair of shorts.<br>\r\n<br>\r\nWhat was he going to do next?</span></div></div>",
            "created":1184734800,
            "id":426886,
            "title":"Kevin helps a skinny boy gain come some muscle"
        },
        "1111":{
            "author_name":"sofar togo",
            "choices":[
                "the stronger kid begins to bully josh",
                " kevin removes the growth spurt"
            ],
            "content":"<div class=\"\"><div> <span>Kevin suddenly notices a boy about 14 being lifted up by the high school bully Josh Morrison.<br>\r\n<br>\r\n\"Poor kid I wish he had a fighting chance.\" Kevin said. without realizing he done so the boy began to grow to the height of Josh and his muscles bulging so that his bicep ripped his sleeve.<br>\r\n<br>\r\nwow! exclaimed the boy. then he looked at his bully with blazing eyes.</span></div></div>",
            "created":1185858000,
            "id":430665,
            "title":"beef uped"
        },
        "11111":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin walks to the gym",
                "Kevin meets the boys' swim team"
            ],
            "content":"<div class=\"\"><div> <span>Timmy, the little boy who suddenly experienced a growth spurt following Kevin's wish, was now looking down at Josh, who was bullying him just moments before. Timmy used to be short, skinny and weak, but now, he was big, tall, and muscular!<br>\r\n<br>\r\nTimmy placed his hands by his sides and stared at Josh with an angry look on his face.<br>\r\n<br>\r\n\"Now, you were trying to lift me up, huh?\" he said to Josh.<br>\r\n<br>\r\nJosh's mouth dropped wide open after he witnessed Timmy's sudden growth spurt.<br>\r\n<br>\r\n\"What the heck? NOBODY grows that fast! I'm outta here!!!!\" Josh stuttered, as he turned around and ran away from Timmy, as fast as he could, while trembling with fear.<br>\r\n<br>\r\nKevin saw this from a distance and laughed, as he continued to walk around the school.<br>\r\n<br>\r\nWhere would he go next?<br>\r\n</span></div></div>",
            "created":1186290000,
            "id":432642,
            "title":"Josh gets scared"
        },
        "11112":{
            "choices":[
                "he decides to do this nationwide",
                "he does this just to them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kevin decides that this is too far and puts them both on an even footing so that neither can hurt each other.</span></div></span></div>",
            "created":1362014100,
            "id":1540781,
            "title":" kevin removes the growth spurt"
        },
        "112":{
            "choices":[
                "He decides to watch Gabe's game, where more changes are in store",
                "He leaves the arena and runs into someone he knows"
            ],
            "content":"<div class=\"\"><div> <span>Keven then heard the sound of a ball bouncing coming from behind him.  He turned around, and saw that a boy was walking down the sidewalk towards him, dribbling a basketball.  The boy was rather short, coming in at only 4'4\", and was very skinny, with bright red, spiky hair.  Kevin looked at him for a moment, and came to realize that the boy's name was Gabe, that he was eleven years old, and that he had dreams of playing basketball in the NBA, but that no matter how good he was or how hard he practiced, his coaches would always say he was too short, and would never start him.  He wished to be taller, but the doctors would say that he wouldn't grow any taller than 5' 2\", even as an adult. Kevin decided to rectify that problem.<br>\r\n<br>\r\nWhen Gabe got close to Kevin, Kevin simply called out, \"Gabe!\"  Gabe turned and looked at Kevin.  Though he was a friendly kid, he was also weary of talking to strangers, so he nervously said, \"Hi.\"<br>\r\n<br>\r\n\"I see that you like basketball, Gabe,\" Kevin said.  \"That you dream of playing in the NBA someday.\"<br>\r\n<br>\r\n\"Uh, yeah,\" Gabe said.  \"But I can't.  I'm too short.\"<br>\r\n<br>\r\n\"What if I told you that I could help you get in the NBA right now?\" Kevin asked.<br>\r\n<br>\r\n\"Huh?\" Gabe said, dumbfounded.  \"What are you talking about?\"<br>\r\n<br>\r\n\"I can't really explain,\" Kevin said, \"but if you want to, I can help you.  Do you trust me?\"<br>\r\n<br>\r\n\"Well...\" Gabe said, trying to decide if it was worth believing this stranger in order to pursue his dream further.  '\"...Okay.  What do I have to do?\"<br>\r\n<br>\r\n\"Nothing,\" Kevin said.  \"Just stand right there.\"  Kevin closed his eyes, and pictured Gabe growing and becoming taller than anyone he knew.<br>\r\n<br>\r\nGabe looked at Kevin with a quizzical look, trying to figure out what this strange older boy was doing with his eyes closed, lost deep in what looked like a trance.  After a few seconds, though, Gabe felt his legs begin to burn, and he looked down at them, only to notice that they were becoming longer, and that his face was becoming farther and farther from the ground!<br>\r\n<br>\r\nAs his legs grew longer, his torso also stretched out, and quickly Gabe felt every muscle and bone in his body vibrate and stretch with a tremendous growth surge.  He quickly grew past five feet, and then five and a half.  He was now taller than Kevin was, and wasn't slowing down!  Six feet, six and a half, seven!  He kept growing and growing.  His clothes were getting bigger with him, luckily, and now seemed to be an extra extra large, at least.<br>\r\n<br>\r\nAnd as quickly as it started, the tingling stopped, and his growth slowed down, finally halting at an amazing seven feet eleven inches.  \"Wow!\" was all Gabe could say, as he looked over his now lanky arms and legs, and looked down at Kevin's face, which was now beaming up at him, proud.<br>\r\n<br>\r\n\"Well, I'm not done yet,\" Kevin said, and he closed his eyes again. This time, he focused on Gabe's muscles, and Gabe felt his arms and legs pulsating with power, his biceps and triceps, his pecs and abs thickening, ripping and tearing and mending again all in one instant.  It was like he was getting years worth of working out all in just a few seconds.  He kept packing on the muscle until, finally, Kevin opened his eyes again, and the muscle growth stopped, with Gabe now the strength of a giant.  He still had a lean figure, with no excess weight on him, but his arm, chest, and leg muscles now bulged outward with an immense power.  <br>\r\n<br>\r\n\"Almost done,\" Kevin said.  \"Now I have to change the world to fit you.\"  He concentrated again, and Gabe felt his mind now changing, and the world growing hazy around him.  He closed his eyes, and memories rushed into his consciousness: of going to the doctor at two years old, already four feet tall and growing; of first picking up a basketball and taking to it instantly; of going to elementary school, towering over his classmates; of being approached by an NBA scout seeing him play at a pickup game in the park, and being offered a tryout; of knocking the socks off of the scouts and being signed to a nice contract, and working his way into the starting rotation, the tallest and strongest player in the league.  <br>\r\n<br>\r\nGabe opened his eyes back up and looked down.  The setting around him had changed, he was now in the locker room of the Orlando Magic, dressed in a jersey that had his name on the back, and ready to play.  The rest of his team had already started heading towards the court, and he heard the crowd chanting, \"We want Gabe! We want Gabe!\"<br>\r\n<br>\r\nGabe looked at Kevin, who was now sitting down on the bench, smiling, with tears in his eyes.  This was everything he had dreamed of, all coming true at once!  \"Thank you,\" he whispered softly.<br>\r\n<br>\r\n\"Don't mention it,\" Kevin replied.  \"Now get out there and make me proud!\"<br>\r\n<br>\r\nHe slapped Gabe on the backside, and Gabe ran out to the team, to the cheers of adoring fans.  Kevin quietly slipped out the back of the locker room, pleased with himself, and contemplating what to do next.</span></div></div>",
            "created":1266382800,
            "id":837682,
            "title":"Kevin spots a boy with a basketball"
        },
        "114":{
            "author_id":"flare",
            "author_name":"Zazu",
            "choices":[
                "Keving grows the young boy again.",
                "Kevin grows someone else in the gym.",
                "Kevin heads to the mall."
            ],
            "content":"<div class=\"\"><div> <span>Kevin walked a few more blocks down the street. As he was passing the local gym, he saw two older, larger guys picking on a younger, weaker kid, who appeared to be about 14 years old. The kid was bone thin while the other two guys were muscular and probably spent a lot of time in the gym, and they were using that to their advantage.<br>\r\n<br>\r\nKevin couldn't hear what was happening, but it was apparent that the older guys were threatening the younger one, so Kevin decided to help the guy out. He concentrated on growing the younger one's muscles. His muscles started rapidly inflating. His biceps became bowling balls, his pecs became giant orbs of power, his abs became a six-pack of bathroom tiles, his legs lengthened and his calves became soccer balls. He also became 7' 6\", now towering over his tormentors. However, there was a sudden flash, and suddenly they weren't his tormentors anymore, as the three of them were now working out together and laughing like old friends. Kevin was glad he improved another life.</span></div></div>",
            "created":1290747600,
            "id":1001984,
            "title":"Kevin walks past a gym"
        },
        "115":{
            "author_id":"citywalker",
            "author_name":"citywalker",
            "choices":[
                "Grow Ethan and Jaden some more -- this time focussing on height!",
                "Turn his attention to grow Troy some",
                "Leave the boys and find some other boy(s)"
            ],
            "content":"<div class=\"\"><div> <span>The rest of Kevin's walk home turned out to be uneventful, not passing any other boys who he could test his powers on. As he walked up the front steps to his house, however, he heard the sound of boys laughing and yelling coming from the backyard of the house next door.<br>\r\n<br>\r\nHe crossed through his house, noting that he was the only one home right now, and headed to the backyard. The neighbor's yard was separated from his by a wooden fence, but one that only stood five feet high so Kevin could still look over it and see what was happening on the other side. Three boys were playing in the backyard, running around and chasing each other. Kevin recognized one of the boys as Ethan, the 11-year old who lived there. Ethan was a skinny kid but rather tall for his age, just a couple inches under five feet, fair-skinned with medium-length, unkempt blonde hair and green eyes. He was an only child and didn't usually have many friends over, mostly staying inside playing video games or reading, so Kevin was glad to see him outside getting exercise and having fun with boys his own age.<br>\r\n<br>\r\nHe walked over to the fence and leaned his arms against it, casually watching the boys play. They seemed to be running at each other, dodging free and avoiding hitting each other at the last minute.<br>\r\n<br>\r\nAfter a few minutes, one of Ethan's friends, a shorter black boy, slightly more toned than Ethan, with his hair in medium-length twists, looked up and saw Kevin. \"Hey, Ethan,\" he said, \"who's that?\"<br>\r\n<br>\r\nEthan looked over, saw Kevin, and smiled. \"Oh, hi Kevin!\" he said, waving. \"Jaden, he's just our neighbor; he lives there.\" He pointed to Kevin's house.<br>\r\n<br>\r\nJaden nodded and turned his attention back to the task at hand: getting in position and ready to run towards the third boy, standing at the other side of the yard, a slightly stocky boy almost as tall as Ethan, with tanned skinned and short brown hair.<br>\r\n<br>\r\n\"What are you guys doing?\" Kevin asked, smirking a little.<br>\r\n<br>\r\n\"Oh, we're just playing Flinch-Out,\" Ethan answered. \"We each take turns running at each other at full speed. Whoever flinches or slows down first is the loser. Troy's winning, so far,\" he said, indicating the boy who was at the other end of the yard.<br>\r\n<br>\r\nKevin chuckled and shook his head. It sounded kinda stupid, but he remembered doing a lot of stupid stuff when he was younger.<br>\r\n<br>\r\nBoth he and Ethan watched as the other two boys started running at each other. Each seemed to be getting faster, gaining speed as they got closer to each other, until...<br>\r\n<br>\r\nSMACK<br>\r\n<br>\r\n\"Owwwww,\" Jaden said, having fallen to the ground. He rubbed his head, wincing. \"You head-butted me!\"<br>\r\n<br>\r\n\"No, you just ran into my head!\" Troy said, hopping to his feet. He offered a hand to Jaden and helped him up. The two then brushed their clothes clean of the dirt and grass on them.<br>\r\n<br>\r\n\"Maybe we shouldn't play this any more, guys,\" Ethan said. \"I don't think my mom wants to take any of us to the hospital.\"<br>\r\n<br>\r\n\"Well,\" Troy said, \"then what should we do?\"<br>\r\n<br>\r\nEthan looked at Kevin. \"What do you think, Kevin? Have any ideas?\"<br>\r\n<br>\r\nA little surprised to be asked for his opinion, Kevin had to think for a moment before finally suggesting, \"How 'bout wrestling? That's a little safer... probably.\"<br>\r\n<br>\r\nThe three boys seemed to like that suggestion, and they started talking about who should go first. Kevin, though, smiled as he thought about how he could have some fun with this. Finally, the boys were ready.<br>\r\n<br>\r\n\"Ladies and gentlemen,\" Troy said, in a manner like a ringside announcer, talking to no one in particular, \"our first matchup tonight--\"<br>\r\n<br>\r\n\"Tonight?\" Jaden interrupted. \"It's 3:30 in the afternoon!\"<br>\r\n<br>\r\n\"Shuddup!\" Troy said, then continued. \"Our first matchup tonight features two of the greatest wrestlers ever to enter the ring! In this corner,\" he motioned to Jaden, \"standing four feet five inches tall and weighing in at seventy-six pounds--\"<br>\r\n<br>\r\nJaden punched Troy in the arm. \"Hey! It's seventy-nine now!\"<br>\r\n<br>\r\n\"--Seventy-nine pounds, please welcome Jaden 'The Chocolate Volcano' Clark!\"<br>\r\n<br>\r\nJaden strutted around in a circle, waving to an imaginary crowd as Troy mimicked the sound of people cheering, with a few boos mixed in for good measure.<br>\r\n<br>\r\nOnce Jaden finished, Troy continued, \"And in this corner,\" he motioned to Ethan, \"standing four feet ten inches tall and weighing in at eighty-four pounds, please welcome Ethan 'Beanpole' Christensen!\"<br>\r\n<br>\r\nEthan shook his head, smiling, then gave a half-hearted wave while Troy made the crowd sounds again. Finally, Ethan and Jaden got into position. \"Alright, gentlemen,\" Troy said, \"I want a good clean match. No fighting dirty. Are you ready?\" Both boys nodded. \"Then... FIGHT!\"<br>\r\n<br>\r\nThe two boys began circling around, poised and ready. Jaden made the first move, trying to grasp Ethan around the waist. Ethan eluded his grasp, twisting around, causing Jaden to lose his balance. He then jumped onto Jaden's back, trying to bring him to the ground.<br>\r\n<br>\r\nAs Kevin watched from the other side of the fence, he couldn't help but think that he should try to make the match more interesting, and now was as good a time as any. He waited until Jaden was pinned down, trying to break free from Ethan's grasp, then slowly concentrated on increasing Jaden's muscles. Jaden's already well-built (for his age) chest began to push outward, causing his shirt to get tighter. His abs became more developed, and his arms swelled outward, the fabric of his sleeves pressing into his biceps. Kevin also made sure that Jaden's leg muscles kept up with the rest of the boy's body, causing his thighs to swell and his calves to harden and stick out like softballs. In order to get all these muscles to grow, Kevin also had to make the boy's frame bigger, adding several inches to his height.<br>\r\n<br>\r\nAll these changes occurred over the course of a few seconds, and Jaden was quickly able to turn the tables and start pinning down Ethan. Fair's fair, Kevin thought, and he began to shift his attention over to Ethan. There was less for him to work with here as Ethan was very slender, so Kevin first added a muscle base all over Ethan's body, then narrowed his focus to the upper body, causing his chest to swell out and push against his arms, which were also adding on pound after pound of muscle. His abs became incredibly well-defined to the point where they started forming a \"V-shape.\" Kevin also made sure Ethan's legs weren't left out, giving them the same treatment as Jaden's. Since Ethan already was taller with a larger frame, Kevin decided to just broaden his shoulders a little and then switch back to focus on his muscles, making them so big that he heard a loud RIPPPPPP as Ethan's shirt and shorts began to tear.<br>\r\n<br>\r\nWith all these extra muscles, Ethan was easily able to overcome Jaden and pin him down. Troy counted out, and then grasped Ethan's wrist. \"The winner: Eth--What the hell?!\" It was only now that the boys began to notice the changes Kevin had made. Jaden and Ethan both jumped to their feet and examined their own bodies, running their hands up and down the smooth curves of their arm muscles. Jaden's clothes, tight as they were, still were able to stay together, though his too-short shirt now revealed his six-pack abs. Ethan's clothes, however, were in tatters, and everyone could see the incredible chest and leg muscles underneath them, not to mention his amazing eight-pack abs.<br>\r\n<br>\r\n\"We - we've gotten huge!\" Ethan cried out. He then noticed Jaden looking at him straight in the eye, without having to tilt his head up. \"And you've gotten taller!\"<br>\r\n<br>\r\n\"Holy crap!\" Jaden exclaimed. \"This is awesome!!\"<br>\r\n<br>\r\n\"How the hell did you guys do that?\" Troy asked, slightly jealous that he didn't get any of the changes.<br>\r\n<br>\r\n\"I have no idea,\" Ethan said. \"Hey, watch this!\" He brought his arms into a pose, causing his muscles to flex. Troy's eyes widened as he could see thick, pulsing veins running through the muscles. The remains of his shirt completely tore off, and what looked like rags fluttered to the ground, leaving Ethan's smooth, sculpted torso completely bare.<br>\r\n<br>\r\nKevin enjoyed watching this display of his work, deciding not to say anything to the boys, at least not just yet. As they continue to marvel at themselves, Kevin decided what to do next.</span></div></div>",
            "created":1306558800,
            "id":1114812,
            "title":"Boys Playing In The Backyard"
        },
        "12":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin teleports other boys",
                "Kevin makes more boys' muscles grow",
                "Kevin decides to make a few boys grow taller",
                "Kevin decides to have some fun with some other boys",
                "Kevin sees a few boys in the sporting goods store"
            ],
            "content":"<div class=\"\"><div> <span>Kevin walks into the mall and enters right in front of the large movie theater, where he overhears a conversation between two teens.<br>\r\n<br>\r\n\"Golly! We got the two tickets to see the movie, but we are one Dollar short to pay the entry fee!\" one teen says to the other. The boys were about 12 years old.<br>\r\n<br>\r\n\"Poor kids...\" Kevin thought to himself. \"If only they were already standing inside of the lounge of the movie theater, they wouldn't have to pay the one-Dollar entry fee...\"<br>\r\n<br>\r\nSuddenly, the two kids vanished into thin air, and they reappeared a fraction of a second later, inside of the movie theater! They were right in the center of the lounge area! Kevin had just teleported the boys there, with his wish!<br>\r\n<br>\r\n\"Holy smoke! How did we get in here so fast?\" the boys wondered. They looked around, feeling a bit confused.<br>\r\n<br>\r\n'It doesn't matter! We didn't have to pay! Let's go in and watch the movie!\" the other teen said. Both boys then turned around and walked away.<br>\r\n<br>\r\nKevin just grinned. <br>\r\n<br>\r\n\"That was so cool! I actually teleported them inside of the theater! I wonder what else I can do to any other boy I see, who is in need?\" he wondered.<br>\r\n</span></div></div>",
            "created":1186290000,
            "id":432669,
            "title":"Kevin teleports two teens into the movie theater"
        },
        "124":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "\"Every girl in the world would be crushing on us!\"",
                "\"We were really buff!\"",
                "\"We were super smart!\""
            ],
            "content":"<div class=\"\"><div> <span>Kevin saw two boys, Jordan and Tyler, leaning against a nearby wall, sighing.<br>\r\n<br>\r\n\"Man, I wish that I didn't have all this acne!\"<br>\r\n<br>\r\n\"I know how you feel, I--\"<br>\r\n<br>\r\nCut off there, the boys instantly didn't have any acne and looked somewhat attractive. Some girls passed by and took note. They liked the attention. They then realized that somehow wishing for their acne to be gone, it was, as they saw their reflections in a nearby mirror. Kevin felt inclined to answer more of their wishes...<br>\r\n<br>\r\n\"OMG, Tyler! It's like...like...\"<br>\r\n<br>\r\n\"We wished to lose our acne, and we did?\"<br>\r\n<br>\r\n\"Pretty much, yeah!\"<br>\r\n<br>\r\n\"Awesome!\"<br>\r\n<br>\r\n\"Maybe we should wish for something else...how about you go first?\"<br>\r\n<br>\r\n\"Okay, I wish...\"</span></div></div>",
            "created":1265864400,
            "id":834612,
            "title":"Kevin decides to have some fun with some other ..."
        },
        "1242":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "he spotted a lone, skinny 10-year-old boy walking around in the mall",
                "he spotted a lone, chubby 12-year-old boy walking around in the mall",
                "he spotted a lone, skinny 14-year-old boy walking around in the mall"
            ],
            "content":"<div class=\"\"><div> <span>Kevin spotted two teenage boys leaning against the wall at the shopping mall. Their names were Jordan and Tyler. Jordan was short and slightly stockier. Tyler was taller and skinny. Neither had much muscle at all. They were both wearing t-shirts and shorts. Tyler had short blond hair and Jordan had longer, straight, black hair. <br>\r\n<br>\r\n“Dang, dude! What the hell?” Jordan said as he looked at the mirror. One of the walls had a big mirror hanging from it. “I just lost all the acne on my face! What happened?” <br>\r\n<br>\r\n“Shoot, man! You know what would be great? If we were to grow big and buff right now! Chicks would be so into us!” Tyler giggled.<br>\r\n<br>\r\n“Not just chicks… Other guys would be into us, too!” Jordan added. Jordan was secretly gay as well. <br>\r\n<br>\r\nKevin heard the boys utter their wishes and he pointed his finger at them, allowing them to bulk up, one body part at a time, starting with their best features first. <br>\r\n<br>\r\nJordan, the shorter boy, suddenly felt his arms bulge all over. His triceps and biceps inflated with incredible muscle, to the point where he ripped out of his shirt sleeves! After a few moments, his biceps were covered with veins all over as they had grown to the size of bowling balls! His forearms became the size of bowling pins, also covered in veins! He felt incredibly strong!<br>\r\n<br>\r\n“Hey! What the…?” Jordan gasped as he felt his arms grow all over. “My arms!” <br>\r\n<br>\r\n“Huh? What is going on?” Tyler quipped just as his long legs started to grow thicker and wider, all at once. Tyler’s quads and calves bulged with muscle all over as his calves blew up into big mounds of muscles. His quads grew big and wide as well, doubling in size. Tyler suddenly had legs of a professional bodybuilder! <br>\r\n<br>\r\n“Holy shit!!!” Tyler gasped. <br>\r\n<br>\r\nNext, both boys saw their abs, legs, arms, and pectorals grow as well, completing the rest of their bodies until they were both big and buff, just as they had wished!<br>\r\n<br>\r\n“Damn! Look at us!” <br>\r\n<br>\r\n“Ohmygod!!!” <br>\r\n<br>\r\nWhile the two muscle teens stood there, admiring their reflections in the mirror, Kevin just stood at a distance and admired his handiwork. This was so much fun!<br>\r\n<br>\r\n“I wonder who else I could grow?” Kevin thought as he turned around and spotted…<br>\r\n</span></div></div>",
            "created":1533835620,
            "id":2531126,
            "title":"\"We were really buff!\""
        },
        "125":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin makes Ben grow taller",
                "Kevin makes Ben and all his friends grow taller",
                "Kevin makes Ben and all his friends grow more muscle"
            ],
            "content":"<div class=\"\"><div> <span>While walking around the sporting goods store, Kevin spotted Ben, a boy who lived down the street from his house. Ben was 12 years old and about 5 feet tall. <br>\r\n<br>\r\n\"Hey, Ben. How's going?\" he asked the boy. <br>\r\n<br>\r\nBen was looking at a basketball that was in a box on the shelf. <br>\r\n<br>\r\n\"it's going alright... I'd like to buy that basketball but I'm a few dollars short...\" he sighed. <br>\r\n<br>\r\n\"How much do you need?\" Kevin asked him.<br>\r\n<br>\r\n\"Just two dollars...\"<br>\r\n<br>\r\nKevin reached in his pocket and pulled out his wallet. Then he handed Ben two dollars. Ben took the money and bought the basketball and too it home.<br>\r\n<br>\r\nLater that afternoon Kevin spotted Ben shooting baskets using the hoop on the driveway in front of his house. What happens next? <br>\r\n</span></div></div>",
            "created":1336583340,
            "id":1333139,
            "title":"Kevin sees a few boys in the sporting goods store"
        },
        "13":{
            "author_id":"thenn",
            "author_name":"TheMM",
            "choices":[
                "Continue to help Jaegar.",
                "Help Jaegar's team and/or the other team.",
                "Look around the park for other boys to help.",
                "Go home.",
                "Ask for Nuncio's advice or help."
            ],
            "content":"<div class=\"\"><div> <span>Still in a bit of shock about his \"powers\", Kevin wander aimlessly until he came upon a Little League game of baseball.<br>\r\n<br>\r\nAfter a few minutes of watching the boys play their game, with their parents and various other people there, some who just happened to be in the part at the time. Keven noticed that one boy was always on the bench, in fact, he didn't even seem to be \"bat boy\" for the team. It was more like \"fat boy\" (which his teammates had given him) because he was overweight for his age. In fact, the only reason he was on the team was because his father was the coach. <br>\r\n<br>\r\nSomehow, Kevin knew that the boy's name was Jaegar and that due to his father constantly pushing him at only 8 years of age, he had fallen into depression and gotten obese from it.<br>\r\n<br>\r\nSuddenly remember his powers, Keven started to get rid of the boy's obesity, removing much of the unneeded fat from his body. Then Kevin added enough strength and muscle to make him just a little bit stronger then everyone else on his team (which wasn't much anyways). <br>\r\n<br>\r\nWhat surprised Keven though, was that as the boy changed, many things around him seemed to change, like all of reality shifted from the changes that Keven made.<br>\r\n<br>\r\n\"Nuncio was right! No wonder I can't use my abilities for selfish reasons! I'm practically a god...\" Keven thought to himself, realizing how truly powerful he was.<br>\r\n<br>\r\nAfter calming himself down, Kevin took a look at Jaegar again, and noticed that he was definately the star player on his team now, and instead of showing off (as most little boys would to some degree), he always cheered his friends even if they struck out. <br>\r\n<br>\r\nHappy he changed all reality (and still slightly weirded out by it), Kevin though about what to do next...</span></div></div>",
            "created":1198645200,
            "id":479414,
            "title":"Kevin watches an LL game."
        },
        "131":{
            "author_id":"thenn",
            "author_name":"TheMM",
            "choices":[
                "Go to \"The Hoax\"",
                "Offer to go somewhere else",
                "Make an excuse and leave"
            ],
            "content":"<div class=\"\"><div> <span>Keven was curious.....how far could he take it? Surely Nuncio could allow him this one time to test out his powers to the limit, he only did just get them.<br>\r\n<br>\r\nKeven focused on Jaegar again, but was unsure how to continue his changes.<br>\r\n<br>\r\nAfter several minutes of serious thought, Keven decided to start with height.<br>\r\n<br>\r\nHe started slowly, upping the boy only about an inch, then a couple more, then a few more inches...bit by bit...<br>\r\n<br>\r\nKeven stopped at 6'6\" which was an astounding height for any age, let alone an eight year old! Keven took a good look at the situation around him, and the first thing he noticed was that Jaegar wasn't actually playing the game anymore, most likely due to no pitcher his age being able to easily throw that high to be a legal pitch.<br>\r\n<br>\r\nNot liking that he was keeping Jaegar from playing the game, Keven quickly shrunk the boy back to his previous height (and thus, the previous reality).<br>\r\n<br>\r\n\"Hmm....\" Keven thought to himself, \"what next?\"<br>\r\n<br>\r\nAfter a couple more minutes, he thought that an age increase would be interesting.<br>\r\n<br>\r\nKeven watched with a great interest as all of reality changed as Jaegar grew older and older. Kevin decided that 18 was a good age (and because he couldn't change anyone older then himself) to stop at.<br>\r\n<br>\r\nThrough his powers, Kevin saw all of Jaegar's memories through the years as he grew older. How he was star of his LL team as a kid, and since he loved it so much he continued to play it through Junior High and High School, becoming a \"jock\" in only the sports sense of the word, but not in attitude since he kept his fun loving personality no matter how big his muscles got (which was something to brag about) and no matter how much he frightened the \"nerds and geeks\" at school. Though he did need their help in English (he got too used to baseball lingo), he asked them politely, didn't give money, didn't offer protection, simply asked them as a human to another human.<br>\r\n<br>\r\n\"Good job! Don't worry, you can get it next time! Did you scrape your knee? I'll get a bandaid.\" were just some of the things that Jaegar said to his team as he wore his \"Assistant Coach\" hat and shirt for his dad's LL team.<br>\r\n<br>\r\nAfter the game was done, Kevin still sat in the bleachers, enjoying the good life that he had now given the baseball star.<br>\r\n<br>\r\n\"Hey Kev! Come over here!\" called Jaegar.<br>\r\n<br>\r\nRemembering that he was sitting alone in bleachers at an LL game, Keven snapped too.<br>\r\n<br>\r\nKevin walked over to Jaegar and his father who were finishing putting everything up from the game.<br>\r\n<br>\r\n\"Jee Kev, you need to work out more.\" said Jaegar, playfully as he put a muscular arm around Kevin. <br>\r\n<br>\r\nKeven suddenly had memories of him and Jaegar working out a couple years ago as both were trying to get bigger to get dates when they started HS. Kevin now knew that he couldn't get bigger, but still went over each day to help Jaegar get bigger and bigger (which he did of course, thanks to Kevin's abilities).<br>\r\n<br>\r\n\"I love Fridays, don't you Kev?\" asked Jaegar.<br>\r\n\"Ya I do, but I've got nothing to do today.\" replied Kevin, still getting used to the fact that even HIS reality had changed.<br>\r\n\"Since the game's done, neither do I....Hmm, why not \"The Hoax\"?\" replied the baseball star.<br>\r\n\"Th-the Hoax?\" Kevin said, slightly scared for The Hoax was the nickname of the burger joint that all the \"jocks\" (and girlfriends of course) hung out at. It was so called because supposedly, many years ago, a man who was completely unlucky through his whole life ate a burger there, and died a mysterious death that night. To this day, no one actually ate any burgers from there, but they were still on the menu. It was often times a major dare (and in some cases a bet) if one would eat a burger, or even order one.<br>\r\n<br>\r\nKevin had a choice...</span></div></div>",
            "created":1198645200,
            "id":479420,
            "title":"Jaegar's new life."
        },
        "132":{
            "choices":[
                "Kevin decides to make some more changes just to Daniel",
                "Kevin makes more changes to both teams",
                "Kevin just sits back and enjoys the game"
            ],
            "content":"<div class=\"\"><div> <span>Kevin decided he wanted to improve the game a bit.  He'd always been a big baseball fan, and had wanted to see a Major League game in person, but his father had always been too busy to take him.  \"Well,\" Kevin thought to himself, \"if I can't go to a game, maybe I can make the next best thing!\"<br>\r\n<br>\r\nHe focused his mind, trying to collect all the boys on both teams in his thoughts.  He knew he couldn't actually make them full-blown major-leaguers, as that would make them older than 18 and thus he wouldn't be able to change them any more, so he decided to increase all the boys ages to be between 15 and 17.  Using as much energy as he could muster, he slowly aged all the boys upwards by 8 years, leaving a bit of wiggle room.<br>\r\n<br>\r\nHe opened his eyes, and saw that the now-teenagers were playing, but the crowd was still pretty sparse, as the teams weren't very good, since the boys were just average teenagers.  He decided he needed to make some more changes.<br>\r\n<br>\r\nHe grabbed every boy again with his mind and slowly increased their height to where they were all at least six feet tall, with the tallest among them reaching seven feet!  He then looked out, and saw that the game was more crowded than before, with maybe five hundred people watching, but still not what he was hoping for.  The boys were all very tall now, but were still mostly very skinny, not being able to hit very powerfully, and with only moderate athletic skill.<br>\r\n<br>\r\nHe then focused on adding muscle to all the boys.  He didn't want to make them unnatural freaks like Barry Bonds, but gave them each a powerful upper body, and strong leg muscles, so they were all able to hit, throw, and run very well.  He then focused on their reflexes and coordination, making them all super-responsive and skilled.  <br>\r\n<br>\r\nNow, when he opened his eyes, there was a whole different scene around him.  Instead of being at a small field, they were now at a large stadium, with maybe ten thousand people in the crowd, not exactly a major league game, but incredible turnout for a bunch of high schoolers.  He saw one boy, who was before the biggest kid in the game as a four-foot-eight, eighty-five pound eight year old, now stand an amazing seven-foot-two, two-hundred-eighty pound goliath.  This boy, who Kevin realized was named Daniel, was the star of the team, and, indeed, of the entire country.  Dozens of major league scouts were sitting down by the field watching him, and photographers from papers around the country captured his every at bat.<br>\r\n<br>\r\nKevin smiled.  This was more like it; now he could see a good game!  Mentally, he felt tired, but he could still make some changes if he wanted to.<br>\r\n<br>\r\n</span></div></div>",
            "created":1248238800,
            "id":730445,
            "title":"Major League Fun"
        },
        "1322":{
            "author_id":"flare",
            "author_name":"Zazu",
            "choices":[
                "Kevin meets with Daniel after the game.",
                "Kevin leaves and passes by a gym.",
                "Kevin considers changing himself...."
            ],
            "content":"<div class=\"\"><div> <span>Kevin still wasn't completely satisfied. The players were extremely fit and buff, like regular baseball players, but Kevin thought it would be really interesting if they were all super-bodybuilders. With their new strength, Kevin could turn them into player who could beat any major leaguers!<br>\r\n<br>\r\nFocusing, Kevin imagined changing all the players into large bodybuilders. Right on command, every players' muscles started to inflate. Their biceps, pecs, abs, and other muscles began to grow, along with their height growing. Biceps went from small baseballs to large volleyballs, and abs formed from defined six-packs to rock hard eights-packs. Soon, the field was full of teen bodybuilders!<br>\r\n<br>\r\nThe scene suddenly changed, with the large stadium growing to the size of a major league stadium full of screaming fans. Kevin eyed Daniel again, now seeing an impossibly large hulk. Daniel was still the biggest, but now he was eight feet even and three-hundred-fifty pounds of pure muscle. Now there weren't just college scouts there for Daniel, though, there were countless scouts looking at all of the players, all of whom were probably going to get drafted right out of high school with large salaries. Satisfied, Kevin considered his next move.</span></div></div>",
            "created":1290747600,
            "id":1001855,
            "title":"Kevin makes more changes to both teams"
        },
        "133":{
            "choices":[
                "The Pool",
                "The Playground",
                "The Woods"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kevin tried to decide where in the park to go to next.  Next to the baseball field was the public pool.  That might be fun, he though.  Or there was a playground on the other side.  Or he could see if anyone was in the woods behind the park...</span></div></span></div>",
            "created":1217998800,
            "id":565999,
            "title":"Look around the park for other boys to help."
        },
        "1331":{
            "choices":[
                "I want to be taller!",
                "I want to be more muscular!",
                "I want to be older!"
            ],
            "content":"<div class=\"\"><div> <span>Kevin decided the pool would be the most fun to change someone at.  Not wanting to feel out of place, he changed into a pair of board shorts he had in his backpack.  Around the pool, there were people of all ages swimming, sunbathing, and enjoying being outside in the nice weather.<br>\r\n<br>\r\nAs he walked over towards the deep end, Kevin noticed a boy sitting by himself, dangling his feet into the pool and looking sad.  The boy looked about 14, had olive skin and short dark hair, and was a bit chubby.  Kevin wandered closer towards the boy, and focused his energy on him, reading his mind.<br>\r\n<br>\r\nThe boy's thoughts quickly flooded over him.  His name was Vic, and both his parents had died in a car crash when he was nine.  He was sent here to live with his very strict aunt, who home-schooled him and rarely let him leave the house.  As a result, he had no friends, had a very poor body image, and was very socially awkward, even for a teenager.  To top it off, he had recently realized he was gay, which he knew would cause his aunt to go ballistic, so he had to struggle to keep that inside too.  Every week he would come out to the pool, always sitting at the side, watching everyone else have fun, and wishing he could be one of them.<br>\r\n<br>\r\nFeeling really sorry for Vic, Kevin decided to go talk to him.  As he sat down, Vic turned away, extremely uncomfortable. <br>\r\n<br>\r\n\"Relax, Vic,\" Kevin said.<br>\r\n<br>\r\n\"W-who are you?  H-how do you know my name?\" Vic asked.<br>\r\n<br>\r\n\"My name's Kevin, and I know a lot about you,\" he replied.  \"I'm here to help.\"<br>\r\n<br>\r\nVic stared straight down at the water, saying nothing for a long time.<br>\r\n<br>\r\nFinally, under his breath, he said, \"To help, you'd have to change everything about me.\"<br>\r\n<br>\r\n\"Okay,\" Kevin said, smiling.  He concentrated, imagining the body fat on Vic melting away.  Vic felt a little tingling, and looked down to see his body becoming skinnier, and more fit.<br>\r\n<br>\r\n\"Holy cow!\" Vic said, \"What's happening?\"<br>\r\n<br>\r\n\"Do you like it?\" Kevin asked.<br>\r\n<br>\r\n\"Yeah!  Did you do this?\" Vic said.<br>\r\n<br>\r\nKevin nodded.  He made a few minor touches, adding a little muscle to give Vic a nice swimmer's build, and growing out his hair to be shaggy, covering his ears, complementing his new body very well.<br>\r\n<br>\r\nVic looked at his reflection in the water.  \"I look like a completely different person!\" he exclaimed.  \"What else can you do?\"<br>\r\n<br>\r\n\"What else do you want?\" Kevin asked.<br>\r\n<br>\r\nVic thought for a moment...<br>\r\n<br>\r\n</span></div></div>",
            "created":1217998800,
            "id":566015,
            "title":"The Pool"
        },
        "13313":{
            "choices":[
                "Kevin helps someone in his own family.",
                "Kevin gets transported back in time to help someone!"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd like to be older, if that's possible,\" Vic finally said.  \"I want to be able to be my own person, and live my own life.\"<br>\r\n<br>\r\nKevin smiled.  \"That's true of pretty much everybody at your age,\" he said, \"but knowing what you're going through, I can hardly blame you.\"<br>\r\n<br>\r\nVic gave a half smile, then looked away, nervous.  \"I guess that may be too much to ask, though.\"<br>\r\n<br>\r\n\"Well,\" mused Kevin.  \"I can make you as old as 18.  At that point, my powers don't apply anymore, so I wouldn't be able to change anything else about you.  Are you sure that's what you want?\"<br>\r\n<br>\r\nVic looked at Kevin intensely, and Kevin noticed how deep and pleading his brown eyes were.<br>\r\n<br>\r\n\"Okay, then,\" Kevin said, \"but since I can't change you any more, I'm also going to make it so that you don't remember any of this.\"<br>\r\n<br>\r\n\"What?\" Vic asked.  \"Why?\"<br>\r\n<br>\r\n\"Look, I want you to be happy,\" Kevin said as he put his hand on Vic's shoulder.  \"If you know that you're whole life was changed all because of some other person, you'll probably always have that kernel of doubt or regret in the back of your head.  But I can make you think that you were supposed to be that way, that this is the only way for you to be.  You may not be grateful, but you'll be content.  And that's what you want, right?\"<br>\r\n<br>\r\nVic's eyes were starting to tear up.  \"Wow, man.  I've never met anyone like you before.\"<br>\r\n<br>\r\n\"Don't worry,\" Kevin said.  \"I'm not the only good guy out there.  As long as you stay true to yourself in here,\" Kevin said as he pointed to his heart, \"then you'll find someone else that you might spend the rest of your life with.\"  <br>\r\n<br>\r\nKevin stood up, helping Vic up too.  Vic embraced Kevin, wiping the tears away.  \"I'll never forget you, man.\"<br>\r\n<br>\r\n\"Yes, you will,\" Kevin said, chuckling.<br>\r\n<br>\r\nHe patted Vic on the back, and then walked away.  Without looking back, he knew Vic was looking after him, wanting to go with him, but resisting.  Kevin concentrated, making sure the first thing he did was wipe Vic's memory of him, so that he could turn around and watch from a distance as he made the changes.<br>\r\n<br>\r\nWhen he did, he noticed that Vic was now lying down on a beach chair, socializing with a couple of girls and a guy around his own age, laughing and having a good time.  Kevin smiled, then focused again on Vic, and started to make his changes.<br>\r\n<br>\r\nFirst, Vic started to grow taller, until he was around 6 foot 3.  His facial features started to get more defined, losing the last bit of baby fat.  He still looked like a skinny 14 year old, so Kevin started adding muscle, starting at the top and working down.  He expanded Vic's shoulders outward, and shaped his chest until his pecs were firm, forming a V-shaped torso.  He then added a six-pack to his abs, and increased his arm muscles until they were twice as thick as before.  His thighs and legs slowly expanded outwards, and Kevin made sure that they had just a tiny bit of hair.  Finally, to top it all off, he gave Vic a thin layer of stubble on his chin.<br>\r\n<br>\r\nKevin relaxed his concentration, and took a look at his work.  Vic was now with three other guys around his new age, one of which he seemed to be really close with, flirting and holding hands.  He also had lost the board shorts in favor of a sexy black speedo.  Kevin looked closer and noticed that the guy who he assumed was Vic's boyfriend actually held a strong resemblance to Kevin himself.  He smiled.  \"I guess even my powers can't clean his memory of everything.\"<br>\r\n<br>\r\nSatisfied with his work, Kevin turned and walked away from the pool.  He knew in his heart that he had done good, but also, that there was much, much more work to do.</span></div></div>",
            "created":1237438800,
            "id":663091,
            "title":"I want to be older!"
        },
        "133132":{
            "choices":[
                "Kevin gets sent to help Native Americans in the 1700s",
                "Somewhere (Somewhen?) Else"
            ],
            "content":"<div class=\"\"><div> <span>As Kevin walked through the park, he suddenly heard a voice in his head.  It was Nuncio!  \"Kevin, you have done well so far,\" Nuncio said.  \"So well, in fact, that I need you to help with a situation that I've always needed rectified!\"<br>\r\n<br>\r\n\"What is it?\" Kevin asked aloud.  As he did, he noticed that a woman walking by him the other way gave him a weird look, he assumed for talking to himself.  He stepped out to a clearing where there was no one else around to see him or judge him.<br>\r\n<br>\r\n\"In order for you to help, Kevin, I'm going to need to send you back in time,\" Nuncio said.<br>\r\n<br>\r\n\"Wow,\" Kevin replied.  \"You can do that?\"<br>\r\n<br>\r\n\"It's something that I have the power to do,\" Nuncio answered, \"but I've never done before.\"<br>\r\n<br>\r\n\"What about time paradoxes?\" Kevin asked.<br>\r\n<br>\r\n\"Don't worry about it,\" Nuncio said.  \"Time is a lot more malleable than you humans realize.\"<br>\r\n<br>\r\n\"Okay,\" Kevin said, \"Where do you need me to go?\"</span></div></div>",
            "created":1265778000,
            "id":834264,
            "title":"Kevin and Nuncio's Excellent Adventure"
        },
        "1331321":{
            "choices":[
                "Grow all three of the boys",
                "Make one of the boys a giant"
            ],
            "content":"<div class=\"\"><div> <span>All of the sudden, Kevin was surrounded by a bright light, that swirled around him, starting from his feet and working his way to his head.  His skin began to feel very warm, and he shielded his eyes.  After a few short seconds and a loud sound that resembled a sonic boom, the light suddenly disappeared, and Kevin opened his eyes to find himself in the middle of a wooded area, surrounded by trees.  He looked around, not seeing any sign of civilization or humans in general.<br>\r\n<br>\r\n\"Nuncio!  Are you there?\" he asked aloud.<br>\r\n<br>\r\n\"Yes, Kevin, I'm here with you.\"  Nuncio responded.<br>\r\n<br>\r\n\"Where am I?\"  Kevin said.  \"When am I?\"<br>\r\n<br>\r\n\"You are in the year 1754.  August 2nd, 4:23 pm, to be precise.  You are near a small tribe of Algonquin Indians.  And in a little under an hour, these Indians are going to be slaughtered by a group of British soldiers are going to come upon this camp and massacre them -- men, women, and children, mercilessly and without warning.\"<br>\r\n<br>\r\n\"That's terrible!\"  Kevin responded.  \"What do you want me to do?\"<br>\r\n<br>\r\nAll of then sudden, Kevin heard a rustling sound in the trees, and saw a group of three boys get closer.  They were about fourteen or fifteen years old, and wearing only loincloths, with some warpaint smeared messily along their faces.  They were talking to each other; surprisingly, though they weren't speaking English, Kevin could understand them.  <br>\r\n<br>\r\n\"Of course I am the best hunter out of all of us,\" the oldest boy, who appeared to be the leader, said.   He was about five feet eight, with long dark hair falling down past his shoulders, and he was carrying a bow with arrows.  \"No one can hit a target better than me!\"<br>\r\n<br>\r\n\"Well, I'm the fastest out of all of us,\" the shortest boy said.  He had relatively short hair, and was the skinniest amongst the group.  \"I can catch up with anything I'm chasing!\"<br>\r\n<br>\r\n\"But you won't be able to take it down when you do,\" the third boy said.  He was slightly shorter than the leader, but appeared to be more stocky and muscular.  \"That's my strength; nothing can out-wrestle me!\"<br>\r\n<br>\r\nKevin watched these boys from a distanced, and trailed them as they got moved through the woods.<br>\r\n<br>\r\n\"These three boys are the key to this tribe's safety,\" Nuncio said.  \"They are the only teenage boys in their group, and they have the heart and the inner strength to defend their families.  But they need your help.\"<br>\r\n<br>\r\n\"Got it!\" Kevin said.  \"I'll grow them all big and strong so they can beat back the British!\"<br>\r\n<br>\r\n\"Not so fast,\" Nuncio said.  \"The time traveling experienced zapped some of the power I gave out of you.  You have to make a choice:  you can either grow one of these boys to be a true giant, or you can grow all three of them so that they're big and strong but not true giants.\"<br>\r\n<br>\r\n\"Hmm,\" Kevin thought for a moment.  \"I guess I'll choose...\"</span></div></div>",
            "created":1265778000,
            "id":834289,
            "title":"Kevin helps the Tribe"
        },
        "13313211":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Kevin convinces them he is there to help them",
                "The oldest boy has a similar build and looks like Kevin",
                "The youngest boy is fascinated with Kevin's bare feet"
            ],
            "content":"<div class=\"\"><div> <span>to make all of the boys grow, but first let me find some similar clothes so as I won't be mistaken for another person.\" Kevin finds a discarded loin cloth from a dead Indian laying nearby. He quickly strips down naked and puts on the loin cloth around his waist. Kevin hides his clothes and shoes behind a bush and walks barefoot toward the three boys. His tender bare feet aren't used to walking on the dirt and rocky paths. He sees some mud and spreads some on his face and dirties up his clean bare feet a little so not to attract attention that he's from the future. He then confronts the three boys and they see him. Kevin looks down at their lean bodies and big, very tan bare feet with trim toes. All of their bare feet are very dirty since they don't wear shoes. They all look at Kevin and his muscular, tan chest and physique. Being a little nervous, Kevin wiggles his toes.<br>\r\n</span></div></div>",
            "created":1515163680,
            "id":2437045,
            "title":"Grow all three of the boys"
        },
        "13313212":{
            "choices":[
                "Hassun",
                "One of the other boys"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay,\" Kevin said, \"I've decided to make one of the boys a giant.\"<br>\r\n<br>\r\nHe watched them closely, as they made their way back to the tribe and split their separate ways.  He silently observed the boys for a few moments.<br>\r\n<br>\r\nHassun was the name of the thicker, strongest one.  He had a stern, solemn personality, and currently stood about 5' 6\", weighing in at 200 pounds.  <br>\r\n<br>\r\nDoes Kevin choose Hassun or one of the other two?</span></div></div>",
            "created":1265778000,
            "id":834301,
            "title":"Make one of the boys a giant"
        },
        "133132122":{
            "choices":[
                "Kesegowaase",
                "Achak"
            ],
            "content":"<div class=\"\"><div> <span>Kesegowaase was the name of the youngest, shortest one.  He was very playful and fun-loving, and was faster than almost all of the adult men in the tribe.  He was 5'1\" and weighed 110 pounds.<br>\r\n<br>\r\nAchak was the oldest, the leader of the three.  Having fought in other battles before, he was the bravest, and the most cunning.</span></div></div>",
            "created":1265778000,
            "id":834304,
            "title":"One of the other boys"
        },
        "1331321221":{
            "choices":[
                "The attack comenses",
                "The Brittish flee when they see Kesegowaase, and he gives chase!"
            ],
            "content":"<div class=\"\"><div> <span>Kesegowaase was sitting in front of the fire, stretching.  As Kevin approached him, Kesegowaase looked at him closely, with a look of puzzlement at Kevin's appearance, but was then overcome with a sense of calm emanating from Kevin.  He smiled as Kevin sat down next to him.<br>\r\n<br>\r\n\"You look different from the other white men,\" Kesegowaase said.  \"Have you come to help us?\"<br>\r\n<br>\r\n\"Yes,\" Kevin responded.  \"My name is Kevin.  I have a power that will help you out immensely.  And I have decided to use it upon you.\"<br>\r\n<br>\r\n\"A power?\"  Kesegowaase said.  \"What kind of power?\"<br>\r\n<br>\r\n\"You wouldn't believe it if I told you,\" Kevin said.  \"I'm just going to have to show you.  Stand up, Kesegowaase.\"<br>\r\n<br>\r\nHe did so, and Kevin did as well, and stood back.  He stared intently at the boy, and focused all his power.<br>\r\n<br>\r\nKesegowaase looked at Kevin and scrunched his nose, as we wasn't sure what was happening.  But then he begin to feel funny.<br>\r\n<br>\r\nKevin knew that he had to use everything he could to help this boy, and he clenched his forehead so violently that he began to shake.<br>\r\n<br>\r\nAfter a few moments of his skin burning, Kesegowaase began to shoot up.  His skin stretched and his bones creaked as they elongated and as he continued to grow.  After fifteen seconds, he had passed six feet in height, and he was only just beginning.<br>\r\n<br>\r\nAt this point, Kevin's focus on Kesegowaase's height growth was set, but he knew he needed to add more.  He began to grow tense throughout his whole body as every muscle flexed, taking all of his energy and using it towards his power, adding muscle growth in addition to the height.<br>\r\n<br>\r\nKesegowaase looked down at his body and saw that his muscles were beginning to flex and grow outwards.  His pecs began to grow firm, and his shoulder frame widened as the muscles began to pack on.  He was still growing taller, at this point passing nine feet and speeding up.  <br>\r\n<br>\r\nKevin didn't have any ounce of power left to make the boy's growth seem normal to the rest of his tribe, so at this point they began to gather around him, stunned and in awe.  His two friends came rushing up to him.<br>\r\n<br>\r\n\"What's happening to you?\" Achak, who was now face level to Kesegowaase's newly-ripped washboard stomach, called out to his friend.  <br>\r\n<br>\r\n\"I don't know,\" Kesegowaase replied, \"But it feels great!\"<br>\r\n<br>\r\nHassun looked up at Kesegowaase with an increasing envy.  However, he felt happy for his friend, and knew that something good was to come of this.<br>\r\n<br>\r\nThe boys looked over to Kevin, who was concentrating so hard that tears were forcing themselves out of his eyes, and he was sweating.  If they looked close enough, they would have seen tiny drops of blood mixed in with his sweat; his skin capillaries had burst due to his intense focus.<br>\r\n<br>\r\nAll of the sudden, Kesegowaase let out a loud moan.  His height, already a extremely impressive twelve feet tall, was beginning to increase at an accelerating rate.  Faster and faster he grew, passing twenty feet, then at a point to where they couldn't keep track.  He was packing on muscle mass, too.  His legs were becoming like columns, his arms swelled to several feet in diameter; he was becoming a true teen deity.  <br>\r\n<br>\r\nAfter what seemed like an eternity, Kevin let out a scream, and fell to the ground.  He dropped his concentration, and began to hyperventilate.  One of the women of the tribe brought some water to him, trying to calm him down and tend to him.<br>\r\n<br>\r\nKesegowaase continued to grow, finally stopping a few seconds after Kevin collapsed.  When everything had stopped, Kesegowaase towered over the rest of the group.  The tallest man in the tribe only reached halfway up his calves, which now jutted out, packed with muscle.  Looking up at the giant boy, everyone was stunned by what blew away any impression of strength they had previously had.  The only thing that gave away his youth was his still boyish, handsome face, which now had a huge smile across it<br>\r\n<br>\r\nKesegowaase began to walk around, testing out his new strength.  As he did, his footsteps shook the ground, causing some people to lose their balance.  \"Wow, this is amazing!\"  he said.  \"I feel so strong!\"  He began to run, and his powerful legs propelled him faster than ever before.  He stormed through the woods, knocking trees down in one motion and leaping over wide rivers.  He quickly circled back to the camp, stopping in front of Kevin, who had now recovered and was sitting up, admiring his work.<br>\r\n<br>\r\n\"Kevin, this is amazing!\"  he said, kneeling down, his giant face still beaming.  \"Thank you so much!\"  <br>\r\n<br>\r\n\"I know this is an extraordinary experience,\" Kevin replied, \"but there was a purpose to all this.  In just a few minutes, a group of British soldiers is going to come across your tribe, and you need to fight to defend your people.\"<br>\r\n<br>\r\nKesegowaase nodded with understanding.  \"I see,\" he said.  \"Well, bring them on!\"</span></div></div>",
            "created":1265864400,
            "id":834322,
            "title":"A Swift Giant"
        },
        "1332":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "Grow a few more kids at the park",
                "Grow all the other kids at the park",
                "Go somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Kevin decided the park would be the best place to go next.  He walked past the pool and saw the kids playing in the park.  He saw a few kids playing on a jungle gym.  A few others going down a slide.  And a small group playing tag.  Each kid looked like a good candidate.  It was hard for Kevin to choose.<br>\r\n<br>\r\nThen, Kevin looked on the far side of the park.  A heavyset kid, probably the biggest kid at the park, sat alone, eating lunch.  He was probably no older than 10.  The kid watched as everyone else at the park seemed to be having fun, except for him.  He was too fat to play tag; he would be out of breath pretty quick.  He had tried playing on the slide once before, but he had gotten stuck and someone had to call the fire department to cut him out.  That was the most embarrassing day of his life. <br>\r\n<br>\r\nOf course, Kevin didn't know anything about all this; he simply saw a lonely kid he thought he could help.  He concentrated for a moment, then watched as the kid transformed before his eyes.  <br>\r\n<br>\r\nFirst, the young boy's fat seemed to melt away, being replaced by solid muscle.  Over the next minute or so, Kevin watched as the boy became bodybuilder-sized.  It was impressive, but Kevin wasn't done yet.<br>\r\n<br>\r\n<br>\r\nNext, Kevin made the boy about six inches taller than he was.  Before, he was a short, overweight kid.  Now, he was being transformed into a mini-Hulk.  Kevin made sure that to everyone else at the park and, for good measure, everyone else in the kid's life, that the boy had always been that size.  No need to cause a panic caused by a growing child.<br>\r\n<br>\r\nFinally, Kevin decided to give the kid a lot of strength.  After all, if he wasn't satisfied, Kevin could always take it away later.  Over the next few minutes, the young boy transformed again, from having massive muscles like a professional bodybuilder, to having huge, powerful muscles like a Strongman Competitor.  <br>\r\n<br>\r\nKevin decided to walk a little closer, to get a better look at his creation.  He sat down a few dozen yards from where the kid was sitting.  The young boy now had wide shoulders and massive arms.  He looked powerful enough to lift the merry-go-round out of the ground, it seemed.  He was a shorter version of Superman, Kevin thought to himself.  He was now the biggest kid at the playground.  Well, he was before, too, but this time, he was by far the strongest kid there.<br>\r\n<br>\r\n\"Hey, Mike!\" another kid yelled out.  The massive kid looks up from his lunch, waving a hand in the air.  \"Can you help us out over here?\"  With a smile, Mike stands up, putting his lunch back in his paper sack.  He strides over to the merry-go-round and makes sure the other kids are holding on to something.  The kid that had wanted his help looked up at Mike in awe.  <br>\r\n<br>\r\n\"The two look very similar,\" Kevin thinks to himself.  \"Maybe they're brothers.\"<br>\r\n<br>\r\nMike grabs a bar on the merry-go-round and takes off running, spinning it in the process.  He lets go and watches as it continues spinning.  In fact, after a while, everyone in the vicinity watches, as it continues spinning for nearly three minutes.  <br>\r\n<br>\r\nMike laughs and goes back to finish his lunch.<br>\r\n<br>\r\nKevin watched the whole thing and was proud of what he did.  He took a shy kid, who probably had no self-confidence and turned him into the most popular guy there.  He was probably the most popular kid at school now, too.  The kid didn't seem to be a bully; in fact, he seemed to be just the opposite, as a few minutes later, Mike scared away a larger kid who was picking on a much smaller kid.  He even took the smaller kid over to where he was sitting and gave him a part of his lunch.<br>\r\n<br>\r\nKevin smiled.  Mission accomplished.  But what does he do now?</span></div></div>",
            "created":1243573200,
            "id":699153,
            "title":"The Playground"
        },
        "13322":{
            "choices":[
                "There is still some residual growing effects in the air.",
                "Kevin discovers his powers are getting stronger."
            ],
            "content":"<div class=\"\"><div> <span>Up to this point, Kevin had only been growing one boy at a time, but he felt up for a challenge.  He looked around the playground.  There seemed to be a dozen or so kids there, and among those seven boys, from the ages of five to twelve.  It seemed to be like a good point to flex his powers.<br>\r\n<br>\r\nHe stepped to the far end of the playground, so he could see all the boys who were playing.  He then looked at them all and focused hard, furrowing his brow.  The veins in the side of his head began to show as he concentrated all of his power, and his vision began to blur, so he closed his eyes to eliminate all distractions.  Once he felt he had taken control of all of the boys, he let his energy flow into them.<br>\r\n<br>\r\nHe didn't exactly have much control over what kind of growth was happening, as he was already straining enough just to grow seven boys at once.  Because of this fact, each of the boys experienced the growth differently, in a seemingly random pattern.  Mike, the boy who Kevin had grown before, didn't receive much additional benefit, only growing a few inches taller than he already was (still unbelievably impressive with his muscle mass).  <br>\r\n<br>\r\nAnother kid, at the jungle gym, who was the oldest among the group at twelve, began to develop impressively, as his muscles bulged outward and he began to resemble the image of a Greek mythological hero.  This boy's brother, a couple of years younger than he, benefited by growing substantially taller, more than doubling his height to be twelve feet tall, and now was sitting down underneath the jungle gym, crouching to avoid hitting his head on the bars.  <br>\r\n<br>\r\nThe youngest kid on the playground, a skinny five year old boy of Chinese descent, received his growth in the form of an age increase, growing taller, increasing in strength, and developing more handsome features, until he was a fifteen year old hunk.  He was playing tag with his friend, who also increased in age until he was a handsome fourteen year old lad.<br>\r\n<br>\r\nFinally, the biggest change of all was to a ten year old boy named Juan.  Before, he was playing by himself on the slide, skinny and rather short, the height of some of the eight-year-olds.  He began to grow in every way imaginable.  First, he shot up in height, first to six feet, then seven, then nine.  At that point, he kept getting taller, but he also started developing muscle mass, in a big way.  His shoulders began to push apart, his biceps swelled to the size of basketballs, and his thighs started to resemble tree trunks.  And he kept growing.  By the time Kevin was done, Juan was twenty-five feet tall, and had the body of a god.  He still had the face and mannerisms of a ten-year old, but his figure looked anything but young.<br>\r\n<br>\r\nKevin dropped his head and released his focus.  He started to feel very light-headed, and had to sit down on a bench.  He looked at the kids, and saw that most of them were still playing, but the boys were now segregated from the girls, as not to accidentally injure them with their bulk and size.  The two boys who were now teens were throwing a football around on the grass with their shirts off.  And Juan the Giant was busy letting some of the small kids ride on his shoulders, enjoying the view.  <br>\r\n<br>\r\nSo far, all was going pretty well, Kevin thought.  But then something unexpected happened.</span></div></div>",
            "created":1265778000,
            "id":834185,
            "title":"Grow all the other kids at the park"
        },
        "13323":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "Possesses the boy's body",
                "Made the game more fair...all the boys are buff!"
            ],
            "content":"<div class=\"\"><div> <span>Kevin wandered off the path of the park. It was a huge park, so just walking out of it took a while. However, he found himself almost out of the park when something caught his eye. There was a soccer field nearby where some boys were playing a game of soccer. Kicking the ball back and forth, one tripped over his untied shoelaces.<br>\r\n<br>\r\nScraping his knee against the ground, his knee became bloody. It hurt for him to stand. Kevin knew he had to do something to help this kid.<br>\r\n<br>\r\nKevin walked over to him and snapped his fingers. Within an instant, the kid's wound healed instantly, being patched over by muscle. Next up, his muscles inflated like a beachball. In fact, his biceps were the size of beachballs! As his muscles grew, he shot up in height. At the end of his transformation, he stretched as if everything was normal, yawning just a bit.<br>\r\n<br>\r\nHowever, it seemed that was the end of his transformation, because then his legs expanded threefold and made him superhumanly fast! Combined with his muscles, he could win the game single-handedly with ease.<br>\r\n<br>\r\nKevin then:</span></div></div>",
            "created":1266037200,
            "id":835756,
            "title":"Go somewhere else"
        },
        "133231":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin makes Morgan grow when his dad is about to hit him",
                "Kevin makes Morgan several years older"
            ],
            "content":"<div class=\"\"><div> <span>Kevin just stared at the boy, learning everything about him in a matter of seconds. Then he walked up to him, and stared at him with a smile.<br>\r\n<br>\r\n“Hey, Morgan! Is everything alright?” he asked the boy.<br>\r\n<br>\r\n“Yeah… Uhh… How did you know my name?” the boy wondered.<br>\r\n<br>\r\nKevin silently wished for the boy to trust him completely.<br>\r\n<br>\r\n“Oh… Yeah, Kevin… I’m fine, thanks… I scraped my knee but for some reason, it doesn’t hurt no more.”<br>\r\n<br>\r\nKevin looked down at the boy’s legs, which was easy since he was wearing shorts, socks and cleats. He willed the boy’s legs to grow even more muscular than before, which they did. Morgan’s legs were totally ripped now, as his quads were amazingly thick and wide, showing many layers of muscle while thick rope-like veins were covering the ridges of muscle from his knees to his waist. If his legs were to grow any wider, he would rip out of his shorts!<br>\r\n<br>\r\nNext, came those powerful calves. Kevin looked down at the boy’s calves with a smile on his face. The two round, thick lumps of muscle grew even harder and rounder as they bulged out from the back of his legs even more so. They grew so big, that they began to look a bit freakish. Morgan’s calves seemed a little bit too big, but Kevin just allowed them to grow. Morgan had to separate his legs a bit, just because his enormous calf muscles would otherwise rub up against each other. These monster muscles were fighting for space, but Kevin allowed them to bulge out a bit more, just to give the boy some extra power in his legs.<br>\r\n<br>\r\nFinally, Kevin made his pectorals push out even further from his chest, allow a deep cleavage to form between the two muscles, evenly splitting his big chest in two. Below his mighty pecs, Morgan was now sporting an impressive set of abdominals, consisting of three tows of two big, impressive tiles of rock-hard muscle-rocks, which covered his stomach like armor.<br>\r\n<br>\r\nWhen the little soccer match was over, Morgan started walking home, while Kevin was sitting on a park bench. Kevin decided that he wanted to have a little more fun with the boy, so he just closed his eyes and concentrated on the young soccer player. Instantly, Kevin was able to see everything that Morgan saw, and he could hear everything that Morgan heard. He was also able to hear the boy’s thoughts from a distance. <br>\r\n<br>\r\nAs Morgan came home, his strict father sneered at him that he had to get into the shower and prepare for dinner. His father was very strict and disciplined. Kevin decided he was going to stay inside of Morgan’s head and jump in, just in case he had to make the boy grow bigger, stronger or older.<br>\r\n<br>\r\n</span></div></div>",
            "created":1310868060,
            "id":1149097,
            "title":"Possesses the boy's body"
        },
        "1332312":{
            "author_id":"kipgrowth",
            "author_name":"Kip",
            "choices":[
                "The beach!",
                "The arcade!"
            ],
            "content":"<div class=\"\"><div> <span>Kevin was not happy with how Morgan's dad traeted him, so he decided to help. But how?<br>\r\n<br>\r\nThen Kevin thought that if Morgan was made older and given a impressive past, his dad would respect him! Focusing on Morgan, Kevin began making changes. Morgan turned into an eighteen year old titan. He shot up to 6'6'', much taller than his father. His muscles grew again, making him resemble a large bodybuilder. His face developed to make him resemble a model or movie star. <br>\r\n<br>\r\nKevin also changed his past. Morgan had now been a straight A student and sports star, and already had scholarships galore. He was also a respected student, kind to everyone and always helping others. Just for the sake of things, Kevin also made it so that the two had been best friends growing up and knew everything about each other. There was now not a single way Morgan's dad would ever disrespectvhim again. Kevin left Morgan's body and appeared behind him.<br>\r\n<br>\r\n\"Oh! Hey, Kev! When did you come in?\" Morgan asked cheerfully. \"Just a second ago. Hey, I was wondering if you would like to go somewhere with me? How about...\"</span></div></div>",
            "created":1370978100,
            "id":1609279,
            "title":"Kevin makes Morgan several years older"
        },
        "133232":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "I'll make every boy on the other team grow a foot taller",
                "I'll add more muscle to the legs of every boy on the other team"
            ],
            "content":"<div class=\"\"><div> <span>The muscular boy then dribbled the soccer ball between his legs, kicking it and keeping it in front of him. Since he was stronger and faster than all the others, he easily attacked the opponents' goal and kicked one goal after the other, racking up points for his team, and becoming the big hero of the game!<br>\r\n<br>\r\n\"Whoohoo! Alright Morgan!\" the boys cheered, as they all huddled around Morgan, who had instantly become their hero. Morgan used to be small and skinny, but now he was a hulking, stout, and muscular kid, who could easily score one goal after another, thanks to his amazing strength and speed!<br>\r\n<br>\r\nKevin looked at the scoreboard, and saw how the boys on the other team started to become frustrated. They didn't stand a chance against Morgan.<br>\r\n<br>\r\n\"Hmm... Perhaps, I should help out the boys on the other team?\" he wondered out loud. \"I don't want to make them ALL muscular, either... What if I just make one, small change to them?\"<br>\r\n<br>\r\nThe boys started running towards the goal, but Morgan was too fast for them again! He stole the ball, for the fifth time in a row!<br>\r\n<br>\r\n\"Ahh... I got it!\" Kevin grinned.<br>\r\n</span></div></div>",
            "created":1266037200,
            "id":835834,
            "title":"Made the game more fair...all the boys are buff!"
        },
        "14":{
            "author_id":"thenn",
            "author_name":"TheMM",
            "choices":[
                "Make all boys on his street more muscular",
                "Make all boys in his neighborhood more muscular",
                "Make all boys in his school more muscular",
                "Make all boys in his town more muscular",
                "Make all boys in his state more muscular"
            ],
            "content":"<div class=\"\"><div> <span>Left alone...Kevin simply stood infront of his school...alone...when...<br>\r\n<br>\r\n\"Kevin! What are you doing just standing around?\" called someone.<br>\r\n<br>\r\nBreaking out of his trance, Keven looked for the source and saw his good friend Jace, with his little brother Burt-for short (Bartholomew was his real name, but he liked \"Burt-for short\" more).<br>\r\n<br>\r\n\"So, we headin over to my place first, or yours?\" asked Jace.<br>\r\n\"I'm thinkin yours today.\" replied Kevin.<br>\r\n\"Aww....I wanted to see your house.\" said Burt, annoyed.<br>\r\n<br>\r\nThis gave Kevin an idea....wishing that they were in his room...and in a flash, the trio was!<br>\r\n<br>\r\n\"It always seems like it takes no time at all to get to your house Kev.\" said Jace.<br>\r\n<br>\r\nThis was surprisng to Kevin, it was like this happened every time, or the two in front of him didn't know...<br>\r\n<br>\r\nPlopping down on Kevin's bed and grabbing the remote Jace turned on the TV to see if anything good was on.<br>\r\n<br>\r\n\"...and so now, do you see why these poor children need donations?\" said an announcer, asking people to donation to an African charity of some kind.<br>\r\n<br>\r\n\"Feh,\" said Jace, quite annoyed with the commercial, \"I bet they just keep all that money, how else can they pay for the commercial time?\"<br>\r\n<br>\r\nKevin didn't care. He was going to use his powers on not just one boy, why not a whole continent of them?<br>\r\n<br>\r\nKevin focused very carefuly on the entire continent of Africa, making sure to \"grab\" every boy 18 and under into his little \"pool\" of lives.<br>\r\n<br>\r\nHe started with their diseases, getting rid of the ones they had and then making them immune to any and all diseases as well. Then increasing their overall health. Followed quickly by buffing all of them up somewhat, adding a lot of weight to the Earth's from all the muscle being added. Then Kevin simply gave them all a lot of money to do with to help their families.<br>\r\n<br>\r\nIn short, Kevin had made the entire continent of Africa almost completely free of problems. Needless to say, with all of reality changing as this happened, Africa was now humanity's \"Utopia\".<br>\r\n<br>\r\n\"Come to Africa, where all your problems can be solved!\" said an African announcer on the TV, advertising the wonderful society African now had.<br>\r\n<br>\r\n\"I wish it wasn't so hard to get into Africa, I mean...airplane flights to there practically cost a house and a half!\" said Jace, sighing. \"So Kev, instead of watching things that we can never have, what do you wanna do?\"</span></div></div>",
            "created":1198645200,
            "id":479425,
            "title":"Kevin helps a whole continent"
        },
        "141":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "A boy riding his bike",
                "A boy riding his skateboard",
                "A boy walking on the sidewalk",
                "A boy rollerskating on the street"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go walk around in my neighborhood!\" Kevin suggested. <br>\r\n<br>\r\nJace and Bart agreed, and the boys followed Kevin out the front door and out on the street.<br>\r\n<br>\r\nOnce they were outside, they passed three houses when Kevin spotted....<br>\r\n<br>\r\n</span></div></div>",
            "created":1335894180,
            "id":1327031,
            "title":"Make all boys on his street more muscular"
        },
        "1413":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Jack becomes slightly athletic with 200 pounds of muscle",
                "Jack becomes a 250-pound teen bodybuilder",
                "Jack becomes as big as a 300-pound pro bodybuilder",
                "Jack becomes as big as a 350-pound muscle God"
            ],
            "content":"<div class=\"\"><div> <span>As Kevin looked around, he had a clear view of the street and the uncoming traffic on both sides of the street and the sidewalk. From a distance, he spotted a young boy walking towards him, who looked like a Middle-schooler. Kevin focused his powers on the boy and learned right away, that the boy's name was Jack, that he was 13 years old, and that he lived down the street. Jack had brown hair, he was only 5 feet tall, and he was skinny and short. He was only wearing a tank top, shorts and tennis shoes. <br>\r\n<br>\r\n\"Time for action\" Kevin grinned, as the boy got a little closer. \"Watch this!\" <br>\r\n<br>\r\nKevin had decided to transform Jack into a teenage bodybuilder. It was easy since he was only wearing a tank top, after all. He was wearing the right clothing for that transformation so Kevin decided to make the boy's muscles grow as Jace and Bart looked on in eager anticipation. <br>\r\n<br>\r\nSo, how big does Kevin grow Jack's muscles? <br>\r\n<br>\r\n</span></div></div>",
            "created":1561579500,
            "id":2678957,
            "title":"A boy walking on the sidewalk"
        },
        "144":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin makes Jace grow even bigger",
                "Meanwhile, a 12-year-old boy down the street grows",
                "Meanwhile, a 14-year-old boy on the other side of town grows",
                "Meanwhile, a 15-year-old boy down the street grows"
            ],
            "content":"<div class=\"\"><div> <span>\"Golly! That felt awesome! I didn't realize I was that powerful!\" Kevin grinned, as he watched the news on TV.<br>\r\n<br>\r\n\"Dude! If you can help the boys in Africa... How about you help all the guys over here?\" Jace suggested.<br>\r\n<br>\r\n\"Yeah, you made a good point, dude! Let's go outside!\" Kevin said, as he stood up and walked towards the door.<br>\r\n<br>\r\nKevin and Jace walked outside and looked out over the streets in the neighborhood.<br>\r\n<br>\r\n\"Alright... I want all boys in our town to gain twenty pounds of muscle right now!\" Kevin said out loud.<br>\r\n<br>\r\nFor a brief moment, nothing happened. Then, suddenly, Jace was overcome by an odd, tingling sensation.<br>\r\n<br>\r\n\"Whoa! Ohhh... I feel something... Uhhh...\" he groaned. <br>\r\n<br>\r\nJace closed his eyes and gritted his teeth as his arms and legs suddenly increased in size. His biceps grew a little bigger while his calves and quads increased in size, by a few inches.<br>\r\n<br>\r\n\"Sweet! You should gain about twenty pounds of muscle, dude!\" Kevin laughed, as he saw his best friend's muscles grow before his own eyes.<br>\r\n<br>\r\nIndeed, when the growth stopped, Jace was a little more muscular than a few moments ago!<br>\r\n<br>\r\n\"Man! That was intense!\" Jace cheered, as he flexed his arm and allowed a slightly bigger bicep to form on his arm.<br>\r\n<br>\r\nKevin just smiles as he looked on...<br>\r\n</span></div></div>",
            "created":1266728400,
            "id":840624,
            "title":"Make all boys in his town more muscular"
        },
        "1442":{
            "author_id":"hunky",
            "author_name":"LucasFan17",
            "choices":[
                "Josh lifts weights and grows even more",
                "An 11-year-old boy across town grows",
                "A group of middle school boys grow",
                "A group of high school boys grow"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly a 12 year old boy named Josh started to grow as he was swimming.  \"WOAH\" said Josh as his muscles began to grow. His pecs began to push out and his legs were swelling to the size of tree trunks. Josh's bathing suit began to get tighter and tighter until it finally ripped due to Josh's growing package. Josh now stood 6 feet tall with 20 pounds of muscle.</span></div></div>",
            "created":1514554500,
            "id":2433981,
            "title":"Meanwhile, a 12-year-old boy down the street grows"
        },
        "1443":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "The boyfriends start becoming buff too",
                "George grows further",
                "Every boy in town grows at the same time"
            ],
            "content":"<div class=\"\"><div> <span>14-year old George was walking home when all of a sudden, he felt a massive tingling. The feeling he had was more than perfect it was...\"WHOA!\" he screamed as his muscles built faster and faster.<br>\r\n<br>\r\nHis biceps swelled up to 14\", and his triceps extended massively so as well. His calves inched until they were prominent as well. The rest of the body then shook and burst with muscle, until he looked like a young up and coming bodybuilder!<br>\r\n<br>\r\nTwo 14-year old girls walking with their 15-year old boyfriends took note of this, and ran over to him. The boyfriends weren't amused but with muscles like that, what were they going to do?<br>\r\n<br>\r\nAs George enjoyed the girls swooning over him...</span></div></div>",
            "created":1266987600,
            "id":841884,
            "title":"Meanwhile, a 14-year-old boy on the other side ..."
        },
        "15":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Johnny becomes taller",
                "Johnny becomes more muscular",
                "Johnny becomes older",
                "Johnny becomes younger",
                "Johnny returns back to normal"
            ],
            "content":"<div class=\"\"><div> <span>Kevin walked into a large department store and spotted a little boy. The boy's name was Johnny. The boy was about 8 years old, and he was standing on his toes, while trying to reach a coloring book, which was on the fourth shelf.<br>\r\n<br>\r\n\"Gosh, if only the boy's legs grew six inches longer...\" Kevin sighed.<br>\r\n<br>\r\nSuddenly, the boy had a growth spurt! The boy's short legs started to grow longer, making him taller and taller! His calves and his knees started to rise up, further from the floor, as well as his quads. The boy just gasped as he looked down while he felt his legs grow. As soon as the growth stopped, he just extended his arm and reached over. He could now easily reach the shelf and grab the coloring book.<br>\r\n<br>\r\n\"Did you do that to me?\" Johnny asked Kevin. <br>\r\n<br>\r\n\"Yes, I did.\"<br>\r\n<br>\r\n\"Gosh, thanks Mister!\"<br>\r\n<br>\r\n\"My name's Kevin.\" he replied. \"Oh it was my pleasure!\" he said, now looking down at the slightly taller boy.<br>\r\n<br>\r\n\"I wish you could change me more often...\" Johnny said.<br>\r\n<br>\r\n\"I think I have the ability to do that...\" Kevin said. Kevin closed his eyes and wished that he could always see and hear what Johnny was doing. Suddenly, he was able to see through Johnny's eyes and he saw Johnny looking back at him.<br>\r\n<br>\r\n\"I'll be in touch with you. Johnny!\" Kevin grinned. \"And if I make any more changes, people will find them completely normal!\" Kevin assured him.<br>\r\n<br>\r\n\"Thanks... Well I need to go!\"<br>\r\n<br>\r\nJohnny turned around and ran back to his mother.<br>\r\n<br>\r\nAfter a few minutes, Kevin closed his eyes. Again, he saw visions from Johnny's eyes and he was able to hear through Johnny's ears. He could hear what Johnny was saying to his mother and he also knew Johnny's thoughts. He decided he was going to check in with Johnny from time to time, and change him whenever he felt it was needed.<br>\r\n<br>\r\nSo, what would Kevin do next?<br>\r\n</span></div></div>",
            "created":1186462800,
            "id":433144,
            "title":"Kevin meets Johnny"
        },
        "151":{
            "choices":[
                "Grow a little every day",
                "Grow a lot right now",
                "Wait till later"
            ],
            "content":"<div class=\"\"><div> <span>While Johnny was driving home, Kevin decided to check in with him again.  He concentrated and began to see the world through Johnny's eyes: sitting in the backseat of his mother's car, playing a video game.<br>\r\n<br>\r\n\"Johnny, can you hear me?\" Kevin asked.<br>\r\n<br>\r\nJohnny looked up, and after a second, realized who the voice was.  \"Kevin, is that you?\"<br>\r\n<br>\r\n\"Hmm?\" his mom called from the front seat.  \"What was that, honey?\"<br>\r\n<br>\r\nKevin realized that he'd have to try to communicate with the boy silently, so his mom wouldn't hear.  He focused and tried to communicate through thinking.<br>\r\n<br>\r\n\"Johnny, let's just communicate through thoughts.  We don't want your mom to get suspicious or upset that you're talking to thin air!\"<br>\r\n<br>\r\n\"Okay,\" Johnny thought back.  \"Is this right?\"<br>\r\n<br>\r\n\"Yep,\" Kevin said.  \"Good job.  Now we can talk whenever we want, and nobody else will know!\"<br>\r\n<br>\r\n\"Cool!\" said Johnny,  \"you're like Jimminy Cricket!  Except you have magic powers!\"<br>\r\n<br>\r\nKevin chuckled.  \"Yeah, I guess you could say that.  How are you liking your new height?\"<br>\r\n<br>\r\n\"It's pretty cool,\" Johnny replied.  \"I just hope I get to do it again! It felt so good to grow, and I like being taller than all my friends.  But the adults still look down at me.\"<br>\r\n<br>\r\nKevin smiled, \"I think I can do something about that.  How about this?  I can either cause you to grow a little every day, so that you'll always have a new experience of being taller, or I can grow you a lot right now, or you can wait till later, till when you need it, to grow.  What sounds best?\"<br>\r\n<br>\r\nJohnny thought for a moment.  \"I think I'll choose...\"</span></div></div>",
            "created":1265086800,
            "id":829628,
            "title":"Johnny becomes taller"
        },
        "1512":{
            "author_id":"nightwolf285",
            "author_name":"nightwolf285",
            "choices":[
                "Kevin panics and accidently teleports Johnny to him.",
                "Kevin makes Johnny even bigger (muscles and height)",
                "Kevin quickly shrinks Johnny back to normal (for now)"
            ],
            "content":"<div class=\"\"><div> <span>Johnny chuckled quietly to himself.<br>\r\n<br>\r\n“You want to grow right now, don’t you?” Kevin asked knowingly.<br>\r\n<br>\r\nJohnny’s mind screamed, “YES!” as his face beamed with a widening smile.<br>\r\n<br>\r\n“Alright,” Kevin thought, “Get ready.”<br>\r\n<br>\r\nJohnny could barely contain his anticipation when suddenly, he felt it. He looked down and sure enough, his body was growing once again. He could feel all of his limbs stretching long. His whole body was enlarging. In a matter of seconds, he was already five feet tall and was still growing. All of his little boy clothes were feeling tighter and tighter on his body. Even his shoes were getting cramp.<br>\r\n<br>\r\n“How’s that feel?” Kevin asked.<br>\r\n<br>\r\nJohnny vibrated with excitement in his seat. “Keep going mister! I want to be even taller than mommy! I can’t wait to see her face when we get home.”<br>\r\n<br>\r\n“Sure thing little buddy.”<br>\r\n<br>\r\nJohnny’s growth continued and both of them were enjoying every minute of it. Johnny was awed by the sensation of his growth. “I’m going to be bigger than mom!”<br>\r\n<br>\r\nHe grew another six inches in his seat. His body slowly rose along the back of his seat. His head creped passed the head rest. His feet were now firmly on the floor with his knees jammed into the back of the front seat. Johnny watched in delight as his knees rose higher and higher in the air. His entire body continued to enlarge, forcing his seatbelt to lengthen around him. He was now at least a foot taller than any of his friends. “I must be even bigger than Lucas, and he’s the biggest guy in my class.”<br>\r\n<br>\r\n“Was the biggest guy in your class.”<br>\r\n<br>\r\n“Oh yeah!” Johnny thought with sudden realization, “I’m the biggest kid in my class now!”<br>\r\n<br>\r\nJohnny was still inching larger. His butt quickly filled the bucket of his seat, forcing him to readjust. He could feel how small the car was getting. The feeling of being larger invigorated Johnny more and more by the second. He barely noticed that he was now eye level with his mom in the front seat. But Kevin did. “You may want to duck down a bit little buddy. Otherwise, your mom’s going to see you before you get home.”<br>\r\n<br>\r\nJohnny realized a half second later exactly what Kevin was talking about. His head was only inches from the roof of the car. He could clearly see his mother’s eyes in the rear view mirror. But he was too late. Her eyes twitched in his direction. Johnny felt a wave a fear go through his nearly six foot frame. “You’d better sit down young man if you know what’s good for you!”<br>\r\n<br>\r\nJohnny quickly ducked down into his seat, forcing his knees into his chest and causing a distinct ripping sound in his pants.<br>\r\n<br>\r\n“Wow! You’re mom thought you were standing up in the car!”<br>\r\n<br>\r\n“I know! I thought she figured it out!” Johnny thought with an edge of apprehension, “And I think I split my pants. When I moved down in my seat, I could hear them rip.”<br>\r\n<br>\r\n“I didn’t even think about your clothes getting smaller this whole time. I’m so sorry about that Johnny.”<br>\r\n<br>\r\n“Nah. It’s ok. I kind of like it. Getting big is awesome!” Johnny rubbed his growing hands along his smooth, lengthening shin. His growth finally slowed to a halt, but Johnny hadn’t noticed.<br>\r\n<br>\r\nJohnny beamed. “I feel like my brother. All big and important. He’s in high school you know, and I want to be just like him when I grow up.” <br>\r\n<br>\r\nKevin paused. “You have a brother?”<br>\r\n<br>\r\nJohnny clutched his thick arms around his long legs, pulling them tighter to his chest. Even though he was six feet tall, he was still an eight year old boy. “Oh yeah. He’s so popular in school. He’s a wrestler, a really good one. He must be like twenty or something.”<br>\r\n<br>\r\n“You mean seventeen?”<br>\r\n<br>\r\n“Huh?”<br>\r\n<br>\r\n“You said he was in high school, right? What grade is he in?”<br>\r\n<br>\r\n“Oh, um…” Johnny’s thoughts all shot out in a blur to Kevin. A million arrows, all barely formed thoughts struck Kevin’s mind, nearly toppling him over. Kevin realized this meant that Johnny must be thinking really hard about the answer. “He’s a junior. Yep. Junior. I remember him saying that just the other day.”<br>\r\n<br>\r\nKevin had a moment of realization, thinking of his new found power.“Ok. That means he is probably about sixteen or seventeen.”<br>\r\n<br>\r\n“Really?! I thought he was so much older than that.” Johnny said in amazement.<br>\r\n<br>\r\n“And just out of curiosity,” Kevin began wryly.”How tall is your brother?”<br>\r\n<br>\r\nThe same psychic blur hit Kevin as Johnny rocked in his seat. “Gosh! He’s taller than dad. Dylan’s huge!”<br>\r\n<br>\r\nKevin smirked to himself. “Alright, so how tall is your dad?”<br>\r\n<br>\r\n“Six feet.”<br>\r\n<br>\r\nKevin was shocked. “Wait. How did you know that so fast?”<br>\r\n<br>\r\n“Cuz mister, he always reminds me. He’s always saying how big he is and if I ever want to grow up to be a real man, I’ll do as he says.” <br>\r\n<br>\r\nKevin laughed to himself. “And your brother is taller than him?”<br>\r\n<br>\r\nJohnny nodded to himself. “Yep!” <br>\r\n<br>\r\nKevin waited anxiously for Johnny to connect the dots. Then suddenly, “Oh my gosh!” Kevin said out loud.<br>\r\n<br>\r\n“What’s wrong dear?” his mother asked as she turned the wheel.<br>\r\n<br>\r\nThe same face-sized grin spread across Johnny’s face like wild fire. “Nu-nothing momma.” Johnny hunched even lower in his seat, even though that was nearly impossible. He was too big now. Besides, what if he ripped more of his clothes? His maroon red t-shirt was barely hanging on as it is, and his khakis had already ripped in one place.<br>\r\n<br>\r\n“How tall am I!?” Kevin screamed in his mind with pure excitement.<br>\r\n<br>\r\n“Six feet tall, big guy.”<br>\r\n<br>\r\nJohnny gasped. “I’m—I’m—I’m as tall as--!”<br>\r\n<br>\r\nJohnny could barely catch his breath. His chest heaved into his knees sharply, although he barely felt it. “That’s right,” Kevin concluded, “You are just as tall as dad and are almost as tall as your big brother.”<br>\r\n<br>\r\nJohnny’s heart began to race. He couldn’t contain his excitement anymore. And he didn’t have to, because…<br>\r\n<br>\r\n“We’re home.”<br>\r\n<br>\r\n“We’re home!?\" Johnny's mind began to swirl. \"Am I ready? Am I big enough? Should momma see me like this? I need you mister! What do I do!?”<br>\r\n<br>\r\nKevin did not expect this sudden panic from Johnny. Especially after how excited he’s been. Johnny’s mom shuts off the car and gets out. What’s Kevin going to do?</span></div></div>",
            "created":1300251600,
            "id":1071284,
            "title":"Johnny Keeps Growing"
        },
        "15123":{
            "author_id":"nightwolf285",
            "author_name":"nightwolf285",
            "choices":[
                "Kevin gives Johnny all the self-confidence he desires",
                "Kevin slowly grows Johnny back to 6’ tall, increase his muscle size or both"
            ],
            "content":"<div class=\"\"><div> <span>“Are you going to help me with the bags Johnny?”<br>\r\n<br>\r\nJohnny crouched into a little ball and yelped, “Don’t look!”<br>\r\n<br>\r\nHis mother was very confused. “Don’t look at what sweetheart?”<br>\r\n<br>\r\nJohnny slowly uncoiled from the fetal position and suddenly realized that he was back to his old height again. Kevin had willed him back to normal just before his mother opened the door.<br>\r\n<br>\r\n“Mom! I—uh—er. Sure. I’m gonna help you with the bags.”<br>\r\n<br>\r\nKevin absentmindedly pickup up his game from the seat, unbuckled his seatbelt and stumbled out of the car. “Sure you’re alright, Johnny?”<br>\r\n<br>\r\n“Yeah momma, I’m fine.” Johnny flashed her a big smile.<br>\r\n<br>\r\n“Well good. And I think we got you some new clothes just in time. These don’t fit you correctly anymore.” She tugged on Johnny’s overstretched t-shirt.<br>\r\n<br>\r\n“Um, yeah! Just in time,” he laughed nervously.<br>\r\n<br>\r\nHis mother turned around and opened up the heavy trunk door. As his mother rummaged through the department store bags, Johnny put his free hand behind his back felt around his rear. Sure enough, there was a gaping hole in the center of his khakis. “Oh no! What if mom sees?” Johnny nervously thinks to himself.<br>\r\n<br>\r\n“She won’t if you hide it long enough to get to your room.”<br>\r\n<br>\r\nJohnny jumped. “I forgot you were still there!”<br>\r\n<br>\r\n“I’m always here for you Johnny,” Kevin reassured him.<br>\r\n<br>\r\nJohnny could feel Kevin’s warmth, easing his tension. Johnny imagined that Kevin was smiling. This brought a smile to both of their faces. Johnny then focused on his new mission. He needed to get into the house and into his room without his mom noticing his ripped pants. That would raise too many questions. Questions Johnny wasn’t ready to answer. <br>\r\n<br>\r\nHe walk right up beside his mother and quickly took more bags than his share. Johnny then awkwardly held them around his whole body. “I need to look normal, but I have to cover my pants.” <br>\r\n<br>\r\n“Do your best Johnny.” Kevin agreed with Johnny, but couldn’t help but laugh at the peculiar solution. Fortunately his mother was too focused on getting in the house after a long trip to the store to notice  Johnny’s increasingly odd behavior.<br>\r\n<br>\r\nThey were barely five steps inside the door when Johnny dropped the bags in his hands. He took two steps in a full sprint before being halted by his mother’s commanding voice. “And where do you think you’re going young man?”<br>\r\n<br>\r\nJohnny turned nervously. “Momma?”<br>\r\n<br>\r\n“Aren’t you going to take your bags up to your room?” pointing her finger directly at the pile he just dropped.<br>\r\n<br>\r\nJohnny’s eyes flickered down and back up again. “Yes, mamma.”<br>\r\n<br>\r\nHe inched his way back to the bags, held them in the same awkward manner he did before, turned around and bolted out of the kitchen, around the corner and up the stairs as fast as he could. He tripped himself nearly half a dozen times in his short sprint.<br>\r\n<br>\r\nJohnny threw down the bags on his large, queen size bed, set down his game on his desk, then finally spun around and locked the door. “I made it!” Johnny thought with elation.<br>\r\n<br>\r\n“I thought you would never get here.”<br>\r\n<br>\r\nThat was Kevin’s voice, but it sounded too real. Johnny turned around to see Kevin standing in his bedroom right next to his tall dresser. “Mister!” <br>\r\n<br>\r\n“Hey little guy,” Kevin smiled, “It sounded like you needed my help. What can I do for you?”<br>\r\n<br>\r\nJohnny ran up to Kevin and gave him the biggest hug. “You’re here! You really are a magical Jiminy Cricket!”<br>\r\n<br>\r\nJohnny beamed and held him as tightly as he could. Now that he was a regularly sized eight year old again, that wasn’t very tight. At first, Kevin didn’t know what to do. He was momentarily stunned before returning the hug to little Johnny. Kevin had never known what this kind of adoration felt like until now. —And he liked it.<br>\r\n<br>\r\n“Of course I’m here. And your mother was right.”<br>\r\n<br>\r\nKevin briefly looks up with confusion. “These clothes are a little stretched out.”<br>\r\n<br>\r\nBoth laughed. They were on this journey together; this brought them happiness. Kevin continued. “You were in trouble. I want to help.”<br>\r\n<br>\r\nJohnny looked up once again, this time into Kevin’s eyes. He could see Kevin’s sincerity, even if he didn’t fully understand it.<br>\r\n<br>\r\n“I just wish I had been more— oh, what’s the word mister?”<br>\r\n<br>\r\n“Confident?”<br>\r\n<br>\r\n“Yeah! If I had been more ‘codifant’, momma would have seen me as a man and I wouldn’t be a little kid anymore.”<br>\r\n<br>\r\nKevin couldn’t help but laugh at the slight mispronunciation, but he understood. “More confidence? Do you think that will help little guy?”<br>\r\n<br>\r\n“Oh yeah! If I had that, then I could be big and strong. I could be a man like my big brother Dylan.”<br>\r\n<br>\r\n“Is there anything else you need?”<br>\r\n<br>\r\nJohnny was still holding on to Kevin. As Kevin’s mind wheeled through the possibilities, Kevin got a little better at following the massive collision of thoughts. Kevin knew through Johnny’s mind that being big and strong wasn’t enough if he was still a little kid on the inside. What Johnny didn’t know was that Kevin can change the mind as well as the body. Kevin could mold this little boy into anything he wanted to be. <br>\r\n<br>\r\nSo what is Kevin to do? Does he just will confidence into the boy and ask what he wants next? Does he turn him back into the “big strong man” he had almost been before, or does Kevin find other ways to help Johnny?<br>\r\n</span></div></div>",
            "created":1300251600,
            "id":1071403,
            "title":"Normal for Now"
        },
        "151231":{
            "author_id":"nightwolf285",
            "author_name":"nightwolf285",
            "choices":[
                "Johnny wants to keep growing (muscle and/or height)",
                "Johnny wants to talk to someone (big brother Dylan, Dad, class bully Lucas)"
            ],
            "content":"<div class=\"\"><div> <span>Johnny’s mind is still swirling with possibilities. He really doesn’t know what to do, while Kevin considers his next move. He stares down at the top of Kevin’s head and notices for the first time his thick, light brown hair. Just beyond the dense forest of follicles is a mind in agony. Kevin knows what he has to do.<br>\r\n<br>\r\nHe closes his eyes and wills self-confidence into Kevin. Almost instantly, Kevin can feel the change occur. However, this change was different. Rather than his body tingling, his mind literally felt like it was growing. Kevin could feel a warmth that wasn’t really there. Without meaning to, he held onto Kevin tighter and tighter as his mind began to change. He could feel all the confidence he barely knew existed just moments ago flooding his entire being. Johnny was changed, and Kevin could feel it.<br>\r\n<br>\r\n“What happened Kevin?”<br>\r\n<br>\r\nKevin silently noted that Johnny had just called him by his first name. That was a first. “I gave you the self-confidence you had been searching for.”<br>\r\n<br>\r\nJohnny and Kevin slowly released each other. Johnny took a few steps back. The two stood in silence. Kevin could feel Johnny’s increasing excitement overtaking his confusion. Although Johnny wasn’t moving, nor smiling, Kevin knew that Johnny was happy.<br>\r\n<br>\r\nAfter another few moments of silence, Johnny finally looked up at Kevin and smiled. “This is great! I feel—I feel—“<br>\r\n<br>\r\nEverything was starting to sink in. Youthful energy was returning to every limb of Johnny’s thin, eight year old body. It was becoming difficult to contain. “You feel?” Kevin asked knowingly.<br>\r\n<br>\r\nJohnny started pacing in circles around his room. Excitement continued to grow. “I feel just like you said! I’m just so sure of myself. I know this was the right thing to do and I have you to thank Kevin!”<br>\r\n<br>\r\n“I’m glad you like it Johnny. Now have the confidence to choose what to do next.”<br>\r\n<br>\r\nJohnny wasn’t listening. His mind was still swimming. Kevin actually had to block out many of the thoughts to keep from overwhelming him again. He saw images of people he didn’t know trying to flood his mind. “And the next time I see Lucas! Oh! He really thinks he is big stuff just because he’s almost five feet tall. Always pushing me and the others around.”<br>\r\n<br>\r\nJohnny paced faster. His eyes bolted in every direction. He was clearly lost in thought. Kevin took a step back towards Johnny’s desk. He needed to give Johnny more room to think. Kevin also was curious to see what effect changing a person’s mind would do to them.<br>\r\n<br>\r\nJohnny continued. “And what about dad? Yeah, I know he’s a big man. So what? Just because you’re big doesn’t mean you get to boss people around. I shouldn’t be treated like I am a five year old. I’m eight! I put away my clothes. I brush my teeth. What more does he want from me?”<br>\r\n<br>\r\nKevin could feel all this hidden pain spilling out of Johnny. Fear had kept him in line for all of his life. This was the first time he had ever explored these feelings of oppression. <br>\r\n<br>\r\nEver.<br>\r\n<br>\r\n“Why can’t more people be like Dylan!” Johnny paced even faster. His voice was getting louder with each breath. “He’s a junior in high school. He’s the captain of his wrestling team. He says every girl in the school follows him around wherever he goes. Oh gosh! Why do I never say anything to him? It makes me so happy to have a big brother, but all I can do is smile. Why do I never tell him how I feel? Why do I always keep it locked inside of me?”<br>\r\n<br>\r\nSuddenly, Johnny stopped. To Kevin, it looked as if someone had thrown Johnny’s off switch. Johnny then slowly turned to Kevin. Kevin wasn’t quite sure what to do. Johnny’s mind was still going a hundred miles per hour. He knew Johnny was excited, but this excitement felt different. It felt—smoother—than just a moment ago.<br>\r\n<br>\r\n“At least I can tell you how I feel,” Johnny remarked, taking a step closer to Kevin. “My whole life has been me living in the shadows. In the shadow of my dad, my friends—even Dylan. But you saw me for me. You picked me out of a store and changed my life. You could have done that for anybody. You could have gone anywhere. But you chose me.<br>\r\n<br>\r\n“I just wanted you to know Kevin—what you did— what it meant…“ Johnny lost the words. He took another step closer to Kevin. Kevin could see tears welling up in Johnny’s huge, baby blue eyes. “—that meant so much to me Kevin.”<br>\r\n<br>\r\nJohnny took another step, head still up, eyes getting larger. “You—Kevin—“<br>\r\n<br>\r\nKevin couldn’t move. He couldn’t speak.<br>\r\n<br>\r\n“—you mean everything to me.”<br>\r\n<br>\r\nJohnny lunged his tiny arms around Kevin once more, holding him as tight as possible. Kevin could feel the tears falling on his stomach, moistening his shirt.<br>\r\n<br>\r\nKevin was stunned. His own mind was in a tailspin. No one since Nuncio had ever been this grateful for Kevin’s inexplicable need to help others. As he stood there being held by Johnny, he couldn’t help but think of more ways to help him. Johnny had overcome him. Kevin had to help in any way he could. Obviously confidence had been a great start for Johnny. Where could he go from here?<br>\r\n<br>\r\nAll of the sudden, the image of Kevin in his 6’ foot frame came back to Kevin’s mind. Johnny had been so happy in the car on the way home. Only his lack of confidence had held him back. Neither of them realized in the first few moments that Kevin’s thoughts were quickly becoming reality. <br>\r\n<br>\r\nJohnny had begun to grow once again. <br>\r\n<br>\r\nKevin was the first to notice. Johnny’s grip felt tighter. Also, it was slowly ridding up his body, getting closer to his chest. Kevin looked down and saw that Johnny was getting larger. His clothes remained the exact same size, but all of his limbs were slowly enlarging. His arms stretched like a hose out of his sleeves and wrapped their way around Kevin.<br>\r\n<br>\r\nHis legs lengthened and pushed Johnny’s body higher in the air. Johnny’s shirt was slowly ridding up his torso, exposing his flat stomach to the cool of his bedroom air. He was almost eye level with Kevin now. Kevin held onto Johnny as best he could, but his whole body was thickening. Even though Johnny was thin, he was growing over a foot and a half taller. In fact, Kevin just realized that this would make Johnny taller than him. Kevin was only 5’9”.<br>\r\n<br>\r\nJohnny had already realized that he was growing, but this made him want to be even closer to Kevin. After all Kevin had done for him, he was doing even more. All the emotions and gratitude he felt just made Johnny want to hold Kevin even tighter.<br>\r\n<br>\r\nJohnny’s head slid past Kevin’s shoulder and was now resting on it. Kevin’s arms were being forced wider around Johnny’s body. He could feel his clothes tightening around the growing eight year old once again. Both heard the snapping of fabric from the floor. Johnny’s feet finally felt the taste of freedom after tearing down the oppressive walls of his sneakers. His clothes began to stretch in other places as well. Johnny’s shirt tightly wrapped around him, but couldn’t even reach down to his navel anymore. Johnny could feel the cool air of his room brushing his skin, but he didn’t care.<br>\r\n<br>\r\nWhen Johnny’s growth finally came to a halt, the two of them just stood there. Kevin was awed by Johnny just as much as Johnny was awed by Kevin.<br>\r\n<br>\r\nJohnny didn’t dare let go of Kevin. Even with all this new found confidence, there was still a tiny part of him petrified all of this was a dream. If he let go, that would be the same as waking up. Kevin could feel this in his mind and reassured him by tucking his arms under Johnny’s and holding his torso with a light, but steady locking of arms.<br>\r\n<br>\r\nAfter what felt like an eternity of standing in Johnny’s room, Kevin gently rolled his shoulder. Johnny cautiously rose his head up and was silently amazed as it kept rising past Kevin’s eyes.<br>\r\n<br>\r\nEight year old Johnny was looking down at Kevin. Eighteen year old Kevin was looking up at Johnny. What happened next?<br>\r\n</span></div></div>",
            "created":1300338000,
            "id":1071699,
            "title":"Growing Confidence"
        },
        "1512312":{
            "author_id":"nightwolf285",
            "author_name":"nightwolf285",
            "choices":[
                "Kevin makes Johnny as big as Dylan",
                "Kevin makes Johnny much bigger than Dylan"
            ],
            "content":"<div class=\"\"><div> <span>“I—“ Johnny stuttered, “I think I need to go talk to Dylan.”<br>\r\n<br>\r\n“Ok. Then let’s go talk to Dylan.”<br>\r\n<br>\r\nJohnny hesitated. “I think I need to go to the next level first.”<br>\r\n<br>\r\nJohnny’s wide eyes beamed at Kevin. It was odd hearing Johnny talk like he did before he had self-confidence. “What did you have in mind big guy?”<br>\r\n<br>\r\nJohnny blushed. Although this wasn’t the first time Kevin had called Johnny a big guy, this was the first time it had sank in as being reality. Johnny was big, and he wanted to be bigger.<br>\r\n<br>\r\n“Bigger?” Kevin asked. He started to pull away, but Johnny held him firm. He didn’t want Kevin going anywhere.<br>\r\n<br>\r\n“Yeah. The thing is that my brother Dylan is a huge athlete. I could march in his room right now and tell him how I feel about everything. I know I could.”<br>\r\n<br>\r\n“I know you can. I can feel it.”<br>\r\n<br>\r\nIf it were possible, Johnny blushed even more, turning his cheeks into a deep scarlet red. Despite his confidence and his size, Kevin had a special effect on him in more ways than one.<br>\r\n<br>\r\n“I know I can,” Johnny continued, “But if I am not his equal, he won’t listen.”<br>\r\n<br>\r\nKevin twisted his face. “Your brother doesn’t listen to you?”<br>\r\n<br>\r\nJohnny knew instantly that he had misspoke. This caused him to loosen his grip just enough for Kevin to step back. Johnny wanted to leap out and grab him again, but now he was flustered about giving Kevin the wrong impression about Dylan. “No, that’s not what I mean. He’s a really cool guy! He’s awesome! He’s usually always smiling. Asks me how my day was. He’s great.”<br>\r\n<br>\r\nKevin felt Johnny’s tension remain. There was something else to it. “So, why do you think he won’t listen to you as you are now? You are a 6’ tall third grader. You’re huge. He would have to listen to you.”<br>\r\n<br>\r\nSuddenly, the image of Dylan filled both of their minds. It was all either of them could see. Instantly, Kevin knew what Dylan meant. Dylan was your classic, popular, high school sports star. He was tall, thick with muscle, rugged, deep voiced and had more confidence in one finger than most teenagers would have in their whole lives. Being 6’6” and over 220 with solid, ripped muscle could do that.<br>\r\n<br>\r\n“I know that I am so much more than I was,” Johnny continued, “But even I know that I do not compare to him. If I am going to face him, I have to be on an equal playing field. I know he listens to me. But sometimes I kinda feel like he is only half listening. He’s always in-between things. If he’s not rushing off to practice, he’s working out at the gym. One minutes he’s working on homework, the next he’s off to the mall with a group of friends.<br>\r\n<br>\r\n“If I am going to get his attention, I really need to get his attention. I need him to drop everything, if only for two seconds, so he can hear what I have to say.”<br>\r\n<br>\r\nJohnny had actually worked himself up. He was heaving heavy breaths. They were so heavy that his already strained shirt fought to hold itself around Johnny’s chest. Kevin could swear he even heard threads snapping under the arms.<br>\r\n<br>\r\nKevin refocused on Johnny’s eyes, which were so sincere and large. Johnny honestly believed that he needed an even bigger boost to get his brothers attention. And that was saying a lot, since Johnny was swimming in a level of self-confidence he had never known. Maybe Johnny was speaking from some untapped wisdom that his new found confidence was providing access to?<br>\r\n<br>\r\n“Well—Kevin—what do you think?”<br>\r\n</span></div></div>",
            "created":1300338000,
            "id":1071793,
            "title":"Johnny want to see Dylan, But First..."
        },
        "15123121":{
            "author_id":"nightwolf285",
            "author_name":"nightwolf285",
            "choices":[
                "Johnny's Dad",
                "Johnny's \"big\" brother Dylan"
            ],
            "content":"<div class=\"\"><div> <span>Without saying a word, Kevin closed his eyes and imagined Dylan. 6’6”; 220 pound; filled with thick, rippling, heavy muscle. He added just a little extra to the image to ensure Johnny got what he wanted. <br>\r\n<br>\r\n“This is what Johnny must now look like,” Kevin thought to himself.<br>\r\n<br>\r\nKevin opened his eyes and smiled. Johnny knew that something was happening. A smile suddenly burst across his face. Once again, Johnny was growing larger. He could feel the same warm sensation filling his body. However this time it was different. There were extra crackles of heat enveloping every muscle in his body. It felt gentle, but sharp like licks of a flame.<br>\r\n<br>\r\nJohnny was getting taller just like before, but his body was also growing new found muscle. His flat, thin frame was quickly filling out. New curves and bulges were developing. Johnny’s shirt could barely contain his thickening chest. His arms stretched his tiny sleeves to their breaking point. Just below his shirt was a growing field of rippling bulges. Johnny’s abs quickly erupted from a four pack, to a six pack and finally stopped at  a rock solid eight pack. All of them were clearly visible under Johnny’s shrinking shirt line.<br>\r\n<br>\r\nJohnny was ecstatic. His breaths were getting shorter and heavier. His whole face was flush and he had broken out into a slight sweat. “Look at me Kevin! Look at me! I’m getting as big as Dylan.”<br>\r\n<br>\r\n“Even a bit bigger,” Kevin thought to himself with a triumphant smirk, but was sure not to let Johnny hear.<br>\r\n<br>\r\n“And my clothes. They are getting so tight. I can feel them strangling my body.”<br>\r\n<br>\r\nHis widening back was the final straw, snapping his shirt clean off. In an instant, Johnny’s shirt was in shreds and feel near his growing feet, which had now completely demolished his poor tennis shoes. His feet had more than doubled the size of his shoes and were still growing. <br>\r\n<br>\r\n“Ah!” Johnny said with elation. That feels much better.<br>\r\n<br>\r\nJohnny’s chest was bare and exposed and look no different than one of a professional, adult athlete. Even his legs were keeping up with his impressive and rippling torso. Johnny’s calves violently wrapped themselves around his entire lower legs and were filling up like rock solid balloons. His upper leg did the same, but with even more voracity. Johnny’s khaki shorts were nothing more than tiny running shorts now. Almost all of his thighs were exposed and they were forming thick bulges fighting for their own space under his smooth, lightly colored skin.<br>\r\n<br>\r\nFinally, Johnny’s growth was complete and all he could do was feel every part of his new body.<br>\r\n<br>\r\n“This feels so weird Kevin!”<br>\r\n<br>\r\n“What’s weird?” Kevin smiled.<br>\r\n<br>\r\n“All of these bumps!” Kevin grabbed the huge cleft of his chest, one in each hand and squeezed. “It feels like I have these huge rocks under my skin and I can’t get them out.”<br>\r\n<br>\r\nKevin couldn’t help but laugh. Johnny may now be a towering hulk of a child, but he was still a child. Johnny’s wonder endeared Kevin to him more and more. Johnny rubbed his hands along his abs. “And these feel so weird! Each bump feels like they are standing up on their own. And these---“<br>\r\n<br>\r\nJohnny had moved on to his thighs. As he rubbed each one, trying in vain to wrap his hand around them, he discovered how to flex his legs. “Oh wow! I didn’t know they got even harder!”<br>\r\n<br>\r\nKevin lived this experience through Johnny. His wonder made every experience new again. “I just—just—“ Kevin heaved as he erected his back, “I can’t believe how huge I am.”<br>\r\n<br>\r\nKevin came right up to Johnny, staring almost a whole foot in the air and said, “Believe it.”<br>\r\n<br>\r\n“Oh wow…” Johnny exhaled. His excitement became awe. “You’re tiny.”<br>\r\n<br>\r\n“You’re big.”<br>\r\n<br>\r\n“I can’t believe any of this. I just can’t.” <br>\r\n<br>\r\n “Like I said a minute ago.” Kevin took Johnny by the hands. “Believe it.”<br>\r\n<br>\r\nJohnny’s huge blue eyes shined down at Kevin. He was huge, but he was a boy. Johnny didn’t think it was possible to feel this close to another person. Before Kevin knew it, Johnny embraced Kevin with his two, huge, rippling arms. It took Kevin another moment to realize that his feet were no longer on the floor either. Johnny lifted Kevin without any effort at all, setting his head to rest on Johnny’s enormous, bolder like shoulder. <br>\r\n<br>\r\nJohnny was stunned by how light Kevin’s thin body was, but at this point, anything was possible. All Kevin could do was try to return the favor and hug Johnny in return. This proved impossible. Kevin’s arms were locked at his side. Although Johnny was not squeezing him this time, Kevin was firmly locked in place. Besides, even if his arms had been free, he wouldn’t have been able to wrap them around Johnny’s enormous pecs or his flaring lats.<br>\r\n<br>\r\nKevin was even caught off guard by just how solid Johnny’s body was. As he dangled half a foot in the air, he could feel just how rock solid Johnny had become. Johnny’s chest violently shoved themselves into Kevin’s ribs with each breath. Johnny’s biceps muscle alone is what locked Kevin’s whole arm at their sides.<br>\r\n<br>\r\n“You have given me the greatest gift ever Kevin! And—well—“<br>\r\n<br>\r\nNeither of them moved from their warm embrace, but Kevin did ask. “What is it? I can feel all of your emotions whirling around in my mind. What are you trying to say?”<br>\r\n<br>\r\nJohnny heaved a large breath, briefly forcing the air out of Kevin. “Well, I don’t know if this is the right word for it. I am only in the third grade…”<br>\r\n<br>\r\nJohnny’s voice once again lingered off.<br>\r\n<br>\r\n“What is it? You can tell me Johnny.”<br>\r\n<br>\r\nA pause. “I love you.”<br>\r\n<br>\r\nA second pause. “Love can mean many things,” Kevin reminded.<br>\r\n<br>\r\n“I know,” Kevin said, “But I don’t know any other word for how I feel right now. I feel so close to you. I trust you so much. I think you are even more than a brother, cuz I don’t even feel like this with Dylan. So, yeah. I don’t know what else to call it.”<br>\r\n<br>\r\nKevin rubbed his head along Johnny’s shoulder. “I think I know what you mean. Helping people has always been what I do. I do it because I feel I have to.”<br>\r\n<br>\r\nKevin stopped for a moment. “No. I do it because I want to. And then I helped someone who gave me the power to help so many other. At first, I couldn’t believe it. My mind was spinning. I really wanted to try out this new power. Not soon after, I found you just wandering in a department store.”<br>\r\n<br>\r\nJohnny gave Kevin a slight squeeze. Kevin continued. “You were just trying to reach your book, so I helped out. I had no idea that that little moment would become anything more. But as more things kept happening, it became clear to me that if I was going to help people, I would need to do it one person at a time.”<br>\r\n<br>\r\nKevin lifted his head off of Johnny’s huge shoulder. Johnny slowly set Kevin down with a nod of approval. “And that person is you Johnny,” Kevin said smiling up at Kevin. “I am going to make it my mission to help you right every wrong before I worry about the next person in need.”<br>\r\n<br>\r\nJohnny ached at the thought of Kevin ever leaving, but quickly set that emotion aside. “Are you ready to see Dylan?” Kevin asked.<br>\r\n<br>\r\nJohnny nodded. “Oh yeah. I’m ready. Just one thing.”<br>\r\n<br>\r\n“Yeah?”<br>\r\n<br>\r\n“I want you to be there with me.”<br>\r\n<br>\r\n“You don’t think that will weird him out or something?”<br>\r\n<br>\r\n“Nope!” Johnny said with a huge smile on his face.<br>\r\n<br>\r\nKevin laughed. “You seem really sure. How can you be certain?”<br>\r\n<br>\r\n“Self-‘comdifant!' ”<br>\r\n<br>\r\nKevin laughed harder. “Co-confident!”<br>\r\n<br>\r\n“Oh!” Johnny corrected himself. “Self-confident! And, if you are standing behind me, I’m sure he won’t even know your there.”<br>\r\n<br>\r\nBoth of them imagined Kevin’s thin, 5'9\" body hiding behind Johnny’s huge, 6'7\" frame and both of them laughed.<br>\r\n<br>\r\nKNOCK. KNOCK. KNOCK.<br>\r\n<br>\r\nThey stopped laughing immediately. Their eyes narrowed in on the door. Who was on the other side?</span></div></div>",
            "created":1300338000,
            "id":1071796,
            "title":"Dylan's Equal"
        },
        "151231211":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Johnny introduces Kevin to one of his friends",
                "Kevin leaves but follows Johnny telepathically at school"
            ],
            "content":"<div class=\"\"><div> <span>When George walked in the bedroom, his jaw almost dropped to the floor when he saw the huge, hulking young man standing before him. At first, he had no idea who the towering figure was, except for the fact that the man's face seemed vaguely familiar.<br>\r\n<br>\r\n\"Hey... Who... Who are you?\" George said to the muscular boy, and then to Kevin, who was sitting on the bed. \"And you? What are you doing in Johnny's room?\"<br>\r\n<br>\r\n\"Dad... DAD! It's me!\" the towering muscle boy said, as he walked closer to his father.<br>\r\n<br>\r\nGeorge, who was a little over 6 feet tall, was astonished as he craned his neck to look UP at the enormous muscular boy, who towered over him at 6 foot 7 inches tall with the physique of a bodybuilder at 275 pounds of raw muscle. When he looked up, he suddenly recognized the face of his son, Johnny, attached to the large, muscular body that was standing before him.<br>\r\n<br>\r\n\"Johnny?\" George said, with a touch a fear in his voice.<br>\r\n<br>\r\n\"It's me, dad! How do I look?\" the hulking boy said, with a wide grin on his face, as he extended his mighty arms sideways. George looked on and couldn't believe it. Every inch of his son's body was covered with enormous muscle.<br>\r\n<br>\r\n\"You... You're HUGE! How... How did you get so BIG?\"<br>\r\n<br>\r\n\"Kevin here is an angel... I made a wish and he made me grow...\" Johnny explained, as he pointed at the young man who was sitting on the bed.<br>\r\n<br>\r\nKevin quietly got up and walked next to Johnny, extending his hand to George for a handshake.<br>\r\n<br>\r\n\"Hi... I'm Kevin... Kevin Staples... I'm not really an angel but I received my powers from an angel... Your son had made several requests and I granted them...\" Kevin explained to Johnny's father.<br>\r\n<br>\r\n\"So... Uhh... Johnny is only eight-years-old! Is he going to remain that big?\" George wondered.<br>\r\n<br>\r\n\"As long as he wants... I can always change him back...\" Kevin shrugged.<br>\r\n<br>\r\n\"Yeah! He changes me anytime he wants!\" Johnny cheered.<br>\r\n<br>\r\n\"Well... Alright... As long as you don't hurt him...\" George said. \"Pleased to meet you...\"<br>\r\n<br>\r\n\"I will never hurt your son... I promise you that!\" Kevin assured him.<br>\r\n<br>\r\nThen George turned around and left the room. Kevin turned around to face Johnny, who now had a sad look on his face.<br>\r\n<br>\r\n\"What's the matter, big guy?\"<br>\r\n<br>\r\n\"Hey... Umm... Kevin...?\"<br>\r\n<br>\r\n\"What's wrong?\"<br>\r\n<br>\r\n\"Once you change me back... Are you... Are you gonna leave me?\" Johnny asked him, with tears starting to roll down from his eyes.<br>\r\n<br>\r\n\"No way, Johnny... You're just too much fun to change! I will always be with you!\" Kevin replied.<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\n\"I will give you that ability to always be able to communicate with me telepathically... And it will be permanent... You will have that ability as of right now!\" Kevin said, as he snapped his fingers.<br>\r\n<br>\r\nJohnny was able to hear his thoughts and they were able to communicate just by thinking, even over great distances!<br>\r\n<br>\r\n\"We will communicate, even if we're thousands of miles away!\"<br>\r\n<br>\r\n\"Awesome!\" Johnny cheered! \"I love you!!!\"<br>\r\n<br>\r\nJohnny approached Kevin and gave him a huge hug, lifting him high into the air. He kissed the smaller man on the forehead, before setting him back down again.<br>\r\n<br>\r\n\"What shall we do next?\" Johnny wondered.<br>\r\n<br>\r\n</span></div></div>",
            "created":1300338000,
            "id":1071944,
            "title":"Johnny's Dad"
        },
        "1513":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Make me taller again!",
                "Make me older by a few years!",
                "Make me more muscular!"
            ],
            "content":"<div class=\"\"><div> <span>\"Can you make me grow later, after I get home?\" Johnny asked Kevin.<br>\r\n<br>\r\n\"Sure... No problem...\" Kevin replied telepathically.<br>\r\n<br>\r\nA few minutes later, the car pulled into the driveway of their house, and Johnny leaped out of the car and ran into his bedroom.<br>\r\n<br>\r\nOnce he was in his room, Kevin's voice returned to him.<br>\r\n<br>\r\n\"Ready to have some fun?\"<br>\r\n<br>\r\n\"Yeah!\" Johnny cheered.<br>\r\n<br>\r\nSuddenly Johnny's feet started to hover off the floor as his body began to levitate and float in mid-air!<br>\r\n<br>\r\n\"HEY! What's going on?\" the boy gasped.<br>\r\n<br>\r\n'We're just gonna have some fun!\" Kevin laughed.<br>\r\n<br>\r\nThen Johnny rose up above the floor and flipped around, until he was hanging upside-down in mid-air. Then he spun around and flew in a wide circle around his room, three times!<br>\r\n<br>\r\n\"Wheeeeeeee!!!\"<br>\r\n<br>\r\nJohnny then spun around and did a complete backflip in the air, making several flips and loops, while flying from one end of his room to the other, until he finally landed with his feet on the floor.<br>\r\n<br>\r\n\"Wow that was so COOL!\"<br>\r\n<br>\r\n\"Did you have fun?\" Kevin asked him.<br>\r\n<br>\r\n\"Oh yeah!\"<br>\r\n<br>\r\n\"So, what do you want to do next?\" Kevin asked.<br>\r\n<br>\r\n\"Well....\"<br>\r\n</span></div></div>",
            "created":1265259600,
            "id":830787,
            "title":"Wait till later"
        },
        "15132":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Johnny thanks Kevin by giving him a foot massage",
                "Kevin is mesmorized by Johnny's physique and bare feet"
            ],
            "content":"<div class=\"\"><div> <span>Kevin asks Johnny \"How much older?\" Johnny replies \"About 6 years older should do it.\"<br>\r\nKevin says \"You might want to take off your clothes especially your shoes. They'll rip as you grow.\"<br>\r\nJohnny kicks off his shoes then peels off his socks revealing two semi tan, hairless bare feet with trim, slender toes. He then takes off his pants and t-shirt and stands before Kevin in his boxers. Johnny says \"That should do it.\"<br>\r\nKevin tells him that they might rip too and to take them off. Johnny turns and takes his boxers off and stands naked with his back to Kevin. <br>\r\nJohnny is lifted off the floor and swirled around a few times as he feels his body mass enlarging. A moment later he is lowered to the ground and notices his small 6 inch bare feet are now 11 inches in length. He also notices he is well endowed in the penis department. Kevin throws him a towel to cover his waist.</span></div></div>",
            "created":1514569800,
            "id":2434066,
            "title":"Make me older by a few years!"
        },
        "151321":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Johnny kisses Kevin's big toes, then sucks on them",
                "Kevin returns the favor and massages Johnny's bare beauties",
                "Kevin wakes up completely naked and tied up to a chair"
            ],
            "content":"<div class=\"\"><div> <span>Johnny covers his waist with the towel. A noticeable bulge in the front of the towel is seen by Kevin. Johnny looks his own body and is thrilled to have some muscles and bigger hands and feet. \"How can I ever repay you Kevin?\" Johnny asks.<br>\r\nKevin replies by saying \"Pay it forward.\"  Johnny exclaims \"I know, hear sit down on this chair. I learned this from my mom and give these to her all the time.\" Kevin looks puzzled and says \"What is it?\" as he sits down.<br>\r\nJohnny replies \"A good ol' fashion foot massage!\" Johnny bends down and pulls off Kevin's sneakers one at a time revealing two grey socked feet of about 12 inches in length. He begins to massage Kevin's soles and toes with his fingers. Kevin winces saying \"Uh, there's really no need to do...that, oooohhhhh, yes, right there.\"  Johnny knows all the spots, learned from his mom. Kevin leans back in the chair as Johnny peels off both of Kevin's socks revealing two tan, hairless bare feet with pedicured, slender toes. Kevin splays them in relief. Johnny says \"Massaging bare feet is the best, my mom always says.\" Kevin can only moan some more and closes his eyes. Johnny reaches for some lotion in his backpack and spreads it all over Kevin's soles and toes, then works it in. <br>\r\nJohnny does such a great job that Kevin falls asleep, bare feet and all. <br>\r\n</span></div></div>",
            "created":1514618700,
            "id":2434349,
            "title":"Johnny thanks Kevin by giving him a foot massage"
        },
        "1513211":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Kevin wakes up refreshed, but still barefoot",
                "Johnny is dressed with shoes and socks on his feet",
                "Johnny's friend Sean is invited over"
            ],
            "content":"<div class=\"\"><div> <span>Johnny notices that Kevin has drifted off to sleep. He takes his two big toes and engulfs them both into his mouth and swirls his tongue around them. This causes Kevin's other toes to splay as Kevin moans. Johnny then nibbles on each of Kevin's bare toes and kisses each one, causing more wiggling and splaying.</span></div></div>",
            "created":1514913780,
            "id":2435797,
            "title":"Johnny kisses Kevin's big toes, then sucks ..."
        },
        "15132113":{
            "author_id":"socal2017",
            "author_name":"beachboy",
            "choices":[
                "Sean continues massaging Kevin's back, then pulls off Kevin's boxers",
                "Johnny loves his second chance at massaging Kevin's bare feet and toes",
                "Kevin grabs hold of Sean's right bare foot and tickles his toes"
            ],
            "content":"<div class=\"\"><div> <span>Kevin stays asleep for a while after Johnny's foot massage. Johnny finds a pair of Kevin's shorts that fit his new physique along with a t-shirt and a pair of flops. He sees his friend Sean walking down the sidewalk through the window and runs outside to see him. Sean doesn't recognize him at first, because of his growth, but then Johnny shows him his noticeable birthmark on his right ring toe. It's a black, big dot about a quarter inch in diameter. Sean looks closely at Johnny's bare feet and toes then looks up at him. <br>\r\nSean says \"I used to be taller than you, now I'm eight inches shorter? Your feet used to smaller than mine and now their almost a foot long? What gives?\" Sean is about 8 years old, brown haired, blue eyed, lean, four-foot tall boy. Johnny says \"Come on in and I'll show you.\"<br>\r\nJohnny invites Sean into the house, kicking off his flops at the door and says \"Take your shoes off before you come inside please. Kevin doesn't like shoes worn in his house.\" Sean stoops down and unties his sneakers and pulls them both off revealing grey calf-high socks. He places them outside by the door and walks inside with Johnny. They both walk over to a sleeping and barefoot Kevin.<br>\r\nJohnny says \"He's the one who made me grow. I gave him a foot massage to say thanks and he fell asleep.\" Sean replies \"Boy he has big feet! I wish mine were that big and looked that way. My feet aren't as tan or as smooth as these bare beauties or as yours Johnny.\" Sean lifts his right leg and peels off his sock and then does the same with his left one revealing two off white, hairless bare feet with non pedicured toes that need one. <br>\r\nJohnny looks down at them saying \"They look fine Sean. You just need to let them see the sun more and get a pedicure once in a while. I used to think only girls got them, but my mom took me about a month ago and it felt great.\" Sean again looks down at Johnny's bare feet and replies \"Your bare feet do look a lot better including those toes of yours.\" Johnny splays his toes.<br>\r\nJust then Kevin slowly begins to wake up splaying his bare toes and rubs his eyes. He looks over at Johnny and Sean and says \"Boy Johnny that was some foot massage! My feet feel great!\" Kevin wiggles his toes. Johnny replies \"It's the least I could do for what you did for me. Oh, this is my friend Sean. Do you think you could help him too?\"<br>\r\nKevin shakes Sean's hand then sneaks a peek at his bare feet saying \"Nice to meet you Sean. Let me guess...you want bigger feet and pedicured toes? Am I right?\" Sean stands back and nods his head. Kevin continues \"Why don't I give you what your friend Johnny got? I can give your feet a new look plus give you a new look and build all over.\" Johnny takes off his borrowed t-shirt and shows off his built, tan chest. Sean looks at it in awe. Johnny smiles and says \"That's not all Sean...(he pulls down his shorts revealing his well endowed package), I got this too!\" Sean again is dumbstruck. Johnny pulls his shorts back up, but leaves his shirt off and says \"You'll have to strip down naked Sean because when you grow, your clothes will rip apart. These are borrowed clothes from Kevin.\" <br>\r\nSean happily begins to peel off his shirt, then unbuckles his pants and pulls them and his boxers off at the same time leaving him buck naked in front of Kevin and Johnny. Kevin says \"Well, your not shy! Sean close your eyes and spread your feet out a little.\" <br>\r\nSean complies replying \"I love to go naked at home all the time, so stripping is no problem.\"<br>\r\nJohnny stands back as Kevin concentrates while looking down at Sean's bare feet. Sean's feet begin to lengthen, become tanner and his toes are pedicured. He then is lifted into the air and spun around a few times. A moment later Sean is brought back down to the ground. Sean has grown about 2 feet to 6 feet tall overall. Johnny notices Sean's bare feet have transformed into two beautiful pair of bare feet. He also notices Sean's package has grown to resemble his own package and Sean's chest has some hair on it and is built. Sean opens his eyes and looks in a nearby mirror at his transformed body beginning at his bare feet. He splays his toes and shakes his well-endowed package in disbelief. He turns around to show off his new look to Kevin and Johnny.<br>\r\nKevin says \"You look a lot better including those bare beauties of yours.\" Johnny pipes in \"I agree Sean, your body and those bare feet of yours look awesome!\" Sean thanks them both and replies \"Kevin, can I borrow some shorts, t-shirt and some flops?<br>\r\nKevin replies \"Sure, the extra clothes and flops are in the closet.\" Sean thanks him by coming over to Kevin and shaking his hand. <br>\r\nHe pushes Kevin back into his recliner and props his bare feet up on the footrest. Sean begins to massage Kevin's soles and bare toes saying \"I just want to thank you too by giving you a massage. I give my dad one when he comes home from work.\" Kevin closes his eyes. Sean continues \"Mind if I take off your shirt and shorts and massage your back?\" Kevin shakes his head. Sean and Johnny move Kevin to lay down on the couch and take off his shirt and shorts leaving him only wearing his boxers. As Sean begins to massage Kevin's back, Johnny begins to massage Kevin's feet again. Kevin moans and splays his toes again.<br>\r\n<br>\r\n<br>\r\n<br>\r\n <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1515076980,
            "id":2436711,
            "title":"Johnny's friend Sean is invited over"
        },
        "152":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Kevin changes Johnny some more",
                "Kevin makes Johnny grow more muscular"
            ],
            "content":"<div class=\"\"><div> <span>Johnny finally got to go home with his mother, Kate. Kate is divorced and living with her only son, who is Johnny. She cared for him and always worried about the boy.<br>\r\n<br>\r\nWhen Johnny got home he sat in his room, staring out the window while sitting on the edge of his bed.  He pondered for a moment the first day of school, when suddenly his mouth opened and he heard Kevin’s voice speak through him.<br>\r\n<br>\r\n“Johnny…” Kevin’s voice spoke, coming out of Johnny’s mouth.<br>\r\n<br>\r\n“What? Where are you? Kevin?”<br>\r\n<br>\r\n“I’m speaking through your mouth!” Kevin replied.<br>\r\n<br>\r\n“Oh… That’s cool…” Johnny chuckled. “It’s like always having somebody with me! I’ll never be alone again!”<br>\r\n<br>\r\n“Well, I’ll only be within you as long as you allow it, Johnny!”<br>\r\n<br>\r\n“I want you to stay forever!”<br>\r\n<br>\r\n“Umm… If you ever decide that you want me to leave, I’ll give you three days of telling me to leave before I will, alright?” Kevin asked the boy.<br>\r\n<br>\r\n“Alright…” Johnny replied.<br>\r\n<br>\r\nThen the door opened and Kate walked in.<br>\r\n<br>\r\n“Johnny?”<br>\r\n<br>\r\n“Hey, mom?”<br>\r\n<br>\r\n“Who are you talking to?” his mother asked him. “I hear you talking to somebody in your room.”<br>\r\n<br>\r\n“I’m talking to Kevin, a friend of mine.”<br>\r\n<br>\r\n“So, where is Kevin?” Kate wondered.<br>\r\n<br>\r\n“He’s… He’s inside of me.”<br>\r\n<br>\r\n“What?” Kate wondered. “What are you talking about?”<br>\r\n<br>\r\n“He’s a guy who is given the power over all boys by an angel!” Johnny explained. “And I allowed him to speak through me.”<br>\r\n<br>\r\nSuddenly, Kevin’s voice spoke up using Johnny’s mouth.<br>\r\n<br>\r\n“Greetings, Kate, I’m Kevin.” He said. “Your son has allowed me to communicate through him.”<br>\r\n<br>\r\n“Please…” she pleaded, “Please, don’t harm my son.”<br>\r\n<br>\r\n“Harm him?” Kevin spoke through Johnny. “I will protect him and watch over him. I will make him strong when he is weak, and I will make him tall when he is short.”<br>\r\n<br>\r\n“You can do that?” Kate asked him.<br>\r\n<br>\r\n“Sure!” Kevin replied. “Just look at what I will do to Johnny now.”<br>\r\n<br>\r\nSuddenly, Johnny felt a tingling in his chest. His pectorals started to inflate and grow like balloons, as they filled out. <br>\r\n<br>\r\n“Oh my gosh! Your chest! It’s gotten bigger!” Kate exclaimed.<br>\r\n<br>\r\n“Cool huh, mom?” Johnny grinned. “He can change me in any way!”<br>\r\n<br>\r\nKate just gasped as she stared at her 8 year-old son with a huge chest. In the meantime, Johnny just wondered what Kevin was going to do next.<br>\r\n</span></div></div>",
            "created":1186894800,
            "id":435161,
            "title":"Kevin meets Kate"
        },
        "1522":{
            "choices":[
                "Johnny would be huge as a skyscraper! ",
                "Johnny would like to have the powers of Superman! ",
                "Johnny would like something else!"
            ],
            "content":"<div class=\"\"><div> <span>\"It's amazing!\" Exclaimed Kate, seeing as they were grown up the pecs of his Son.<br>\r\n<br>\r\n\"You make my older son and muscular with a grown man, without altering his age?\" Asked Kate excited.<br>\r\n<br>\r\n\"That depends on whether Johnny and agree!\" Said Kevin, through the mouth of the boy.<br>\r\n<br>\r\n\"In fact, I would be big and muscular as he asked my mother!\" Said Johnny.<br>\r\n<br>\r\n\"Then you'd better prepare Johnny, go!\" Said Kevin.<br>\r\n<br>\r\nSuddenly, Johnny felt a strong vibration in his body and realized that burst of growth in height and muscle. Kate gasped as she was to become big and muscular, his son. In a few moments, Johnny reached the height of ten feet and became more muscular than any in the world bodybuilding champion. His veins were as powerful as the snakes that were pumping at full power.<br>\r\n<br>\r\nWith his powers, Kevin also change Johnny's clothes, replacing them with just a green slip from bodybuilding champion, able to adapt to the size and growth of muscles in his owner. The abs belly Johnny were carved eight huge and perfect sections. Johnny could feel the full power of at least a million bodybuilders in him. Johnny was a boy of eight years, yet now he had the body on a massive, muscular and powerful in the world.<br>\r\n<br>\r\n\"Look at that power, Mom!\" Said Johnny excitedly, While doing bodybuilding poses in front of his mother.<br>\r\n<br>\r\n\"Oh Johnny, you're wonderful!\" Said Kate, excited and proud for his son.<br>\r\n<br>\r\n\"You want me to do something else for you Johnny?\" Said Kevin through the mouth of Johnny. </span></div></div>",
            "created":1339934160,
            "id":1361439,
            "title":"Kevin makes Johnny grow more muscular"
        },
        "15223":{
            "choices":[
                "That his friends become like him!",
                "something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else did she really want Johnny?</span></div></span></div>",
            "created":1339956240,
            "id":1361570,
            "title":"Johnny would like something else!"
        }
    },
    "info":{
        "author_id":"rex_torres",
        "author_name":"scriptboy",
        "brief_description":"A benevolent spirit gives Kevin divine power over all boys on earth.",
        "created":1166228940,
        "description":"<td align=\"left\" class=\"norm\">This is the story of Kevin Staples, an 18 year-old guy who is granted divine powers over all boys on earth after he saves the life of one of his best friends during the Boy Scouts camp.<br>\r\n<br>\r\nKevin gains the ability to change any boy, from toddler to 18 years-old.<br>\r\n<br>\r\nKevin can make any boy grow taller, bigger, stronger and more muscular. He can also make them athletic or smarter. He can change any boy and make him into a world champion of any sport he wishes. He could change a boy into an Olympian or into the star Quarterback for an NFL football team. He can also change a boy into the center for an NBA basketball team.<br>\r\n<br>\r\nFurthermore, Kevin can make any boy float, fly, grow bigger, or shrink into a tiny being. He can teleport any boy to any place on earth and he can make any other boy say or do whatever he pleases, as long as it is for the boy's benefit. He can make any boy grow older, or regress younger until he becomes a baby again. He can also turn a boy into a giant. Lastly, he can make a boy smarter or dumber, and he can also change any boy's sexual appeal.<br>\r\n<br>\r\nPlease, NO sex, extreme violence, gore, or vore. No animal or inanimate object transformations. Please allow the boys to remain human. Only Kevin has the ability to change boys, and nobody else. Kevin's power have no effect on girls, and he can't do anything to young men who are 18 or older.<br>\r\n<br>\r\nEmail me if you have questions.<br>\r\n<br>\r\nHave fun!<br>\r\n</td>",
        "id":1191039,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1561575958/item_id/1191039.jpeg",
        "last_full_update":1561579500,
        "modified":1561579500,
        "pretty_title":"Lord of the Boys"
    }
}