{
    "chapters":{
        "1":{
            "author_id":"jquandt39409",
            "author_name":"Johnney",
            "choices":[
                "Do gooder",
                "Evildoer",
                "Random Citizen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a dogooder, an evildoer, or just a random citizen</span></div></span></div>",
            "created":1362546000,
            "id":1545067,
            "title":"Who the hell are you!?"
        },
        "11":{
            "author_id":"jquandt39409",
            "author_name":"Johnney",
            "choices":[
                "Agent Puppy",
                "Agent Katswell",
                "Keswick",
                "The Chief",
                "Someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah a goody two shoes, wonderful. So who are you?</span></div></span></div>",
            "created":1362546000,
            "id":1545069,
            "title":"Do gooder"
        },
        "111":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Gain weight and become a world reknowned sumo wrestler",
                "Exercise and become a famous bodybuilder",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you are Dudley puppy one of tuff's agents. What would you like to do exactly?</span></div></span></div>",
            "created":1362546000,
            "id":1545077,
            "title":"Agent Puppy"
        },
        "1112":{
            "author_id":"thunderraja",
            "author_name":"Spikemaster836",
            "choices":[
                "Kitty invites you to have some coffee with her",
                "You're called in for a mission by the chief",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>So you choose to be a bodybuilder. Let's see how that works. You find a training regiment online and began to work out while changing your diet to fit it. It takes a while, but you manage to gain enough muscle that's not too much, but enough to be shown even with your black shirt on.<br>\r\n<br>\r\nYou walk into the TUFF building and notice a few of the female agents watching you walk. Looks like they like what they see. But something happens that you focus on. But whta is it?<br>\r\n<br>\r\n</span></div></div>",
            "created":1401798060,
            "id":1806555,
            "title":"Exercise and become a famous bodybuilder"
        },
        "1113":{
            "author_id":"jquandt39409",
            "author_name":"Johnney",
            "choices":[
                "Get hit by a ray that turns him into a sexual fiend?",
                "One of the female agents goes into heat and your the only one who can help them.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these</span></div></span></div>",
            "created":1362546000,
            "id":1545090,
            "title":"Other"
        },
        "11132":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Kitty his love",
                "Other povers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is kitty katswell or other girls?</span></div></span></div>",
            "created":1556976960,
            "id":2654827,
            "title":"One of the female agents goes into heat and you..."
        },
        "11133":{
            "author_id":"jlharris99",
            "author_name":"jlharris",
            "choices":[
                "yeah",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kitty Katswell? Can you imagine her in naughty situation?</span></div></span></div>",
            "created":1363410000,
            "id":1551096,
            "title":"Other"
        },
        "112":{
            "author_id":"sonicfreak04",
            "author_name":"jack",
            "choices":[
                "she asks if you'd like to go over her house from some fun",
                "play around with Keswicks inventions",
                "other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Agent katswell huh? pretty good decision, now what would u like to so with her?</span></div></span></div>",
            "created":1374987600,
            "id":1635681,
            "title":"Agent Katswell"
        },
        "1121":{
            "choices":[
                "Transform into The Chief to give them embarrassing orders",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You, the agent Honeytree, are finishing some paperwork in your cubicle, when the agent Kitty Katswell approach. <br>\r\n<br>\r\n- \"Hey, nice work today, you really defeated the Chameleon\" she says<br>\r\n<br>\r\n- \"Thanks, you and Dudley make a good team\" you say<br>\r\n<br>\r\n- \"Yeah. If you want, we can go to dinner or to my house to relax a bit from work.\" she says<br>\r\n<br>\r\n- \"Sure, let me finish this paperwork...\" you say.<br>\r\n<br>\r\nAfter a few minutes, you end your work and you and Kitty go to her house. Finally, you two arrive at her house. You go to the bathroom, while Kitty prepares something to drink. When you came from the bathroom, you find Kitty, naked, waiting or you. <br>\r\n<br>\r\n\"Do you like the view\" she asks<br>\r\n<br>\r\nBut she doesn't await for your answer: Seeing Kitty naked gives you a full erection, quickly noticed for Kitty. She goes where you're, gets on her knees, unzip your pants, and pulls down your underwear, revealing your huge erection. She give you a blowjob, and soon, you're having sex with her. After an hour, you both reach the orgasm. Kitty and you rest in the bed. Meanwhile, the Chameleon escapes from prison.<br>\r\n<br>\r\n\"I will have my vengeance on agents Honeytree and Katswell for stealing my suit, leaving me naked on TV.\" he say<br>\r\n<br>\r\nThe Chameleon goes to Kitty Katswell's house and see you and Kitty resting on the bed. <br>\r\n<br>\r\n\"Since they embarrass me, I will embarrass them. But what can I do?\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1395693300,
            "id":1766915,
            "title":"she asks if you'd like to go over her house..."
        },
        "1122":{
            "choices":[
                "Cover first",
                "Stop the ray as naked as you're"
            ],
            "content":"<div class=\"\"><div> <span>You, the Agent Kurt Honeycatcher, and Agent Kitty Katswell play around with Keswick inventions. You two discover a hidden ray, and Kitty accidentally triggered ray, that hits on you. Suddenly, Kitty blushed, and you ask her why she blushed, but before she answers, you look down to realize that you're naked!! And in front of Kitty!!! You quickly cover your nakedness. But you two had other problems to resolve: the nakedness ray goes out of control. One of the rays hits on Kitty, and now you had Kitty naked in front of you. This produce a turn on you. She covers herself as she tries to deactivate it, but the ray enters in its mode \"4x4\" and goes out off the warehouse, running free through T.U.F.F., undressing agents. You two had to stop it, but you two had cover your nakedness first? Or since everyone is naked you can go to stop it in your birthday suits?  </span></div></div>",
            "created":1394686800,
            "id":1759936,
            "title":"play around with Keswicks inventions"
        },
        "11221":{
            "choices":[
                "Take the machine to TUFF",
                "Destroy it"
            ],
            "content":"<div class=\"\"><div> <span>Kitty grabs some toilet paper, and you a bonsai pot.<br>\r\n<br>\r\n\"A bonsai, huh, a little tree to cover a little thing?\" Kitty said, smirking<br>\r\n<br>\r\nThat made you blush, but both of you go out and try to find the machine, that causes mayhem and nudity all over TUFF. Both of you can't reach the machine, who directs to Petropolis, right onto the streets. Kitty and you chase it, seeing how the machine undress everyone in the city. Finally, you and Kitty can corner the machine in a place: DOOM Headquarters, but anyone seems to be there. To avoid more problems, you and Kitty can grab the machine and take it in this way to TUFF, but you aren't sure that you can deactivate the machine, and taking it turned on could cause more trouble. The other option is to destroy the machine, but the destruction could attract the attention of the villains.<br>\r\n  <br>\r\n <br>\r\n</span></div></div>",
            "created":1395637200,
            "id":1766709,
            "title":"Cover first"
        },
        "11222":{
            "choices":[
                "Run behind the machine",
                "Use the TUFF Mobile to catch the machine"
            ],
            "content":"<div class=\"\"><div> <span>\"There isn't time to cover, now we have to found the machine. And don't worry, big guy, since the machine lose control, everyone is naked now.\" - Kitty said<br>\r\n<br>\r\nThe words \"big buy\" make you blush, since you know to what part of your body Kitty is referring with the word \"big\".<br>\r\n<br>\r\nKitty and you go out naked, searching for the machine. As Kitty said, everyone is naked: Becky (to your delight), Keswick, Dudley and The Boss (to your horror). Kitty, Dudley and you chase the machine all over TUFF, but you don't succeed to stop it, and the machine leaves TUFF and goes to the Petropolis. <br>\r\n<br>\r\nKitty now is worried \"Running naked in TUFF is one thing, but to running naked in Petropolis is other thing: if we go in this way, everyone don't affected yet by the ray could see us naked, and maybe they have cameras!!!!!\"<br>\r\n<br>\r\nDudley shouts \"Cameras!!!!\" and goes crazy, until Kitty calm down. <br>\r\n<br>\r\nKitty continue speaking:<br>\r\n<br>\r\n- \"However if we chase the machine just behind it, anyone could see us naked, and besides, they will too worried hiding their nakedness to see us.\"<br>\r\n<br>\r\nBut you had a better idea<br>\r\n<br>\r\n- \"We could use the TUFF mobile to reach the machine, and nobody will see us naked.\"<br>\r\n<br>\r\nWhat do you do?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1395550800,
            "id":1766007,
            "title":"Stop the ray as naked as you're"
        },
        "112221":{
            "choices":[
                "Try to reach the Hornynator Nullifier",
                "Try to reach orgasm"
            ],
            "content":"<div class=\"\"><div> <span>Despite running behind the machine, some citizens of Petropolis could see Kitty and you naked, and make fun of your nakedness, until they're stripped by the machine. Kitty and you finally catch the machine in...Bird Brain's lair. The villain is surprised to see the TUFF agents naked, until the ray strip him, leaving him naked in front of you two, to Kitty's disgust. <br>\r\n<br>\r\nThe villain reveals his plans: Since he hadn't a date in a long time ago, fact that don't surprise Kitty, and he's getting older, he construct the Hornynator, to make women sexually aroused with him, letting him choose the women that he likes to have children, since the machine has two levers: one who choose the male type -bobo in the case of Bird Brain- and the female type -to choose the specie that Bird Brain wants to reproduce himself-. You and Kitty try to stop Bird Brain, but in the fight, the male type lever moves to bear and female type to cat. When you throw Bird Brain to the machine, it shoots to Kitty and you, making Kitty sexually aroused with you, and you and Kitty start having sex.<br>\r\n<br>\r\n\"It Works\", Bird Brain says, celebrating.<br>\r\n<br>\r\nBut the machine goes crazy and go to Petropolis, with Bird Brain chasing it. You try to chase the villain, but you can't stop having sex with Kitty. You try to think of some way to stop having sex with Kitty. In the laboratory table of Bird Brain, you see a pipe with the label \"Hornynator Nullifier\". You can use that or you end the sex with reaching the orgasm.<br>\r\n<br>\r\nWhat will you do?</span></div></div>",
            "created":1395637200,
            "id":1766733,
            "title":"Run behind the machine"
        },
        "1122212":{
            "choices":[
                "Destroy the machine with the Hornynator Nullifier ",
                "Have sex, trying to attract the female citizen attention, making her orgasm, end"
            ],
            "content":"<div class=\"\"><div> <span>You start to think things that arouse you: having sex with Kitty at the beach, in front of everyone...until you cum, making Kitty orgasm too. The orgasm and you cumming seems to broke the trance on Kitty, who's surprised that you both have sex. You grabbed the Hornynator Nullifier formula<br>\r\n<br>\r\n\"Don't tell this to anyone.\" Kitty said, with a menacing voice. <br>\r\n<br>\r\n\"Also, you end too fast...\" Kitty said, trying to pretend that she didn't enjoy the moment<br>\r\n<br>\r\nYou and Kitty chase Bird Brain to Petropolis center, where Bird Brain have sex with a female citizen. Kitty think that the scene is gross, but you have an idea.<br>\r\n<br>\r\n\"We have to broke the trance in the lady, but we have two choices: destroy the machine with the Hornynator Nullifier formula, but we didn't know if that Works, or we can have sex, trying to attract the female citizen attention, making her orgasm, ending her trance, and after that we stop Bird Brain. </span></div></div>",
            "created":1396107180,
            "id":1770165,
            "title":"Try to reach orgasm"
        },
        "1123":{
            "author_id":"jjkillerface",
            "author_name":"12Qwert",
            "choices":[
                "A good old fashioned Female Weight Gain story indeed!",
                "I do fancy a bit of Slob on the side, thank you!",
                "What if it's also an AP? Age brings weight, ya know!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a good old fashioned weight gain story? Very common in all purpose interactives!</span></div></span></div>",
            "created":1534627020,
            "id":2535319,
            "title":"Weight Gain"
        },
        "113":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "Naked",
                "Sexually Irresistible",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Keswick was worried that he can't talk to girls. So he invent \"Bravenator\" to could talk to females, and he applies the experiment on himself. Then, he tries to talk with Agent Katswell, but the agent is shock to see Keswick...</span></div></span></div>",
            "created":1408108080,
            "id":1841714,
            "title":"Keswick"
        },
        "114":{
            "author_id":"jquandt39409",
            "author_name":"Johnney",
            "choices":[
                "Use your height to your advantage and spy on your agents (voyeurism)",
                "Assign missions to your agents",
                "See what Keswick has built"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are the flea that runs T.U.F.F. what do you do?</span></div></span></div>",
            "created":1362546000,
            "id":1545070,
            "title":"The Chief"
        },
        "12":{
            "choices":[
                "Snaptrap",
                "Bird Brain",
                "The Chameleon",
                "Jack Rabbit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1395691860,
            "id":1766900,
            "title":"Evildoer"
        },
        "121":{
            "choices":[
                "Simple plan to dominate Petropolis ",
                "Make a plan to dominate Petropolis and embarrass Agent Katswell at the same time",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After the last attempt of dominate Petropolis, which ends in you embarrassed in front of everyone after Agent Katswell took off your clothes, you're in DOOM, crying and thinking about your next plan to dominate Petropolis. But you desire embarrass Agent Katswell as she embarrases you. So, in your next plan, you will try a simple plan to dominate Petropolis or you will make a plan to dominate Petropolis and embarrass Agent Katswell at the same time?</span></div></div>",
            "created":1396106400,
            "id":1770157,
            "title":"Snaptrap"
        },
        "1212":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "Masturbate",
                "Other thing"
            ],
            "content":"<div class=\"\"><div> <span>Snaptrap create the Mind-o-Controller, capable to control the mind of any subject with only processing any posession of the subject. In the last encounter with Agent Katswell, Snaptrap steal her bra. Now he use it to control her mind. The plan Works, and, suddenly, Kitty was under his mind control. <br>\r\nSnaptrap first made that Kitty take off all her clothes. Then he made her run naked in TUFF, and then he made her run naked outdoors.<br>\r\nNow, Kitty was running naked in the street, and Snaptrap finish off his mind control, only to let KItty realize of her embarrassement. Kitty comes out of trance, and sees that everyone laughing and pointing to her, she doesn't know why until she looked down, and, to her horror, she discover that she's naked. Kitty quickly grabs a newspaper page to cover up, and runs back to TUFF, but in the meantime, Snaptrap takes control of her mind again.<br>\r\n<br>\r\nWhat Snaptrap will do now with a mind controlled Kitty?  </span></div></div>",
            "created":1403987280,
            "id":1819269,
            "title":"Make a plan to dominate Petropolis and embarras..."
        },
        "122":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "Gym",
                "Street",
                "Other place"
            ],
            "content":"<div class=\"\"><div> <span>Worried about his past failed plans, Bird Brain thinks what will his next plan. Bird Brain observes that female population of Petropolis had increased in the last year. Suddenly, Bird Brain had an idea: He can control the female population with pheromones. But the problem was that all the other males emitted more pheromones tan him, an unattractive and in danger of extintion specie. But he know other thing: pheromones can be reduced if the physical attractiveness dissapears, and he also knows that physical attractiveness had a great relation with the size of genitals. So here's his plan: First, make that every men in Petropolis lost his clothes, then, shrink their genitals enough to make the unacttractive to females, and then, Bird Brain, with the bigger genitals, will be loved by all the females...<br>\r\nWhere has to attack first Bird Brain?      </span></div></div>",
            "created":1404000900,
            "id":1819382,
            "title":"Bird Brain"
        },
        "123":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "Get naked",
                "Masturbate in public",
                "Wetting herself"
            ],
            "content":"<div class=\"\"><div> <span>For embarrassing him in front of TV, The Chameleon wants to have vengeance on Agent Kitty Katswell, and embarrass her also. For that purpose, he steels from Bird Brain the \"Embarrassinator 3000\" a pistol that fires a ray that makes the victim do embarrassing things. Especially created for Agent Katswell, the pistol ray has many options. The Chameleon finds Agent Katswell in the street, and fires to her.<br>\r\n<br>\r\nWhat Chameleon makes Kitty do?  </span></div></div>",
            "created":1407957300,
            "id":1840998,
            "title":"The Chameleon"
        },
        "1233":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "The \"Naked in Public\" mode",
                "The \"Masturbation in Public\" mode",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The Chameleon decides to start to humiliate herself by incontinence. Activating the ray on that option, The Chameleon faces Agent Katswell.<br>\r\n<br>\r\nThe Chameleon: - Time to revenge, Agent Katswell!<br>\r\n<br>\r\nAgent Katswell is surprised by him, so couldn't react  in time to avoid the ray. Instantly, Kitty feels a warm feeling between her legs. To her embarrasement, she discover that she's wetting herself, also the laugh of the bystanders makes her feel more embarrassed.<br>\r\n<br>\r\nThe Chameleon: - Don't worry, Agent Katswell, I'll help you!<br>\r\n<br>\r\nChameleon shoots again, but what option?<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1408107840,
            "id":1841713,
            "title":"Wetting herself"
        },
        "12331":{
            "author_id":"artur57",
            "author_name":"Arturo",
            "choices":[
                "Mastrubation in public",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The Chameleon puts the ray on \"Naked in Public\" mode. He points at Kitty Katswell, and shoots. <br>\r\n<br>\r\nKitty, that was covering the wet spot in her suit, feels a heat in her body, and suddenly, without wanting, she starts to take off her clothes. First the suit. Now she stands in the street in her underwear. But the embarrassing moment doesn't end there. Kitty starts to take off her underwear: Now she stands naked on the street. Everybody laughs at a naked Kitty, who, embarrassed, runs to hide in the alley. The Chameleon follows her to the alley.<br>\r\n<br>\r\nWhat's the next stage on Kitty's embarrassement?   </span></div></div>",
            "created":1411448340,
            "id":1860567,
            "title":"The \"Naked in Public\" mode"
        },
        "123312":{
            "author_id":"spongequeen13",
            "author_name":"BlueMoon",
            "choices":[
                "Kitty's subjected to more humilation"
            ],
            "content":"<div class=\"\"><div> <span>          <span style=\"line-height:1.8;\"><font class=\"size3\" style=\"\">Chameleon cornered the now naked and vulnerable agent. She tried to attack but to no avail. He had her hands bound behind her back and bent over besides. Laughing, he pulled out a paddle and gave her a good smart bottom. later, Kitty had a nicely reddened bottom. She was seething which was what he'd hoped for. He led her over to the fire escape. He handcuffed her ankles together as he tied her to the fire escape. ''Let me tell you your options''. He pulled out a vibrator to Kitty's horror. She was trapped. He fondled her breasts as his tail. explored her nether regions. ''Be my slave, or I leave you wanting.'' Kitty knew she was stuck. His attentions increased and her body was craving him now. She had no choice. She hung her head. ''Okay''. ''EXCELLENT!'' He untied her and got her on all fours. He attached a gold collar to her and led her out the alley on a gold chain. ''Let's go home, my sexy kitty. I have some toys at home I've been dying to try.''</font></span></span></div></div>",
            "created":1437589380,
            "id":2011109,
            "title":"Other"
        },
        "13":{
            "choices":[
                "Peg Puppy",
                "Mrs. Katswell",
                "Dorothy Camel",
                "Wolf Spitzer",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1395691920,
            "id":1766901,
            "title":"Random Citizen"
        }
    },
    "info":{
        "author_id":"jquandt39409",
        "author_name":"Johnney",
        "brief_description":"choose a character from the show and get into naughty situations Rewards for good chapters",
        "created":1362601440,
        "description":"<td align=\"left\" class=\"norm\">Hello, and welcome to Petropolis home of the Turbo Undercover Fighting Force. <br>\r\n<br>\r\nRewards for good chapters, you get what you give <br>\r\n<br>\r\nPretty much anything goes except for vore, bathroom play, and gore.<br>\r\n<br>\r\nGeneral Rule for adding chapters:<br>\r\n- Try to keep chapter length to at least a paragraph, unless a one liner absolutely unavoidable such as when a previous option directly leads to a new question.<br>\r\n- When adding a new chapter make sure you add an additional \"others\" option at the bottom so that someone else can put their ideas into the story. <br>\r\n- No ending paths because you do not like where the story is heading. As stated above there should be an \"other\" option for you to change the path of the story if you so desire.<br>\r\n- If you do change the path of the story do so in a way that builds off the previous chapter, i.e. no starting a whole new story in the middle of a path.<br>\r\n- Try to keep the story going and try to add onto any unopened paths before going to other.<br>\r\n-No troll posts. =_= You know what I mean.</td>",
        "id":1922724,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556976960,
        "modified":1556976960,
        "pretty_title":"T.U.F.F. Puppy Interactive"
    }
}