{
    "chapters":{
        "1":{
            "author_id":"ellsworth123",
            "author_name":"LittleLexy",
            "choices":[
                "Calls Alex and Ryan over ",
                "Calls her best friend Alex over ",
                "Calls her boyfriend Ryan over ",
                "Calls her gal pal Kelly over",
                "Tests the remote on herself"
            ],
            "content":"<div class=\"\"><div> <span>\"UGH! Good bye, Alex!\"<br>\r\n<br>\r\nLauren slammed her house phone back onto the receiver. Yet another pleasant conversation with her best friend had ended on a note of how he still loved her and wished to be with her. Alex had confessed his feelings for her quite some time ago. Before they even finished middle school, actually. But she was just never interested in him like that. Time and time again she had found other guys that she had relationships with, but none of them ever worked out. Until now, that is. She had recently met a guy named Ryan. He was sweet as could to her and even Alex. Now Alex was really nice to Ryan too, but his consistent badgering about being in love with her was really putting a strain on her and Ryan's relationship. Ryan wouldn't come out and say it, afraid to upset her, but she knew.<br>\r\n<br>\r\n\"Bah. There must be someway I can make him stop bring this up...\" She had often considered bringing Alex into her and Ryan's relationship, as the two had been looking for a three-way. But she and Ryan both were looking for a female for that spot, not another guy. Lauren let out a sigh in frustration. What could she do?! Suddenly, she heard a knock on the door of her dorm room. She jumped up and walked to door, opened it, but was surprised to see that there was no one there. \"That's weird...\" Then looking down, she saw a small package sitting on the ground. She kneeled down and lifted it up. There was a note attatched that read, \"Hopefully this will resolve your problem.\" There was no signature or anything. Nothing indicating who left it.<br>\r\n<br>\r\nLauren stepped back into her room and closed the door. Opening up the package revealed what looked like a television remote. \"Haha! I get it. Watching some tv will take my mind of the problem. Very funny. Might as well use it after someone went through the trouble of wrapping and leaving it.\" Walking back to her bed room, Lauren pointed the remote at her 12'' tv and pressed the green button in the right corner of the remote. To her surprise, a green beam shot out of the remote and engulfed the tv! Then right before her eyes, the television shrunk in size! From a 12'' to a 6''!<br>\r\n<br>\r\n\"Oh my God! This remote... shrinks things?!\" Lauren almost couldn't believe her eyes. But reaching out, she felt the tv and knew it wasn't just some illusion. But then she saw a red button in the left corner of the remote. \"What does this red button do?\" To her surprise it actually returned the tv to its originial size! \"So each time I use the green button, things shrink in half, while the red doubles their size. Interesting...\" Then she remembered Alex. Did the note mean for her to use it on him? It would be perfect! Alex could get in her pants like he always wanted and she and Ryan could finally get that three-way. Albeit a bit different than she expected...<br>\r\n<br>\r\nSo Lauren...</span></div></div>",
            "created":1295674320,
            "id":1039857,
            "title":"How it all began..."
        },
        "11":{
            "author_id":"hithereguys",
            "author_name":"Hi there",
            "choices":[
                "You shrunk to 1 foot",
                "You shrunk to 1/2 inch",
                "You had actually grown Alex",
                "You had actually grown Ryan",
                "You had actually grown them both "
            ],
            "content":"<div class=\"\"><div> <span>You had actually changed your mind. You were obsessed with Ryan since he was your boyfriend. He was over average for a 17 year old standing at 6’11 with size 20 feet! You were already tiny to him at 5’1 but you wanted to feel even smaller than that! You wanted to worship him. Alex could even get his fair share of fun as well. He was not as tall but still quite at 6’6 and size 15 feet. You didn’t feel that much for Alex but you did like his body and feet but not as much as Ryan. You had called them both over. Ryan was the first to answer and he walked in shirtless and wearing shorts and slippers since it was hot outside. But he was also hot himself, you chuckled to yourself. You already began to feel sexually aroused as you were longing for him. He came to gave you a quick hug, more like bear hug to you since he dwarfed you, as you accepted it and wondered why you called him over. You told him to wait for Alex just as he arrived. He was wearing a shirt and tracksuit as he walked in. You told them both to sit down as the muscular guys did. The couch groaned as they did as their weights and heights were a bit much to handle. Ryan already knew about your foot fetish and giant boy/tiny girl fetish. You had even worshiped his feet before. But Alex didn’t know of it so you explained your desires to him. You explained to them that you could shrink with the remote you could sharing and grow yourself but to explore your fantasy you will shrink. They laughed at you but you had to prove them wrong. You pointed it at yourself and...</span></div></div>",
            "created":1589353020,
            "id":2834745,
            "title":"Calls Alex and Ryan over "
        },
        "112":{
            "author_id":"hithereguys",
            "author_name":"Hi there",
            "choices":[
                "You were attempting to have sex",
                "He wanted to ask if you could grow him"
            ],
            "content":"<div class=\"\"><div> <span>Both their jaws dropped as they saw that you disappeared, you had actually shrunk and were surrounded by 4 giant feet. Ryan’s, even though both his and Alex’s were still gigantic, was clearly the superior one. His feet were outstretched and were on both sides as Alex had moved to the other couch before you had shrunk and had outstretched his legs surrounding you too. Ryan had pushed his toe into you to see if this was real. Sure enough, it was. You were so vulnerable to them, and in their mercy, that you were actually loving this. You walked up to Ryan’s foot and placed his palm on it. His foot twitched as you began to rub it. He moaned at this and asked you to continue. And you did, you pushed your face into it, inhaling it’s manly scent. It was heavenly! You tried to climb it but it simply towered over you so you went over to his hairy legs and pulled on his strands of hair but you weren’t strong enough. Ryan lifted your up and gave you a boost, curious of what you were up to. You ran up his leg through to under his briefs and quickly ran up to his room. (You had set up the guest room to be his room as he oftener stayed over, even though there were two beds in there AND he stayed in your bed with you most of the time). As soon as he got to the room, he sat down..</span></div></div>",
            "created":1589353680,
            "id":2834749,
            "title":"You shrunk to 1/2 inch"
        },
        "13":{
            "author_id":"metaru",
            "author_name":"Metarusonicu",
            "choices":[
                "Lauren smiles, and licks her lips playfully, \"Let's call Alex\"",
                "Lauren giggles and pats the crotch of her pants, \"I know you want to call Kelly\""
            ],
            "content":"<div class=\"\"><div> <span>Ring.. Ring.....<br>\r\n<br>\r\n\"Hello?\" Ryan answered the phone. Caller ID told him who it was, but he never liked just calling the other person by name off the bat.<br>\r\n<br>\r\n\"Heya sweetie.\" Lauren said in a sweet voice, \"Are you busy?\" and Ryan answered, \"For you sweetie, never. What's up?\"<br>\r\n<br>\r\n\"Think you can get over to my place? Sooner the better, babe.\" Lauren said, with a hint of playfulness. After Ryan let Lauren know he'd be right over, she hung up, then started to fiddle with the remote some more. <br>\r\n<br>\r\nIt was hardly fifteen minutes later when there was a knock at the door. \"Come in!\" she called out, and Ryan made his way in. He found Lauren sitting on the sofa, and she beckoned him over. When they met, she stood and gave him a soft kiss, \"Hey sweetie, thanks for coming so quick.\" which made Ryan blush, \"Bet you never said that to a guy before.\" and they both shared a laugh. <br>\r\n<br>\r\n\"So what's the big hurry?\" Ryan asked, since Lauren rarely ever asked him to head over so quickly. \"Is everything alright? Was Alex bothering you again?\" he asked, which made her giggle. \"I think I have the Alex situation solved.\" and then she held up the remote. Ryan looked it over, a little dumbfounded, \"So... is there a mute button on this universal remote?\" he joked, for her sake. She shook her head, \"No no, silly.. check *this* out!\" and she pointed the remote at a chair and hit the green button, and the chair dwindled to half its size. \"This remote can shrink things, or make them bigger.\" <br>\r\n<br>\r\nRyan blinked, \"R... Really!? Holy shit that's incredible.\" he paused, \"So, what's this gotta do with Alex?\" and Lauren smiled. \"Well, you know how Alex is always trying to get into my pants? Well... what if he was small enough to actually go inside them?\" She said, nudging Ryan with her hip. \"Like, actually inside them.\" She held her fingers about an inch apart, and then playfully lowered that hand closer and closer to her pants waist. \"Maybe I'd just sit down, legs on either side of his tiny tiny body, then I'd unzip my fly, and tell him to walk in.\" <br>\r\n<br>\r\nRyan gave a smile, \"Sounds kinda exciting. Shame it's wasted on him, though.\" and Lauren smiled wider, \"Jealous. Don't worry sweetie, I know you and I have been thinking of asking Kelly to join in on our fun. There's no reason why we couldn't ask them both.\" Lauren leaned in against Ryan, \"I'd even let you and Kelly make out in my pants... or maybe even...in me.\" She said softly, as she leaned in to kiss her boyfriend.<br>\r\n<br>\r\nRyan was slack jawed during the kiss. \"I... In you? Like..\" and Lauren just nodded. \"Yup... In. Me.\" a pause to let that set in. \"We can keep Alex at about Barbie doll height, and we can make him sleep with Barbie when he's not with us.\" She giggled, \"Or we can just make him an inch tall, keep him an inch tall, and let him sleep in my panties when we're not sleeping together.\" she smiled, \"Or let him sleep in my cleavage. Though, I think you'd like to spend some time with my giant boobs first.\" She held up her chest, for emphasis. Ryan only nodded, then spoke, \"Okay, so who's first? Do we get Alex here and let him get in your pants, or do we call up Kelly and see if she's game?\"</span></div></div>",
            "created":1296075720,
            "id":1042666,
            "title":"Calls her boyfriend Ryan over "
        },
        "132":{
            "author_id":"ellsworth123",
            "author_name":"LittleLexy",
            "choices":[
                "Lauren snatches the remote up and shrinks Kelly out of her outfit.",
                "Ryan snatches the remote and makes Kelly grow out of her outfit.",
                "Writer's choice!"
            ],
            "content":"<div class=\"\"><div> <span>Ryan wasn't sure how to respond. This was a lot to take in on such short notice. But after a moment, he nodded. \"Yes, I would love that.\" Leaning in, he kissed Lauren again. After finishing their kiss, which lasted just a hair longer than usual, Lauren pulled her phone out again and dialed in Kelly's number. After just a few rings, she picked up.<br>\r\n<br>\r\nKelly's voice crackled over the phone, \"Hey Ren, what's up?\" Ren being Lauren's nickname. \"Hey Kelly! You know how Ryan and I have been thinking about a three way?\" Lauren asked, teasingly. Trying to mask her excitement Kelly responded, \"Erm, yeah. Why do you ask?\" Lauren giggled, still able to hear her excitement. \"Well... We got a new <i>toy</i> to play with and we were wondering if you would like to join us in breaking it in?\" Lauren waited for Kelly to respond, curious to see if Kelly had picked up on the stress she had placed on the word \"toy.\" \"Y-yes! I would love to break in the new toy with you guys!\" Kelly shouted through the phone, unable to contain how she was feeling now. They had actually asked her to join their threesome! \"Glad to hear it, hun.\" Lauren giggled. \"How soon can you be over at my place?\" Kelly jumped at the bit, \"Right away!\" Kelly heard Lauren's delightful giggle again. \"Good! Ryan's already hear. So we'll be waiting for ya.\" <i><b>Click.</b></i><br>\r\n<br>\r\n\"Hook line and sinker.\" Lauren said to Ryan. He couldn't keep a grin from spreading across his face. \"This is going to amazing!\" He said and kissed Lauren again.<br>\r\n<br>\r\nIt only took Kelly ten minutes to get over to Lauren's dorm room, but to Lauren and Ryan it felt like an eternity. So many possibilities of what could they could do with, or to, Kelly ran through their minds. But a <i>rat-tap-tap</i> on the door broke them out of their fantasies for the moment. \"Come on in, sweetie!\" Lauren shouted.<br>\r\n<br>\r\nThe door swung open and Ryan's jaw almost dropped off at what he saw. Kelly was standing in the doorway wearing a very tight workout outfit, that left very little to the imagination. The outfit showed off her size C breasts very nicely and her ass looked tight. Kelly walked in and shut the door behind her and flashed a smile at Lauren and then Ryan. \"Hi Lauren... Oh! And Hello Ryan.\" Kelly giggled, her eyes fixed on Ryan's pants. Looking down, Lauren saw that her boyfriend had a raging hard-on just from the sight of her friend. A spark of jealousy washed over her, but she kept her cool. 'See if I let you shrink me now...' She thought.<br>\r\n<br>\r\n\"So guys... What is this new toy that you wanted to show me?\" The remote is sitting on a table in the middle of the room. Arm's reach from each of them.</span></div></div>",
            "created":1296102960,
            "id":1042878,
            "title":"Lauren giggles and pats the crotch of her pants..."
        },
        "1323":{
            "author_id":"metaru",
            "author_name":"Metarusonicu",
            "choices":[
                "... extremely arousing. Kelly wants it!",
                "... terrifying. Kelly wants nothing to do with it."
            ],
            "content":"<div class=\"\"><div> <span>\"The new toy...\" Lauren said as Ryan was all but mesmerized by Kelly's figure. She crossed the distance and snatched up the remote. \"... is this remote. Now, before you say 'but it's just a remote'...\" Lauren said with a smile, then pointed the device at Ryan.<br>\r\n<br>\r\n\"Huh, hon wait!\" Ryan said, and it was all he had time to say before Lauren hit the shrink button, and Ryan dwindled down and down into the cavern of his clothing. Lauren watched with a smile, and Kelly just blinked, as Ryan vanished. \"W... what did you do?!\" Kelly asked, thinking the worst, while Lauren said nothing to reassure her until a few moments later, when she stopped using the remote, and sauntered her way over to the pile of clothes.<br>\r\n<br>\r\n\"Now... where did he.....\" then she gave out a giggle, and reached inside the pile of clothes before walking back to Kelly. Kelly was really concerned, but at the same time, really curious as to what exactly she had in her hand. \"W.. what's that?\". Lauren held her hand up at about chest level to the two of them, then opened her hand. Kelly blinked, then smiled, as she saw what Lauren had. It was Ryan.<br>\r\n<br>\r\nHe was about an inch tall.<br>\r\n<br>\r\n\"LAUREN!! WHAT'S THE BIG IDEA?!\" Ryan yelled up, then took an account of his surroundings: Four of the largest breasts he had ever seen... two on either side, towering over him like mountains. He had to look over the swell of their breasts to see the lovely faces of each lady. Kelly only smiled wider, \"Holy shit... di... did you shrink him, Ren?\" and Lauren smiled, setting the remote aside for the moment. \"I sure did. So Ryan, you seem a little excited to see Kelly, why don't you two get a little more comfortable?\" Lauren asked sweetly, before bringing her hand with Ryan up a big higher, while her free hand reached for the neckline of Kelly's workout outfit. <br>\r\n<br>\r\n\"Hey, what are you.... oh I see.\" Kelly said with a smile, as Lauren opened up the top of her outfit, and then tipped over her hand to sent Ryan tumbling down into Kelly's ample cleavage. His tiny form landed against one of her soft, warm breasts, leaving a minor impact bump in the soft yielding flesh before he started to slide down between those massive globes of flesh. Kelly closed her eyes as Ryan scrambled for something to hold onto, though he soon found himself in the dark confines of Kelly's cleavage, her breasts pinning him on either side, and the sky above the odd shade of the color of her stretched workout uniform. <br>\r\n<br>\r\nKelly's eyes stayed closed as Ryan settled into place, a smile on her face and her mouth slightly parted. \"Oh ... oh god that's nice.\" Kelly whispered, and Lauren leaned in. \"If you liked that...\" and then she kissed Kelly. Soft at first, but the passion soon made it a hot and fiery kiss, their chests mashing together, tossing poor Ryan around in Kelly's top as he got to watch two of the most beautiful women he ever knew make out above him, on a scale fit for a private movie! His confines started to get warmer and warmer as Kelly got more and more aroused, the kissing and the roaming hands of Lauren getting her nice and hot. <br>\r\n<br>\r\n\"Mmm... I ... I don't know what feels better.\" Kelly started, between kisses. \"Little Ryan between my tits... or you everywhere else Ren.\" and after another kiss, Lauren smiled. \"Fish him out... I got something else for you.\" and Kelly smiled, reaching down her top to slip the tiny Ryan out from between her breasts. \"Hey little guy. Have fun in there?\" and Ryan could only nod, soaked to the bone in his sweat, and her's. Lauren returned her glance to the two of them, with a smile, \"Okay hon, set him down by your thigh?\" and Kelly did so. That's when Lauren shot her with the remote.<br>\r\n<br>\r\nKelly dwindled smaller and smaller, her workout uniform no longer as stretchy, and soon it was a pile of cloth around her shrinking form. Lauren stopped when Kelly was the same height as Ryan: One inch. Then she put the remote up on a shelf, and after Ryan helped Kelly out of the pile of clothes, Lauren held her hand palm up by the two of them, \"Ready for part two, Kel?\"<br>\r\n<br>\r\nThe two stepped up onto her hand, as she sauntered her way over her couch. Once there, she spread her thighs and set her two tiny lovers between them. Her tongue ran over her lips as she slowly unzipped her pants, giving the two of them a portal into her pants, where her pantied crotch awaited them. \"Okay you two... get in.\" She purred. Kelly looked to Ryan, still buzzed from the marvelous make out that her and Lauren shared. \"Get in? Is she serious?\" she asked Ryan. Ryan nodded, his raging hard on so intense it was almost painful. \"She.... she said we could make out in her pants... she even said we could make out ... In her.\" Ryan recounted.<br>\r\n<br>\r\n\"In her?!\" Kelly exclaimed. The thought of making out inside her friend and new lover was...</span></div></div>",
            "created":1297778580,
            "id":1054358,
            "title":"Best seat in the house..."
        },
        "13231":{
            "author_id":"ellsworth123",
            "author_name":"LittleLexy",
            "choices":[
                "Kelly and Ryan start their fun inside Lauren...",
                "Alex comes over to apologize to Lauren..."
            ],
            "content":"<div class=\"\"><div> <span>Ever since Kelly had met Lauren, she had spent every waking moment, and even many in her dreams, wanting to get into Lauren's pants. Never had she imagined that might literally become a possibility! And seeing as Ryan was certainly good looking, she was more than happy to experience it with him. \"I'm game!\" Kelly shouted and bolted over to Lauren's gigantic, pantie covered crotch. Ryan watched as Kelly climbed up and grabbed hold of the waistband of Lauren's pantie's, struggling to pull them down. Lauren giggled as the elastic snapped back into place and Kelly went tumbling down her covered pussy. \"Hehehe. Ryan, hunny? Be a dear and help Kelly, would you?\" Not wanting to upset his colossal lover, Ryan set straight to work. He helped Kelly back up and the duo climbed up to the waistband, working together to pull it down. After several seconds, the waistband finally succumbed and the front portion of Lauren's panties rolled down and folded over itself, ending with Kelly and Ryan landing on their butts before Lauren's exposed pussy. They were immediately hit with the smell of her arousal. The pheromones being given off instantly made both Kelly and Ryan eager for their mistress's next command, prepared to tackle the giant, pulsing sex.<br>\r\n<br>\r\n\"Mmmmm. My, my. You two certainly are diligent little toys aren't you? Well, where to start...\" Lauren reaches down and spreads the lips of her pussy nice and wide. \"Climb in. I know you want to.\" She purrs to them, sending shivers of excitement and fear down Kelly and Ryan's spines'. Seeing as it was his idea, Ryan takes the plunge and is the first to walk towards Lauren's pussy. He reaches forward and starts to caress the wet walls, causing Lauren to gasp. \"Oh, hunny! Your little hand feels so gentle... Stop teasing me and get in there!\" Heeding his lover's command, Ryan puts one foot inside, then the other, and begins his dive into the wet cavern. Seeing how much his actions are arousing their giant friend, Kelly rushes in behind Ryan, toppling the couple further inside. With the two tinies finally inside of her, Lauren lets go of her pussy, allowing the pink beast to wrap around them. Inside, it's dark, but with enough light for Kelly and Ryan to see what they're doing. Next...</span></div></div>",
            "created":1298413740,
            "id":1058886,
            "title":"... extremely arousing. Kelly wants it!"
        },
        "132311":{
            "choices":[
                "Makes them big again, and they go hunting for new tiny people?",
                "Keeps them tiny, and she goes hunting for new tiny people? "
            ],
            "content":"<div class=\"\"><div> <span>While Lauren lies on the floor, she licks her lips, and removes the rests of her clothes as the tiny couple make out on her huge wet pussy. The now completely nude Lauren is massaging her bare breasts as the couple begins to move deeper and deeper inside of her. At the same time, Ryan and Kelly are passionately kissing each other, and grabbing for each others bar asses, as Ryan inserts his rock hard cock, deep into Kelly’s own throbbing wet pussy. While the tiny couple fucks inside of their giant friend, they can feel the walls of Lauren’s giant pussy massaging their own tiny bodies. They can also feel Lauren's vaginal fluid being pored over them as they fuck hard and fast like rabbits deep inside of Lauren's pussy. Lauren is in ecstasy, enjoying the feel of a tiny naked couple fucking away deep inside of her. It felt so great she thought to herself. <br>\r\n<br>\r\n While the tiny couple fucked away in her, all sorts of thoughts crossed Lauren’s mind as she repeatedly had orgasms. She wondered how wet they could be. She wondered what it would be like to have a bunch of tiny pets as her slaves. Then as she felt more like a goddess, darker thoughts crossed her mind. She wondered what it would be like to humiliate tiny people, even kill them in a variety of ways. She wondered what it would be like to eat a couple alive as they made love, or feed them to something, but then she had a monster orgasm, and her two friends came pouring out of her pussy covered in slim. While Lauren is moaning, she looks down and sees that Kelly has her legs and arms wrapped around Ryan. Ryan tiny ass appears to be tightly flexed, and they both appear to be cumming together at the same time. As Ryan pumps his seamen into Kelly between Lauren’s legs, Lauren starts to recover, and rest a bit, “That was great!” she says with a smile on her face. Lauren then… </span></div></div>",
            "created":1323916980,
            "id":1239974,
            "title":"Kelly and Ryan have sex inside Lauren!"
        },
        "14":{
            "choices":[
                "The shrinking remote fired randomly, shrinking her!",
                "The shrinking remote fired randomly, shrinking something else!",
                "It wasn't Kelly at the door.",
                "Kelly just let herself in anyway.",
                "What? Nothing weird happened. What's with that cliffhanger expression?"
            ],
            "content":"<div class=\"\"><div> <span>With a swift, fluid motion, Lauren extracted her phone from her jeans pocket, and dialled a number she'd practically memorised;<br>\r\n<br>\r\n\"Kel? You there?\" <br>\r\n<br>\r\n\"Kel is not here right now, please leave a message after the beep.\" Her friend's voice droned monotonously over the phone, followed by a stifled giggle.<br>\r\n<br>\r\n\"Aww damn, answerphone.\" Lauren humoured her friend's efforts, \"Well, just thought I'd ring and let you know that I've got a new toy, Kel! Do you wanna come over and play with it? We can PLAY with it TOGETHER!\"<br>\r\n<br>\r\nA forced silence echoed through the phone, evidently of Kelly trying not to scream, and Lauren decided to put on a huskier voice, \"So I'll uhh... just be waitin' for you. Come over to mine when you get this, okay?\"<br>\r\n<br>\r\nAnd Lauren hung up. Sitting back on her bed, with the shrinking remote in her lap. Now all she had to do was-<br>\r\n<br>\r\n*knock knock knock*<br>\r\n<br>\r\n\"...holy crap that was quick.\" Lauren snickered, swinging forwards off of her bed and heading for the door. However...</span></div></div>",
            "created":1432000140,
            "id":1979990,
            "title":"Calls her gal pal Kelly over"
        },
        "144":{
            "choices":[
                "Shrunk Kel",
                "Shrunk a random thing in the room.",
                "Shrunk HER? (rebound)"
            ],
            "content":"<div class=\"\"><div> <span>Lauren had barely sat up from the bed when her friend Kelly simply burst into the house, \"BAM!\"<br>\r\n<br>\r\n\"You miss me, Lauren?\" She practically beamed at her friend, sidling up alongside the teenager and giving her an affectionate nuzzle, \"So, what's the thing you wanted to - ooooh, is that it?!\"<br>\r\n<br>\r\n\"Ayup. That it is, Kel.\" Lauren announced in a deadpan fashion, wielding her shrink ray in two hands and pointing it, \"Wanna see what it does?\"<br>\r\n<br>\r\n\"Wait, I don't even know what it is yet.\" Kel pointed out, \"Why would I wanna try something if I don't - alright, yes.\"<br>\r\n<br>\r\n\"Atta girl.\" Lauren snickered, carefully aiming the gun, \"Just watch...\"<br>\r\n<br>\r\nSlowly pulling on the trigger, Lauren was thrown back slightly by the recoil as it fired, and...</span></div></div>",
            "created":1436304060,
            "id":2004718,
            "title":"Kelly just let herself in anyway."
        },
        "1441":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Runs",
                "Too late, Lauren picks her up, and wants to help",
                "Too late, Lauren picks her up, and wants to play"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kelly reacted to seeing the ray aimed at her by yelling \"DON'T LAUREN!\" But it was too late! Kelly shrunk to 5 inches.<br>\r\n<br>\r\nLooking up at the titanic Lauren, and scared out of her mind, Kelly... </span></div></span></div>",
            "created":1526435220,
            "id":2493753,
            "title":"Shrunk Kel"
        },
        "15":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "green button",
                "red button"
            ],
            "content":"<div class=\"\"><div> <span>Lauren thinks to herself that she better try the remote on herself before risking anyone else's safety. She turns it around and taps the green button. The remote zaps her with a bright flash. She feels a little tingly, but otherwise fine as her room gets bigger and her clothes get looser. The remote feels big in her hand, but still manageable. She feels a little rush, too, not sure whether from the exhilaration or as a side effect of the remote. <br>\r\n<br>\r\nShe presses the red button and suddenly returns to her old height. \"Seems safe enough,\" she thinks to herself. \"I wonder though. . .\"<br>\r\n<br>\r\nShe bites her lip and presses the red button again. Her body expands, ripping right out of her clothes as she doubles in size to over ten feet tall. She bumps her head on the ceiling and falls forward. Her arms break her fall, but her palm lands on the</span></div></div>",
            "created":1497310620,
            "id":2334907,
            "title":"Self-Sizing"
        },
        "151":{
            "choices":[
                "Alex ",
                "Ryan ",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Lauren pressed the green button at full force and instantly regretted doing it. <br>\r\n<br>\r\nWithin an instant she felt herself getting smaller and smaller and smaller and smaller. <br>\r\n<br>\r\nLauren fell down a long hard path and landed on something soft, which she recognized as her own white thong.<br>\r\n<br>\r\n\"Oh fuck. I'm really fucking small and I sound like a mouse!\" Lauren crawled out of her giant outfit and realized that she was completely naked. <br>\r\n<br>\r\nShe admired her shapely rear and large round boobs.<br>\r\n<br>\r\n\"I may be tiny but at least my boobs are still big. What am I going to do?\" <br>\r\n<br>\r\nLauren ran over to the remote and found that it was too big for her to point at herself. <br>\r\n<br>\r\nLauren looked around and realized that she had to be around six inches tall. <br>\r\n<br>\r\nSuddenly the door to her apartment swung open and in came..........</span></div></div>",
            "created":1527995580,
            "id":2502222,
            "title":"Little Lauren "
        },
        "1513":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Henry",
                "Peter",
                "Dan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>...............</span></div></span></div>",
            "created":1528141620,
            "id":2502891,
            "title":"Someone else"
        },
        "15131":{
            "choices":[
                "\"Lauren?\"",
                "\"Sweet! A naked doll!\""
            ],
            "content":"<div class=\"\"><div> <span>Lauren started to get excited as the door opened hoping that it was Ryan but then she got scared when she realized that it was actually Ryan's 11 year old brother, Henry.<br>\r\n<br>\r\n\"Oh God, what the hell is he doing here?\" Lauren knew that she had to hide immediately so that the giant kid wouldn't see her. <br>\r\n<br>\r\nLauren found her bra and hid her exposed tiny form underneath one of the white cups.<br>\r\n<br>\r\n\"HEY LAUREN?\" Henry's voice boomed. \"MY BROTHER WANTED ME TO TELL YOU SOMETHING. LAUREN? WHERE ARE YOU?\" <br>\r\n<br>\r\nSuddenly Henry came across Lauren's clothes on the floor. <br>\r\n<br>\r\n\"THAT'S ODD. WHAT ARE THESE CLOTHES DOING HERE?\" Henry picked up the white bra, while Lauren tried not to scream as she stayed inside. \"THAT'S HOT.\" Henry then proceeded to sniff the white bra when suddenly Lauren felt out of the C Cup and into Henry's hand. Her naked body was on full display to her boyfriend's little brother. She was terrified of the giant kid holding her in his hand and also terrified to even move. <br>\r\n<br>\r\nHow does Henry react? </span></div></div>",
            "created":1528145580,
            "id":2502917,
            "title":"Ryan's brother Henry"
        }
    },
    "info":{
        "author_id":"ellsworth123",
        "author_name":"LittleLexy",
        "brief_description":"Lauren discovers a shrink ray, which she uses on her friends, (or herself?)",
        "created":1295672340,
        "description":"<td align=\"left\" class=\"norm\">I've noticed that there are not many Giant Couple stories on this site, interactive or not. The ones that are interactive are littered with too many 'choose who you want to be with' options. So I've made a general size changing story with a Giant Couple story as its primary path.<br>\r\n<br>\r\nThis is the story of woman named Lauren her discovery of a shrinking remote! She is in a happy relationship with her boyfriend Ryan, but is constantly bugged by her best friend Alex with his professions of love for her. Will she use her new toy against him?<br>\r\n<br>\r\n*Please add chapters with at least a paragraph. Please try to use good spelling and puncuation. If you want help with that, please PM me! I'd be glad to help!*<br>\r\n<br>\r\n**As for what is allowed, add whatever you want!**<br>\r\n<br>\r\n***Bad chapters, grammar/puncuation/length wise will be removed or edited.***<br>\r\n<br>\r\n100GP per chapter added! HAVE FUN! ^_^</td>",
        "id":1744118,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589353680,
        "modified":1589353680,
        "pretty_title":"Lauren's new toy (A size changing story)"
    }
}