{
    "chapters":{
        "1":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "gargoyle",
                "cyborg",
                "half-ghost",
                "mutant",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of Sam's transformations will occur</span></div></span></div>",
            "created":1247720400,
            "id":726485,
            "title":"Choices"
        },
        "13":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "muscle",
                "fat",
                "gargoyle",
                "hanyou",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>any thing else or just half-ghost</span></div></span></div>",
            "created":1247720400,
            "id":726491,
            "title":"fusion tf"
        },
        "131":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Sam wants to find Danny",
                "Sam sees a ghost attacking!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>One day at Fenton Works...<br>\r\n<br>\r\nSam was helping her boyfriend Danny's parents rebuild the ghost portal. Danny himself would have been there to help them, but he got called by the mayor (Tucker Foley) to stop a dead plitician from haunting city hall. Sam had just handed Danny's mom a soldering iron to re-attach a couple wires.<br>\r\n<br>\r\n\"Alright, I think we've done all we can for now.\" Danny's mom, Maddie said. \"We should get back to calculating the precise power requirements to get this thing up and running again.\"<br>\r\n<br>\r\n\"Aww, but that's boring!\" Danny's dad, Jack said. \"Can't we just fiddle around with the portal.\"<br>\r\n<br>\r\n\"Jack, it's still unstable. Doing anything now could cause catastrophic results.\" Maddie said.<br>\r\n<br>\r\nMaddie and Jack then walked upstairs discussing their next course of action, leaving Sam alone with the portal. Sam noticed that there was one wire Maddie forgot to re-attach, so she walked over to it. She didn't notice a cable on the floor, so she tripped over it and accidentally pressed a button on the inside, activating the portal with her inside!<br>\r\n<br>\r\nHer entire body was now in unbelievable pain. She felt like she was being torn apart and then reassembled again. After about a minute, the portal exploded, and Sam was left unconscious on the floor.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAbout an hour later, Sam woke up to Maddie wiping her brow with a dishcloth. She looked around and saw that she was in Danny's room, on his bed.<br>\r\n<br>\r\n\"What... what happened to me?\" Sam said in a daze. <br>\r\n<br>\r\n\"You tell me.\" Maddie said. \"Me and Jack heard an explosion in the lab, and we went down to find the portal blown up and with you like this!\"<br>\r\n<br>\r\n\"Oh yeah, the explosion...\" Sam said. \"Wait, what do you mean by 'like this?'\"<br>\r\n<br>\r\nMaddie grabbed a mirror. \"Sam, this may come as a shock to you...\" Maddie said right before Sam took the mirror out of her hand.<br>\r\n<br>\r\nSam noticed that the arm she grabed the mirror with looked different, more beefy. Sam looked in the mirror and saw that her hair had a white streak in it and her eyes were now glowing purple. She looked down at her body, and recieved the biggest shock of all: her body was now that of a body-builder's! Her arms and legs were now very muscly and well-toned, and her stomach now had a nice six-pack. Her breasts had also gone up a cup size, adding to her muscly image.<br>\r\n<br>\r\n\"Oh my god...\" Sam said.<br>\r\n<br>\r\n\"Now don't worry Sam, I'm sure that-\"<br>\r\n<br>\r\n\"I look awesome!\" Sam said, springing out of the bed, shaking the floor when she landed. She then flexed her arms like the confident, muscly girl she was. \"I'll bet any of Danny's enemies couldn't beat me now!\"<br>\r\n<br>\r\nSam then stretched out her arms to yawn, accidentally blasting beams of purple energy out of her hands. \"Whoah, I have ghost powers too? This just gets better and better!\"<br>\r\n<br>\r\n\"Sam, I'd like to run some tests to make sure you're alright...\" Maddie said.<br>\r\n<br>\r\n\"Yeah? Well I'm running some tests of my own!\" Sam said. She then went intangible and flew outside....</span></div></div>",
            "created":1256014800,
            "id":778449,
            "title":"Super Sam"
        },
        "1312":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Sam bumps into Danny",
                "Sam brings Ember to the Ghost Zone",
                "Sam is absorbing Ember's Power!"
            ],
            "content":"<div class=\"\"><div> <span>Sam flew around, looking for something to try her powers out on. \"Hmm, I wonder if that gun club I protested last week will let me use their target range...\" Sam said.<br>\r\n<br>\r\nSuddenly she heard people screaming. Sam looked down to see Ember terrorizing some people at a record store.<br>\r\n<br>\r\n\"This looks like a job for SUPER SAM!\" Sam shouted to the sky. \"Hee hee, I've always wanted to say that.\"<br>\r\n<br>\r\nIn the record store, Ember had scared some people away so that she could steal the store's brand new amplifier, capable of going all the way up to 12. \"I don't care if this makes me look like a Scooby-Doo villian, this was a good plan!\" Ember said to herself.<br>\r\n<br>\r\nJust then, Ember was punched in the face by a very strong arm. \"I'll have to disagree, you didn't count on me!\" a familiar sounding voice said.<br>\r\n<br>\r\nEmber looked to see that it was the ghost boy's girlfriend, with a twist. She now had huge muscles and glowing purple eyes. Ember didn't know whether to feel afraid at her new power, or aroused at her new body...<br>\r\n<br>\r\n\"Alright Ember, you're going down!\" Sam said in a powerful voice.<br>\r\n<br>\r\nEmber shook her head to get her mind out of the gutter, and then said \"Hey what's with you? Been taking steroids?\"<br>\r\n<br>\r\n\"Steroids can't do this!\" Sam said, firing a beam of purple ghost energy at Ember. Ember got back up and attempted to hit Sam with her guitar. This proved fruitless, as the guitar broke on contact with Sam's rock-hard body, who was only knocked back a few inches. Frantic and out of ideas, Ember tried launching herself at Sam, who just hit her with a good, clean punch, knocking her to the floor.<br>\r\n<br>\r\n\"Ready to give up?\" Sam said, an arrogant tone in her voice.<br>\r\n<br>\r\n\"Uhhhhhhh....\" Ember said, dazed and confused.<br>\r\n<br>\r\nSam picked up the KO'd Ember and flew off...</span></div></div>",
            "created":1256101200,
            "id":779047,
            "title":"Sam sees a ghost attacking!"
        },
        "13121":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Danny agrees",
                "Another ghost attacks!"
            ],
            "content":"<div class=\"\"><div> <span>Sam carried the knocked out Ember in her arms, flying back to drop her off into the Ghost Zone. Sam didn't mind carrying her, because it gave her a chance to lift something. She wanted to show off her new strength in any way possible.<br>\r\n<br>\r\n\"I wonder where Danny is?\" Sam said to herself. \"I bet he'll be surprised...\"<br>\r\n<br>\r\n\"SAM!?\" a voice said from behind her. She turned around to see Danny, a shocked look on his face.<br>\r\n<br>\r\n\"Yep, this is the new me!\" Sam said, holding Ember with one arm while flexing the other. \"Wanna feel my muscles?\"<br>\r\n<br>\r\nDanny shook his head to clear the cobwebs, and said \"Um, well, there's a ghost around here, so...\"<br>\r\n<br>\r\nSam then held the beaten, unconscious Ember up to Danny's face. \"Don't worry, I took care of it.\" Sam said. \"You got a thermos?\"<br>\r\n<br>\r\nDanny then grabbed the Fenton thermos and sucked Ember inside it.<br>\r\n<br>\r\n\"So, um, how did you get those muscles?\" Danny asked.<br>\r\n<br>\r\n\"Well, the ghost portal malfunctioed, I got hit, and now I have ghost powers, plus more!\" Sam said, flexing both her arms across her torso. \"So, wanna hang out, if you know what I mean?\" Sam said, getting a seductive tone in her voice.<br>\r\n<br>\r\nThis was so much for Danny to take in. Not only did his girlfriend become a muscle-bound halfa, she was fighting ghosts without his help and now she wanted to play a game of touch-football with him! Danny didn't know whether he was dreaming, or his life had just taken another weird turn...</span></div></div>",
            "created":1267938000,
            "id":847538,
            "title":"Sam bumps into Danny"
        },
        "132":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Danny doesn't buy it, so he walks in",
                "Danny buys it, and walks away",
                "Sam goes intangible and falls on Danny"
            ],
            "content":"<div class=\"\"><div> <span>It had been a very strange night for Sam. Her boyfriend was hanging out with her, but he got called by the mayor to stop some ghost, so he had to leave early. She spent the rest of her time eating a bunch of pudding pops while surfing the internet. After accidentally coming upon some website where girls (especially those from PokeMon) were often seen gaining ridiculous amounts of weight, she decided to call it a night. This caused her to have some very weird dreams, which would tonight prove to be very bad...<br>\r\n<br>\r\nDesiree the wishing ghost had just phased into Sam's room, looking as if she had just run a marathon. \"I can't believe how persistent that ghost boy is!\" Desiree said.<br>\r\n<br>\r\nDesiree then heard some mumbling in this room. She looked over and saw Sam sleeping in her bed, mumbling.<br>\r\n<br>\r\n\"Ooh, she's talking in her sleep. People usually make the best wishes this way.\" Desiree said, wanting to get some more power for herself.<br>\r\n<br>\r\n\".....fat....want fat...\" Sam mumbled in her sleep. \"I want to be a...fat ghost girl...\"<br>\r\n<br>\r\n\"What kind of weird dream is she having?\" Desiree said. \"Oh well, so you have wished it, so shall it be.\"<br>\r\n<br>\r\nDesiree then released a cloud of green smoke upon Sam, who was now beginning to fatten up. After about a minute, Sam now weighed 250 pounds, and was floating above her bed.<br>\r\n<br>\r\n\"Well, looks like my work here is done.\" Desiree said, flying out of the room...<br>\r\n<br>\r\n<br>\r\nThe next morning...<br>\r\n<br>\r\nSam woke up, and looked around. She had some very strange dreams last night, and was now glad to be back in the real world. She sat up, but noticed that it seemed harder to do. She walked over to a nearby mirror and nearly screamed. Her belly was now the size of a basketball, her face was chubbier, her thighs were now thunder-level, her breasts were now D-cups, and her ass looked like two watermelons.<br>\r\n<br>\r\n\"Oh my god! How did I get this fat!?\" Sam said, squeezing her belly, somehow expecting this to not be real. This would not be the case.<br>\r\n<br>\r\nSam held her head in her hands. \"Ugh, how am I gonna explain to my parents that I suddenly gained 135 pounds overnight?...\"<br>\r\n<br>\r\nSuddenly, she didn't feel weighted down. In fact, she felt almost weightless. Sam looked down and saw that she was floating above the ground!<br>\r\n<br>\r\n\"Great, now what?\" Sam said. She tried to will herself back down, but she was having trouble.<br>\r\n<br>\r\nJust then Sam heard a knock on her door. \"Hey Sam, sorry about last night. Can I make it up to you today?\" A voice on the other side of the door said.<br>\r\n<br>\r\n'Danny!' Sam thought 'I can't let him see me like this!'<br>\r\n<br>\r\n\"Um, actually, I'm not feeling well.\" Sam said, using the first excuse her brain could think of. She then accidentally shot a beam of energy at her desk lamp, destroying it.<br>\r\n<br>\r\n\"Is everything okay in there?\" Danny said, wondering about the noise.<br>\r\n<br>\r\n\"Um, yeah Danny.\" Sam said. \"You can just go about your business now.\"</span></div></div>",
            "created":1256101200,
            "id":779058,
            "title":"Sam the fat ghost girl"
        },
        "1323":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Danny helps Sam control her powers",
                "Sam goes intangible and flies through the roof",
                "They both hear gurgling. Sam's getting bigger!"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure you don't want me to come in there?\" Danny asked, starting to sound worried.<br>\r\n<br>\r\n\"Yeah, don't worry, I'm-WHOAH!\" Sam said, accidentally going intangible and falling through her door. Unfortunately she didn't remember to stay intangible, because she fell right on Danny! Sam immediately got up, completely red in the face.<br>\r\n<br>\r\n\"Oh my god, Danny I'm sorry, I didn't mean it!\" Sam said, freaking out.<br>\r\n<br>\r\nDanny got up, holding his head. He remembered something soft and heavy falling down on him, but he didn't know what it was. He looked forward though, and found out. It was Sam!<br>\r\n<br>\r\n\"SAM!?\" Danny said, shocked at Sam's new weight. \"What happened to you!?\"<br>\r\n<br>\r\n\"I don't know, I just woke up like this!\" Sam said, trying to keep herself on the ground by gripping the wall.<br>\r\n<br>\r\n\"Well, did you have any strange dreams?\" Danny asked.<br>\r\n<br>\r\nSam thought back to last night. She had one dream where she had gained Danny's powers and at least 800 pounds. She enjoyed flying around, feeling her gigantic body jiggle against the wind. She also enjoyed squashing anyone that got in her way...<br>\r\n<br>\r\n\"Well, I did have one dream where I was fat and had ghost powers.\" Sam said, answering Danny's question.<br>\r\n<br>\r\n\"Desiree...\" Danny said.<br>\r\n<br>\r\n\"What was that?\" Sam said.<br>\r\n<br>\r\n\"I left our date early because Tucker heard that Desiree was loose. She must have done this to you!\" Danny said.<br>\r\n<br>\r\n\"Arrgh, when I get my hands on that genie, I'm gonna-\" Sam said, in a fit of anger.<br>\r\n<br>\r\n\"Sam, calm down!\" Danny said. \"You're about to-\"<br>\r\n<br>\r\nBONK!<br>\r\n<br>\r\n\"...hit the ceiling.\" Danny said.<br>\r\n<br>\r\n\"I'm gonna need to get the hang of these powers...\" Sam said.</span></div></div>",
            "created":1256101200,
            "id":779152,
            "title":"Squash!"
        },
        "13231":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Sam goes on an ice cream binge",
                "No time! A ghost is attacking!"
            ],
            "content":"<div class=\"\"><div> <span>Earlier Danny had taken Sam outside to her backyard. He had now set up a bunch of targets for Sam to test her powers on.<br>\r\n<br>\r\n\"Alright Sam, now will a ghost ray to hit that target to the left.\" Danny said.<br>\r\n<br>\r\nSam then pointed her hand at the target, concentrated, and then a beam of purple energy flew out of her hand and hit the target.<br>\r\n<br>\r\n\"Hey, I did it!\" Sam said.<br>\r\n<br>\r\n\"Good job Sam.\" Danny said. \"Now let's practice intangibility.\"<br>\r\n<br>\r\nAfter about an hour of this, Sam finally got the hang of her powers. During this she had gotten used to being a fat girl. She even began to like it...<br>\r\n<br>\r\n\"Hey Danny, I have a question.\" Sam asked.<br>\r\n<br>\r\n\"Shoot.\" Danny said.<br>\r\n<br>\r\n\"What if I were to become really, really fat?\" Sam asked. \"Would you still love me?\"<br>\r\n<br>\r\nDanny raised his eyebrows in surprise at this question, but then answered \"Of course I would Sam.\"<br>\r\n<br>\r\n\"Well then, I've decided to become fatter! Besides...\" Sam said, grabbing Danny's hand and rubbing it against her belly. \"There'll be more of be to love.\"<br>\r\n<br>\r\n\"Okay...\" Danny said, pulling back his hand, red in the face. \"So, um, how do you plan to gain more weight?\"</span></div></div>",
            "created":1256274000,
            "id":780145,
            "title":"Ghost Power Training"
        },
        "132311":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "That night...",
                "The next day...."
            ],
            "content":"<div class=\"\"><div> <span>Some time later, at an ice cream parlor...<br>\r\n<br>\r\nSam had placed an order for two of everything on the menu. She sat down at a table next to Danny.<br>\r\n<br>\r\n\"Sam, are you sure you're gonna be able to eat all of that?\" Danny said.<br>\r\n<br>\r\n\"Oh, don't worry. I've got a good feeling about this. And if not...\" Sam said, getting closer to Danny. \"...you can always rub the rest all over my naked body.\"<br>\r\n<br>\r\nDanny's face turned bright red at Sam's come-on. He wondered breifly if Sam's new powers were somehow affecting her sexual desires...<br>\r\n<br>\r\nJust then Sam's huge order came, and she had to borrow a few empty tables to hold it all. She started on the waffle-cones, then worked her way up to sundaes, and then she just went wild over the ice cream cakes. As she ate, her belly was growing and growing, soon sinking past her knees. She had to back her chair up several times to allow room for it to grow. Eventually the chair broke, and she had to stand up to eat all of it.<br>\r\n<br>\r\nAfter a long time, Sam had finally finished her huge ice cream binge. Her belly was now the size of an over-inflated beach ball and had little specks of ice cream and chocolate sauce over it. Sam moaned in pleasure as she rubbed her gigantic gut, thinking of what the rest of her body would look like once all of the ice cream in it was converted into fat.<br>\r\n<br>\r\n\"Wow, I've never seen anyone eat that much ice cream.\" Danny said.<br>\r\n<br>\r\n\"Ooooh, I love this. I wish I could kiss my own belly...\" Sam said. Suddenly she got an idea. \"I wonder...\"<br>\r\n<br>\r\nSam then concentrated, and a perfect clone of Sam appeared next to her, gigantic belly and all.<br>\r\n<br>\r\n\"Oh, come on!\" Danny said. \"Why is it that everyone can get cloning right but me!?\"<br>\r\n<br>\r\nSam ignored Danny's comment and crawled (and I use this term loosely) over to her clone and started kissing and playing with the clone's belly. After about a miute of this, Sam crawled up and planted a big kiss on the clone's face!<br>\r\n<br>\r\nDanny eyes shot open at this, and his nose started to bleed. 'Oh man, this is hot...' Danny thought.<br>\r\n<br>\r\nAfter making out with her clone for ten minutes, it disappeared, leaving a large, ice cream covered girl sitting on the floor.<br>\r\n<br>\r\n\"I think I'm ready to go home now....\" Sam said.</span></div></div>",
            "created":1256360400,
            "id":780913,
            "title":"Sam goes on an ice cream binge"
        },
        "1323111":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Sam has a wonderful dream... (with Desiree listening)",
                "The next day..."
            ],
            "content":"<div class=\"\"><div> <span>After a few more binges at various restaurants, Sam was finally done. It was 9:30, so Danny brought her home and laid her down on her bed. Danny looked her over and was amazed at this sight. Sam now weighed somewhere around 500 pounds, and her body really showed it. She had a belly that sunk to her feet, F-cup sized breasts, huge flabby arms, tree trunk thick thighs, an ass that could probably take up more than half a sofa, and a cute fat face with three chins. Danny thought she looked amazing.<br>\r\n<br>\r\n\"Well, today was...interesting...\" Danny said, knowing no words to describe the day.<br>\r\n<br>\r\n\"Who says the day has to end so soon?\" Sam said, a lustful tone in her voice. She then sat on her side, and looked at Danny with a lustful eye.<br>\r\n<br>\r\n\"Um, Sam, I've uh....\" Danny said, getting hot and bothered at Sam's come-on. Truth be told, he thought Sam looked incredibly sexy right now, but his nervousness was overriding his sex drive. He then changed into his ghost form and said \"I'vegottagostopaghostseeyoulaterSam!\" right before flying out the open window.<br>\r\n<br>\r\n'Aw man.' Sam thought. 'Now what am I gonna do?'<br>\r\n<br>\r\nSuddenly she remembered her ghost powers. She then created two clones of herself.<br>\r\n<br>\r\n\"Alright girls, let's have some fun!\" Sam said to the clones.<br>\r\n<br>\r\nOne of the clones then began to kiss Sam on the face and play with her large breasts, while the other clone kissed and played with Sam's belly, working her way below it....<br>\r\n<br>\r\n<br>\r\nAfter a long time of having \"fun\" with her clones, they disappeared. Sam then fell fast asleep, very satisfied...</span></div></div>",
            "created":1256533200,
            "id":781840,
            "title":"That night..."
        },
        "13231112":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "On their date...",
                "No time! A ghost is attacking!"
            ],
            "content":"<div class=\"\"><div> <span>Sam woke up the next day, feeling very, very hungry. She went downstairs and made a huge breakfast, one that could feed at least twenty people. After she finished her monster of a meal, she went intangible and flew outside to meet Danny, who was standing outside her front door waiting for her.<br>\r\n<br>\r\n\"Morning, Sam.\" Danny said. He then looked at her messy face and larger belly. \"Have a good breakfast?\"<br>\r\n<br>\r\n\"Mmm-hm.\" Sam said. She then wrapped her skinny boyfriend in a BIG hug, feeling his body squish into her belly and between her breasts. She then rose him up and planted a big kiss on his face, her tongue delving deep down into his throat. Ever since Sam had acquired her fat and her ghost powers, her libido had gone through the roof. She wanted her fat body to be invaded by Danny's, nay, anybody's hands, perhaps even other appendages...<br>\r\n<br>\r\nSam then put Danny down, who was now gasping for breath. \"Alright, let's go on our date now.\" Sam said. She and Danny then flew off...</span></div></div>",
            "created":1263186000,
            "id":818818,
            "title":"A big, fat kiss"
        },
        "132311122":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Sam's still hungry!",
                "She's in the mood for something else... *wink*"
            ],
            "content":"<div class=\"\"><div> <span>Sam had it all planned out. She would have Danny take her to a restaurant or two (or ten), then she'd bring Danny home and have some fun with him in the bedroom. She wanted Danny to do her until the bed broke (which, considering her size, wouldn't be very hard.)<br>\r\n<br>\r\nUnfortunately for Sam, this was not meant to be, as her's and Danny's ghost sense went off. 'Aw man.' Sam thought.<br>\r\n<br>\r\n\"Come on Sam, duty calls.\" Danny said. \"Hehehe, I've always wanted to say that.\"<br>\r\n<br>\r\nSam and Danny looked around for the ghost, and then they saw it; a thirty-foot monster made of ground beef attacking a restaurant.<br>\r\n<br>\r\n\"How dare this restaurant have a vegitarian menu!\" the monster said, breaking a big hole in the restaurant's wall.<br>\r\n<br>\r\n\"Man, the Lunch Lady must have been bored out of her skull.\" Danny said.<br>\r\n<br>\r\nDanny and Sam then flew at the Lunch Lady and tried to punch it, but they just got their fists stuck in the ground beef. The Lunch Lady picked them up and held them up to her face. \"Well, looks like one of you has been eating well.\" The Lunch Lady said in a sweet, calm voice.<br>\r\n<br>\r\nSam smiled at this, enjoying the Lunch Lady's complement.<br>\r\n<br>\r\n\"SO EAT MEATY DEATH!\" the Lunch Lady yelled in a loud, booming voice, pinning the two teens down with her meaty hand. They went intangible to escape, leaving her momentarily confused.<br>\r\n<br>\r\nElsewhere, Danny's fist began to glow blue. \"Let's see how she likes the meat locker...\" Danny said, charging up an ice ray.<br>\r\n<br>\r\n\"Wait Danny, I've got a better idea.\" Sam said, cutting Danny off. Sam then charged purple energy into her hands and flew over to the Lunch Lady.<br>\r\n<br>\r\n\"You should eat your meat, girl!\" the Lunch Lady said. \"Then you wouldn't have slipped from my grip so easily!\"<br>\r\n<br>\r\n\"Don't worry, I will!\" Sam said. Sam then unleashed a huge blast of ecto-energy upon the Lunch Lady's meaty body. The heat of the blast was instantly cooking the meatthat made it up. For at least a mile, people could smell burger meat cooking.<br>\r\n<br>\r\nWhen Sam finished her attack, the Lunch Lady flew out of the meat body of hers. \"I can't use this! I need my meat uncooked!\" She said.<br>\r\n<br>\r\nJust then Danny came up, pointed the Fenton Thermos at the Lunch Lady, and sucked her inside.<br>\r\n<br>\r\n\"Sam, that was awesome! I never-Sam?\" Danny said, now realizing that he didn't see Sam anywhere. \"Where are you?\"<br>\r\n<br>\r\nDanny then heard loud chomping and smacking noises. He looked over to the cooked meat monster body and saw that Sam was eating it!<br>\r\n<br>\r\n\"Um, Sam, aren't you a vegitarian?\" Danny asked.<br>\r\n<br>\r\n\"Forget morals, I'm hungry!\" Sam said, breifly stopping her feast.<br>\r\n<br>\r\n\"But you just had a huge breakfast!\" Danny said. Sam paid no attention to that and just continued eating.<br>\r\n<br>\r\nAbout an hour later, Sam had finally eaten the entire meat monster body, and her body definitely showed it. Her belly was now the size of three RVs, her breasts were each as big as wrecking balls, and her ass was twice as big as her breasts. Her arms and legs looked like gigantic pillows with tiny hands and feet that looked like they would get swallowed up any minute, and she had a fat face with ten chins to top it off. From one look, one could say that she weighed at least three tons, if not more.<br>\r\n<br>\r\n\"Mmmm, that was good...\" Sam said, in a food-induced daze.<br>\r\n<br>\r\n\"Wow, I can't believe you ate all of that!\" Danny said.<br>\r\n<br>\r\n\"Yeah...\" Sam said. \"So, can we still go on our date?\"</span></div></div>",
            "created":1263704400,
            "id":821908,
            "title":"Sam vs. the Lunch Lady"
        },
        "1323111222":{
            "choices":[
                "Danny's parents come in",
                "Sam starts to grow..."
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should go to your house and have some fun Danny.\" Sam told him. Danny got a massive boner. A fat Sam Manson in his bed with him! \"S-s- sure Sam! I'd love to!\" Danny replied. ~Later~ \"Well Danny, you ready to get it on?\" Sam asked. \"Hell yeah!\" Danny replied. Sam ripped off her shirt and pants and then ripped off her bra, revealing her huge boobs to Danny. Danny then sucked her breasts having Sam giggle in delight. Danny then ripped off his shirt and pants followed by the two of them making out on Danny's bed. Danny then decided to rip off Sam's panties revealing her soft pussy to him. Right when Sam was about to take off Danny's underwear-</span></div></div>",
            "created":1314680400,
            "id":1177768,
            "title":"Time for some fun! *wink*"
        },
        "13231112222":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "She is injured (How?)",
                "She is fine, but still naked"
            ],
            "content":"<div class=\"\"><div> <span>                      Suddenly, Sam's stomach starts to gurgle...Then her whole body started to grow even more larger than before.  This put them both in a bigger shock than before.  <br>\r\n<br>\r\n                 \"Danny!\" exclaimed Sam as she continued to swell up, \"What's happening to me?!\" <br>\r\n \"I hate to say it,\" He replied, \"But I think you're going to explode!\"  <br>\r\n\"WHAT?!\"  <br>\r\n<br>\r\nNot only was she growing fatter, but the goth was growing taller as well!  She outgrew the entire house and said \"I wish I never made that stupid wish!\"<br>\r\n<br>\r\nJust then, Desire appeared out of the sky as shechanted, \"So you have wished it, so shall it be!\"<br>\r\n<br>\r\nWithin that moment, Sam was zapped back into shape, literally!  Then Danny quickly transformed into Phantom mode, grabbed his fermal, flew up to Desire, pointed it the evil spirit  and said, \"Remember me, bitch cakes?\"  <br>\r\n<br>\r\n\"NOOOOO!!!!\"  Desire shouted as she was once again sucked in it, \"NOT AGAIN!\"<br>\r\n<br>\r\nAfter that, he checked up on Sam and-<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1331010000,
            "id":1290274,
            "title":"Sam starts to grow..."
        },
        "133":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "ghost portal",
                "ghost attack",
                "injection"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how?<br>\r\n</span></div></span></div>",
            "created":1248238800,
            "id":729845,
            "title":"gargoyle"
        },
        "134":{
            "author_id":"gigajules",
            "author_name":"Gigajules",
            "choices":[
                "Sam looks for ghosts to try her new powers on",
                "Mess with Paulina",
                "Try to change back to human form"
            ],
            "content":"<div class=\"\"><div> <span>Sam was tired of being the only responsible one. As much as she cared about Danny, he had an issue of constantly misusing his powers for personal gain. Sam always thought she'd make a better half-ghost, and this was her chance to prove it.<br>\r\n<br>\r\nShe made sure everything was exactly the same as that fateful night when Danny first got his powers. She was house-sitting for the Fentons while they were on a road trip, giving her free access to the lab, and most importantly, the ghost portal. Donning the same white and black jumpsuit, she closed her eyes, walked into the portal, and pressed the \"On\" button.<br>\r\n<br>\r\nLittle did she know that a demonic prescience had been watching, and used this opportunity to take it's chance. Flying into the portal right as it activated, it became fused with Sam as her molecules were re-arranged.<br>\r\n<br>\r\nSam wailed in pain, until finally escaping the ghost-portal. It seemed to have worked! Her hair became white, her jumpsuit became black and white, her eyes were now a glowing purple. But right as she thought to test her new abilities, a new sensation came over her. A new sort of electricity surged through her body.<br>\r\n<br>\r\n\"W-whats.... happening.....???\" she gasped out as the overwhelming energy began to reshape her body.<br>\r\n<br>\r\nShe felt the jumpsuit tighten more and more around her legs as they grew longer. She felt her feet pushed up as her boots turned into ten-inch spiked heels. The spandex suit tightened around her thighs, which were thickening in tune with her rear, which was growing outward and becoming more shapely. The leggings of the suit dissolved into fishnet stockings, attached by garters under newly appearing shorts that clinged tightly to her backside.<br>\r\n<br>\r\n\"Hnng...\" Sam groaned, her face turning red at the changes taking place on her body. Almost to contrast, her skin became a pale bone-white.<br>\r\n<br>\r\nSuddenly, she felt a sharp pain from just above her rear. Looking, she realized she'd grown a pointed tail! She touched the tip of it, sending shivers down her spine. It was so sensitive!<br>\r\n<br>\r\nThe warmth and energy then began to move upward, The spandex over her stomach dissolved, revealing a midriff that she could feel slight muscle forming underneath. Her arms also became more toned,the sleeves of the suit dividing into long fingerless gloves. She saw as her nails grew out into long black claws.<br>\r\n<br>\r\nStumbling as a result of her new body, she clamored to the mirror where she could see her face beginning to change. Her purple lipstick turned black over lips that were becoming larger and softer. Her eyes became sharper, with long thick eyelashes, and she could see her ears become longer and pointed. Under her hair, small horns emerged. Her hair meanwhile turned black, even darker than it normally was, and grew longer and fuller, all the way down to her butt. She licked her teeth and could feel them becoming sharper.<br>\r\n<br>\r\nThen, all the energy centered around her chest. The last scrap of the jumpsuit became an open-backed crop top, which was pulled tighter and tighter by her growing chest. Her nipples grew hard and rubbed against the fabric, increasing Sam's arousal even more, until her once A-cup chest became big bouncy DD's, with no bra to restrain them.<br>\r\n<br>\r\nFinally, she felt pain shoot through her back as a pair of small demonic wings appeared.<br>\r\n<br>\r\nAnd with that, the changes stopped. Sam looked over her new body, her shapely legs, her killer thighs. She cupped her breasts in her hands and moaned, surprised by their sensitivity.<br>\r\n<i><br>\r\nThis... This wasn't supposed to happen..</i> Sam thought to herself, <i>This is wrong....</i><br>\r\n<br>\r\nBut then why did it feel so right?<br>\r\n<br>\r\nSam could feel the power surging within her. Whatever had happened, it had made her feel more powerful than any ghost she'd seen before.<br>\r\n<br>\r\nThat's right... She did all of this so that she could be a better ghost than even Danny. Although, since he isn't here yet, maybe it's time to have some fun....</span></div></div>",
            "created":1591582920,
            "id":2847799,
            "title":"hanyou"
        },
        "135":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "naga (human head, limbs, and body, snake legs",
                "mutant",
                "giantess"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here's another set of choices</span></div></span></div>",
            "created":1247720400,
            "id":726494,
            "title":"more choices"
        },
        "15":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "make her muscular",
                "fat",
                "giantess",
                "hanyou",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>any other choices?</span></div></span></div>",
            "created":1247720400,
            "id":726489,
            "title":"other"
        },
        "152":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic",
                "Force Feed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Weight Gain on Sam Manson?</span></div></span></div>",
            "created":1310360400,
            "id":1145355,
            "title":"fat"
        },
        "155":{
            "author_id":"warhammer10000",
            "author_name":"prego",
            "choices":[
                "Breast Expansion",
                "Pregnant Expansion",
                "Other Transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok that U think.</span></div></span></div>",
            "created":1307768400,
            "id":1123925,
            "title":"other"
        },
        "1551":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "she gains the power to magically steal other girls breast sizes",
                "a wish from desiree",
                "another reason"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how does Sam Manson's breasts expand?</span></div></span></div>",
            "created":1490209380,
            "id":2293555,
            "title":"Breast Expansion"
        },
        "15513":{
            "author_id":"sonofosiris",
            "author_name":"CommanderX",
            "choices":[
                "they're possessed by a ghost",
                "invention by Danny's parents",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how else could they expand?</span></div></span></div>",
            "created":1588522260,
            "id":2829295,
            "title":"another reason"
        },
        "1553":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Butt Expansion",
                "More Transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here a More Transformation on Sam Manson.</span></div></span></div>",
            "created":1310360400,
            "id":1145354,
            "title":"Other Transformation"
        },
        "15531":{
            "author_id":"musclesam308",
            "author_name":"Supersmart",
            "choices":[
                "A ghost attack",
                "An accident"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she become a human fruit?</span></div></span></div>",
            "created":1371272400,
            "id":1611387,
            "title":"Blueberry Expansion"
        },
        "15532":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "A New Mischievous Ghost Possesses it",
                "A rouge invention from Danny’s father"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did Sam Get A Giant Butt?</span></div></span></div>",
            "created":1588514940,
            "id":2829240,
            "title":"Butt Expansion"
        },
        "15533":{
            "author_id":"crosawood",
            "author_name":"darkpen",
            "choices":[
                "Bimboization",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>make up your mind</span></div></span></div>",
            "created":1316494800,
            "id":1191037,
            "title":"More Transformation"
        },
        "155331":{
            "author_id":"gigajules",
            "author_name":"Gigajules",
            "choices":[
                "a wish from desiree",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how will this happen?</span></div></span></div>",
            "created":1566188220,
            "id":2704556,
            "title":"Bimboization"
        },
        "155332":{
            "author_id":"stabatron",
            "author_name":"Woogie, Destroyer of Worlds",
            "choices":[
                "Catgirls FTW!!",
                "No thanks..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a nekomimi transformation?</span></div></span></div>",
            "created":1319605200,
            "id":1213488,
            "title":"other"
        },
        "1553321":{
            "choices":[
                "Regular catgirl",
                "Anthropromorphic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So does she transform into the typical catgirl, ears and tail, or does she go full anthro-kitty?</span></div></span></div>",
            "created":1422717060,
            "id":1926046,
            "title":"Catgirls FTW!!"
        },
        "1553322":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Sounds great",
                "No thanks."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suppose she just changed into a clone of somebody she already knows?</span></div></span></div>",
            "created":1363755600,
            "id":1554720,
            "title":"Transform to someone she knows"
        },
        "15533221":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "She becomes the clone of a human",
                "She becomes the clone of a ghost"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That is for you to decide</span></div></span></div>",
            "created":1366952400,
            "id":1579163,
            "title":"Does she turn into a human or a ghost?"
        },
        "155332211":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Adult",
                "Teen/child"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she become an adult or a teen/child?</span></div></span></div>",
            "created":1366952400,
            "id":1579164,
            "title":"She becomes the clone of a human"
        },
        "1553322111":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Sure thing",
                "No way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about she turns into her mother, Pamela Manson?</span></div></span></div>",
            "created":1371272400,
            "id":1611453,
            "title":"Adult"
        },
        "15533221111":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "She swaps their bodies, leaving them confused and scared.",
                "She turns Sam into Pamela's twin sister, inducing mental changes."
            ],
            "content":"<div class=\"\"><div> <span>Pamela Manson was at her breaking point with Sam.  She was tired of her daughter's gothic life style, the complete opposite of a proper lady, especially a rich one.  Pamela wished outloud that her daughter was more like her, unaware that Desiree happened to be nearby.  Desiree decided that this would be the perfect opportunity to get rid of Sam.  How does Desiree turn Sam into her own mother?</span></div></div>",
            "created":1406955600,
            "id":1836610,
            "title":"Like Mother, Like Daughter"
        },
        "155332211112":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Slow, gradual change",
                "Instant overnight change"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the Change gradual or instant?</span></div></span></div>",
            "created":1422726240,
            "id":1926105,
            "title":"She turns Sam into Pamela's twin sister, in..."
        },
        "15533221112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe another woman?</span></div></span></div>",
            "created":1390280400,
            "id":1730966,
            "title":"No way"
        },
        "155332212":{
            "author_id":"alexlewis99999",
            "author_name":"alexlewis99",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about kitty</span></div></span></div>",
            "created":1422680400,
            "id":1926017,
            "title":"She becomes the clone of a ghost"
        },
        "15533222":{
            "author_id":"maltesevolpe",
            "author_name":"fall",
            "choices":[
                "Sure thing ",
                "Still want more choices "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay how about making Her into a him?</span></div></span></div>",
            "created":1375246800,
            "id":1637791,
            "title":"Time for Gender Change"
        },
        "155332221":{
            "choices":[
                "Herself to himself?",
                "Herself to someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she transform into  what she'd be as a guy, or does she transform into someone she knows?</span></div></span></div>",
            "created":1422717240,
            "id":1926047,
            "title":"Sure thing "
        },
        "155332222":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "age regression",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about age regression?</span></div></span></div>",
            "created":1406955600,
            "id":1836371,
            "title":"Still want more choices "
        },
        "1553322222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she perhaps gain the power to influence and change others?</span></div></span></div>",
            "created":1422717300,
            "id":1926048,
            "title":"other"
        },
        "15533222221":{
            "author_id":"gigajules",
            "author_name":"Gigajules",
            "choices":[
                "a wish from desiree",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how will sam get this power?</span></div></span></div>",
            "created":1566188340,
            "id":2704557,
            "title":"Yes"
        },
        "15533222222":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "clothes transformation",
                "another transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about if Sam transformed into an article of clothing?</span></div></span></div>",
            "created":1456024500,
            "id":2107130,
            "title":"No"
        },
        "155332222222":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Yes ",
                "No go with something"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sam transformed into normal animals?</span></div></span></div>",
            "created":1463154240,
            "id":2147342,
            "title":"another transformation"
        },
        "1553322222221":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Purple-Back Gorilla like Delilah",
                "Let go with some other animals "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright now what kind of animals did Sam tranform into? </span></div></span></div>",
            "created":1464193440,
            "id":2153764,
            "title":"Yes "
        },
        "15533222222211":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Zookeepers Release Male Gorilla and they hope we breed together!",
                "Zookeepers Release small baby Gorilla and they hope I adopted it"
            ],
            "content":"<div class=\"\"><div> <span>Purple-Back Gorilla like Delilah and also find myself in city zoo! Where Zookeeper wonder where I come from? But after few min owner of city zoo thought maybe I was Delilah baby what she hide and they couldn't find it! Zookeepers were very happy that they have other Purple-Back Gorilla! I quickly realized they think I was Delilah baby and I tried escape but there no way for me to escape! The Owner told Zookeeper that my name will be \"Delia\" and I yell \"HEY MY NAME IS SAM MANSON\" but to them I sound like Gorilla! (After 2 years) I got used to be Purple-Back Gorilla but then one day?</span></div></div>",
            "created":1465414860,
            "id":2161004,
            "title":"Purple-Back Gorilla like Delilah"
        },
        "1553322222222":{
            "author_id":"patoruzu",
            "author_name":"boogie",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sam becomes plantsam again but he has no consciousness just something more aggressive and seductive</span></div></span></div>",
            "created":1576060620,
            "id":2758156,
            "title":"No go with something"
        }
    },
    "info":{
        "author_id":"musclesam308",
        "author_name":"Supersmart",
        "brief_description":"Make her a gargoyle, a hanyou, half-ghost, super saiyan, mutant, etc.",
        "created":1247801760,
        "description":"<td align=\"left\" class=\"norm\">rules:<br>\r\n<br>\r\n1. No characters doing drugs or killing off characters<br>\r\n<br>\r\n2. no inappropriate stuff like smoking, or swearing<br>\r\n<br>\r\n3. no violence (unless there is ghost fighting)<br>\r\n<br>\r\n4. There can be fusion tf's if you want<br>\r\n<br>\r\n5. Yes, it's highly appropriate to make her and Danny immortal<br>\r\n<br>\r\n6. you can make her as fat or muscular as you want, so go nuts!</td>",
        "id":1582167,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591582920,
        "modified":1591582920,
        "pretty_title":"Sam Manson's Transformation"
    }
}