{
    "chapters":{
        "1":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Lyga the Wolf",
                "Kyron the Dragon",
                "Silver the Snow Leopard",
                "Carlos the Shark",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to Anthro Story. An interactive story where you choose an anthro to date or fall in love with. <br>\r\n<br>\r\nPlease select your choices.<br>\r\n<br>\r\n<b>Shy Wolf</b>: Your old friend whom moved away years ago is finally back into town. Small for his age and species, now giant compared to his old self. Will your friendship be crush if you confess or will it bloom into a new relationship you've never had.<br>\r\n<br>\r\n<b>Intelligent Dragon</b>: A runt to his species and always getting bullied, this small dragon is one of your best friend. But what he lacks in size, made up for it with his intelligence. Always working in his underground laboratory at home, one day he discovers something that would change yours and his life forever.<br>\r\n<br>\r\n<b>Gentle Snow Leopard</b>: Your boss and your friend. Afraid it would be too awkward to work there anymore if he denied your love, or fire you, not that he would do it, he's too nice for that, you've been keeping your feeling for him since you started working at the restaurant.<br>\r\n<br>\r\n<b>Cheerful Shark</b>: Roommate this year, and your crush since you joined the college. What will happen when he invite you to join the swimming team he's in? Will you take a glimpse when he's changing or peeking when he's showering?<br>\r\n<br>\r\n<b>More</b></span></div></div>",
            "created":1389848400,
            "id":1728345,
            "title":"Life is Like a Game"
        },
        "11":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "He asks if he can come and live with you.",
                "He was just checking on you."
            ],
            "content":"<div class=\"\"><div> <span>You signed. Nothing interesting is on the TV and after browsing channel after channel, you settle on some movies that you don't even watch while browsing the internet with your phone.<br>\r\n<br>\r\nYou are a college student around the age of 21. You are just an ordinary guy. Your life is nothing interesting. You don't have many friend so here you are sitting in front of the TV doing nothing.<br>\r\n<br>\r\nIt's just the start of the first week of your college winter holiday and you are already bored out of your mind. You wish there was more to do. <br>\r\n<br>\r\nAs you continue browsing the phone, suddenly your phone ring, startle you a bit. You look at the number but it is not in your phone list.<br>\r\n<br>\r\n\"Hello?\"<br>\r\n<br>\r\n\"Is this...?\" the voice sound like a male and he asked for your name. The voice is familiar but you can't quite recognize it.<br>\r\n<br>\r\n\"Yes, and who is this?\" you asked pondering where have you heard the voice before.<br>\r\n<br>\r\n\"It's me Lyga, your friend from high school\"<br>\r\n<br>\r\nSuddenly you remember him. Lyga. He's that shy wolf who's always reading books or play video games in his free time. He doesn't talk much and you become his friend because one day the teacher punish both of you together and you have to stay after school with him. With nothing to do you started talking to him, he's reluctant to talk at first but when you bring up a topic on video game, he won't stop talking. <br>\r\n<br>\r\nThat's when you get to know him. He's a nice guy though he's quite shy. So when you heard that he had to move far away, you became very sad but you promised to him when you were saying good bye that you won't be depress because he like you more when you are happy. You also gave him your number but he hasn't called, until now...<br>\r\n<br>\r\n</span></div></div>",
            "created":1389848400,
            "id":1728365,
            "title":"Lyga the Wolf"
        },
        "111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "No problem at all.",
                "There might be a small problem..."
            ],
            "content":"<div class=\"\"><div> <span>\"Yes, its me, Lyga\" he sounded relieve that you still remember him. \"How are you doing?\"<br>\r\n<br>\r\n\"Great, what about you? Why didn't you call me at all? I missed you so much!\"<br>\r\n<br>\r\n\"Well, the day I left, I dropped my phone in a river. I did got it back though, but the data was gone. So I lost your number that's why I couldn't call you\" he sounded dissapointed.<br>\r\n<br>\r\n\"But you are calling me now, right? So how did you get my number.\" you asked, curious.<br>\r\n<br>\r\n\"When I was packing my room to come back here, I found a piece with your number on it. Must have note it down before. So here I am\" he chuckled<br>\r\n<br>\r\n\"Is that so...\" you said then realized something \"Wait, are you saying you are moving back!?\"<br>\r\n<br>\r\n\"Yes, and I was wondering-\"<br>\r\n<br>\r\n\"Dude, that awesome! Now we can hang out like we use to.\" you cut him off due to your excitement of seeing an old friend again. \"There is this place in the town that opened after you left, it's awesome. Its got this hugh game center with lots of game in it\"<br>\r\n<br>\r\n\"That sounds good to hear\" he replied happily.<br>\r\n<br>\r\n\"So what was you were going to say?\" <br>\r\n<br>\r\n\"Oh, that's right. I was wondering... umm. A-Are you living in an apartment or something?\" he staggered. Looks like his shyness is not gone yet.<br>\r\n<br>\r\n\"Yeah, why do you asked?\"<br>\r\n<br>\r\n\"I was w-wondering i-if I...\" he seemed really embarrass. <br>\r\n<br>\r\n\"Well..?\" you encouraged him.<br>\r\n<br>\r\n\"I was wondering if I could go live with you\" he finally said it. Your heart skipped a beat. Your best friend is asking to stay with you. How can you turn him down!?</span></div></div>",
            "created":1390107600,
            "id":1729753,
            "title":"Old Friend"
        },
        "1111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "It's him.",
                "It's someone else."
            ],
            "content":"<div class=\"\"><div> <span>\"Of course you can.\" you answered, imagining his eyes lightened up \"There is an extra room in my apartment after all.\"<br>\r\n<br>\r\n\"Oh, oh, thank you so much!\" he said maybe sound a little too happy.<br>\r\n<br>\r\nAfter talking with him a while you told him your address and he said he will arrive by the evening before hanging up. Your mood brightened already. Finally having someone to talk to, best friend too, really lifted your spirit. Maybe your holiday is not going to be boring after all.<br>\r\n<br>\r\nWhile waiting for him to arrive, you thought it would be nice to clean his room for him, since it wasn't used in quite a while. You can't contain yourself as you work, bouncing on your feet as you clean his room. By the time you finished it's already evening.<br>\r\n<br>\r\nSuddenly the doorbell rang \"About time\" you though, quickly getting up, you can't wait to see your friend!<br>\r\n</span></div></div>",
            "created":1390453200,
            "id":1731895,
            "title":"How can you say no?"
        },
        "11111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "He noticed and tell you.",
                "He noticed but ignore it."
            ],
            "content":"<div class=\"\"><div> <span>As soon as you open the door, you were faced with a wall of muscle. Taller than you by at least a foot, the wolf at your door simply towered above you. <br>\r\n<br>\r\n\"Er..., who are you?\" you asked meekly.<br>\r\n<br>\r\n\"It's me Lyga.\" the wolf answered happily. You can't believe it. The wolf you knew was one of the smallest in your school and was tease about it a lot. Some even called him a 'runt'. So you can't imagine your friend getting so big.<br>\r\n<br>\r\n\"Wow, I never thought you would get so big.\" you said in awe.<br>\r\n<br>\r\n\"Yeah, me neither\" he woofed.<br>\r\n<br>\r\nYou take a look at him again. His shirt is tight with all that muscle on him. He must be around 7 feet tall, towered above your 5'7. His snow-white fur does nothing to hide the definition of his muscle. His arm are so big and you think he can easily lift you off the ground. After sizing him up you look at his face, and god is he gorgeous!? His blue eyes and glasses matches well with his face, and those killer smile, you could feel your legs melt. You blush lightly when you notice his not-so-little bulge in his pants. His body is not the only thing that got bigger...<br>\r\n<br>\r\nYou shake your thought and invite him in. As he walked past, holding his big luggage like it was nothing, you look at his ass and his wagging tail, likely from meeting you. You noticed that you got a boner from sizing him up. You try to calm it down as you show him around the place, but having a hunk of a wolf walking by you is not helping. Hopefully, he won't notice.</span></div></div>",
            "created":1390798800,
            "id":1733815,
            "title":"Reunion"
        },
        "111111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Of course not!!",
                "Well, I would mind, actually. (What are you saying!!??)"
            ],
            "content":"<div class=\"\"><div> <span>You noticed him sniff the air and then he turned his head to you. He looked at you for a second, a blush on his face as he quickly turn away. You know now that he notice your arousal.<br>\r\n<br>\r\n\"A-Are you getting hard? From s-seeing me?\" he asked quietly.<br>\r\n<br>\r\n\"If you are gay too, you would get turn on too.\" you said bluntly. He had known that you are gay since high school and that doesn't bother him at all.<br>\r\n<br>\r\n\"Well, I guess so\" he chuckled \"I know that you're gay and you like what you see, well anyone would actually\" he said flexing his arms. \"Sooooo, as a friend, do you want to check out my body?\" You could probably jizz your pants right now if not for the awkwardness. <br>\r\n<br>\r\n\"C-Can I?\" <br>\r\n<br>\r\n\"Yeah, feel it\" <br>\r\n<br>\r\n\"Well, if you insist...\" you begin to touch his arm as he flex. It's as hard as steel. After a while he gently push you off, you nearly complain from disappointment but then he slowly lift off his shirt, showing his tight six-pack. When he finally got it off, you stared at his defined abs and pecs, mouth wide open and drooling openly. This is better than your best porn you've ever watched. <br>\r\n<br>\r\n\"Wow... so big\" you murmured as you feeling his abs, also hard as steel. His fur felt so soft against your touch. He growled happily as you rub him. Then you accidentally brush against something below his belt and noticed the bulge got bigger and look like it could burst his pants anytime. He moaned when your hand touch his bulge lightly.<br>\r\n<br>\r\n\"Sorry, couldn't help it\" he purred \"Having you worship my body just turn me on. You mind if I take care of this. Give you a show.\" he winked.<br>\r\n<br>\r\n</span></div></div>",
            "created":1390885200,
            "id":1734340,
            "title":"Awkward"
        },
        "1111111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "He's jerking off again!",
                "He's sleeptalking."
            ],
            "content":"<div class=\"\"><div> <span>You almost shout out \"YES PLEASE!!\" but you let yourself calm down enough to answer \"Of course not\"<br>\r\n<br>\r\n\"Thanks\" he said moving to lie down on your couch, filling in the whole space with his large body, hands move to rub his bulge \"Need to take care of this 'else it destroy my pants.\" You think it would be super hot if it actually happened...<br>\r\n<br>\r\nHe unbutton his pants and slide it down slowly as you watch. Then you see his cock. It must be the biggest dick you've ever seen. Larger than your when you are hard. It must be more than a foot long even when semi-hard and as thick as a water bottle, you couldn't imagine how hugh it can be when fully erect. You noticed that he doesn't have a sheath like most canine do and his shaft look human-like than a canine but still have a knot. You see a spot on your pants, wet with your pre from the show.<br>\r\n<br>\r\nHe moaned as he touch his cock. Pre started to drip down his cock like a leaking faucet as he rub his shaft. He grunted as his cock spurt out a jet of pre, panting in pleasure. The amount of his pre already more than you could produce in one orgasm. His cock finally reach its full size at 18 inches and as thick as a wine bottle. Now slicked with pre, his hand easily fly up and down his length, using both hands now.<br>\r\n<br>\r\n\"A-A-Almost t-there..\" he growled between his breath. Seconds later all hell broke loose as he reach his climax. His roar shake your room as he orgasm. The light went out for a second but the wolf is too lost in pleasure too notice. The first spurt shot past you and splash loudly at your wall. You're lucky that he pointed his shaft forward or else it would have shot at the ceiling for sure. The second shot followed and the third and so on. He coated your wall with his spunk, some of it splash in your face as you watch in awe and didn't move away. After about 20 seconds his load reduce in size and then stop completely. He must have shot more than a dozen shot in one orgasm and you see that his cock is still hard! The wall is wet with his virile load and the floor is covered with his spunk. The room now smelled strongly with his musk. You noticed that you must have jizzed in your pant during his climax.<br>\r\n<br>\r\nHe basked in the afterglow before he noticed the mess he has made \"Oh, shit\" his eyes went wide \"I'm sorry, Alex. I just couldn't control myself sometimes...\" he got up, some of his cum stick to his fur \"Here, let me clean it up\" he said pulling some towel from his bag and started to clean the mess.<br>\r\n<br>\r\nYou are still in shock as you say \"D-Do you always cum this much!?\" you asked, mortified.<br>\r\n<br>\r\n\"Well, yeah. Why?\" he answered, still wiping the cum off the wall. His cock bobbing up and down as he worked.<br>\r\n<br>\r\n\"N-Nothing\" you said meekly. You didn't know your friend was this potent. His load must be more than you've ever cum in your life! You never thought your friend, Lyga especially, just masturbated in front of you. He was usually quite shy but always open up when around you, but not this open! His size must have give him the confident he need.<br>\r\n<br>\r\nAfter a while he finished cleaning all the mess, which you thought was fast, seeing that was a lot of messes. The smell is still strong in the air but you could use to it, having a strong male musk... He excuses himself to unpack his stuff and take a shower. You considered showering yourself.<br>\r\n<br>\r\nThen you heard a moan from the shower in his room. He's jerking off again!? Even after a hugh load he'd made? Your friend is really, really potent. You are glad this time its in the shower.<br>\r\n<br>\r\nWhen he came out, he blushed as you teased him about being a horny wolf. Then you ordered pizza and watch TV with him. Eying his body from time to time. You yawned and look at the time, 23:40. Maybe its time to sleep, you told him good night and thanking him for 'the show'.<br>\r\n<br>\r\n-----------------------------------------------------------------<br>\r\n<br>\r\nYou woke up in the middle of the night, hearing a noise from Lyga's room... You deicided to check it out. </span></div></div>",
            "created":1390971600,
            "id":1734814,
            "title":"A Show"
        },
        "11111111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Lyga wakes you up early.",
                "You wake up late and alone."
            ],
            "content":"<div class=\"\"><div> <span>As you approach his room, you can hear a grunt followed by a snarl coming from his room. Thinking he's having a nightmare you open the door to his room. \"Lyga, are you-\"<br>\r\n<br>\r\nYou froze as you peek in only to see the wolf's masturbating furiously. You quickly back out, panting hard, thinking he'd caught you peeking. But as you look in again, he seem too preoccupied to even notice you, too lost in the pleasure. So you decided to stand there and watch.<br>\r\n<br>\r\nEven though you've seen his cock, it's still a sight to behold. Thicker than your arm and harder than steel, now that's its fully erected, its length must have reach his pecs. Your shorts starting to form a wet spot.<br>\r\n<br>\r\nHe grunted as both his hands jerk his shaft up and down. His hip bucking up and down into his hand causing his room to shake slightly. He tongue lolled out as he panted. Nearing his orgasm, he started to squeeze harder and when his hands reach his knot, the dam broke.<br>\r\n<br>\r\nHe howled as he unload his seed, his hip jerk forward. The projectiles shot at the wall behind his bed and splash onto him, some clinging to the wall. The massive amount of cum that gush out of his cock is still unbelievable, coating the wall and his body with his virile load. The volume is mostly the same as when he shot today in your living room, even after he jerked off two times!<br>\r\n<br>\r\nAfter a while his torrent come to a trickle. He slump back down onto his back and slowly drift off to sleep, still haven't notice you. His wolf spunk covered the wall and half his bed. You shrugged and close the door quietly, walking back to your room. Your mind race after a good show but after a while you calm down. You could swear the light went out for a moment again as he orgasm as you drift to sleep...</span></div></div>",
            "created":1391576400,
            "id":1739545,
            "title":"Jerk Off Session"
        },
        "111111111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "\"Sure, why not?\"",
                "\"Sorry, but I have work today\""
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up, sleepyhead!\" <br>\r\n<br>\r\n\"Five more minutes, Mom\" you groaned and partially open your eyes to see a wolf muzzle so close his nose touched your's. You jumped out of your bed, panting. \"Whoa, Lyga. Don't scare me like that!\"<br>\r\n<br>\r\n\"Well, next time get up earlier then\" he laughed \"I've made breakfast for you, to apologize for the mess I made yesterday\".<br>\r\n<br>\r\n\"You didn't have to do that but, thanks anyway\" you said.<br>\r\n<br>\r\nHe smiled clearly appreciated your word. \"Your food is on the table, okay?\" he said as he walk out so you can get ready. <br>\r\n<br>\r\nYou don't usually cook breakfast since you can't cook very well. You usually have nothing fancy, just some cereal and toasts. So as you get dressed and walk out of your room, an aroma hit your nose, making your mouth watered. You see he's sitting at the table having his breakfast. Then you look at your plate to see two fried eggs, a sausage and some pancake with maple syrup all over it.<br>\r\n<br>\r\n\"I didn't know you can cook\" you said as you sit down, in awe.<br>\r\n<br>\r\n\"Well, you do now.\" he chuckled \"I excused myself to use your stuff in the fridge, hope you don't mind\" he scratched his head, hoping you won't get mad.<br>\r\n<br>\r\n\"Of course not!\" you said cheerily \"I haven't had a proper breakfast like this ever since I live alone\" and start digging into your food.<br>\r\n<br>\r\n\"So how is it?\" he asked gleefully.<br>\r\n<br>\r\n\"This is delicious!\" you replied as you shove the pancake down. \"Oh, god it's so good\" You couldn't remember the last time you eat food this delicious.<br>\r\n<br>\r\n\"Glad you like it\" he smiled, his tail wagging, pleased.<br>\r\n<br>\r\n\"You sure, you are not a chef or something!?\" you keep complimenting him, and he just smile. After breakfast, <br>\r\n<br>\r\nyou are very satisfied. Having one of the best breakfast you've ever had.<br>\r\n<br>\r\n\"Hey, you are free today?\" he asked as he's washing the dishes \"I'm planning to go out to buy some stuff I might need, and it would be nice...\" he blushed \"...if you come with me...\"</span></div></div>",
            "created":1392094800,
            "id":1743813,
            "title":"Breakfast"
        },
        "1111111112":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "The restaurant is busy all day.",
                "Not many customer come."
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, Lyga but I have work today, maybe some other time?\" you said, regretted that you can't accompany your friend.<br>\r\n<br>\r\nHis face drop, as well as his ear, as you tell him. \"Oh, that's unfortunate...\" he seem very dissapointed, so you assured him that there will be more time to spent together after you finished your work. This seem to lift his mood a little. <br>\r\n<br>\r\nYou said goodbye as you leave for work, but not before giving him the spare key for the apartment. The cold wind hit your face as soon as you closed the door. You adjust your jacket and quickly walk to your workplace which happened to be a restaurant. Your job is a part-time waiter. It doesn't pay much but it is the only job you could do at the moment.<br>\r\n<br>\r\nAs soon as you enter the backdoor, you were hit by a large ball of fur, hugging you tightly. <br>\r\n<br>\r\n\"Hey, you are here! How is my favourite human doing?\" your coworker asked joyfully.<br>\r\n<br>\r\n\"C-Couldn't b-breathe...\"<br>\r\n<br>\r\n\"Opps, sorry.\" he apologized as he released you. The buff tiger smirked as he put you down.<br>\r\n<br>\r\n\"Seriously, Chase. You need to stop it.\" you tell him.<br>\r\n<br>\r\n\"No can do. You are just too cute.\" he joked as he hug you again but this time less forcefully.<br>\r\n<br>\r\nYou groaned as you tried to pry the tiger off but to no avail. The 6'8 burly tiger is just too much for you. <br>\r\n<br>\r\nSure, he's nice to you but sometimes it's a little overboard. It's alright for you for him to hug you in the restaurant but when he did it in the middle of the mall... You were so embarassed when it happened your face were as red as tomatoes.<br>\r\n<br>\r\n\"Alright, break it up, Chase.\" you look over the tiger to see your life-saver, or rather, your boss, a big gray snow leopard, a little bigger than the tiger.<br>\r\n<br>\r\n\"'Kay, Dad.\" Chase quickly let go of you. If there is a person whose Chase listen to, it's the boss since he's also Chase's dad, not biological though. He took Chase in when the tiger lost his parent in the accident long time ago. So Chase kinda live and work here at the restaurant.<br>\r\n<br>\r\n\"Just get to work please...\" your boss said to Chase then he look at you as you nodded to him as a thank you.<br>\r\n<br>\r\nAs Chase leave the two of you to go about his work, your boss confronted you.<br>\r\n<br>\r\n\"You alright?\" he asked knowing that the orange feline did that all the time but he still ask out of concern.<br>\r\n<br>\r\n\"Yeah, thanks boss.\"<br>\r\n<br>\r\n\"Please, stop with the boss already.\" he said, slightly annoyed.<br>\r\n<br>\r\n\"Okay, okay, Carlos.\" <br>\r\n<br>\r\n\"It's nearly opening time, get yourself ready, okay?\" the snow leopard said, you nod in acknowledgement as he went back to his office.</span></div></div>",
            "created":1392440400,
            "id":1745891,
            "title":"Work"
        },
        "11111111122":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "You freak out.",
                "That's the coolest thing I've ever seen!"
            ],
            "content":"<div class=\"\"><div> <span>Your day was uneventful, apart from getting hugged again and again by the big cat, since not many customer come. So, Carlos decided to close the restaurant early. After you say goodbye, instead of going straight home you decided to buy Lyga's his favourite dessert for him, chocolate cake. For the welcome back gift maybe.<br>\r\n<br>\r\nAs you leave the shop, cake in your hand, it is starting to get dark. You quickly walk home. As you approached your apartment, waiting for the light to turn green, you noticed Lyga across the road, just arriving as well, maybe from his shopping. You called out to him as you cross the road, he smiled and waved back as he notice you. <br>\r\n<br>\r\nThen his expression turn into terror. You are confused at first but as you heard a honking, you turned to see a car coming straight at you. Apparently slipped and can't stop due to the ice on the road. You froze in place, everything around you went in a slow motion. Is this how you are going to die? You didn't have time to think as you close your eyes and brace for impact...<br>\r\n<br>\r\nAs seconds passed, you wondered why are you not dead yet. You open your eyes to see the car skidded past and hit a nearby tree, knocking the driver out but not dead, you hope. And you are standing on the side of the road. But what surprised you the most is that Lyga is holding you in his arms. The night is quiet and the only noise is Lyga's crying.<br>\r\n<br>\r\n\"Oh god, oh god. You are alright!\" he cried, tear running down his face \"I-I thought I'd lose you.\"<br>\r\n<br>\r\n\"What- But- How?\" you are still shaken at what happened, you didn't know what to say. But it comfort you to know he really care about you.<br>\r\n<br>\r\nAfter you calm down enough you look at Lyga, who is still stiffing softly. You decided to ask \"It's alright I'm still here aren't I?\" This seem to calm the wolf down, as he nodded. <br>\r\n<br>\r\n\"So, I guess you saved me huh?\" he nodded again. \"But how can you get to the road so fast, you were so far away.\" you can't help but ask.<br>\r\n<br>\r\nHe seem troubled when you asked but it seem he decided to tell you \"C-Can we talk inside?\" as you were about to ask him why, he added \"Please.\"<br>\r\n<br>\r\nLook like you didn't have a choice, so you just head for the apartment with Lyga slowly following behind you. Carefully look left and right again for any sign of cars, but there is none. You fish your key out and unlock the door to your apartment.You sit down on your couch, clearly exhausted from the near-death experienced, you glanced at Lyga beside you and he look like a child who could get scold by his parents anytime now.<br>\r\n<br>\r\nYou finally broke the silence \"Cheer up, Lyga. You just saved my life!\" You can't imagine why is he so down. \"So, how did you do it? I mean, how did you get across the road so fast?\"<br>\r\n<br>\r\nHe seem hesitant to answer but finally said \"Would you promised me one thing? That you won't freak out?\" You nodded.<br>\r\n<br>\r\n\"It is a secret I haven't tell anyone yet, I can control lightning.\" After that sentence, you burst out laughing. And Lyga just roll his eyes \"Hey, I'm serious!\"<br>\r\n<br>\r\n\"Sure.\" You smiled, so when he see that you didn't believe him, he bring his right hand to your face and suddenly conjured up a ball of lightning.<br>\r\n<br>\r\n\"Whoa!!\" you were so surprised that you fell out of the couch but you quickly get up and take a look at it. The blue lightning ball is the size of his fist, maybe a little bigger and you can hear constant static from it. Then, as he clamp his hand shut, the ball disappear. There was a pause then...<br>\r\n<br>\r\n</span></div></div>",
            "created":1392872400,
            "id":1748873,
            "title":"Accident"
        },
        "111111111222":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Give him a blowjob.",
                "Let him fuck you."
            ],
            "content":"<div class=\"\"><div> <span>\"That's coolest thing I've ever seen!\" you squee excitedly \"Do it again!\".<br>\r\n<br>\r\nLyga's expression turned surprised \"Aren't you afraid?\" he asked bewildered.<br>\r\n<br>\r\n\"Why would I be afraid of my friend?\" you asked innocently.<br>\r\n<br>\r\n\"Well, you know...\" he mumbled and shift awkwardly \"I thought you would think I'm a freak or something but-\"<br>\r\n<br>\r\n\"Of course not! I think it's awesome.\" you interrupted him \"And I know you wouldn't hurt me.\"<br>\r\n<br>\r\nHis ears perk up at your words, glad that you are so understanding and then he slowly move in to hug you \"Thank you for trusting me.\"<br>\r\n<br>\r\n\"Hey, no problem, big guy.\" you said hugging him back, then he pulled back, still holding you. He looked into your face with conviction and slowly move in to kiss you on the lip softly.<br>\r\n<br>\r\nYour eyes went wide with surprised at first but didn't pull away. After a few seconds, he pull back and look you straight into your eyes.<br>\r\n<br>\r\n\"I love you\" there he said it, you always know he had a feeling for you \"Ever since we were in high school, but I couldn't find the courage to tell you. I was scared that you will rejected me, and it would ruin our friendship...\" he mumbled \"But I know better now. You are my life. I now know that I couldn't bear to live without you. So, will you be my boyfriend?\" he asked without any hesitation. And you know that took a lot of courage coming from him.<br>\r\n<br>\r\nYou grab his muzzle gently, pulling his face closer \"Yes, Lyga. I would be honored.\" then you move in to kiss him. At first it was just a soft kiss then it intensified as he push his tongue into your mouth, his tongue wrestled with your. You moaned as you shared the most amazing kiss of your life. After a while, he pull back and look you straight into you eyes.<br>\r\n<br>\r\n\"Wow, that was the most amazing kiss I've ever had.\" you exclaimed. Then you noticed the huge bulge in the wolf's pants, when he noticed he quickly move his hand to try to cover it up, blushing lightly. \"Look like someone is excited.\" you chuckled.<br>\r\n<br>\r\n\"U-Um, s-sorry. I-It's not like we have to do it today or-\" he stopped when you put your hand on his bulge.<br>\r\n<br>\r\n\"It's alright Lyga, I want to do it with you.\" you said calmly \"If that's okay with you.\" he nodded vigorously, clearly eager. You smile and begin to lead him to your bedroom.<br>\r\n</span></div></div>",
            "created":1393218000,
            "id":1750634,
            "title":"Confession"
        },
        "1111111112221":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "You have work again tomorrow.",
                "You and him are free tomorrow."
            ],
            "content":"<div class=\"\"><div> <span>\"You sit back and relax, let me do the work.\" you coo, and he nodded in response and lie down flat on his back.<br>\r\n<br>\r\nYou started by pushing him on to the bed, the bed creak from his weight as he landed on his back. You look at his pulsing length, fully erected and leaking with pre. Even after seeing his member the second time, you are still amazed that he is so big. You kneel down and grasps it with both hands.<br>\r\n<br>\r\nHe moan at your touch, his shaft pulse from just touching it with a splash of pre, hitting you in the face. You stare at his gigantic member and gulps. You can't imagine how you are going to take something this big into your mouth but you are going to try anyway. You barely have to bend down to give his head the first lick.<br>\r\n<br>\r\nHe gave a pleasured moan. You can tell he is enjoying this and begin to rub his shaft, already slick with his large amount of pre, there was almost no friction at all. You were rewarded another spurt of clear fluid as you rub him. You open your mouth as wide as you can and try to take his head in.<br>\r\n<br>\r\nYou manage to get most of the head into your mouth. You lick over the head and slowly make your way down even further. You gag at the huge size of the head entering his throat, but continues, not wanting to disappoint him.<br>\r\n<br>\r\n\"Oh God, Oh God, so tight!\" he groan, spurting another load into your throat. You smiled, he is clearly enjoying this. When you try to go deeper you gag, and go into a coughing fit. He lift his head in concern to look at you \"You okay?\"<br>\r\n<br>\r\n\"Yeah, *couch* I'm fine\" you wheeze \"I don't think I can fit you, it's too much\"<br>\r\n<br>\r\n\"Just do what you can, okay? I don't want you to get hurt\" he reply.<br>\r\n<br>\r\nYou make your way down again but this time not past the head. Your hand rubbing the side. As you lick his head, he begin to automatically rock his hips. Your head move up and down in rhythm. The wolf is panting hard now, closing to his orgasm. You double your effort, rubbing his cock faster.<br>\r\n<br>\r\n\"A-Ah, I-I'm cumming\" he roared, making the room shake as he let loose. You are knock back by the force of his cum. You land on your butt with an 'ohf', coughing. His semen gush out by an impossible amount, even more than the one he shot on the couch. Gallons and gallons of cum spurt out of his cock, splashing your bodies, coating the everything with his junk including the ceiling and the floor. At the sight, you blow your load too but it's insignificant compared to his. By the time he's done, his cum cover everything.<br>\r\n<br>\r\nYou sit up and wipe the cum off your face. \"So, you enjoyed it, I assume.\"<br>\r\n<br>\r\n\"Yeah, the best blowjob in my life\" he panted.<br>\r\n<br>\r\n\"Look like a lot of mess too clean\" you sign as you look around the room.<br>\r\n<br>\r\n\"Can we do that tomorrow? I'm kinda tired\" he yawn.<br>\r\n<br>\r\n\"I think we should clean up first\" you suggest.<br>\r\n<br>\r\n\"No problem\" he said as he grab you and put you down on his lap. He begin to lick at you playfully. You giggle and push at his face.<br>\r\n<br>\r\n\"Stop it. I'm ticklish\" you protest. After a few lick he stop and place you on your stomach, your face resting on his chest as he hugged you.<br>\r\n<br>\r\n\"I love you.\" he coo. <br>\r\n<br>\r\n\"I love you too, big guy.\" you reply as you feel your eye lids closing. You relax into him as you drift off into sleep.</span></div></div>",
            "created":1393218000,
            "id":1750662,
            "title":"The Night to Remember"
        },
        "11111111122212":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Go out on a date.",
                "Show me more of your power."
            ],
            "content":"<div class=\"\"><div> <span>You wake up feeling a bit groggy. There are dried cum everywhere. Yesterday night was a bit intense for you, but you could live with that if it mean you get to be with the wolf. Speaking of him, Lyga's still asleep, but that's not your concern right now. Your focus is on his morning wood resting on your ass cheek, dripping pre. You chuckled as you get an idea. You gently clench your ass cheek, lightly squeezing his erection. That got a bit of moan from him and a spurt of his clear fluid.<br>\r\n<br>\r\n\"W-What?\" Lyga said groggily as he open his eyes. He look at your grinning face and then at the position he's in and then blush deeply. \"I-I'm sorry!\"<br>\r\n<br>\r\n\"Heh, don't worry about it.\" you chuckle as you move your ass again, getting another moan from the wolf.<br>\r\n<br>\r\n\"P-Please stop.\" he beg \"I will c-cum.\"<br>\r\n<br>\r\n\"Okay, okay.\" you said as you sit up, releasing his cock \"C'mon, let's go wash up. Together\" you added as you see him still sitting on the bed.<br>\r\n<br>\r\nYou grab his hand when he doesn't move and start dragging him toward the shower \"I'm coming, I'm coming\" he protest as he get up.<br>\r\n<br>\r\nAs you two wash your body, you notice that his erection haven't die down yet. Rather it look near the point of bursting. So you gave it a experimental brush, and got a yelp from him. His cock jerking violently. <br>\r\n<br>\r\n\"Come on, Lyga. Let me help you. It's not going down anytime soon.\" he seem hesitant about it, so when you see the opening you quickly dive in on his cock. You grab it with both hands and start jerking rapidly. In mere seconds, he let out a roar as his cock explode, directly in your face, painting you from head to toe in white. You open your mouth to lap some of it in your mouth. After a while, it die down. Lyga's now panting hard.<br>\r\n<br>\r\n\"Well, you've your fun. Now let's finish washing up. Please.\" he tried to sound mad, but you know he like what you did. But you are getting hungry so you just comply. After you both dry off and get dress, Lyga go into the kitchen and start to make breakfast.<br>\r\n<br>\r\n\"So, you never did tell me how did you save me.\" you ask as he's making pancakes.<br>\r\n<br>\r\n\"Well, with the power I got, I can move at lightning speed, though it's kinda hard and tiring so I don't usually do it.\" he said as he flipped the pancakes. You nodded in understanding, you are surprised at yourself that you seem to accept it easier than usual like he's just telling me what he ate for breakfast. Maybe it's because you are his boyfriend now? You are not sure.<br>\r\n<br>\r\n\"Here you go.\" you snap out of your thought as he put your plate of food in front. You gave him a quick thanks before you dive into your food. You offer to wash the dishes as you finish.<br>\r\n<br>\r\n\"So, are you free today?\" you ask as you grab the sponge.<br>\r\n<br>\r\n\"Yeah. Why?\"<br>\r\n<br>\r\n\"I don't have work today\" his ear perk up right away \"so I was thinking we could...\"</span></div></div>",
            "created":1393390800,
            "id":1751655,
            "title":"A Fun Morning"
        },
        "111111111222121":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Lyga jerking off in one of the stall.",
                "Lyga talking to someone on the phone."
            ],
            "content":"<div class=\"\"><div> <span>\"...go out for a date or something? You know, to spend more time together.\" you trail off as you dry your hands.<br>\r\n<br>\r\n\"Yeah, anywhere is okay, if it's with you\" Lyga said as he hugged you from behind. You smile and turn to kiss him on the cheek. He blush madly as he pull back, surprised. He utter a 'sorry' saying that he wasn't used to it yet. Well, it's time to change that.<br>\r\n<br>\r\n\"How about we go to the shopping mall? I think they are having a book fair now\" knowing that Lyga is a big nerd, you suggested going to there. Though you picked up some of his habit, having hanged out with him in the high school, so you kinda read a lot of book now, but not as much as he does.<br>\r\n<br>\r\n\"Oh, I'd love to.\" he said happily, his tail wagging.<br>\r\n<br>\r\n\"So, I will just grab my-\" you open the door to your room and suddenly stop as the smell hit your nose. The musk is so strong. Then you remember that you two didn't clean it up yet. You feel a paw on your shoulder.<br>\r\n<br>\r\n\"Let's clean it up first before we go.\" you nodded as he went to grab a mob. The cleaning almost take up to an hour, even with the two of you. The smell of his cum is still strong even after cleaning up. After that you two quickly grab your jacket and leave for the mall.<br>\r\n<br>\r\nAs you two walk side by side, holding hand. You glance at Lyga every now and then, admiring how fit his cloth is. That the shirt would burst if he flexed too hard. \"So why did decide to get big?\" you ask \"I've never seen you interested in this kind of thing before\" In fact he was probably one of the weakest kids around the school.<br>\r\n<br>\r\nHis face turn red \"W-Well, I thought you might, errr, get attracted to me if I'm big. I know that you like big, strong guy, soooo, that's the reason.\"<br>\r\n<br>\r\n\"So you work out, just for me?\" he nodded. You are amazed that he'd would change his whole lifestyle around just for you. \"Thanks, Lyga. You are the best\" you coo.<br>\r\n<br>\r\n\"Hey, anything for my boyfriend.\" <br>\r\n<br>\r\nWhen you arrived at the mall, you two quickly rush to the fair. It's more crowd than you thought. As you spotted the new book of the series you particularly like, you sprinted to get it. After you walk around for a bit, it hit lunch time.<br>\r\n<br>\r\n\"Wanna go grab something to eat? I'm hungry.\" you suggested.<br>\r\n<br>\r\n\"Yeah, me too\" he rub his belly for emphasis.So you settle down in some japanese restaurant. As you wait for your food, you see the wolf look down under the table and his expression change.<br>\r\n<br>\r\nHe turn to you \"I, er, I have to go to the toilet. Be right back\" he quickly get up.<br>\r\n<br>\r\nAs time passed, and he haven't come back yet, you started to get worried. He is taking too long and his food is getting cold! You got out of your seat and follow in the direction he headed. You arrived at the furthest restroom at the cornor of the mall.<br>\r\n<br>\r\n\"Lyga, are you in here?\" you said as you enter the restroom and see...<br>\r\n<br>\r\n</span></div></div>",
            "created":1393477200,
            "id":1752218,
            "title":"Lunch and a Date"
        },
        "1111111112221211":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "You are grabbed from behind.",
                "Nothing happen,"
            ],
            "content":"<div class=\"\"><div> <span>You heard his noise coming from inside one of the stall and after hearing grunts and moans, you can guess what he's doing.<br>\r\n<br>\r\n\"Are you jerking off?!\" you blurt out in disbelief, quickly closing the door behind you.<br>\r\n<br>\r\n\"W-What are you doing here?\" he groan in between each breath.<br>\r\n<br>\r\n\"Well, you are taking so long... Wait, that's not the issue here! Why are you masturbating!?\" you demand.<br>\r\n<br>\r\n\"My libido's acting up, normally I only have to get off 3-4 times a day and-\"<br>\r\n<br>\r\n\"3-4 times a day!?\" you interject.<br>\r\n<br>\r\n\"I thought you know by now!\" he shout over his jerking session. So your boyfriend is a sex crazed muscular wolf hunk, yeah you know that already. But you didn't know he is <i>that</i> virile.<br>\r\n<br>\r\nYou can see the wall move a bit. Lyga must be leaning his huge frame along the wall. You can hear his breathing become for ragged. A deep moan then a groan \"Oh shit!\"<br>\r\n<br>\r\nWith a loud splash, you can actually see cum splatter on the wall inside the stall, he really go all out now, did he. You see some of his spunk streaming out. It's a good thing that his roar was muffled. maybe he got something in his mouth to reduce the noise down. After a while, he come out of the stall. He look like a mess. His cock still dripping.<br>\r\n<br>\r\nAs you are going to say something, you hear a noise outside \"Someone is coming!\" you turn to him \"Quick do something!\"<br>\r\n<br>\r\nStill dazed from the after glow, he's slow to act until you shake him and tell him to hurry up. His eyes suddenly glow bright blue and there are small lightning moving around his hand.<br>\r\n<br>\r\n\"Ouch!\" you heard the noise outside said.<br>\r\n<br>\r\n\"What happened?\" another gruff voice said.<br>\r\n<br>\r\n\"The door. It shocked me\" <br>\r\n<br>\r\n\"Don't be silly. Here let me- fuck!\"<br>\r\n<br>\r\n\"See? I told you\" Apparently, Lya has made the door knob static shock.<br>\r\n<br>\r\n\"Let's go use other toilet\" you breath a sign of relief as you hear them leave.<br>\r\n<br>\r\n\"No one will bother us for a while.\" Lyga said calmly but when he see your angry face \"And, er, I-I'm sorry, ruining our date and all.\" he look like he is about to cry.<br>\r\n<br>\r\n\"Oh no, please don't cry\" you always have a soft spot for him. Plus, it's hard to get mad at a crying wolf. You pull him close to pat his head \"It's alright, I'm not mad. I'm just concerned. Having high libido and all, I can deal with it. But next time, tell me about your problem. We are boyfriend now, remember?\" he nodded and whisper an okay \"Lighten up, maybe next I will give you a helping hand too\" you wink and he smile weakly.<br>\r\n<br>\r\nYou two quickly clean the toilet. Miraculously, Lyga didn't get his cum on his shirt much. Poking your head out of the restroom to see if there is anyone around, when you see none you two quickly leave the restroom.<br>\r\n<br>\r\nThe rest of the afternoon involved walking around the mall and introducing new stores that wasn't here after Lyga moved. After dinner, you two go to watch a movie, after that Lyga got another 'incident'. But this time he managed to keep it down while you are blocking the door. Then you two settle down in a park, sitting by a small lake. Even with some affair, you thought your first date was quite good. <br>\r\n<br>\r\nYou lean your head against the wolf while holding his hand. \"I love you, Lyga.\"<br>\r\n<br>\r\n\"Love you too\" he lean in to nuzzle you. You two just sit there for a while, then you notice Lyga is asleep. He must have been tired. Then...<br>\r\n</span></div></div>",
            "created":1393563600,
            "id":1752842,
            "title":"Releasing the Tension"
        },
        "11111111122212111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "He fuck you in the ass.",
                "Lyga come to the rescue."
            ],
            "content":"<div class=\"\"><div> <span>You are suddenly pulled back over the seat by a pair of strong hands. You turned back to see a built husky, bigger than Lyga. As you are going to call out for help, your mouth is cover with some cloth. The moment you inhale, you are knocked out cold.<br>\r\n<br>\r\n-------------------------<br>\r\n<br>\r\nYou wake up in some kind of warehouse. When you tried to move, you noticed that your hands are tied to a pole.<br>\r\n<br>\r\n\"Oh, you finally wake up.\" you turn to the direction of the voice. And slowly, the big husky walk into the light, shirtless, showing his muscle to the world. He is taller than Lyga and more built. He has this rugged look to him that say 'don't mess with me', unfortunately for you. And to added to his manliness, his body is covered in scars. You thought he might be a veteran.<br>\r\n<br>\r\n\"Please don't kill me.\" you beg.<br>\r\n<br>\r\n\"Oh, we are not going to do that, yet.\" he chuckle as he lean against a wall. <br>\r\n<br>\r\n\"Help!\" you yell. The husky just sit there eying you.<br>\r\n<br>\r\n\"You can yell all you want, nobody will hear you.\" he said calmly. After a minute, you soon give up. And glance at the husky. If he wasn't your captor, you would be drooling over his body by now, not that you would do it since you've got Lyga already. But he's a good eyes candy.<br>\r\n<br>\r\nThen you see a figure walk in, a grizzly bear, a little bit bigger than the husky. \"So what do we do now, Alan?\" he asked the husky.<br>\r\n<br>\r\n\"We wait for the boss to come pick up his prize.\" Alan told the bear. He nodded and walk back out. The husky started to follow but then stop in his track as he sniff the air. He turned to you as the bear left. \"Or maybe I can play with him first.\"<br>\r\n<br>\r\nHe seem to notice your arousal as he walk over to you. You are sporting an erection now just by looking at this handsome stud of a husky. He kneel down and grab your chin \"You like what you see, eh?\" he smirk as he flex his arm which swell out beyond belief. If he's wearing any shirt, you're sure he'd burst out of it.<br>\r\n<br>\r\nYou tried to look away but his grip is too strong. He roughly tear away your clothes like it was made out of paper, leaving you helplessly naked, your shaft fully erected at the display of his strength. Alan then grab a hold of your dick and start stroking. The motion was rough but doesn't hurt, in fact you are moaning in pleasure. <br>\r\n<br>\r\nHe slowly pulled back but then lean down to engulf your whole shaft into his mouth. You cry out as his tongue wrap around your whole length. He's expert in this, and soon you are shooting one of the biggest load of your life. He drink down every last drop and lick his lip. \"Delicious.\"<br>\r\n<br>\r\nYou pant, exhausted as you watch him get up and started to take off his pants. His shaft pop out, and god, he's big, very big, even while flaccid. He take hold of it \"Now, your turn.\" <br>\r\n<br>\r\nWhen you didn't obey, he forcefully push your head down to his dick, smearing your face with his pre. \"I'm losing my patience, kid. You won't like it when I'm angry.\" he seethe.<br>\r\n<br>\r\nDon't want to provoke the huge husky, you quickly lick his cock. He give out a pleasured moan and release your head. You eagerly lick his shaft until it is fully erected. His cock must be the biggest cock you have ever seen. He seem quite satisfied but it seem he's eager for more. <br>\r\n<br>\r\n\"Suck\" he command.<br>\r\n<br>\r\n\"B-But-\" you tried to argue.<br>\r\n<br>\r\n\"Suck!!\" he snarls as he grips your jaw, forcing your mouth open and ramming his stiff cock down your throat. You nearly choke on it but somehow able to take most of his member, despite the fact that you couldn't take Lyga's yesterday. Your mouth flood with his salty musk of this massive canine. He starts to thrust in and out at slow and deliberate pace. But as his climax approaches, his thrust becomes quick and relentless. He grabs the back of your head and impale more of his meat down your throat. You can only obey, sucking on it until it must be poking straight against your stomach.<br>\r\n<br>\r\nA deafening roar followed by pulse after pulse of his virile seed. The first spurt is almost painful, shot straight into your belly, filling your stomach with his spunk. Still shooting, he pulls out, the cock tip entering your mouth and letting you taste his cum. The moment you taste it, your mind went into overload and you eagerly drink down his seed. But it's just too much and it flood your mouth and you sputter some of it out. Releasing it from you maw, you see it continue to paint you with his load. After 20 seconds, the cumming subside, leaving you soaked and dripping with seed and him panting hard.<br>\r\n<br>\r\n\"Phew, that was intense.\" he exclaims happily, seeming to calm down after his climax. Seeing his cock still hard, he gives you a smirking grin \"Look like it's time for round two.\"</span></div></div>",
            "created":1393822800,
            "id":1755177,
            "title":"Captive"
        },
        "111111111222121111":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "The 'boss' block the exit.",
                "You escape successfully."
            ],
            "content":"<div class=\"\"><div> <span>Still dazed, he grab your binding and tear them apart like it was a string. Then he use his right hand alone to lift you off the ground and put you against the wall and his left hand to hold your body. Finally come to your sense, you didn't have time to react as he slowly push his cock into your ass.<br>\r\n<br>\r\n\"I-It's too big, it won't fit!\" you scream.<br>\r\n<br>\r\n\"Don't worry, I'll make it fit.\" he smile evilly.<br>\r\n<br>\r\nYou thought he might plunge straight in but he's kind enough to go slow, but it still hurt like hell. Even though his cock is well-lubed with his first orgasm, it still required a lot of work to push it in.\"So tight.\" he rumble.<br>\r\n<br>\r\nYou try to force yourself free of his hold; however, all this succeeds in doing is irritating the husky more, grabbing you more firmly. You soon give up and accept your fate. You cry out in pain as he push more and more of his shaft in. You can see your stomach pushing out, his cock too big for your hole. He groan when he finally got it all in. <br>\r\n<br>\r\nHe wait for minutes for you to accommodate to his large size then start to pull in out. As his head about to pop out of your ass, he slowly push it back in, moaning in pleasure. His thrusts are slow at first but he soon pick up his pace, and soon he's fucking you like a wild beast. You moan every time he pound your ass. In spite of your better judgment, you can't help but become increasingly aroused by his beastial prowless.<br>\r\n<br>\r\nHe howls as he reach his climax. Spurt after spurt of his spunk flood your bowels and soon make your stomach inflate even more. The sheer volume of his seed is incredible. You manage to muster your orgasm too, even though it's meager compared to his. Some of your cum fire at his face but he doesn't seem to care, too lose in his orgasm as he pump loads and loads of cum into your ass.<br>\r\n<br>\r\nAs his deluge subside, he takes a moment to catch his breath, loosely holding you. When he pull out, the flood gate opens and his seed gush out of your used hole. He released your hand , turn back and sit down on a chair. You collapsed on the cum-covered floor, too tired and sore to make a run for it, even if you are not you doubt you would get very far before the big brute catch you.<br>\r\n<br>\r\nAs you sit there, dazed, you feel a nudge and turn to see the husky offering you a towel. You  gingerly accept it, wiping yourself clean. Maybe he's nicer than he seem. You two sit there, no one said a word until he break the silence.<br>\r\n<br>\r\n\"Look, er, kid, I think I went a little rough on you, kinda got carried away when I'm horny.\" he grumble \"So I want to apologize. For raping you I mean.\"<br>\r\n<br>\r\n\"It's okay, I-I kinda enjoy it too...\" you blush at the word coming out of your mouth, it's true that you always dream of having an anthro roughly dominated you.<br>\r\n<br>\r\n\"Kinky, are we?\" he chuckle as he gets up and walk into the shadow. Few seconds later he return with a t-shirt and a pair of pants. He toss them to you \"Here wear this, can't have you showing naked to the boss.\"<br>\r\n<br>\r\nYou caught the clothes \"So, what is your 'boss' going to do with me?\" you ask nervously while getting dress.<br>\r\n<br>\r\nHe look at you with sympathy in his eyes \"You don't want to know. Let's just say there won't be 'you' left when he's done with you.\" This send a shiver up your spine but you see hesitation in his eyes. Maybe you could persuade him into letting you go, you thought.<br>\r\n<br>\r\n\"Please, let me go, I don't want to die.\" you try begging again.<br>\r\n<br>\r\n\"I can't do that, kid. Boss will kill me if he finds out.\" he bite his lips. If this big hunky husky is afraid of his boss, you don't want to imagine how big or frightening he is.<br>\r\n<br>\r\n\"You are force to do this, right? C'mon let's escape, together\" you plead.<br>\r\n<br>\r\n\"You don't know anything. It's not like I have a choice\" he yell. Look like you choose the wrong topic. Let's try again.<br>\r\n<br>\r\n\"B-But you have family, right? I must know how painful it is to find out your son is missing.\" that seem to does it as he look at you with regret.<br>\r\n<br>\r\nThere is a pause and he sign \"I don't have any family. At least not anymore.\"<br>\r\n<br>\r\n\"I-I'm sorry to hear that.\" you sputter. You are out of idea, you don't know what to say anymore.<br>\r\n<br>\r\n\"Ugggh, he's going to kill me.\" suddenly he groan to himself then walk up to you. You takes a step back as his hulking form shadowed you. He look at you like he would his son. \"Look, kid, I'm going to let you go but on one condition. Don't ever, ever, tell anyone about this. If you did, I will personally find you and rip you apart. Clear?\" you can only nod.</span></div></div>",
            "created":1393909200,
            "id":1755279,
            "title":"Persuasion"
        },
        "1111111112221211112":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Lyga's in the apartment. Worried sick.",
                "Someone else is in your apartment."
            ],
            "content":"<div class=\"\"><div> <span>He slowly lead you out, making your to check every corner for any person. Luckily you both got out with out any encounter. Now that you are outside, the cold air felt nice against you, finally free. The place doesn't seem familiar to you, so you assume you or not in town. He make his way to a car and gesture you to get in. You slowly get into the front passenger seat as he close the door. When he get into the driver seat, the car tip slightly due to his weight. He light the engine and soon you are away from the warehouse.<br>\r\n<br>\r\n\"So, where do you live?\" he asks without looking at you. You started to tell him your address, but quickly cover your mouth. \"Relax, it's not like I will go to your house and kidnap you again, not after I let you go. I promised.\" As he's already releasing you, you might he's proving himself enough and tell him your address. He nodded and continue driving.<br>\r\n<br>\r\nYou sit in silence, don't know what to say but your curiosity get the better of you \"Er, Alan, right?\" when he doesn't answer, you assume that's his name so you continue \"Thank you for letting me go, even if you kidnapped me in the first place, but I'm grateful that you can see your action was wrong.\"<br>\r\n<br>\r\nHe seem surprised but doesn't response right away. \"So, why did you kidnap me in the first place?\" you ask.<br>\r\n<br>\r\n\"I don't really know. Boss tell us to kidnap human boys and he keep them away as soon as we brought them to him. Never seen them since, so we can assume the worst.\" he seem to open up to you more. \"I'm forced to do it, else he will kill me.\" <br>\r\n<br>\r\n\"But, couldn't you run away?\" you ask, curious.<br>\r\n<br>\r\n\"I did once, and he found me across the country. He forgave me the first time, but if I do it again, I'm a dead meat.\" he tells you.<br>\r\n<br>\r\n\"What about polices? Why didn't you call them?\" you wonder.<br>\r\n<br>\r\n\"I would already if I could.\" he sigh \"He's not like those normal thugs.\"<br>\r\n<br>\r\n\"How is he special?\" <br>\r\n<br>\r\nHe seem paranoid for a moment but lean close to you \"He's- He's a 'Survivor'.\" he whispers.<br>\r\n<br>\r\n\"Survivor!? But- But didn't they took care of that years ago?\" you've heard those word before. <br>\r\n<br>\r\nIt happened five years ago, a really big chemical explosion, killed thousand of people. But the anthro who survived got infected with special power, some got the power to read mind. And some, like Lyga, can control lightning. When you see Lyga with his power, you know he's one too but haven't talk to him about it yet. <br>\r\n<br>\r\nAt first people didn't treat Survivors as a normal anthro and usually treat them as freak. By the time some open up to them, it's too late. The Survivors started a revolution but after the government stopped them they all scattered.  After that the government went to a great length to see the remaining Survivors exterminated as they were dangerous to the country. But some are still on the run like Lyga, or Alan's boss and some are test subjects.<br>\r\n<br>\r\n\"Some got away. Most of the remaining in the hiding. You know what the police would do if they found out you are one.\" he said, his expression grim.<br>\r\n<br>\r\nThen you noticed that you are in front of your place already. You get out of the car and start to walk toward your apartment \"Hey, kid, remember to keep your mouth shut, okay?\" you nod.<br>\r\n<br>\r\n\"Hey, Alan.\" you turn back to the husky.<br>\r\n<br>\r\n\"What?\" <br>\r\n<br>\r\n\"Thanks for the ride. Both of them.\" you wink. He laugh as he drive off leaving you all alone.</span></div></div>",
            "created":1394082000,
            "id":1756311,
            "title":"Survivor"
        },
        "11111111122212111121":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "He forgives you.",
                "He's leaving"
            ],
            "content":"<div class=\"\"><div> <span>As soon as you get into the room, Lyga rushes in to hug you. \"Where have you been!? I have been worried sick. Why did you leave me in the park!?\" you are bombarded with questions from the wolf. \"Are you-, wait, why do you smell of cum?\" he sniffs you and starts to give you a disappointed look.<br>\r\n<br>\r\n\"It's a long story.\" you said looking away.<br>\r\n<br>\r\n\"I have the time. Just tell me where you were.\" he glares.<br>\r\n<br>\r\nYou sign and tell him what happened. The kidnapping. The warehouse. But when you reach the part where you were raped, the wolf's expression turned furious. You have never seen Lyga this angry before. If looks could kill, you would be dead by now. You thought he would freak out and call the police, but this, you weren't prepared for this.<br>\r\n<br>\r\n\"Where is he!? I'm going to kill that fucker!\" he snarls, baring his fang. You tried to calm him down but he won't listen. \"How can you be so calm!? He just raped you, for fuck's sake.\" he bellows.Even when you told him that Alan's kind enough to regret his decision and let you go, he just wouldn't have any of it.<br>\r\n<br>\r\n\"I k-kinda enjoyed it...\" you finally tell him the truth.<br>\r\n<br>\r\nHis expression turns shocked \"But- but, I thought you loved me...\"<br>\r\n<br>\r\n\"I still do, but I was my fantasy, you know... to be ravage by a strong guy.\" you mumble, feeling guilty.<br>\r\n<br>\r\n\"Am- Am I not enough for you?\" he sniffs, gesturing himself. He's crying right now, heartbroken.<br>\r\n<br>\r\n\"No, it's not like that.\" you feel terrible now \"I still love you. It's just feel so good when he did it, I couldn't help myself.\" He seem taken aback. There was a moment of silent before he speak up.<br>\r\n<br>\r\n\"I-I need to think about it, alone, please\" he hugs himself, tears running down his face. You nod slowly as he leave for his room.<br>\r\n<br>\r\nYou sign. You have made a mess of everything. You wonder if Lyga will ever forgive you. That night you go to sleep in a foul mood.<br>\r\n<br>\r\n----------------------------------------------------------------<br>\r\n<br>\r\nYou feel a nudge at your shoulder and wake up groggily. You turn to see Lyga's looking at you sternly.</span></div></div>",
            "created":1394427600,
            "id":1758304,
            "title":"Argue"
        },
        "111111111222121111211":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Go out.",
                "Stay in the room."
            ],
            "content":"<div class=\"\"><div> <span>\"Look, I want to apologize.\" he said.<br>\r\n<br>\r\n\"For what? It's me who's guilty.\" you tell the wolf, looking away.<br>\r\n<br>\r\nHe gently grab your chin. \"Yeah, I know. But still... I'm sorry for not trusting you. I can't exactly blame you for enjoying sex now, can I?\" he blushes \"And who am I to judge your kinky thought?. So I'm sorry for overreacting yesterday. I hope you can forgive me.\"<br>\r\n<br>\r\nYou hug him. \"Oh, Lyga. Thank you for understanding me.\" The wolf hug you back and soon you both shared a passionate kiss. When you break the kiss, you can see this cock harden. You've got an idea. \"Hey, Lyga.\"<br>\r\n<br>\r\n\"Yeah?\" <br>\r\n<br>\r\n\"Could you do me a favor?\" you ask before leaning in to whisper. When you finished, his face is bright red. <br>\r\n<br>\r\n\"R-Right now. B-but...\" he stammers, clearly embarrassed.<br>\r\n<br>\r\n\"Aww, c'mon, big guy.\" you plead.<br>\r\n<br>\r\n\"Alright, alright, just give me a minute.\" he gives in and you utter a quick 'yes!'. He walk around the room a few times before he exhales and stop at you. \"Tell me to stop if I'm too rough for you, okay?\"<br>\r\n<br>\r\nYou nodded \"Sure, stud.\"<br>\r\n<br>\r\nSuddenly, he approaches you and says \"The fuck are you looking at?\"<br>\r\n<br>\r\nYou were taken aback at first but manage a small \"Nothing.\"<br>\r\n<br>\r\n\"You want a piece of me, eh? You want to suck my big cock?\" he said before knocking you on to the floor.<br>\r\n<br>\r\n\"Yes, please.\" you exclaim.<br>\r\n<br>\r\n\"Thought so, slut\" he snarls before ripping his pants off with his claw and shove his shaft against your face. \"Go on, suck it.\" he command.<br>\r\n<br>\r\nYou are only happy to oblige and soon you are slathering all over his thick cock. He moan out in pleasure. \"Fuck yeah, suck it bitch.\" After a while he give a dissatisfied groan then grab your head and force more of his member into your mouth, before he face fuck you.<br>\r\n<br>\r\nYou are surprised as he did so \"Yeah, take it in. Fuck, so tight!\" he moans as he ram his cock down your throat. You tried to pull back but his grip is too strong. His motion is quick and forceful. As he near his climax, his thrusts quicken. <br>\r\n<br>\r\n\"Ahh yes, drink my cum like a good bitch.\" is the word he said before he let out a deafening roar as he unloads his cum down your throat. The torrent keep coming and soon your stomach bulk out from so much cum in your belly. He pull out as he finished his climax. You collapsed on to your back, exhausted. But the wolf has another plan as he forcefully grab you up.<br>\r\n<br>\r\n\"Get up, slut. I'm not done with you yet.\" he barks before pushing you to the floor, you land on your back with a thud. Before you have the time to get up, the wolf put his massive weight on you, pinning you to the floor, his slick cock against your ass cheeks.<br>\r\n<br>\r\nYou moan out as he start to push his thick cock in. \"You like that, bitch?\" you nodded eagerly. <br>\r\n<br>\r\n\"Then prepare for the best fuck in your life.\" He said before he force his whole cock in one go. <br>\r\n<br>\r\nYou scream out in pain and pleasure, his shaft stretching your ass. Maybe it's because Alan fucked you yesterday with the enormous cock of his that it's easier to take Lyga's member, but it still hurt.<br>\r\n<br>\r\n\"Ow, Lyga it's-\" before you can finish your sentence the wolf smack you across the face.<br>\r\n<br>\r\n\"Who said you can talk, bitch!?\" he snarls while pull out and thrust back in again, making you cry out in pain. Soon, he's fucking you like a beast, making you wince everything he hilt his cock in your hole. Sometimes biting into your shoulder, drawing some blood. He pants hard as he near his orgasm. \"Fuck, I'm going to fill you good. Hear it c-comes, RRAAAAAWR!!\"<br>\r\n<br>\r\nHe roar as he blast his load into your bowel.  The force so strong that if he's not holding you, you would be pushed back and hit the wall. His hot, thick, virile cum filled your bowel to the brim. This trigger your own orgasm as well as you shoot your load against his belly. He collapsed on top of you, still shooting into you. When he finishes pumping into you, he's panting hard and it's look like he's coming to his sense.<br>\r\n<br>\r\n\"H-How did I do?\" he asks, smiling.<br>\r\n<br>\r\n\"Amazing, thanks Lyga.\" you reply.<br>\r\n<br>\r\nBut when he noticed the bite mark on your shoulder and the blood coming out of it, his eyes went wide. \"Oh, god. Did it hurt? I didn't mean to bite so hard. Are you-\" he starts to blabber but you just cover his mouth.<br>\r\n<br>\r\n\"It's alright, Lyga. It hurts a bit but I'll be fine, plus it's more erotic this way.\" you ensure him.<br>\r\n<br>\r\n\"I-If you say so.\" he calms down when you assure him you are alright. \"I got carried away, I'll be careful next time.\" he says and lean in to kiss you. <br>\r\n<br>\r\nAfter a minute you break the kiss \"So, what should we do today?\"</span></div></div>",
            "created":1394773200,
            "id":1760149,
            "title":"Make up"
        },
        "1111111112221211112112":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Follow him.",
                "Leave him be."
            ],
            "content":"<div class=\"\"><div> <span>\"Can we stay in the room? I'm still kinda sore.\" you say.<br>\r\n<br>\r\n\"Okay, no problem.\" he gives you a quick smooch before pulling out of you. Stream of cum flow out of your ass. \"Yeah, and gonna clean this up too.\" he chuckles.<br>\r\n<br>\r\nAfter you two clean up, and you bandaged your wound, you both decided to watch TV and cuddle. \"Hey, Lyga. I have been wanting to ask. Are you, er... a Survivor?\"<br>\r\n<br>\r\n\"Well, not exactly. My dad is one.\" he says casually.<br>\r\n<br>\r\n\"Your dad!?\" you blurt out.<br>\r\n<br>\r\n\"Yeah, and spending time with him get me infected, I think.\" for emphasis, he made a small lightning with a motion of his hand. \"Though I think it's awesome.\"<br>\r\n<br>\r\n\"Me, too.\" you coo.<br>\r\n<br>\r\n\"It's the reason we moved in the first place. When the government was down on us, we escaped.\"<br>\r\n<br>\r\n\"So, where is he now?\" you ask, curious.<br>\r\n<br>\r\n\"A year ago, my dad said it was better for us to separate, think it will make them track us down harder. So I was alone since.\" there are sadness in his eyes as he says it.<br>\r\n<br>\r\n\"I'm sorry to hear that.\" you say, sympathetically.<br>\r\n<br>\r\n\"Well, at least I got you now.\" he nuzzle you, and you giggle. Suddenly the doorbell ring.<br>\r\n<br>\r\n\"I'll get it\" you get up and head for the door. You are greeted by a cheerful tiger.<br>\r\n<br>\r\n\"Hey, how are you, little guy?\" the feline said before hugging you.<br>\r\n<br>\r\n\"Oh hey, Chase, why are you here?\" you ask.<br>\r\n<br>\r\n\"Why? Do I need a season to visit a friend?\" he says, rubbing his face against your.<br>\r\n<br>\r\n\"Well...\" you can't argue with that.<br>\r\n<br>\r\nHe lift up the bag he's holding and hands it to you \"Oh, and here, for you.\" <br>\r\n<br>\r\n\"What's it?\" you ask and look inside the bag \"A cake? Thanks, Chase.\" he knows that chocolate cake is your favorite \"It's look expensive, you sure want me to have it?\"<br>\r\n<br>\r\n\"Yeah, anything for my friend.\" he smiles. But his eyes wander past you and notice the wolf on the couch. \"If you don't mind me asking, who's that?\" he points to Lyga.<br>\r\n<br>\r\nYou put the bags down on a nearby table \"That's Lyga, he's my boyfriend.\" when you mentioned the word 'boyfriend', Chase's body seize, his eyes wide open for a second.<br>\r\n<br>\r\n\"T-That's must be nice.\" he mumbles, looking away, trying to act normal.<br>\r\n<br>\r\nYou are concerned with how his reaction \"Are you ok?\"<br>\r\n<br>\r\n\"Y-Yeah.\" you are not buying it, but don't want to press the matter.<br>\r\n<br>\r\n\"Well, come on inside.\" you say, moving over so he can get in.<br>\r\n<br>\r\nBut he backs away toward the stair \"Oh, that's alright. I-I was just dropping by, g-gotta go.\" he quickly run down.<br>\r\n<br>\r\n\"Wait!\" you call out, but he's not stopping. You wonder what's wrong with him.</span></div></div>",
            "created":1395291600,
            "id":1763385,
            "title":"A Guest"
        },
        "11111111122212111121121":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "...skip work to avoid him.",
                "...go to work as usual."
            ],
            "content":"<div class=\"\"><div> <span>\"What happened?\" Lyga asks as you hurried back into your room to grab your jacket.<br>\r\n<br>\r\n\"It's my friend, he's acting strange, I'm going to follow him.\" you say as you put your jacket on.<br>\r\n<br>\r\nHe grabs your hand \"Let me come with you.\" <br>\r\n<br>\r\nYou look at him and sign \"Look, Lyga. I need to go alone. Chase has problem dealing with stranger.\"<br>\r\n<br>\r\n\"But I'm not a stranger, I'm-\" you glare at him. \"Okay, okay. I will stay here.\"<br>\r\n<br>\r\n\"Thanks, Lyga. I'll be right back.\" you quickly sprint out the door.<br>\r\n<br>\r\nIt's not hard following the tiger, since he left his footprints in the snow. It leads you to the park where you and Lyga went yesterday. You can see the track goes into the bushes and as you approach it, you can hear someone's crying. You emerge to see the tiger sitting in the snow, his back against a tree, crying his eyes out.<br>\r\n<br>\r\nIt make you feel sad to see him like this. He's always cheerful and an optimistic, you've never seen him this sad before. You walk up to the tiger and sit down next to him. \"Hey, Chase.\"<br>\r\n<br>\r\nHe looks up to see you, tear running down his face. \"H-Hey.\"<br>\r\n<br>\r\nYou move closer to hug him, trying to comfort the feline \"Tell me what's wrong. We are friends, right? You can tell me anything.\"<br>\r\n<br>\r\nIt take another minute or so before he finally calm down. \"Well, the truth is\" he sniff and look you straight in the face \"I've always been in love with you.\"<br>\r\n<br>\r\nYou are shocked. You know that he consider you his best friend but never thought he has a feeling for you. But thinking back, it kinda make sense. He's always fond of physical contact, especially hugging. \"B-But, since when?\"<br>\r\n<br>\r\n\"Ever since the first year. You remembered when you were looking for a job? And when you accepted my offer for you to work at the restaurant, I was so happy I will have more time to spend with you.\" the tiger smile a bit \"I wanted to confess many times but I don't know how will you react. Guess I was too late, huh?\"<br>\r\n<br>\r\nYou just sit there listening, don't know what to say. After a while, he gets up \"So, I think I should go home now.\" you nod lightly.<br>\r\n<br>\r\n\"Hey, Chase\" you call out and he stops in his track. \"We are still friends, right?\"<br>\r\n<br>\r\nHe give you a faint smile \"You bet. And if he hurts you, come tell me. I'll make him regret it.\"<br>\r\n<br>\r\nYou grin a little \"Alright.\" he waves his hand and walk off. <br>\r\n<br>\r\nYou sit there for a while longer, looking at the direction he left, before deciding to head back.<br>\r\n<br>\r\n\"So, how is he?\" Lyga asks as you enter the room. You tell him what happened and his ears drop \"I feel so bad for him, I hope he's alright.\"<br>\r\n<br>\r\n\"Me too.\" you wonder how the heartbroken tiger feel about you now.<br>\r\n<br>\r\nThat night, you lay awake, thinking about Chase but soon drift to sleep. When you wake up, you decided to...</span></div></div>",
            "created":1396587600,
            "id":1773316,
            "title":"The Truth"
        },
        "111111111222121111211212":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "You meet someone at your work.",
                "Chase invite you out."
            ],
            "content":"<div class=\"\"><div> <span>You didn't want to go to work today, but you have to clear things up with Chase. You say goodbye to Lyga before heading for work. When you arrived, you take a deep breath, preparing what to say when you meet the tiger. <br>\r\n<br>\r\n\"Hey, what are you doing?\" A pair of hands grip your shoulder and you yelp in surprise. You turn around to see Chase standing behind you. \"Whoa, don't scare me like that.\"<br>\r\n<br>\r\n\"I'm the one who should say that!\" you shout before calming down \"Anyway, are you okay, now?\"<br>\r\n<br>\r\n\"What?\" he seem oblivious about what you just said, making it harder for you.<br>\r\n<br>\r\n\"Well, you know, about yesterday?\" you mutter.<br>\r\n<br>\r\n\"Oh, about that. Yeah, I'm okay now.\" he gives you a cheerful smile.<br>\r\n<br>\r\nYou are bewildered. How can he recovered so fast? \"Really!?\"<br>\r\n<br>\r\n\"Yeah, I regretted it a little but I guess it wasn't just meant to be, you and me, I mean.\" he scratches his head and blush \"But if you ever break up with him, not that I want you to, but if-\" he stutters then stop and takes a deep breath and says \"Would you be my boyfriend?\"<br>\r\n<br>\r\n\"Of course.\" the moment you reply he lifts you up and give you a bear hug.<br>\r\n<br>\r\n\"Oh, thank you, thank you.\" he exclaims happily.<br>\r\n<br>\r\n\"T-Too tight.\" <br>\r\n<br>\r\n\"Oh, sorry.\" he apologizes before putting you down. He looks at you with a grin \"So, let's get to work.\" At that, he walks inside, you just shake your head and follow him.<br>\r\n<br>\r\nYou work as usual and Chase acts as if nothing has happened so it kinda take off the pressure. The day gone by as normal and after work, you tell Lyga about Chase. He sighs in relieve saying that he's glad Chase doesn't hate him or something like that and asking you to sometimes introducing him to Chase so they could be friend. Then you two decide to have a rowdy sex and as you lay in bed, tired after that, you hope it can be like this all the time.</span></div></div>",
            "created":1398142800,
            "id":1784814,
            "title":"Confront"
        },
        "112":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "You call him back now.",
                "You wait to call."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Lyga! I haven't heard from you in awhile, what's up?\" You say in excitement from hearing his voice again.<br>\r\n<br>\r\n\"Hey ...! Oh nothing. I just wanted to call and see how you're doing.\" He said with his shy voice as if he was trying to hide something. <br>\r\n<br>\r\n\"What? You haven't we haven't seen each other in like nine years.\" You blurt out in disbelief that this was just a check up call. \"Come on man. Why did you really call?\" You ask him trying to see the real reason he called.<br>\r\n<br>\r\n\"I know how long it been. I-It's just that. I just want to say hi.\" He stuttered shying away from you again.<br>\r\n<br>\r\n\"Hey I'm sorry about that but I just find it hard to believe that you would just check on me after 9 or so years of silence.\" You explain to him hoping to ease his shyness.<br>\r\n<br>\r\n\"It just that I... nevermind. I'll call you later.\" He says as he hangs up.<br>\r\n<br>\r\n'Well. I certainly screwed that one up.' You think to yourself.<br>\r\n<br>\r\n\"Maybe I should wait a little bit and see if he does call me back or if I have to call him back. Or I could just call him back now and say sorry.\" You say out loud.</span></div></div>",
            "created":1499757120,
            "id":2351270,
            "title":"He was just checking on you."
        },
        "1121":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "\"Hello\"",
                "\"GO AWAY PLEASE!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You call back the second you see that hung up. No answer you try agian, no answer. \"Well third times the charm\" you tell yourself. You call once more, you hear ringing, then you here him say.\"...</span></div></span></div>",
            "created":1499757960,
            "id":2351273,
            "title":"You call him back now."
        },
        "11212":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "Wait",
                "Give up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"GO AWAY PLEASE!\" Then he hangs up again. What have you done, you think, you just ruined a relationship with an old high school friend. You think to yourself, there is only one thing you can do, wait...</span></div></span></div>",
            "created":1499758080,
            "id":2351274,
            "title":"\"GO AWAY PLEASE!\""
        },
        "112121":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "content":"<div class=\"\"><div> <span>          You wait for another day. That day passes by, then you defide to call try again. You pick up your phone, dial his number, and all you here ringing for a minute,<br>\r\nThen you hear his voice and you instantly say hello. But then you realized he was saying leave your after the beep. Then you wait a little longer, about a week, you call again, but there is no answer. You wait a month and call again, but it is to no avail. He hasn't responded in a couple moths. <br>\r\n          You finally give up, delete his number and forget his memory, crying the entire time because you know, the it's your fault. You drove him to this. He just wanted to check on you but you had to go and question him. You knew how shy he was and that upon the slightest bit of interrogation he would collapse and fall into his ball. But no. You had question. You failed. You lost your best friend.</span></div></div>",
            "created":1503666360,
            "id":2374478,
            "title":"Wait"
        },
        "112122":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "Later on in life."
            ],
            "content":"<div class=\"\"><div> <span>You think again to yourself. What's the point, I just got yelled at to leave him alone. I don't see why I should keep poking him, I mean, I knew how shy he was, yet I decided it was a good idea to prod at him. I'm such an idiot you tell yourself. As you sigh you through your phone and delete the calls. You then forget everything you can about him. Then you go back to your phone and go on like nothing ever happened. But you will always know that it did, and that you caused it. It was all your fault.</span></div></div>",
            "created":1499758380,
            "id":2351278,
            "title":"Give up"
        },
        "1122":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>It's been a few hours and still nothing. You call him back, but there is no answer, so you wait a little longer. Then the morning comes around, you try agian and still nothing. Next week you try again, but still nothing. But later that day there is ring and it's his number, you quickly grab the phone, \"Hello!\" You yell out hoping to get a response, a minute goes by of nothing but silence and you saying hello go by. Then you hear a faint voice say, \"hey.\" Lyga says sounding very sad, \"I was wondering, i-if you wouldn't mind...\" he is speaking very slowing and quitely as if hiding from someone.<br>\r\n<br>\r\n\"If I wouldn't mind what? Ask me man, it's ok.\" You encourage him to continue.<br>\r\n<br>\r\n\"W-would y-you mind if I stayed with you? For a little bit?\" He asked in his quite shy voice.<br>\r\n<br>\r\nYou are shocked by this question, you never knew he would be here. You think about this question<br>\r\nYou could say yes, or no.</span></div></div>",
            "created":1499757720,
            "id":2351272,
            "title":"You wait to call."
        },
        "12":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Nothing happen. He stays the same.",
                "The potion worked perfectly",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You are a 23 years old male. Your height is 5'7\" and you tipping the scale at 155lbs. You are just a typical guy who is gay and doesn't have many friends. You are living with your best friend Kyron in his house. Your life isn't interesting but you hope that one day things are going to change. <br>\r\nToday was an uneventful day at work. The restaurant is so empty that you swear you heard some crickets chirping. You came home and saw Kyron was sitting on the couch watching TV.<br>\r\nKyron is my best friend since elementary school. We are always stick together like brothers. He is 2 inches shorter than me and weighs about 140lbs. But what he lacks in size, made up for it with his intelligence. He has an IQ of 140 and he earned a full scholarship to Harvard University. He is a very nice guy but he never like to go out. He always working in his underground laboratory at home.  <br>\r\n\"Hey, what are you doing?\" You ask curiously because Kyron is always in his lab when you came home.<br>\r\n\"Hi. You won't believe what I have created?\" He said that with a big toothy smile while his body is shaking with excitement.<br>\r\n\"Did you created a death ray!\"<br>\r\n\"Of course not. I have created a muscle growth potion\" He turned off the TV and took a vial containing reddish liquid from the drawer.   <br>\r\n\"Really?\" You said sarcastically. (Although you hope the potion worked)<br>\r\n\"Yup and I will show you right now.\" He drank the whole vial in one gulp.      <br>\r\nYou scanned him to see if something happen.</span></div></div>",
            "created":1439096400,
            "id":2019219,
            "title":"Kyron the Dragon"
        },
        "122":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "You wake up in your bed",
                "You wake up on the floor"
            ],
            "content":"<div class=\"\"><div> <span>For the first minute, nothing happened. Your expectation dropped as you thought that his experiment would work. This is the first time he was so confident about his invention. <br>\r\n<br>\r\n\"Aw damnit! I thought it would wor……\" His voice was cut off as he suddenly shuddered more violently; he gasped from apparent pain.<br>\r\n<br>\r\n\"Oh my god! Are you okay?\" You shouted, grabbing Kyron's shoulder, trying to comfort him, panic starts to flood your mind.   <br>\r\n<br>\r\n\"I'm fine. Just the potion's side effect\" He is still shaking horribly grit his teeth from the pain and strong burning feeling that was coursing through him. Inside Kyron's body, his bones reshaping and lengthening making him taller. You watched your mouth agape, as Kyron's muscles, all of them tensed, bulging outward as if he was flexing them all at once. Then his muscles grew. <br>\r\n<br>\r\nHis chest was the first to grow. You watched as his flat chest inflated to a set of admirable pecs bulging and straining against the white T- shirt. His nipples poked against his shirt, no doubt getting rubbed by the material as they swelled. Then your cock twitched appreciatively as his favorite muscle part started to shift and stir. His biceps and triceps inflated into small balls of muscle threatening to rip his shirt. When his bicep seemed to have reached its peak, the growth wave washed along his forearms. One second he still had his slim forearms, the next they bulged out at the crook of his arm, lines of definition appearing as the muscles rose up like stone, veins snaking along them too to pulse against his skin. <br>\r\n<br>\r\nYou were drooling slightly as Kyron who was once a \"runt\" to his species is becoming more muscular by the second. You look down and see his quads grows proportionately with the rest of his body, his calves grows into a perfect diamond shape. His legs started to bulge against each other as their increasing size reduced the space between them. <br>\r\n<br>\r\nAfter a few minutes of continued rapid growth, it slowed down as you heard this sound.<br>\r\n\"SHHRRIIIIIIIIIIIIIIIIIPPPPPPPPPPPPPP…….\" The sound echoes throughout the room as you see what it causing it. His shirt rips off in the middle and his biceps grows out of the shirt getting bigger than ever destroying the sleeve. Your cock twitched, become as hard as steel and dripping with precum. His pants can't contain his enormous quads and rips open everywhere revealing the growing python in his underwear. That once tiny penis has definitely become bigger, maybe 50% longer and thicker. <br>\r\n<br>\r\nFinally the growth stops. You examined him again to see the result.<br>\r\nThe potion had left him with some rather solid looking shoulders, ones that were nice and wide, with the remains of his poor shirt hanging on it. In the middle section, there is a faint set of abs forming. His horns has grown bigger and longer  <br>\r\n<br>\r\nHe isn't huge but his muscle is defined like he was going to the gym everyday. You estimated that he had probably gained at least 70 lbs of muscle and 7 inches in height which puts him at about 6 feet with 210 lbs of solid blue dragon muscle. You look down to see the remaining fabric of Kyron's underwear barely covered the huge piece of blue meat that is about 8'' and as thick as a beer can. And he isn't hard yet. Not to mention the 2 huge and plump balls as big as tennis balls that is practically churning with cum. You can't even imagine how muscle can those orbs produce. <br>\r\n<br>\r\n\"Shit, I should have taken off my clothes first before drinking it.\" He said with a deep baritone, making you leaking cum like a broken faucet. Then Kyron looked at me with a naughty grin on his face. You try to say something but no words came out.   <br>\r\n<br>\r\n\"Fuck it!\" He ripped the underwear off and the rest of the \"rags\" on him. Then he hits the most muscular pose. His body is covered in veins, every muscle in his body is bulging with power. His draconic cock is now rock hard at 10'' and as thick as a wine bottle, already dripping a puddle of cum.<br>\r\n<br>\r\n\"Do you like it?\" Kyron said with the deepest and sexiest voice, flashing the most cocky grin on his face. After you heard that, you let out a moan and cummed so hard with the biggest load of your entire life that you fainted.<br>\r\n</span></div></div>",
            "created":1439874000,
            "id":2022596,
            "title":"The potion worked perfectly (maybe too perfect)"
        },
        "1221":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Eat breakfast",
                "Something else "
            ],
            "content":"<div class=\"\"><div> <span>You woke up with a start. Your eyelids are still heavy like you haven't sleep enough. You look around and realize that you are in your bed. <br>\r\n<br>\r\n“Ugh. What happened yesterday?” You only remember coming home from work and then you suddenly wake up in your bed. The rest is blank. Your head is buzzing from the memory loss.<br>\r\n<br>\r\nYou look at your clock and see that it is 6:15 am. <br>\r\n<br>\r\n“Oh well, I already wake up so no sleeping anymore.” You stretch a little to be wake yourself and then you go to the bathroom. Finishing the morning routine, you come out of the bathroom and that is when you heard a large clanking sound coming from the basement. <br>\r\n<br>\r\n“What is Kyron doing down there!” You come down the basement and what hit you instantly is the musk and the aroma of sweat and muscle. Then, you see all of the lab equipments have cleared out with some still left in the corner. It was replaced by a big weight room with equipments that can be compared to professional gyms. However, what stunts you the most is the specimen standing in the room lifting weights with his back facing you. He was not huge but he had the body and the definition of an Adonis statue. He had to be about 6’1”. You look at his wide lats and traps only added to his muscular and wide back with a perfect V shaped figure. You could see his perfect horseshoe triceps flexing as he curling the weights.<br>\r\n<br>\r\nYou didn’t care much about what he doing in his arm though. You were to busy gazing at his magnificent back. Below the thin waist is the round and muscular butt. He flexed it every time he is done with a rep, which made my cock throb harder. Then, you realized that he is working out in the nude.<br>\r\n<br>\r\nYour heart races, you can’t take your eyes off the magnificently powerful dragon which reminds you who is this. His body has blue scales like Kyron and the flowing white hair on his head and hair on top of his tail on a little fluff at the end. The only difference between this Adonis and Kyron is the muscle mass and maybe the body hair too. Then you remember Kyron had told you about making a muscle growth potion and yesterday he showed you the potion and drink it.<br>\r\n<br>\r\nYou are practically awed and horny at the same time by the idea of your geeky best friend has turned into this muscle dragon that you always dreamed of. Kyron drop the weights with a loud bang, then turned around and he was startled to see me.<br>\r\n<br>\r\n“Sorry, did I wake you up. I tried to do this as quiet as possible.” He cheeky grinned at the statement he made, knowing that you were standing there the whole time. You were stunned by how deep his voice is. <br>\r\n<br>\r\n“No…no. It’s …fine, Kyron.” You are practically drooling from your mouth by the sight he is showing right now. His magnificent body still pumped from the workout, but what catches your eyes is his huge blue cock. You can see that it’s pulsating with every powerful beat of his heart. Kyron must have known you were staring at his cock because he snapped his finger and said:<br>\r\n<br>\r\n“Hey, my eyes are up here.” He sniggered. You finally look at his face and see more of the change on the front of his body. The potion not only grow his muscle but also grows his body hair too. He has a light dusting of hair on his pecs with more black hair between his pecs which is emitting an intoxicating smell of muscle, sweat and testosterone. The trail of hair leads down to the chiseled 6 pack abdominal. Finally the happy trail leads to the thick bush of body hair that is enveloping his cock.<br>\r\n<br>\r\n“What do you think? Take it from the orgasm yesterday then I’m pretty sure you love this.”<br>\r\n<br>\r\n“Wha…at..” You blushed. You still don’t fully remember what happen last night.<br>\r\n<br>\r\n“Oh, you don’t remember. Right after I do this.” He hit the most muscular pose which makes every muscle in his body bulged out more. Your cock is practically dripping like a leaky faucet right now. You are scared that if he finds out that you are gay then you will break this friendship.<br>\r\n<br>\r\n“And then you shot what must be the most powerful orgasm in your entire life.” His voice is now deep and intimidating like he is going to punch you. You then sit down on the stairs, put your head down and begin to sob. Kyron immediately notice this and say with a soft voice: <br>\r\n<br>\r\n“Hey, I am not mad at you. I am actually pretty flattered.”<br>\r\n<br>\r\n“Hig, hig….you aren't mad at me....” You begin to look up and see that he is truly sincere. Tear is still rolling down your face. He then sits next to you, not that there is much space for a big guy like him on this small stairs.<br>\r\n<br>\r\n“Of course not, you’re my best friend. And I know that you were gay since we were in like 8th grade.”<br>\r\n<br>\r\n“Wait, you do.” You begin to blush and almost cry again as you think he will kick you out of the house and end our friendship.<br>\r\n<br>\r\n“No, don’t cry again. I am gay too. OK.” You are astounded because when you go out with him, he never look at anybody, men or women.<br>\r\n<br>\r\n“You know why I created the potion that make me like this.” He is doing a one arm flex making you giggle like school girl right now. Veins snaking around his forearm and the particular large one on his bicep.<br>\r\n<br>\r\n“I don’t know. Why?” <br>\r\n<br>\r\n“Because I know you like muscular guys and you always protect me so I make this for you to like me.” Now it was his turn to blush.<br>\r\n<br>\r\n“You know I will always like you no matter your build.”<br>\r\n<br>\r\n“So, I want to ask you something. Will you be my boyfriend.” He is step down 2 steps and kneel down in the position like the groom is asking the bride to marry him.<br>\r\n<br>\r\n“Of course you dumb ass, I will always love you.” He finally run up to you and kiss you deeply. Your tongues wrap around to build pressure. You were the first to break the kiss.<br>\r\n<br>\r\n“Wow, that was an amazing first kiss for me.”<br>\r\n<br>\r\n“Me, too.”<br>\r\n<br>\r\nHe then stands up and look at you:<br>\r\n<br>\r\n“So, what do you want to do now?”<br>\r\n<br>\r\n</span></div></div>",
            "created":1444539600,
            "id":2046161,
            "title":"What is in the basement"
        },
        "12211":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Follow Kyron",
                "Continue your adventure"
            ],
            "content":"<div class=\"\"><div> <span>He give you naughty grin and you know exactly what he wants. But you said:<br>\r\n<br>\r\n“We just got in to this relationship so I just want to take it slow, alright?” You are kind of disappointed at your own statement but you want this relationship to last.<br>\r\n<br>\r\n“OK” He said it with a slight hint of disappointment too. Then he notice you still ogling at his bicep so: <br>\r\n<br>\r\n“Do you want to fell this before we take our breakfast?” He flex.one arm, making his bicep as big as a tennis ball. You are tempted by it so you go for it. You put one hand on his sweat covered bicep, feeling the hardness and striation; it’s harder than a rock. Attracted by the intoxicating smell of testosterone and manly musk, you leaned it and smell his bicep. Moving down to his arm pits, you lick it to taste the sweat.<br>\r\n<br>\r\n“Whoa, easy there tiger. You want to take it slow, don’t you?” You snapped out from the muscle day dream and look at him, only to see him making a smug face. <br>\r\n<br>\r\n“Yeah, and you stink…., Stinky!” <br>\r\n<br>\r\n“Stinky! Ok, then you go make breakfast and I will go shower.” He was enraged in a humorous tone, raising his voice a little bit. He give you a kiss and go to the bathroom. You also stand up and go to the kitchen. <br>\r\n<br>\r\nAfter 10 minutes, you finished cooking a big breakfast for you and  your newly huge lover: 5 stacks of pancakes, 8 eggs and toasts. Finally, you pour out some milk for you and him and you just leave the gallon of milk on the table just in case he is still hungry. Just as you finished everything, Kyron comes out of the shower with a towel wrapped around his waist. <br>\r\n<br>\r\n“Hey, can you find some clothes to fit me?” You stared at his shiny and defined body, freshly out of the shower. His pecs rises at every breath he takes.<br>\r\n<br>\r\n“Hello….” He snapped his finger, making you realized what he just say.<br>\r\n<br>\r\n“Oh… yeah. I’ll try the wardrobe.” You go in to your room to find some clothes to fit him. Before this, you are slightly bigger than Kyron but now he is bigger than you in every way so it would be hard to find him clothes that would fit him. You go through everything you own and finally come across a large sweatshirt and a pair of sweatpants. This is just about his size and you don’t even remember where it come from but it will do it. <br>\r\n<br>\r\nYou go out to the kitchen and what you see next shocked you. All of the plates and glasses are empty and Kyron is sitting at the end of the table. He is rubbing his belly and then burp loudly in satisfaction.<br>\r\n<br>\r\n“Sorry” He said it with a silly smile. <br>\r\n<br>\r\n“Thank you for a good breakfast.” <br>\r\n<br>\r\n“Wait. How can you eat it all?” <br>\r\n<br>\r\n“What” He smile dumbly.<br>\r\n<br>\r\n“Nevermind.” You expected it to happen so before that you have eaten a toast and a glass of milk.<br>\r\n<br>\r\n“Since you cooked that then I should clean the dishes.”<br>\r\n<br>\r\n“No, just sit down Kyron and relaxed. I will do it.” He protested but you quickly shushed him.<br>\r\n<br>\r\n“If you want to help me, you can do something else for me when I come back from work.” He grinned naughtily.<br>\r\n<br>\r\n“Alright.” Then he gone out to the living room. Then you remember what you supposed to do.<br>\r\n<br>\r\n“I almost forgot. Try this on Kyron.” You throw the clothes at him and you started cleaning the dishes. There isn't much so you finished and you change your clothes to go to work. You go out to the living room and saw that he was watching TV with his clothes on, his muscles straining against the fabric, leaving little for imagination. When he saw you, he immediately stand up and give you a bear hug.<br>\r\n<br>\r\n“Can you stay home with me for my little surprise, please?” He said it with a big puppy dog eyes. As much as you want to stay with him, you have to go to work and you don’t want to stay with him all day because it will ruin his surprise for you.<br>\r\n<br>\r\n“No, Kyron. I have to go to work, your little surprise can wait.” <br>\r\n<br>\r\n“Fine. You won’t be disappointed.” He give you a wet kiss. It lasted for a while and you are the first to break it.<br>\r\n<br>\r\n“Wow, where did you learn to kiss like that Kyron?”<br>\r\n<br>\r\n“Reading to many gay love story, I guess” His face is red as a tomato after the statement.<br>\r\n<br>\r\n“Ok. Love you Kyron.”<br>\r\n<br>\r\n“Love you too.” Then you go out to work.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1446228600,
            "id":2054680,
            "title":"Eat breakfast"
        },
        "122112":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Kyron got you a gift",
                "Kyron got you a HUGE gift. (Involves him)"
            ],
            "content":"<div class=\"\"><div> <span>You were just opening the back door to go in when you crashed in to a solid wall, then you realized it is a huge and solid pair of pectorals belongs to a green muscular Orc whose name is Bruce. <br>\r\n<br>\r\n“Oh, hey buddy! Are you okay?” A loud, deep masculine voice sounded loudly to your ear. You look up and was greeted by a huge naughty grin from Bruce<br>\r\n<br>\r\n“Did my little body hurt you?” As he was saying it, he started bouncing his pecs which makes you very captivated by it. Finally, you found your voice and say<br>\r\n<br>\r\n“Yeah…I am okay.” You are starting to be aroused by the hardness and the sheer masculinity that Bruce had and Bruce still had that silly grin on his face.<br>\r\n<br>\r\n“Ok, if you want to talk. Here I am.” He was walking out of the door to take out the trash. You walked in to the restaurant to start working.<br>\r\n<br>\r\n(Oh and you have to introduce him to the readers. Ok…)<br>\r\n<br>\r\nYou met him at this restaurant 3 years ago and he was working as a chef here. One day he talked to you and you two got to know each other. It turns out that he was a amateur bodybuilder in the past and he had won one or two prizes but he found another passion: cooking. So he decided to go to culinary school and then he ended up here (which was the thing that make you very happy right now). Until now he is still working out to get bigger or as he said it before: “I want to be the biggest and most shredded motherfucker in this town” with a huge proud smile and he is very huge right now. 3 years now, I have watched him grow, he is now standing at 6’ and 220lbs of orc muscle. <br>\r\n<br>\r\nThe rest of the day was really busy. The restaurant have a lot of customers so you have to take orders and run really fast. You can’t wait to see Kyron (that muscular hunk of a dragon) at home. When you are done with your shift, you say goodbye to everyone including Bruce…<br>\r\n<br>\r\n“Zzzttt…” Your phone is ringing, you wonder who is calling.<br>\r\n<br>\r\n“Hello.”<br>\r\n<br>\r\n“Hey, can you buy me some clothes, please?” The voice on the other side is really deep and gruff but sound very familiar.<br>\r\n<br>\r\n“Wait, who is this?”<br>\r\n<br>\r\n“It’s me, Kyron. You forgot your hunky boyfriend already?”<br>\r\n<br>\r\n“No, it’s just that your voice sounds strange.”<br>\r\n<br>\r\n“Ok, so can you do it?” <br>\r\n<br>\r\n“Yeah.”<br>\r\n<br>\r\n“Thank you. Can’t wait for you to look at my surprise I got for you. Bye Hon.”<br>\r\n<br>\r\n“I’m looking forward to that. Bye.” You turn off your phone and then walked to the supermarket and still wondering what he got you. On your way there, you think that his huge body probably doesn’t even fit any of his old clothes anymore, that lead you to think about him in tight clothes and then rip it off effortlessly. That’s so hot!<br>\r\n<br>\r\nWhen you reach the men clothing section in the bodybuilding store, you tried to find the largest t-shirts and pants as possible. They have so clothes that is twice or triple the size you are wearing so you just bought the biggest and you also buy one that is 2 size smaller than that because of personal reasons.<br>\r\n<br>\r\nWhen you done shopping, you go back home. However, when you open the door to the house, a HUGE surprise was waiting for you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1448405580,
            "id":2066362,
            "title":"A new character"
        },
        "1221122":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "\"Yes, take me Kyron\"",
                "\"No, it's late now. I want to sleep.\""
            ],
            "content":"<div class=\"\"><div> <span>When you open the door, the familiar musk filled the house but this time it’s stronger and make the house very warm. Immediately, you your eyes spotted the godly and almost nude (wearing only his underwear) blue dragon that is emitting the scent. Kyron is doing pull ups in the middle of the house with his back facing you. His HUGE back muscle seemed to have grown enormously since you left the house and actually every muscle in his already huge body seemed to have grown enormously. You closed the door and dropped your stuff and just stared at Kyron’s wide V shaped back that leads to a very narrow waist. Kyron heard you closed the door so he finished 1 more rep and then jumped down making the floor shake and walked towards you. You can’t missed the large bulge in his underwear.<br>\r\n     <br>\r\n“Hey, babe. Glad you’re home!” He said it with the deepest, most sexy baritone ever (That explains the voice in the phone). He leaned down to kiss you with the most passionate kiss ever. Your tongue is practically dancing with his tongue and he is taking the dominance role there. You break the kiss first.<br>\r\n<br>\r\n“Wow, that must be the greatest kiss I have ever have, Kyron!” This make the huge dragon blush making him shy and cute. However, he immediately became confident again and give you the one arm bicep flex close to your face. That is when you remember that has grown bigger when you left him and this bicep is one of the many example. His biceps has to be 30” now with veins snaking on top of his bicep and towards his forearms. You put one hand on it to feel the hardness. It’s like touching and feeling a hot diamond, you can’t make a tiny dent in his bicep which makes Kyron smirk at your attempt. He took his arm away and rose to full height, looming over you. He must be about 7’2” because he are staring at his chest and he gained at least another 80lbs of pure muscle because you can’t see fat anywhere on his body making him very shredded<br>\r\n <br>\r\n“So, how do you like my surprise?” Making his signature most muscular pose again. Every muscle fibers in his body bulged even bigger than before and make the Hulk stand next to him look like a punk. <br>\r\n<br>\r\n“Did you drink another potion again.” That is a rhetorical question to him and he knows it because he said this with a wide grin on his face.<br>\r\n<br>\r\n“Why yes. I did because I want to protect you and I can make all your wildest dreams come true.”<br>\r\n<br>\r\n“Really.”<br>\r\n<br>\r\n“Really! I did this because I love you and thought that you want me to be bigger.”<br>\r\n<br>\r\n“I have never had anyone who would do something like that for me. I think I need to sit down.” You were about to walk to the sofa but Kyron picked you up like a feather and sit down on the sofa with you in his huge arms like a child and his mother. Then, you started to weep uncontrollably, Kyron saw it and say:<br>\r\n<br>\r\n“Why are you crying ?”<br>\r\n<br>\r\n“You are too good for me, why would you want to stay with me?”<br>\r\n<br>\r\n“Because you are always there for me, too. You protected me from the bullies in school back then and now I want to protect you.” He give you a big hug not too roughly but softly. One thing lead to another, you two started kissing tenderly. You two break it at the same time and then you sees the clock and says:<br>\r\n<br>\r\n“Hey, it’s late. Do you want to sleep now ?”<br>\r\n<br>\r\n“Yeah.” Then he stand up with you still in his arms (You can get use to this) and go to his bedroom. He put you in king-size bed first and then he went in and lay down with you. You scooch a little bit to make space for him and then hug his rock solid middle section, you started rubbing it a little bit to feel the hardness. Each ab feels as hard as a diamond even unflexed making your member to grow painfully hard. Kyron feels it so he flexed it making his abs even harder and thicker.<br>\r\n<br>\r\n“Wow, Kyron. That potion really works miracles right!”<br>\r\n<br>\r\n“Yeah,… do you want to try the potion ?” He leaned to his drawer next to the bed and pulled out the familiar red vial.<br>\r\n<br>\r\n“Nah, I don’t want to get bigger and I also want you to be my big, muscular boyfriend to protect me like you said.” You blushed a little bit while Kyron cockily grinned and then he flexed his huge bicep in front of you. You stare at it for a little while. Before he was big but now he is monstrously ENORMOUS and you love it. You tried wrapped both of your hands around it but your hands can’t meet each other  and he is UNflexed. When he flexed, it’s like his abs but harder and bigger and it made you have a hard and painful boner again and your penis was tenting your pants and Kyron saw it.<br>\r\n<br>\r\n“Oooh, someone is satisfied with my result.” He cockily grinned again. <br>\r\n<br>\r\n“So, do you want to get funky?” His huge draconic cock is poking your leg and threatening to rip his underwear.<br>\r\n</span></div></div>",
            "created":1449199980,
            "id":2069831,
            "title":"Big change (again)"
        },
        "12211222":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Kyron leaned in and kissed you passionately but you broke the kiss and pushed him.<br>\r\n<br>\r\n“No, Kyron. It’s late now. I want to sleep.” You said groggily and you saw disappointment on Kyron’s face.<br>\r\n<br>\r\n“Okay. Good night.” He rolled off to the side and he spooned you with his huge body.<br>\r\n<br>\r\n“Good night, Kyron.”<br>\r\n<br>\r\n                             -------------------------------------------------------------------------------- ---------------<br>\r\n<br>\r\nYou suddenly woke up to a loud unrecognizable sound. Suddenly, you feel like something was missing. Kyron wasn’t on the bed anymore and it’s only 3 a.m. He shouldn’t be down the weight room right now, right? You started to question yourself. You went out of the bedroom to find him and saw one room that was lighting up. The door wasn’t closed completely so you can still see what is happening in there. What you saw shocked you. Sitting on the toilet was Kyron in all his naked glory, jacking off. His muscle shined like a golden statue with the sweat covering him. Veins snaking mostly on his arms that are jacking that huge fire hydrant making him even more defined and sexy. Even with both hands, he couldn’t even circle that thick and blue monster. Your own penis is getting hard again, pressing against the fabric. What you would give for to barge in there and just touch and feel those glorious muscle. But you remember that you wanted this relationship to move slow and that the reason why Kyron is jacking off is probably because you cockblocked him last night.<br>\r\n<br>\r\n“Oops.” You think yourself. Your train of thought was cut short by the loud moan coming from Kyron so you returned your attention to him. Now, he has one hand pinching his nipple with the other hand still running up and down that slick cock that has been leaking precum like a broken faucet. You could saw that there is already a large puddle of cum on the floor which is the amount that would take you about 2-3 orgasm to even match that puddle so his orgasm would release a prodigious amount of cum. Now, your penis is leaking precum more than it ever did, soaking your boxer. You looked at him again and he was close. He was breathing heavily and moaning, he leaned back and pointed his cock at the wall, then a string of cum erupted, making a loud sploosh on the wall. And then another and then after 6 or 7 string of cum, nearly painted the entire bathroom and himself with his seed, including my favorite face towel and you just noticed the cracked pieces which were your favorite cup. <br>\r\n<br>\r\n“Aw man!” You think to yourself. Kyron was sitting there, still running his hand up and down that blue pole and observed his accomplishment then he let out a loud sigh.<br>\r\n<br>\r\n“That was relaxing! Now I have to clean all of this up before he wakes up.” You were going to go silently back to your bedroom but you slipped on your own cum and fell. Kyron heard that and walk out of the bathroom to see you sitting on the floor, still hurts after the fall and he helped you stand up<br>\r\n<br>\r\n“Are you okay?” He pulled you up and noticed your wet boxer with the still hard cock poking on the fabric. Now, he understand what is happening.<br>\r\n<br>\r\n“Did you snooped on me while I am jacking off.” You know that that wasn’t a question and you blushed so hard, you looked like a tomato.<br>\r\n<br>\r\n“Yes” you muttered and then you saw Kyron smiled cockily and lead you inside the bathroom by your cock. However, when he just held your cock in his hand, you cummed, releasing your seed on your already wet boxer and some on Kyron's hand. He licked his hand cleaned of your seed like a hungry dog and say:<br>\r\n<br>\r\n“Delicious! You should let me drink straight from the tap next time.” He then wiped up some of his cum on his hard cock and hold it in front of you. <br>\r\n<br>\r\n“Try mine.” You leaned in and licked his cum like a puppy drinking his mommy’s milk. It smelled strong and tasted a little bit salty, tangy, and a bit of spicy<br>\r\n<br>\r\n“Wow, that’s weird.” You said because it actually like something that you really like<br>\r\n<br>\r\n“I know right. I think that is the side effect of the potion.” You looked at Kyron and saw his confident smile and you know that he purposely created that.<br>\r\n<br>\r\n“But it’s a tasty side effect. It can actually be a sauce you know.” You eagerly crouched down and suck his cock. You tried to fit his entire 15 inch cock into your mouth in your mouth and you failed so you just suck on the enormous cock head. Kyron went to sat down on the toilet again, but with you still eagerly suck his cock. You can’t believe that he just cum a huge amount and now he is still leaking precum. His cum is so addictive in a strange way. Kyron was moaning loudly, both of his hands didn't know what to do but to leaned on the toilet. <br>\r\n<br>\r\n“Where oh…did you le….ah… learn to do that….ah..?” Kyron asked you while he still lost in deep pleasure.<br>\r\n<br>\r\n“Um…um..” You shrugged your shoulders, even you don’t even know what you’re really doing but you’re glad he liked it. Suddenly, he use both his hands and push you down his cock. Your gag reflex started to kick in, your nose was overwhelmed with his strong masculine musk. You tried to move his hands to talk but he is too strong. He began to take on a different attitude.<br>\r\n<br>\r\n“Suck it, bitch! Please your master.” You think that the pleasure is getting to his head but you strangely liked this attitude and follow his lead. He began to press your mouth down to the base of his cock and he succeed. He stuff all of his 15-inch cock down in your mouth and hold your head in that position as he say:<br>\r\n<br>\r\n“I gonna fucking CUUUUUUMMMMM!!!!!!...” You were so overwhelmed with everything and you have a hard time breathing so you blacked out after that. Gallons of cum was about to shoot directly to your stomach however Kyron immediately pulled his cock out of your mouth which is still shooting a ginormous amount, even more than before while you slipped down on the floor. Completely coating the entire bathroom, him and you with his white cum. He leaned back, breathing heavily.<br>\r\n<br>\r\n</span></div></div>",
            "created":1455660420,
            "id":2105219,
            "title":"\"No, it's late now. I want to sleep.\""
        },
        "122112221":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Kyron is lying next to you",
                "Kyron isn't there"
            ],
            "content":"<div class=\"\"><div> <span>“That was awesome, wasn’t it?” He looked down at you and realizing you are not responding. He shakes you a little bit.<br>\r\n<br>\r\n“Hey! What’s wrong?” Realizing immediately what he had done so he started to do CPR on you. Luckily, you cough the cum out and started to breath again. He hugged you tight, both of your and his body was still sticky with cum.<br>\r\n<br>\r\n“Uh…What happened?” You regained consciousness and youlooked around and see that cum is dripping everywhere and realized that you must have black out. Man! Is Kyron potent or what. You think to yourself, then you looked to Kyron, his face was showing regret and shame.<br>\r\n<br>\r\n“I am so sorry…for doing this to you.” Kyron started to cry while he looked down on the floor, covering his face.<br>\r\n<br>\r\n“You didn’t do anything bad to me, you helped me regained consciousness.” You feel sad to see this big guy sobbing and you hugged him.<br>\r\n<br>\r\n“But I did that, I made you passed out.” He looked you in your eyes. His eyes were red from all the crying.<br>\r\n<br>\r\n“It’s okay, it was just one time. You didn’t hurt me.” You tried to console him.<br>\r\n<br>\r\n“But what if the next time, I did hurt you then I will never forgive myself. I promised you that I will protect you but I already broken that promise.” You got enough of that. You lifted his face up, wiped the tears off and kissed him passionately. You said to him:<br>\r\n<br>\r\n“Hey, get over this. Don’t imagine some illusional fake situation. You won’t hurt me and you will never hurt me. I hurt myself even more but I didn’t not cry about it. You created the potion to protect me and you did. You made me feel so special even without the potion. I am just so happy to have you as my friend and most of all my lover. You know why I know you can do it because you got this.” You lifted his arms up and try to make a flex. That made him smile and he flexed his bicep, making veins snaking all over it. <br>\r\n<br>\r\n“See, it is even bigger than my head. I can’t ask for more than that. You also got one more thing that makes me love you even more. This thing.” You take his hand and put it on his chest.<br>\r\n<br>\r\n“My pecs.” He say it with a goofy smile and he bounced it, making you drool.<br>\r\n<br>\r\n“No.. silly, it is your heart. I am actually think that the potion did something to your brain.” He was smiling from ear to ear now, completely over the sadness. He was even flicking his lips to prove your point.<br>\r\n<br>\r\n“The point is that you are the nicest and kindest person I have ever met. You always help people in trouble, like that time when the neighbor drops her groceries and you helped her to pick it up or when you and I were late to class but you still stopped to helped that poor janitor that lost his glasses and so many more. Especially, you have always been there for me too. When I was sick, you came to my house, carrying that chicken soup even though you say it doesn't cure the cold. Yeah, I still remember that.” Kyron started to giggle and you giggle as well. But you continued.<br>\r\n<br>\r\n“You helped me with all of my homework and you were there for me to take care of me like my mom. You are like a God’s gift to me and if you say that you don’t deserve me and we have to go through all of the cliché then let me just say this. You are kind, sweet and smart and now hunky and potent. You are literally everything good in one man. Don’t ever let anybody tell you anything different. Okay?” You can tell that he was flattered and he reluctantly agrees, knowing full well what you will do.<br>\r\n<br>\r\n“Okay.” He stand up first and pulled you up with one arm but you still crashed into the big wall of muscle anyway.<br>\r\n<br>\r\n“Are you okay?” He laughed and he immediately knows the answer when you licked the almost dried cum on his pecs. You looked up to him and said:<br>\r\n<br>\r\n“I am okay, Daddy.” You spoke in the most child-like voice, making Kyron laughed even harder and decided to play along.<br>\r\n<br>\r\n“Then now Daddy will take you to bed so he can clean up the mess, okay?”<br>\r\n<br>\r\n“Okay.” He then suddenly lift you off the ground and carry you like an actual baby while you was just sucking on his big nip. He then tucked you in bed and instead of a kiss on the forehead like what daddy do to his child, he gives you a kiss on the lips.<br>\r\n<br>\r\n“Good night, precious.”<br>\r\n<br>\r\n“Good night, daddy.” You turned back to sleep.</span></div></div>",
            "created":1455660480,
            "id":2105221,
            "title":"Continue"
        },
        "1221122211":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Suck it",
                "Leave"
            ],
            "content":"<div class=\"\"><div> <span>You slowly open your eyes and looked to your left.<br>\r\n<br>\r\n“Morning, sunshine.” Kyron say in his deep baritone of his.<br>\r\n<br>\r\n“Morning, beefcake.” You leaned in to kiss him. You exchanged saliva and you tasted a familiar taste.<br>\r\n<br>\r\n“Why do I taste your cum, Kyron?” He raised one eyebrow and look at you and then you remember.<br>\r\n<br>\r\n“Oh…So what do you want to do now, Kyron?” <br>\r\n<br>\r\n“I don’t know. What day it is today?” You looked at your phone and realized it is Monday. <br>\r\n<br>\r\n“Damnit, I have to go to work.” You quickly finish your morning routine and eat breakfast. You said goodbye to Kyron but he stops you and gave you the vial.<br>\r\n<br>\r\n“Just in case, okay.” He winked at you and you said thanks and ready to go to work.<br>\r\n<br>\r\nThe restaurant is packed today and you were working your ass off but nothing special really happens except for Bruce occasionally showing off his muscle through his tight chef clothes when you looked at him. You would think that he is flirting with you but you just erase that thought from your mind. Finally, You finished your work and you clocked out last because this was your turn to clean the place.<br>\r\n<br>\r\n“I can’t wait to see my hunky Kyron again!” You thought to yourself. However, on your way home, you needed to go to the bathroom and luckily there is one right where you were standing. “As they say, if you gotta go, you gotta go.” You went in despite of not liking public bathrooms but this one is different. It is clean and actually looks shiny. You went in to one of the stalls and relieve yourself. Then something caught your eye. There is a hole on the wall and you thought to yourself, could this be a glory hole. You open the cap to the hole and you heard someone from the other stall said in a gruff and deep voice:<br>\r\n<br>\r\n“Finally! Can you solve this now! I am so horny!” He rammed his cock right through the hole. As you see it, it is a long and thick green humanoid cock so it is probably from an Orc and you are guess that it is about 10 inches long and as thick as a beer can. It almost filled the entire hole. You think about for a while because you already have a relationship with Kyron and now if I do this then I would be untrustworthy to him. <br>\r\n<br>\r\n</span></div></div>",
            "created":1457514300,
            "id":2115024,
            "title":"Kyron is lying next to you"
        },
        "12211222111":{
            "author_id":"hoangrocky",
            "author_name":"Max-Dragon",
            "choices":[
                "Yes",
                "No, I want to go back to my Kyron"
            ],
            "content":"<div class=\"\"><div> <span>“Come on, I don’t have all day.” He said it angrily now so you think that it is just one time so you go for it. You kneel down and hold his thick cock with one  hand and ran up and down slowly. You can already heard soft moan from the other side, so you decided to kick it up a notch. You put it in your mouth. It is not as big as Kyron’s so you can fit it all in your mouth.<br>\r\n<br>\r\n“Holy shit! You fit in all in one go. Not many people can do that. Uh..” Your tongue was running all over that cock making the pressure build up even more. An idea popped up in your head. You reached out to your bag and took the red vial out. You remove your mouth from his cock and think about it for a while. Kyron gave it to you so you can protect yourself but now you think that he needs it more than me so “Should I use the entire vial and like a little bit.” You decided quickly that you are just going to use the entire vial. This would make the Orc over there so horny and muscular. One look at him will make everybody shoot immediately. You pulled out his foreskin to make like a place to hold the potion in so that he can absorb it and then you pour it in slowly.<br>\r\n<br>\r\n“Oh…you even brought massage oil that is goo….” The other side was starting to create more sounds. The potion you pour in was already absorbed by him and you threw the vial in the trash can. The first sound out fabric ripping filled the quiet atmosphere. “Shrrrippppp…..” His cock which is still in the hole starting to grow angry snaking veins, filling it with blood, making it bigger. You look as it thickens and lengthens. 12 inches, 14 inches, 16 inches… It is already longer than Kyron’s and it is still going. The ripping gets louder and his moan and groans get more bestial and deeper.<br>\r\n<br>\r\n“What did you do to me!” His voice drops at least 2 or 3 octaves making him have a super deep and sexy voice. You were just so aroused by all the growing, you cummed in your underwear a large load. Finally, the growing subsides. You looked at whatever you can see. His dick is now basically stuck in the hole now, and it looks painful. His cock is at least 20 inches if even more and it is as thick as a freaking 1 litter Coke bottle. The mushroom head even look scarier, it flared out even bigger than the rest and you don’t even know what to do anymore. His cock is so long now it is actually taking half of the stall that you are in and it is poking your chest, leaking precum all over your clothes. <br>\r\n<br>\r\n“Huh..huh…what did you do to me? You know what. I don’t care. Just worship my huge fucking dick now. I am so fucking horny after all of that.” He was still breathing heavily and I just obeyed him. The dick look so scary and enormous, you don’t even know what to do. You just tried to kiss the slit of the head while running both of your hands up and down that enormous Python. You can hear creaking sound and you look up to see that the cock is actually breaking the wall that it is between you and him. Then something amazing happen.<br>\r\n<br>\r\n“I can’t hold it. I have to CUMMMMMMMM……” He roared loudly, almost making you deaf. The torrent of cum was so strong that you have to move away from it so that you won’t get I hit by it but you still got a mouthful of his semen in your month and you swallow it. It still has a bitter taste to it but it has a sweet taste too, but not as addicting as Kyron’s. The torrent of cum actually almost knocked the the wall beside you over and his orgasm lasted for more than 2 minutes. His cock is still hard after all of that and he just broke a whole big enough now for his cock. His cum was like a small lake below now. <br>\r\n<br>\r\n“Wow, the potion do miracles I guess!” You thought to yourself.<br>\r\n<br>\r\n“Well, that was intense. Thank you for growing me! I have always wanted to have a huge body like this all my life. Can you come here to see me please?” He took his dick out off the hole while saying it with his new “normal” voice making me weak on my knees but do I want to see him. 50/50, but he wanted to and I am very curious to see who it is so I stepped out of my stall and then opened the stall next to me. What I see next shocked me.<br>\r\n<br>\r\n“Bruce. What are you doing here?” You have an astonishment expression on your face. Not noticing his other attributes.<br>\r\n<br>\r\n“I can ask the same thing about you!”<br>\r\n<br>\r\n“So you are gay?” You can’t believe that that is the first question that came from your mouth.<br>\r\n<br>\r\n“Yeah and how did you grow me?” He stood up in all his beautiful naked glory. His body is still covered with tattered clothes. His height is now about 7’ and he looks like he put on like about 85kg of pure muscle mass. His arms looks enormous, his biceps must be like 32 inches around unflexed or something. His thighs looks like a trunk of a 1000 year old tree and his calves is like diamonds refined year after year to create that. His 8 pack abs looks shredded and huge too, each one must be as big as a brick. His lats looks so wide with his shoulders, he actually has to shrugged to fit to the stall now and I think he is as wide as you are tall. Not to mention that one thing still remains the same, his waist. It looks thin compare to every humongous muscle. You wonder how it could support his upper body but that makes him look so much more handsome. Then you look down to the beast of them all his dick (which I have met personally) and his balls which look as bis as a fucking watermelon. No wonder he is so potent. Right now, you are drooling and Bruce noticed that.<br>\r\n<br>\r\n“Hey, stop ogling at my muscle and answer my question?” You snapped out of the trance and blushed when you looked at him. His face looks squarer and manliest. He looks a little bit angry but mostly curious. <br>\r\n<br>\r\n“Well, my boyfriend Kyron made a growth serum and he gave it to me but I don’t want it so I thought you need it more than me.” You blushed again when you said it and his expression softens a little bit.<br>\r\n<br>\r\n“Wait, you have a boyfriend. Tell me about him.” He took on a more gleeful expression now but you are not comfortable speaking to him in a state like this.<br>\r\n<br>\r\n“Can we discuss about that later, please?” You can’t stop blushing when you looked at Bruce’s beautiful sculpted body. <br>\r\n<br>\r\n“Okay, but like really thank you so much. I have dreamt about this for so long and you made it came true.” He hugged you with his sweaty and cum covered body but you don’t really care. You are just happy that you helped him. <br>\r\n<br>\r\n“I can’t believe it. The serum must be so effective because I look like this now.” He flexed his right arm and then his left area and he put it in front of you.<br>\r\n<br>\r\n“Touch it, feel it. You know you want to.” He said it with an even deeper voice while winking at you. You just put both your hands on the huge bicep. It is like as big as your head. You touch it and it feels hot and hard like steel. You tried to squeeze it.p but doesn't budge at all. You shoot another load in your underwear and Bruce clearly notice that. <br>\r\n<br>\r\n“Can’t contain yourself to your newest doings huh!” He grinned at you and he did the most muscular post making veins appears everywhere, snaking all over his body and making it even bigger. His cock is already hard and leaking precum again.<br>\r\n<br>\r\n“What about getting out of here? I feel so stuck in here.” You nodded but immediate said.<br>\r\n<br>\r\n“Hey, Bruce. Aren’t you still naked and you are as tall as a freaking Titan now so everybody is gonna see you if you went outside.” You looked out of the window and see it is night time now so he could sneak out with out getting spotted. <br>\r\n<br>\r\n“Okay, what is I just borrow this than.” He walked out of the stall and took the curtains and wrapped it around his cock, creating some kind of learns brief that Tarzan could wear but there is only one problem.<br>\r\n<br>\r\n“I can still see your hard cock through the curtains, Bruce. And that pink mushroom head too.” He looked down and blushed.<br>\r\n<br>\r\n“Well but we don’t have any choice do we?” You nodded and looked at your phone. It is already 9:00 P.M. And there is 6 missed calls from Kyron.<br>\r\n<br>\r\n“Shit, I have to call Kyron. He is probably worried sick for me.”<br>\r\n<br>\r\n“I know it is late and my house is kind of near hear so do you want to stay the night with me?”<br>\r\n<br>\r\n</span></div></div>",
            "created":1457514360,
            "id":2115026,
            "title":"The right decision?"
        },
        "15":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Chase the Tiger",
                "Angus the Bull",
                "Tyson the Rhino",
                "More"
            ],
            "content":"<div class=\"\"><div> <span><b>Tiger (Edit Later)</b>:<br>\r\n<br>\r\n<b>Jovial Bull</b>: Your P.E. teacher. A wild and happy bull who doesn't have a care in the world. You used to borrow his money for gambling, though you give that up long ago, but couldn't pay it back. Luckily, he accepted other type of payment too...<br>\r\n<br>\r\n<b>Aggressive Rhino</b>: A bully since high school and you are his favorite victim. It's unfortunate for you that he's got into the same college as you. But lately, he's been acting strange. Maybe you can use this to your advantage for your revenge or maybe something else...</span></div></div>",
            "created":1389848400,
            "id":1728346,
            "title":"Other"
        },
        "152":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "You take up his offer.",
                "You decline."
            ],
            "content":"<div class=\"\"><div> <span>You knock the door to your teacher's office. \"Come in\" a gruff voice said and you open the door. The cold air of the air condition hit your face as you enter the room. You shiver a bit, having just walk into the cold room after a hot day outside.<br>\r\n<br>\r\n\"Hi, Mr.Blake.\" you say meekly as you close the door behind you.<br>\r\n<br>\r\n\"Hey, there.\" 'Mr.Blake' turn around in his chair and glare at you. \"And I told you to call me Angus.\" The black bull is very large, even by bull standard. It's a wonder his chair hasn't collapse under his weight yet. Two white large horn stick out of his head and he usually has to bent down so his horn don't damage to doorframe. \"But nevermind. So you ready to pay it back yet?\"<br>\r\n<br>\r\n\"W-Well, about that...\" he lent you money a long time ago, a lot, and you couldn't earn that much to give it back. So you were avoiding him most of the time. And he decided to let you slipped for so long until today...<br>\r\n<br>\r\n\"No money again? Not a surprise, really.\" he sigh \"What should I do with you?\" you look at the floor feeling ashamed. <br>\r\n<br>\r\n\"Well, I recently thought about accepting another type of payment as well.\" He gropes his crotch and lick his lips. \"If you are up for it.\" you blush madly at his offer.</span></div></div>",
            "created":1396501200,
            "id":1772726,
            "title":"Angus the Bull"
        },
        "1521":{
            "author_id":"lyga",
            "author_name":"Lyga",
            "choices":[
                "Continue to serve him.",
                "Try to hide from him"
            ],
            "content":"<div class=\"\"><div> <span>After sometimes you decided to take up his offer \"Okay, I'll do it.\" <br>\r\n<br>\r\nHe snorts \"Excellent.\" You take a step back as he gets up, towering you by more than a foot with his massive body, and approach you. Soon your back is against the wall and his crotch is directly in front of your face. \"Go on.\"<br>\r\n<br>\r\nYou slowly unbutton his shirt, revealing his body. His black furred form is heavily muscled, showing off the prime grade A beef. Every muscle along his form reveals superb definition as veins bulge just underneath his skin. His arms are thick and massive as his biceps and triceps are pushing up to almost impossible lengths. As you admire his frame, his bulge begins to get bigger and bigger by the second.<br>\r\n<br>\r\nYou quickly pull down his pants and as soon as you did, his cock flick up and smack you in the face, he chuckles at this. You flinch a little, considering his dick is as hard as rock. Some of his pre got on your face when his shaft hit your face. You can see that his legs are also brawny and end with two large hooves. Lastly your eyes settle upon his gigantic throbbing cock leaking precum, thicker and longer than a wine bottle, you could probably use it as a bat.<br>\r\n<br>\r\n\"I-It's so big.\" you say in amazement as you wrap both your hands around it, getting a grunt from the bull. You always knew the bull was well-endowed judging from the bulge in his pants you saw in the class, but you never thought it would be this big.<br>\r\n<br>\r\n\"Heh, I get that a lot.\" he smirks and thrust his hip in your face. \"Start sucking already.\"<br>\r\n<br>\r\nYou nod as you hold it and slowly run your tongue along the underside, then stroke your hands up and down the shaft, earning a moan from him and a big shot of pre across the face.You try to put it in your mouth, it's so thick you can only get the head in. He start to thrust lightly but soon he grab your head and push to against the wall before thrusting viciously, ignoring your plea for him to stop. Putting his hands on the wall for support, he's grunting like a mad bull as he keep ramming his shaft down your throat.<br>\r\n<br>\r\nBefore you can't take it anymore, he shoves himself deep down your throat and unleashes a massive load of cum with a loud moo. Still thrusting wildly, he fills your belly full of his virile seed as your stomach bloat slightly. He pulls out, giving you a taste of his salty cum, before filling your mouth to the brim. He pull out of your mouth to paint your face with his semen before the torrent subsides.<br>\r\n<br>\r\nHe's panting hard and you are coughing from your air-lung being blocked for so long \"Heh, sorry. I couldn't control myself there. It felt so good.\" he grin. <br>\r\n<br>\r\n\"Do you *cough* always shoot this much!?\" you cough, still amazed by how much he produced in one orgasm. <br>\r\n<br>\r\n\"What? This is normal for me, and I just jerked off in the morning.\" he smirks. This is normal for him!? You can't imagine how much he will blow if he's pent up. \"So, are you up for next round?\"<br>\r\n<br>\r\n\"W-What are you talking about!?\" you are confused.<br>\r\n<br>\r\n\"Didn't I tell you? You let me use you 10 times in total, then we are even. And now only 9 left.\" You can't believe it. You've been tricked!<br>\r\n<br>\r\n\"B-But that's not fair.\" you complain.<br>\r\n<br>\r\nHe crosses his arm and glare at you with his scarlet eyes \"Well, considering the amount of money you borrowed, I should've charge you more, but I'm being generous here.\" he sneers.<br>\r\n<br>\r\nNot wanting to provoke the bull you give in \"Okay, okay. But not today, please.\"<br>\r\n<br>\r\n\"That's alright by me. Now if you don't mind I got to take care of this.\" he gestures at his cock which is still rock hard. Jeez, he's still horny even after those load? He's real potent bull.<br>\r\n<br>\r\nEven before reaching the door, the bull's already stroking his cock in his chair. \"Oh, and lock the door on your way too.\" he grunts.<br>\r\n<br>\r\nYou roll your eyes and lock the door as you exit. As soon as you are about to leave, you hear a moo, follow by a loud splash. He already shot his second load!? You shake your head in disbelief. Then you notice that you are covered in bull's spunk. You wonder how will you ever going to get rid of the smell. You are lucky no one is around. You sigh as you enter the shower room to wash up.</span></div></div>",
            "created":1396846800,
            "id":1774551,
            "title":"Payment Due"
        },
        "154":{
            "author_id":"silverstag82",
            "author_name":"SilverStag82",
            "choices":[
                "Brendan the Otter",
                "Cooper the Fox",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span><b>Gallant Otter</b>: You drop your suitcase at the airport and your luggage falls out. He's the only one who stops to help out. You find out he's on the same flight as you in the seat across the aisle. You're both taking a tour of Europe and you can't help but ask the dashing young man to travel with him...<br>\r\n<br>\r\n<b>Frisky Fox</b>: He sits down next to you at a bar and insists you join his good time. You can't handle your alcohol as well as he does, unfortunately...</span></div></div>",
            "created":1407992400,
            "id":1841605,
            "title":"More"
        },
        "1541":{
            "author_id":"silverstag82",
            "author_name":"SilverStag82",
            "choices":[
                "Awesome! Yes!",
                "Sorry, no.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your tail twitches nervously as you walk through the crowded, noisy airport. This will be your first trip alone, and you are understandably anxious. You are a 19-years-old chocolate lab taking a summer tour of Europe. You have travelled abroad before, but always with your parents or some other form of chaperone. This summer, you will be all by yourself overseas. <br>\r\n<br>\r\nWhile contemplating your isolation, you trip over your own feet and fall to the ground, your carry-on luggage dashing against the ground and spilling its contents all across the airport floor. You scramble to recover your lost articles before the throng of uncaring business people and hassled families trample your stuff.<br>\r\n<br>\r\nSuddenly, a hand begins assisting you. You look up and find yourself facing the most handsome otter you've ever seen. He's taller than you with the frame of a rugby player: big and broad. His eyes meet yours and you can't help but stare into the two pools of tropical blue. You shake yourself out of your stupor and thank him.<br>\r\n<br>\r\n\"No problem, mate,\" his voice is a soothing baritone. \"Looked like you could use some help.\"<br>\r\n<br>\r\n\"Yeah, I wasn't paying attention. Too nervous, I guess.\"<br>\r\n<br>\r\n\"Never been on a plane before?\" he asked.<br>\r\n<br>\r\n\"Not by myself,\" you admit. <br>\r\n<br>\r\n\"No worries,\" he assured you, \"It can be a bit scary your first time.\" He handed you your ticket, which had slipped beneath a bench. \"You're traveling across Europe?\" he noticed.<br>\r\n<br>\r\n\"Yeah, just the central ones: Spain, France, Germany, Switzerland, Italy. My parents are visiting family in Sicily next month, so I'm going ahead of them and meeting them there.\"<br>\r\n<br>\r\nYou really liked this guy. Not only was he sexy, he seemed like a really thoughtful person as well. If you had the time, you would've liked to have found out if he was gay. You wouldn't mind snuggling up to him when you got home.<br>\r\n<br>\r\n\"Have you been to Europe before?\" he asked as you packed the rest of your things away and began walking towards security. <br>\r\n<br>\r\n\"Only once, when I was ten. I only remember some stuff, like the Eiffel Tower and my aunt's house in Sicily. What about you?\"<br>\r\n<br>\r\n\"Me? Lots of times,\" he responded. \"I'm an architect and the firm I work for does a lot of projects in Germany. This year I figured I'd make a holiday of it, so I'm touring Europe as well. In fact, I think I saw we're on the same flight.\"<br>\r\n<br>\r\nYou each pull out your tickets and see that not only are you on the same plane, but your are sitting right next to each other across the aisle. You're thrilled! Maybe if you're lucky you can get to know him better and find out if he's interested in you. <br>\r\n<br>\r\nAfter you pass security, you sit down next to him at the terminal. As you wait to be called on to board, you continue talking to the handsome otter. <br>\r\n<br>\r\n\"I don't think we met properly,\" he mentions. \"What was your name?\"<br>\r\n<br>\r\n\"Garrett,\" you tell him. \"And yours?\"<br>\r\n<br>\r\n\"Brendan.\"<br>\r\n<br>\r\nThe two of you continue talking the whole way onto the plane and throughout the flight. It doesn't take long for the two of you to become close, sharing family stories and talking about shared interests. He seems like the perfect guy to you, and you want more than anything to ask him out. But you know that would be awkward; you've only known the guy for six hours and you don't even know if he's gay. Besides, he probably wasn't taking the same route you were, so you'd just part ways at the airport and never see each other again. You had already put the thought of any chance with him behind you when the conversation turned in your favor. <br>\r\n<br>\r\n\"It must be nice to get to spend some time with your family,\" he replied. You had been talking about family vacations and relatives you hadn't seen in a while. \"My parents are still uneasy about me coming out. They try to be supportive, but it just ends up awkward. I haven't even talked to them since Christmas.\"<br>\r\n<br>\r\n\"You're gay?\" you blurt out unintentionally, your optimism peaking so high you can't stop yourself. <br>\r\n<br>\r\n\"Yeah, that's not a problem is it?\" he asks, suddenly hesitant.<br>\r\n<br>\r\n\"No, no,\" you quickly assure him. \"I'm gay, too. It's just that I didn't expect you to be.\"<br>\r\n<br>\r\n\"Oh!\" he relaxed again. \"Yeah, it can be easy to forget you're not alone! So, you're family's alright with your sexuality?\"<br>\r\n<br>\r\n\"Mmhm,\" you nod. \"It's not like they want me to advertise it, but they don't shy away from it either.\"<br>\r\n<br>\r\nYou each talk about how you found out. Brendan tells you how he found himself eyeing up his teammates at swim practice and eventually came out to the senior captain who became his first boyfriend. You recounted your first time with your neighbor after hitting puberty. The two of you experimented with each other and gave each other relief, but he eventually decided he was straight and you decided you weren't. You spent the rest of the flight recounting old relationships and what they taught you. You didn't even realize you had landed when the stewardess gave instructions on leaving the plane. <br>\r\n<br>\r\n•••<br>\r\n<br>\r\nWhen you exited the gate, Brendan pulled you aside. You really hoped this was going where you thought it was going.<br>\r\n<br>\r\n\"Hey, Garrett, I really enjoyed being with you today and I was kinda hoping I could get to know you better. Would you be interested in traveling with me?\"<br>\r\n</span></div></div>",
            "created":1408510800,
            "id":1844438,
            "title":"Brendan the Otter"
        },
        "15412":{
            "author_id":"sircrazymutt",
            "author_name":"SirCrazyMutt",
            "choices":[
                "Brendan calls you back",
                "Brendan doesn't call at all."
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, no. I can't, but I really want to.\" You have no idea why you just said that, cause you'd love to travel with him. \"Oh ok, I guess I'll see ya around then?\" He asks you,\"What?! No! We won't just each other around!\" \"What? Why not?\" \"Because here is my phone number\" you tell Brenden giving him your number. \"Oh, so we have a trickster on our hands huh?\" \" Hehe. Ya.\" You confess because that is why you so no. \"Call me tonight and maybe we can hang out.\" \"Ok.\"</span></div></div>",
            "created":1503665400,
            "id":2374473,
            "title":"Sorry, no."
        },
        "1543":{
            "author_id":"theswordsman",
            "author_name":"TheGamerSwordsman",
            "choices":[
                "Ken the Skunk.",
                "Zack the Raccoon.",
                "More options."
            ],
            "content":"<div class=\"\"><div> <span><b>Protective Skunk</b> One night when you were walking home from the movies you almost get mugged by a random thug. Thankfully a lone police officer is able to scare the mugger away. And after he makes sure you're safe he offers to escort you back to your home. But along the way you soon begin to wonder if this well muscled skunk might be the man of your dreams?<br>\r\n<br>\r\n<b>Bodybuilding Raccoon</b> A friend of yours who was two grades above you back in high school wants you to meet him at a local gym. Upon doing so though having causing you to see that the former jock was now attempting to become a pro bodybuilder. And even more surprising is that the heavily muscled raccoon wants you to come along with him when he heads to his first competition. Which only causes you to wonder will you and he finally end up together like you've always wanted back in high school.<br>\r\n<br>\r\n(Author's Note: Just wanted to let everyone know that no mattter which option you choose please be sure to keep the main character as a human. ...If that's not too much to ask of course.)</span></div></div>",
            "created":1500086880,
            "id":2353483,
            "title":"More Choices."
        }
    },
    "info":{
        "author_id":"lyga",
        "author_name":"Lyga",
        "brief_description":"Date an anthro of your choice.",
        "created":1389868860,
        "description":"<td align=\"left\" class=\"norm\">You are a gay male teenager. You are currently in holiday and your life are about to change when you meet the anthro of your dream.</td>",
        "id":1972185,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1503666360,
        "modified":1503666360,
        "pretty_title":"Anthro Story"
    }
}