{
    "chapters":{
        "1":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Eliot ",
                "Carla",
                "Jordan",
                "Kim",
                "Other girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Please pick a girl to fatten up.</span></div></span></div>",
            "created":1352696400,
            "id":1466119,
            "title":"Pick a girl"
        },
        "11":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "She has all ways wanted to be fat",
                "She has always been fat",
                "Force feed",
                "J.d wants her fat",
                "Other choices "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How dose she get fat?</span></div></span></div>",
            "created":1352696400,
            "id":1466129,
            "title":"Eliot "
        },
        "112":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "170-239",
                "240-344",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fat is she?</span></div></span></div>",
            "created":1358212740,
            "id":1508885,
            "title":"She has always been fat"
        },
        "1123":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "350-499",
                "500-999",
                "Even bigger."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much bigger?</span></div></span></div>",
            "created":1358212860,
            "id":1508889,
            "title":"Bigger"
        },
        "11233":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1,000-1,499",
                "More fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this?</span></div></span></div>",
            "created":1358213040,
            "id":1508892,
            "title":"Even bigger."
        },
        "112332":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1,500-19,999",
                "Even more fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this fat enough?</span></div></span></div>",
            "created":1358213220,
            "id":1508897,
            "title":"More fat"
        },
        "1123321":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Now.",
                "Later."
            ],
            "content":"<div class=\"\"><div> <span>Eliot was born into a very rich family and was very spoled, she got any thing she wanted cloths, jewelry, and money but none of those things made her as happy as food! Despite her mothers nagging about never getting fat, she was always eating! Her favorite food was, well she didn't have a favorite kind of food she loved to eat out of any food group even fruits and vegetables, which is normally healthy except when you eat them in excess which she did regularly! Even when she was in school she was eating, she was even served a extra large lunch, that her father had to pay a lot of money for the school to alow those things, and because of her constant gorging by the time she got a job at a hospital called sacred heart, she weighed 985 pounds, it was at this job where she met J.D and after more then eight years of on again off again dating they got engaged and on their wedding day she weighed 2,955 pounds, and now with the combined money she was receiving from her dad, her job and J.D she was now growing fatter and faster then ever before!<br>\r\n<br>\r\nNow when dose the story start?  </span></div></div>",
            "created":1358214900,
            "id":1508926,
            "title":"1,500-19,999"
        },
        "11233212":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "When she starts working at the new sacred heart.",
                "After she has her kid."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then when?</span></div></span></div>",
            "created":1358291160,
            "id":1509325,
            "title":"Later."
        },
        "114":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Two hundred more pounds. ",
                "Five hundred more pounds. ",
                "As big as you want me!"
            ],
            "content":"<div class=\"\"><div> <span>Eliot got up one morning and started to sit up.Eliot looked down and saw that her body had changed.\"Ever since I moved in with J.D a week ago I've gained a lot of weight.All week he's been cooking so much food and he'd  feel so bad if I didn't eat it all.\"Eliot stood up and walked into the bath room and stood on the scale and saw it light up as 358 pounds.\"Oh my god I'm a cow!\"Eliot then walked out of the bathroom went down stairs and into the kitchen.\"Good morning beautiful I was just about to bring you breakfast in bed.\"Eliot looked around and shaw three trays piled high with food.One tray had five bowels of cereal the second had bacon and three types of eggs and the third had every kind of breakfast pastry imaginable!\"J.D I know you worked really hard on this but don't you think I've gotten fat?J.D?J.D!\"Eliot yelled sapping J.D out of a day dream.\"And that's why you never give a octopus a drum set!\"Said J.D in a summing up manner.\"J.D I'm not kidding I've gotten really fat!\"Eliot said with angry tone.\"Eliot I'll always love you no mater how big you are.\"Said J.D.\"Really?\"Asked Eliot.\"Really and to be honest I kind of like you bigger that's why I've been feeding you so much!\"Said J.D.Well if you really want me bigger I'd be glade to put on some weight for you!\"Eliot said.\"really how much?\"          </span></div></div>",
            "created":1352869200,
            "id":1467681,
            "title":"J.d wants her fat"
        },
        "1143":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "To stop because she was full",
                "Eat the rest of what J.D prepared  ",
                "Finish the the rest of the food then go to a all you can eat buffet"
            ],
            "content":"<div class=\"\"><div> <span>\"As much as you want me to!\"Eliot said in a seductive voice while rubbing her belly.\"I'll get the food you go get back in bed so I can feed you.\"Eliot then ran back upstairs and took of her pajamas bra and panties and put on her tightest pear of under wear shirt and pants.\"J.D will love to see me pop right out of these.\"Eliot then sprawled her self across the bed in her sexiest position and waited for J.D to bring her the food.J.D then came in the bedroom and saw Eliots clothes hugging her curvy fat covered form made his mouth water.\"Like what you see?\"Asked Eliot while rubbing her belly.\"Well are you going to feed me or are you just going to stare?\"J.D then sat down and started to spoon feed Eliot the cereal.On the third bowl the buttons on Eliots blouse and pants had popped of allowing her fat to spill out.After the fith bowl Eliot wanted.....   <br>\r\n </span></div></div>",
            "created":1352869200,
            "id":1467689,
            "title":"As big as you want me!"
        },
        "11433":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Some of everything ",
                "More choices "
            ],
            "content":"<div class=\"\"><div> <span>After Eliot had eaten all the food her pants had ripped along the sides to allow her legs and butt room to grow.Her bra and panties had also become veary small the former had popped of a while ago but her panties (more of a thong now) hand managed to stay in one piece.\"J.D I'm still hungry can we go out to eat?\"Eliot said while rubbing her belly.\"Of course we can and I know just the place but your going to need to put on some new clothes.\"J.D said while gesturing towards the tattered remains of Elliot's clothes.Eliot then got up and started to get dressed she put on a blue half shirt a red skirt and aBlack belt that had a gold buckle it was two sizes too small when she bought it before she started to gain now it was sixteen sizes to small turning her skirt into a mini skirt and her half shirt into a bra leaving her belly on full display.\"Okay J.D I'm ready.\"Said Eliot as she started to walk to the car J.d started to drive to the buffet when they got their Eliot picked up her tray and got ......... </span></div></div>",
            "created":1353387600,
            "id":1471816,
            "title":"Finish the the rest of the food then go to a al..."
        },
        "114332":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Ten of every thing",
                "Even mor choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices </span></div></span></div>",
            "created":1353387600,
            "id":1471818,
            "title":"More choices "
        },
        "1143322":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Fiffty of every thing",
                "EVERYTHING"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices </span></div></span></div>",
            "created":1353387600,
            "id":1471819,
            "title":"Even mor choices"
        },
        "11433222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Reached 700 ",
                "Ran out of food"
            ],
            "content":"<div class=\"\"><div> <span>Eliot started to pile up food tray after tray until there was no more food to take!\"Mmmm this is so good!\"Eliot said while taking a bite out of a twenty pound burger.Once all the burgers were eaten Eliot had gained the weight of the burgers a hundred pounds!Her skirt had long since ripped but the rest of her of her cloths were still In one piece!\"Wow Eliot you look like your at least four hundred pounds now!\"J.D said.\"And I'm just getting started I'm not going to go home until I'm seven hundred or I run out of food wich ever comes last!\"Said Eliot while rubbing her belly.Eliot started to eat again but soon she?</span></div></div>",
            "created":1353387600,
            "id":1471873,
            "title":"EVERYTHING"
        },
        "114332221":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "J.D. manages to get Elliot up and moving.",
                "J.D. pulls her up onto her feet, but she is unable to stand and fall back down."
            ],
            "content":"<div class=\"\"><div> <span>“Ugh, how’m I doin’, J.D.?” Elliot asked as she rubbed tightly stuffed gut in an attempt to soothe it.<br>\r\n<br>\r\nShe had pack her stomach with so much food that all her fat rolls had been ironed out into on flabby bulge. And it was a big bulge, just sitting down, her stomach had grown so large that it was almost touching the floor!<br>\r\n<br>\r\n“Well, you’re defiantly past seven hundred pounds by now.” J.D. replied calmly.<br>\r\n<br>\r\nElliot arched an eyebrow. “Y’know, most guys who get to see their fantasies fulfilled right in front of them are a little more excited. Yet you’re acting really tame, especially for you seeing as you’re normally all about fantasy.”<br>\r\n<br>\r\n“Oh, I’m excited alright, I just don’t want Little J.D. to get as excited in public. If you catch my drift…”<br>\r\n<br>\r\n“Ah, I get ya, well then, how about I skip dessert so when can go home and relieve some of that excitement?”<br>\r\n<br>\r\nIt didn’t even take a full second for J.D. to be up out of his own seat and next to Elliot. “Oh goody!” He said in excitement.<br>\r\n<br>\r\n“My friends are right; you are the girl in our relationship.” Elliot allowed herself to laugh a bit at her own joke before she tried to get up from her seat. Emphasis on tried. Elliot had grown so big and so logic defyingly fast, that she didn’t have the strength to lift herself. After struggling against her girth for a full minute, she had become to tiered to continue. “Uh, J.D., can I get a little help?” She asked, holing her flabby arms out for J.D. to grab, which was exhausting in itself because of how heavy they had become.<br>\r\n<br>\r\nEager to return home, J.D. grabbed her arms and be began to pull hard, but he was never known for his upper body strength…or any strength whatsoever.</span></div></div>",
            "created":1393896360,
            "id":1755100,
            "title":"Reached 700 "
        },
        "115":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Alternate univers where being fat is good ",
                "Eliot catches a disease that makes her gain weight",
                "Another choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Somthing else?</span></div></span></div>",
            "created":1352696400,
            "id":1466133,
            "title":"Other choices "
        },
        "1152":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Go home and eat",
                "Go to burger king",
                "Go to a all you can eat buffet "
            ],
            "content":"<div class=\"\"><div> <span>Eliot was at work one day treating a patient who had flu symptoms and had also gained a lot of weight.\"Hi Carrel I got your test results back and we still can't figure out what's wrong with you.\"said Eliot.\"That's *sniff* ok your a good doctor you will figure it out.\"Said carel.\"That's the thing since we can't find any thing wrong with you and your symptoms aren't severe your incurrence won't cover your stay so were discharging you.I,m sorry.\"Apologized Eliot\"It's ok I'm sure it will go away over ti-ti-achoo!\"Carel sneezed all over Eliot!\"Oh my go I'm so sorry!\"Said Carel.\"It's okay it comes with the job.\"Eliot then walked out of the room and started to walk home when she started to feel hungry and decided to? </span></div></div>",
            "created":1352696400,
            "id":1466139,
            "title":"Eliot catches a disease that makes her gain weight"
        },
        "11523":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Go home she's ate enough ",
                "Eat more still to hungry "
            ],
            "content":"<div class=\"\"><div> <span>Eliot decided to go to a all you can eat buffet.She walked in and paid for her meal in advance grabed a tray and walked up to the buffet table.\"Hmm it all looks so good I don't know what to get.\"then Elliot's stomach started to rumble and hurt because it was so empty.\"I guess that I'll just get some of everything.\"she then started to pile food up on her tray she got so much that she needed four trays to carry it all along with four 12ounce glasses of full fat milk!\"Mmmm this looks so good I guess I'll start with the ice cream don't want it to melt.\"Eliot then started to eat what was called the belt buster special.It had vanilla chocolate and strawberry flavored ice cream twelve scopes each flavor it was covered it two bottles worth of chocolate sauce ten scopes of sprinkles two cans of whipped cream five hole bananas and fifty candy cherries!As Eliot began to eat she noticed her dress started to get tighter but all she cared about was satisfying her hunger!After a minute the ice cream did what the name implied her belt had broken but she hadn't even eaten 1% of the ice cream and some how she was stil hungry!\"Mmmm so good!\"said Eliot as she continued to eat.After a hour and a half she finished the ice cream. Eliot looked down and saw she had gained weight she estimated she was a hundred pounds heavier then before she stared eating but she was still so hungry!Eliot decided to?  </span></div></div>",
            "created":1352696400,
            "id":1466150,
            "title":"Go to a all you can eat buffet "
        },
        "115232":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "The same order I'm going to need some brain food if I'm going to figure this out",
                "Triple that order I want to figure this out fast"
            ],
            "content":"<div class=\"\"><div> <span>Eliot decided to eat the rest of her food because she was still to hungry to go home.\"Ugh I've gained so much weight but I,m still so hungry.I guess I should keep eating till I'm full.\"Eliot then started to eat the rest of her food.After a hour she was done.\"Ouff that was so good I cant believ it!\"said Eliot whil rubbing her belly but then she realized her dress was so much tighter and her belly felt so much bigger she looked down and saw she had gained so much weight she couldn't guess how much she gained but was still hungry!\"Oh this isn't good whats J.D going to think?!This can't be happening I couldn't have gained this much weight in such short time and I shouldn't stil be hungry.I've got to get home and find out what's hapining to me!?\"Eliot started to stand up but couldn't because of all the weight.After ten minutes she finally managed to stand up she started to walk out when her dress ripped along i'ts sides allowing her many lovehandles to spill out  thankfully she was still wearing her lab coat so no one noticed except for her.\"Frick on a stick with a brick!\"As she was about to walk out when the cashier asked if she wanted anything else.Eliot thoght for a second and said she wanted?</span></div></div>",
            "created":1352696400,
            "id":1466169,
            "title":"Eat more still to hungry "
        },
        "1152322":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Not go away",
                "Get worse "
            ],
            "content":"<div class=\"\"><div> <span>\"I'll be right back I haven't had all I can eat yet.\"Eliot took twelve trays and started to pile food onto them then walked up to the chasheir and had him box and bag all the food.She then walked out of the buffet and got in her car and tried to buckle her seat belt but couldn't so she had to lower her seat.After that she began to drive home when she got thear she went inside and put her food in the fridge for later.She then sat down in front of the computer and took a page out of J.D's play book and googled her Syptumes and her search came up as gainers syndrome where the Pearson with gainers syndrome will never get full and they will gain ten time the normal amount of weight they normally would.Eliot kept reeding and found out that is would      </span></div></div>",
            "created":1352782800,
            "id":1466782,
            "title":"Triple that order I want to figure this out fast"
        },
        "12":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "She has always wanted to be fat.",
                "She has always been fat.",
                "Force fed.",
                "For love.",
                "Other Choices. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How should she get fat?</span></div></span></div>",
            "created":1354856400,
            "id":1483391,
            "title":"Carla"
        },
        "122":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "170-239",
                "240-344",
                "Bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How fat is she</span></div></span></div>",
            "created":1354856400,
            "id":1483474,
            "title":"She has always been fat."
        },
        "1223":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "350-499",
                "500-999",
                "Even bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much bigger?</span></div></span></div>",
            "created":1354856400,
            "id":1483476,
            "title":"Bigger"
        },
        "12233":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1000-1499",
                "More fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about this</span></div></span></div>",
            "created":1354856400,
            "id":1483477,
            "title":"Even bigger"
        },
        "122332":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1500-19,999",
                "Even more fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this fat enough</span></div></span></div>",
            "created":1354856400,
            "id":1483478,
            "title":"More fat"
        },
        "1223322":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "20,000-99,999",
                "That's tiny more fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This one then</span></div></span></div>",
            "created":1354856400,
            "id":1483479,
            "title":"Even more fat"
        },
        "12233222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "100,000-999,999",
                "No it's not big enough "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this big enough for you?</span></div></span></div>",
            "created":1354856400,
            "id":1483482,
            "title":"That's tiny more fat"
        },
        "122332222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1,000,000-87,000,000,000,000",
                "Thats tiny I want more fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about this?</span></div></span></div>",
            "created":1354856400,
            "id":1483483,
            "title":"No it's not big enough "
        },
        "1223322222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "0.9-11 sextillion tons",
                "Only planetary size come on I want more fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Planetary size?</span></div></span></div>",
            "created":1354856400,
            "id":1483485,
            "title":"Thats tiny I want more fat"
        },
        "12233222222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1 trillion trillion trillion tons",
                "Boring "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Galactic size.</span></div></span></div>",
            "created":1354856400,
            "id":1483486,
            "title":"Only planetary size come on I want more fat"
        },
        "122332222222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Universal size? 1 trillion trillion trillion trillion tons.<br>\r\n</span></div></span></div>",
            "created":1354906380,
            "id":1483490,
            "title":"Boring "
        },
        "1223322222222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Fine but only because she can't Possibly Be any fatter.",
                "Or can she?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Multiverse all universes and the space between them are linked together by Carla's fat<br>\r\n </span></div></span></div>",
            "created":1354906620,
            "id":1483491,
            "title":"No"
        },
        "12233222222222":{
            "choices":[
                "Okay, I guess that's fat enough",
                "Fatter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carla's fat spills out into multiple dimensions, causing her to take up the entirety of all space everywhere with her infinite obesity.</span></div></span></div>",
            "created":1354914480,
            "id":1483526,
            "title":"Or can she?"
        },
        "125":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Alternate universe where all females are fat.     ",
                "Catches a disses that makes her gain.",
                "Other choices. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Something else?</span></div></span></div>",
            "created":1354856400,
            "id":1483393,
            "title":"Other Choices. "
        },
        "1251":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Turk",
                "Turk and Izzy",
                "Eliot maybe? ; D"
            ],
            "content":"<div class=\"\"><div> <span>Carla was at the hospital cafeteria eating her lunch wich was composed of five extra large burgers that had in order a bottom bun, a patty, three slices of cheese, french fries,ten strips of bacon, ketchup, mustard, mayo and a bun and continued the pattern for two more layers! Her meal also included five large servings of fries, six pizzas, thirty chicken nuggets, three large milk shakes and for dessert one large triple layerd chocolate cake! After she finished she went back to the nurses station where she sat down in her twelve chairs grabbed herself a box of doughnut's and started snack on them while she worked. By the time Carla was ready to take her dinner break she had finished a dozen boxes of doughnuts! When she got to the cafeteria she ordered three large plates of pasta, three large chicken Greek salads, two bowls of countrie beef soup, four five inch stakes, two full racks of ribs, five scoops of mashed potatoes with gravy, 6 large bolws of rice, three two liter bottles of soda and once again for dessert a large triple layer chocolate cake! Hours later Carla went home and the house was empty of people except for herself so she decided to do what she always dose when she is bored. Carla walked into the bath room and steeped on the scale and watched it spin until it landed on 1,389 pounds! Carla then took of her shirt and began to play with her many roll of fat when she heard th door open and it was........ </span></div></div>",
            "created":1354856400,
            "id":1483420,
            "title":"Alternate universe where all females are fat.     "
        },
        "12513":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "1,859 pounds Eliot's bigger.",
                "1,134 pound's Carla's bigger."
            ],
            "content":"<div class=\"\"><div> <span>\"Carla I'm home!\" Eliot said as she walked into the house and into the bathroom to see Carla playing with her belly. \"That looks like fun can I play to?\" \"Yes you can there is plenty of room!\" Eliot then walked over to Carla and started to kneed her many folds of fat sliding hand under and In-between her fat roll and as her hand started to drift upward she eventually made it to Carla's boobs and Eliot started to squeeze and weigh them with her hand's. \"Now let's see that butt!\" Carla then turned around and pulled her pants down to reveal her massive ass each ceeck twelve feet wide! Carla then did booty dance displaying her wide ass in all it's glory. \"Now lets have some fun with your body!\" Carla then took of Eliot's shirt and pants and watched as Eliot steeped on the scale and when the needle stoped it read......  </span></div></div>",
            "created":1354908720,
            "id":1483500,
            "title":"Eliot maybe? ; D"
        },
        "125131":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "Carla is now as big as Eliot ",
                "Carla's now bigger then Eliot."
            ],
            "content":"<div class=\"\"><div> <span>It read 1,859pounds! \"Eliot your huge!\" Carla said as she started to lift up Eliot's belly then dropped it and watched it jiggle. She then grabb Eliot's boobs with both hands and started to squeezed them and falt as her fingers sank and the fat go in between the space of each finger and as Carla continued to fondle Eliot's boobs Eliot started to play with Carla's. \"Mmmm Eliot how much do your boobs weigh they're so big and heavy.\" Carla said while she continued to grab at Eliot's boobs. \"Last I checked they weighed two hundred and fifty pounds each! What about you? Eliot asked. \"Wow you have a five hundred pound rack while mine are just a hundred pounds each a total of 200.\" Carla said as both herself and Eliot's hands moved lower to the belly area. \"And this belly there has to be at least seventeen roles here \" Carla then shock Eliot's belly for emphases. \"Yeah but you have a lot to it looks like you have twelve with a thirteenth one on the way!\" Eliot then grabed Carla's ass with both hands and held it tight. \"And this butt so soft and yet so firm how many chairs dose it take to hold it up?!\" Carla then grabbed Eliot's ass and started to sway it from side to side. \"It takes up twelve one for every two feet wide it is!\" Then the door bell rang. \"Who's there?\" Carla and Eliot then put their clothes back on and went to the door. \"Pizza guy! Now could you hurry up and open the door this is heavy!\" Carla then opened the door. \"I didn't order any-\" Eliot then cut of Carla. \"Actually I did. I wanted to put on some weight tonight!\" Eliot said as she took some of the pizza boxes. \"All right I've got 50 extra large pizzas with extra everything on them, 200 cheesy breed sticks, 20 orders of hot wings and 50 two letter sodas that brings your total up to 50 bucks!\" Eliot then handed him the money. \"Wow you really jacking up the prices aren't you!\" Eliot the closed the door and the she and Carla started to eat and when the were done........         </span></div></div>",
            "created":1354931100,
            "id":1483648,
            "title":"1,859 pounds. Eliot's bigger."
        },
        "1251312":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "3,143 pounds.",
                "More then 2 tons"
            ],
            "content":"<div class=\"\"><div> <span>When all the food was gone carla had eaten much more food then Eliot and had surpassed Eliot in weight who was now 2,374 and could barley move. Her face had many fat chins her boobs now weighed 300 pounds a piece. Her belly now had 22 fatty rolls that jiggeld when she made the slightest movement wich was all supported by her massive ass and thighs her ass was 24 feet wide and her thighs were just as thick at there widest. But she was no match for Carla who weighed......<br>\r\n </span></div></div>",
            "created":1355031360,
            "id":1484415,
            "title":"Carla's now bigger then Eliot."
        },
        "12513122":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "I think I'm big enough but you could be bigger!\" ",
                "I think we should be even bigger then you are now!\""
            ],
            "content":"<div class=\"\"><div> <span>Carla who was 5,912 and could hardly move at all! Carla's boobs now out weighed her old 1,389 pound self at 750 pounds each! Her stomach now had 58 fat folds that coverd her belly that all sat on top her massive ass each cheek was 48 feet wide! \"Carla yourmassive i cant believe you gained this much!\" Eliot said as she laid down on Carla's belly and started to play with it. \"It's probably because you kept ordering more!\" Carla said as she pointed to all the empty boxes in the folds of her fat! \"Yeah but aren't you glad I did? Don't you love the feeling of all this fat on your body?\" Eliot said as she rubbed carlas fat fold together. \"Yeah it dose and the way your fat feels on mine is heavenly and think how great it will feel when you the same size as me if not even bigger!\"<br>\r\n\"Yeah about that I already orderd more pizza but.......... </span></div></div>",
            "created":1355033880,
            "id":1484452,
            "title":"More then 2 tons"
        },
        "125131222":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "The next day.",
                "The next week."
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should be even bigger then you are now!\" Eliot said as she climbed of Carla. \"But you can barely able to move now how are you going to go to work I mean I only went to work because I liked to not because we needed the money but if you can barely move then you can't go to work then we won't have any money for food and we realy like food!\" Eliot then picked up the phone and started to make a call. \"It's okay my dad said that if I ever got to fat to work he'd pay for every thing I want so I'm going to call him then work and then take out and besides don't you want more of this!\" Eliot then started to sway her ass from side to side while she grabbed her belly and started to shake it up and down causing her belly and boobs to fly around  Carla then thought it over. \"Eliot I don't want us to stop growing until we are the size of the Himalayas and then well get even fatter!\" Eliot then smiled and made the call's. \"Good because all that moving around made me hungry!\" </span></div></div>",
            "created":1355035500,
            "id":1484471,
            "title":"I think we should be even bigger then you are n..."
        },
        "1253":{
            "author_id":"bleachfan09az",
            "author_name":"Akathatguy",
            "choices":[
                "She just let herself go?",
                "Something else? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more?</span></div></span></div>",
            "created":1354856400,
            "id":1483396,
            "title":"Other choices. "
        }
    },
    "info":{
        "author_id":"bleachfan09az",
        "author_name":"Akathatguy",
        "brief_description":"The girls from scrubs get nice and fat!",
        "created":1352696040,
        "description":"<td align=\"left\" class=\"norm\">This is the only female scrubs weight gain story I know of it is also my first story.<br>\r\nPlease keep it relatively clean nothing gross like pooing farting ect.<br>\r\nPlease add a nice sized chapter <br>\r\nPlease no male weight gain<br>\r\nPlease do nothing to sexual.<br>\r\nPlease keep it reasonable <br>\r\nThe main focus is scrubs and weight gain<br>\r\n<br>\r\nIf you do any of those things or somthing else i dont lik I will remove your addition   </td>",
        "id":1903058,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1393896360,
        "modified":1393896360,
        "pretty_title":"Scrubs female weight gain"
    }
}