{
    "chapters":{
        "1":{
            "author_id":"ethijax",
            "author_name":"Ethijax",
            "choices":[
                "Stay in bed and go back to sleep for a bit.",
                "Get up and get ready for the day."
            ],
            "content":"<div class=\"\"><div> <span>James ran between the large trees of Longhound forest just outside his town. The boy jumped over a tree root and used one of his three fox tails to push off a nearby tree. Doing this caused James to dodge a lunging bite of a red fox that was chasing him. While in the air, James felt the warm summer sun bathing his bare back in light. The spiky brown hair got into the kid's eyes, but he ignored it. Within a couple of seconds of landing on the ground, James was running deeper into the forest laughing. He turned one of his fox ears atop his head towards a a sound behind to the right. Another fox had joined in the chase. After he leaped left of a incoming tree, James looked behind him. Two foxes jumped at him. James knew they had caught him. When the two canines jumped, the boy stopped running. The two pushed James down and the other two came from the other side. Had it been anyone else, the foxes would have ran away or attacked. But, not James. As the blue eyed boy laughed heavily, the foxes licked and cuddled up to him. One fox playfully bite and tugged at James' center tail. Suddenly, James was awoken by his alarm. The clock read: <i>8:45AM, Sat, 03/19/2231</i><br>\r\nThe annoyed kid quickly shut off the clock before putting his head back on the pillow. He sighed tiredly, contemplating getting up or not.  </span></div></div>",
            "created":1468966980,
            "id":2183159,
            "title":"Chapter One: The Grand Quest Begins"
        }
    },
    "info":{
        "author_id":"ethijax",
        "author_name":"Ethijax",
        "brief_description":"Follow young James as he sets out on a quest to find power! Choose the path of his life!",
        "created":1468963980,
        "description":"<td align=\"left\" class=\"norm\"><b><span class=\"cred\">Note:</span></b> I'm always trying to improve, so I'd love any constructive feedback. This is my first story on here, and I've chosen to make an interactive one. I hope I do this right. I'd like it to stay with James being the main character in this story, thank you!(for those who add to this)  So without further ado, please enjoy! <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/bigsmile.png\" alt=\"*BigSmile*\" title=\"BigSmile\" border=\"0\" width=\"15\" height=\"15\"> <br>\r\n--------<br>\r\nIn 2027, something caused the Human race to finally evolve again. This evolution gave Humans the ability to take control over their souls, and the power within them. That was over three generations ago. And with each generation, the individual became more powerful. Nowadays, there is a tournament to determine the strongest. Just about anyone can join, if they truly believe themselves strong enough. The tournament is held once a year. With each win, the contestants get cash and move up the ranks. The top three at the end are awarded a lot cash and prestige. And today, March 19th, 2231, the tournament begins! Who will win? Will our protagonist, James place in the top three, or will he fail? You, get to choose his path to victory or defeat.</td>",
        "id":2090709,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1468966980,
        "modified":1468966980,
        "pretty_title":"Tournament of the Soul: The Initiation "
    }
}