{
    "chapters":{
        "1":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Naruto",
                "Sasuke",
                "Choij",
                "Kakashi",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok Who to start with?</span></div></span></div>",
            "created":1257570000,
            "id":788097,
            "title":"Who?"
        },
        "11":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Stuffing Himself",
                "Consensual Feeding",
                "A Jutsu",
                "Force Feeding",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he gain?</span></div></span></div>",
            "created":1257742800,
            "id":789363,
            "title":"Naruto"
        },
        "111":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Someone knocks at his door while he's still eating",
                "He finishes, and decides to laze around a bit",
                "He gets full before he can finish"
            ],
            "content":"<div class=\"\"><div> <span>Naruto sat in his kitchen, staring at the massive pile of food before him and rubbing his hands eagerly.<br>\r\n<br>\r\nEarlier that day, Naruto had felt immensely hungry, something that not even multiple trips to Ichiraku could satisfy. Oddly, those visits always ended with him even hungrier than he had been before. He didn't understand why this was-his visits to his favorite ramen stand always left him satisfied, and even a little bloated sometimes-but he did understand something: to feel satisfied, he'd need more food, and a LOT of it.<br>\r\n<br>\r\nTo this end, he had taken his frog wallet, filled to bursting with cash from numerous missions, and gone on something of a shopping spree. He picked up everything from noodles, sweets, meat, and everything in between. It had taken a while, but he had finally amassed an enormous amount of sustenance and had, with some difficulty, hefted it all the way back to his house.<br>\r\n<br>\r\nNow, here he sat, gazing at his food and barely able to keep himself from drooling. His stomach growled, reminding him that he was still hungry.<br>\r\n<br>\r\nDeciding to oblige it, he opened up a pack of noodles and dug in.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1259816400,
            "id":800817,
            "title":"Hungry!"
        },
        "1112":{
            "author_id":"sqrt625",
            "author_name":"Expansion K",
            "choices":[
                "A knock at the door wakes Naruto up.",
                "Naruto wakes up later, hungry as ever.",
                "A mysterious figure is gazing in through Naruto's window, excited by the result."
            ],
            "content":"<div class=\"\"><div> <span>Naruto tore into his pile of food with excitement and gusto, unwrapping any wrappers, then shoving the contents into his hungry, ravenous maw.<br>\r\n<br>\r\nNaruto started with a few packages of slim jims. He tore the package open, then took out three meat sticks at a time, tearing into viciously. After he finished the packages of slim jims, his stomach began to push out ever so slightly.<br>\r\n<br>\r\nNext he moved onto the dango, which he had gotten to go at Anko's favorite restaurant. He opened the Styrofoam container, which had been meticulously filled with dozens of sticks that each contained  five sweet dumplings. He decided to remove all of the skewers, leaving a pile of the sweet confections in the container. He then grabbed handfuls of them, and downed them greedily, with hardly any chewing. Soon, those were all in his greedy stomach, which was currently pushing against his orange jacket, making an obvious imprint.<br>\r\n<br>\r\nWith each passing food, Naruto's stomach bulged out more and more. With the many packages of bread rolls, his stomach placed enough pressure on his orange and blue jacket to force the zipper open, revealing a sliver of his black undershirt, which itself was being stretched by his overfilled belly.<br>\r\n<br>\r\nAfter Naruto finished the packages of assorted pastries from the bakery, his stomach had forced his jacket open even farther, giving some room for his expanding belly. His undershirt also began to rise as well at this point, revealing a very small portion of Naruto's stretched out flesh underneath.<br>\r\n<br>\r\nNow, Naruto tore through a few large bags of pretzels, causing his belly to unzip his jacket all the way to the bottom. In addition, his shirt had ridden just enough to expose his bellybutton. Now, his stomach was  taxing his orange pants heavily, and the button was threatening to give out.<br>\r\n<br>\r\nNaruto tore through even more salty snacks, causing his stomach to push his undershirt up even more, to the point where it gave up and began resting on the top of his gargantuan belly. His pants button was now shaking violently, as it would break at any moment.<br>\r\n<br>\r\nSoon, with a few candy bars, Naruto's stomach broke the button, causing it to fly over to the other side of the room in an instant. Now freed somewhat, Naruto's stomach advanced out quickly, forcing his fly down all the way to the bottom, and almost reaching the table that used to have much more food on it.<br>\r\n<br>\r\nNow, he moved to the many packages of instant ramen that he made. They were steaming and filled with brothy goodness, waiting for Naruto in the middle of the table. Naruto grabbeed a pair of chopsticks, then began eating with even more gusto. Ramen was his favorite, after all.<br>\r\n<br>\r\nSoon, even the ramen was gone, leaving the table empty, and leaving a pile of empty containers in Naruto's trashcan. His stomach had made the final push, and now it was being bisected by his dinner table. He scooted back, then laid back in his chair, patting his extraordinarily distended belly as he had finally been satiated.<br>\r\n<br>\r\nWith a stupid grin on his face, he rubbed his belly mindlessly. He then said, \"I guess there are advantages to living alone.\" Then he stood up, staggering due to the weight of his belly, which wobbled as he did so. He then took off his jacket and shirt, fully freeing his newly distended abdomen. He then slipped out of his orange pants, which was easy as they were already undone. This left him in a pair of plain orange boxers.<br>\r\n<br>\r\nNaruto then trudged over to the couch, then sat back lazily. He turned on his TV, then went back to mindlessly rubbing his belly with a goofy, satisfied grin on his face. He began to doze off, sleeping peacefully.</span></div></div>",
            "created":1366387800,
            "id":1574826,
            "title":"He finishes, and decides to laze around a bit"
        },
        "112":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "A Boy.",
                "A Girl ."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the person feeding him a boy or a girl?</span></div></span></div>",
            "created":1585791240,
            "id":2811804,
            "title":"Consensual Feeding"
        },
        "113":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "He does it himself",
                "Someone does it for him",
                "Someone does it without his knowledge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Naruto using the jutsu on himself for some reason, or is someone else using it on him?<br>\r\n<br>\r\nAnd if it is someone else, are they doing it with or without his knowledge?</span></div></span></div>",
            "created":1262408400,
            "id":814488,
            "title":"A Jutsu"
        },
        "1133":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "A girl",
                "A boy",
                "Or a group of people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is doing it?</span></div></span></div>",
            "created":1262408400,
            "id":814489,
            "title":"Someone does it without his knowledge"
        },
        "11331":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "Hinata",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Hinata, or someone else?</span></div></span></div>",
            "created":1262408400,
            "id":814490,
            "title":"A girl"
        },
        "113311":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "She is an FFA",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But why is she doing it?</span></div></span></div>",
            "created":1263790800,
            "id":822266,
            "title":"Hinata"
        },
        "1133111":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "Make him hungry and slow metabolism",
                "Konoha's Jutsu libraries are vast, there must be more"
            ],
            "content":"<div class=\"\"><div> <span>Okay, we know why she is doing it, now how is she doing it? What does this jutsu do exactly?<br>\r\n<br>\r\nDoes she use a varriation of the gentle fist to increase Naruto's hunger while lowering his metabolism (and perhaps slow him down a bit so he won't run off)?<br>\r\n<br>\r\nOr is it something else?</span></div></div>",
            "created":1319393760,
            "id":1211519,
            "title":"She is an FFA, but how?"
        },
        "11331112":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "Just fatten him up with a handsign",
                "There must be other ways, this is too quick and easy for me"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We'll the obvious thing for this jutsu to d would be to just make him fatter everytime Hinata used it. It would be a bit cheep, but it would be the fastest and simplist way to get the job done, very ninja.</span></div></span></div>",
            "created":1319394180,
            "id":1211520,
            "title":"A Cheeper But More Effective Method"
        },
        "113311122":{
            "choices":[
                "Let's do that one",
                "I'm still not sure"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a mind altering jutsu? When in a trance he will mindlessly eat whatever food is placed in front of him?</span></div></span></div>",
            "created":1383783540,
            "id":1690581,
            "title":"More ways"
        },
        "1133111221":{
            "choices":[
                "The jutsu works!",
                "It works, but with side effects"
            ],
            "content":"<div class=\"\"><div> <span>Hinata was nervous.<br>\r\n<br>\r\nEver since she found out about her \"interest\" she couldn't stop thinking about it. Last week she happened to be at the Ramen stand the same time as her now boyfriend Naruto was finishing his meal and she saw IT.<br>\r\n<br>\r\nHis gut.<br>\r\n<br>\r\nGranted it barely poked out from under his shirt and was gone buy the next day, but she saw it.<br>\r\n<br>\r\nEver since then, every time she closed her eyes, she kept picturing Naruto's gut, it getting bigger and bigger every time she imagined it. It kept haunting her dreams every night until she could take it no longer. She knew Naruto would not willingly gain weight, so instead she created a jutsu that would make him eat whatever amount of food was placed in front of him but have no memory of eating. This included an added bonus that now the Ninja War was over, Naruto would have to stop going on missions and stay in the village and spend more time with her.<br>\r\n<br>\r\nAll she had to do was visit Naruto's house whenever she could with whatever food she could carry, and while he's distracted cast the jutsu on him and start feeding him everything she had along with anything in Naruto's cabinets.<br>\r\n<br>\r\nHinata took a deep breath.<br>\r\n<br>\r\n\"Okay, I'm ready\"</span></div></div>",
            "created":1383785280,
            "id":1690595,
            "title":"Let's go Hinata!"
        },
        "11331112211":{
            "choices":[
                "Hinata comes back the next day",
                "Hinata continues this for over a month!"
            ],
            "content":"<div class=\"\"><div> <span>\"N-naruto!\" Hinata exclaimed after when Naruto opened the door in enveloped her in a bear hug lifting her off the ground.<br>\r\n<br>\r\n\"Hinata! I'm going to go get some ramen, you wanna come with?\" Naruto happy grin was almost contagious.<br>\r\n<br>\r\n\"Ah! Naruto, you can't eat junk food all the time! I brought some food with me to cook you a nice home cooked meal, we can't have our next Hokage die of malnourishment.\" Hinata smiled sweetly, her trap being set.<br>\r\n<br>\r\n\"Aw, Hinata, you're so sweet to me! Okay!\" Naruto turned around scanning the room, a small frown forming when he saw how messy his apartment was (even more then normal) \"Um...I just gotta clean up a bit...\" Naruto started darting around picking up ramen cups and other random trash while Hinata started preparing their lunch.<br>\r\n<br>\r\nAnd what a lunch it was.<br>\r\n<br>\r\n5 pounds of spaghetti and meatballs covered in parmesan in a giant serving bowl, 3 loaves of bread worth of garlic bread smothered with butter and garlic, 5 2-Liter containers of various sodas and for dessert 3 1-gallon containers of ice cream.<br>\r\n<br>\r\nNaruto looked at the food with wide eyes.<br>\r\n<br>\r\n\"Hinata! There is no way we can eat all this!\" None the less Hinata noticed a slight trail of drool from the corner of his mouth.<br>\r\n<br>\r\n\"Whatever we don't finish, you can keep for left overs, I just worry about you not eating healthy...\" Hinata's lower lip trembled her eyes starting to water.<br>\r\n<br>\r\n\"I'm sorry Hinata! This food smells amazing and I'm lucky to have a girlfriend like you to take care of me!\" Naruto grabbed the nearest garlic loaf and started chowing down. Hinata, noticing Naruto was distracted, finally cast the jutsu.<br>\r\n<br>\r\nNaruto's eyes glazed over and he continued eating.<br>\r\n<br>\r\nAnd eating.<br>\r\n<br>\r\nAnd eating some more.<br>\r\n<br>\r\nHinata watched, hypnotized as first the bread sticks dwindled the disappeared, then the pasta bowl getting smaller and smaller. After he finished the pasta he turned to the soda and gave it look of confusion which snapped Hinata out of her trance.<br>\r\n<br>\r\n\"Oh! I'm so sorry Naruto dear! I guess right now you don't understand well enough to take the top off the soda, here let me help you...\" Hinata cooed before moving to the other side of the table and grabbing one of the soda bottles and untwisting the cap. With her free hand she gently pushed Naruto back against the wall and lifted up the bottle to his lips and slowly turned it upright. Naruto drank slow but constant; he breathed through his nose as he continued to chug bottle after bottle of soda his stomach now very clearly pushing against his jacket and showing a little bit more of a stomach then the one she saw at the Ramen Stand. As she turned around to grab the 5th and last bottle of soda she noticed one of the lower cabinets open and filled with about 15 half filled soda bottles.<br>\r\n<br>\r\n\"Oh, Naruto...\" Hinata playfully tsked while putting the 5th bottle against his lips, \"If all you eat is carbs and sugar you're going to get sssssooooo FAT\" she purred the final word while grabbing his stomach with her free hand and gently messaging it. Naruto was slowly leaning further and further back, his stomach inflating more and more due the sugary liquid and the carbonation. After he was finished with the 5th bottle Hinata got up to retrieve the newly discovered bottles watching out of the corner of her eyes Naruto trying to get up to where there was more food on the table but was too stuffed to get past his own stomach. Hinata quickly came back and repeated the process again and again, she did however notice the only time Naruto didn't seem to be uncomfortable was when he was eating of drinking. After drinking the rest of the bottles, Naruto's stomach was huge. Taut and almost 2 feet out from his normal flat stomach, Hinata couldn't help but stop the feeding and use both of her hands to give Naruto a massage, this will help relax Naruto more as well as get rid of any air pockets to give him room to finish his meal.<br>\r\n<br>\r\nNaruto kept lightly burping every couple of seconds, before Hinata got the wonderful idea. She moved her hands away for a few moments to do some hand seals and created a shadow clone her herself; she motioned towards the freezer and the clone began collecting the ice cream containers and bringing them over to the prone man. Hinata and her clone started an effective combo of massage and spoon feeding ice cream to the soon to be obese man.The ice cream didn't seem to go to the front of his stomach, instead it seemed to be added to his sides, causing his shirt to ride up more and more and giving his and overall wider look. Hinata, deciding this was enough for today, released her clone and the jutsu on her love.<br>\r\n<br>\r\nNaruto moaned.<br>\r\n<br>\r\n\"Hinata *urp* uh....I feel really sleepy all of a sudden....\" Naruto looked up at her with bleary eyes. \"I'm....uh...gonna rest my eyes far a.....\" Naruto quickly dozed off, one hand continuing to massage his own stomach even while he slept. Hinata looked down at her love, her eyes misty from tears of joy.<br>\r\n<br>\r\nOh, Naruto!\" Hinata buried her face against his now softer sides, \"I know a lot of this will be gone by tomorrow, but I will keep helping you become the great man you were destined to be.\"</span></div></div>",
            "created":1383789120,
            "id":1690613,
            "title":"The jutsu works!"
        },
        "114":{
            "author_id":"grimtuesday",
            "author_name":"sorrow",
            "choices":[
                "Hinata continues these late night feeding sessions",
                "Hinata adopts a more aggressive method",
                "Another storyline entirely"
            ],
            "content":"<div class=\"\"><div> <span>The night was still and the silence undisturbed in the village hidden in the leaves. And in the shadows, there was one who was active. A young girl, Hinata Hyuuga, who moved swiftly towards her destination, one with the darkness all around her.<br>\r\n<br>\r\nShe reached her destination and silently entered. She crept along the hallway, until she reached his room, and then her target himself.<br>\r\n<br>\r\nWordlessly, she stood over him, her Byuakugan active, focusing on a single point in the target's neck. Too fast for all but the swiftest on ninjas to follow, her right hand lept forward, delivering a precise strike from her famed Gentle Fist. The response from her target was immediate. Before he had been in a very deep sleep, and very much at ease. Now, he slumped even further into his bed, body becoming limp, and breathing slowed.<br>\r\n<br>\r\nHinata collapsed atop him, resting her head against his chest. \"Naruto-kun,\" she sighed. \"Oh, I'm so sorry I had to do that to you my love. But don't worry, everything is going to be fine.\" As she said those words, she reached into her back pouch and pulled forth a small sealing scroll.<br>\r\n<br>\r\nShe spread it out along the side of Naruto's bed, gingerly releasing it to reveal a small feast. She picked up the first of it, a slice of chocolate cake, and moved it towards Naruto's mouth. She slid it in and he calmly swallowed it whole by reflex. Hinata giggled to herself at the sight, one hand already reaching for more, the other releasing a steady stream of chakra as she rubbed Naruto's stomach.<br>\r\n<br>\r\nAlmost an hour later Hinata saddly roled up her scroll as she prepared to leave. She turn to Naruto one last time and whispered into his ear, \"I'll see you again, my sweet. You were so good, eating every bite. Don't worry though, by morning you won't feel a thing. My chakra has stimulated your digestive system to take care of everything. Good bye for now, my love.\" And with one last chast kiss to Naruto's check, she vanished.</span></div></div>",
            "created":1309150800,
            "id":1135412,
            "title":"A Nightime Visitor"
        },
        "12":{
            "choices":[
                "two thousand pounds at 13'0 tall",
                "340 and regular height",
                "Normal",
                "On top of Orochimaru's Belly"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n orochimaru opens his hand to sasuke, in it are a green pil and a blue pil, he sasy \"take these if u want to double the size of your chakra!\" he exclaimed, sasuke quickly grabbing it, and dry swallowing it, he was about to perform the normal dragon fire ball jutsu, but he felt so tired, so exhausted, that he just fell asleep. When he woke up he was. . . . </span></div></div>",
            "created":1276750800,
            "id":901021,
            "title":"Sasuke"
        },
        "123":{
            "author_id":"mikeyboy20",
            "author_name":"IronLotus",
            "choices":[
                "Morning(slight change)",
                "1 week later(BIG changes)"
            ],
            "content":"<div class=\"\"><div> <span>Sasuke wakes up and is slim and toned like normal, but is extremely hungry. He sprints down to the ramen shop and orders 10 bowls of ramen. <br>\r\n<br>\r\n3 hours later <br>\r\nSasuke is bloated so he slowly drags himslef back home takes off his tight clothes and passes out............<br>\r\n<br>\r\n</span></div></div>",
            "created":1323889200,
            "id":1239703,
            "title":"Normal"
        },
        "1231":{
            "author_id":"rosebunse",
            "author_name":"Rosebunse",
            "choices":[
                "Explore the compound?",
                "Look for more food?",
                "Rub his belly some more"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Sasuke awoke. He felt tired and sleepy. He was surprised when looked up to his window and saw light streaming in. He almost always awoke before it was so light. He closed his eyes tightly. He couldn't remember much of the day before besides the pills Orochimaru made him take...<br>\r\n<br>\r\nWithout thinking, he rubbed his bare stomach...<br>\r\n<br>\r\nHe was surprised to feel how it gave a little at his touch. It was soft...<br>\r\n<br>\r\nHe spent the next few minutes rubbing his soft belly. It wasn't fat, just not as hard...<br>\r\n<br>\r\n\"Good morning, Sasuke.\"<br>\r\n<br>\r\nHe looked up slowly to find Kabuto in the doorway, a tray of breakfast foods in his hand. <br>\r\n<br>\r\n\"Orochimaru thinks you've been training too hard, so he's giving you the week off.\"<br>\r\n<br>\r\n\"But the pills-\"<br>\r\n<br>\r\n\"That too. He wants to make sure those pills work properly.\"<br>\r\n<br>\r\nHe set the food on Sasuke's lap after helping him to sit up. Normally, Sasuke would have protested against the break, but today he felt so tired. They were right, he thought, he needed some time off. He looked at the food tray and surprised at the large amount of food.<br>\r\n<br>\r\n\"Is something wrong, Sasuke?\"<br>\r\n<br>\r\nHe shook his head and began to eat without another word.<br>\r\n<br>\r\n\"I know it seems like a lot, but Orochimaru and I are just concerned about your health. You're so skinny. Eating more will help you build muscle, anyways.\"<br>\r\n<br>\r\nHe didn't leave, but Sasuke didn't really mind. He felt so hungry all of a sudden. When he was done, he leaned back into his pillow while Kabuto took the tray and left, telling him to relax.<br>\r\n<br>\r\nWhat does Sasuke do?</span></div></div>",
            "created":1367005740,
            "id":1578996,
            "title":"Morning(slight change)"
        },
        "14":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Stuffing his face.",
                "He enters a Sumo Tournament",
                "Naruto uses a Jutsu that fattens him up as a Prank.",
                "He is Challenged by Gai to a Weight Gain Contest. ",
                "More Choices?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chose which Way he will Gain. </span></div></span></div>",
            "created":1313384400,
            "id":1168957,
            "title":"Kakashi"
        },
        "141":{
            "author_id":"ilove1234",
            "author_name":"ilove1234",
            "choices":[
                "The next morning he wakes up bigger and returns to Ichiraku for food",
                "Kakashi gains a little bit of weight and eats too much breakfast with Naruto"
            ],
            "content":"<div class=\"\"><div> <span>Kakashi Hatake walked down the street with his blonde student at his side. <br>\r\n<br>\r\nHe and Naruto had come back from another training session out in the fields. Ever since Jiraiya vanished before Naruto could travel with him on his training mission, Kakashi wanted to re-connect to his student and train him until the Sannin returned. And to be honest, Kakashi had a lot of fun with Naruto. He certainly had a much better time training him than he did with Sasuke. That miserable traitor was never pleasant to be around, plus he always cheated and used his Sharingan to obtain strength and copied other ninja. But not Naruto, he worked hard to become strong, just as Kakashi did when he was a child before he obtained his Sharingan. Which was a trait he admired about his student.<br>\r\n<br>\r\nBut back to reality, Kakashi and Naruto were starved and he promised to treat Naruto to all the Ichiraku he could eat after a long day of chakra-control exercises.<br>\r\n<br>\r\n\"I hope you don't mind that I order about... 30 bowls of beef ramen, sensei!\" the blonde kid said as he made his exaggerated estimate.<br>\r\n<br>\r\nKakashi laughed and then said, \"Heh! I don't think you could eat that much, Naruto. Take it easy.\"<br>\r\n<br>\r\nWithout a warning, Kakashi's stomach suddenly released a loud growl which caused the blonde student to notice just how thin his teacher was. Naruto's own stomach released a similar sound, but it wasn't as loud as his sensei as the two continued to walk and the stomachs screamed one more time. The masked ninja patted his stomach and rubbed it and soon, the two arrived at Ichiraku Ramen. The student and teacher sat down in their seats and were greeted with Teuchi and his daughter Ayame. The two chefs looked pleased to see the two ninja arrive in their famed restaurant and went to their usual stations while the student and teacher sat in their comfortable seats.<br>\r\n<br>\r\nTeuchi chuckled, \"Well! If it isn't the handsome Kakashi and his trusted little sidekick!\"<br>\r\n<br>\r\n\"Sidekick?!\" outraged Naruto in a comedic fashion, \"Since when am I the sidekick?\"<br>\r\n<br>\r\nKakashi smiled, \"Relax, Naruto. Besides, next to me, you're pretty much my version Robin.\"<br>\r\n<br>\r\n\"Since when do I run around in primary color-\" he was about to asked and then he looked down at his orange and blue clothes, \"Oh, yeah... I am Robin.\"<br>\r\n<br>\r\nThe masked man chuckled some more and pat Naruto on the back as he searched the menu as did his student. He wasn't sure what he wanted to eat this time, but he needed a dish that would fill him to the brim. He hadn't eaten lunch, so it was no wonder that his stomach almost screamed to be stuffed with food. Kakashi searched the menu over and over until he saw an old ramen bowl that he never noticed until now. It looked old, like no one had ordered one in years. But the description on the bottom said that it could cure a stomach in need of eating, which was what Kakashi needed as he was starved.<br>\r\n<br>\r\nHe asked, \"What's this dish, Teuchi?\"<br>\r\n<br>\r\n\"Oh...\" the chef looked it over and said, \"That's an old recipe I made years back when I was in school with Hakkaku. Not sure that I remember how to make it.\"<br>\r\n<br>\r\nKakashi told him, \"It's called a Full-Bowl... Designed to help a man that needs to eat...\"<br>\r\n<br>\r\n\"Well, I'm gonna order the usual and see where I go from there!\" his student said out loud and made his decision.<br>\r\n<br>\r\nThe masked man shrugged and then returned the menu, \"This sounds like the dish for me. I'll have one Full-Bowl and move on to some chicken-ramen with fish.\"<br>\r\n<br>\r\n============================================<br>\r\n<br>\r\nIn the kitchen, Teuchi struggled to remember how to make the Full-Bowl back when he was in cooking school. It was designed to help satisfy a man's appetite and make them feel like they had a whole feast. But his memories on how to make it were clouded with his rival Hakkaku, who made dishes that did the opposite and made a man unable to stop eating their food and have whatever they ate become digested and turned instantly into fat. Teuchi tried to remember his own recipe but he remember that when he first made it, Hakkaku would interrupt him and show his own recipes into his face and distract him from his genius work. For a moment, he was tempted to ask Kakashi to ask for another ramen dish, but that would make him such a rude chef and he refused to reject a customers wishes. So he did his best in preparation of Kakashi ramen meal and prayed to the Gods that he made it right.<br>\r\n<br>\r\n============================================<br>\r\n<br>\r\n\"Here you go! Hot and fresh!\" the kind chef announced as he placed both the beef bowl and Kakashi's Full-Bowl on the counter.<br>\r\n<br>\r\nAt the same time, Naruto and Kakashi broke their chopsticks apart and said the usual prayer that most citizens in Konoha said before dinner. Naruto was too distracted and hungry to watch his sensei as he lowered his mask and ate his entire meal in a flash. Teuchi watched carefully and waited to see Kakashi feel full, hoping that he had used the correct recipe. Kakashi sat back in his seat soon after he had eaten and rubbed his stomach in satisfaction.<br>\r\n<br>\r\n\"Ahh... That was so good... Not sure I'll ever ask for one of those again...\" he sighed.<br>\r\n<br>\r\nNaruto smiled with noodles stuffed in his mouth, \"Mmm-hmm!\"<br>\r\n<br>\r\nTeuchi sighed as well and relaxed as he turned back to the kitchen, but then he froze when he heard Kakashi shift in his seat and then he said, \"Hold on, Teuchi!\"<br>\r\n<br>\r\nThe nervous ramen chef turned around and continued to pray that Kakashi did not desire to eat more food, \"Yes, Kakashi?\"<br>\r\n<br>\r\n\"I actually could use another bowl of ramen. Could I have the chicken, beef, shrimp, with a side of salt-broiled fish, chips, and some water to wash it all down?\"<br>\r\n<br>\r\nTeuchi almost fainted when he realized Kakashi had fallen under the spell and that he had in fact used the incorrect recipe. He would have to fix the situation before it came out of hand, but he could risk his business and tell Kakashi that he had basically been poisoned. So the kind chef smiled and returned to the back to make Kakashi's big meal, his daughter oblivious to the events to come while Naruto stared at his sensei when he heard him order all that food for himself.<br>\r\n<br>\r\n\"Whoa, sensei. Since when did you have such an appetite?\" he asked.<br>\r\n<br>\r\nKakashi rubbed his stomach, which was strange, because it felt like he hadn't even eat a bite, \"Not sure. But I could use some food. I hardly ate anything since breakfast this morning.\"<br>\r\n<br>\r\n=============================================<br>\r\n<br>\r\nTeuchi watched and tried his best to hide his horror as Kakashi started to eat, much slower this time while Naruto was distracted. Kakashi stuffed the chicken flavored ramen noodle into his mouth and did not even chew as he consumed more noodles than Naruto did. He sucked them all into his mouth and did not even breathe as he inserts chips into his maw and moved on to the other ramen bowls that he wanted to eat. Soon, he moved on to the pork, beef, and shrimp flavored ramen as he loaded his mouth full of noodles and then swallowed them all down at once. <br>\r\n<br>\r\nAfter a breath, he drank some water and continued this motion over and over until he was done and sat back in his chair with his mask returned to his handsome face. Teuchi looked over the counter and could see Kakashi's stomach had expanded to its limits. Kakashi's belly was now noticeable, as if he had swallowed a basketball and it inflated while still inside him. He rubbed his stomach, after having eaten over 8 ramen bowls, various side-dishes, and almost 2 gallons of water to wash it all down. <br>\r\n<br>\r\nIt was a miracle Kakashi hadn't burst or even moaned. But that was a side-effect of the first ramen dish he ate. Hakkaku designed his formula so that it stretched out the stomach more and numbed out the pain of being full.<br>\r\n<br>\r\nThe now satisfied Kakashi remained oblivious to his new large belly even as he rubbed it and paid for both himself and Naruto. <br>\r\n<br>\r\nTeuchi nodded to both the shinobi and waved to them until they were both out of sight. He then bolted into the kitchen and search for the broth he used in Kakashi's first dish as well as his recipes as his daughter closed down shop.<br>\r\n<br>\r\nTeuchi then said to himself in a panicked voice, \"I have to find a way to reverse this fast! If I don't Kakashi won't stop eating until he's as fat as a cow!\"</span></div></div>",
            "created":1356031860,
            "id":1491628,
            "title":"Kakashi stuffs his face."
        },
        "145":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "He gets a mission to escort cooking ninja.",
                "He is married and deals with kids on the way.",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More ways he will Gain.</span></div></span></div>",
            "created":1313470800,
            "id":1169719,
            "title":"More Choices?"
        },
        "15":{
            "author_id":"ghidorax",
            "author_name":"Shademaster",
            "choices":[
                "Kiba",
                "Lee",
                "Neji",
                "Shikamaru",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Anyone else?</span></div></span></div>",
            "created":1257570000,
            "id":788214,
            "title":"More?"
        },
        "155":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Asuma",
                "Zabuza",
                "Even Even More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even More?</span></div></span></div>",
            "created":1257829200,
            "id":789649,
            "title":"Even More?"
        },
        "1551":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Stuffing his face.",
                "A jutsu.",
                "More choices?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does he gain?</span></div></span></div>",
            "created":1304744400,
            "id":1101516,
            "title":"Asuma"
        },
        "15512":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Try Out The Jutsu's of Weight Gain And Blueberry",
                "Go though the Scroll some more."
            ],
            "content":"<div class=\"\"><div> <span>Asuma was charged with protecting the Forbidden scroll from any who would use it for sinister purposes. Asuma decided to move the scroll to his vacation home on a island. \"I wonder if the scroll would be safe here\" Asuma pondered but he was sure that here was safe location for hiding the scroll Asuma then realized that no one was here to watch so he decided to look though the scroll for kill the time. \"I always wondered what kind of jutsu was sealed in this scroll.<br>\r\n<br>\r\nAs Asuma looked though the scroll he came across some odd and weird jutsu such as one that can turn you into a giant and another that did the opposite shrinking. \"there all kinds of jutsu in here\" then Asuma noticed a odd jutsu that can fatten you up \"what kind of jutsu is this? its causes weight gain on the user who uses the jutsu hmmmm.....\"pondered Asuma who also discovered another strange jutsu that caused you to become a blueberry. \"a jutsu that swells you up into a blueberry huh? weird\" Asuma wondered then Asuma realizes that its just him here so he play around a bit with some of the jutsu. \"I guess i'll try some of this Jutsu's out to see if they work or not That or look around in the scroll for any more odd Jutsu's\" Asuma said.<br>\r\n<br>\r\nThen he decided to..........</span></div></div>",
            "created":1304744400,
            "id":1101936,
            "title":"The Forbidden Scroll."
        },
        "155121":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Jutsu of Weight Gain.",
                "Jutsu of the Blueberry."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Asuma decided to try the first two he saw but which one?</span></div></span></div>",
            "created":1314003120,
            "id":1172902,
            "title":"Try Out The Jutsu's of Weight Gain And Blue..."
        },
        "1551211":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "100.lbs",
                "200.lbs"
            ],
            "content":"<div class=\"\"><div> <span>\"A Weight gain jutsu eh? Might as well give it a try\" Asuma then makes hands seal necessary to start the jutsu \"Ok the hand seals are Dragon Ram Monkey Boar\" Asuma quickly formed all seals successfully then activates jutsu then.....nothing happened <br>\r\n\"I guess it was a fluke did I mess up somewhere?\" Asuma didn't know he did the jutsu successfully as it about to take affect as he didn't noticed that he was getting slightly fatter <br>\r\n<br>\r\nIt started with his midsection as he started to gain some weight his six pack was being replaced with a large pot belly then it started to spread out to other parts of his body. His legs look a bit wider now and his arms still have muscle definition but now it looks flabby. Fortunately the gain wasn't much as he still had muscle definition but now he looks he been getting out shape.<br>\r\n<br>\r\nFinally Asuma notices that he gotten a bit Bigger \"Woah! Where did this come from!?\" As he started overlook the his newly Fattened Body his also noticed that he had a double chin now and he had a Large rump \" if I had to guess I would be 200.lbs by now\" Asuma was still shocked that the Jutsu actually worked \"Well it did work so I guess I could continue with this as long there is way to reverse it\" Asuma decided read more about the jutsu capabilities and discovered that you can control how much you gain by thinking up the amount of pounds you want to gain \"Interesting Ok let's give it a test run\" Asuma started to think how much he gain and he thought up the number.......</span></div></div>",
            "created":1314005820,
            "id":1172912,
            "title":"Jutsu of Weight Gain."
        },
        "15513":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Force feeding.",
                "How about Inflation instead?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1304744400,
            "id":1101517,
            "title":"More choices?"
        },
        "155132":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Blueberry inflation.",
                "More More Options."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Heres some options to inflate him instead.</span></div></span></div>",
            "created":1304744400,
            "id":1101519,
            "title":"How about Inflation instead?"
        },
        "1551321":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "He was starting to turn Blue.",
                "He was starting to get Fatter."
            ],
            "content":"<div class=\"\"><div> <span>Arriving in Mideel Asuma and a Small team were sent to Mideel to oversee the area and befriend the locals. The team consists of Asuma Shikamaru and Naruto. \"Ok we were sent here to meet the mayor of the city and spend some time at some of his factories to get information but don't cause much trouble ok?\" Asuma said to the team.<br>\r\n<br>\r\nEntering the mayors mansion they eventually meet him in his room \"Oh you must be the leaf team sented here! Welcome to Mideel! The city of factories! I am Mayor Blue my full name is Barry Sea Blue!\" the mayor himself looked normal but his clothes screamed mad scientist. Naruto was surprised at the mayor's appearance and asked \"Woah you look like a scientist!\" Shikamaru told Naruto to shush down but Barry responded with a laugh. 'The reason I wear this clothing is because I own most the factories! Here!\" \"Really!\" Naruto said \"Yeah my factory I mostly go to is over there wanna come along?\" asked Barry \"YEAH! can we go Asuma Sensei?\" Asuma pondered this though but Barry says\"Sure lets go!\" they desided to go to Barry's Factory.<br>\r\n<br>\r\nThey eventually arrived at the factory and entered in the factory. \"My factory produces all kinds of food so if you were hungry on the way here you eat here.\" Barry explains Naruto was happy \"Do you carry Ramen!?\" answered Naruto \"Yes we do!'<br>\r\nsaid Barry \"Yeah!\" Naruto runs off in the factory \"Naruto wait you don't know the way!\" Shikamaru chased after naruto.<br>\r\nAsuma justs laughs \"come i want to show you a room.\" said Barry \"really? ok.\" asked Asuma.<br>\r\n<br>\r\nBarry takes Asuma to the room he wanted to show him the room when they arrived at room in the factory. \"Whats the surprise?\" asked asuma but Barry entered the room already. <br>\r\n<br>\r\nThe Room was a gigantic place with a lot of machines. \"Nice room\" \"Thanks heres a little gift for you\" in Barry's hand was a piece of gum \"Is that a piece of gum?\" \"Yes you want it?\" \"Sure\" Asuma popped the gum in his mouth and started chewing on it \"This gum is pretty good. what kind of gum is this?\"<br>\r\nasked Asuma. However Barry was nowhere to be found. \"Huh that's weird he was here just a moment ago.\" despite that Asuma was enjoying the gum he was chewing. but unknown to Asuma that gum had a few special properties and its effects started to show..........<br>\r\n <br>\r\n </span></div></div>",
            "created":1304744400,
            "id":1101571,
            "title":"The City of Factories:Mideel"
        },
        "15513211":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "It was Shikamaru who found Barry.",
                "It was someone else."
            ],
            "content":"<div class=\"\"><div> <span>Shikamaru managed to catch Naruto and they went searching For Asuma However they couldn't find him. \"geez wheres Asuma Sensei\" wondered naruto \"he was with the mayor maybe he went to discuss some stuff over\" they continued searching for him. But they were unaware of the fact Asuma was actually in the Test room where he chewing a piece of gum given to him from Barry. However the gum had a few flaws...<br>\r\n<br>\r\n\"Wonder whats taking him so long?\" Wonders Asuma. Asuma then noticed a mirror nearby and decided to look at the mirror \"huh a mirror?\" taking a look at himself Asuma decided to flex his muscles \"yeah whos the big man Asuma's the man for you!\" Asuma then suddenly notice his nose has turned blue. \"What the Hell?! my nose its BLUE?!\" \"ASUMA SENSEI!\" hearing shouting behind him Asuma turned around to see Naruto and Shikamaru running towards him. \"Asuma Sensei we been looking for you......whys your face blue?\"asked naruto \"i don't know.\" Shikamaru then noticed that the blue on his sensei was started to apper on his clothes \"Asuma are you chewing gum?\" asked shikamaru. \"Yes?\" \"I think that gum is the cause of your.....condition.\" \"WHAT?! BARRY GAVE ME THIS GUM!\" Roared Asuma \"Wait he gave you that gum?\" \"YEAH!\" \"Why don't you spit it out?\" \"I can't for some reason I try to but I can't\" \"Ok Naruto stay and watch Asuma for me ok?\" \"Ok!\" \"I will find Barry And I be Right back Asuma\" shikamaru quickly left.<br>\r\n<br>\r\n\"Ok Asuma Sensei! I will....\" \"What the!\" Naruto quickly turn to Asuma and was shocked to see his Sensei.......starting to swell up! Asuma look at his midsection as he was blowing up \"What the hell!\" Yelled Asuma Naruto was stunned and speechless. Asuma was starting to look like he put on 200 pounds as he had to unzip his vest to avoid ripping it then his shirt was riding up his growing belly filled with blueberry juice. \"Wow Sensei you look like you been hanging with choji too much! Naruto said \"Naruto this isn't funny im becoming a blimp!\" Asuma said Asuma was starting feel his legs filling up. By this time the Naruto was watching Asuma blowing up. Even Asuma himself was staring downward at his at his ballooning form. His gut was now a huge ball. Asuma first thought was \"When was this gonna end?\" he felt like a giant balloon filling with a steady supply of water. Finally the button on his pants let go with a satisfying pop. Asuma could hear ripping sounds up and down his thighs, and even down his butt. \"So much for my pants\" The rapid bloating was matched on the top half of his body, too, as his shirt fully ripped open and ripped across the back. Pillowy blue flesh ripped out of his arm sleeves. Before long, most of his clothing was in tatters on the floor — leaving Asuma standing there wearing a ripped remains of his shirt now a tank top and a briefs. Naruto was stun struck by what happened to Asuma Waddling his feet further apart to widen his stance, Asuma is starting to looking like a really Obese man. His gut was a massive ball, his pecs resting on top like huge pillows, his arms and legs filling up with blueberry juice like overstuffed sausages. Asuma was shocked but strangely He starting to warm up to blowing up to a blueberry now. \"You know im starting like this\"Asuma said naruto was shocked \"What! you likeing blowing up like a balloon!?\" \"Nope imBecoming a blueberry\" \"A blueberry? wait you're becoming a BLUEBERRY!?\" \"Yeah.\"<br>\r\n<br>\r\nAsuma was getting bigger and bigger. The increasing tightness of his body wasn't stopping the flow of juice at all. <br>\r\nHis body was becoming more spherical, with cone-shaped arms sticking out at 45-degree angles, a humungous butt, and fat, stumpy legs. His shirt and briefs stretched themselves to fit his ballooning form, oddly enough, giving Asuma some peace of mind. the thought of being stark naked in front of Naruto embarrassed him.<br>\r\n<br>\r\nSuddenly the swelling stopped \"Huh? it stopped\" \"Really? good if you gotten any bigger you would it been hard getting you out of here\" \"Oh well\" Sighed Asuma. then someone came in.</span></div></div>",
            "created":1304744400,
            "id":1101608,
            "title":"He was starting to turn Blue."
        },
        "15513212":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Shikamaru and Naruto waiting for him to wake up.",
                "Barry waiting for him to wake up."
            ],
            "content":"<div class=\"\"><div> <span>Asuma continued to chew the gum given to him by Barry but the gum had a ability to make anyone chewed it gain weight.<br>\r\n\"I wonder where Barry went to..\" then Asuma noticed his clothes were starting feel snug. \"Geez did this thing shrinked in the washer the other day?\" Asuma assumed, its become obviously apparent that Asuma is gaining fat at a slow rate. the clothes now becoming a bit tight Asuma looked down and was Shocked \"What the!\"he yelled. his midsection was bloating with fat very slowly \"How the hell im getting Fatter!? Wait....the gum!\" realizing the gum is what causing his fattening Asuma attempted to pull the gum out but suddenly he felt the urge to chew the gum growing. \"Damn it!\" Asuma yelled, giving in to the chewing. Asuma sighed in defeat. \"Great im getting Fatter\" groaned Asuma, suddenly his fattening was starting to speed up.<br>\r\n<br>\r\n\"What!? no!\" Asuma as his struggled to take off his jonin vest. he managed to get it off before ripping it. Asuma just manage to get it off in time. by now Asuma would had hit 360 pounds \"Damn I guess I know what choji has to deal with but aleast he's used to it im wasn't this Fat until now\" Asuma's shirt ending up riding up his giant belly and his pants managed to hold together but still splited on the sides \"If I had a scale I would be 400 pounds by now\" Asuma said.<br>\r\n<br>\r\nAn hour later Asuma was now hitting 540 pounds \"When the hell im gonna stop gaining\" he said. the irony is that its just beginning. suddenly at that moment Asuma's pants shredded along with his shirt \"Oh Crap!\" Asuma yelled again. he continued to gain until finally at 630 the gaining stopped \"it looks like I stopped gaining. its about time.\" taking the gum out of his mouth Asuma waddled out of the room \"Damn its looks like I won't able to run for awhile until i get Barry to fix this\"<br>\r\n<br>\r\nAsuma found it hard to move around with a fat body he wasn't used to. he could't use jutsu because he'll get tired and his clothes bursted off earlier leaving him in nothing but surprising fitting briefs \"Aleast my underwear held out but now I look a Sumo Wrestler\" Asuma waddled around the factory looking for Naruto and Shikamaru \"Where on earth are they should've started looking for me by now\" Finally unable to walk anymore Asuma found a bedroom along the way and simply went to asleep for some time. when he woke up he sees.........</span></div></div>",
            "created":1304744400,
            "id":1101647,
            "title":"He was starting to get Fatter."
        },
        "1551322":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Yeah Let's go with that!",
                "No, More Options Please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if he became a Sumo Wrestler?</span></div></span></div>",
            "created":1313384400,
            "id":1168953,
            "title":"Sumo?"
        },
        "15513222":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "He Gets a mission to Guard some Cooking Ninja alongside Kakashi.",
                "Even more Options!?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else? </span></div></span></div>",
            "created":1313902800,
            "id":1172641,
            "title":"More Options Please."
        },
        "155132221":{
            "author_id":"br0kendestiny",
            "author_name":"BB42",
            "choices":[
                "Eat all of the Buffet",
                "Eat half of the Buffet"
            ],
            "content":"<div class=\"\"><div> <span>\"So all we have to do is guard some cooking ninjas while they set up a Restaurant?\" \"Yeah I know its a odd mission but hey it has us doing something.\" Asuma and Kakashi were standing in front of a nice looking Restaurant, discussing about the current mission they were given. Guarding some Cooking Ninja Coming from the Land of Lightning to set up a restaurant in Konoha. They were continuing their conversation until their stomachs started growling \"Oh I guess we should go grab something to eat\" \"Sure we were standing here all day\" <br>\r\n<br>\r\nBoth Asuma and Kakashi were about to leave when one of the cooking ninja came out \"Hey you two!\" Asuma and Kakashi turned back and came over \"Yes what is it?\" Kakashi Answered \"I overheard you two talking about getting something to eat how about eating here?\" \"Uh? are you sure? you're still..\" \"Yes we still getting the restaurant ready but it's almost finished so I can take you guys in for a bite\"<br>\r\n<br>\r\n\"Heh, I'll take your offer\" Asuma responded he turned to Kakashi \"What about you Kakashi wanna grab a bite here?\" \"Sure\" \"Good! then come in\" They then entered inside the Restaurant. Inside the Restaurant they were sitting at their table and were waiting for the eventual food to come \"I hope it won't take long\" \"Be patient it will come\" Then they noticed two waiters coming up with ALOT of food. They were served with most of the buffet \"Anything else?\" one of the waiters asked \"Nope we're fine\" \"then have a great time with the buffet!\" the two waiters left Asuma and Kakashi to eat the buffet. \"Hey Asuma how are we supposed to eat this all?\" \"Well we could eat half of it or eat it all\" they then decided to.........</span></div></div>",
            "created":1313975220,
            "id":1172680,
            "title":"Guarding a Restaurant"
        },
        "1553":{
            "choices":[
                "Konohamaru",
                "EVEN MORE!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lots of choices!</span></div></span></div>",
            "created":1272690000,
            "id":876522,
            "title":"Even Even More?"
        },
        "15531":{
            "choices":[
                "Free Choice",
                "Free Choice"
            ],
            "content":"<div class=\"\"><div> <span>Konohamaru came outside to check the mailbox. He found 8 coupons to Ichiraku Ramen! 4 were together with a note that said, 'Hey Konohamaru, I got these in the mail and didn't want them. I decided that Naruto won't care if the ramen was cheaper or not, so I gave them to you.<br>\r\n<br>\r\n-Sakura'<br>\r\n<br>\r\n\"Wow! Cool, I'm starving!\" Konohamaru said, noticing his hunger. When he got to Ichiraku, he looked at the coupons, they each read, 'Buy 2 large bowls of ramen, get 1 other large bowl free!' The date on the coupon said that it was only valid til today!<br>\r\n<br>\r\nKonohamaru laid 2 coupons onto the counter and asked for 6 large bowls of ramen. 'I HAVE to eat all this so I don't waste my coupons!' he thought as he dug in. After his 2nd bowl he felt ALMOST full.<br>\r\n<br>\r\nHis 6 bowls were now empty, and he felt sooo full! He still had 18 bowls left for his coupons to be gone! He decided to order 3 more now, since he could come back later that day for more. He now had 5 coupons left, 2 for lunch, and 3 for dinner. His pants were not NOTICEABLY tighter, but they were tighter.<br>\r\n<br>\r\nKonohamaru was back for lunch and ended up using 3 coupons instead. He was stuffed. He would use 2 at dinner, and then get 3 bowls for full price.<br>\r\n<br>\r\nDinner was the use of his last 2 coupons, and he got a free coupon for a prize of ordering so much ramen in one day. He used his new coupon, but decided that he actually wanted 2 MORE bowls. When he arrived home, he noticed that his shirt was tight, but decided that the bloat would go down when he woke up. He went to sleep not realising that a small layer of fat had been added to his bloated belly.</span></div></div>",
            "created":1273640400,
            "id":881887,
            "title":"Konohamaru"
        },
        "15532":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Truka",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about this shinobi</span></div></span></div>",
            "created":1353551820,
            "id":1472679,
            "title":"EVEN MORE!"
        },
        "155322":{
            "author_id":"shadowreader",
            "author_name":"Shadow",
            "choices":[
                "Izumo Kamizuki",
                "Kotetsu Hagane",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these ninja?</span></div></span></div>",
            "created":1558593180,
            "id":2662937,
            "title":"more"
        }
    },
    "info":{
        "author_id":"br0kendestiny",
        "author_name":"BB42",
        "brief_description":"Some strange things are happening to the male population in the Naruto world.",
        "created":1257584100,
        "description":"<td align=\"left\" class=\"norm\">Heres the rules:1:No Female WG 2:No Death. 3:No Sex. 4:No Slobs. Have fun!</td>",
        "id":1616074,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585791240,
        "modified":1585791240,
        "pretty_title":"Male Naruto Weight gain"
    }
}