{
    "chapters":{
        "1":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "1 minute",
                "1 hour",
                "1 day",
                "1 week",
                "1 month"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is the dial set to when you touched the object?</span></div></span></div>",
            "created":1602295200,
            "id":2918292,
            "title":"The Dial"
        },
        "13":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "grandpa",
                "grandma",
                "mom",
                "aunt carol",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>You set down the letter and look at the dial on the third mark from the top. The object itself silvery gray and cold, was heavy. It had no particular smell or sheen. You notice a strange static as you look around, holding it in your fist. About the size of a golf ball. You scratch your chin and wonder what the letter could be about. Looking about the apartment, something catches your eye. A small photo book next to the night stand. You reach out to pick it up...</span></div></div>",
            "created":1602295440,
            "id":2918295,
            "title":"1 day"
        },
        "134":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "his place",
                "freak out",
                "mom walks in"
            ],
            "content":"<div class=\"\"><div> <span>After you blink, you suddenly notice a strange unevenness in your posture. You're now sitting on the bed, streams of tears falling down your face. You notice you are about to set down the photo album on the night stand when a familiar tattoo on your arm sets off a cascade of alarms in your head. How did I get aunt carol's tattoo? What the hell? You look further up the slender arm to the white shag coat covering my breasts. Breasts? I quickly reached out to them, and cupped them with my green painted fingernails. Holy shit, I had breasts!<br>\r\n<br>\r\nTaking a deep breath, watching them rise and fall, I thought things through for a second. I touched the ball, then I walked over and touched the book. Now I'm here touching <i>my</i> breasts... It took a second, but it all clicked. Somehow, the little silver orb let me become whoever touched whatever I chose to touch last.<br>\r\n<br>\r\nShit. Then I realized I had become aunt carol at some unknown time. When did she last touch this book? What time was it? I looked outside and saw darkness from the window that a moment ago had light pouring through. I stood up, realizing the strangeness of my body. I wiped the odd tears from my face and found the black smudge on my hand confusing for a moment, until I realized it was probably her... my makeup.<br>\r\n<br>\r\nNear the front door I saw aunt Carol's purse and quickly dove in to look at her phone. As I held it up to check the time, I saw several notifications. One was from a guy named HotGuyBarSaturday and another from my mother talking about some of the things she wanted Carol to pick up from Dad's place. Grandpas. <br>\r\n<br>\r\nI realized this is why she was here. I held the phone in front of my face and hoped it would unlock. It did. I opened the message from my mom and read it, looking at a hand basket full of some of the items already prepared. Then I decided to open the other messages. From Hot Guy.<br>\r\n<br>\r\nThis was... a mistake. I scrolled for a few messages, reading their sexting back and forth, a strange sensation of warmth in my groin. Then I came upon a nightmare picture of this Hot Guy's huge cock. I just stared at it, shocked. For a very long moment I ogled it and wondered the truth of this thing. It didn't seem possible, or maybe it was some effect of the camera. <br>\r\n<br>\r\nI noticed my heart was racing and a warmth had begun to tickle throughout my aunt's... my body. My breathing was intense, like I had just done a short jog. My groin was <i>wet</i>? I reached a hand down to the base of my dress and felt around the thin layer of underwear. It was the strangest thing not having a penis. Just a flat soft fold where it used to be. Still staring intensely at the phone, I backed up to the bed and came to a seat. My other hand still petting my underwear. The sensation was so inviting. Like my erections used to feel, but welling up inside me. I noticed my breathing get deeper as I pushed harder, trying to agitate a small itch building up at my groin that I needed to scratch. But, it wasn't a normal itch. It was a sensation inside me.<br>\r\n<br>\r\nSlowly, I slid my hand into the underwear and found my fingers between two hot folds of flesh, soft with a tiny clump of hair at the top. My mouth opened on its own and let out a good exhale in the sound of a shallow moan. My aunt's voice caught me off guard, but it seemed to make me enjoy this more.<br>\r\n<br>\r\nBetween the folds, my fingers found wetness. I moved them up and down, trying to find a fussy point I kept passing over. I noticed a hardening in my breasts that made them all the more unusual, but sensitive to the tiny motions in the dress. \"God!\" I said, out loud, as I found a point of intensity. I focused on it with two fingers, rubbing them back and forth on the tiny bump that was sending shivers down my spine. My spine was giving me a curl. A sound of wanting \"Mmmmh\" came out of my throat without my permission. It sounded like a child did when they were being denied candy. <br>\r\n<br>\r\nA sudden \"Agh,\" came out of me as a burst of warmth erupted from my groin, into my stomach, up my spine, and shuddered into my chest. I laid back on the bed, breathing like I had just run a mile. I couldn't help but laughing a little and the strange relaxation but tightness blanketing all my skin. I was tingly everywhere. My phone buzzed, catching me off guard.<br>\r\n<br>\r\nIt was HotGuy. The message asked, \"You still coming?\"<br>\r\n<br>\r\nIn the back of my head I though, \"just did.\" Somehow this made me hornier. The inner parts of the new toy I just discovered seemed to be inviting fingers again. I slid one in, but this only demanded more. I was slipping a finger back and forth and beginning to imagine the giant penis in the image sliding in and out of me...<br>\r\n<br>\r\nA strange idea hit me. Wasn't I a guy? Shouldn't I be hating this? Then I remembered the writing on the paper. The dial was set to a day. I picked up the phone and began typing back. After sending, \"On my way,\" I scrolled back to find the address. I searched through the giant purse to find a set of keys, a wallet full of cards and a small tin case with mints, a pack of pills and a single condom. Wow. I was about to do this... <br>\r\n<br>\r\nI touched my groin through my dress. I was going to do this.</span></div></div>",
            "created":1602297420,
            "id":2918301,
            "title":"aunt carol"
        },
        "1341":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "panic",
                "mmmm.... boy..."
            ],
            "content":"<div class=\"\"><div> <span>As I drove, Carol's body seemed to remember sing song lyrics to the catch pop music on the radio. I was enjoying it for some reason, despite my previous body's original hatred for it. There were so many new and strange experiences.<br>\r\n<br>\r\nAs I pulled up to the gated community, I was beginning to realize aunt Carol didn't date poor guys. These houses were huge. I came up to a massive flat with a huge window facing the driveway. No one was in it - thank god. My heart was racing.<br>\r\n<br>\r\nWeird second thoughts flooded my mind. I remembered all the things I learned back in high school health class about safe sex. Then, for some reason, this body was remembering some random things about self defense? I looked on Carol's key chain and fiddled the tiny black cylinder of mace. <br>\r\n<br>\r\nThe man opened the door suddenly before I could touch the doorbell. One of the weirdest things ever then happened to me. My jaw fell. My nipples hardened. My... vagina stiffened... all at the same time. I got hot, and wet, and said \"wow,\" under my breath. The man was massive. His bare chest shimmered in the moonlight. His bald head gleamed. His perfect white teeth contrasted so perfectly with his dark, tanned skin. As he opened the screen door, I imagined my aunt's face, makeup smudged.<br>\r\n<br>\r\nHe looked down and said, might I add - in the most luring voice I've ever heard from a man, \"everything okay babe?\"<br>\r\n<br>\r\nI tried to say, \"yes\", but it came out as \"wow.\"<br>\r\n<br>\r\nHe smiled and set one of his huge hands on my hip, reaching into my coat. My hips then felt like they buckled and sent themselves forward to him like a magnet to a refrigerator. I tip toed toward his height and he leaned down locking our lips. His massive tongue forced itself past my teeth and danced with mine. As we kissed back and forth, I felt my hands move up his chest and sort of cat paw at him, ever so gently. I felt like a feather meeting a rock.<br>\r\n<br>\r\nThe Hot Guy then stepped back, taking me with him. I shut my eyes, letting him guide me, allowing this body to make the experience. We came to a door. He pressed me against it, and pulled my legs up around his waist. I shivered as his belt buckle touched my inner thigh. \"Ready?\" He said.<br>\r\n<br>\r\nI opened my eyes, moving my hands to his arms. His large hands spread my ass as he held me against him. I could feel the massive erection beneath his jeans. It seemed so much larger than in the image. I hesitated, looking deep into the mans eyes, feeling the burning desire in my whole body. I needed this man. \"Yes.\"<br>\r\n<br>\r\nThe door opened and he set his hand back on my butt. We entered a shady, candle lit room and he set me down on a very tall bed, so tall my feet didn't touch the floor. I felt tiny, but supported. He unbuckled his belt as he climbed onto the bed. I shed my coat and tossed it into the darkness of the floor. I leaned back, feeling the fur of the blanket tickle my flesh. He threw his pants, and I could see the girth of his massive penis through the darkness. I looked at it. I stared intensely, feeling the warmth and wetness flood my aching pussy. Suddenly, I was facing a solution to the deep itch I needed to scratch.<br>\r\n<br>\r\nHe, on his knees, guided me toward him. I wrapped my hands around his massive rod, his went to my breast and my folds. He slid a finger in, big enough to be an erect penis. Probably as big as mine was when I was a...</span></div></div>",
            "created":1602298440,
            "id":2918306,
            "title":"his place"
        },
        "13412":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "deep in my throat",
                "all over my face"
            ],
            "content":"<div class=\"\"><div> <span>My mind blanked as a shiver and wave of heat caused me to buck. His large hands directed me as the finger slid in and out. He laid me down on my back kissing me while I worked his massive erection with my tiny hands. Kisses danced from my breasts, down my belly and around my thighs, where he continued fingering, with the other hand opened me wide. Then, something amazing happened.<br>\r\n<br>\r\nThe fingers slowly came out as the kissing became a wet sponge of tongue between my folds. It swirled around and attempted to enter me. I began to make out with him as the tip of his tongue danced on my clitoris...<br>\r\n<br>\r\nI opened my eyes through the pleasure. I was making out with the head of the massive cock. I could taste the saltiness. Before I had time to protest, he jousted the massive thing deeper into my mouth and back out. I discovered that it could go quite a ways in. As it sputtered a little, I massaged my hands, tasting the pre-cum. <br>\r\n<br>\r\nDespite his massive size compared to me, the position was more pleasurable than painful. He fucked my mouth, to the point where I couldn't breath, as he worked me. My legs squeezed around his head, my hips shoving into his face as the pleasure built to an intensity I was not able to gain myself.<br>\r\n<br>\r\nThen, without warning, the massive cock erupted...</span></div></div>",
            "created":1602374640,
            "id":2918762,
            "title":"mmmm.... boy..."
        },
        "134121":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "wakeup sex",
                "hot guy is gone"
            ],
            "content":"<div class=\"\"><div> <span>I felt the shaft twitch several times in a fast rhythm. I tried to swallow according with it as something hot and thick flooded my throat. Reflexively, I moved my head away, my tongue on the head of the pens as another massive load erupted onto my tongue. <br>\r\n<br>\r\nThe saltiness was everywhere. The muskies and stickies were everywhere. The strange taste collected in little chucks as I tried to move them with my tongue.  Before I got a good breath in, he attempted to roll over, his penis rupturing again over my face and in my hair. <br>\r\n<br>\r\n\"Damn, girl.\" He said tuening around, leaving my aching  pussy behind. Some emotion of incompleteness began to well up in my stomach. Unfairness. He just laid on his side and looked at me trying to remove his cum from my eye row. <br>\r\n<br>\r\nOne of his fingers found its way back to my vagina. He toyed with me a bit, coaxing me to moan and purr at him against my will. This body was not done. Neither was he. <br>\r\n<br>\r\nSuddenly, he climbed over me, his erection returning, glistening with my spit. I felt the hot lump, the tip, pressing up against my groin. I gritted my teeth at the wantingness to be filled and finished. He moved himself back and forth, teasing me with his size.<br>\r\n<br>\r\nI reached down, the desire burning past my ability to wait. I guided the tip of him into me, and felt the pressure of it. First, a slight pushing sensation, widening my hips. Then, slowly, with his thrust, I felt it glide on my fluids deep inside me. I felt full unlike anything before. Like after a big meal, but beneath my bellybutton and everywhere else. I clenched my deep muscles and felt the shape of him as it continued to push deeper.<br>\r\n<br>\r\nWhen it hit the back of my vagina, there was a small pinching pain. I felt like all of my insides were being shoved aside. Then, it began its journey back. Like the most relaxing aftermath of a large burrito.<br>\r\n<br>\r\n\"Fuck...\" I said, outloud. I could tell my rounded face was probably a mix of pain, excitement and pleasure at the size of it inside the size of me. Then, with an \"hmm,\" I grabbed at his arms, playfully dragging my nails to raise goosepimples, I said, \" fuck me.\"<br>\r\n<br>\r\nThe sensuality of my voice captured me off guard. I was so hot I was turning myself on. I felt my juices assisting him sliding in and out as the sensations intensified. He kept going harder and faster, and all I could do was try to keep my legs straight and make fists in the blankets, grabbing on for dear life. He suckled at my neck, licked at my ear. With a mild adjustment of his knees, I felt his hands gab my thighs and lift my legs back. He put the backs of my calves on his shoulders and continued to pound me, gaining a surreal tightness. I felt like a worn glove in all its glory. <br>\r\n<br>\r\nMy fingers found their way to my folds. I felt him moving in and out of me as I dipped for my fluids. I pulled them back and began massaging circles around my little play bump as he pumped me hard and deep. <br>\r\n<br>\r\nThe sensation took me up and over. God was it good when I was just playing with myself. Now that there was a massive cock moving back and forth inside me, the sensation was at least a dozen times more fulfilling.<br>\r\n<br>\r\nI rapidly came to a climax and looked deep at his crooked smile. He watched me cum while he was inside me. The lust in his eyes coupled with his hands squeezing my ass made the paychology catch up with the heat and pleasure of my body. I felt full and wanted.<br>\r\n<br>\r\nWhen the waves of pleasures came to a tickle, I could feel his twitching. He was ready, and I remembered what my old girlfriend used to do for me. I kicked one lag over and turned myself over on him while he continued to dance inside me.<br>\r\n<br>\r\nOn my hands and knees, I met him in the act and slid backwards, squeezing my vagina tighter when he thrusted. I wanted him to fill me. <br>\r\n<br>\r\nIt didn't take long. He buckled forward, grabbed me by the waist with one hand, dragging me back. His other hand went to my neck, holding me in place as he shoved himself as far in as he could get. He thrusted one more time, his girth twitching deep in me. Then, a sudden hot fluid filled me, deep inside. He kept twitching and trying to trust deeper as he came, then came again. Then he came again. <br>\r\n<br>\r\nIn the back of my head I was shocked at this. When I was a guy, I came maybe once and it wasn't so intense. This man was made of sex.<br>\r\n<br>\r\nAs he pulled out of me, leaving me feeling sore and deflated, he wiped the tip of his penis on my ass cheeks and pulled me to the bed with him. He draped the furs over me and I could feel the shrinking cock mix with his and my juices in my butt crack.<br>\r\n<br>\r\nI felt it uncomfortable for a moment, then his hand distracted me as it fondled my breast. He hissed the back of my beck and I little spooned into him. He held onto me tightly and I had never felt so wanted. <br>\r\n<br>\r\nThe sensation overcame me and I slowly drifted.</span></div></div>",
            "created":1602543900,
            "id":2920054,
            "title":"deep in my throat"
        },
        "1341211":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "found myself back in grandpas apartment.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>A crack of sunlight flooded the room and danced on my bare breasts. I felt a tangle of hair on my face, stuck with probably cum and drool. I tasted the musk of his cock mixed with my aunts morning breath. It was unpleasant and unmoodly. Hot Guy walked back over to my nakedness, half in the fur of the blanket, half demonstrating to him. I felt the soreness of last night in between my legs and down my back. <br>\r\n<br>\r\n\"Hey, sweet.\" <br>\r\n<br>\r\n\"Hey,\" I said back, a little wet at him calling me sweet. I felt like a sexy toy. <br>\r\n<br>\r\nI slid up and turned my legs over the side of his massive bed. Looking down, I felt tiny. I stretched and yawned. I went for the step down, feeling my ass be grabbed and my breasts meet his chest. I was now straddling him, his massive cock already inviting its way between my labia. <br>\r\n<br>\r\n\"Wait...\" I said, but it was too late. He leaned against the bed, pinning me. His cock slid deep, a little painful since I was not ready. \"Agh, fuck!\" I said as he rammed me hard, and climbed himself onto the bed while still fucking me.<br>\r\n<br>\r\nHe piled me onto the blanket and grabbed my breasts more aggressively than last night. He was like an animal. Something about this left me dry and without attention.<br>\r\n<br>\r\nHe then turned me over, his penis dragging at my dry folds and he pulled my hair while fucking me from behind. \"Damn, baby,\" he said as each of his jabs sent a tiny pinch down my spine. I felt myself getting a little wet, but none of this was exciting. Then, he drove deep again, holding me in place. He pulled my hair harder, causing me to cry out in pain as he filled me with another load of hot cum. This time, though, I was not excited and a little grossed out. He slid out of me, leaving me to lie there like a used towel and waltzed off to the bathroom. <br>\r\n<br>\r\nI knocked at the door until he invited me into the steamy room. I climbed into the shower with him feeling sticky and in need of one. He smiled down at me and offered the bar of soap. <br>\r\n<br>\r\nHe made me breakfast and set my coat on my shoulders like a gentleman. He kissed my cheek as we both headed to our cars. I watched him pull away and I sat shocked. I felt like I sat for an hour. As I finally got to my head, I put the car in reverse, backing out. Setting it to drive i...</span></div></div>",
            "created":1602544620,
            "id":2920061,
            "title":"wakeup sex"
        },
        "13412111":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "home adventures",
                "somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Leaned forward and touched the picture book. My heart suddenly began to race as I felt around for my manhood. Confirming its existence I quickly ran to my car, weird gadget in pocket, ready to go home and masterbate.</span></div></span></div>",
            "created":1602605100,
            "id":2920565,
            "title":"found myself back in grandpas apartment."
        },
        "134121111":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "1 hour",
                "I day"
            ],
            "content":"<div class=\"\"><div> <span>Laying on my bed, deep breathing in a sort of saudade satisfaction, I wondered why cuming as a guy just wasn't as intense as I felt as a woman. I almost wanted more... I did want more.<br>\r\n<br>\r\nI thought about where I could go, when I could go, with this thing. I thought about museums, going back to ancient times. I thought about a thrift store, how I could literally live lives after lives in the single room. This seemed the most exciting.<br>\r\n<br>\r\nI drove down the street to the thriftsfore after changing into a black hoodie and shorts. Arriving, I was happy it wasn't busy. I didn't know how long I probably looked spaced out. My only experience with the orb was obviously just a flash. <br>\r\n<br>\r\nI pulled the trinket out of my pocket and set the dial. Heading in, I held my breath...</span></div></div>",
            "created":1602605400,
            "id":2920568,
            "title":"home adventures"
        },
        "1341211112":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "maternity bra",
                "sorority girl"
            ],
            "content":"<div class=\"\"><div> <span>I kept the dial at a day and moved carefully not to touch anything right away. I looked through, strangely curious about the woman's section having had such a wild time before. I slowly approached trying to remain out of the gaze of the people shopping. <br>\r\n<br>\r\nNear the center of the store was an undivided bin. I felt like it was my best bet. I carefully looked through it, hands in my armpits so to not touch anything.<br>\r\n<br>\r\nSomething black and lacey stood out, triggering my wantingness for another good time. Desire took my hand and slowly moved it towards the thing. I quickly snatched it.</span></div></div>",
            "created":1602605640,
            "id":2920571,
            "title":"I day"
        },
        "13412111121":{
            "author_id":"thom29",
            "author_name":"Thom Folly",
            "choices":[
                "Thrift store",
                "thrift store"
            ],
            "content":"<div class=\"\"><div> <span>A blink and I was laying in an ambulance, sirens muffled by the roaring of the vehicle. A few tunes strung to my arms as a paramedic removed the balck lacey underwear. Then, a surge of pressure and pain collapsed inward on my belly... my huge belly.<br>\r\n<br>\r\nThe inside of my head was screaming in terror at the realization. I was about to experience child birth...<br>\r\n<br>\r\nWhy did I set the medallion to a day? I suddenly began to cry and the female paramedic tried to console me through another terrifying cramp unlike anything I had ever felt. <br>\r\n<br>\r\n***<br>\r\n<br>\r\nI laid in a hospital bed, monitors beeping. A strange blur of moving figures around the bed. A heavy man griping my heavy arm encouraged me awake. \"Delora, we have a beautiful baby boy!\"<br>\r\n<br>\r\nSuddenly I snapped. It was explained to me in my near hour long blank stare I had passed out, been given a C section and was now in recovery about to receive my child. <br>\r\n<br>\r\nThe attention of the unknown family seemed odd. I stayed quiet and in a bit of shock not having had to go through labor. I wondered if it was as painful as the last two cramps I experienced before passing out... or worse.<br>\r\n<br>\r\nThe nurse came in and set the tiny pink baby on my belly. It shook my nipple and I exposed it feeling an unjust connection. But a strange, deep, dire connection with the child. It was like my previous experience with sex, but more calm. Whole. Realized. <br>\r\n<br>\r\nI cried for reasons I did not know. I kissed the husband who consoled me i did not know. I kissed the child I somehow knew better than anything I had ever touched. This somehow included myself...<br>\r\n<br>\r\nI dozed into a dreamy, extatic sleep....</span></div></div>",
            "created":1602606180,
            "id":2920578,
            "title":"maternity bra"
        }
    },
    "info":{
        "author_id":"thom29",
        "author_name":"Thom Folly",
        "brief_description":"You discover a medallion that lets you travel back in time... but there's a catch.",
        "created":1602295140,
        "description":"<td align=\"left\" class=\"norm\">Grandpa died a week ago, and you've been asked to help clean out his old apartment. In his old wardrobe you find an unusually heavy cigar box. Within is a folded sheet of paper and a large metal medallion with a dial which can be turned to a variety of different dots. You open the paper to reveal, \"Hello. To whomever finds this, treat it with great secrecy. It came to me by a strange set of circumstances I cannot go into detail about. This doesn't matter. Set the dial carefully to one of the markings. The first is minute, the second is hour, the third is day, fourth is week, fifth is month, sixth is year. I never dared to set it to any beyond... I found out by experiment what they all meant. After setting the dial, be careful what you touch. It is peculiar about things you touch. It takes you to a place beyond, relevant to whoever touched it last. Remarkably, I've gone back and attempted to change events, but it appears incapable. But, the experiences are real, so travel with caution. I note, I have died in one journey and come back. It was most terrifying. But, good to know.\"</td>",
        "id":2234650,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602606180,
        "modified":1602606180,
        "pretty_title":"Body Swap Time Travel"
    }
}