{
    "chapters":{
        "1":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Campaign 1",
                "Campaign 2",
                "One Shots",
                "Real life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will we determine who gains?</span></div></span></div>",
            "created":1576645200,
            "id":2761305,
            "title":"Curious beginnings....."
        },
        "11":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vox Machina",
                "Guests",
                "Npc "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vox machina, guests, or NPCs?</span></div></span></div>",
            "created":1576645200,
            "id":2761306,
            "title":"Categories "
        },
        "111":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex",
                "Keyleth",
                "Pike"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vex- seductive ranger<br>\r\nKeyleth - naive druid<br>\r\nPike - holy cleric</span></div></span></div>",
            "created":1576645200,
            "id":2761307,
            "title":"Vox Machina"
        },
        "1111":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Always been fat from the beginning ",
                "Has a fetish",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does she gain?</span></div></span></div>",
            "created":1576645200,
            "id":2761311,
            "title":"Who can resist?"
        },
        "11112":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "A few weeks later, The couple entertains guests at a dinner",
                "Whitestone is visited by a guest or two",
                "Free choice "
            ],
            "content":"<div class=\"\"><div> <span>I’m ready darling”<br>\r\n<br>\r\nLady Vex’Ahlia, baroness of the great hunt in Whitestone, leaned in to take a bite from the treat in her husband’s outstretched hands.<br>\r\n<br>\r\nWarm pie filled her mouth, and she moaned.<br>\r\n<br>\r\nShe kept eating, biting into fresh dough and sweet cream filling.<br>\r\n<br>\r\nIt did not take long to finish.<br>\r\n<br>\r\n“More.”<br>\r\n<br>\r\nPercival Fredickstein von mussel klosowski the third decided to not give his wife a lesson on manners, but instead fulfilled her request. Next to their bed, was a table full of various sweets, normally enough to feed the entire castle of Whitestone, it would instead go into his as of now slim beloved wife.<br>\r\n<br>\r\nThis had been a long time coming for Vex. It was something she never admitted to anyone, not even her brother. <br>\r\n<br>\r\nWhen she was a young girl she loved sweets, as rare as they were. Every harvest festival she would take all the sweets she could find and try to eat them all at once.<br>\r\n<br>\r\nWhen her father took her to Syngorn, she saw something strange at the functions she was forced to attend. A beautiful and graceful elf started putting on weight. Following her one night, she saw her and her wife engaged in a nightly ritual that involved lots of sweets and lots of sex.<br>\r\n<br>\r\nSoon after, the elf resigned from court as she had become immobile, and Vex knew what she wanted in life<br>\r\n<br>\r\nIt was hard, as an adventurer, to put on meaningful weight. Still, Vex would usually order seconds at dinner with Vox Machina, and steal off her friends plates when not looking. She would retreat to her room and cradle her stuffed belly, longing for more jiggle.<br>\r\n<br>\r\nIn Scanlans mansion, Vex would ask his servants to bring up as much Chicken to her room as possible, then quietly disposed of the remains in the morning.<br>\r\n<br>\r\nBut now, she had confessed to her husband her intentions to grow, and was surprised at just how enthusiastic he was. So they set aside this day to finally give the buxom black haired baroness what she always dreamed of.<br>\r\n<br>\r\nBack in the present, Percy was now feeding the roguish ranger cookie after cookie, one at a time, loving the pout she would make when he went too slow.<br>\r\n<br>\r\nAfter finishing the platter, Vex leaned back, and she and Percy both rubbed her engorged stomach.<br>\r\n<br>\r\n“Where do you think this will end up, Dear?”<br>\r\n<br>\r\nPercy cupped his wife’s breasts, and she giggled.<br>\r\n<br>\r\n“Hopefully a fair bit will go here.”<br>\r\n<br>\r\n“I’m sure some will go to my chest, you dog. But can you imagine me with a large belly, round ass, and chubby cheeks? Are you sure you’ll love me when I can’t fit out the door?<br>\r\n<br>\r\n“Vex’ahlia, I would love you if you were the size of the castle.”<br>\r\n<br>\r\nVex laughed.<br>\r\n<br>\r\n“Hopefully that won’t sound so ridiculous in a year or two.”<br>\r\n<br>\r\nVex ate as much of the meal as she could. And the next one. And the ones that came after. She was still never able to quite finish one, but she was getting better each time.<br>\r\n</span></div></div>",
            "created":1576645200,
            "id":2761329,
            "title":"Vex wishes to be wide"
        },
        "111121":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Later that night....",
                "A few weeks later",
                "Free choice "
            ],
            "content":"<div class=\"\"><div> <span>One night, The Lord and Lady were entertaining their guests for the evening. As was customary, they had a feast.<br>\r\n<br>\r\nPercival was dressed to the nines, as usual, but lady Vex’Ahlia was simply dazzling in a deep blue dress with a very low cut. Had the guests seen her previously, they would have noticed the slight bulge of her stomach, or how her already generous chest had ever so slightly grown.<br>\r\n<br>\r\nWhat the guests did notice was how much the Half Elven baroness was eating. Nothing was put on her plate that she didn’t plan to have a second helping of, at least. <br>\r\n<br>\r\nAnd when dessert came out, a variety of puddings, pastries and cakes, they found it cute how Percy doted on his wife by feeding her with his fork many bites.<br>\r\n<br>\r\nThey also didn’t hear what lady Vex said to her husbands ear  as the night was winding down, before making their way to their shared chambers.<br>\r\n<br>\r\n“My dress is about to burst darling. I had some servants deliver food to the room.”<br>\r\n<br>\r\n</span></div></div>",
            "created":1577077200,
            "id":2763890,
            "title":"Innocent hosts"
        },
        "1111212":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "What is Percy inventing?",
                "A guest comes to visit ",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>Vex awoke mid day in her luxurious bed. In addition to increasing her caloric intake to add mass to her body she was being lazy and lethargic, in part due to her preparing to one day be immobile.<br>\r\n<br>\r\nShe stretched her arms to wake up, and noticed how little her once loose nightgown now covered her belly. She started playing with her flab, mesmerized at how soft it was. She imagined how much bigger it would be in a year or two, and she could swear she could hear her heart racing.<br>\r\n<br>\r\nShe noticed her husband had left a tray of brownies next to her bed, along with a note that read “In my invention lab all day. I’m sure to enjoy the effects of these tonight.”<br>\r\n<br>\r\nVex smiled, wondering how she found the perfect man.<br>\r\n<br>\r\nAs Vex dug into the fattening treats, she admired her mirror. It showed the previously lithe half elf bulging out of her clothes. Her aforementioned stomach was a beautiful pot belly, which produced squishy love handles. <br>\r\nSpending more time on her ass had caused her to not be able to fit some of her favorite pants over her bulky thighs.<br>\r\nAnd Percival did indeed enjoy her inflated breasts at night.<br>\r\n<br>\r\nAnd finally, even without being stuffed with gooey chocolate goodness as they are now, there would be no denying her rosy cheeks would have a chipmunk like quality about them, that went perfectly well with her developing double chin.<br>\r\n<br>\r\nAll in all, Vex was around 60 pounds closer to her lifelong dream.</span></div></div>",
            "created":1582174800,
            "id":2790390,
            "title":"Surveying the gain"
        },
        "11112122":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Allura",
                "Keyleth",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who comes to visit ?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1582520400,
            "id":2792261,
            "title":"A guest comes to visit "
        },
        "111121221":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "She’s put on a couple",
                "She is as slim as ever",
                "What if? Alluras MASSIVE"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But has she stayed slim</span></div></span></div>",
            "created":1582520400,
            "id":2792262,
            "title":"Allura"
        },
        "1111212211":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex. ",
                "Percy",
                "A group of servants bringing trays and trays of food?"
            ],
            "content":"<div class=\"\"><div> <span>As Allura Vysoren completed the teleportation circle, she strained against the girdle she was wearing.<br>\r\n<br>\r\nFixing the tal’dorei council was rough on the arcanist, leading to many restless nights kept awake only by the sweets her wife makes. It was only a few pounds, but Allura would be mortified if anyone saw her growing pot belly.<br>\r\n<br>\r\nThe blonde stepped into the portal, planning on a visit to Percy and Vex in Whitestone. When she got there she saw...</span></div></div>",
            "created":1584248400,
            "id":2801824,
            "title":"She’s put on a couple"
        },
        "11112122113":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "300 pounds",
                "500 pounds",
                "800 pounds"
            ],
            "content":"<div class=\"\"><div> <span>Allura watched as a group of servants rushed past her, only one acknowledging her presence with a “hello!” They were pushing a large tray full of who knows what. Curious, Allura followed them. They reached a large set of double doors, above which was spelled “Lord and Ladies room.” How odd she thought. She didn’t remember their quarters being on the ground floor.<br>\r\n<br>\r\nAs the doors opened she could hear the voice of Vex say “ Ah yes wonderful darlings, put it *munch* with the rest of the dessert over there!”<br>\r\n<br>\r\nAllura stepped into the room and gasped. She saw Vex, she had to be...</span></div></div>",
            "created":1600577940,
            "id":2906593,
            "title":"Vex’Ahlias servants"
        },
        "111121221131":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Allura is convinced to gain more weight by Vex",
                "Allura is turned on watching vex gorge",
                "Something else happens "
            ],
            "content":"<div class=\"\"><div> <span>Vex was propped up on her bed, large stomach pooling in front of her. She was dressed in a purple nightgown that covered her head sized tits, but not much else. Her long raven hair was styled into her ponytail trailing behind her. When she saw the tray of desserts being brought to her she clapped her hammy arms together, causing her to jiggle from her engorged calves to her chubby cheeks.<br>\r\n<br>\r\nShe was mid bite of a turkey leg when she finally saw Allura.<br>\r\n<br>\r\n“Allura! How are you darling!”<br>\r\n<br>\r\n“Good... how are you?” She asked with uncertainty.<br>\r\n<br>\r\n“Oh wonderful. I’m so fat!”<br>\r\n<br>\r\n“You, like this?”<br>\r\n<br>\r\n“Of course I do. And I must say I appreciate you putting on some too!”<br>\r\n<br>\r\nAllura blushed and covered her modest pot belly.<br>\r\n<br>\r\n“Well I’m glad your happy at least.”<br>\r\n<br>\r\nVex took a big bite of a slice of chocolate cake.<br>\r\n<br>\r\n“Oh me and Percy have never been happier! Oh, and he shows me how happy he is all night long, if you catch my drift. Anyway I’m glad your here! Let me get dressed and we can go to the first dinner of the evening!”<br>\r\n<br>\r\nAllura sighed. Depending on how long she stayed here, she would probably need to up her dress sizes. Again.<br>\r\n<br>\r\n</span></div></div>",
            "created":1600578600,
            "id":2906596,
            "title":"300 pounds"
        },
        "1111212211311":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Allura begins gaining in earnest",
                "Vex breaks her favorite chair",
                "What if? Vex and Allura begin an affair"
            ],
            "content":"<div class=\"\"><div> <span>Later that night, Vex and Allura were eating dinner. Despite numerous platters being brought in, Allura was surprised to learn that only they would be dining.<br>\r\n<br>\r\n\"Where is Percy?\" Allura asked.<br>\r\n<br>\r\n\"Off in Vasselheim, looking into securing more gunpowder for his projects.\" Vex replied before greedily  digging in to her sea food dinner.<br>\r\n<br>\r\nAfter a while, Vex spoke up.<br>\r\n<br>\r\n\"Eat up dear. Don't waste any calories!\"<br>\r\n<br>\r\n\"I am concerned about how... eager you are about all of this...\"<br>\r\n<br>\r\n\"Fat? Why shouldn't i be?\"<br>\r\n<br>\r\n\" There are some who would find it... unsightly.\"<br>\r\n<br>\r\nVex laughed, the laugh cascading down her vast belly and causing it to shake.<br>\r\n<br>\r\n\"Why should i care what others deem 'unsightly' when i am the happiest I've been in ages!\"<br>\r\n<br>\r\nAllura went to argue, but stopped herself.<br>\r\n<br>\r\n\"Come now Allura darling. you must admit that the pounds look good on me. And by extension you.\"<br>\r\n<br>\r\nAllura considered it for a moment. vex was one of the most stunning women she knew, second only to her wife. And a few hundred pounds certainly hadn't diminished that. Maybe she was on to something?<br>\r\n<br>\r\n\"Vex, when's dessert arriving?\"<br>\r\n<br>\r\nVex simply smiled.<br>\r\n<br>\r\n\"Whenever you want, darling.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1600922640,
            "id":2909026,
            "title":"Allura is convinced to gain more weight by Vex"
        },
        "11112122113112":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Percy returns and makes up for lost time",
                "Vex has another visitor",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>A few weeks after Allura went on her way, new curves bursting out of her blue dress, Vex waddled around doing her duties as a noble of Whitestone.<br>\r\n<br>\r\nWell as much as an obese waddling noble could do. Which wasn't much.<br>\r\n<br>\r\nShe oversaw the new expansions being built to the castle, only some of which were related to her own future expansions.<br>\r\n<br>\r\nWhile Whitestone had no ruler anymore, some of the townsfolk looked to her as a queen of sorts, and she would hear pleas for help and try to assist when she could. <br>\r\n<br>\r\nLastly, she wrote several letters to be addressed to foreign dignitaries. It was a hassle and a half writing when half the desk is taken up by your large gut, so she usually had someone scribe the letters for her.<br>\r\n<br>\r\nOf course between all these events she had 3 breakfasts, 4 lunches, and a verifiable feast for dinner, not to mention the cavalcade of cookies, pastries, and other deliciously fattening sweets she had  consumed that day.<br>\r\n<br>\r\nYou could understand why she was exhausted as she lumbered towards the common room that evening.<br>\r\n<br>\r\n\"Oh. The only thing that would have made this day better would be if my husband was here to feed me, and placate other desires i have.<br>\r\n<br>\r\nVex had commissioned a grand oak chair to sit in front of the fire place back in her thinner days, trimmed with very soft fur that you could melt into. She had asked for it to be made much wider than her previously bony bum, perhaps sub consciously hoping she would fill it one day, so she could still fit into it even now, mostly.<br>\r\n<br>\r\nVex lumbered herself into her chair, taking note of how her fat pooled over the sides<br>\r\n<br>\r\n<i>creak</i><br>\r\n<br>\r\nShe wondered about how she was lucky trade with Emon was booming, or else they wouldn't be able to keep her this well fed.<br>\r\n<br>\r\n<i>creak</i><br>\r\n<br>\r\nThat pie was delicious today. Even though her fifth chef had only started a few weeks ago she considered giving them a raise.<br>\r\n<br>\r\n<i>creak</i><br>\r\n<br>\r\nBefore she could think her next thought, the chair broke under her, perfectly splitting down the middle. Either through sheer luck or having a tougher skin than her doughy form would seem, she suffered no splinters in her wonderfully wide behind.<br>\r\n<br>\r\nDeep in her heart, she felt the tinge of sadness at the thought of losing her favorite chair, but it was covered and smothered by another thought.<br>\r\n<br>\r\n\"Holy shit I'm too fat for our sturdiest chair!\"<br>\r\n<br>\r\nGuards rushed in at the sound of crashing, finding their lady sitting in a pile of tinder, and helping the blushing half elf to her feet, something that required both of them to pull with all their might.<br>\r\n<br>\r\nAfter she dusted herself off and headed for her bed chambers, she had another thought.<br>\r\n<br>\r\n\"Wait till Percy hears about this.\"<br>\r\n</span></div></div>",
            "created":1600926060,
            "id":2909044,
            "title":"Vex breaks her favorite chair"
        },
        "111121221131121":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex reaches 600 pounds",
                "News reaches Whitestone",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>Shortly after her incident with the chair, Percy finally returned with several wagons of gunpowder.<br>\r\n<br>\r\nHe was delighted to hear about his wife's escapades in his absence. He did feel guilty about neglecting his wife for all this time, so he doubled his feeding of her.<br>\r\n<br>\r\nThey celebrated 400 pounds with a large cake and lots of sex.<br>\r\n<br>\r\nVex was now even less mobile, but she still had the burning in her heart that demanded she grow even further. Percy happily obliged. A sixth and seventh cook was hired in this time. <br>\r\n<br>\r\none day, Percy came back to their bedchamber to find an alluring sight. It was his wife, wearing only the sheerest see through nightgown, stuck in their doorway, chubby face shaded pink in a mix of embarrassment and arousal. On full display were her melon sized breasts, perched on top of a majestically fat stomach.<br>\r\n<br>\r\n\"Darling, I appear to be... stuck.\"<br>\r\n<br>\r\n\"Yes, you do appear stuck.\"<br>\r\n<br>\r\n\"Please help, before anyone sees me!\"<br>\r\n<br>\r\n\"Oh i will. But this is too good an opportunity to pass up.\" He said, already unbuckling his belt. Vex just grinned.<br>\r\n<br>\r\nAny staff that walked by heard the tell tale sounds of love making echoing the hall and gave them a wide berth.<br>\r\n<br>\r\nAfterwards, husband and wife were both panting.<br>\r\n<br>\r\n\"I know you will want to expand the doors so this doesn't happen to me again, but maybe we should keep some the same size so we can repeat this experience, darling.\"<br>\r\n<br>\r\n\"Oh i agree. no lets get you out of there.\"<br>\r\n<br>\r\nIt took a good five minutes to free Vex from the doorway. When she popped out, they both lost their balance and Vex collapsed on top of her husband. <br>\r\n<br>\r\n\"Oh. Sorry Percy. Now that I'm here however, with my weight on top, i could go for another-\"<br>\r\n<br>\r\nShe stopped when she noticed that Percy was turning red, then purple.<br>\r\n<br>\r\nShe rolled off of him, and immediately began making it up to him with a big kiss on his cheek.</span></div></div>",
            "created":1600928460,
            "id":2909056,
            "title":"Percy returns and makes up for lost time"
        },
        "1111212211311211":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex finally reaches immobility",
                "Fayra sets off a fashion revolution",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>They celebrated 600 pounds with several large cakes and even more sex. <br>\r\n<br>\r\nAfter careful consideration, the feedee/feeder couple decided they wanted a threesome. <br>\r\n<br>\r\nNot wanting to ignite drama with their companions in Vox Machina, they decided a courtesan was the best choice. <br>\r\n<br>\r\nShopping around, they decided on a high class escort from Emon. <br>\r\n<br>\r\nShe showed up in a carriage, her name was Fayra Deen, an air genasi as noted by her sky blue skin and wispy white hair. She made her way up to the castle. She was greeted by a man with white hair.<br>\r\n<br>\r\n\"Hello, I am Percival De Rolo. My wife is... occupied at the moment. She's waiting in our bed chambers preparing for tonight.\"<br>\r\n<br>\r\nFayra nodded, and accompanied Percy. As she walked through the halls she noticed a few paintings of Percy and a gorgeous raven haired elf. She could of sworn the woman looked  softer in some of the paintings.<br>\r\n<br>\r\nPercy opened up a door that looked recently renovated and showed Fayra in. <br>\r\n<br>\r\n\"Oh wow. Your beauty was not embellished!\"<br>\r\n<br>\r\nFayra was stunned by the person who just spoke.<br>\r\n<br>\r\nLounging on a bed, fully nude, was one of the fattest women Fayra had ever seen. Her eyes were a squint, due to the large amount of fat packed on to her face. A triple chin led down to extremely large breasts, with saucer like nipples.<br>\r\nThe rest of  her body was hidden by the gelatinous mass that was this woman's stomach.<br>\r\n<br>\r\nSomehow, she was the hottest woman Fayra had ever seen as well.<br>\r\n<br>\r\nShe turned to the undressing Percy.<br>\r\n<br>\r\n\"How... will this work?\"<br>\r\n<br>\r\n\"We discussed this. I have a pulley to reach her sensitive areas, but that seemed... crass, for such a person as yourself. So, for our first act of the night, care to join me on top of my wife?\"<br>\r\n<br>\r\nWordlessly they both climbed on top of the giggling jubilant woman, finding her skin to be even more soft and supple than what it appeared to be. As Fayra turned to Percy, he had a cookie in his hand and held it to her face.<br>\r\n<br>\r\n'Sorry. Its tradition.\"<br>\r\n<br>\r\nShe accepted the cookie, and much more, as Percy repeatedly stuffed her, in both senses of the word.<br>\r\n<br>\r\nAll the while Vex cooed and moaned, seemingly attuned to the arousement of the couple using her as a bed to have sex on.<br>\r\n<br>\r\nAfterwards, Percy held aloft his wife's stomach so Fayra could show her other talents down below, bringing her to a number of satisfying conclusions.<br>\r\n<br>\r\nFayra had sex with the nearly immobile, according to Percy, woman in nearly every position she could think of. The highlight was definitely when Vex lowered her weight slowly onto Fayra as percy took his wife from behind. <br>\r\n<br>\r\nWhen Fayra left a few days later, she clutched an overstuffed stomach, and had already decided to talk her manager into allowing her to change her diet a little.</span></div></div>",
            "created":1600931700,
            "id":2909067,
            "title":"Vex reaches 600 pounds"
        },
        "11112122113112111":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Free Choice",
                "Free Choice",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>Luckily they were together when it happened. <br>\r\n<br>\r\nVex awoke one morning, vision partially obscured by her cheeks. Percy was resting on top of his 734 pound wife. He got up, kissed her cheek, and began getting dressed. <br>\r\n<br>\r\nAt this size, Vex could only get up every other day or so. The other day she had reached the door before she was forced to return, lest she collapse in an uncomfortable place. <br>\r\n<br>\r\nVex summoned her strength, but she didn't move.<br>\r\n<br>\r\nShe tried again, with the same result.<br>\r\n<br>\r\n\"Percy...\" she said.<br>\r\n<br>\r\nInstantly her husband was by her side, understanding what she wanted based on the tone of her voice. He grabbed her reaching arms and tried to pull with all his might, to no avail.<br>\r\n<br>\r\nVex started breathing heavily, and not from exertion.<br>\r\n<br>\r\n\"I...I'm t-too fat to move! I've eaten my way to where i've always wanted!\"<br>\r\n<br>\r\n\"I'm so proud of you dear. And to be honest, I have to be proud of myself too.\"<br>\r\n<br>\r\n\"Just shut up and fuck your immobile wife, you bastard.\"<br>\r\n<br>\r\nAs she lied there with he rhusband, Vex reflected on the journey she had. Confessing to Percy, the first dozen pounds, convincing Allura to gain, breaking her chair and getting stuck in the doorway, and the threesome with Fayra. <br>\r\n<br>\r\nit was everything she wanted, and so much more.<br>\r\n<br>\r\nAnd she would keep adding more and more<br>\r\n<br>\r\n(This is the initial end point of this story, but i want to keep it open for me or anyone else to add to)</span></div></div>",
            "created":1600932480,
            "id":2909070,
            "title":"Vex finally reaches immobility"
        },
        "111121223":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Interesting...",
                "Lame"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the talented Dr.Ripley, percys old nemesis</span></div></span></div>",
            "created":1582520400,
            "id":2792266,
            "title":"Someone else"
        },
        "11113":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Hell Yeah!",
                "Hell No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An enemies spell has a curious effect on her...</span></div></span></div>",
            "created":1576645200,
            "id":2761315,
            "title":"Other"
        },
        "111132":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Takes the Slayers cake",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a food addiction?</span></div></span></div>",
            "created":1576645200,
            "id":2761316,
            "title":"Hell No!"
        },
        "1112":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Been fat from the beginning ",
                "Discovers a fetish",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does she gain?</span></div></span></div>",
            "created":1576645200,
            "id":2761312,
            "title":"Kiki gets big "
        },
        "11122":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "She goes to a library and learns about “feeders”",
                "She starts eating more",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>“What’s this?”<br>\r\n<br>\r\n“Pudding.”<br>\r\n<br>\r\n“And this over here?”<br>\r\n<br>\r\n“Pie.”<br>\r\n<br>\r\n“I had no idea there were so many foods!”<br>\r\n<br>\r\nKeyleth of the Air Ashari was new to living in the “downstairs” world. A child of the air ashari, the half elven woman was known for her naïveté, and beauty.<br>\r\n<br>\r\nLong fiery red hair flowed past her sun kissed face. She was dressed in a light green tunic that while modest, did show off her rather flawless figure.<br>\r\n<br>\r\n“How much?”<br>\r\n<br>\r\n“For what?”<br>\r\n<br>\r\n“Uhhh… one of each?”<br>\r\n<br>\r\nVox Machina was in the city of Emon, and the group was in the middle class of a shopping spree. Most were either at Gilmores or buying weapons, but Keyleth and Vex headed to a pastry shop.<br>\r\n“25 gold.”<br>\r\n<br>\r\n“Vex? Can we?”<br>\r\n<br>\r\nThe Druid turned to her fellow half elf, raven haired Vex’Ahlia, who was waiting patiently by the door.<br>\r\n<br>\r\n“Fine darling. But we are sharing this with the group. Don’t want you to, you know…”<br>\r\n<br>\r\n“What?” Replied Keyleth.<br>\r\n<br>\r\n“Keyleth, you know…” <br>\r\n<br>\r\nThe ranger tried to search for the right way to say this. She blew out her cheeks. When the Druid still looked confused, she said.<br>\r\n<br>\r\n“Get Fat.”<br>\r\n<br>\r\n“What does that mean?”<br>\r\n<br>\r\n“Oh dear.”<br>\r\n<br>\r\nVex sighed and rubbed her temples.<br>\r\n<br>\r\n“Darling, when someone eats more than they should, they get… heavier.”<br>\r\n<br>\r\n“And that’s a bad thing?”<br>\r\n<br>\r\n“Well, to some. I’ve heard there are those that rather enjoy being… bigger. Now let’s pay and move along.”<br>\r\n<br>\r\nAfter paying the baker, the two half elves took their bounty back to Greyskull keep, but keyleths mind was racing.<br>\r\n<br>\r\nHeavier<br>\r\n<br>\r\nBigger<br>\r\n<br>\r\nKeyleth had heard of those words before, obviously. And in her travels they had come across some heavyset individuals. But the idea of becoming that heavyset was … exciting to her? Such a new experience.<br>\r\n<br>\r\nShe might have to explore this at some point<br>\r\n</span></div></div>",
            "created":1576645200,
            "id":2761388,
            "title":"New foods New experiences"
        },
        "111222":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "A few days. Barely a few pounds",
                "A few weeks. 10 pounds",
                "A few months. She’s pushing 50"
            ],
            "content":"<div class=\"\"><div> <span>“Oh this is so good”<br>\r\n<br>\r\nKeyleth took to eating like a duck to water.<br>\r\n<br>\r\nVox Machina was on an extended holiday in Emon, and each of the party members were left to their own devices.<br>\r\n<br>\r\nKeyleth was now a frequent customer at that bakery, buying all manners of treats.<br>\r\n<br>\r\nShe has noticed she has gained, and the feeling is electrifying to her.<br>\r\n<br>\r\nHow long has it been?</span></div></div>",
            "created":1578286800,
            "id":2770207,
            "title":"Keyleth Feasts"
        },
        "1112221":{
            "author_id":"fishcandy",
            "author_name":"Sassmaster195",
            "choices":[
                "Get some cupcakes to bloat out slowly and enjoy it",
                "Go out and get some meats on those bones quickly"
            ],
            "content":"<div class=\"\"><div> <span>Keyleth has just finished the latest of her recent binges. She rubbed her bloated belly with a smile of contentment. She had only just started down this journey and was already seeing results in the form of her abdomen softening from her once, lean,, fit physique, to one that looked big and doughy. She looked at herself in the mirror and began to notice that some other parts of her were getting fatter, as well. <br>\r\n<br>\r\nHer thighs seem to be getting bigger and rounded as the gap between them started getting smaller. Her chest began to make her makeshift bra tight as it was getting a little uncomfortable for the twins. Her ass was one the one part of the gain that surprised her. She never knew that with every bite she ate her ass would swell in size now making its self known unlike its formerly flat shape. “I guess Vex isn’t the only one with curves anymore.” She smiled, excited as she walked into town to pick up some more delectable treats for her belly to eat later. <br>\r\n<br>\r\nWhere should she go? Sweet desserts to make her savor her gains slowly, or greasy foods that’ll make her gain as fast as Vax can run.</span></div></div>",
            "created":1579496400,
            "id":2776446,
            "title":"A few days. A few pounds"
        },
        "1112223":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex has concerns",
                "Vex is bringing more food",
                "Vex has an urgent mission for her and keyleth"
            ],
            "content":"<div class=\"\"><div> <span>Keyleth groaned as she reached over to her nightstand, where a fresh batch of trays waited for her.<br>\r\n<br>\r\nEver since that faithful day, Keyleth let her appetite guide her, and guide her it had.<br>\r\n<br>\r\nKeyleths thighs spread out like marshmallows behind her. For once she was bustier than Vex. Whenever she looked down a double chin would appear on her adorably chubby cheeks.<br>\r\n<br>\r\nBut her gut was her favorite.<br>\r\n<br>\r\nA small boulder of flab on her torso was all hers to massage and shake, which was just beginning to split into a second roll.<br>\r\n<br>\r\nKeyleth picked up a bear claw and devoured it. She moaned in sugary delight.<br>\r\n<br>\r\n“More.” She said to no one but herself. God she loved that word. More food meant more her.<br>\r\n<br>\r\nThen there was a knock at the door.<br>\r\n“Keyleth? It’s Vex.” Said the door.<br>\r\n<br>\r\nKeyleth quickly put another bear claw in her mouth and spoke with her mouth full.<br>\r\n<br>\r\n“C-come in.”</span></div></div>",
            "created":1578286800,
            "id":2770210,
            "title":"Huge Druid"
        },
        "11122231":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Vex voices her concerns",
                "Vex chickens out",
                "Free choice"
            ],
            "content":"<div class=\"\"><div> <span>Vex tried to be supportive of her friends new lifestyle.<br>\r\n<br>\r\nBut the ranger had more than a few qualms<br>\r\n<br>\r\nHow big was she going to get?<br>\r\n<br>\r\nCan she still be useful in combat<br>\r\n<br>\r\nWill she be able to fit through the door?<br>\r\n<br>\r\nVex entered and saw the engorged Druid <br>\r\n<br>\r\n“Keyleth, I wanted to talk to you about something...”</span></div></div>",
            "created":1587618000,
            "id":2823023,
            "title":"Vex has concerns"
        },
        "11123":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yay!",
                "Nay!",
                "What if: Keyleth and Vex?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We could explore the two young lovers first real experiences in Feederism...</span></div></span></div>",
            "created":1582520400,
            "id":2792255,
            "title":"Vax has a thing for larger ladies "
        },
        "111233":{
            "author_id":"fishcandy",
            "author_name":"Sassmaster195",
            "choices":[
                "Keyleth feeds Vex",
                "Vex feeds Keyleth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who feeds who?</span></div></span></div>",
            "created":1582693200,
            "id":2793268,
            "title":"Keyleth and Vex"
        },
        "112":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Zahra ",
                "Lyra",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is gaining?</span></div></span></div>",
            "created":1576731600,
            "id":2761457,
            "title":"Many to choose"
        },
        "1123":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The other tiefling Lilith?</span></div></span></div>",
            "created":1576731600,
            "id":2761458,
            "title":"Lilith?"
        },
        "113":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Allura",
                "Kima ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which allies of VM get the fattening treatment </span></div></span></div>",
            "created":1576731600,
            "id":2761459,
            "title":"Some options"
        },
        "1133":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Nahla, the lovely Nymph from pre stream?</span></div></span></div>",
            "created":1576731600,
            "id":2761461,
            "title":"Big beautiful Nymph"
        },
        "11332":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about percys sister?</span></div></span></div>",
            "created":1578286800,
            "id":2770271,
            "title":"Cassandra De Rolo"
        },
        "12":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Meighty Nein",
                "Guests",
                "Npc"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who in Wildemount getting wide?</span></div></span></div>",
            "created":1576645200,
            "id":2761308,
            "title":"Mighty Nein, guests, NPC "
        },
        "121":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Jester",
                "Beau",
                "Yasha"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jester - lovable cleric<br>\r\nBeau - smartass Monk<br>\r\nYasha - mysterious barbarian</span></div></span></div>",
            "created":1576645200,
            "id":2761310,
            "title":"Meighty Nein"
        },
        "1211":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Always been",
                "Fetish revealed ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does the little sapphire get not so little </span></div></span></div>",
            "created":1576731600,
            "id":2761447,
            "title":"Jester"
        },
        "12113":{
            "author_id":"cr34t1v1ty",
            "author_name":"Creativity",
            "choices":[
                "Yess",
                "No what"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kidnapped and fattened?</span></div></span></div>",
            "created":1597640400,
            "id":2887077,
            "title":"Something else"
        },
        "121131":{
            "author_id":"cr34t1v1ty",
            "author_name":"Creativity",
            "choices":[
                "Beau",
                "Molly"
            ],
            "content":"<div class=\"\"><div> <span>Jester awoke with something in her mouth. She realised she was not in the room she fell asleep in yesterday. Rather she was on a large, fancy bed, the size of four king sized beds together. She sat up, which was harder than normal. She looked down to see something lying in her lap. It was her own stomach, straining the fabric of her dress. It was soft and squishy. She poked it, and giggled. No wait, she had to focus. She looked around her. She was in a big room with pink walls, large windows and big doors in front of her. It must have cost a lot. She tried to get off the bed and to the door, but the thing in her mouth was restraining her. Now that she focused on it, she noticed it was a tube connected to a ceiling and strapped to her head. Why was that? She couldn't get far enough to get off the bed now, in any direction. There was no way to get it off either. Tired from moving around in her new shape too much, she sat down, sweating a bit. And right at that moment, something came out of the tube into her mouth. It ran over her tongue and she outright moaned at the taste. It was like nothing she had ever tasted before, rich, sweet and delicious, and every time she swallowed it she felt all warm. The taste of the liquid pumping inside her was enough to arouse her. She closed her eyes and focused on the taste, rubbing her legs together and eventually rubbing her hand against her wet clit through her dress. Speaking of her dress, she heard something creak. When she opened her eyes, she saw her dress straining. Distracted by the liquid, she had not noticed how tight her dress was feeling. As if on cue, the liquid stopped. She didn't have much time to feel sad at that as she started to have trouble breathing because of how tight her dress was. In all honesty her arousal did not become any less at the feeling of tight fabric clenched around her body, and even more actually when she saw a rip in the fabric forming. With a sharp breath she nearly came in the remnants of the dress as the midsection burst apart, revealing a large blue stomach. Still very on edge and horny, she touched her large stomach. It pushed her even closer. And with the liquid starting again, she came. Her orgasm felt better than any orgasm ever had, and she felt another knot building up as the liquid continued to pump inside her and her stomach slowly but surely expanded with an inch every five minutes. After a few hours of the liquid suddenly stopping, suddenly continuing and an unusual high amount of orgasms, footsteps made their way to the door. Jester barely registered them due to focusing on the creamy rich liquid making its way down into her gullet, but she slowly sat up when the door opened. In the opening stood none other than her friend...</span></div></div>",
            "created":1597640400,
            "id":2887082,
            "title":"Jester in BIG trouble"
        },
        "1212":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Always been fat",
                "Has a feeder fetish",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does the monk gain</span></div></span></div>",
            "created":1576645200,
            "id":2761317,
            "title":"Beau"
        },
        "12123":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She finds out a love interest is into bigger girls</span></div></span></div>",
            "created":1576645200,
            "id":2761319,
            "title":"Other"
        },
        "121232":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>New fighting style for the cobalt soul - sumo</span></div></span></div>",
            "created":1576645200,
            "id":2761320,
            "title":"No"
        },
        "1213":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Has been since the start",
                "Discovers she has a fetish",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What leads our favorite goth barbarian to put on blubber</span></div></span></div>",
            "created":1600482840,
            "id":2905682,
            "title":"Wide Barbarian"
        },
        "12133":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Overeating like she did in Episode 110 catches up to her",
                "When she gets her memories back she remembers being obese",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices for BBW Yasha</span></div></span></div>",
            "created":1600482900,
            "id":2905683,
            "title":"Other"
        },
        "121331":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Her normal weight",
                "50 to 100 pounds",
                "A whole lot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How heavy does she start</span></div></span></div>",
            "created":1600482960,
            "id":2905685,
            "title":"Overeating like she did in Episode 110 catches ..."
        },
        "1213313":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "400 pounds",
                "600 pounds",
                "800 pounds"
            ],
            "content":"<div class=\"\"><div> <span>Yasha groaned as she brought the fork to her lips. It was a bit harder to do this time. Despite being stuffed well past the normal limit, she craved more.<br>\r\n<br>\r\nThe Meighty nein were stumped. One day in Nicodranas their friend decided to eat at the lavish chateaus buffet well past her limit and they laughed it off. But she kept doing it. Weeks turned to months. The seasons passed. Yasha took every opportunity to devour whatever was placed in front of her. Dwendalian delicacies, Xhorhasian delights, even when they killed a mammoth in Eiselcross. <br>\r\n<br>\r\nShe began neglecting her usual workouts, then stopping them entirely. Fat began to develop , covering the pale woman’s ungodly sturdy abs. They all thought “surely she’ll realize and stop eating so much.” If anything, she doubled down. She would interrupt crucial meetings by either crunching something or her belly roaring, and recently had been interrupting meetings by creaking or crashing her chair. In combat she would still pull her weight( or as much of it as she could) by letting the enemy come to her and bringing skin gorger down on them. But travel was extra hard on her now, and she requires constant breaks.<br>\r\n<br>\r\nCaleb cast all manner of spells to see if this was some curse placed on her by their enemies, but found nothing. The Nein all had a meeting and decided Yasha would stay behind at the Xhorhaus from now on, to which she only asked “will there be people giving her food?”<br>\r\n<br>\r\nCurrently she is...</span></div></div>",
            "created":1600483620,
            "id":2905689,
            "title":"A whole lot"
        },
        "12133131":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Someone comes to visit",
                "Yasha is summoned by the bright queen",
                "Someone tries to break in"
            ],
            "content":"<div class=\"\"><div> <span>As she waddled from the kitchen to her couch, Yasha couldn’t help but be pleased with how fat she had gotten. Years of not knowing who she was were at ease. <br>\r\n<br>\r\nGaining weight wasn’t her intention, it was merely a side effect of her newfound appetite. An appetite that had been built up for years. <br>\r\n<br>\r\nHow could her friends understand that this was freedom to her? As she brought the sandwich to her lips she went over what she saw in the mirror in front of her.<br>\r\n<br>\r\nEven when not full of food her cheeks were puffy. When she smiled she could clearly see the adorable double chin she had developed.<br>\r\n<br>\r\nBelow, her previously modest breasts had likewise grown modestly. They were fun to jiggle and play around with, but not nearly as fun as below them.<br>\r\n<br>\r\nA gargantuan, massive gut was the first thing people saw of Yasha, before the black and white hair or the tattoos. Half of her body weight had to be in this thing, and it was perfect to rest things on or jiggle.<br>\r\n<br>\r\nYasha thighs had also seen a bit of weight, giving her an apple styled body. She had seen Beau blush at the sight of her tush when she left the hot tub, and was looking forward to the monk taking a more in depth look soon.<br>\r\n<br>\r\nYasha cooed as she finished her sandwich. Her stomach looked even rounder then before, and she ran her fingers over the pale flesh. <br>\r\n<br>\r\nThis was all her, and hopefully soon there would be more.</span></div></div>",
            "created":1600484280,
            "id":2905696,
            "title":"400 pounds"
        },
        "122":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Reani ",
                "Neela ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There’s a few </span></div></span></div>",
            "created":1576731600,
            "id":2761456,
            "title":"Gaining guests"
        },
        "123":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Ruby of the sea",
                "Avantika",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which lovely lady starts to gain?</span></div></span></div>",
            "created":1576731600,
            "id":2761450,
            "title":"Who oh Who"
        },
        "1231":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "She’s a fat courtesan",
                "Discovers a new fetish",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What leads to Marion Lavorre plumping?</span></div></span></div>",
            "created":1576904400,
            "id":2762692,
            "title":"Jesters Mom (Has Got It Going On)"
        },
        "12313":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone’s introduced a new snack to Nicodranas and all the women are getting addicted ( and fat)</span></div></span></div>",
            "created":1576904400,
            "id":2762693,
            "title":"Great new Confections "
        },
        "1233":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Sure!",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the Bright queen, Leylas Krynn?</span></div></span></div>",
            "created":1576731600,
            "id":2761452,
            "title":"Queenly girth"
        },
        "12332":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "She is",
                "She isn’t "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ophelia Mardun is a good candidate, no?</span></div></span></div>",
            "created":1576731600,
            "id":2761454,
            "title":"Spooky"
        },
        "123322":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There’s potential here</span></div></span></div>",
            "created":1600576920,
            "id":2906590,
            "title":"Calebs old flame Astrid"
        },
        "1233222":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Idk she’s kinda hot</span></div></span></div>",
            "created":1600576980,
            "id":2906591,
            "title":"Lady Vess De Rogna "
        },
        "13":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Baroom Blitz ",
                "Darington Brigade",
                "Song of the Lorelei",
                "Shadows of the crystal palace",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which ones?</span></div></span></div>",
            "created":1576731600,
            "id":2761741,
            "title":"One Shots"
        },
        "135":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yay",
                "Nay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cinderbrush?</span></div></span></div>",
            "created":1582606800,
            "id":2793008,
            "title":"Other"
        },
        "1352":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sure it had some fine ladies</span></div></span></div>",
            "created":1601181000,
            "id":2910716,
            "title":"Undeadwood?"
        },
        "14":{
            "author_id":"reverb9823",
            "author_name":"TheWingMan",
            "choices":[
                "Laura",
                "Marisha",
                "Ashley",
                "Other",
                "Multiple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Laura<br>\r\nMarisha<br>\r\nAshley</span></div></span></div>",
            "created":1576645200,
            "id":2761309,
            "title":"Fine lady’s "
        },
        "145":{
            "author_id":"fishcandy",
            "author_name":"Sassmaster195",
            "choices":[
                "Laura Marisha",
                "Marisha Ashley",
                "All "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who of the female cast gains together? </span></div></span></div>",
            "created":1579496400,
            "id":2776398,
            "title":"Multiple"
        }
    },
    "info":{
        "author_id":"reverb9823",
        "author_name":"TheWingMan",
        "brief_description":"The lovely ladies of Exandria find themselves packing on the pounds",
        "created":1576707660,
        "description":"<td align=\"left\" class=\"norm\">The girls of Vox Machina and the mighty Nein start packing on the pounds! The rules are as follows:<br>\r\n<br>\r\nFemale weight gain ONLY<br>\r\nALL CHARACTERS 18 AND UP<br>\r\nNo vore, scat, or other toilet stuff<br>\r\nTry to write more than one paragraph please.</td>",
        "id":2208172,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1601181000,
        "modified":1601181000,
        "pretty_title":"Critical Role Female Weight Gain"
    }
}