{
    "chapters":{
        "1":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "Breakfast with four naked men is...quite an experience",
                "If you can't beat them, join them in their nudity",
                "Something keeps making a raucous in the night",
                "The twins are still up and want to talk about your obvious crush on Rob",
                "The twins want to talk and learn more about their \"fascinating city boy\" cousin"
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks again for coming out here,\" you said to your Uber driver, and got a grumble in return, \"I'm sorry I didn't realize how far out this place was.\" As the car sped away towards the setting sun you were left standing with your luggage to stare at the impressive, and somewhat daunting, stretch of drive that sprawled out in front of you. It wasn't until you were beginning to huff and sweat that the ranch house and small red barn began coming into view. A single story home with off white paint and a large screened porch lay before you, but what really caught your eye was the men in front of it. Even from a distance they appeared enormous and as the distance between you closed, them now approaching having noticed your arrival, they grew even larger. Two nearly identical men that could be described as no less than dreamy sauntered shirtlessly with exposed muscle bouncing and flexing beneath a healthy coat of black hair, probably your cousins. The man in front of them however was undoubtedly your uncle, he was utterly massive with not one bit of his size lost to the exaggeration of childhood memory, if anything he might be bigger than you remembered, he towered over the other two men, men anyone would consider huge, by more than half a foot, he wore a shirt unlike the others but said blue plaid covering was casually open giving a stunning view of his immaculate body. Muscles bulged over every inch of his body, a thick black furry jungle of a pelt covered his body, and his whole being shone with the glistening sweat of a working man.<br>\r\n<br>\r\n\"Ethan? Little Ethan is that you?!\" he shouted ahead, \"I haven't seen you since.....well hell you were six years old anyways, how old are yah now again? How was your trip? And more than any of that just how the hell are yah boy?\"<br>\r\n<br>\r\n\"Y-Yeah uncle Lucas, it's me,\" you stuttered, a bit taken aback by the entourage of literal giants. \"I-I'm,\" you squeaked a little before clearing your throat and answering more composed, \"I'm twenty-four now, and my flight went alright, except for this weird lady who kept trying to talk to me, so I uh I guess I'm good.\"<br>\r\n<br>\r\n\"Well I'm glad and still just so delighted yah could come out and visit us,\" Lucas beamed a nearly impossible smile at you. \"Now these are your cousins,\" he gestured to the identical men, \"they're right 'bout two years older than you, now go on n' introduce yourselves boy!\"<br>\r\n<br>\r\n\"Right, I'm Alister,\" the left giant greeted you with a dominating hand shake.<br>\r\n<br>\r\n\"And I'm Allen,\" the other twin took your free hand to shake, \"Lookin' forward to gettin ta know yah!\" before they returned your hands, that now possessed the faintest hint of a smoky smell. <br>\r\n<br>\r\n\"One of you boys get his bag and we'll head back to the house,\" Lucas instructed, to which they actually started quibbling over who got to carry it. Alister was the one to ultimately get his wish, at least you were pretty sure it was Alister, as he hiked the heavy suitcase up on to his brawny shoulder as if it were nothing more than a pillow, and again you were making tracks to the house. On the journey uncle Lucas recounted an enchanting tale about when he and his half-sister, your mother, hand been little and spent the night in a haunted barn looking for ghosts, at least until you reached the barn and saw the biggest animal you'd ever seen grazing outside the barn.<br>\r\n<br>\r\n\"Oh my god! That cow is enormous!\" you couldn't help but blurt out.<br>\r\n<br>\r\n\"Ha, Bruno may be cattle, but that ain't now cow!\" Lucas chuckled.<br>\r\n<br>\r\n\"But I can see the ud-\" you stopped short when you realized <i>those</i> weren't an udder, but rather...<i>those</i>.<br>\r\n<br>\r\n\"Tell Ethan about when you bought him pa,\" Allen snickered.<br>\r\n<br>\r\n\"Now don't you boys tell me you've still not had your fill of this fool story,\" Lucas sounded almost a touch embarrassed.<br>\r\n<br>\r\n\"Sorry pa,\" Alister laughed, \"But it's just so funny!\"<br>\r\n<br>\r\n\"What is?\" you asked innocently.<br>\r\n<br>\r\n\"Well pa here thought he was being all slick buying him a great big 'breeding bull,' able to pull a plow and, ha, make an extra profit on the side but,\" Allen stopped, overcome by a fit of laughter and leaving Alister to finish, \"But old Bruno, ha, well let's just say he ain't too fond of heifers!\" he joined in laughing with his brother.<br>\r\n<br>\r\n\"Both of you be damned, he can still pull a plow better than either of you,\" your uncle turned back towards the house.<br>\r\n<br>\r\nWhen you all reached the porch you took a moment to appreciate the understated beauty and comfort of such a home when you saw a large freestanding post with a pipe running on its side up to a...shower head? \"What's that?\" you dared to ask. <br>\r\n<br>\r\n\"That? Why that's just a shower Ethan,\" your uncle replied, \"Don't worry, we got one indoors too, it's just easier some days to clean off outside rather than track a mess in behind yah.\"<br>\r\n<br>\r\n\"Oh right...\" your mind wandered a bit, especially considering there was no stall for privacy, it really was just a post and a pipe. The very next moment though your heart fluttered as a colossus with red wavy hair, even larger than your uncle and sporting thick vibrant matching hairs peaking from his overalls on his chest and all along his enormous powerful arms. This man made your whole body quiver with pleasure as he defined raw power and masculinity, if the unmissable bulge at his groin was anything to go by. <br>\r\n<br>\r\n\"Oh hey Rob,\" Lucas greeted the giant, \"This is my nephew, Ethan. Ethan this is Robert, he helps out 'round here.\"<br>\r\n<br>\r\n\"P-pleased to see you, err meet you!\" you blurted out, the man having seemingly awoken something in you.<br>\r\n<br>\r\n\"Pleased to meet you too sir,\" the man nodded to you, nearly giving you a heart attack having a man roughly twice your age and impossibly handsome defer to you in such a way.<br>\r\n<br>\r\n\"We're gonna get Ethan settled and turn in for the night, alright?\" Lucas explained, \"And I keep tellin' yah you don't gotta be so formal!\" <br>\r\n<br>\r\n\"Right sir,\" Rob nodded to your uncle, \"If it's alright I'll get washed and turn in myself,\" he started unbuckling his overalls.<br>\r\n<br>\r\n\"Now why in tarnation wouldn't that be ok? As long as you're working here you're family just like the rest of us!\" Lucas put his foot down before leading the little entourage inside.<br>\r\n<br>\r\n~~~<br>\r\n<br>\r\nAfter a tour of the house and insisting no less than six times you'd eaten on the plane, and that it was in fact enough, you were now unpacking your bag in your cousins' room. \"Well cuz, what'dya think of the place?\" Allen asked as Alister cleared a drawer for you to use.<br>\r\n<br>\r\n\"It's nice, really nice! I think my stay here will be a great one,\" you answered before glancing to the man seated on a bunk bed he and his twin clearly outgrew but clearly liked enough to keep. Seeing him on the bed, his size further exaggerated, reminded you of a question you'd been dying to ask, \"So guys, I'm not exactly short at five foot ten, but I gotta ask, just how tall are you two?\" <br>\r\n<br>\r\n\"Well I'm six foot eight,\" Alister replied,\"But shorty over there is five foot twenty.\"<br>\r\n<br>\r\n\"Har har,\" Allen rolled his eyes, \"Betcha weren't expecting your relatives ta be a buncha trees, pa's seven feet after all so it was bound to happen.\"<br>\r\n<br>\r\n\"Well I clearly didn't inherit it,\" you chuckled.<br>\r\n<br>\r\n\"Yeah well you're lucky I guess, everyone's always thinkin' cause we're big as trees we're just about as smart,\" Alister sighed and joined his brother on the bed.<br>\r\n<br>\r\n\"That's dumb, I'd kill to be so huge,\" you admitted and then blushed at such a baldfaced confession.<br>\r\n<br>\r\n\"Well we're happy you like it lil' cuz, if you're ready though we're fixin' to turn in,\" Allen replied.<br>\r\n<br>\r\n\"Oh no, go right ahead,\" you answered and were shocked to see the twins, in perfect synchronicity, stand and completely drop trow. The beasts they'd just casually unleashed were nothing less than pythons, thankfully you didn't have to <i>suffer</i> for long as they climbed in bed.<br>\r\n<br>\r\n\"What's wrong?\" one of them asked, having noticed you'd all but froze on the spot.<br>\r\n<br>\r\n\"I...I...uh I, I just wasn't ready for...<i>that</i>...\" you tried to explain.<br>\r\n<br>\r\n\"Ah is that all?\" the other laughed \"I forgot you ain't been around much menfolk, we all sleep like this 'round here, it's relaxin' after a hard day's work.\"<br>\r\n<br>\r\n\"Eat breakfast like it too, so you can get ready for it this time,\" the first again answered.<br>\r\n<br>\r\n\"O-Ok...I, I gotta go get ready for bed...\" you left for the bathroom, toothbrush in hand and caught the briefest glimpse of an imposingly broad back and globular orange haired ass disappearing behind a door and simply returning to bed yourself.</span></div></div>",
            "created":1579997820,
            "id":2778414,
            "title":"A Lesson In Country Livin'"
        },
        "11":{
            "author_id":"jwe90",
            "author_name":"Thatbadwriter",
            "choices":[
                "\"I think I'll join you and see if I can help with the truck\"",
                "\"I'm gonna check out the creek with Alister and Allen I think\"",
                "\"I'll see what Rob is up to, I'm sure I can keep him company\"",
                "\"I might just go on a walk around the farm for now, see what there is to see\"",
                "\"I'm gonna lay down for a bit more, there's something I wanna...take care of\""
            ],
            "content":"<div class=\"\"><div> <span>Your eyes burst open sharply when you heard a rooster crow, and a new day on the farm was signaled to everyone in the rooster's ungodly range. Rolling onto your side in an attempt to defy the morning and go back to sleep, you instead came face to face with some massive throbbing morning wood as your cousin stood over you. \"Mornin' cuz!\" one of the twins greeted you chipperly, not the least bit effected by the fact his penis was inches from your face.<br>\r\n<br>\r\n\".....Um.....\" you hesitated to speak as a pungent musk started to permeate your nostrils, \"Would you back up please?\"<br>\r\n<br>\r\n\"Oh, sure thing Ethan,\" they stepped back revealing your surprised was delivered by Alister, \"Pa should be starting breakfast any minute now so ya don't wanna go draggin' yer feet,\" he said before stepping out and indirectly showing off his bubble butt as he walked out.<br>\r\n<br>\r\nGetting up out of bed was like dichotomy personified as your head pounded, screaming \"What the <b>hell</b> did you get in to,\" while your boner throbbed against your boxers with more than the simple rhythm of your average morning wood, which scared the hell out of you. You made it as far as the door when deep bassy chatter and the clatter of pans and plates froze you in place, the reality that there was a very much naked family in the kitchen being something you didn't know how to process. No, you came here for this...kinda, if you were gonna become \"one of the guys\" it wasn't gonna be by hiding, so with a deep breath you opened the door.<br>\r\n<br>\r\n\"Alright two hardy omelets up to order,\" your uncles deep voice boomed as you turned the corner and almost had an aneurysm. Standing proudly almost entirely nude in the kitchen, save a little pink apron that didn't even go all the way down his torso, looming over his handiwork as his equally shameless boys wolfed down breakfast was uncle Lucas. \"Ethan, what can I make fer ya boy?\" his melodic voice flowed like sweet honey out of a perfectly bronzed body that bulged with muscle in all the right places and was coated with the blackest richest hair anyone had ever seen. In spite of yourself you were powerless not to let your eyes wander...lower...and you saw that again hopelessly average Ethan was somehow related to actual gods, what it may have lacked in the sheer length the twins boasted Lucas's equipment more than made up in girth. The powerful meat between his thighs could easily have been mistaken for a third meaty leg if it didn't come to a fat purple head and rest atop two orbs that very literally made anything but man-spreading an impossibility.<br>\r\n<br>\r\n\"I, I'll just have some scrambled eggs...please...\" you attempted to shake free.<br>\r\n<br>\r\n\"Coming right up!\" he turned back to the stove and unleashed two enormous ass cheeks on you, each almost as big as your entire head and undoubtedly more powerful than your whole body, with a relentless coating of hair to match the rest of him. <br>\r\n<br>\r\nFor a few minutes the only sound was that of silverware on plates as your cousins ate their breakfast, briefly pausing to either look at you or their dad then share some kind of...twin telepathy? \"Well we're gonna go wash up,\" Alister said, as he and Allen stood up and again unleashed two monsters of ungodly length to literally flop down onto the table. <br>\r\n<br>\r\n\"Thanks for breakfast pa, it was great as usual,\" Allen complimented as he and his brother headed towards the bathroom, and you could swear as they turned the corner you saw the briefest glimpse of a playful spank.<br>\r\n<br>\r\nThere was literally no time to dwell on the image though as you found your uncle's thick musky club next to your face as he delivered your eggs, \"Hope you enjoy Ethan,\" he smiled almost brighter than the sun. Before you could as much as power through this bizarre dreamlike haze and take a bite, another door down the hall opened and steps that you could feel resonating in your body made their way to the kitchen. The man that entered the kitchen was more than you could handle and you began lightly squirming in your chair as a behemoth, more than a head taller than your uncle with at least fifty percent more muscle, lazily scratch the gorgeous orange hairs on his broad chest with a yawn.<br>\r\n<br>\r\n\"Mornin' Rob, the usual?\" your uncle asked.<br>\r\n<br>\r\n\"Yes sir, with extra sausage please,\" Rob sleepily rumbled with a voice that effortlessly made your very bones tremble. And speaking of sausage did he sure have some, beneath his massive bush of crimson pubic hair the ginger giant wielded a massive hairy monster that was not only longer than the dual pythons the twins possessed, but was somehow thicker than Lucas's barrel of a cock with balls bigger than the boner you were hiding that were undoubtedly the cause of his bowleggedness. \"G'mornin' sir,\" his delectable voice graced you again as he sat with you.<br>\r\n<br>\r\nIt took you a minute to realize that you were actually the \"sir\" this older man had just addressed before you returned his greeting. You still had yet to start on your eggs by the time your uncle gave Rob his and began working on his preparing own, but you made a point to join the man in his morning meal as he ate approximately three to four of your own bites worth of food with every one of his own. One thing that both confused and astounded you though was the fact that rather than get up to start his unquestionably busy day when he finished, he actually sat with you and stole the occasional glance. Twice even he appeared to nibble at his thumb in a way that turned your cheeks red, a blush that was hidden by your immediate loss of control which resulted in you hacking on a piece of your meal.<br>\r\n<br>\r\nWhen you finished he finally got a up and, with one last glance that hadn't been as subtle as he'd meant it, departed to get ready himself, granting you one more view of the beautiful wide shoulders and perfectly spherical ass.<br>\r\n<br>\r\n\"Well boy, whatcha fixin' to do today?\" you uncle asked, slightly alarming you because he'd sat down and eaten completely unnoticed during your...<i>observation</i>. \"I'll be out working on that blasted truck today if you care to join me, I know yer cousins were fixin' ta go down to that crick today, Rob seems awful lonely so he might want some comp'ny while he's tendin' farm, or you don't need ta do a dang thing if yer not feeling it, the world is your oyster and I'm sure any of us would just want ya comfy,\" he smiled his impossible smile again and began clearing his plate.</span></div></div>",
            "created":1580501100,
            "id":2780917,
            "title":"A Breakfast To Remember"
        }
    },
    "info":{
        "author_id":"jwe90",
        "author_name":"Thatbadwriter",
        "brief_description":"After an invite for a stay at your uncle's farm a slew of wild events begin happening.",
        "created":1579891680,
        "description":"<td align=\"left\" class=\"norm\">Your name is Ethan and last week you got a letter in the mail from your uncle Lucas inviting you to come for a stay on his farm with him and your cousins you'd never known you had. While growing up you hadn't had a father and only met your uncle twice as a result of your mother's apparent need to put her past life behind her. Thusly you'd been without much of a masculine influence in your life, so this was a perfect opportunity to kill two birds with one stone by getting to know your family better and possibly put some hair on your chest.<br>\r\n<br>\r\n<br>\r\nThis interactive will be M/M and can, and likely will, feature stuff like growth, incest, anthros, shrinking, and plenty of other things but I do not want to see things like diapers, scat, rubber, or inanimate (sorry but it's not for me)<br>\r\n<br>\r\nFeel free to message me to discuss ideas/future chapters, I'm more than willing to add something for you if you don't want to, and if you add I'll do my best to add back.<br>\r\n<br>\r\nIf you do add please try to make it coherent and keep in mind other readers, and no purely choice chapters</td>",
        "id":2211152,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1580501100,
        "modified":1580501100,
        "pretty_title":"Life On The Farm"
    }
}