{
    "chapters":{
        "1":{
            "author_id":"dlatwood",
            "author_name":"The Enchanting Female Latios",
            "choices":[
                "Goal 1"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the Pokegirl Quest a brief overview of the world, and how the female Pokémon are feared by the humans because, for the male's at least, they lust for their seed and, when they catch a man, they may turn them into a male Pokémon (all male Pokémon are made this way) and/or make them their lover or slave.<br>\r\n<br>\r\nThis chapter will hold all the goals and such you have to accomplish.<br>\r\n<br>\r\nGoal 1: To get to Mew to convince Her to return the world to the harmony of old.<br>\r\nGoal 2: To find out why Mew is acting so strange<br>\r\nGoal 3: To find a way to break into Mega Mewtwo Y’s lair<br>\r\nGoal 4: To find the Secret Pokéball, the only Pokéball left in existence<br>\r\nGoal 5: To capture Mega Mewtwo Y with the Secret Pokéball<br>\r\nGoal 6: Success!<br>\r\n<br>\r\nChapter 1: Introduction to the fact that you were chosen to try and get to an understanding with the Queen of the Pokémon, Mew so that humans and Pokémon can live in relative peace.<br>\r\n<br>\r\nGoal 1 subgoals:<br>\r\nFind the location of Mew's Castle<br>\r\nGain the Three Orbs (Red, Blue and Green, guarded by Groudon, Kyogre and Rayquaza respectively)<br>\r\nBring the Three Orbs to Celebi to gain access to Mew's Castle<br>\r\nGet past Mew's guards (Latios, Xerneas and Ho-Oh)<br>\r\nTalk to Mew (This leads to her acting a bit out of character as she tells you that something is messing with her)<br>\r\n<br>\r\nGoal 2 subgoals:<br>\r\nLeave Mew's Castle<br>\r\nHelp Celebi defend the Castle from Moltres (which leads to you finding out that some Pokémon are suddenly rebelling)<br>\r\nFind the leader of the Rebels, Lugia (She will tell you that she knows who is the one who is causing all of this problems: a Mewtwo who was created by humans, but after getting a tainted Mewtwonite Y, turned into what she is now)<br>\r\n<br>\r\nGoal 3 subgoals:<br>\r\nFind Mewtwo’s lair<br>\r\nFind a way to get up to the entrance (as it's high up - you can ask Latios or Ho-Oh for help, yet Ho-Oh is not a good choice, as she may make you climax from her heat)<br>\r\nAvoid being taken by Yveltal<br>\r\n<br>\r\nGoal 4 subgoals:<br>\r\nFind four pieces of the map which said to show the way to the Secret Pokéball (each being guarded by a Legendary)<br>\r\nFind the Ruins marked on the map<br>\r\nSolve the riddle of the Ruins (Failing will cause you to end up facing Hoopa, which is impossible to win)<br>\r\n<br>\r\nGoal 5 subgoals:<br>\r\nReturn to Mewtwo's Lair<br>\r\nStop Yveltal again<br>\r\nAvoid Mewtwo's traps (failing will cause Mewtwo to have her way with you)<br>\r\nWeaken Mega Mewtwo Y<br>\r\nGet the Secret Pokéball to capture Mewtwo! (Note: Direct throws will only lead to her catching it before turning you into a Pokémon and then capturing you with it before you could tell what you turned into. You must trick her into being hit by it)<br>\r\n<br>\r\nGoal 6 subgoals:<br>\r\nGet back to Mew with the Pokéball<br>\r\nWake up Arceus<br>\r\nDecide your reward - either to become a new Mewtwo to take the place of the old one, to become a Gijinka so that a middle ground can be found, or to become an embassy of peace between humans and Pokémon. Either way, the story ends with success.<br>\r\n<br>\r\n</span></div></div>",
            "created":1526330220,
            "id":2493186,
            "title":"Welcome to Pokegirl Quest"
        }
    },
    "info":{
        "author_id":"dlatwood",
        "author_name":"The Enchanting Female Latios",
        "brief_description":"A chosen male aka you is supposed to bring peace to the world through a journey",
        "created":1366123140,
        "description":"<td align=\"left\" class=\"norm\">a brief overview of the world, and how the female Pokémon are feared by the humans because, for the male's at least, they lust for their seed and, when they catch a man, they may turn them into a male Pokémon (all male Pokémon are made this way) and/or make them their lover or slave.<br>\r\n</td>",
        "id":1929285,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1560806760,
        "modified":1560806760,
        "pretty_title":"Pokegirl Quest"
    }
}