{
    "chapters":{
        "1":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Erica - 16",
                "Erica - 18",
                "Erica - 23",
                "Erica - 30",
                "Erica - 42"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welcome to the story of Erica. Which Erica will you follow today?</span></div></span></div>",
            "created":1456030800,
            "id":2107453,
            "title":"Welcome!"
        },
        "11":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "At home...",
                "At school...",
                "At an event...",
                "At a party...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does our story begin?</span></div></span></div>",
            "created":1456030800,
            "id":2107456,
            "title":"Erica - 16"
        },
        "111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107457,
            "title":"16 - At Home: Pick a story!"
        },
        "1111":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "The classic shrinking ray",
                "Radiation of some sort ",
                "An inate ability that no one knew about "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We all know this story; Erica shrinks somehow at home, she’s got siblings, situations get weird. But the question is; in which of these uncreative ways will she shrink?</span></div></span></div>",
            "created":1515756420,
            "id":2439779,
            "title":"Generic shrinking placeholder "
        },
        "112":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "The Burn",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107458,
            "title":"16 - At School: Pick a story!"
        },
        "1121":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Someone was in there...",
                "Nobody was in there...",
                "Actually, just keep going to the lunch hall..."
            ],
            "content":"<div class=\"\"><div> <span>Erica hunched at her desk. It had been a long day at school and it was nearly lunch. She sighed as she flipped open her textbook and reached for a pen and began to write.<br>\r\n<br>\r\nThe first three periods were a complete drag for the bored and tired teen. It had been a long week, everyone is prepping up for their end-of-year exams and emotions are running at an all time high.<br>\r\n<br>\r\nAfter only breaking up with her boyfriend of a good 9 months a few days ago, her small clique of friends could stem the loneliness that Erica was going through and the gap that he ex, Mike, had left behind. It was Erica that broke up the seemingly happy relationship. The teen wasn't happy with Mike's attitude when we was hanging around other people. Showing Erica off like she was a prize, another point on his score card to boost his immature and disrespectful ego.<br>\r\n<br>\r\nBut even with her friends by her side, Erica still received the odd snide comment here and there by her rival and her friends. Aakarsha. Or Aki, for short. Aki was a teen of the same age as Erica, but that was all that they had in common. <br>\r\n<br>\r\nAki was a confident and strong minded teen of Asian-Indian descent, that was beautiful no matter what angle she was looked upon, and she knew it. She knew how to work the lads, and the ladies, when she needed to use them for her advantage. Aki wasn't naturally mean natured, but she knew if she had an end goal, she would do anything to achieve it. <br>\r\n<br>\r\nErica's relationship with Aki begun many years before now, when they were friends in primary school. But as they grew up, Erica was more interested in her studies and personal fitness, than Aki was with her socialising and being generally the \"popular one\". But even then, they were still friends.<br>\r\n<br>\r\nIt wasn't until a night when Aki slept over at Erica's one weekend, on a Friday night when her parents were away. The two teens had raided the cupboard with the alcoholic beverages stored inside, a cupboard strictly for adults, Erica was told. After a few drinks and some time had flown by, Erica was winding down for the night, while Aki had different ideas. <br>\r\n<br>\r\nAs Erica was near-enough dropping to sleep, she felt something soft push on her lips. Mid-sleep, she didn't think anything of it and continued to fall into slumber. But yet again, she felt something soft and warm push against her lips, and then... Something warm and wet, something spongy.<br>\r\n<br>\r\nThen was when Erica quickly opened her eyes, startled to see that Aki had climbed on top of her, although not actuallt making any contact with her body, but her face hovered just above hers, eyes closed and lips ever so slightly pursed. Erica initially freaked, pushing Aki to one side and nearly kicking her out of the house.<br>\r\n<br>\r\nThe two fell out completely and struggled to even pass a few words to each other without Aki scolding her with her sharp brown eyes. Erica always believed that had Aki simply asked or talked about what she might have wanted to do, she would have been completely open minded about her. But the fact that she was kissing her as she slept, made Erica wonder how far Aki would have gone had she continued to sleep.<br>\r\n<br>\r\nToday, Aki and her group of friends had teased Erica in the form room and in her English class. Thankfully, that's all Erica had to see of Aki until after lunch for one more period for the day. There were other pupils that Erica got on well with, and not so well with in the school, but Aki was her real thorn in the side. She wish Aki would have been different, or even just apologized, but for now, that was a wish not likely to become true any time soon. <br>\r\n<br>\r\nErica scribbled her formula into her book, as did the rest of the pupils in her class. It was Chemistry, one of her favorite classes of the day. It was just a shame she was so down when she started the class! Today was not a day of education, but revision. The class was half empty, and only the pupils who wanted and needed some extra study time were here.<br>\r\n<br>\r\nErica hadn't even realised the time before the bell rung, and she jumped, knocking some liquid onto her hand as she was just preparing a concoction of different acids. The liquid sizzled her skin, making her wince and twitch in pain. <br>\r\n<br>\r\n\"Oww, Jesus! Just the last thing I need right now...\" mumbled Erica as she left her desk and rushed to the sink, and quickly washed off the liquid. The burning sensation continued, but that was to be expected. She tidied her things away, and lifted her rucksack onto her shoulder and made her way to the lunch hall.<br>\r\n<br>\r\nShe feels the burning sensation in her hand become more and more apparent, so she decided to take a quick stop into the ladies...</span></div></div>",
            "created":1458536400,
            "id":2120911,
            "title":"STORY START: Erica's Burn"
        },
        "113":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107459,
            "title":"16 - At An Event: Pick a story!"
        },
        "114":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107461,
            "title":"16 - At A Party: Pick a story!"
        },
        "12":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "At home...",
                "At college/University",
                "At an event...",
                "At a party...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does our story begin?</span></div></span></div>",
            "created":1456030800,
            "id":2107462,
            "title":"Erica - 18"
        },
        "121":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107463,
            "title":"18 - At Home: Pick a story!"
        },
        "122":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107464,
            "title":"18 - At College / University: Pick a story!"
        },
        "123":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107465,
            "title":"18 - At An Event: Pick a story!"
        },
        "124":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107466,
            "title":"18 - At A Party: Pick a story!"
        },
        "125":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "On a holiday...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options...</span></div></span></div>",
            "created":1466883300,
            "id":2170735,
            "title":"More Options..."
        },
        "1251":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Cruise ship...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of a holiday?</span></div></span></div>",
            "created":1466883360,
            "id":2170736,
            "title":"Holiday Options"
        },
        "12511":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Erica, Sarah and The Cruise",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story!</span></div></span></div>",
            "created":1466883480,
            "id":2170737,
            "title":"Pick a story!"
        },
        "125111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Erica wakes up on the floor in the corridor...",
                "Choice 2...",
                "Choice 3..."
            ],
            "content":"<div class=\"\"><div> <span>Erica sighed as she brought her glass to her lips and took a sip of her cold dry white wine.<br>\r\n<br>\r\nIt had been a long day, most of it waiting in the customs and waiting area at the docks waiting to board her home for the next two weeks. Everyone including Erica could see the giant ship from outside the waiting the area through the long wide glass windows. It had docked a couple of hours earlier and was currently loading people slowly onto the ship.<br>\r\n<br>\r\nErica, thankfully, wasn't on her own, her friend Sarah was by her side for the most part. The two 18 year olds were taking their first big holiday together and the cruise holiday in the Caribbean sounded right up there street. Sun, sea and... sexy men?<br>\r\n<br>\r\n\"Ooh, he looks nice...\" Sarah mumbled, checking out an older man just crossing the gates and disappearing down the tunnel connected to the ship. Erica grinned and rolled her eyes and shook her head.<br>\r\n<br>\r\n\"They all do to you Sarah!\" Erica giggled and Sarah laughed with her.<br>\r\n<br>\r\n\"I can't help it! Two weeks on a boat, c'mon even you must be having a cheeky look at a few guys here!! Sarah giggled again. Erica continued to grin, her friend wasn't wrong. Earlier, Sarah had gone to the toilet leaving Erica on her own and with her spare time, she too glanced around the waiting area and spotted another older gentleman, who had turned his head just as she looked and they locked eyes with each other. Erica blushed and the man smiled. <br>\r\n<br>\r\nShe hadn't noticed that the man's wife, who was standing near a vending machine on the other side of the room, noticed the two glancing looks. <br>\r\n<br>\r\nOnce Erica and Sarah finally boarded the boat, they went quickly to their rooms so they could dump their gear so they could have a look around the boat. Unlocking the door, they stepped into their room that they would be sharing, with it's en-suite bathroom and decent room space, they had plenty of room to share. <br>\r\n<br>\r\nThe two spent the rest of the day in the bar and at the pool on the top deck, the cruise liner had left port but the two didn't notice, they were well into their third glass of wine by the time the ship set sail. The pool was full of people of al ages, sizes and ethnicities, it certainly was a big boat full of passengers from all corners of the world. The sky was blue and the air was warm, this was going to be a good holiday.<br>\r\n<br>\r\nAs the day went on, Erica and Sarah had met lots of different people at the bar and even got chatted up by a few guys. And a couple of women too, but Erica was more interested in having a couple of days to settle on the boat first. Sarah however, was already taking numbers and giggling away with a couple of good looking guys that had wandered to the pool.<br>\r\n<br>\r\nWanting to take a picture of Sarah and her new friends, Erica decided to go and get her phone from her room and quickly left the pool with her towel wrapped round her waist. She put on her sandals and made her way to her room. <br>\r\n<br>\r\nOn her way through the maze-like interior of the cruise, Erica bumped into a few people she had seen in the waiting area and around the boat as they were boarding and said hello with a smile. Looking down in her hand for her keys as she walked on her floor on her corridor, she head butted into something hard, and soft at the same time.<br>\r\n<br>\r\n\"Ow!\" She moaned as she looked up, rubbing her head and looking in the blue eyes of a 6'5\" 30-something-year old man who was looking right back her with a grin.<br>\r\n<br>\r\n\"Oops, sorry! Didn't see you there!\" The man joked, looking down at the 5'3\" Erica standing before him. Erica chuckled, also noticing his built tanned body under his red vest. He looked very handsome too.<br>\r\n<br>\r\n\"Sorry, I was just... I was just getting...\"<br>\r\n<br>\r\n\"Your keys, no worries. See you around then...\" The man said, hanging on his sentence.<br>\r\n<br>\r\n\"Erica!\" Erica quickly said with a bigger smile.<br>\r\n<br>\r\n\"Well, see you around then Erica. I'm Jon, keep your head up now!\" He chuckled as he walked around her and up the corridor. Erica watched him until he was gone, locking her eyes on his round bum pushing out against his white shorts. She felt herself blush as she wandered to her door and unlocked it. Quickly grabbing her phone, she locked her door again and left for the pool.<br>\r\n<br>\r\nIn the maze, she got lost and ended up wandering to a bar on the inside of the boat. On the entrance, it said NO CHILDREN ADULTS ONLY. As she walked into the bar, she could see posters for adult disco nights, bingo and a singles night. There were loads of events on with many different bars on the ship, and feeling slightly overwhelmed, she walked to the bar and waved down the man behind the bar so she could ask for directions. He nodded to her position on the bar but he was serving someone else at the time. She leant forward on the bar and sat her bum on a stool and waiting. <br>\r\n<br>\r\nWhile she waited, she thought it was weird how she had gotten used to the rocking of the boat. She had been worried for a while she if she was seasick, that she would end up hating the holiday. Erica had never been at sea before and this was not a cheap holiday to be ill on. She couldn't wait to have one of the days to have a walk on the islands when they docked and what she and Sarah would get up...<br>\r\n<br>\r\n\"Hello there sweetie!\" An American woman's accent cut through her daydreaming and brought Erica back to reality. She blinked and turned her head to look at the woman who had stood at the bar next to her. The woman was smiling at her and Erica had only a moment to take in the details of the person standing next to her.<br>\r\n<br>\r\nThe woman was in her forties, easily. Long blonde hair and a somewhat Amazonian, chunky body type to her. The woman didn't seem to be embarrassed about her big bust pushing up against the bar, nor her firm bottom all contained in a black bikini. She sported a few tattoos on her torso and one big snake tat on her right thigh and that's when Erica noticed her thick legs, build to crush the heads of the victims that dared put their heads there in the first place. She was also a bit taller than Erica, standing at 5'10\" but her personality didn't seem intimidating at all.<br>\r\n<br>\r\n\"How're you enjoying the trip so far honey?\" The woman asked nicely.<br>\r\n<br>\r\n\"O-oh... Really good so far! I've had a few drinks and managed to get a bit of sun in at the pool on the top desk-deck so it's going well so far! How about you?\" Erica asked, trying her best not to sound shy, nor drunk for that matter. <br>\r\n<br>\r\nThe American laughed a little, instantly picking on Erica's slurring. \"Well it definitely sounds like you've had a good one so far! Have you come on your own or are you with a...\"<br>\r\n<br>\r\n\"A friend.\" Erica said.<br>\r\n<br>\r\n\"Ah OK! Here for two weeks too?\" She asked, genuinely interested in Erica it seemed.<br>\r\n<br>\r\n\"Yeah, staying on deck C on the east corridor...\" Erica replied, not really thinking out what she had replied to. The American laughed again.<br>\r\n<br>\r\n\"Haha, well OK then! Well I hope to see you around cutie! Maybe I'll have to show you where my room is...\" The American drifted off, as she picked up a couple of glasses the barman had just put down, and walked away with a wink and a smirk at Erica. <br>\r\n<br>\r\nErica was genuinely confused for a moment. Had the woman tried chatting her up? Erica had never had that experience before, but it was very welcoming all the same. It sent a tingle up Erica's spine as she thought about the woman, not daring to turn around to see where and who she had sat down with. She blushed as she finally asked the barman for the direction of the top pool. <br>\r\n<br>\r\nThanking the server, Erica turned to leave the bar and heard some giggling coming from a table that the blonde woman had turned and walked to. She didn't dare look, but blushed even harder as she left.<br>\r\n<br>\r\nFor the rest of the day, it was a day of pool and more wine and more sun. As first days go, it was a long one but a good one. And as the two finished their bottle of wine on the deck in the cool night, Erica finally decided to call it. Sarah agreed, but passed out on the decking instead. Erica shook her head, and made her way to her room.<br>\r\n<br>\r\nAs she made her way though the narrow stairs and corridors with the thick red carpets and dim evening lights, Erica began to feel hot like she was burning up from a fever. Her hands were sweating and her forehead dripping. Maybe she had eaten something she hadn't? Too much drink perhaps? She finally made it to her corridor having passed various guests and staff along the way, wondering whether or not she would end up throwing up on them as she pushed passed them.<br>\r\n<br>\r\nBut soon, she blacked out and landed on the red carpet with a soft thud.</span></div></div>",
            "created":1466886960,
            "id":2170769,
            "title":"STORY START: Erica, Sarah and The Cruise"
        },
        "1251111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Someone on their own...",
                "Someone with another person...",
                "It was nobody..."
            ],
            "content":"<div class=\"\"><div> <span>Erica woke up with a pain on her right temple as if someone was forcing a hot poker into her head. Dizzy and head waving, she lifted herself onto her bum and leant back against the wall with her eyes rolling in to the back of her head, her vision blurred. <br>\r\n<br>\r\nHer first thoughts were that of someone waking up after a long night on the drink. How much did she have? Where is she? Am I going to be sick? So many questions but the alcohol running through her body slowed down her thought process completely. It took her nearly 5 minutes at least before she managed to have a concious thought about figuring out what was going on. <br>\r\n<br>\r\nShe called out for Sarah, but no reply. Shouting hello over and over again brought no response from anybody. Erica rubbed her eyes as she slid upwards against the wall and tried to stand on her own two feet. This was when Erica noticed something different about the carpet.<br>\r\n<br>\r\n\"Why is it so... Soft and s-spongey?\" She mumbled to herself. Slowly, she was becoming more sober and soon, she was starting to see the entirety of her predicament. The tiny woman whimpered as she looked up at the doors towering along the walls, her own door looked like it was a couple of miles away in walking distance. But it couldn't be, surely? <br>\r\n<br>\r\nErica couldn't get her words out, she was mumbling questions to herself, asking why she was so small? Who could have done this to her? Could ANYONE have done this to her? What about Sarah, was she the same size as Erica? Even now, the thought of being so small completely baffled her to the point of Erica doubting her own sanity. <br>\r\n<br>\r\nAfter suffering a somewhat minor panic attack and having lost her train of thought, the next best thing was to make it to her room and work something out from there, and so Erica began to make her journey down the corridor to her room. She wondered, with tears in her eyes streaming her make-up, whether she should be walking in the middle of the floor, so that somehow possibly someone might see her. She didn't know what time it was but surely someone would have to walk down here before she made it to her room, and with that she made her way to the middle of the floor to continue her journey. <br>\r\n<br>\r\nThe thick red carpet slowed down her progress. It was like walking in dry mud, her feet sunk into the carpet up past her ankle and made walking very arduous. But that didn't matter to Erica, she was still in frantic about her situation and with no easy answer in sight, her options were limited. <br>\r\n<br>\r\nThen, she heard it. The door opening at the end of the corridor that led to the upper deck. Someone was coming...</span></div></div>",
            "created":1466888100,
            "id":2170776,
            "title":"The Red River"
        },
        "12511111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Sarah...",
                "Someone she had met...",
                "Someone new..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But who indeed?</span></div></span></div>",
            "created":1466960940,
            "id":2171142,
            "title":"Someone On Their Own... But Who?"
        },
        "13":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "At home...",
                "At a place of work...",
                "At an event...",
                "At a party...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does our story begin?</span></div></span></div>",
            "created":1456030800,
            "id":2107467,
            "title":"Erica - 23"
        },
        "131":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107468,
            "title":"23 - At Home: Pick a story!"
        },
        "132":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107470,
            "title":"23 - At A Place Of Work: Pick a story!"
        },
        "133":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107471,
            "title":"23 - At An Event: Pick a story!"
        },
        "134":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107472,
            "title":"23 - At A Party: Pick a story!"
        },
        "14":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "At home...",
                "At a place of work...",
                "At an event...",
                "At a party...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does our story begin?</span></div></span></div>",
            "created":1456030800,
            "id":2107473,
            "title":"Erica - 30"
        },
        "141":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107474,
            "title":"30 - At Home: Pick a story!"
        },
        "142":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107475,
            "title":"30 - At A Place Of Work: Pick a story!"
        },
        "143":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A Wedding Story",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107477,
            "title":"30 - At An Event: Pick a story!"
        },
        "1431":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "A female guest finds her...",
                "A male guest finds her...",
                "Nobody finds her... Yet..."
            ],
            "content":"<div class=\"\"><div> <span>Erica hiccuped, and a little burp followed.<br>\r\n<br>\r\n\"Oop, exc-excuse me...\" she mumbled to herself, then quickly remembering that she was now sat on her own. It was late in the evening but that didn't stop the guests heading to the dance floor.<br>\r\n<br>\r\nThe 30 year old arts saleswoman was starting to feel the drink flowing through her veins reaching her head now. It had been a long day and now it was time to relax and unwind amidst the chaos.<br>\r\n<br>\r\nShe had attended her work colleagues wedding, having known her for little over a year. But Erica and Sammy had become good friends in the time they had worked with each other and the invite to her wedding only cemented their friendship.<br>\r\n<br>\r\nThe wedding had been fairly tradition. Tops and tails, dresses, bouquets and all. The evening dinner had been finished not more than 20 minutes ago and now everyone was dancing. Mainly the kids and parents, whilst everybody else mingled. <br>\r\n<br>\r\nErica didn't know anybody, the guests mainly being Sammy's old friends and family from where she came from originally. Everybody seemed nice enough, single people, couples and families were all there and Sammy seemed to know lots of people from all different walks of life. As Erica scanned the dance floor, she noticed the middle-aged woman who had introduced herself at the door to the reception. Possible Sammy's mother or close relation. The kids that kept talking behind her, kicking her chair while the wedding went on, even after she asked them to stop and having shushed them. The two gentleman who had picked her up after she fell over on her way to the toilet danced in a hilarious drunken state, and the various other guests she had met throughout the day. There was no sign on the bride and groom, who had their first dance only minutes ago.<br>\r\n<br>\r\nShe smiled and gripped her glass again and raised it to her red-coated lips. Hiccuping again, she accidentally tipped a little bit of champagne onto her cream dress.<br>\r\n<br>\r\n\"Bollocks!\" she muttered and quickly dabbed at the splash on her thigh, and took a sip of her drink. \"Bloody hiccups... Good thing it won't show too bad.\" Putting her glass back down, she shuffled her dress around her breasts after noticing it had become slack on her body, pulling up the dress from the front of her round breasts. She couldn't wait to get out of it, as much as she liked wearing it. Same went for her heels, she could feel her feet swelling now and couldn't wait to get a bag of frozen peas on them to cool them off.<br>\r\n<br>\r\nA popular song blared from the DJ's speakers, and soon more than most of the guests that had stuck around was on the dance floor, but Erica decided to continue to watch the fun-loving crowd. And that's when she sneezed.<br>\r\n<br>\r\nIt felt like a sneeze, cough and burp all at the same time. The kind of sneeze that makes you feel like you've split your diaphragm open and Erica blacked out for only a moment, leaning over the table.<br>\r\n<br>\r\nShe came too as the blood that rushed to her head subsided and regained her vision and other senses. And, in a way, instantly wish she hadn't. She was now stood on the table she was sat around, standing next to her tall champagne glass, now not more than half an inch tall in her tiny dress. <br>\r\n<br>\r\nWhat had happened to her? What will she do next?!</span></div></div>",
            "created":1459722720,
            "id":2127200,
            "title":"STORY START: Erica And The Wedding Guests"
        },
        "14311":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Elsie - 13",
                "Sammy (Bride) - 28",
                "Miranda - 46"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which guest?</span></div></span></div>",
            "created":1459723140,
            "id":2127202,
            "title":"A female guest finds her..."
        },
        "143111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Elsie notices Erica on the table...",
                "Elsie knocks Erica off of the table...",
                "Elsie DOESN'T notice Erica after all..."
            ],
            "content":"<div class=\"\"><div> <span>Erica stared up at the bottom of her glass towering high above her. She was stood next to the base of the stem and could see the sparkling bubbles forming at the rounded bottom. <br>\r\n<br>\r\n\"Th-this can't be, what the hell happened to me?!\" She began to panic, quickly losing the strength in her legs and buckled to her knees, and slumped on to her behind. Holding a hand to her chest, she began to breathe heavily, trying to think through her sudden situation but it was hard to hear herself think over the booming music coming from the speakers.<br>\r\n<br>\r\nShe looked around and noticed her giant fork, yet to be collected by the waiting staff, laying near her. She could see her giant thumb print on the side from when everyone had been eating earlier. It was hard to take in the sense of scale, something that was small enough to be held in her hand now looked large enough to warrant it's own airport hanger. It was simply enormous, as was everything else around her. From her purse, to her cutlery, everything was just stupidly gigantic to the tiny woman now.<br>\r\n<br>\r\nAs Erica was trying to make sense of it all, suddenly the tall glass toppled sideways as the table violently lurched. Quickly, she got to her feet and dived away from the glass as it tipped onto the table and rolled on it's axis towards her, making a wave of bubbly wash towards her. She yelped as she tried to get to her feet, but the alcoholic beverage washed up her legs and soaked her dress, instantly soaking in a vast amount and making her dress incredibly heavy. It washed further up her body, over her head and hair and completely coated her.<br>\r\n<br>\r\n\"Oh no, oh no...!\" Erica splashed in the tiny puddle, or what seemed like a large pond, of booze and jumped at the sound of a young teen talking high above her. She rolled on her back to get a better view and was instantly stunned at the sight before her.<br>\r\n<br>\r\nElsie was a pretty strawberry-blonde with deep emerald eyes, a small button nose and a cute face plastered with light freckles. She had her hair in curls draping over her right shoulder, just lightly touching the top of her modest breasts for her age and her silver chained necklace that was wedged between them, that were tucked into her light blue dress that hung down to her knees. She had obviously bumped into the table whilst dancing and knocked the glass over and now she was rushing to find something to dab the drink with. But something else Erica noticed about Elise. <br>\r\n<br>\r\nShe was one of the kids that she had shushed earlier int he ceremony, receiving a scowl after doing so. <br>\r\n<br>\r\nThis didn't really mean much to Elsie, she guessed the teen wouldn't remember her anyway. It looked like the teen had helped herself to a could of drinks as it was. Erica noticed her balancing on her feet was slightly off, and watching her reach for a serviette only confirmed it as the teen almost fell over reaching over the table.<br>\r\n<br>\r\nErica didn't care either way, she needed this young woman's attention. She tried to get onto her feet, but she just couldn't lift herself from the additional weight the dress had taken on. She could only watch and yell for her attention, and the rest was down to pure luck.</span></div></div>",
            "created":1459726740,
            "id":2127235,
            "title":"Elsie - 13"
        },
        "1431111":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Elsie remembers Erica...",
                "Elsie doesn't remember Erica...",
                "Elsie forgets about Erica before finding Sammy..."
            ],
            "content":"<div class=\"\"><div> <span>Erica continued to yell up to Elsie, who had now started to dab and wipe up her mess whilst everyone else was still on the dance floor. It was when Elsie slammed the serviette with a band onto the table, making Erica jump, that she knew she couldn't get her attention this way, and possibly even get crushed in the process.<br>\r\n<br>\r\nShe quickly turned on her front and hiked her dress up her toned thighs and struggled to get to her feet. She lifted herself up and began to trot, noticing for the first time that her shoes hadn't shrunk with her and now her bare feet were sploshing on the table as she tried to get away.<br>\r\n<br>\r\nLooking behind her, she saw Elsie wipe off some of the booze off the table just behind her. The tablecloth shifted and she tripped onto her front with a light splash into the puddle. Groaning, the tiny woman lifted her head and wiped the champagne from her face, and noticing a shadow loom over her. She yelped, preparing for the worst and ducked her head down, her hands cupping the back as an act of safety. But then...<br>\r\n<br>\r\n\"What is this? Is this off the cake...?\" Erica heard Elise say to herself. Erica gasped, and quickly rolled over. Erica stared into Elsie's sharp green eyes looking right back at her. Elsie had seen her! <br>\r\n<br>\r\n\"I'm not a model, I'm a real person! My name is-\"<br>\r\n<br>\r\n\"Whoa, it's moving! What a weird... Wait...\" Erica could read the confusion in the teen's face easily. She face twisted, her eyes and eyebrows contorted and now, beginning to lean in closer on the tiny woman. Looking up, Erica got to her feet as the young woman brought her face closer to the table for a more intricate inspection. \"That's not a-\"<br>\r\n<br>\r\n\"I'M A REAL PERSON!\" Erica yelled up as loud as she could, almost coughing up her lungs from shouting so hoarsely. She began to feel her legs go again, as the giant teen had her face a bit too close for Erica's comfort. Her cute button nose was as big as a house, her freckles as big as dinner plates and her green eyes were giant and beading, staring unforgivingly at the struggling woman. <br>\r\n<br>\r\n\"Yes, you are aren't you! Oh my, how did you get so small? You must be a guest for Sammy's wedding right?\" Erica felt a wave of relief flowing through her body.<br>\r\n<br>\r\n\"Yes, yes I am! My name is Erica, I work with her! I sat in front-\"<br>\r\n<br>\r\n\"Ah, I'm Elsie! Nice to meet you. Sammy is my Aunt, sort of...\" Elise wandered in thought. Erica took this opportunity to snap her attention back.<br>\r\n<br>\r\n\"I don't know how I got shrunk like this! I was just finishing my drink and I ended up like this!\" Erica watched Elise continue to study her, almost playing dot-to-dot in her head from staring at her freckles for so long.<br>\r\n<br>\r\n\"Ahh! Those shoes down by the chair must be yours then, I was wondering whose they were, they're very nice! Anyway, I guess you need help huh?\" <br>\r\n<br>\r\n\"YES! Please, I don't know what to do! If you cold get Sammy-!<br>\r\n<br>\r\n\"I'll just take you to her if you like, I saw her wander into the sitting areas just before!\" Erica nodded in agreement, and instantly wished she hadn't. Erica bolted upright in pure fear as Elise moved her head back away from the tiny woman, and moved her right had towards her, fingers splayed open in anticipation of grabbing her.<br>\r\n<br>\r\n\"I-I don't think this is the best-\"<br>\r\n<br>\r\n\"It's fine...\" Elsie said confidentially as Erica braced herself and closed her eyes. A sandwich of spongey warm walls clamped on her arms and suddenly had the sensation of being lifted. This was it. Her life was now in Elsie's hands.</span></div></div>",
            "created":1459728720,
            "id":2127256,
            "title":"Erica On The Table"
        },
        "1431112":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Chest, as she crouches",
                "Sandal clad toes, as she steps back"
            ],
            "content":"<div class=\"\"><div> <span>As Erica tried to figure out a way to get Elsie's attention before she got back to the table she felt another sneeze coming and remembered what happened last time she sneezed. Tiny Erica couldn't stop herself from sneezing, so when she sneezed again she blacked out for a few seconds. When she became conscious again she noticed she is still on the edge of the table but she noticed something was off. It didn't occur to her until she felt the table shake, when she looked up she gasped in shock. It was Elsie but she was even more massive now, that's when Erica figured she must of shrunk again but this time she is no bigger than a speck. So once Erica finally stood up Elsie accidentally bumps the table causing the speck sized woman to lose her balance and fall off the table. Erica was now falling towards unaware Elsie's...</span></div></div>",
            "created":1459859100,
            "id":2128057,
            "title":"Elsie knocks Erica off of the table..."
        },
        "14311121":{
            "author_id":"thenumber1",
            "author_name":"TheNumber1",
            "choices":[
                "Elsie starts dancing.",
                "Elsie does something else."
            ],
            "content":"<div class=\"\"><div> <span>Erica screamed at the top of her lungs as the teen's titanic face blurred by. Flashes of red hair and pale skin flew by as she tumbled past Elsie's neck. Erica closed her eyes, knowing this was the end...<br>\r\n<br>\r\nSMACK!<br>\r\n<br>\r\nErica yelped, slamming abruptly into something oddly firm but soft. She then began to slide along the downward slope. Erica rolled roughly against this bouncy surface, which felt like...skin? After a brief but incredibly long fall, the huge hill converged with an identical one. Erica's momentum caused her to become wedged in this warm chasm. The only light spilled in from above. Disoriented and confused beyond belief, she looked up from this cream colored valley to find a silver heart the size of a baseball diamond resting between it's walls. Didn't that girl have a necklace like that? \"Oh my God!\" Erica realized she'd fallen right into the young girl's cleavage.<br>\r\n<br>\r\nElsie felt something wet land against her chest. Dismissing it as a drop of champagne, she stood up, straightening out her powder blue dress. Satisfied with the job she'd done cleaning up, she returned to chatting. <br>\r\n<br>\r\nErica couldn't believe what was going on. She poked one of the doughy walls to make sure this was really happening. She was now, at best, the size of a flea and trapped like one. The once small-ish, developing breasts of this young teen to were now towering mountains of flesh which completely engulfed her. With every breath, the fair, youthful walls gently pressed against Erica, almost swallowing her up entirely. She struggled fought futilely with her one free arm to get free or at the very least get the giantess's attention. Erica looked up at the shelf-like underside of the chin. Of course, she obliviously kept talking. Erica sighed as she sunk in deeper. \"This is not how I thought this night was gonna go.\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1460093280,
            "id":2129395,
            "title":"Erica Saved....Sorta"
        },
        "14312":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Brett - 13",
                "Alan - 31",
                "Mike - 42"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But who finds her?</span></div></span></div>",
            "created":1459729620,
            "id":2127262,
            "title":"A male guest finds her..."
        },
        "14313":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Erica makes her way down the table to the floor...",
                "A waiter/ress comes to clean the table...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what happens next?</span></div></span></div>",
            "created":1459729680,
            "id":2127263,
            "title":"Nobody finds her... Yet..."
        },
        "144":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107478,
            "title":"30 - At A Party: Pick a story!"
        },
        "15":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "At home...",
                "At a place of work...",
                "At an event...",
                "At a party...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does our story begin?</span></div></span></div>",
            "created":1456030800,
            "id":2107479,
            "title":"Erica - 42"
        },
        "151":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107480,
            "title":"42 - At Home: Pick a story!"
        },
        "152":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107481,
            "title":"42 - At A Place Of Work: Pick a story!"
        },
        "153":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107482,
            "title":"42 - At An Event: Pick a story!"
        },
        "154":{
            "author_id":"nicknack",
            "author_name":"NickNack",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just pick a story and off we go...</span></div></span></div>",
            "created":1456030800,
            "id":2107483,
            "title":"42 - At A Party: Pick a story!"
        }
    },
    "info":{
        "author_id":"nicknack",
        "author_name":"NickNack",
        "brief_description":"The many terrifying tales of a now-tiny woman. At least 60 INDIVIDUAL stories inside!",
        "created":1456074060,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"center\"><b>- A BRAND NEW SAGA -</b></div><br>\r\n<br>\r\n<b>--- --- ---<br>\r\n--- --- ---</b><br>\r\n<br>\r\n<div align=\"center\"><b>21 / 02 / 2016</b></div><br>\r\n<br>\r\nA brand new interactive story about Erica, a woman who has her life turned upside down as she's shrunken to an inch tall by someone she may or may not know...!<br>\r\n<br>\r\nPlease add to the story as best as you can, and please follow these simple rules!<br>\r\n<br>\r\n<b>- NO DEATH<br>\r\n<br>\r\n- NO GORE &amp; BODILY WASTE<br>\r\n<br>\r\n- NO CHAPTER ENDS, ALWAYS OFFER AN OPTION<br>\r\n<br>\r\n- NO ENDLESS / POINTLESS CHAPTER OPTIONS<br>\r\n<br>\r\n- NO SHORT / POINTLESS CHAPTERS<br>\r\n<br>\r\n- PROOF-READ ALL YOUR WORK</b><br>\r\n<br>\r\n<b>--- --- ---<br>\r\n--- --- ---</b><br>\r\n<br>\r\n<b>Chapter scenarios:</b><br>\r\n<br>\r\n- <b>At Home</b>: Doesn't necessarily mean at Erica's place of residence.<br>\r\n<br>\r\n- <b>At school / college / University</b>: Can be any location. not just Erica's place of education.<br>\r\n<br>\r\n- <b>At a place of work</b>: Doesn't mean just where Erica works.<br>\r\n<br>\r\n- <b>At an event / party</b>: Can be any social event.<br>\r\n<br>\r\nThe scenes that are given are just the start of the story, they're not the defined setting for the entire story.<br>\r\n<br>\r\n<b>--- --- ---<br>\r\n--- --- ---</b><br>\r\n<br>\r\n<b>F</b>/f - <b>FF</b>/f - <b>M</b>/f - <b>MM</b>/f - <b>FM</b>/f - <b>F</b>/F/f - <b>F</b>/M/f - <b>M</b>/F/f etc allowed.<br>\r\n<br>\r\nApart from that, anything goes! I'll add more rules if necessary but I think everything is covered.<br>\r\n<div align=\"center\"><br>\r\n<b>Enjoy!</b></div></td>",
        "id":2075833,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101412.jpg",
        "last_full_update":1515756420,
        "modified":1515756420,
        "pretty_title":"ERICA: The Shrunken Woman Saga"
    }
}