{
    "chapters":{
        "1":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "After what seemed like hours you see an underground city!"
            ],
            "content":"<div class=\"\"><div> <span>You are a normal guy, who one day decided to climb atop a mountain. You herd tales about this mountain, where people were never seen again. However, you did not really believe in those stories and started to climb. After 30 feet you begin to see an entrance to a cave, you decided to take a look inside, and you see tunnel seems to go on forever! \"Don´t go further in buddy\" you told yourself. But you did anyway...</span></div></div>",
            "created":1421730000,
            "id":1920535,
            "title":"The cave"
        },
        "11":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "a furturistic metropolis",
                "a stonewall fortress",
                "a temple city",
                "a feral village",
                "a city of Stream and industry."
            ],
            "content":"<div class=\"\"><div> <span>You walk for seem like hours making your way through the cave. Your backpack become heavier and heavier, and you considering going back.  But curiosity keep you going.  It gets darker in the tunnels, and for a moment, you worry about running out of battery power in your flashlight.  Suddendly a light appeared and you get excited and keep going.  The light become more and more brighter and then you hear it.<br>\r\n<br>\r\nNoise, lots of noise.<br>\r\n<br>\r\nYou get walking more and more.  The tunnel became bigger and large and suddenly, you found your in some sort of settlement.  Not just any settlement...  A settlement full of strange creatures.  <br>\r\n<br>\r\nYou take a good look at the creatures that around you.  They seem not to notice you.  They are human like especially with that hands, but they have the heads, the fur, the even the bodies of animals.  <br>\r\n<br>\r\nThen it occur to you.  you are in a settlement, a settlement of furries.  You almost jump and down as you realized your discovery.  You will be rich and famous.  They you look at the females.  A lot of the females, are...curvy, with real HOT bodies.  <br>\r\n<br>\r\nYou could stay here a while. <br>\r\n<br>\r\nSo what kind of settlement is it?</span></div></div>",
            "created":1423112400,
            "id":1928586,
            "title":"After what seemed like hours you see an undergr..."
        },
        "111":{
            "choices":[
                "Snapping Turtle",
                "Shark",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>The settlement appeared to be a futuristic metropolis of some kind with skyscrapers that appeared to be hovering over the ground and light up highways. Every vehicle appeared to hover a foot or two off the ground and all of them were brightly colored and some even were covered in graffiti. The city was not without the occasional tree or other flora and there also appeared to be small gardens protected by electrified fences and forcefields of some sort. It would appear that the anthros reached up to 7 feet tall and there were anthros everywhere you looked.<br>\r\n<br>\r\nYou pulled up your head because you had no idea what these anthros were like or how they would react to a human. For all you knew, these anthros could be hostile. You even have to duck and hide as a couple of anthro police come forward. Both of them were heavily armored and looked like they were carrying laser pistols and electric handcuffs. One of the police resembled an anthropomorphic star-nosed mole man with a cap on his head that looked like it had digital parts attached to it. The other one resembled an anthropomorphic gaur man with bright blue fur, long horns and what looked like a goatee. Unlike his partner, he appeared to be wearing mechanical goggles. While the stars on their chests signified that these animals were the police, you’d rather not risk it and just run down the street.<br>\r\n<br>\r\nYou could see that the sidewalks have glowing lights on them and you even see a three-dimension television screen on a large skyscraper that appeared to depict an ocelot woman on the news that from the looks of it, had large F-cup breasts that were completely bear, though she was still wearing a coat and news outfit. You couldn’t believe it. You were in some sort of anthro animal metropolis and also from the looks of it they were even more advanced technology-wise than your garden variety human being.<br>\r\n<br>\r\nYou eventually walk up to what looks like some form of levitating bus stop and sit down as you survey the area. The skyscrapers were glowing and you saw that they came in multiple colors. Some of them were even painted in patterns and graffiti-like designs. You didn’t even think graffiti artists could reach that far. Obviously this city was a center of technology, culture and art. From the looks of it, there were anthropomorphic animals of mammals, reptiles, birds and even some animals that were supposed to be mythological. It was amazing.<br>\r\n<br>\r\nThat was when you say what looked like an anthro who was approaching the bench you were sitting at. From the looks of it, it was a female anthro. You were about to find out what kind she was.</span></div></div>",
            "created":1432875600,
            "id":1985031,
            "title":"Big City"
        },
        "1112":{
            "choices":[
                "The Thresher",
                "The Sawshark",
                "The Hammerhead"
            ],
            "content":"<div class=\"\"><div> <span>The girl who was coming forward was a girl who resembled a large and red muscular thresher shark. You could tell the type of shark based on her tail. She appeared to be riding some kind of hover scooter. She appeared to be wearing a pair of goggles on her head and she had long pink hair that was worn in a ponytail along with a white leotard. She also had a tattoo of a fish skeleton on her arm that appeared to be covered in black fire.<br>\r\n<br>\r\nYou begin to shiver. That was one tough looking shark girl. You didn’t think that you wanted to be anywhere near her. Thresher sharks were fierce and one that was sentient was more than likely to be even more ferocious than your average type of shark. But before you can get anywhere, two more shark girls show up and they appear to be skating next to the thresher shark girl.<br>\r\n<br>\r\nOne of them was a yellow skinned sawshark girl who was wearing yellow green glasses shaped like hearts along with a yellow green jacket and a dark yellow spandex unitard with leggings and roller-skates attached to her high heels. The sawshark girl was wearing a helmet shaped like a fish’s skull that looked designed to accommodate her dorsal fin. She was hourglass shaped with E-Cup breasts and had a long saw-ridged nose. She was brunette and worn her hair in a bob-cut.<br>\r\n<br>\r\nThe third shark girl was blue skinned and rather fat hammerhead shark girl with white hair worn in a Mohawk and a ponytail. She was wearing a two-piece purple bikini with electronic sigils on it. She was wearing a lot of thick violet lipstick and was on top of a skateboard that was painted to look like it was covered in ghost faces.<br>\r\n<br>\r\nThere were three shark girls coming your way. No thanks. You try to run for cover but one of the shark skaters crashes into you. Which one?</span></div></div>",
            "created":1432875600,
            "id":1985033,
            "title":"Sharks on the Street"
        },
        "1113":{
            "choices":[
                "Siamese Cat",
                "Vampire Bat",
                "Try Again"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well what is she then?</span></div></span></div>",
            "created":1432875600,
            "id":1985034,
            "title":"More Options"
        },
        "11133":{
            "author_id":"2wakawakalol",
            "author_name":"1WAKAWAKALOL",
            "choices":[
                "Polar Bear",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about this?</span></div></span></div>",
            "created":1458033480,
            "id":2117800,
            "title":"Try Again"
        },
        "111331":{
            "author_id":"2wakawakalol",
            "author_name":"1WAKAWAKALOL",
            "choices":[
                "A bedroom (she took you home)",
                "A hospital"
            ],
            "content":"<div class=\"\"><div> <span>As you begin to see the girl come closer to that she is a 7ft chubby polar bear. You stand up to study her and sees  she’s wearing what looks to be a black leather vest jacket with the zipper undone in the front. You see that she’s also was wearing what can be described as a black tight fitting spandex that went up to her F-Cup breast. She has long straight blue hair that flows down behind her back revealing a slight widows peak. She seemed to be wearing a pair of wrap around sun-glasses. She also seem to have some sort of cyber themed tattoo running down her upper arm.<br>\r\n\t<br>\r\nAs you were studying the arctic bear that you fail to realize that she was staring straight at you. As soon as you  freeze in fear as both made eye contacted.Your heart beating so loud that you can’t hear yourself think. Your legs start shaking as you realize that the large arctic ursus had spotted you. The bear start heading towards you causing you to panic. Not know what this woman had in mind you decided to run. “Hay!” the bear yelled “Wait!”, you ignored her as you began the other way, before you could even begin to run, you’re  foot was caught  on something causing you to fall head first onto the bus stop bench, rendering you unconscious. The last thing you remember is the large bear looking down at you with a worried expression on her face.<br>\r\n<br>\r\nWhen you wake up you see that you in…<br>\r\n</span></div></div>",
            "created":1458122340,
            "id":2118324,
            "title":"Polar Bear"
        },
        "111332":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "A cheetah",
                "A wolf",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these choices?</span></div></span></div>",
            "created":1465850760,
            "id":2163735,
            "title":"other"
        },
        "1113321":{
            "author_id":"mickeyknight",
            "author_name":"Nick Knight",
            "choices":[
                "A bedroom(she took you home)",
                "A hospital",
                "A hotel suite"
            ],
            "content":"<div class=\"\"><div> <span>You see the woman start walking toward you and you realize she's a 6ft tall cheetah with the most stellar body you've ever seen.  She had an extraordinarily slim figure, a large pair of breasts, and equally sized butt to match.  She was wearing a dark blue dress that exposed her breasts a little, and went down to her knees.  <br>\r\n<br>\r\nYou were so stunned by her figured that you didn't realize she was walking toward you.  You started breathing heavily as the female cheetah approached you.  Just as you were standing up to run away, you slipped and hit your head on the nearby bench, knocking you out.  The last thing your remember seeing was the female cheetah looking down at you with a worried expression on her face.  <br>\r\n<br>\r\nWhen you wake up, you realized that you're in.....</span></div></div>",
            "created":1465855260,
            "id":2163767,
            "title":"A cheetah"
        },
        "1113323":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Yes a panda",
                "No something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe a panda?</span></div></span></div>",
            "created":1557375900,
            "id":2657247,
            "title":"Readers Choice"
        },
        "112":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "A short but cute bunny female guard with a spear",
                "a draft horse inquisitor with a sword",
                "a bikini chainmail lioness with an axe"
            ],
            "content":"<div class=\"\"><div> <span>You wander for a while look at the medieval villagers.  For some strange reason, no one seem to notice you, as you walk into the crowd of furries.<br>\r\n<br>\r\nRabbit rats, cats, dogs, horse, bulls... the list goes on and on and your pass through and move.  Suddendly a tall, buxum cow woman come into your view.  Her top bolice is large, but can barely contained the giantanic tits she had.  As she walk passed you, you turn around and even in the long dress that she has, you can see the equally giant ass the seem to bounce.   You are leering so much that you just don't see where you're going.<br>\r\n<br>\r\nCRUMMPP!<br>\r\n<br>\r\nYou found yourself on the group shaking your head.  As you get up, you notice that the crowds around you has stop...and looking straight at you.  It quiet for about a minute.<br>\r\n<br>\r\n\"Hey, what's this?\"  the person that you bump into say.  You look straight into the scared face of a fox.<br>\r\n<br>\r\n\"It's a hummie!\"  Some one shouts.  <br>\r\n<br>\r\nThe furries crowd all around you as they notice you for the first time.  You hear thousand voice around you, and you're pull in several directions.  For a minute, you are really scared.<br>\r\n<br>\r\n\"Hey what all this?\"   you heard someone say.<br>\r\n<br>\r\nThe crowd around you let you go, and seperates, leaving a clearing around you.  You see the crowd part for some one.  That furry is...</span></div></div>",
            "created":1423198800,
            "id":1928605,
            "title":"a stonewall fortress"
        },
        "1122":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "You turn and run back through the gates and into the crowd",
                "You follow Valens, maybe it won't  so bad",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>You have to look up and you see a tall, muscular creature towering over you.  He has the head and fur of a draft horse, perhaps a clydale or mule.  His solid black eyes look right through you.  In his massive hands in a even massive sword. His clothing, shirt, place, and long flowing cape, is all black.  As he talk, you look down and see that he has no feet, but the hooves of a horse.<br>\r\n<br>\r\n\"Hummie, \"  the draft horse demands    \" You are coming with me!\" <br>\r\n<br>\r\nLooking at the big sword that he has, you nodded your head as the draft horse turns and you follow him.  The crowd around you grows as more and more furries appeared in the narrow streets. The crowd keeps a space around you, allowing you to walk freely.  You keep walking for a while,  look at your surroundings.  <br>\r\n<br>\r\nThe Furries work and live the wooden buildings giving the impression that you are in a large medieval town. , but you soon see the large stone walls of the castle .  You take a last look at the crowd of furries that are behind you, as you approached the castle walls.  What's when you see..a human-like face...eyes,...nose.  A human?  Was that a human you saw?<br>\r\n<br>\r\nBefore you could look further,   You and the Draft horse quickly walk through the castle gates' and enter the castle proper.  You met a pair of guards.<br>\r\n<br>\r\n\"Inquisitor Valens reporting\"  The Draft horse says to the guards.  \"This...Hummie was spotted in town, and I taking him in for questioning.  I will need to have used of the lower levels of the castle, and...WE  do not wish to be disrupted.\"<br>\r\n<br>\r\nThe pair of guards, a tiger and a wolf look at you what seem like...pity.<br>\r\n<br>\r\n\"Shouldn't we tell the Queen about this.\"  one of them asked.<br>\r\n<br>\r\n\"You will tell the Queen that I am investigating  a possible threat to the Kingdom.\"  Valens the horse snapped back.  He turn to you.  \"Come, Hummie.\"<br>\r\n<br>\r\nOnce again you think of turning back and try to make a run of it, It's a risky move, since you run right into that crowd back there, but if the inquisitors here are anywhere similar to the one that you had read in books and seen in documentaries...It going to be painful.  On the other hand, Maybe he just asked some questions.</span></div></div>",
            "created":1423198800,
            "id":1928630,
            "title":"a draft horse inquisitor with a sword"
        },
        "11222":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "Beth",
                "Or Boris"
            ],
            "content":"<div class=\"\"><div> <span>The two of you go down in a increasing darker area.  The set of stairs is barely lit by rows of torches.   Then you meet a large wooden door, with another pair of guards.  The guards here, are different from the ones from before. For one this, they are much larger, towering over the Draft horse Valens, let alone,  you.  The bottom half of each guard is wearing black armor each carrying a large axes.  From their topless half you can tell that they are bears, probably grizzlies.  You can also tell that one, from her large bust, that she a female.  As you get closer, you realize that she is complete bare, as her giant nipples are so forward that you can see them through her fur.  The male is bigger and taller than she is, with rip, roaring muscles. He gives you a big snarf.  <br>\r\n<br>\r\n\"Calm down, Boris.\"  Valens stated as he took out a key and open the massive wooden door.  \"The Hummie will be safe with me.  Beth, keep Boris in line, \"<br>\r\n<br>\r\nThe two guard parted away to let you through it.  The female bear gave you a sharp, toothy smile.  <br>\r\n<br>\r\n\"Please try to escape, Hummie\"  The female bear winked.  \"I love to capture you\"<br>\r\n<br>\r\n\"Better hope that it her that capture you, should you escape, Hummie.\"  The big male Bear growl.  \"I will have no mercy.\"<br>\r\n<br>\r\nThe two of you go inside the darken room, where there are few torches.  You set a chair, a large wood table, and a larger, bigger chair. It's almost like a throne.  <br>\r\n<br>\r\n\"Sit here, Hummie.\"  The draft horse pointed to the smaller chair.  He sit down on the dark.  The glare that he give you make you more uncomfortable, than the simple wooden chair that you are sitting on.  After a few minutes of awkward silence, he speaks.<br>\r\n<br>\r\n\"Welcome to the Kingdom of Modiva.\"  he say slowly.  \"So, Hummie, what business that you have here.  \"<br>\r\n<br>\r\nYou explain the mountainous cave that you enter, and the amazing experience that you had as you enter the city.  You try to explain that you meant no harm, just you wanted to explore, and was curisious.<br>\r\n<br>\r\n\"Curiosity? exploration?\"  he said after a while of silence.  \"I sure you heard the old expression.  'Curiosity killed the cat.'  Your 'Curiosity' make mean the death of you, if I don't get some answers.  \"<br>\r\n<br>\r\nYou try to protest, but the draft horse hold his hand. <br>\r\n<br>\r\n\"Tell me, does anyone else know that you are here? Is there anyone that can follow you here to the city?  I sure that you are alone, but I want to know that you are not part of some group. <br>\r\n<br>\r\nHe continue to give you more threatening and tough question, that you answer to the best of your abilities.  Finally he stops, and get up from his chair.  He goes behind you and places his hand on your shoulders.  <br>\r\n<br>\r\n\"Well, Hummie, it seem that you are a harmless  visitor to our grand kingdom.  However, I can't  let you go till I check out your story.  <br>\r\n<br>\r\nHe take his hands off, and go to the door behind you.<br>\r\n<br>\r\n\"now I need to establish guard to watch you here while you are here under the castle.  Now in my experience, the best guard would be ...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1427173200,
            "id":1953186,
            "title":"You follow Valens, maybe it won't  so bad"
        },
        "112221":{
            "author_id":"ritterlord",
            "author_name":"Ritterknave",
            "choices":[
                "You try to escape",
                "You stay right where you are"
            ],
            "content":"<div class=\"\"><div> <span>I think that Beth would be the best for you. \"  Valen stated as he clop to the wooden door.   \"I cannot predict what Boris will do, but I know Beth will keep you here in the dungeon \"<br>\r\n<br>\r\nCREAK!<br>\r\n<br>\r\nValens go through the door until he almost out of the room.  He pauses, then he  turn his horse head to you.  \"I should give you a warning\"  He states \"  Beth get a little... touchly-feely when she down here,  I think it some to do with the air.  She quite the professional, but there have been some \"incidents\" of late.\"<br>\r\n<br>\r\nJust as  Draft horse close the doors, leaving you in the darkness for a while, he poke his snout in . <br>\r\n<br>\r\n\"I shall give you one last warning. Beth is proud of her body. Do not insult it. As much as it annoy me that that female bear insist on remaining topless, I...rather not be on her bad side.   And what ever you do...\"<br>\r\n<br>\r\nThe sound of some commotion outside distract the both of you.  The door close for a time, but you can feel shouting on the other side.  The door slowly creaks open.  <br>\r\n<br>\r\n\"Sorry for that, it seem that Boris is upset that he is not guarding you. He has left Beth alone in charge of you.   Anyway...\"<br>\r\n<br>\r\nYou listen carefully of what the horse have to say, as he has additional information.  he closes the door leaving you alone in the darkness   You sit in the chair, wondering what going to happen to you.  Suddenly, a light appear so brightly that you are nearly blind.  As your eye adjust to the light, you see that it's the same female bear that you saw earlier.  She is still wearing her black armor, but she no longer has the ax in her arms, but she is carry two torches.<br>\r\n<br>\r\n\"I hope that you are feeling comfortable,\"  The female bear said as she place the two well lighted torches to the torch holders on the wall.  \"I can't believe that Valens just let you be here with any light.'<br>\r\n<br>\r\n\"Yeah,\" you mumble as you try to relax. As you see Beth's body, you can't help but admire it. While the first thing that you notice was the large and firmness of her bare breasts.  You see that she has very muscular arms and legs.  You never been a big fan of those \"muscle girls\"  back home, but here, they almost seem natural to her. <br>\r\n<br>\r\nAah! what to do with you?\"  she say as she moves closer.  She give you of what you hope is a friendly smile, and sit  in the throne. She leans forward, looking at you with a bore expression, her giant hand paws cradling her head. You try to look at her eyes, the odd way her fur on her head seem shaped and style to resemble hair,  anywhere but looking down.  As she turn her head and sigh, you take a quick look down at the massive cleavage right in front of you.  It even more alluring that the fact that she topless. <br>\r\n<br>\r\n“You like?”  you hear.<br>\r\n<br>\r\nYou look up and see that you took to much time looking down, and she caught you.  You hoping the poor light does not show how embarrass you are.    <br>\r\n<br>\r\n“Ha, Ha”  she gentle laugh as she gets up and move till she she behind you.  “Well, I think I have the we have prove that you are a male.”<br>\r\n“Well, I bored, so let's have some fun, shall we?”<br>\r\n<br>\r\n She grasp and rubber your shoulders as she pressed her giant breasts on the top of your head.   She grab under your head with her big arms and press  She signs as she  rubs her firm jugs over and around your head.  She move in front, and slam your face deep into her cleavage.  Even you can't breathe for a while, you are enjoying yourself so much that you don't even care. You suddenly turned from being a little scared to aroused in a few minutes.  She continue to rub, press grind, and squeezed her giant tits, all over your head, face and shoulder, that you barely notice the click-click of her armor. <br>\r\n<br>\r\n“Do you enjoy? “  she asks coyly as you hear her voice from above you head.<br>\r\n<br>\r\n“Oh yes”  you sigh out.  The feeling is so good,  her mammalian melons are like firm mittens on your head.  <br>\r\n<br>\r\nYou just want to TOUCH them.  True, Valens warned you not to touch them, but they are right there! You raise your hands...<br>\r\n<br>\r\nWhack!<br>\r\n<br>\r\n“Oh no no.” she admonish, as back away.  “you don't get to touch those with your little fur-less paws!  <br>\r\n<br>\r\nShe come in front of you, still holding her breasts up.  Her angry glare that she gives you  worry you. <br>\r\n<br>\r\n“No male gets to touch these, not even Boris anymore!”<br>\r\n<br>\r\nShe drop her breasts,  their abnormal tits bouncing long after they should.  She place her paws on her generous hips.  Her angry flash of teeth, is replaced by a weird smile. <br>\r\n<br>\r\n“Hmm,... I was having a little fun with you, but you had to ruin it.  Now I going to have to punished you.”<br>\r\n<br>\r\nYou feel that you should be scare with this turn of events, but Beth has said that last sentence in such a teasing and mocking tone that you don't know  what to fell. <br>\r\n<br>\r\n“Well, if I got to punish you, I can”t do anything with this on.<br>\r\n<br>\r\nYou still unsure of your feeling as you see Beth removing the bottom half her armor.  The loud click-click or her armor falling to the door is loud.  <br>\r\n<br>\r\n“There”  she say as she step away from the mess of discarded armor.  She move towards you, only giving you a few moments to see her in her near bare glory before she slam down on your chair.  Her muscular legs are so long that she is able to sit on your lap and have her bare foot paws flat on the floor.  Not that you feel that way. You are not prepared on how just HEAVY, she is.  It feel like a cement truck was sitting your lap.  You can't help but groan and moan.<br>\r\n<br>\r\n“I haven't even started and your already moaning.”<br>\r\n<br>\r\n“I...I sorry.”  you squeezed out.  <br>\r\n<br>\r\nBeth get up form that chair and sit her furry behind on the table.  <br>\r\n<br>\r\n“Well, I going to have to think of something else.  Something that won't hurt you too much... “<br>\r\n<br>\r\nYou sit nervously as she hums to herself, her naked body, with her primal power, is scary you rather than making you hard.  Suddenly she yawns.<br>\r\n<br>\r\n“OHHHH, I more tired that I thought,”  she says as she stretches her arms up.  She lower down on the table, until it becomes her make shift bed.  She lays down, and it look like she prepared to take a small nap.<br>\r\n<br>\r\n“I going to have to deal with you later.”  she say sleepily, “Just do try to esscccapppppeee....”<br>\r\n<br>\r\nYou slowly stand as she begins to snore.  It seem that she fallen asleep.  You look back at the wooden door. This would be the best time to escape.  You don't know if the door are locked, let alone what's on the other side, but you know that Boris is not there.  <br>\r\n<br>\r\nOn the other hand,.. maybe her punishment would be so bad..if she remembers.. and they're no telling what she do to you if she catch you as you try to escape.<br>\r\n<br>\r\nDecisions, Decisions. </span></div></div>",
            "created":1427259600,
            "id":1953601,
            "title":"Beth"
        },
        "113":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "The cow",
                "The snow-leopard",
                "The tigress"
            ],
            "content":"<div class=\"\"><div> <span>All the buildings looks like temples, and there are are statues of naked females of different species all around the city. There is one big statue outside of the biggest temple that caught your attention: a human male with a cow and a lioness holding arms and a vixen and a bunny holding his legs. There are many people, mostly females, surrounding it, and they seem to be praying to it. <br>\r\n<br>\r\nCould it be possible that they might think of human males as gods (since you can't see human females anywhere else)? Would they believe you to be a god? You decided to find, but just when you began your walk into the temple city you trip, hits your head on a rock and falls unconscious.<br>\r\n<br>\r\nWhen you slowly wake up you find yourself on a large bed inside of a gigantic building. You realize that you´re in the center of the large temple next to the statue of the human male. And you also find yourself surrounded by a massive gathering of furries and you´re naked! And infront of you are three females whom you´re guessing to be priestesses, judging by their clothing. The middle one is cow, the left one is a snow-leopard and the right one is a tigress. They all have huge breasts, wide hips and big asses. And then one of them starts crawling onto bed towards you.<br>\r\n<br>\r\nWhich one?</span></div></div>",
            "created":1446982140,
            "id":2058243,
            "title":"The city of the gods"
        },
        "114":{
            "choices":[
                "Three Anthros Sneak Up on You",
                "You Hear the Sound of Water Rushing",
                "You Investigate the Strange Temple"
            ],
            "content":"<div class=\"\"><div> <span>You look around and see that this is some kind of feral village of some sort. For one, the anthro women were speaking in a language that didn't sound in the least like English. Additionally, the domiciles looked like huts and tents from thousands of years in the past. The anthro women were all dressed in armor and loincloths that didn't hide that much. Looking at their bodies, you'd see that every anthro woman was very pear shape with massive breasts and asses, which was why their clothing was so skimpy. Additionally, each anthro looked at least one to two feet taller than you. Upon further examination, something occurs to you, there isn't a single male anthro in the village. This must be a village of anthro amazons.<br>\r\n<br>\r\nYou couldn't believe it. There were anthros of all kinds including big cats, large canines, undulates, reptiles and even birds. Up ahead there was a strange hut that looked like it had three diamonds embedded into its walls with images of three figures painted on the wall with white, blue and yellow paint. That looked like an important building, possibly where the leaders were given the guards outside. You were amazed.<br>\r\n<br>\r\nEvery last one of the anthro amazons looked drop dead gorgeous. Then suddenly...</span></div></div>",
            "created":1427691600,
            "id":1956556,
            "title":"Awake the Amazons"
        },
        "1141":{
            "choices":[
                "The Hippo Woman",
                "The Zebra Woman",
                "The Rhino Woman"
            ],
            "content":"<div class=\"\"><div> <span>As you’re ogling a giant busty and big-bootied canary woman, you grunt and then you look to see somebody or something had prodded you in the back. You turn your head and look in surprise to see three rather aggressive looking pear-shaped anthro amazons behind you and they were yelling in anthro language.<br>\r\n<br>\r\nFirst was a white and gold striped pear-shaped zebra woman with her hair worn in a mohawk. She appeared to be wearing an eyepatch and was also stark naked as she held up a rather sharp spear.<br>\r\n<br>\r\nThe next of the anthro amazons was a copper brown skinned hippopotamus woman with red tattoos over her enormous belly. She had midnight black hair and was wearing a red bra and a black sumo thong. She also appeared to be wearing ruby earrings.<br>\r\n<br>\r\nThird was a giant silvery white skinned rhinoceros woman with red hair worn in a ponytail with a slightly pudgy belly and a tattoo of a rhino’s foot over her eye. She was also wearing a leather bikini.<br>\r\n<br>\r\nAll three anthros glared at you and they were yelling in strange language. They didn’t sound friendly so you made a run for it. But as you were running you heard stomping noises and all three of those anthro guards were closing in and shaking the ground with every step. You couldn’t help but watch as their breasts and their hips jiggle.<br>\r\n<br>\r\n\u2028This proves to be your undoing because you are ultimately caught by...</span></div></div>",
            "created":1427691600,
            "id":1956557,
            "title":"Busted"
        },
        "1142":{
            "choices":[
                "The Jaguar Girl",
                "The Wolf Girl",
                "The Salamander Girl"
            ],
            "content":"<div class=\"\"><div> <span>Before you can ponder any more on the situation, you hear the sound of a waterfall and your inner pervert is telling you to check the sound out. You smirk and then you decide to run to see what was going on.<br>\r\n\u2028You run into the bushes and then you see a waterfall that looked like it was twice as tall as the amazons in the village. Bingo. Where there was a waterfall in an amazon village, there were naked anthro amazons that were bathing in plain view of you. This turned out to be true because you could see the bathing beauties right now.<br>\r\n<br>\r\nFirst of them was a golden vanilla furred and golden red haired and spotted pear-shaped jaguar girl who was shaking her buns as the water poured down on her. You couldn’t help but drool at the sight of the jaguar girl.<br>\r\n<br>\r\nThen you heard more giggling and see a pear-shaped chocolate brown furred wolf amazon splashing in the water at another anthro. This anthro was a pink skinned and hot-pink haired axolotl salamander woman who was just as pear shaped. You see the condensation on their hot bodies and lean in for a closer look, even stepping into the water yourself.<br>\r\n<br>\r\nBut fate plays you a cruel hand because you slip and scream on a moss covered rock and fall forward and land with a splash in the water. As you get up you bump your head on the underside of the breasts of....</span></div></div>",
            "created":1427691600,
            "id":1956560,
            "title":"Waterfall View"
        },
        "11421":{
            "author_id":"cd43",
            "author_name":"super sonic",
            "choices":[
                "\"we must take him to the master\".",
                "\"looks like we have a new toy girls\"."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The jaguar girl looks down at you with a strange look in her eye she grabs you and shows you to the other girls and they get the same look in their eyes you are about to ask them what they are going to do to you when the wolf girl says...</span></div></span></div>",
            "created":1439344020,
            "id":2019899,
            "title":"The Jaguar Girl"
        },
        "114211":{
            "author_id":"cd43",
            "author_name":"super sonic",
            "choices":[
                "a human",
                "a large male tiger "
            ],
            "content":"<div class=\"\"><div> <span>The three girls  take you back to their village there you see anthros of all kinds from lions to horses you also notice something you didn't before all of them were wearing collars then you arrive at a large hut guarded by a large number of female guards the jaguar girl walks up to the guards who was a fox with very big boobs and said \"we have something to show the master\" \"what do you want to show him?\" The jaguar shows you to the guard and she looks shocked \"your right the master must see this come with me\" the fox leads you and the jaguar inside the hut there you see more gurds and a large number of Tiger girls dressed in harem clothes when you reach the center of the hut the fox and jaguar girl both bow down and the fox says \"master forgive us for interrupting but we have something you must see\" you look at the master and see....</span></div></div>",
            "created":1439520120,
            "id":2020746,
            "title":"\"we must take him to the master\"."
        },
        "1142111":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "Will just have to share",
                "Will need to compete to see who gets control"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I'll be.\" You see another human. He's about an average build with not that much spectacular about him. \"Release him, then leave us in private.\" The girls bow as the release your hands and leaves, taking the guards and harem girls with them. He walks over to you and puts a hand on your shoulder. <br>\r\n<br>\r\n\"I never thought I'd see the day I ever saw another human. Let me guess, suspicious cave and you just felt compelled to go deeper?\" You nod stunned silence. \"Yeah, me too. I stumbled upon this place about five years ago. Long story short, I got caught peeping on some lionesses bathing. Rather than eat me though, they bowed before me. Turns out that males are in short supply around here, so short that these ladies decided to make it law that should a male actually show up, he becomes leader of the tribe and gets his every desire as incentive to get him to stay.\" This sounded amazing. <br>\r\n<br>\r\n\"So now I have a harem of big cats, each one ready to rock my world at the snap of a finger, and no other man around to contest me. Until now that is.\" Uh oh, you should've known there would be a catch. \"So now, it looks like you and I...\"</span></div></div>",
            "created":1541502360,
            "id":2573923,
            "title":"a human"
        },
        "11421111":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "North",
                "South"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry buddy. I have no intention of killing you. I don't mind sharing some of the bounty with you.\" You let out a sigh of relief. \"In fact, you're kind of a lifesaver. You see, every woman in this village wants to get pregnant, or at the very least get their itch scratched, both literally and figuratively. All those women with only one man to satisfy them. It sounds like a dream, and it was at first. But by the time you're dick feels like it's about to fall off and you've only gone through half the village, it drains you quick.<br>\r\n<br>\r\n\"Now, let's get you set up in the village. I say we split the village in between the North and South halves. The Northern part contains the Arctic, Forest, and Mythic parts of the village, and all the anthros whose animal counterparts are native to those regions. The South has the Desert, Jungle, and Grasslands parts. So, which one do you want?\" You think it over before deciding. </span></div></div>",
            "created":1541510100,
            "id":2573954,
            "title":"Will just have to share"
        },
        "114211111":{
            "author_id":"jackfuego226",
            "author_name":"Jackfuego226",
            "choices":[
                "The bear",
                "The cow"
            ],
            "content":"<div class=\"\"><div> <span>\"The Northern half sounds fun. But... what's the \"Mythic\" part?\" You ask.<br>\r\n<br>\r\n\"That's where you'll find girls based on monsters and myths. Like dragons and slime girls. They usually keep to themselves though. It's also where you will find domesticated animals, from barn animals like cows, to house pets like dogs.\" Sounds like the North gave plenty of options. <br>\r\n<br>\r\n\"I'll take the northern half.\"<br>\r\n<br>\r\n\"Good choice. Cmon, I'll get you set up. I'm Frank, by the way.\"<br>\r\n<br>\r\n\"(Your name).\" You two shake hands and leads you out of the hut and through the streets of the village. The whole walk, anthros were eying you up like a piece of meat. Some licked their lips while others blew a kiss when you looked at them. <br>\r\n<br>\r\nMeanwhile, Frank was whispering something to a dog anthro. When he finished she ran off. \"Now we wait for your own hut to be built. Meanwhile, we have other business to attend to.\"<br>\r\n<br>\r\n\"Like what?\" You ask. Rather than answer, Frank waved his arm back towards the direction the dog girl ran in. Soon enough, she returned with two more anthros in tow.<br>\r\n<br>\r\nThe first was a polar bear girl. She looked like she had only recently come of age. Her assets amounted to a C-cup chest at best, and an ass that was big yet solid. What she lacked in curve she made up for in bulk. She was sporting a six pack and powerful-looking arms.<br>\r\n<br>\r\nThe other was an anthro cow. She looked to be in her 40s. Her breasts looked like someone had glued 2 actual watermelons to her chest. Her waistline was wide and looked soft. Her hips look wide enough to fit a small person and she had an ass to match, nice and round.<br>\r\n<br>\r\n\"So (your name), which of these two fine ladies would you like to be your personal assistant slash concubine?\"<br>\r\n<br>\r\n\"Wait, what?\"<br>\r\n<br>\r\n\"We don't have to do everything ourselves, we each get a personal assistant to help us lead. What's more, since our assistants are with us almost all the time, they double as our personal lovers. So, which one do you want?\"</span></div></div>",
            "created":1541538660,
            "id":2574075,
            "title":"North"
        },
        "1143":{
            "choices":[
                "The Yellow Lioness",
                "The White Cow",
                "The Blue Flamingo"
            ],
            "content":"<div class=\"\"><div> <span>That temple up ahead had you curious. From the looks of it it was very important, given the large paintings of strange anthro figures on the sides. However, you didn’t know whether or not these anthro amazons were friendly or hostile. So, you get on all fours and run as fast as you can to avoid being seen, along the way, you slid under the skirt of a gigantic crocodile woman and get a good look at her privates that makes your nose bleed. However, you rub it off and then you slide to the side just as a heavyset koala woman walks past you, at one point whacking you in the face with her massive reach.<br>\r\n\u2028Once you recover from the koala booty you see that you had a nosebleed that got blood on the koala woman’s left buttocks. But you shake off that feeling and quickly hide from the anthros that might see you. The guards outside the temple you see consist of an Amazonian jackal woman with pitch black fur and a golden chainmail bikini and an Amazonian hawk woman with red hair, gold feathers and a silver chainmail bikini. Both very pear-shaped.<br>\r\n<br>\r\nThey look vigilante and pretty irritable, so you have to find some way to get past them. You see a giant rock and then toss it to the side. The hawk woman senses the motion first and then speaks in anthro language to the jackal woman. Both of them stomp off to investigate and you slide under both their sets of legs into the temple.<br>\r\n\u2028The temple was slightly dark and there were strange paintings on the wall that looked like some sort of tapestry. They were mainly of anthro amazons, but there was one painting that looked like it had several human men as well. Then you hear yelling in anthro language and turn your head in surprise.<br>\r\n<br>\r\nAs it turns out, this village appeared to be run in a Triumverate of sorts. Three female chiefs. The chief in the center yellow seat was a golden furred and pear-shaped lioness with golden brown hair in a green chestplate with African style tribal markings on her face that almost looked like a skull. In the white seat to the left, there was a massive white furred and pear-shaped Holstein cow woman with huge H-cup breasts and an udder to match. She had a pierced nose with blond hair, large silver horns and a tiara of sorts. The last of the chiefs in the right blue seat was a large pear-shaped and blue feathered flamingo woman with strawberry colored hair and what looked like a pair of primitive looking bifocals. She also wore a toga like some kind of Roman goddess.<br>\r\n<br>\r\nAll three chiefs look at you and then surprisingly, one of them speaks to you. In English. Which one?</span></div></div>",
            "created":1427691600,
            "id":1956561,
            "title":"The Three Chiefs"
        },
        "11433":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Queen Elanor leads you to a small chamber"
            ],
            "content":"<div class=\"\"><div> <span>\"Why you come to our land Human?\" Asked the Blue Flamingo<br>\r\n<br>\r\n\"You can talk?\" You exclaim surprised<br>\r\n<br>\r\nThe Flamingo nods \"As the oldest Chief by 30 years I have had time to study the Human Language, I can speak with you...The other two chiefs can only understand you...The Commoners can do neither. I ask again, Why did you come here?\"<br>\r\n<br>\r\n\"I don't know.\"  You say \"I was just curious.\"<br>\r\n<br>\r\n\"Humans have not come to our village in over five thousand years.\" Said the Flamingo \"When the last Human visited the Pyramids were still new...You have been very bad sneaking into our village uninvited.\"<br>\r\n<br>\r\n\"Look I'll leave if that's what you want!\" You say<br>\r\n<br>\r\n\"Hold.\" Said the Flamingo \"You may be of some use to us, 10 years ago a mysterious illness killed all our males, we fear we will be doomed to extinction if something is not done.\"<br>\r\n<br>\r\n\"Are you saying what I think you're saying?\" You ask<br>\r\n<br>\r\n\"That depends.\" Said the Flamingo \"If you wish to help repopulate us...You will have to prove you are worthy of breeding, we want strong males with strong genes.\"<br>\r\n<br>\r\n\"Oh...I'm sure I am strong enough.\" You say<br>\r\n<br>\r\n\"You past pass a test.\" The Flamingo said \"I test that I, Queen Elanor, developed.\"</span></div></div>",
            "created":1451009580,
            "id":2079089,
            "title":"The Blue Flamingo"
        },
        "115":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A tall fox in a fine chest bearing dress.",
                "A skunk stepping out of a nearby factory wearing a toolbelt and nothing else.",
                "A dog sitting in an alleyway."
            ],
            "content":"<div class=\"\"><div> <span>You hear the sound of distant pistons and hissing steam, above you the air is filled with clouds of steam and around you in the air is warm and a bit muggy. The buildings around are all slick with moisture and resemble Victorian architecture though a bit more stylized like what you might find in a painting. The clothing is much the same, stylized Victorian fashion though much, much skimpier than anything actually worn during that time. Presumably because of the warmth all of the clothing to the women were wearing covers very little frequently leaving their chests and/or assess bare. Some women were walking around naked with no one so much as batting an eye.<br>\r\n<br>\r\nYou were amazed by the collection of impossibly beautiful scantily clad women in the city before you but one woman in particular drew your attention above the rest...</span></div></div>",
            "created":1434603600,
            "id":1994244,
            "title":"a city of Stream and industry."
        },
        "1153":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "You'd better run",
                "Try to reason with liza",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You hear a steam engine chugging past in the distance and then a steam whistle for work letting out as you near a blonde canine lady wearing just an engineering cap and dusty brown trousers. Her head snaps up and her ears go back as she sniffs and then turns her head to look at you. \"Crikey! It's me lucky day! A bloody hoo-mun walks right up ta me!\" She slowly gets to her feet. She's about the same height as you and is smiling.<br>\r\n<br>\r\n\"Now now... Easy does it,\" she says stalking closer toward you making no sudden moves. \"Just relax, Liza ain't gonna hurt ya none,\" she promises.</span></div></div>",
            "created":1440127680,
            "id":2023412,
            "title":"A dog sitting in an alleyway."
        },
        "11532":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Tell her you know where more hoo-mons are she should let you go",
                "Wait and see"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Liza. Nice to meet you. What is this place?\" You ask. She gets close and at the last possible second tackles you to the dirty tarmek and hog ties you with your own belt. \"Hoo hoo hoo! I'm a gonna be RICH I am! I'll eat at the fanciest of places and rub elbows with the upper crust! 'Tis my lucky luck day!\" She begins rummaging through your pockets and comes across your cell phone.<br>\r\n<br>\r\n\"Blimey! It's like a futuristic lookin' glass ain't it?!\" She cheers as your cell phone shows her what time it is. She thinks she's gonna get rich and famous off of you just like you thought you'd get rich and famous. Better do something fast.</span></div></div>",
            "created":1440128160,
            "id":2023416,
            "title":"Try to reason with liza"
        },
        "115322":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Yes I'll show you all I know",
                "I don't know how cell phones work"
            ],
            "content":"<div class=\"\"><div> <span>\"You're a biggun ya are... I'm gonna let your feet loose, no funny business or I'll give ya what for!\" She warned. Taking her own belt off, she cinches it around your neck with a strong tug to check for tightness. It makes you gag before she lets you up.<br>\r\n<br>\r\n\"You're a right proper specimen though, those last blokes that came thisaway were a far cry from tame I tell you!\" She tugs the belt around your throat again cutting off your air for a second at the buckle gets too tight against your Adams apple.<br>\r\n<br>\r\n\"Hey, I'm new here... Not so hard,\" you ask. She takes your hair in her strong three fingered hand and pls your face around to kiss you... Or lick your face... Either way her big canine tongue went into your mouth and tasted your eyes... Everything.<br>\r\n<br>\r\n\"A far cry indeed,\" Liza says under her breath. \"Will you teach me how your human tricks work?\" She insists jiggling your keys in front of your face.</span></div></div>",
            "created":1440128700,
            "id":2023421,
            "title":"Wait and see"
        }
    },
    "info":{
        "author_id":"falcon",
        "author_name":"Falcon",
        "brief_description":"You wander into an underground city that is populated by Furries.",
        "created":1421776920,
        "description":"<td align=\"left\" class=\"norm\">You discover a cave and decided to take a look. It seems to go on forever until you see an underground city, which is populated by furries!<br>\r\n<br>\r\n1. The main character is male<br>\r\n<br>\r\n2. The females in this story will have VERY HOT bodies! (Huge breasts, thin waists, big asses, wide hips etc.) And will be five to seven feet tall, OK?!<br>\r\n<br>\r\n3. This story will have romance, sex and other mature content, furries, love and anything else you come up with<br>\r\n<br>\r\n4. Try to add long chapters (a paragraph at least)<br>\r\n<br>\r\n5. No offense, but no gay sex<br>\r\n<br>\r\n6. NO VORE!<br>\r\n<br>\r\n7. Enjoy!<br>\r\n<br>\r\n<br>\r\nReward: 1000 gps per chapter</td>",
        "id":2026839,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1561196040,
        "modified":1561196040,
        "pretty_title":"The City of Anthros"
    }
}