{
    "chapters":{
        "1":{
            "author_id":"zombies14351",
            "author_name":"Winston14351",
            "choices":[
                "Pound on her feet",
                "Climb up to her",
                "Yell for her to notice you"
            ],
            "content":"<div class=\"\"><div> <span>It was a late summer evening in the middle of July. You were hanging out with your closest friend Claire Johnson she is very beautiful and you secretly have a crush on her. You two were watching world war z together because you both loved the movie and because there was nothing better on. Claire gets up from the couch and asks if you want something to drink you ask her if you could have a glass of water and she says no problem I'll be back in a flash. Then all of a sudden you start to feel strange you notice everything around you was getting bigger but you then realized that you were getting smaller. You had shrunk to the size of an ant and we're freaking out! You then hear thump,Thump,THUMP, it was Claire returning from the kitchen with your water she looks puzzled as she can't find you anywhere she then realizes that you might have gone to the bathroom and waits for you there in the living room on the couch. You then think to yourself how am I going to get her attention .</span></div></div>",
            "created":1457631000,
            "id":2115541,
            "title":"In the beginning!"
        },
        "11":{
            "author_id":"sctheriault",
            "author_name":"sctheriault",
            "choices":[
                "Your sister Juli arrives",
                "Her friend Veronica arrives",
                "She gets bored and goes looking for you",
                "She gets bored and messes with you to pass the time.",
                "Author's choice"
            ],
            "content":"<div class=\"\"><div> <span>You run up to Claire's feet and start pounding on them like a mad man. She doesn't even notice for a moment, then looks down at you with disinterest. <br>\r\n<br>\r\n\"Stupid bugs, they're so annoying.\"<br>\r\n<br>\r\nShe lifts the foot you were pounding on and brings it down on top of you. She doesn't use enough force to crush you, but you are now pinned under her foot. You try to struggle but it's useless,  and she isn't even paying attention to you anymore.</span></div></div>",
            "created":1466474940,
            "id":2167587,
            "title":"Pound on her feet"
        },
        "111":{
            "author_id":"carnaj1",
            "author_name":"carnaj",
            "choices":[
                "Claire sees you...",
                "Juli spots you first...",
                "The Two Girls are Oblivious to YourTiny Form..."
            ],
            "content":"<div class=\"\"><div> <span>You moan as the weight on your back shifts. It's unbearable feeling like ton upon ton pressing you down into the short-weave carpet. Pain wracks your tiny, ant-sized body as your best friend Claire idly moves her gigantic foot and wiggles her toes totally oblivious to the agony she's causing you as she continues to watch the movie that you had both been enjoying together just a short time ago.<br>\r\n<br>\r\nYou feel and hear your joints and bones popping as her foot moves again. New pain shoots through your body like you've never experienced before and you feel tears welling up in your eyes. You can't begin to even understand why you're still alive as the massive weight should had popped you like a grape (ages ago?). It seems like ages anyway, but you know it couldn't have been more than a few short minutes.<br>\r\n<br>\r\nMaking matters worse was the smell. Claire's feet were rank; the walk from her house was about a mile and it was hot out even so early in the morning. Summer had arrived with a vengeance and the temperature was probably pushing 90 degrees already. And she had worn her favorite shoes; those old white leather high-tops that she had had for years that she loved so much. They were soft and well-worn after miles of wear and tear, which was why she loved them so much, but they stank to high Heaven as she never seemed to wear socks. And now you were gasping for a breath of fresh air smelling the rank lingering odors of the old leather, stale sweat and whatever flowery-scented body wash she had used that morning and trying not to gag. You could only imagine that if there was really a Hell, this must be what it was like; hot, humid and reeking.<br>\r\n<br>\r\nYou have no idea why you were forced to endure this misery, or even how it had happened. One minute you were relaxing with your best friend and watching a movie and the next you were little more than a bug under her foot. It seemed impossible, but then you remembered the stories. They were just little News Bites on television shows like Inside Edition and the even less reputable 'Shock Shows' on cable, or an article in the tabloids you've seen at the supermarket checkout lines: People Shrinking! It was on the Internet as well; posts about government experimental gases and some weird new virus that was sweeping the globe and causing people to actually shrink. It was just so ridiculous, at least then. Now it was reality and you had apparently become a statistic.<br>\r\n<br>\r\n\"AHHRGH!\" you scream as you feel the weight of Claire's foot increase a thousandfold! Your vision greys and you feel your blood pressure skyrocket as your body compresses. Blood rushes echoing in your ears and your head feels about to explode. Somewhere in the back of your mind you reason that Claire must be standing up for some reason but the agony of pain swiftly pushes that thought away as you yell for mercy...<br>\r\n<br>\r\n\"Please! Claire... Stop!\"<br>\r\n<br>\r\nAnd miraculously it does. Fresh air rolls over your body as you gasp for breath again trying to move. You feel the pain lessening, receding as your bones seems to 'Pop' out loud and your body molds back into shape. You sob with relief as the torture seems to be over, but you realize that it could return at any moment and try to move, gripping the carpet in desperate fists and dragging yourself away from the front of the couch where you had fallen.<br>\r\n<br>\r\nTHOOM... THOOM... THOOM!<br>\r\n<br>\r\nYou look up in wide-eyed panic as you see your best friend coming closer. You look up and up along her now gigantic body; her forever-long tanned legs disappearing into her raggedy denim shorts, her black Lycra, spaghetti strap tank top barely holding her now gargantuan breasts in check, her pretty, smiling face framed with a short mane of thick black hair and thin, wire-rimmed glasses making her dazzling green eyes twinkle all the more. You've had a crush on Claire for years, but now those feelings seem intensified as she is so huge and powerful... beautiful as a Goddess!<br>\r\n<br>\r\nAnd deadly you realize as her huge bare foot slams down just inches in front of your tiny body...<br>\r\n<br>\r\nYou scream again realizing just how close you had come to getting crushed frozen in panic as you were. Desperate you turn about fighting past the receding pain and claw your way across the carpet. You force yourself to your hands and knees as you hear Claire's feet so close and scramble for safety finally tucking and rolling underneath the sofa. You are gasping for breath as you look back at Claire's huge, bus-sized feet shifting there where you had just been lying seconds before. You stare in awe at their size, almost mesmerized by her pretty, pink toenail polish sparkling in the sunlight.<br>\r\n<br>\r\nThen your heart clenches as you hear again the now familiar sound of footsteps somewhere off in the distance. The 'Thooming' seems far away at first, but getting closer and you look around frantically to see what's going on; your mind racing as panic wells up inside you again...<br>\r\n<br>\r\n\"Oh, Hi!\" You hear Claire's voice booming from somewhere high above but out of sight. It's loud but distant and happy you sense. Terror rises in you though as you hear a new voice echoing from still far away:<br>\r\n<br>\r\n\"Hey, Claire! How are you?\"<br>\r\n<br>\r\nYou groan again as you hear your sister Juli's voice, watching as her feet come into view from the hallway getting closer and bigger. You inch back deeper into the dim as terror grips you a little tighter; now two giant women that could easily step on you and snuff out your life without a thought or even realizing what they had done.<br>\r\n<br>\r\nAnd you know deep down that things just got worse. Your younger sister loves you, you figure - maybe even idolized you when you were both growing up and she followed you everywhere. Now she's fifteen however and a budding young, rebellious woman, and towards you - a brat! For some reason over the last few years she had started to become annoying and annoyed at whatever you did. She would rat you out to your mother at the slightest chance and the least infraction hoping to get you punished somehow and thoroughly enjoying when you did. She would sit there grinning in the background as your mother berated you for anything from missing your curfew to not taking out the trash before the garbage truck came. She seemed to love getting you into trouble and humiliating you now and you have no idea why.<br>\r\n<br>\r\nYou watch as she comes closer, her bare legs just visible from the calves down in your line of sight from under the couch; tanned and well-toned from her soccer over the years. You have to admit she's pretty with her long, blonde hair and budding figure; not quite come into her full beauty but still a heart-breaker. Her feet stop right in front of Claire's and you immediately smell the reek of the old ratty, black Tom's she's wearing as the two girls hug in greeting. Now there are four gargantuan feet to dodge.<br>\r\n<br>\r\n\"So, where's my stupid brother?\" Juli asks as her feet shift as though she is looking about the room.<br>\r\n<br>\r\n\"I dunno,\" Claire answers before sitting back down on the sofa. You hear the springs inside squeal as the furniture creaks as Claire crosses her right leg over her left. You can just see her pretty, dangling foot as it bobs in and out of view.<br>\r\n<br>\r\n\"I went into the kitchen to get us something to drink and when I got back he was gone. I thought he was just in the bathroom, but NO...\"<br>\r\n<br>\r\n\"Typical,\" Juli said as she flopped on the sofa. You wince as the couch moans with the added weight watching the back of her heels as she gets comfortable. \"He's such a loser!\"<br>\r\n<br>\r\n\"Oh, he's not,\" you hear Claire say in your defense. \"He's a nice guy, you just need to give him a chance.\"<br>\r\n<br>\r\nYou smile, nodding as you realize Claire understands. She is 18 like you are and knows that your sister is at that rebellious age and not liking authority of anyone older than she is. It doesn't make you feel any more safe, however as you watch their feet.<br>\r\n<br>\r\n\"Pfft!\" Juli says with disdain. \"He's a jerk and probably headed off to his room to play his stupid X-Box! I dunno why you even give him the time of day.\"<br>\r\n<br>\r\n\"We've been friends since grade school. You know that; Best friends. You'll realize eventually he's a good guy and you'll regret these times you're missing with him.\"<br>\r\n<br>\r\n\"I doubt that,\" Juli said with a snort. Her feet shift and you hear her drinking - probably your water. \"He's a jerk! If I ever get the chance you KNOW I'll put him in his place.\" You hear Claire sigh...<br>\r\n<br>\r\n\"What-EVER!\"<br>\r\n<br>\r\nA bit of silence then as the girls focus on the television. You try to screw up your courage as you prepare to crawl out from under the sofa. You need help, you know. You need help to get rid of this 'shrinking curse', but you doubt very much that you'll get that aide from your bratty sister. You have to hope that you can somehow get Claire's attention; her help.You have to hope she sees you before Juli so you start to crawl forward towards her massive feet hoping you can make her see you.<br>\r\n<br>\r\nHoping for the best...</span></div></div>",
            "created":1528828200,
            "id":2506269,
            "title":"Your sister Juli arrives"
        },
        "114":{
            "author_id":"tommy417",
            "author_name":"Tommy417",
            "choices":[
                "Finishes you off.",
                "Takes a closer look, noticing it's you.",
                "Loses intrest and walks away"
            ],
            "content":"<div class=\"\"><div> <span>You are stuck under Claire's warm sweaty foot.<br>\r\nShe's gets bored waiting for you to come back and decides to play a little with the \"bug\" she got trapped.<br>\r\n<br>\r\nClaire moves her foot back and forward making you roll underneath it.<br>\r\nThen she picks you up between her toes. She lifts you up to table height and then releases her grip on you.<br>\r\nYou fall to the floor and break your legs and your right arm.<br>\r\nYou cry in pain. Your best friend giggles, thinking she's just torturing a bug.<br>\r\n<br>\r\nYou look at her as she...<br>\r\n</span></div></div>",
            "created":1473890700,
            "id":2210196,
            "title":"Claire plays with what she thinks is a bug."
        },
        "1141":{
            "author_id":"numerio",
            "author_name":"Tex",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Claire says a quick \"buh-bye!\" to you. With a small wave, she brings her foot down on you. With a short squelch, you're nothing more than a stain.</span></div></span></div>",
            "created":1539728640,
            "id":2564636,
            "title":"Finishes you off."
        },
        "1142":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "There's no way to grow you back, so enjoy your life at that size!",
                "There's no way to grow you back, so I may as well enjoy your life at that size!",
                "There must be a way to grow you back, I'll help!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Claire crouches down and inspects this \"bug\". \"Hey, it's you! Well...\"</span></div></span></div>",
            "created":1603574700,
            "id":2928275,
            "title":"Takes a closer look, noticing it's you."
        },
        "13":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Claire!!\" You yell at the girl.<br>\r\n<br>\r\nDoes she notice you?</span></div></span></div>",
            "created":1514082540,
            "id":2431923,
            "title":"Yell for her to notice you"
        },
        "131":{
            "author_id":"giantessseeker",
            "author_name":"GiantessSeeker",
            "choices":[
                "Throw you into another Room",
                "Drop you into her Panties",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>She hears a noise and looks down to see you but she get's a very disgusted look on her face as she says \"Gross a Bug!\"  She leans down to pick you up \"This little guy should help me pass the time.\"  <br>\r\n<br>\r\nAnd with that she starts to inspect your tiny body very roughly, poking and prodding at you, she eventually gets bored of this and starts pulling at your limbs.  You can feel your arms stretch further than they ever have as she pulls wider and wider when...<b>POP!</b>  Your Left arm becomes dislocated, you scream out in pain which only causes Claire to giggle a bit as she hears the insect scream.  She gets bored of this just as quickly and decides too...</span></div></div>",
            "created":1516174260,
            "id":2441899,
            "title":"Insect"
        },
        "1311":{
            "author_id":"giantessseeker",
            "author_name":"GiantessSeeker",
            "choices":[
                "The World suddenly tips and you are Thrown Off",
                "A Hair Brush and Hair Spray threaten your Life",
                "You decide you have to Climb down"
            ],
            "content":"<div class=\"\"><div> <span>The entire world is suddenly tipsy turny as you are thrown through the air spinning out of control, when you come a somewhat soft landing suddenly.  <br>\r\n<br>\r\nAs you look around you notice that there are several strange brown trees protruding from the ground, you get up and decide to explore the area.  As you walk you notice how soft the ground is and how the air smells of shampoo, when suddenly the entire world begins to shake violently. <br>\r\n<br>\r\n At one moment it is so bad that you are thrown about the forest, and as you are you see that the forest is moving towards the stairs. Wait, Moving?  Your on a head of hair!  You then land back down in the Forest of hair as your transportation heads up the stairs.  The movements finally Stop when...</span></div></div>",
            "created":1516174860,
            "id":2441903,
            "title":"Into the Jungle"
        },
        "13111":{
            "author_id":"giantessseeker",
            "author_name":"GiantessSeeker",
            "choices":[
                "Don't Make It",
                "Make It",
                "Make it Half-Way"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the person tips there head forward and you are thrown off and into the air, when you land you hit the ground and when you open your eyes you are blinded by the sun.  As you get up you notice how hot it is outside, as you start walking around you suddenly slam into an invisible wall, to your inspection you realize it's a sheet of glass and wonder what a giant sheet of glass is doing in the desert. <br>\r\n<br>\r\nAs you look past the glass you see a bed with Pink sheets and flowers on it, Silver painted walls, clothes scattered all over the floor, and a backpack with the name Rebecca on it...Rebecca?  That's the name of Claire's 14 year old Sister.  If I can see her room then why am I in the desert, and with that you hear a sudden <i>Hiss</i> from behind you only to see a Giant Lizard eyeing you down for lunch!  <br>\r\n<br>\r\nYou jump out of the way as it's tongue lurches forward at you barely missing you, you run as fast as you can when you suddenly fall into a crater, when you land you notice that there are remains of Grasshoppers surrounding you.  It finally dawns on you that you are not in the desert but in a cage, which means you have fallen into a bowl!  <br>\r\n<br>\r\nBefore you can give this anymore thought the Lizard suddenly peer's its head into the bowl, as you attempt to run you find it impossible to escape as the plastic is to slippery to climb.  As you sit below you decide to give up, this is your fate and this is where you will die.  <br>\r\n<br>\r\nWhen suddenly you are picked up into the air only to see Rebecca has saved you from your doom \"Hey what are you doing in there little guy?\" she has discovered you!  You are saved!  You yell up to her to take you to Claire but ignores you as she takes you across the room \"I'll keep you in here until Lunch time little guy\" Lunch time you think, why wait until lunch?  <br>\r\n<br>\r\nWhen you look to down to see to your horror that you are being held above a jar of Live Grasshoppers!  Before you can react you are dropped into the jar and are immediately surrounded by something out of a horror movie, as you are pretty much choking in these inhumanely tight living conditions surrounded by Insects!  <br>\r\n<br>\r\nAs you look out of your prison you see Rebecca is reaching for the lid to the jar.  You have to get out now or you will be trapped in hell before being fed as food!  You jump on top of the Insects as you climb for the top, when you reach the top you...</span></div></div>",
            "created":1516176660,
            "id":2441910,
            "title":"Trapped"
        }
    },
    "info":{
        "author_id":"zombies14351",
        "author_name":"Winston14351",
        "brief_description":"You are shrunk at a friends house and everyone is completely unaware.",
        "created":1457629920,
        "description":"<td align=\"left\" class=\"norm\">One day while at a friends house you end up shrinking but no one knows where you are can you get someone's attention before it's to late</td>",
        "id":2077706,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603574700,
        "modified":1603574700,
        "pretty_title":"Shrunk at a friends house"
    }
}