{
    "chapters":{
        "1":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "an anime school",
                "an anime's realm (like for naruto their village or sonic mobius etc.)",
                "an anime characters dorm room",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Well i do not have a partner this time around so ill be going solo or will i? Who knows that's for you to decide. Well here's the story line........<br>\r\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&amp; #62;&gt;&gt;&gt;&gt;&gt;&gt;<br>\r\nJabari was sitting at home one day watching some anime on t.v . He had seen many different anime today. From bleach to naruto to code geass and more. While he was sitting there the t.v started flashing. Startled got up and started to back away. Then everything started to shake. Jabari was so scared he turned around and started run when suddenly a light shot out from the tv and he dissappeared. He later woke up in what looked like....</span></div></div>",
            "created":1251954000,
            "id":754972,
            "title":"cRAZY T.V"
        },
        "11":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "a group of inuyasha characters",
                "a group of sonic characters",
                "a group of naruto characters",
                "a group o girls from dragonball z,gt ",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Jabari woke up and looked around. He could what looked like lockers that stretched for miles. He could see large doors in between every row of lockers. \"What is this place\" he said silently to himself. He stood up and noticed he was in a large hallway(to him). The hallway seemed to stretch on for miles. It got him tired just thinking the thought of him walking.Jabari could tell he was at least 6 inches or so. \"How am i gonna get out of here now\" he thought.<br>\r\n<br>\r\nAs he was thinking a loud sound struck his ears. Jabari covered his ears in pain because it was so loud.Then it stopped ass quickly as it came. Suddenly he heard foot steps and the doors opened up. Out came several students.Jabari quickly ran as fast as he could to the side near one of the lockers so he would not get crushed.Several students walked by him and none of them noticed him.  Jabari looked as the students walked by and noticed that some were familiar.\"I got it\" he said. \"these are all girl anime characters\". Jabari could see a few that he could recognize and some that he could not. Suddenly a shadow loomed over him. \"well what do we have here?\" the voice said. Jabari turned around to see the face/faces of...</span></div></div>",
            "created":1252040400,
            "id":763825,
            "title":"an anime school"
        },
        "112":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "in her between breast",
                "Kept him in her hands",
                "wave(the swallow from sonic riders) appears "
            ],
            "content":"<div class=\"\"><div> <span>He turned around slowly turned around nearly frozen with fear. He looked up see the face of rouge the bat. He could also see amy, cream and cosmo talking to each other.  Rouge was wearing her usual pink and white boots and gloves. She wore her black pants and heart shaped shirt covering breast and her wings folded behind her. \"What are you doing here?\" she asked. Jabari remained silent still shock at her and everyone else's size compared to <br>\r\nhis. She scooped him up in her  and brought him to eye level. \"Scared\" she asked?<br>\r\n<br>\r\n<br>\r\nHe continued to stare at her then began to move his lips as if he was going to say something but stopped. \"Don't be scared\" she said  rubbing him against her fur. At his size rouge fur was soft and warm.\"Feeling better\" she asked him smiling. This time he nodded. \"Whatcha got their rouge?\" amy said. Rouge stood up turning around to amy,cream and cosmo then said \"I found something interesting\" extending her hand revealing the tiny guy. All 3 girls looked at him  closely \"Oooo he's cute can i hold\" amy said. Rouge pulled him away then said \"Not right now i wanna talk and get to know him.\"<br>\r\n<br>\r\nThe pink hedgehog let out a sigh of disappointment then said fine. Rouge stuck jabari in her pocket and continued talking with the other three about something else. He couldn't tell what else they were saying it was all muffled. He laid there in her pocket for a while then he could feel her walking again. Rouge's hand reached into her pocket then and she gently pulled out jabari and sat him on her shoulder. \"Were heading home\"  she said excitedly. \"Now where should i put you?\" Rouge thought for a moment then without hesitation put him....</span></div></div>",
            "created":1256360400,
            "id":780530,
            "title":"Enter rouge"
        },
        "113":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "sat on him",
                "stepped on him"
            ],
            "content":"<div class=\"\"><div> <span>Jabari turned around to see two girls staring down at him. One had pink hair and greenish eyes. She had a pink shirt and dark colored shorts. The other girl had long blonde hair that covered one eye. She had purple colored clothes and was wrapped in bandages. \"So who are you\" the blonde hair girl said grabbing him and bringing him to eye level. \"My names jabari\" he said nervously. The two girls smiled at him and the blonde haired girl spoke \"well my name is ino and this is sakura\" she said pointing to the girl with pink hair. <br>\r\n<br>\r\nJabari gasped and thought for a moment. \"the girls from naruto? How is this possible\". His thoughts were soon interrupted by ino asking\" hey what's on your mind?\" Jabari snapped out of his trance \"oh nothing\" he said. Sakura giggled at his spacing out and whispered something to ino. Ino smiled  \"i like that idea\". Jabari looked at them puzzled and sakura said \"were gonna have some fun\" ino closed her hand in a cage like fashion and put jabari in her pocket(some time later)... It had felt like hours had gone by since he was put in her pocket he eventually fell asleep.  Suddenly he  could feel him self being jostled around. <br>\r\n<br>\r\nHe woke up a bit sleepy still.He looked around and noticed he was laying on what looked like a giant bed. He tried to stand up but realized something. He was tied up by what looked like one of ino's bandages. Jabari started to struggle. As he struggled ino and sakura had just walked in.\"Oh he's awake\" they said.  Jabari scared struggled his way onto his feet and  began hopping away. \" Oh no you dont\" ino said grabbing him by his leg. \"I think its time we teach you who's boss\" sakura said smiling evilly. Sakura set him on the floor and </span></div></div>",
            "created":1261976400,
            "id":811874,
            "title":"enter Sakura and ino "
        },
        "1131":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "One of use puts him in are panties!",
                "Let's have him rub are feet!",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Sakura looked down at the tiny man on the floor and smiled \"Get ready little twerp!\" Jabari watched as Sakura turned around and gave him a great view of her spandex covered ass. Sakura started to lower herself tworeds Jabari but he was to stunned by what's happening to even think straight so he just watched as her rump got closer and closer.<br>\r\n<br>\r\nSakura looked over her shoulder and licked her lips as she positioned herself perfectly over him. Ones he was centered she smiled and pooped her ass down ontop of Jabari. Sakura sighed and extended her legs \"Ahh this feels right.\" she said as she wiggled her rump ontop of him. Jabari finally snapped out of it and started to sqwerm and scream but this only made Sakura giggle and wiggle her ass more. \"What do you not like it under my sexy ass?\" she said as she heard his muffled screams. <br>\r\n<br>\r\n-Jabari's PoV-<br>\r\n<br>\r\nJabari watched in fear as Sakura's soft ass lowerd tworeds him. He watched as she looked over her shoulder and started to move till he was under her asscrack where her spandex shorts had gone inside. But soon his whole world turned black as she finally sat down Jabari snapped out of his trance when his nose was quickly assaulted by the foul smell from the depths of her crack \"Oh god! Where! What! Get me out of here!\" he yelled but all he could hear was the soft muffled giggles of Sakura.<br>\r\n<br>\r\nJabari's world started to move as Sakura grinded and wiggled her ass ontop of her making him slowly move into her crack.<br>\r\n<br>\r\n-Back to Sakura-<br>\r\n<br>\r\nSakura smiled as she felt her little toy wiggling between her soft buns \"Oh! Looks like we have a little adventurer.\" she giggled and closed her eyes continuing her little ass wiggles feeling jabari move further into her spandex asscrack \"I hope the smell isn't bothering you to much dear.\" she said as she heard his muffled screams get softer and softer. Sakura sighed and sat there just enjoying her little toy \"He's so much fun Ino haha.\" Sakura looked over at Ino who was sitting on the bed watching all the fun.<br>\r\n<br>\r\n\"So what do you think we should do next with him?\" Ino said. Sakura sat there feeling one last sqwerm and then got a big smile on her face \"I know! How about!\"<br>\r\n</span></div></div>",
            "created":1330923600,
            "id":1289180,
            "title":"Under dat rump!"
        },
        "11311":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Heads (Sakura)",
                "Tails (Ino)"
            ],
            "content":"<div class=\"\"><div> <span>Ino smirked at the idea Sakura made by putting Jarabi in one of the girl's panties.<br>\r\n<br>\r\n\"Oh! I love the way you think, Sakura! Who should do it?\" Ino wondered with excitement.<br>\r\n<br>\r\n\"How about Heads or Tails? Heads for me, Tails for you.\" Sakura suggested as she took out a coin.<br>\r\n<br>\r\n\"Sounds good to me.\" Ino replied.<br>\r\n<br>\r\nSakura flipped the coin and catches it and it shows that it's</span></div></div>",
            "created":1477285200,
            "id":2228042,
            "title":"One of us puts him in our panties!"
        },
        "113112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Vagina.\"",
                "Ass.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hurray! I can't wait to place our little toy in my panties!\" Ino said with excitement.<br>\r\n<br>\r\n\"Don't waste any more time then.\" Sakura said <br>\r\n<br>\r\nSakura grabbed Jarabi from underneath her ass and hands him over to Ino.<br>\r\n<br>\r\n\"Alright Jarabi, I'm gonna put you inside my panties by my</span></div></div>",
            "created":1483968660,
            "id":2261146,
            "title":"Tails (Ino)"
        },
        "11313":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "They \"Play\" with them.",
                "Put them away for the night. (try to escape.)"
            ],
            "content":"<div class=\"\"><div> <span>Ino looks at Sakura and puts her finger on her chin \"Yah know I really dint know what we should d-...\" she stoped befor she finished what she was saying. Ino stood up off the bed \"What is is Ino?\" Sakura said. Ino looked at Sakura and back at the dresser and pointed \"you see it?\" Ino said then Sakura turned her head and sqwinted.<br>\r\n<br>\r\nBoth Ino and Sakura sat there for a second and then noticed something small move underneath the dresser. When Ino noticed this she bolted tworeds the dresser and grabed what ever it was \"I got it!\" she yelled. Ino pulled her hand out from under the dresser and brought her hand to her face \"Alright let's see what we got here.\" she said with a smile.<br>\r\n<br>\r\nShe slowly opened her hand and the second she did this her eyes widend \"Oh my god!\" Ino yelled \"Wha-.. What is it?\" Sakura said as she still sat on Jabari. Ino turned around and held out her hand soon Sakura's face got a wide grin \"Looks like we have another toy.\" the two girls sat there looking at the new small man in Ino's hand.<br>\r\n<br>\r\nHe stood there in fear looking at the two giant girls \"So what's your name little guy?\" Sakura said with a giggle. The tiny guy looked into her giant eyes.<br>\r\n<br>\r\n\"Uah... It's Ethan ma'am...\" he studderd. <br>\r\n<br>\r\nInto brought him to her face \"Well Ethan looks like you ended up in the wrong girls room.\" she closed her hand around him. \"What should we do with are new toys huh?\" Sakura said as she wiggled her butt and smiled.</span></div></div>",
            "created":1330923600,
            "id":1289259,
            "title":"Reader's choice."
        },
        "115":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "group of bleach characters",
                "group of code geass characters",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More show choices.</span></div></span></div>",
            "created":1252040400,
            "id":755430,
            "title":"More shows"
        },
        "1153":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "the 3 angels from Bokusatsu Tenshi Dokuro-chan",
                "one piece ",
                "even more "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There's lot of anime out there  you may know more then me.  Well here's some more choices.</span></div></span></div>",
            "created":1252126800,
            "id":755784,
            "title":"more"
        },
        "11533":{
            "author_id":"kiyo78",
            "author_name":"Mixmasta787",
            "choices":[
                "YEs star wars!",
                "eh no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about characters from star wars?</span></div></span></div>",
            "created":1259989200,
            "id":801749,
            "title":"Star wars?"
        },
        "115332":{
            "author_id":"pichu95",
            "author_name":"JFO",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Sailor Moon?</span></div></span></div>",
            "created":1271566800,
            "id":869722,
            "title":"eh no thanks"
        },
        "1153322":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "YASS",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sword Art Online.<br>\r\n<br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; </span></div></span></div>",
            "created":1447736400,
            "id":2063606,
            "title":"No"
        },
        "11533222":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "Why not?",
                "Other and other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yeah, I know this is so long, but how about Toradora? I mean its about high school period!</span></div></span></div>",
            "created":1483973940,
            "id":2261166,
            "title":"Nope"
        },
        "115332221":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "Taiga or Ami",
                "Kushieda or?"
            ],
            "content":"<div class=\"\"><div> <span>''Here we are, just in a normal day of a normal school, can it be that I just teleported here by that flashy TV?''<br>\r\nBut the world around him wasn't like his normal school, neither was normal at all, everything was GIGANTIC.<br>\r\nHe stopped and saw this HUGE girl coming on towards him, each step making him lose balance like there was and earthquake going on and when she was so close that towers over him by about 150 meters(about 500 ft ), her last step make him fall with his butt on the ground, unable to stand up and frozen by fear as an absurdly enormous hand picked him up and brought him at a high speed towards a giant face, that you recognize as..<br>\r\n</span></div></div>",
            "created":1483974780,
            "id":2261171,
            "title":"Why not?"
        },
        "1153322211":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "Taiga Aisaka",
                "Ami Kawashima"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her pretty face, those hairs, you are sure as she opens mouth that she is..</span></div></span></div>",
            "created":1483974840,
            "id":2261172,
            "title":"Taiga or Ami"
        },
        "11533222111":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "Put you in her panties",
                "Eats you"
            ],
            "content":"<div class=\"\"><div> <span>''Okay, listen up pipsqueak, i'mma make this short''<br>\r\nShe giggle at her own pun as she says ''short''<br>\r\n'' I shrunk you and teleported to this dimension, how I done that is not your business.<br>\r\nYou are going to be my slave, you will do everything that I, your goddess, want, lick my feet, kiss them, worshipping me, worshipping my ass, my pussy, everything!''<br>\r\nYou lose the count of how many things you are going to endure staying with this crazy tsundere girl, as you know by watching the Anime, she is unpredictable and her emotions change quickly, so you have to be prudent, not that you could do much against a giant skyscraper Taiga anyway..<br>\r\n''Are you paying attention you dumb fuck?!? I'm gonna teach you how to be a good slave!''<br>\r\nYou knew that you screw up as she..</span></div></div>",
            "created":1483981200,
            "id":2261193,
            "title":"Taiga Aisaka"
        },
        "115332221111":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "In my beloved pussy",
                "My big, stinky ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where should I put you?</span></div></span></div>",
            "created":1483981320,
            "id":2261195,
            "title":"Put you in her panties"
        },
        "1153322211112":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "''Might try to do it for once''",
                "Nah, there is time for that"
            ],
            "content":"<div class=\"\"><div> <span>''I saw how you were stopping the video to watch at my ass all the time, so why don't put you right there, you're happy now aren't you?''<br>\r\nShe is a bit right, but with her size now her butt is so astonishing BIG, only one check is like a house to you, her entire butt is double that, all trapped in her panties.<br>\r\nShe goes to the bathroom to get some privacy, and lowers the panties, then proceeds with sticking you up her butt crack.<br>\r\nInstead of showing you up her anus, which is 6 times bigger than you to get some context, so it would not be that difficult for her to do that if she wanted to.<br>\r\n<br>\r\nAs she approaches you to her crack you start to smell a slightly stinky odor, but it gets stinky and rotten as hell as she separates her ass checks with her finger and stuck you in the middle of her crack, making your nose cringe and then trapping your whole body in her majestic mountain that is her ass, letting go the finger and so making her right ass check to smash ring against her left ass check, with you in the middle.<br>\r\nYou started to regret looking at her ass so much, disgusted by the smell of shit and sweat all around you, as well as the physical pain that staying in her butt means.<br>\r\nYou didn't wanna end like that, and you fight full force with her pink ass meat, but it is useless, and your squirming only increase her arousal.<br>\r\n''You know, I actually enjoy having you in my ass, and as much as I enjoy you squirming around, if you don't stop right now I might have to ''retaliate'' with my ''cannon''-she pauses and giggle for an instant-''and trust me, you don't want me to do that.''<br>\r\nWith her threatening and the risk for you to be ''shot'' by her ''cannon'' point blank, you decide to stop rejecting your new life, as she is completely dominating you, like a ruler, or more like a goddess.<br>\r\n<br>\r\n''Hey maggot, just to reassure you like the good giantess I am, you are actually immortal to physical damage, and you will only feel paaiiin.'' She stopped on that word for too long you think as you are reassured but threatened at the same time.<br>\r\nShe starts to put her panties up, because she hated to ''do it'' in the school bathrooms, but then she has a thought..<br>\r\n</span></div></div>",
            "created":1483985160,
            "id":2261222,
            "title":"My big, stinky ass"
        },
        "11533222111121":{
            "author_id":"dominike",
            "author_name":"Bukkin",
            "choices":[
                "She start shitting, oh oh..",
                "Reader choice"
            ],
            "content":"<div class=\"\"><div> <span>You panicked.<br>\r\nYou were just sitting on a couch having fun watching some anime and cartoon, this wasn't supposed to go like this, you could never ever imagined that it would end like this.<br>\r\nYou are terrified as she sits on the toilet seat that is her throne, concentrate for a second, and then..<br>\r\n<br>\r\n<span class=\"cbgreen\">PROOOOOOOOOT</span><br>\r\n<br>\r\nThe shockwave of the fart spins you away from her ass cheecks and let you hit the cold, toilet water below her ass, like you were some sort of projectile shot by her BIG ass gun, a great bombard of pure stink and terror to you.<br>\r\n<br>\r\n<span class=\"clteal\">SPLAH</span><br>\r\n<br>\r\nThe freezing water was already dirty by all the girls that have used the stall until then, and emanated a strong, warming smell of piss, as well as an odor of dried shit that came from the inner walls of the toilet.<br>\r\nYou started thinking to yourself ''This can't go any worse''.<br>\r\n<br>\r\nYou were wrong.<br>\r\n<br>\r\nThe fumes of her fart reaches you, and god did it stink.<br>\r\n<br>\r\nIt was a small fart after all, little more than a toot, but it carried within itself an entire digested breakfast and the bentō too, that today was made of curry and other spicy things, as she likes to point out.<br>\r\n''You know, today I had a veeeery large lunch, as you have seen through your screen, so you know what is about to come, my little man''<br>\r\nShe complains on how her previous fart stank so much, that she desires to not have a nose to smell that, unaware(or maybe not) of how that fart was torturing you, mixing with a strong odor of piss and shit, hitting you like an inhumane chemical weapon, so strong that if you weren't immortal, you are sure that you were going to die.<br>\r\n<br>\r\n<span class=\"clgreen\">PPPPPPPPRRRRRRRRRRTTTRMMMPT</span><br>\r\n<br>\r\nHer gigantic anus opens up once more and let out another fart that makes you dizzy, and the smell makes you gag, you try hard not to breath in that shit aroma, but you can't hold your breath forever, and when you are forced to smell that stink, you wish that you were better dead, as a sulphuric smell get on your nostrils, making them burning, and gets up to your throat, you feel like being choked to dead.<br>\r\n<br>\r\nYour vision is blurring, but you see her touches herself, she get off of dominating a man with her fart! Thats how sick she was! She wanted to inflict you pain, just for her personal fun and enjoyment.<br>\r\nYou have a sick though that she always get wet dreaming to do this, and now that she can, nothing is going to stop her making you suffer for her pleasure.<br>\r\n</span></div></div>",
            "created":1484058300,
            "id":2261610,
            "title":"''Might try to do it for once''"
        },
        "12":{
            "choices":[
                "naruto world",
                "pokemon world",
                "other worlds",
                "other worlds",
                "other worlds"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which anime world does he end up in?</span></div></span></div>",
            "created":1380949200,
            "id":1674712,
            "title":"an anime's realm (like for naruto their vil..."
        },
        "121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Sakura",
                "Tsunade",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>Jabari wakes up and sees that he's in an isolated place that he's got no idea of. He also checks himself and sees that he has shrunken to a small size. That's when the shaking of the ground happens as well as the booming in his ears. Jabari then looks up to see the face of</span></div></div>",
            "created":1477371600,
            "id":2228421,
            "title":"naruto world"
        },
        "1211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Bra",
                "Panties",
                "Sandels"
            ],
            "content":"<div class=\"\"><div> <span>Jabari looks up a pair of tower like legs to see the face of who you know is the pink haired kunoichi of the naruto series, Sakura Haruno. He was surprised to see him so big and she seems to have a cocky smile on her face while looking straight at him. She then bends down and picks him up to her face.<br>\r\n<br>\r\n\"Well well well, look what I have here. I could use something or someone like you, little guy.\" Sakura said.<br>\r\n<br>\r\nJabari was a little scared at what she had planned on doing to him. Sakura looks at him and patted him on the head.<br>\r\n<br>\r\n\"Don't worry my little pet, I'm gonna take such good care of you. You don't have to worry about people out there to kill you because I'm gonna be with you always. Now, let me show you to your new 'room'.\" Sakura said.<br>\r\n<br>\r\nSakura would then placed Jabari inside her</span></div></div>",
            "created":1477456560,
            "id":2228462,
            "title":"Sakura"
        },
        "12112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In which end, though?</span></div></span></div>",
            "created":1477459800,
            "id":2228476,
            "title":"Panties"
        },
        "121121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Cat and mouse",
                "Hide and seek"
            ],
            "content":"<div class=\"\"><div> <span>Sakura opens the front end of her shorts and panties and she places Jarabi inside. She put her panties and shorts back into place and patted on the spot that Jarabi's in. She would then have an aroused feeling after feeling him moving inside her panties.<br>\r\n<br>\r\n\"Are you trying to get comfortable in there, Pet? You'd better because it's where you'll be staying in whenever I see fit. Oh! I like that! Maybe if you're good, I'll let you do more of that.\" Sakura said.<br>\r\n<br>\r\nJarabi was trying to get comfortable inside Sakura's panties and was having a hard time doing so while being next to her vagina. He finally did and was waiting for Sakura to bring him out. After a while, Sakura made it to her home and pulls Jarabi out of her panties and places him on the table.<br>\r\n<br>\r\n\"Bet you felt so comfy in my panties, did you?\" Sakura asked slyly.<br>\r\n<br>\r\n\"Whatever you say.\" Jarabi said.<br>\r\n<br>\r\n\"Now, how about a game?\" Sakura suggested.<br>\r\n<br>\r\n\"What kind of game?\" Jarabi wondered.<br>\r\n<br>\r\n\"How about</span></div></div>",
            "created":1477468980,
            "id":2228500,
            "title":"Front"
        },
        "1211212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Dresser",
                "Bed"
            ],
            "content":"<div class=\"\"><div> <span>\"How about hide and seek?\" Sakura suggested.<br>\r\n<br>\r\n\"I guess that sounds safe enough. I'm game.\" Jabari said.<br>\r\n<br>\r\n\"Great! You hide and I'll count.\" Sakura said.<br>\r\n<br>\r\nJabari nodded and he looks for a hiding spot while she begins counting. He then run up to her</span></div></div>",
            "created":1477591680,
            "id":2229139,
            "title":"Hide and seek"
        },
        "12112121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "She does",
                "She doesn't"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jabari looks at the bed and it seems too obvious for him to hide. So he chooses Sakura's dresser and went underneath it. Sakura finished counting and goes on looking for Jabari. He keeps his composure in and hopes that she doesn't find him.</span></div></span></div>",
            "created":1477594200,
            "id":2229162,
            "title":"Dresser"
        },
        "121121211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Your P.O.V",
                "Sakura's P.O.V"
            ],
            "content":"<div class=\"\"><div> <span>Sakura looks around her room until she went to her dresser and spots Jabari.<br>\r\n<br>\r\n\"Crap!\" Jabari cursed in his head.<br>\r\n<br>\r\n\"There you are. Took me long enough.\" Sakura said as she reached in and grabbed him.<br>\r\n<br>\r\n\"Looks like you won.\" Jabari said.<br>\r\n<br>\r\n\"That's right. Now, how about-?\" Sakura was stopped when she heard a knock on her front door.<br>\r\n<br>\r\n\"Looks like someone's here for me. Wait right here.\" Sakura said as she puts Jabari on a table and goes to answer the door.<br>\r\n<br>\r\nAfter about five minutes, Sakura comes back into her room and Jabari wondered on what's going on.<br>\r\n<br>\r\n\"Well, uhhh, what did you say your name was?\" Sakura asked as she figured that they didn't have a proper introduction.<br>\r\n<br>\r\n\"It's Jabari, Ma'am.\" Jabari introduced.<br>\r\n<br>\r\n\"Right! I'm Sakura, by the way. Now, I've just talked to someone and he said that I have to go see my teacher, Tsunade. And you know that I want you to come with me.\" Sakura explained.<br>\r\n<br>\r\n\"I know.\" Jabari said with a sigh.<br>\r\n<br>\r\n\"Good. Get in your room.\" Sakura said as she opens up her shorts and panties.<br>\r\n<br>\r\nJabari gets up and climbs inside her panties. Sakura closes them shut and goes to see Tsunade.</span></div></div>",
            "created":1477596000,
            "id":2229170,
            "title":"She does"
        },
        "1213":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Hinata",
                "Ino",
                "Other girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hinata or Ino?</span></div></span></div>",
            "created":1477450860,
            "id":2228422,
            "title":"Others"
        },
        "122":{
            "choices":[
                "DAWN",
                "misty",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>Jabari awoke to find himself in a forest of.....grass? Yes, the grass was tall just a bit taller than him. At first he though that he was in a world where grasses were big. Then he felt an earthquake. Turning around, he realized the grass wasn't bigger, he just shrunk; because standing before him was an anime girl as tall as a skyscraper. Then he realized he was in the pokemon world, because the giantess towering over him was...</span></div></div>",
            "created":1380949200,
            "id":1674715,
            "title":"pokemon world"
        },
        "1221":{
            "choices":[
                "use him as a dildo",
                "make him massage her body",
                "tease him for her amusment"
            ],
            "content":"<div class=\"\"><div> <span>the giantess towering over him was Dawn, her signature pink mini-skirt flapping about as she walked, revealing the goddess' sexalicious panties. She stopped before him, croutching down to look at him closer, giving away a sexier look under her skirt, somehow knowing you were there. \"Omg, it worked.\" she exclaimed gleefully, grabbing him quickly so that he couldnt escape. She stared at him with her car-sized eyes. \"Now I have a tiny slave of my own. Your going to do everything I tell you to do, or else!\" She giggled evily. Before he could say anything, Dawn lifted her skirt opened her panties and thrust him inside. Closing them and dropping her skirt back down, she felt very aroused. \"Now what to do with him first?\" she wondered outloud.</span></div></div>",
            "created":1380949200,
            "id":1674726,
            "title":"DAWN"
        },
        "12213":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Stayed in her panties and pleasure her",
                "Pulled out Dawm gets you something else to do"
            ],
            "content":"<div class=\"\"><div> <span>Dawn bringed her hand down to her panties and rubbed her crotch from the outside on the spot where Jabari is. Jabari felt Dawn's fingers rubbing his back from the outside of her panties and it seems that she's teasing you a bit.<br>\r\n<br>\r\n\"How does that feel? You like being in my panties, Slave? Don't deny that you like it.\" Dawn teased as she keeps on rubbing the spot Jabari is trapped in.<br>\r\n<br>\r\nSomewhere in his body may have him believe that he does like it. But in reality, he finds this really crazy as he squirms next to her vagina and Dawn moans a little to it.<br>\r\n<br>\r\n\"I knew it! You do like being in there! I think I may've found your position!\" Dawn said with excitement as you are</span></div></div>",
            "created":1477285200,
            "id":2227978,
            "title":"tease him for her amusment"
        },
        "1223":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "May",
                "Jessie",
                "More girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>May or Jessie?</span></div></span></div>",
            "created":1477371600,
            "id":2228307,
            "title":"others"
        },
        "123":{
            "author_id":"jjjtttddd",
            "author_name":"DumbDumb1010",
            "choices":[
                "videl",
                "bulma",
                "chi-chi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one dbz girl character </span></div></span></div>",
            "created":1386824400,
            "id":1706892,
            "title":"dbz"
        },
        "1231":{
            "author_id":"jjjtttddd",
            "author_name":"DumbDumb1010",
            "choices":[
                "goku",
                "gohan",
                "oc or yourself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dbz or oc or just go it your self</span></div></span></div>",
            "created":1386824400,
            "id":1706903,
            "title":"videl"
        },
        "124":{
            "author_id":"asmallfriend",
            "author_name":"Keiji ",
            "choices":[
                "Yass",
                "Nope",
                "Other world"
            ],
            "content":"<div class=\"\"><div> <span>ソードアート・オンライン<br>\r\nSword Art Online<br>\r\n<br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt; <br>\r\noxxx:{}::::::::::::::::::::::::::::&gt;</span></div></div>",
            "created":1447736400,
            "id":2063608,
            "title":"other worlds"
        },
        "125":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Yu-Gi-Oh!",
                "Rosario + Vampire",
                "Other worlds"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other worlds does Jabari ended up?</span></div></span></div>",
            "created":1477371600,
            "id":2228308,
            "title":"other worlds"
        }
    },
    "info":{
        "author_id":"kiyo78",
        "author_name":"Mixmasta787",
        "brief_description":"My last story all anime female characters welcome  GET GP for add",
        "created":1252006500,
        "description":"<td align=\"left\" class=\"norm\">You know the character its jabari  <br>\r\nage:unknown <br>\r\n <br>\r\nIm in anime world this time only female characters from anime's are allowed. No toilet stuff, no killing jabari  everything else it welcome unless its just way to much.Well you know the anime, the characters and the shrunkee. Now lets get this story going<br>\r\n<br>\r\nOh and Gp for good adds i have alot haven't used much but i've been adding lol</td>",
        "id":1596916,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1484058300,
        "modified":1484058300,
        "pretty_title":"Shrunk in anime"
    }
}