{
    "chapters":{
        "1":{
            "choices":[
                "Her wish comes true, but mom struggles with it.",
                "Her wish comes true and her mom seduces her.",
                "Other Ideas ",
                "Other Ideas ",
                "Other Ideas "
            ],
            "content":"<div class=\"\"><div> <span>On her walk back home after school, Mandy spots something very shiny while walking by a thick patch of weeds, bending down to pick up the shiny object, she sees it's actually a beautiful golden ring with many tiny gems encrusted in it, as she picked it up she got a very sharp shock, almost dropping the ring, but just as quickly as she got shocked, the pain went away.<br>\r\n<br>\r\nContinuing to examine the ring on her walk home, she finally puts on the ring and a warm feeling washed all through her body, now arriving at her front door, she walks into her home only to hear the dishes being washed, knowing her mother Eva was in the kitchen.<br>\r\n<br>\r\nAs Mandy says hello to her mother, she sees her mom is facing away from her while saying \" welcome home dear, how was school today\" ... Mandy just stood there staring at her mother's big butt, not even hearing her mother speaking.<br>\r\nMandy couldn't look away from the sight in front of her, her mother was washing the dishes in her panties, Mandy thought' if I were a boy I would have a boner right now ' but being a girl I can hide it .....<br>\r\n<br>\r\nNot even thinking about the ring she had found, she said under her breath \" I wish that mom would see me the way that I see her\" and then she said \" Hi mom, school was fine but I am tired, call me down later for dinner please\" as she walks upstairs into her room and lays down thinking about her mother ....</span></div></div>",
            "created":1549816800,
            "id":2615615,
            "title":"Mandy's wish"
        },
        "12":{
            "choices":[
                "Mandy choose the couch, just like in Eva's dream.",
                "Mandy chose Eva's bedroom",
                "Mandy chose her own bedroom",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>As Mandy walked back upstairs into her large bedroom, Eva had finished washing the dishes and walked into the living room for a break before starting dinner, \" Whew, I am tired all of a sudden\" as Eva closed her eyes and began to drift off, in the state between sleeping and being awake, Eva had been mumbling to herself ' Mandy sure looks exceptionally Pretty today \" over and over Eva chanted this until she lost her battle to sleep.<br>\r\n<br>\r\nIn Eva's dream, she and Mandy was alone at home and Mandy comes down stairs in only her bra and panties, acting like this was just the usual attire for a girl her age, Eva would watch her daughter everywhere she walked, until she ended up sitting down right beside her mother Eva, she sat so close to her mom that their outer thighs were touching and Mandy would rest her head against Eva's large breasts.<br>\r\n<br>\r\nEva gasped inside her dream and was taken back even more when Eva asked her daughter Mandy, \" Mandy honey, can mommy give you a back rub ?\"  Mandy was excited hearing her mother ask her such a question and responded with \" Oh I would love a back rub mother\" as Mandy turned her back towards her mother, for the first few seconds Eva would run her hand up and down her daughters back but then she reached up and unclasped Mandy's bra, Mandy kind of gasped but said nothing and just closed her eyes.<br>\r\n<br>\r\nEva's hands would cover all of Mandy's back and then started on her sides, where she would rub lightly with only her finger tips, causing Mandy to develop cold chills, sometimes even brushing along the outside of Mandy's flat chest and swiping across her nipples ' accidently' , while saying \" woops honey, sorry about that\" and continuing down her sides.<br>\r\n<br>\r\nEva awoke from her erotic dream about Mandy and sat up eyeing her surroundings.<br>\r\n\" Oh thank goodness that was only a dream\" as she heard Mandy coming down the stairs and into the living room, \" hi mom, whats going on ?\" ... \" Oh nothing sweet heart, I just woke up from a dream\" .<br>\r\n<br>\r\nMandy then asked her mom Eva, \" hey mom, I don't know why I am asking this, but the thought just occurred to me, how great it would feel to have a back rub,\"<br>\r\n<br>\r\nEva sits up straight as a board and thought to herself \" can this really be happening to me right now?\".<br>\r\n<br>\r\nLooking at her daughter she answered :\" where would you like your back rub baby ?\".</span></div></div>",
            "created":1553895900,
            "id":2636913,
            "title":"Her wish comes true and her mom seduces her."
        },
        "121":{
            "choices":[
                "Yes exactly like in her dream.",
                "Not exactly, but close enough.",
                "Eva takes it beyond her dream.",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>\" A back rub would be wonderful mom \" as Mandy sits down so close to her mother that their outer thighs were touching, Eva kept having flashbacks of her dream, although Mandy was not wearing only a pair of bra and panties, she was only in a robe, Mandy was about to take a bath when her mother asked her about a back rub.<br>\r\n<br>\r\n\" Okay sweetie, turn around so momma can get to your back\" and as Mandy turned facing away from her mom, she opened her robe and let the top half fall onto her lap, exposing her bare back to her mother.<br>\r\n<br>\r\nDoes Eva give Mandy a back rub like in her dream ?</span></div></div>",
            "created":1562573040,
            "id":2683736,
            "title":"Mandy choose the couch, just like in Eva's ..."
        },
        "1211":{
            "author_id":"shelly777",
            "author_name":"shell7",
            "choices":[
                "Mandy turns around",
                "Mandy wants to rub Mommy now",
                "Eva does both for her daughter."
            ],
            "content":"<div class=\"\"><div> <span>Eva could not tare away from her dream and watched almost as her hands were on auto pilot.<br>\r\n<br>\r\nEva's warm hands were caressing Mandy's soft bare back and sides of her back, Eva was holding her breath as she watched her mother fingers sliding along Mandy's sides, inside Eva gasped as her fingers brushed along her daughters small erect nipples, causing Mandy to gasp out loud, \" OH MOMMY \" Eva was startled when Mandy spoke, causing Eva's fingers to completely pull away, \" Mommy that was nice, I mean it felt nice... could you do that again mommy ?\" as Eva saw Mandy peel off the rset of her robe and let it fall to the floor.<br>\r\n<br>\r\nEva is startled again as her fingers were starting towards her daughter Mandy again but stopped when she heard her daughter speak \" Mommy do you want me to stay this way .. or ... do you want me to turn around and face you Mommy ?   I would like either or both ways mommy, OH .. and I was going to ask you also, would you like me to rub you as well Mommy ?\".<br>\r\n<br>\r\nEva felt compelled to choose an answer for her daughter,  \" Baby, Mommy wants you to choose, Mommy will help you in any way that you want \"......</span></div></div>",
            "created":1604249580,
            "id":2932749,
            "title":"Yes exactly like in her dream."
        }
    },
    "info":{
        "author_id":"remcob",
        "author_name":"RemcoB",
        "brief_description":"A girl finds a ring wich can give her anything she desires",
        "created":1275937500,
        "description":"<td align=\"left\" class=\"norm\">This story is about a girl named Mandy who finds a magical ring.<br>\r\nShe lives with her mother(Eva), her parents are divorced.<br>\r\n<br>\r\nEva is 43 years old, 5'6\" tall, D-cup breasts, long, blonde hair, slim but not too slim, has barely visible 6-pack abs.<br>\r\n<br>\r\nMandy is a 17 year old geek, 5'2\" tall, flat chested, pretty fat and has short, black,hair.<br>\r\nShe has no real friends, but all the teachers like her.<br>\r\n<br>\r\nRules:<br>\r\n- NO sex change<br>\r\n- Can have sex, But no details about that<br>\r\n- NO giantess (max. 15\" tall)<br>\r\n- NO deaths<br>\r\n- Others are allowed to grow<br>\r\n- Introduce important characters before using them<br>\r\n- Try to avoid one-sentence chapters<br>\r\n- Keep your english correct, no big mistakes like: you mean off, but write of (I know my own english is not the best, but still try to keep yours correct).<br>\r\n</td>",
        "id":1680018,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604249580,
        "modified":1604249580,
        "pretty_title":"The ring of desires"
    }
}