{
    "chapters":{
        "1":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Tweek",
                "Craig",
                "Stan",
                "Kyle",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>We begin in the quiet little mountain town known as South Park and of course our story must start with a protagonist so who will it be?</span></div></span></div>",
            "created":1484197200,
            "id":2262641,
            "title":"Start"
        },
        "11":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Craig",
                "Stan",
                "Kyle",
                "Token",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Tweek awakes with a jolt and a flash of bright light. After a few moments of silence tweet is met with the sight of four aliens. \"Agh what do you want with me\" tweek said. Tweek attempted to move but could not fight against the restraints, He was met with another flash. \"Ngh it was just a dream, I agh have to calm down, ow my head\" tweek was pained by the  sudden rush of information \"Agh holy crap I have the power of possession this is ngh awesome\" tweek wanted to try it immediately so he turned and looked at his pet parokeet \"sorry buddy I just want to try\" tweek melted into goo and slithered into his bird through its mouth within a moment he blacked out when his vision corrected he was in complete control \" oh Jesus I possessed him cool\" with the knowledge that it works perfectly tweet exited his bird and reformed from the goo back to his normal self \"Alright ngh now who do I want to be first? Oh I know...\"</span></div></div>",
            "created":1484197200,
            "id":2262699,
            "title":"Tweek"
        },
        "111":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Ass",
                "Dick",
                "Mouth"
            ],
            "content":"<div class=\"\"><div> <span>Craig was siting alone in his desolate house enjoying a book when he heard a knock on the door he begrudgingly got up and to his surprise tweek was at the door \" dude I told I did not want to hang out so why are you here?\" Craig inquired \"err um I was um may I please come in? ngh\" tweek asked \"uhh sure just be quiet while I finish my book ok tweek\" tweek entered quiet as a mouse as Craig lead them upstairs to his room and shut the door crag then proceeded to lie down upon the bed as tweek rested on the edge nervously twitched as he stared down at his white socks and listened to Craig who flipped through pages quite annoyed by tweek's constant movement \"can you sit on the floor please?\" Craig demanded his words were met with a slight whimper and the creaks of the mahogany as tweek slowly lifted himself off of the bed and sat in the corner silently a few minutes of only being able to hear nothing but breathing the idea formed in tweek's mind \"uhh Craig ngh do you ugh think I could umm borrow your body please\" tweek practically pleaded \"mhm\" Craig absentmindedly answered unknowingly sealing his fate for that was all tweek needed to hear as he immediately was overjoyed as he entered his goo form and quickly prepared to enter Craig through his...</span></div></div>",
            "created":1484197200,
            "id":2262753,
            "title":"Craig"
        },
        "1111":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Tell the truth",
                "Lie to him",
                "Possess him again he won't remember anyway"
            ],
            "content":"<div class=\"\"><div> <span>Craig heard the floor creak and that brought him out of his thoughts as he looked expecting to be greeted by tweek however he was met with a solid blue wall \"tweek\" Craig called out but unknown to him tweek had found his prize he quickly slid up his leg and entered his ass crack Craig jumped up immediately slamming his book on the hard wood floor and began to dance around as he tried to remove the unknown slimey heat from his anus however before he could even get his pants unbuttoned he blacked out as tweek to full control of his entire body immediately he was hit with very new sensations mostly due to the increased muscle mass he unintentionally felt up his ass \"holy shit Craig's ass is huge oh man my voice it's so nasally hey I didn't even stutter thanks so much for this Craig\" tweek stated  as he massaged his large globes this elicited a small Moan from him as he made his way to Craig's bathroom and quickly moved his pants and underwear to his ankles \"fuck Craig your dick is huge too its like two of mine put together\" tweek getting very hot and heavy instantly went to work on his new dick as he began masterbating in Craig's body and started to put his fingers in his asshole stretching it giving him the best orgasm he's ever felt falling down from the orgasmic high he felt he pulled out Craig's phone and snapped some pictures then proceeded to send them to himself and delete the ones on Craig's phone he then returned to Craig's room and sat on Craig's bed \" ok i think I've had enough thanks agian Craig \" he then proceeded to exit Craig though his mouth as he left Craig's body Craig lost conciseness long enough for tweek to return to his normal form and stare at Craig expecting to be scolded but was met with a face of small concern \"umm tweek why is it so hot in here holy crap I'm really sweating?\" \"Uhh...\"</span></div></div>",
            "created":1484197200,
            "id":2262779,
            "title":"Ass"
        },
        "1113":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Tweek took a nap",
                "Tweek went outside",
                "There's an unexpected visitor"
            ],
            "content":"<div class=\"\"><div> <span>          Craig flipped through the pages absent-mindedly. He was not really invested in reading “Catcher in the Rye” but Mr.Garrison insisted that there is an adult scene in the middle. So far, he is three fourth into the book and it’s all just drama that he lost focus on. Suddenly, he heard a dripping sound. It was wet and slick and he hoped that it wasn’t the ventilation again.<br>\r\n<br>\r\n          “Tweek, could look at the vent and see if it is leaking?” Craig said in his monotonous voice. <br>\r\n<br>\r\n          Tweek did not answer but the dripping noise grew louder. Craig called again but there was no response. The dripping noise then soon turned into a huge splash. Finally, Craig closed his book and looked at his room’s vent. No sign of water. Although, when he looked at where Tweek should be, he is nowhere to be found. In his place was a viscous slime and it seems to be moving towards him.<br>\r\n<br>\r\n          “Tweek, what the fuck is this?” Craig looked around the room but he can’t find Tweek. “Tweek!?”<br>\r\n<br>\r\n          The slime groped his leg. Craig tried to pull it away but his hands seem to just pass through. He tried scooping the liquid and flicking it away. But that was useless too. The slime continued to climb Craig despite his pleas.<br>\r\n<br>\r\n          “Mom!? Craig knew that no one would answer. His mom and dad was out and his sister as well. But he continued to call them until the liquid climbed aboard his wide open mouth. Craig tried to scream once more but the liquid has engulfed his mouth completely. He was swallowing more of the liquid than air. Craig looked around the room to look for his phone. But the lack of air is making him drowzy. He fell on the floor with the whole world around him turning dark.<br>\r\n<br>\r\n----<br>\r\n<br>\r\n<br>\r\n          Tweek opened his eyes and looked around the room. It was Craig’s room like he remembered it. He looked at where the mirror should be  and the reality he will be facing. Instead of his ruffled hair and scrambled shirt, he wore a blue dangling hat and his clothes are neat. He looked at his fingers. They weren’t the fingers scarred multiple times with hot coffee. His fingers were clean and meticulously taken care of. There’s no urging call for him to twitch nor to scream. For the first time ever since he was born, he felt at peace.<br>\r\n<br>\r\n          “I really am Craig.” Tweek said in Craig’s monotonous voice. <br>\r\n<br>\r\n          He stood up from his spot and walked closer to the mirror. From the way he moved and the way he looked, he is undoubtedly Craig. Tweek traced along his face and to the bridge of his soft featured nose. Down to the clean shaven chin and the short somewhat chubby legs. He reached up to his hair and realized how his fingers could easily course through them, unlike his. Everywhere he smelled, it reminded of the Craig. <br>\r\n<br>\r\n          Tweek undressed his hat and then his coat. He realized that despite looking chubby on the outside, he is lean on the inside. Next, he undressed his remaining garments and saw Craig’s whole bare being. Craig was just like any other kid out there. He never really like Craig for how he looked. He liked him for how he acted. He was contrast to his impulsive behavior. And now that he is inside him with a comple view for what he is, Tweek realized at how much he liked him more.<br>\r\n<br>\r\n          Tweek dressed once again and delve into Craig’s bed. He hugged one pillow and took a deep whiff. The presence of Craig is every where. And he liked it. </span></div></div>",
            "created":1540361340,
            "id":2567907,
            "title":"Mouth"
        },
        "12":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go somewhere",
                "Call Someone",
                "Sleep on it",
                "Tell what happened to Tweek",
                "Tell what happened to Kyle"
            ],
            "content":"<div class=\"\"><div> <span>Ever since the yaoi girls fiasco, something brewed up inside Clyde that he hadn’t felt before. It was deep and so depressed with his stoic attitude, that he is oddly surprised to know that he is Bisexual. And ever since he grasped that truth, he couldn’t look straight at his friend’s faces. More so at Tweek who accepted him as his new boyfriend.<br>\r\n<br>\r\nFor the start of the summer vacation, Craig was absent-mindedly browsing the web for some stimulation. Looking for porn seems unappealing now that he has double the people he can fap on. He wanted to go online and see what his friends are doing. But that would make his friends know that he was online and they would start asking question for his week long staycation. And so, he was busy scrolling on some forgotten website that hasn’t updated since the 90s.<br>\r\n<br>\r\nAs he was scrolling, on ad caught his attention. It wasn’t made of 90s clip-art nor the low resolution pictures that plagued the site. This ad was new and it seemed to poke right through his problems.<br>\r\n<br>\r\n“Lost?” The ad said in bold Impact typeface. The ad perfectly summed Craig. He was intrigued and so he clicked. And as he do, something hit Craig in the head. He looked around but saw no one. The hit must be strong since he suddenly found himself losing consciousness on the floor.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nIn the expanse of darkness, Craig was floating and lost. He was naked with no clothes to shelter him from the slow breeze under him. In the darkness, there was a glint of light that caught Craig’s gaze. The light grew brighter and approached Craig. It was an orb and it was floating closer and closer. Craig tried to float away but he was too slow. The orb collided him and flashes of knowledge and power surged through his bare mind. The orb was bestowing him the power to understand other people. A power to possess their mind and body. A power to understand other people’s place in the world.<br>\r\n<br>\r\nCraig woke up in cold sweat. He looked at his fingers and saw them become translucent.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nWhat will Craig do now?</span></div></div>",
            "created":1540362720,
            "id":2567914,
            "title":"Craig"
        },
        "121":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Donovan Residence",
                "Tweak Residence",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          It was so sudden but Craig seemed to accept the change easily. Although, a walk would be nice to get his systems going. He is going to use his powers sooner or later. <br>\r\n<br>\r\n          Where will Craig go?</span></div></span></div>",
            "created":1540363080,
            "id":2567915,
            "title":"Go somewhere"
        },
        "1211":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Explain the Truth",
                "Lie",
                "Possess Clyde"
            ],
            "content":"<div class=\"\"><div> <span>A walk to Clyde’s house would be nice. It’s just by the corner so it would be a quick refreshing walk. And his dad might be on their shoe store so Clyde is alone in his house. That is, if he isn’t in  the playground with the others.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nCraig pressed the doorbell. The tone rang but there was no reply. Craig pressed it again.<br>\r\n<br>\r\n“Coming.” Clyde said. A moment later, Clyde opened the door and it looks like he just finished taking a bath. “Craig. I haven’t saw you in a very long time.”<br>\r\n<br>\r\n“I was gone for only a week.”<br>\r\n<br>\r\n“And that’s long time for me.” Clyde invited Craig inside and let him sit by the sofa. “So what brings you here? Did you bring Tweek?”<br>\r\n<br>\r\n“No. I haven’t talked to him for a week.”<br>\r\n<br>\r\n“Are you having problems? I can help.”<br>\r\n<br>\r\n“No. I just need to take my mind off things. Adjust to this new reality. I never really considered that I would like a boy.”<br>\r\n<br>\r\n“That’s sad dude. Although, you’re luckier than me.”<br>\r\n<br>\r\n“Why is that?”<br>\r\n<br>\r\n“You already had a relationship. I’ve been working out the past few weeks and I couldn’t even land a single chick.” Clyde moved closer and raised his shirt. He grabbed one of Craig’s hands and pulled it towards his belly. “Feel this? My abs are showing. A girl promised me that she would be my chick if I formed abs.”<br>\r\n<br>\r\nSuddenly, something cold hit Clyde’s stomach. He looked down and saw that the cold was coming from Craig’s hand. Craig was surprised as well. He saw that his hand passed through Clyde’s stomach. He knew what it was. He nearly possessed him.<br>\r\n<br>\r\n“Dude, what was that?” </span></div></div>",
            "created":1540363920,
            "id":2567921,
            "title":"Donovan Residence"
        },
        "12113":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go to Your Friends",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          “What was that?” Clyde asked. He looked at Craig’s hands. They look normal but they felt cold. Colder than the snow outside. <br>\r\n<br>\r\n          “Just something I found on the internet.” Craig said. There was no hesitation as he jumped towards Clyde. Like his hands, his whole passed through him. It felt like he was grabbing air. One moment he was looking at Clyde and the other, he was looking at the wall. Wide eyed and barely able to contain his frantic heart.<br>\r\n<br>\r\n          “I-” Craig croaked. His monotonous voice was gone. Instead, he had Clyde’s annoying nasal voice. “I’m Clyde.” <br>\r\n<br>\r\n          Craig stood up and went to Clyde’s room. He walked to the mirror and admired his stolen figure. He was controlling the school jock and he did not even put up a fight. Clyde undressed his school jacket and touched the abdominal muscles Clyde built over the years of playing football. He was sculpted from the bottom up, except for his face which retained its soft features. <br>\r\n<br>\r\n          Craig looked around him. There was so much to do with him inside Clyde’s body. He has fame now that he is a jock. Craig could also consider that he has a girlfriend now. He wonder what that feels like. And most importantly, he has the body of the most built man in their group. Over the past few years, he wondered the contents of his pants. Now that he is inside him, he could get the front view.</span></div></div>",
            "created":1540448940,
            "id":2568339,
            "title":"Possess Clyde"
        },
        "13":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Cartman",
                "Kyle",
                "Kenny",
                "Butters",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          It was a blur. Everything happened so fast that it’s tiring just remembering every bit of what happened. One moment, Stan and Kyle are shouting at Cartman for being a retarded ass. The other, he found himself in one of his friend’s houses.<br>\r\n<br>\r\n          Stan looked around the room. He knew this wasn’t his room but it was familiar. The faint smell of snow reminded him that he was still at South Park. Stan got out of the bed and looked at what seems to be the mirror. He was in for a surprise when he saw not his face, but the face of... </span></div></div>",
            "created":1540453140,
            "id":2568348,
            "title":"Stan"
        },
        "14":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Stan",
                "Cartman ",
                "Kenny",
                "Butters",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>\"What the fuck did you do fatass!?\" screamed a particular red head boy wearing a bright green Ushanka.<br>\r\n<br>\r\nThe boy in front of him was red-faced and breathing heavily. Their latest trip at Dr. Mephisto's lab turned into disaster.<br>\r\n<br>\r\n\"It's none of your fuck business you jew!\" Cartman's face grew redder, even redder than the hair of the boy in front of him.<br>\r\n<br>\r\n\"Aw. Fuck. I have this fucking goo in me.\" The goo, bright green and glinting in the light was indeed covering Kyle. He tried to swipe them off but to no avail, his hands only seem to pass through it. He gave up as he saw Cartman clutching a gerbil with enlarged buttocks. \"Mr. Garrison is going to get mad when he sees Lemmiwinks.\"<br>\r\n<br>\r\nThe day ebbed away and the moon rose in its midst. The boys went back to their homes, panting but blessed that they rescued Lemmiwinks from further buttocks enlargement. As they walk through the snow clad streets, Kyle was oblivious that the green goo he's desperately removing was entering every orifice in his body. It seeps into the very pores of his body and the chemicals within bonds with his blood.<br>\r\n<br>\r\nBack at his home, he went to the bathroom and prepared for the night. He spat the remains of his toothpaste and looked at himself in the mirror. \"Hm. Must have evaporated off.\" he said pertaining to the goo before.<br>\r\n<br>\r\nHis dreams that very night were clear as day. He's a slime in his dream, slithering in every crevices and nooks. Underneath him, a boy of golden hair and bright orange parka sleeps in the shadow. A feeling swells inside Kyle. Like he needs to lunge at the boy beneath and if he doesn't, he thinks that it would make him feel terrible. And so he does. <br>\r\n<br>\r\nHe jumped at the boy's face hidden beneath a thin film of clothes. He entered his mouth, his nose, every hole in his head. The blonde boy woke with a jolt. He desperately tried to remove the thing attacking his face but no matter how hard he tried, his hands just seem to pass through. He could do nothing as he suffocated at the presence invading him.<br>\r\n<br>\r\nAn alarm woke Kyle in the morning. His face reflected in the mirror, heavily distraught like someone ruffled him in the night. Nevertheless, he managed to fix himself up. Although, there's no fixing the heavy bags underneath his eyes.<br>\r\n<br>\r\nA muffled voice, distraught and scared was screaming in the corner. It was Kenny, his hands were flailing and seems to be swiping something off his face. Beside him was Stan, a concerned look hangs on his face.<br>\r\n<br>\r\n\"What are you talking about?\" asked Kyle.<br>\r\n<br>\r\n\"Oh. Kenny was just talking about a smoke or something attacking him last night. Seems farfetched to me.\"<br>\r\n<br>\r\nAt that moment, Kyle connected the dots. <i>\"Did he do that last night?\" </i>he asked himself. It's impossible. It's just a dream. Although, his distraught face in the morning and bagged eyes supports Kenny's story.<br>\r\n<br>\r\nAt the bus, he sat as far away from his friend. In the back of the school bus where no one sat until the bus neared the school. Kyle looked at his hands and focused. He doesn't know why he's looking at his hands but it feels like the right thing to do right now. In the corner of his eyes, he swear he could see the tips of his finger turn green. Wispy smoke emanates from them, dancing in accordance to his breathing. And at one moment that he blinks, his fingers were back to normal.<br>\r\n<br>\r\nThe rest of the morning period went without a hitch. Mr. Garrison talked about something in math and getting angry midway through. He can't remember why he got angry as he was focusing intently on his hands.<br>\r\n<br>\r\n\"Dude, you alright? You've been staring at your hands all morning.\" Stan asked reassuringly.<br>\r\n<br>\r\n\"Yeah. I'm alright. I just need to get to the bathroom.\"<br>\r\n<br>\r\nLooking back, whatever was that thing on Dr. Memphisto's lab turned him this way. He's probably turning into the very goo that changed him. He needs to go to Dr. Memphisto's lab and ask for a fix for whatever is happening to him. Although what they did last night, his chances are close to zero. <br>\r\n<br>\r\nKyle could do nothing but lock himself at the bathroom. His hands on closer watch are colored green now and they are sweating green viscous slime. He went for the sink to rinse off the goo but as he lurched forward, his feet along with his shoes turned to slime. His other feet too turned and from the looks of it, his whole body is changing to goo. A good second later, Kyle turned completely to goo.<br>\r\n<br>\r\nHis perspective of the world changed. He could see all around him including underneath himself. He tried to move forward and his whole body moved swiftly in accordance. He could feel himself as being warm like and throbbing. His surface glinted the light above and sparkled onto different shades of green.<br>\r\n<br>\r\nThe door behind Kyle creaked open, welcoming another person. He slid to the nearest stall and viewed the person. Who was it? </span></div></div>",
            "created":1513918800,
            "id":2431252,
            "title":"Kyle"
        },
        "141":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Confide with Kenny",
                "Keep it a secret"
            ],
            "content":"<div class=\"\"><div> <span>          \"Dude?\" Stan Marsh asked. His best friend was acting strange all day and it's been bugging him out. He looked pale when Kenny was talking about the ridiculous thing that happened to him last night. He did not sit beside him at the bus. He was mostly quiet all morning, only answering questions in the most succinct way. And most strange of all, he was looking too much at his hands. Stan could admit that Kyle's hands did indeed look strange. One moment he saw that it was smoking. Another second then it's not. Stan could blame that to his sleeplessness last night.<br>\r\n<br>\r\n          Stan pushed aside the bathroom door and surprisingly, Kyle wasn't here. He could swear that he saw him entering here. \"Kyle, you in here dude?\" He asked once again. Maybe, he's in one of the stalls. But come to think of it, there's no feet on the ground. Just that shining green thing in the second stall.<br>\r\n<br>\r\n          Stan moved towards the stall and opened it. One moment he was perplexed the other he was reaching for air. The thing, whatever it is, lunged at him. It jumped so fast that all he could see was a streak of green and the world around him tinted with it. He tried to grab the thing, it felt slimy and viscous. Strangely, his hands only seem to pass through it. Stan looked around and strode for the sink. He opened the tap and washed himself with water. The water however, stopped sat the surface and to the ground. He tried once more but the attempt was all the same. He sat down, trying to breath a sliver of air. But the thing was blocking down his mouth and nose and seems to be invading him.<br>\r\n<br>\r\n          As the last bits of consciousness flicked at him, he could hear Kenny inaudible whisper-shouting.<br>\r\n<br>\r\n----<br>\r\n<br>\r\n          \"Where's the serum Mephesto?\" A hooded mam growled. His crimson robes obscured his face but never hiding the hastened shave of a stubble.<br>\r\n<br>\r\n          \"It's gone,\" A round man said. His face looks trodden a heavy dread surrounds him. \"along with my lab, it's all gone.\"<br>\r\n<br>\r\n          \"What do you mean gone?\" The hooded man was audibly irritated. His feet shuffled in the ground kicking lightly the destroyed rubble.<br>\r\n<br>\r\n          \"The container holding it shattered. Broke. It must have evaporated off the ground.\"<br>\r\n<br>\r\n          \"The formula we gave you is distinctly clear. It can't have evaporated on the ground.\" The man flailed his hands on the ground before nudging his fingers on the bridge of his nose. \"It'll be another three years before we could make another drop. And I've waited enough. Make something that could detect the person who ingested the serum. And make it quick.\"<br>\r\n<br>\r\n          The man straightened his hood and look briefly at the defeated man at the rubble. \"I know a man who could fix this place back. Just remember our deal or you'll suffer the consequences.\"<br>\r\n<br>\r\n          \"All right. All right. Just leave me with my babies.\" And by babies, he meant the cat corpses with multiple buttocks littering the field.<br>\r\n<br>\r\n----<br>\r\n<br>\r\n          Kyle's wake up call wasn't something to look forward to. His face was splashed with cold water and in the ensuing shock, he hit his head on the sink. His hands was quick to address the droning pain. In a moment's realization, if he could feel pain, he must have turned back to his solid body again. Above him, he closed the tap and helped himself up.<br>\r\n<br>\r\n          He could not describe what he felt for the next few moments. He call it confusion and disbelief. A moment later, he decided on the latter. What stood in front of him was a mirror and inside that mirror was bright as day, Stan Marsh. His face wet and cheeks flustered in signature icy pink. His hands still stamped to where he his head hit the sink was mimed by the image in the mirror. He could not believe what he was seeing, he was Stan Marsh.<br>\r\n<br>\r\n          Back again at the stall, he sat at the toilet rim and looked at his hands. Sure enough they weren't releasing smoke or glinting in the light. His hands rather were as white as milk, free from blotches that ravaged his previous fingers. <br>\r\n<br>\r\n          \"I'm not crazy.\" Kyle said expecting his old voice. What came out was Stan's slightly nasal tune. He tried to repeat the words, praying to change back. Every time, Stan's voice welcomed him, telling him he's not crazy.<br>\r\n<br>\r\n          Kyle recollected what he was doing before he's inside his best friend. He remembers turning to goo and hiding in one of the stalls. He remembers hearing the door creak and Stan searching for him. A feeling grew inside Kyle, insidious like those in his dreams. Or where they even dreams at all? Nevertheless, it grew like it grew quickly. A searing voice screamed inside his head to possess. To take over as quickly as he can. Before he knew it, he was lunging at his friend. He filled every crevices possible. The next, he was satisfied and all was blank.<br>\r\n<br>\r\n          A bell rang in the distance, signifying the start of lunch. Kyle missed most of third period and in a way, Stan did too. He left the bathroom and searched for his friends. Sure enough, they were at their usual place. Kyle look around and saw that a few people were missing. Jimmy and Timmy are gone. They are doing their Science Bee and won't return until three days later at Monday. Cartman suddenly vanished. He was at the bus station this morning and at first period. Other than that, the others where talking and Kenny mimicking what happened to Stan seconds prior.<br>\r\n<br>\r\n          \"It was drowning me.\" Kenny said, his voice muffled by a layer of Parka. Kenny turned at Kyle and patted a seat beside him. \"Oh hi Stan. Where's Kyle?\"<br>\r\n<br>\r\n          \"Home. He was sick.\" Kyle quickly muttered. If he talk fast enough, they would notice the stutter.<br>\r\n<br>\r\n          \"Gee golly, Cartman was sick too.\" Butters butted in.<br>\r\n<br>\r\n          As quickly as it began, the conversation divulged towards the latest Terrence and Phillip movie. For the first time, Kyle forgot that he was inside the body of his best friend. He kept talking, boasting and laughed with them. The fun ended when the bell rang once again. Students cleared off their tables and run off to the next class. <br>\r\n<br>\r\n          On the way, Kyle's worries resurfaced. He needs someone to talk to, someone that can help him cope with this dilemma. Chef, if he were here could help him greatly. Come to think of it, Chef solved a problem just like this one. Back when Kenny died and his ashes snorted by the assface Cartman. Kenny was inside the fatso for a week. Maybe he could confide this thing to Kenny. Or maybe not. </span></div></div>",
            "created":1514005200,
            "id":2431756,
            "title":"Stan"
        },
        "1411":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "\"Of course dude.\"",
                "\"No. I respect Stan's privacy.\" "
            ],
            "content":"<div class=\"\"><div> <span>          \"Kenny\" Kyle reached out. Only that the hands doing the reaching weren't his own but that if his best friend. \"I need to tell you something.\"<br>\r\n<br>\r\n          \"What?\" Kenny muttered in covered tones.<br>\r\n<br>\r\n          \"Let's move somewhere no once can hear us.\" And by that, they walked towards the right part of the school. The students dwindled as they neared their destination until the only students are the goth kids sitting in their place. They placed themselves far away from the group's prying eyes.<br>\r\n<br>\r\n          \"I'm the goo you saw last night.\" Kyle said quietly but loud enough for Kenny to hear. Beneath the worn down parka, Kyle could see confusion. Kenny did not make a single sound, not even to ask if he's crazy. \"Also, I'm not Stan. I'm Kyle. I am sort of controlling Stan's body.\" Like before Kenny was speechless. For a full ten second at least.<br>\r\n<br>\r\n          \"Cool.\"<br>\r\n<br>\r\n\"You don't think I'm crazy?\"<br>\r\n<br>\r\n          \"Of course not dude. I took over that fatass' body last summer.\" Kenny sat down on the snowed steps. \"Remember when he drank my ashes.\"<br>\r\n<br>\r\n          \"Yeah.\" Kyle sat down too. \"Anyway, I wanted to ask you how could I return back to normal. This whole thing being Stan is freaking me out.\"<br>\r\n<br>\r\n          \"If I were I would enjoy it dude. You could be anyone you want. You could be a girl or a better guy. You could be an adult and do adult stuff.\" Kenny seemed to be enjoying Kyle's predicament more than he does. Although, Kenny could have a sliver of truth. Why does he want to go back to his old body? Back there, he suffers from his nagging mother and he's always teased as a Jew. Back slat the cafeteria where he was talking to his friends, no one teased him as Stan. Maybe, he could borrow him for a few more hours.<br>\r\n<br>\r\n          \"I think you're right. Anyway, do you know how I could get out of Stan?\" If Kenny was right, he could take over other bodies other than Stan. Who though? The possibilities are many.<br>\r\n<br>\r\n          \"I'll come by your house this evening. 8 mean, Stan's house. Tell your mom and Stan's that we're having a sleepover.\" Kyle agreed. It's the weekend tomorrow and a holiday for two days. So that should be four days of no classes. Enough time to sort this thing out. The only problem is Kyle's mother. She tends to freak out on the slightest of things. So basically, his chances of a sudden sleepover is zero. <br>\r\n<br>\r\n---<br>\r\n<br>\r\n          It was a miracle. Kyle plastered a wide grin on Stan's face for the rest of the day. He texted her mother and she definitely agreed. Apparently, his father and Ike was called suddenly at the Canadian embassy. Something about mismanaged parcel or something. That freaked out her mother than the unplanned sleepover. She would be riding her way now. <br>\r\n<br>\r\n          \"Oh hi Kenny.\" Sharon said. It did not take her a lot to fool her into thinking that Kyle was Stan. His father, Randy Marsh, was too busy doing something in the shed. \"Do you want some cinnamon bun Kenny?\" <br>\r\n<br>\r\n          \"Thank you.\" Kenny is visibly famished. He helped himself with two buns and a cup of water before running up to Stan's room. The room, like he last visited is much like his own. The bed and the cabinet full if paraphernalia of their previous adventures. <br>\r\n<br>\r\n          \"So where do we start?\" Kyle asked. <br>\r\n<br>\r\n          \"Focus about getting out. Then that's just it.\" Kenny could have said that before. Nevertheless, Kyle's need to rid himself of Stan's body overcame his urge to complain. Kyle closed his eyes and breathed in rhythm with his heart. He could feel it. The wriggling of the thing inside him. It filled every part of him. He focused on detaching all of them, starting from his feet. On a moment's notice, he lost the touch of the cold carpet. His feet wobbled and soon he was crashing to the floor. Kyle lost his focus and the rough carpet caressed his toes once more. <br>\r\n<br>\r\n          \"You crashed.\" Kenny said. <br>\r\n<br>\r\n          \"I know.\"<br>\r\n<br>\r\n          Kyle spent the rest of the day doing the same thing again and again. Only ping as far as losing the sense of his upper legs. He took only one break and that is the ham dinner he took with Stan's family. Randy was back from the shed covered in a mixture of grease oil and sweat. Sharon berated him about his sweat and shaming the family to Kenny. He retorted that Kenny is used to the smell since his family lives with hobos. Thus resulted in more silent-shouting and Stan's sister, Kelly, screaming that no one notices her anymore. He blames Stan for everything of course. Once dinner was over, Kyle and Kenny sped back to Stan's room. <br>\r\n<br>\r\n          Kyle's heavy stomach reduced his ability to focus. He ate too much and he thinks Kenny did so too. They jumped on the bed, eyes to the cold and blank ceiling. <br>\r\n<br>\r\n          \"Aren't you curious?\" Kenny said, breaking the minute of silence. <br>\r\n<br>\r\n          \"About what?\"<br>\r\n<br>\r\n          \"About Stan's dick. You have it and you haven't seen it yet.\" This apparently surprised Kyle. The thought haven't crossed his mind and probably never will without Kenny. He never took a bathroom break once and have never changed his clothes yet. Thinking of what it looks like just tickles his curiosity more.<br>\r\n<br>\r\n          \"Why would I want to see it?\"<br>\r\n<br>\r\n          \"It's just I'm curious you know. When I'm in Cartman's body, I can't see his dick with his belly in the way. Aren't you curious too?\" <br>\r\n<br>\r\n          This talk about dicks is making him uneasy. At the same time, he could swear that his sensation in his private area heightened by the thousand. He could feel it shuffle towards the left, the throbbing and its rising. <br>\r\n<br>\r\n          \"Look you have a hard on.\" Kenny was right. A tent is forming in his pants and us getting more profound by the second. <br>\r\n<br>\r\n          \"For fucks sake, I'm not gay.\" Kyle retorted. He's not gay nevertheless, Stan's dick thinks farther than his mind. <br>\r\n<br>\r\n          \"What's that supposed to do with being gay? You're inside Stan's body, you have as much right to jack off.\"<br>\r\n<br>\r\n          \"Jack off!?\" That very thought is out of bounds. But why is he setting this boundaries though? The tent is visibly bigger now and it's starting to hurt. \"Jack off.\" Kyle said once again, this time more slowly. <br>\r\n<br>\r\n          \"I could help you.\" Kenny is full of surprises today. \"By the way, I'm Bi so don't worry.\" Everyone knows his Bisexual. He never lost that liking to both male and female after the Metrosexual conundrum that plagued the town's men. His father, Stuart, screamed for days. <br>\r\n<br>\r\n          Kyle's cheek flustered. Could he really do this to his best friend's body? It's really painful now and the only thing that could cure it is jacking off. At the back of his mind, he could remember that jacking off focuses the mind. Surely this is helpful to his cause right? <br>\r\n<br>\r\n          In one fine sweep, he unbuckled his pants and drawn his white briefs. It sprang as a lion, as hard as rock, and beating to the rhythm. Stan's dick, as usual for pre-pubescent males, isn't like those of the male porn stars they watched. Sure it was white, but it wasn't quite as long and thick. Kyle hand touched it. The warmth dispelled the cold forming in his fingers. He touched it with the other hand and it did the same.<br>\r\n<br>\r\n          In a sudden shift of tone, Kenny acted as the voice of reason. \"Are you ready to do this dude?\"<br>\r\n<br>\r\n<font class=\"size1\" style=\"\">(A/N : This mentions South Park episodes \"South Parks is Gay\" and \"A Ladder to Heaven\") </font></span></div></div>",
            "created":1514178000,
            "id":2432302,
            "title":"The Unexpected Dilemma"
        },
        "14111":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Resist the urge and stay in Stan's Body",
                "Go with the flow and go into Kenny's Body"
            ],
            "content":"<div class=\"\"><div> <span>          \"O- of course.\" Kyle muttered. Above him, Kenny stood stood smiling. From his looks, he was looking forward for this chance. Kenny hand's found his parka zipper's and undressed. This was one of those rare occasions where Kyle could see his face without hurdle. Kenny was easily cold but the warmth they share tonight sufficed. His face flushed red, his eyes flustered as he cleared his eyes from his drooping sunlight hear. He was puffing, eyes intent on Kyle. Like a predator ready to jump at prey.<br>\r\n<br>\r\n          He moved swiftly downwards. His head face to face with his dick. He gaped at it, inspecting the splendor glory of his package. As quick as lightning, his tongue poked the tip. As quick as lightning, shivers rained down on Kyle. Once in his life has he never forseen this thing from happening. Kenny swallowed his tip whole, his tongue circling around. With  ministrations, he bobbed his head up and down. Kyle shuddered as he clutched the fabric of his bed. Kyle never imagined it but Kenny swallowed dipper. His tip could touch the back of his throat. It slid up and down, wet and wetter as it rummaged inside his mouth. A blast of Euphoria sent Kyle silent-moaning as his load shot through Kenny throat. It was the best load he ever released and probably the first of the many to come. <br>\r\n<br>\r\n          He opens his eyes once again and found only darkness. Every sense, the fleeting happiness gone. He was being purged out of Stan's body and into another. In a moment's notice, he was presented with a choice. </span></div></div>",
            "created":1514450100,
            "id":2433494,
            "title":"The Best Unexpected Blowjob"
        },
        "145":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Another Student",
                "A School Staff",
                "A Parent"
            ],
            "content":"<div class=\"\"><div> <span>Kyle ducked under the first stall he could find. The tiled floor below him was cold and wet. The puddles of water between tiles gave way as he slithered through.<br>\r\n<br>\r\nEven if he could see everywhere now, Kyle focused on the person entering the bathroom. Because this is the male's bathroom, the person who entered must be a male. Two feet strode towards the sink and washed it face. Kyle slid carefully underneath the stall and peeked who it was. Undoubtedly, it was... </span></div></div>",
            "created":1514005200,
            "id":2431748,
            "title":"Others"
        },
        "15":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Kenny",
                "Cartman",
                "Token",
                "Clyde",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who should it be then?</span></div></span></div>",
            "created":1484197200,
            "id":2262782,
            "title":"Someone else"
        },
        "151":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go to Stan's room",
                "Tell his friends",
                "Keep what happened a secret and go back to his friends"
            ],
            "content":"<div class=\"\"><div> <span>          The night blew and howled. Winds sliced through the broken window glass that of a run down house surrounded by run down mall stalls. The once bustling center, SoDoSoPa, lies barren but for a dot of hobos and the McCormick residence.<br>\r\n<br>\r\n          A crack flashed and Kenny woke with a start. Something exploded. It's not uncommon to hear explosions here, with a meth lab nearby. But the explosion came somewhere over his room. From his recent memory, he did not buy explosives. Not for another week at least.<br>\r\n<br>\r\n          Kenny faced where the cracks of explosion originated. He was surprised to see a frantic person in it. The persons face is bearded and squashed into a horrid caricature. Its feet is naked, hairy and filled with long dirty toenails. The being wore a supple brown tunic and a belt that clanged as he walked towards Kenny.<br>\r\n<br>\r\n          \"I don't have fucking time!\" It screamed. He reached towards his belt pocket and reached out the hand of Kenny. \"Hide this. Anywhere. It's two so hide them away. Not at the same place. I'll reward you once I get back alive.\" With that, the being left with a crack. Surprisingly, no one seemed to heard it as his parents are still soundly sleeping.<br>\r\n<br>\r\n          Kenny opened his palms. Except for the of dirt that thing left, a spherical stone sits comfortably in his hands. A visible crease divides the sphere into two. Kenny separates that two but as the two parts got closer, it rushed and stuck together like magnet. He pocketed the curious thing and slept once again. The thought of hiding this thing was lost beneath his dreams of a better house.<br>\r\n<br>\r\n----<br>\r\n<br>\r\n          \"Fuck. That was the best.\" Stan expressed. He just scored a new high score in Guitar Hero. Beside him, Kenny is holding a plastic guitar, visibly tired and joyful as Stan. Behind them, Kyle was watching astonished. Cartman however, was busy texting and eating Cheese Puffs. <br>\r\n<br>\r\n\"I think I'm going to go to the kitchen for some drinks.\" Stan expired. <br>\r\n<br>\r\n          \"Me too.\" Kenny muttered underneath is parka. His voice may seem inaudible for many, not for Stan, Kyle and Cartman. <br>\r\n<br>\r\n          The Marsh Residence has been Kenny's second home these past few years. Well, he could also consider Kyle's house a home too if not only for her bitchy mother. The hang out here every Saturday, mainly to play Guitar Hero or cause ruckus in the internet. Other time, to chill and relax or copy Butter's assignment.<br>\r\n<br>\r\n          \"Here's some water.\" Stan reached a pristine cup. Kenny reached out but as he do, he saw his hands phasing through the very fingers of Stan. This caused Stan to shudder and drop the cup on the floor. Luckily, the cup was plastic so it did not shatter. <br>\r\n<br>\r\n\"Did you just electrocute me?\" Stan asked, a shocked feeling on his face. <br>\r\n<br>\r\n          \"No dude.\" Stan felt it too so it must be real. His hands passed through his and caused him to reel back. Kenny thought about it for a minute while Stan soon forgot and reached for an absorbent rag.<br>\r\n<br>\r\n          Whatever the thing that happened, it caused Kenny some great shock. On the other hand, he would be willing to do it again. And so he did. While Stan was kneeling on the floor and wiping the wet floor, he reached his right for his nape. Stan shuddered at the sudden invasion. His body shriveled up and was paralyzed on the spot. He wanted to scream, to ask the nearby Kenny for help but his mouth won't budge. <br>\r\n<br>\r\n          Kenny reached further. What he thought was true, his hand did phase through Stan just like what is happening now. His hand is now inch deep on his nape. It feels like he is dipping his fingers on molten marshmallow, only that this marshmallow is more than welcome. His hands are now deep to his elbow and Stan is still paralyzed under him. Kenny now placed his other hand at the nape while pushing his other towards Stan's right. What he is doing right now is akin to wearing a suit. He continued more until both his arms are full inside Stan. He could feel the water trickling between his finger, the cold hard feeling of the floor and the receding shock of fear. Next, Kenny pushed his Torso. Every bit of Stan's flesh welcomed him to an embrace. He sunk warmly and until no visible part of his old body is present. The only thing left now is his head and the full penetration is complete. His borrowed hands found its was to his Stan's Head which is frozen in shock and pushed it towards him. Stan's hair drowned him on a mixture of sweat and Orange Scented Shampoo. He always liked Stan's shampoo. And beneath the hair, he found the abyss welcoming him to Stan's mind. The place is dark yet dappled with the thousand twinkling stars. And one of the stars, as bright as the sun swallowed him, welcoming back to the wet floor Stan was cleaning before.<br>\r\n<br>\r\n<pre></pre>\"Fuck.\" Kenny said. However, Stan's voice said what he said. \"The fuck am I going to do now?\" The lack of parka muffling his voice slightly irks Kenny. </span></div></div>",
            "created":1514005200,
            "id":2431822,
            "title":"Kenny"
        },
        "152":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Possess someone one of his friends",
                "Possess a rich guy, other than token of course",
                "Enter the house as himself "
            ],
            "content":"<div class=\"\"><div> <span>          \"Hahaha. Fuck you.\" In a barren mall parking lot, a particular fat ass took the liberty on torturing a poor old woman. The reason? He's cynical and he does this for fun. Cartman kicked the woman sending her hurtling to a parking spot.<br>\r\n<br>\r\n          \"Young man why-\" Before she could stand, he kicked her to the ground once more.<br>\r\n<br>\r\n          \"Because you're a gypsy. Hahaha.\"<br>\r\n<br>\r\n          \"If you don't stop I will curse you. Ooof!\" That kick knocked the air out of the woman. She was clutching to her stuff, careful not to let it go. Nevertheless, another kick loosened her grip and sent her remaining stuff on the ground. She immediately, grabbed all that she could see while enduring another kick on her frail leg. <br>\r\n<br>\r\n          As she was reaching the last of her fallen things, the fat young man in front of her grabbed a ring. A heirloom passed through the ages, locked with magic and used before to create mass chaos. Her family was tasked to protect it. She is the last of her line so she must save it at all cost. \"Please. Anything but that ring. I'll give anything, please.\"<br>\r\n<br>\r\n          The boy looked straight into her eye. She could see it. The glitter of compassion and regret. His mouth pursed as if he want to say something. Sorry perhaps. She was proven wrong as another kick sent her hurtling down pavement. He heard a distant laugh ended with him rejoicing <i>\"I kicked a Gypsy\" </i>repeatedly. She regained composure a second later but only to see that the young man is gone. She awaits punishment for the shame she brought into her family. <br>\r\n<br>\r\n---<br>\r\n<br>\r\n          Cartman was walking a snow clad sidewalk, casually glancing at the passers-by. He was kicked out of the group, again. He only teased Kyle for being a Jew, Kenny for being poor and Stan for losing repeatedly in Guitar Hero. Its just fun really. But they were all cissy about it and fuck them. They kicked him out. So he went to the mall to buy food. Until this Gypsy looked at her straight in the eye. Let's just say she regretted doing that. And now, he's back towards Stan's house. He was hoping that they would let him back again. Without him, they wouldn't get that high score.<br>\r\n<br>\r\n          As he walked, the world around him changed to a hue of green. The reflections glinted gold. And things seemed to slow down and stopped to a halt. Cartman was oblivious, until a wispy green smoke appeared right in front of him.<br>\r\n<br>\r\n          \"I'm the master of the ring.\" A deep voice bellowed. Every word of the being rang with the world.<br>\r\n<br>\r\n          \"The what?\" Cartman wasn't really listening the first time.<br>\r\n<br>\r\n          \"I'm the master of the ring you are currently holding. And I'm here to give you the power it contains.\"<br>\r\n<br>\r\n          \"Yeah, sweet.\" Cartman said unenthusiastically.<br>\r\n<br>\r\n          \"Yeah, sweet. That's just it? No jumping in glee or fainting?\"<br>\r\n<br>\r\n          \"Yeah. So what powers are you going to give me? Wait. Are you a pedophile?\"<br>\r\n<br>\r\n          \"What!? No!\" The being wasn't impressed with where the conversation is going. First he was unengaged with his presence and now, he's accusing him for a child fiddler? Outrageous. People he gave powers back in the old days used to faint in his mere presence. He shrugged his discomfort and moved on to his job. \"I'm the spirit of chaos and I'm here to give you my powers.\"<br>\r\n<br>\r\n          \"Get on with it. You said that already.\" This stupid brat is getting in his non-existent nerves.<br>\r\n<br>\r\n          \"I'll give you the powers of possession. You turn into a cloud of smoke. Then enter a person and then you're that person.\" The being moved floated towards a frozen passerby and did what he said. His fog like body entered every orifice the jogger have. Only when the being is gone when the pedestrian's eyes glinted green and back to dark hazel. He moved towards Cartman and did some serious backflips and managed to show her pussy. \"To exit, just think about it and you'll be back to mist form. To turn back into your body-\"<br>\r\n<br>\r\n          \"I just think about it. Yeah.\" Cartman piped in.<br>\r\n<br>\r\n          The being left the female pedestrian's body and slowly flitted towards the ring.<br>\r\n<br>\r\n          \"Wait.\" The being stopped. \"Does it have a catch?\"<br>\r\n<br>\r\n          \"No. You're already doing my bidding by possessing people. Just do it every few days, I've been starved from chaos for a thousand years.\"<br>\r\n<br>\r\n          \"Sweet.\" <br>\r\n---<br>\r\n<br>\r\n          Several thoughts crossed Cartman's mind and all of them surrounding the ring. He could be anyone and anywhere. First thing he thought was possess a filthy rich person and eat all the food he can buy. But the only rich people around is Token's family. And that's a serious no for him. He doesn't want to become the very race he made fun for years. Maybe, he should start small first. Get a hang with his new found powers. And in that thought, Kyle crossed him mind. The filthy Jew and his gingerly cute face.<br>\r\n<br>\r\n          He's in front of Stan's house now. The distant strums of guitar signifies that they are still playing. He flinched when he heard Kyle scream out of joy. The pathway to his new ability crossed once more. What could he do?<br>\r\n<br>\r\n<font class=\"size1\" style=\"\">(A/N: Sorry for the racism. I'd like to write Cartman like what he is in the show.) </font></span></div></div>",
            "created":1514178000,
            "id":2432464,
            "title":"Cartman's Gypsy Danger"
        },
        "1521":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Choose his three friends below",
                "Choose Clyde's Gang",
                "Choose his other friends"
            ],
            "content":"<div class=\"\"><div> <span>          Cartman walked behind Stan's house where no one can see him. Behind the bushes, he took one final look at the ring in his hand and closed his eyes. Only the soft rustle of the leaves and the whispering wind are within him. He focused like he never did before. He focuses much more than when he is picking food from the menu.<br>\r\n<br>\r\n          Cartman suddenly felt lighter. His weight was gone, replaced with the flying feeling of freedom. He could feel his sense of touch recede. He felt neither cold nor warm, nor does he feel the wind pass right through him. He opened his eyes and saw the world around become black and white. Mist, which he assumes as a part of him, pass through his eyes every now and then.<br>\r\n<br>\r\n          Cartman found the ability that he could fly now. He glided upwards and rises higher than Stan's house. He was rising beyond the chimneys and beyond the highest towers of the town. If he were solid, the gnashing winds up here might have blown him away despite his weight. Below him, the town in its small splendor is in his mercy. If whatever that pedophile said is to believed, everyone's body is for Cartman's choosing. Especially his friends. Oh how they teased for being fat. He knows they are right but accepting that truth is worse than constantly telling them he's big boned. He could have his revenge right now, but where to start?<br>\r\n<br>\r\n          Down below, Stan, Kyle and Kenny is playing guitar hero. The three of them having fun without him. Out of his friends, they teased him the most. Beyond that, his other friends are in their respective houses. Although, from this height, he could see Craig and his gang playing on the park.</span></div></div>",
            "created":1514264400,
            "id":2432988,
            "title":"Possess one of his friends"
        },
        "15211":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Kyle",
                "Stan or Kenny "
            ],
            "content":"<div class=\"\"><div> <span>          He glided down and through the only open window which is in Stan's bedroom. The room was littered with toys. He never lingered long as he made his downstairs. His three friends were silent now. They are too busy and focused on the game to even notice the sick combo they are making. Cartman waited for the perfect time to strike. A minute later, they made a new high score. They rejoiced of course, although this made Cartman angrier. Kenny excused himself to the kitchen so that the could drink a glass of water. Kyle however, is going to go upstairs to relieve himself of the pee he's been stocking since they played the Guitar Hero Level. Stan was left choosing their next song.<br>\r\n<br>\r\n          Cartman at once was left in another choice. He could only possess one but who? <br>\r\n</span></div></div>",
            "created":1514264400,
            "id":2432989,
            "title":"Choose one of his three friends below"
        },
        "152111":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Masturbate",
                "Have a change of heart and dress back"
            ],
            "content":"<div class=\"\"><div> <span>          Cartman wafted quickly upstairs and dashed to the bathroom. He moved with incredible speed that he risked himself hitting the walls. Even if he did, it wouldn't hurt. He was intangible and things passed right through him.<br>\r\n<br>\r\n          He hid underneath behind the toilet and waited patiently for his prey. Kyle Broflovski, the Jew. The source of his pleasure and his deepest regret. He like Kyle to be honest. His ego is just too huge to present his true feelings. Every day, he always teases him for being Jewish. Every night, he regretted teasing him and wished it could have gone another way.<br>\r\n<br>\r\n          The door creaked and there he is in his utmost cuteness. The Jewish boy is washed white with flushed rosy cheeks from the cold. His hair, blocked by the pesky Ushanka, is as red as rose. As red as his shirt that he bought after the day he met him. Kyle strode to the toilet and hung his package. It was small, he was still a kid after all. He looked above and relieved himself of the strain. Cartman on the other hand, did his first move. <br>\r\n<br>\r\n          Cartman revealed himself but Kyle was too busy looking at the ceiling to notice. Cartman moved with grace, nothing like his old body. Kyle noticed that his vision was getting grayer. He cleared his eyes but it did not fix his vision. A moment later and he realized the mist forming around him. It was suffocating him. He tried to breath but the more he does, the more he sucks the mist surrounding him.<br>\r\n<br>\r\n          Cartman could feel himself being invited into this new host. The entirety was jolting. Every part of him is being absorbed into the very cells of Kyle. He could feel his despair right now and the last breeze of him successfully entered his nose. That despaired climaxed before ending in black out silence. <br>\r\n<br>\r\n          Cartman woke with a pounding headache. The world around him danced. He blinked once more and saw the world as vivid as before. He helped himself upwards and saw Kyle in the mirror. The way he reflection rised mimicked him. It was real and it was done. He was Kyle Broflovski, and this is the closest he could be. <br>\r\n<br>\r\n          He moved closer to the mirror. He inspected the features in his face he haven't seen before. Cartman never knew that he has a small scar on his lower lip. Or that he has a barely noticed a light brown birthmark in his neck. One great thing now is that he is thin. No one's going to tease him for being fat anymore.<br>\r\n<br>\r\n          \"I'm Kyle.\" Cartman said, with caress in his voice. He enjoyed that he is now using his voice and he could make him say anything. \"I want to suck Cartman's balls.\" He snorted.<br>\r\n<br>\r\n          He fixed himself up, zipped his bare wiener and went downstairs to see Stan and Kenny already playing. He sat in the sofa and helped himself to the Cheese Puffs in the coffee table.<br>\r\n<br>\r\n          \"What the fuck dude!? You ate all the Cheese Puffs.\" Stan said as he finished checking his scores. It was exceptionally high but not high enough for a new high score.<br>\r\n<br>\r\n          \"So what?\" Cartman said as he licked the cheese powder in his fingers. \"It was good and you aren't eating.\"<br>\r\n<br>\r\n          \"You're just like Cartman.\" Stan shot back. Kenny agreed with him. \"Anyway, it's you and Kenny's turn.\" Cartman grabbed the plastic guitar offered to him and found it surprisingly fit for his thin body.<br>\r\n<br>\r\n          The song started with a fistful of notes. Kenny found it surprisingly easy to hit all of them while Cartman is finding it hard to move his finger with dexterity. He was used to his fat thick fingers where he doesn't need to move his finger as often. Beside him, Stan looked worried at his progress and managed to purse his lips in discontent. The song ended with a final bang of a note in which Cartman failed to hit.<br>\r\n<br>\r\n          \"Wow.\" Stan said in disbelief. \"You suddenly became bad at this.\" Kenny agreed behind him. Cartman ignored his words and sat back down in the sofa. Stan's disbelief never lingered long as they went for another song.<br>\r\n<br>\r\n          The day ended with him getting goodbyes from Stan. As they broke of in an intersection, Kenny said his goodbyes too. The sky is starting to change in an orange pigment. Birds migrated away from the town. They could sense the upcoming winter and the cold winds behind it.<br>\r\n<br>\r\n          Cartman walked back to his house and knocked on the front door. He was greeted by her only mother pasted confused face. <br>\r\n<br>\r\n          \"Oh hello Kyle.\" She said in an affectionate voice. \"Have you seen Cartman anywhere? My sweet didykuns isn't answering his phone.\"<br>\r\n<br>\r\n          \"I know mo- Mrs. Cartman. My cool and handsome friend Eric is sleeping at my house tonight. I came here to tell you.\"<br>\r\n<br>\r\n          \"Oh.\" She looked worried for a second before creasing yet another smile at Kyle. \"Tell him be careful alright.\"<br>\r\n<br>\r\n          \"Goodbye Mrs. Cartman.\"<br>\r\n<br>\r\n          \"Goodbye dear.\" With that, she closed the door softly.<br>\r\n<br>\r\n          Cartman walked back home, to Kyle's home this time. He need to remind himself that he is Kyle and not Eric. He doesn't need anyone finding about this ability of his. They could steal his ring steal his powers. Fuck them if they do that.<br>\r\n<br>\r\n          Once home, he was greeted by her mother who is now red-faced on the door. She pierces Cartman with a blinding gaze. Cartman blocked that with his ego.<br>\r\n<br>\r\n          \"Where have you been!? You told me you'll be back at five. And it's five thirty!\" As irrational as it could be, she screamed. And focused back on the unflinching Cartman.<br>\r\n<br>\r\n          \"Don't be such a cocksucker mom.\" Shiela Broflovski stood on the door, mouth hanged-open, unbelieved on what his son just said.<br>\r\n<br>\r\n          \"What did you say to me! What do you say arghahdjbf!\"<br>\r\n<br>\r\n          \"Cocksucker. I said you are a cocksucker mom. You suck cock.\"<br>\r\n<br>\r\n          It seems that answering her question led Cartman to a three week grounding in his room. He isn't Butters to be grounded like this. Underneath the room, he could hear his father, Gerald, and his mother, Shiela, bicker loudly. His father probably took his side and justified Cartman's action. Beyond the door Kyle's canadian adoptive-0brother, Ike, was trying to go into his room but finds it locked. He gave up somewhere in the 20th or 30th try, Cartman lost count. On the bright side, this gives Cartman the privacy to look and observe, not only his room but to himself. <br>\r\n<br>\r\n---<br>\r\n<br>\r\n          A wash of cold translucent winds ran through the field. Everything is white with snow. The sky, as black as soot, is dappled with white crystals adjoining their brethren on the ground. <br>\r\n<br>\r\n          \"You have failed Arabella. Your family failed and you know the consequences.\" A hooded man deeply bellowed. Underneath him, an old Gypsy lies cold and quivering, more to fear than to cold. <br>\r\n<br>\r\n          \"I'm sorry.\" The Gypsy squeaked. \"I can get it back. Just give me another chance.\"<br>\r\n<br>\r\n          \"Your great great uncle lost the ring and called for another chance. That was the last one.\" A mist appeared out of the man's sleeves and a flash later, it turned solid and changed to a orb. In one bright flash, the scenery was whiter than the whitest snows. The light died down instantaneously, leaving only prints on the white bright snow. <br>\r\n<br>\r\n---<br>\r\n<br>\r\n          The next day was spent admiring Kyle's body. Cartman finds it that having a nice thin body wasn't bad at all. This is easier than exercising and dieting. Beside his weight, he also lost his slang protruded by his thick fatty neck. He could say \"Cool\" without sounding like \"Kewl\". He finds this nice.<br>\r\n<br>\r\n          On the morning, he ate breakfast on his room. His bitchy mother won't let him out despite Stan and Kenny protest in front of the house. Cartman looked at his breakfast and ate the weird bread and meat. He found Jewish cuisine to be bland. No wonder Kyle and his mom have Sandy vaginas.<br>\r\n<br>\r\n          After that, he spent an hour admiring himself in the mirror. His crimson hair hangs freely beyond his head and sits quite nicely on his shoulders. Cartman tried doing weird faces on Kyle's body. Faces he would never dare try if he was in control. Soon, the activity transitioned into words. He said things that Kyle would surely not do. <br>\r\n<br>\r\n          \"I love you Cartman.\" He said. <br>\r\n<br>\r\n          \"I love you too Kyle.\" He said back in a poor imitation of his old voice. <br>\r\n<br>\r\n          \"I want to suck your balls. Mmm... Your balls are so dry...\" <br>\r\n<br>\r\n          Come to think of it, Cartman never saw Kyle naked before. Except yesterday in which he saw his dick. And right now, he can see it in full glory. He undressed as quick as buck. The warm blaze from the vents coursed through him, sending blissful shivers to his spine. He looked at himself at the full body mirror. There stood Kyle, naked and hard. His face plastered a wide grin, one where his gums are clearly visible. A small chuckle escaped his lip. His hands roamed to his back and hugged his own silky smooth skin. </span></div></div>",
            "created":1514350800,
            "id":2433106,
            "title":"Kyle"
        },
        "15212":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Clyde Donovan",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>          Cartman heads toward the park. Not many people are on the park today. The only presence are Craig and his gang, the kindergarten kids and the occasional adults and hobos. On the distant edge of the park, a stage was being torn down.<br>\r\n<br>\r\n          \"Pass it to me!\" Craig shouted. He caught the ball mid-air and rushed near the hoop. It was all in vain when Clyde blocked his path and stole the ball away. The steal and catch charade continued indefinitely. On the benches, Timmy and Jimmy clapped and jeered. A moment later, the boys went back to the benches and ate what seems to be their snacks.<br>\r\n<br>\r\n          Cartman moved closed and pondered. Who is it going to be? </span></div></div>",
            "created":1514360160,
            "id":2433118,
            "title":"Choose Clyde's Gang"
        },
        "152121":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "His friends",
                "A hooded stranger"
            ],
            "content":"<div class=\"\"><div> <span>          Cartman drafted downwards and hid behind the tree foliage. Most of Clyde's gang took a bathroom break except for Clyde himself and the big-head Timmy. Cartman drifted through the trees and right directly at the brown headed teen. Clyde, unaware of the mist surrounding him, blissfully packed his snack box.<br>\r\n<br>\r\n          It came as a jolt. Clyde's lungs constricted like someone is clenching his throat. He looked around but found only Timmy.<br>\r\n<br>\r\n          \"Timmy?\" The boy in the wheelchair asked. His voice quivered at the boy clutching his seat.<br>\r\n<br>\r\n          It took only a moment before the huge essence of Cartman fully penetrated the boy. Every bit of was sucked into the Clyde's orifice. He was gasping for air but little does he known that he was taking Cartman more. Clyde slumped on the ground and above him, Timmy repeated his own name in a trance.<br>\r\n<br>\r\n          \"Hey,\" A monotonous voice said. Someone was clutching Cartman's shoulder. \"You tired dude?\"<br>\r\n<br>\r\n          \"Get off me.\" Cartman protested. He shrugged off Craig's hand and helped himself up. Everything swirled and transfixed into place. He felt heavier, more solid and warm. Blood was coursing back into his veins and that was a good welcome. Around Cartman, Clyde's gang surrounds him. A worried face plastered in each and every one of them. <br>\r\n<br>\r\n          \"We're just worried sheesh.\" Token said. \"We're going to play again. You can just sit here.\"<br>\r\n<br>\r\n          Cartman didn't answer. He sat at the wooden bench. He was looking more at himself than the basketball game in front. He really is Clyde Donovan now. The boy voted as the cutest by the girls. The richest boy next to Token. \"I really am Clyde.\" He snickered. Cartman liked hearing his voice, like how the words he comes up flows out of his mouth. He liked how light he was. His clothes don't constrict him because he's fat. He liked everything right now. <br>\r\n<br>\r\n          \"Y-You se-seem to be in a - g-g-good mood Clyde.\" Jimmy stuttered and smiled. For a disabled person, he was quick to notice. <br>\r\n<br>\r\n          \"I feel fantastic.\" Cartman blurted. He want to jump, to run, to try everything with his new body. \"When they asked, I'm went back home.\" Cartman grab what seemed to be Clyde's stuff and dashed out. He was far away when he heard Jimmy called back. <br>\r\n<br>\r\n          He opened the key back to the Donovan residence and found that it was deserted. Clyde's mother died and his father owned a shoe store. As for his siblings, he doesn't really know of Clyde have one. He was never talkative with his family after the toilet incident with her mother. <br>\r\n<br>\r\n          Clyde's room was like the room of every other boy in South Park, except Kenny, he's poor. The room is plastered with monotone wallpaper and various toys litter the floor. A desktop computer is at the corner and hums silently along with the vent. Several posters hangs above his bed. Most of them portraying some Soccer team overseas. One poster pictures a legendary Chinpokemon. <br>\r\n<br>\r\n          Cartman walked to a lone ornate whole body mirror on the corner of the room. He half-expected for his old fat body to appear but Clyde moved on to the scene. Every move Cartman made, Clyde mimicked. Cartman moved closer. His breath is forming mist on the mirror surface but behind that, he could still see himself. He really does have a cute face. A face which is now fully under his possession. His nose, pronounced but not too much. His hair flowed like river as he combed his finger through. His cheeks, as white as snow, rosed as the cold licked his faced. <br>\r\n<br>\r\n          Suddenly, a knock came from the door. Heavy and monotonous, the knocking lingered. Cartman rushed down to see... </span></div></div>",
            "created":1514448480,
            "id":2433489,
            "title":"Clyde Donovan"
        },
        "152122":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Craig",
                "Tweek",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>         \"Taste this Tweek.\" Craig said in monotone and nasal voice. On his hand was a meat steak stabbed on a fork.<br>\r\n<br>\r\n         The yellow haired kid shuffled and fixed his drooping shirt before he took the bite. \"It tastes good.\"<br>\r\n<br>\r\n         Cartman floated, salivating with his non-existent mouth. He could surely possess one of them right?</span></div></div>",
            "created":1514360580,
            "id":2433120,
            "title":"The Yaoi Couple"
        },
        "1523":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "He entered the house himself",
                "Nah! he wanted to screw around the town",
                "he goes somewhere else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you sure you want to continue one with this path of the story or something else?</span></div></span></div>",
            "created":1548515580,
            "id":2607731,
            "title":"Are you sure?"
        },
        "15232":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "The Mayor",
                "more people"
            ],
            "content":"<div class=\"\"><div> <span>\"Nah!\" Cartmen sound off as he pushed the idea aside which gave way to new devious idea's that dance around in his nefarious mind that schemed and ploted his way to power many times in the past.<br>\r\n<br>\r\nAs cartmen walked around town he looked at the ring on his finger, his face scrunched up in deep thought of who was to be his first victim in his next path to power or his enteral paradise.<br>\r\n<br>\r\nAs he walked he suddenly thought of...<br>\r\n<br>\r\nwho becomes Cartmen's first victim of his possession.</span></div></div>",
            "created":1548517380,
            "id":2607750,
            "title":"Nah! he wanted to screw around the town"
        },
        "153":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Someone in the house",
                "One of his friends",
                "One of the South Park adults"
            ],
            "content":"<div class=\"\"><div> <span>The warm summer night shuffled into a thunderous velvet black. The quiet little town of South Park was covered by overcast clouds and  orchestra of howling winds. Most of the residents quivers underneath their sheets. Although, not all of them. One boy of particularly dark complexion was against the blinding light of his screen. His eyes jumped with every scroll and scanned every line of text.<br>\r\n<br>\r\n\"I bought it,\" he creased a grin. Pearl whites opened amidst the dark ocean. \"Let's see who they call n*gger now.\"<br>\r\n<br>\r\n---<br>\r\n<br>\r\nUnlike yesterday, the day started with a bright sunrise. The 5th day of the summer holidays was as welcoming as ever. Not for the Black residence. Both parents were frantic, each gobbled up their breakfast and bid their only son and daughter goodbye.  Nichole shrugged and went back to her room. Token on the other hand, called the servant to clean the morning mess and waited at the living room. His package, scoured within the depths of the internet and tracked with unconventional sources and means , is within his grasp. As soon as he sat at the lavishly black sofa, the doorbell rang. He rushed at the door and found a parcel sitting damply on the marble patio.<br>\r\n<br>\r\n\"To: Token B.\" It says.<br>\r\n<br>\r\nHe grabbed the package swiftly and made a run for it in his room. Once the door was locked, shades drawn and any servant dismissed outside, he opened the brown box. A capsule sits amidst thousand of peanut Styrofoam. A blue capsule that glinted with the crystal light above.<br>\r\n<br>\r\nBehind the capsule was an instruction card. Token picked it up and and read the contents under his breath.<br>\r\n<br>\r\n\"With the mix of technology and malicious magic, Taney and Abbott present the P. CAPSULE. First of its kind and probably one of the fifty made.\"<br>\r\n<br>\r\n\"Pop it, drink it and wait. Various tink and tank changes your body to the better. It gives you powers, unconventional, still unlike any other. The incorporeal ability of possession. The ability to phase, enter another's body and control. Inside someone, you do many sorts of things. Jump, Dance, Drink, Fap, Sex, Drugs, everything of your choice!\"<br>\r\n<br>\r\n\"Use responsibly.\" The final wording said.<br>\r\n<br>\r\nIn one quick swipe, Token drank the capsule. He could swear his stomach rumble as if a bomb landed inside. His insides whirred, his skin formed bumps and turned back to normal. He was changing into something else then he is getting turned back to his old self. It was an odd feeling yet welcoming. It all ended when he burped a tongue of golden flames.<br>\r\n<br>\r\nThe next choice is, who to test it on? </span></div></div>",
            "created":1514362380,
            "id":2433126,
            "title":"Token"
        },
        "155":{
            "author_id":"johneden64",
            "author_name":"That_One_Guy3",
            "choices":[
                "Wendy",
                "Jimmy",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1499317200,
            "id":2348131,
            "title":"Someone else"
        },
        "1552":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Wonder Tweek",
                "Mysterion",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>“Fast Pass, you know this serum is unstable. We don’t even know if it’s going to work.” The Mosquito said as he was doing his final preparations. The days of hard work, just for this formula to bring down the super pals.<br>\r\n<br>\r\n“Th- Th- Th- This is a risk I- a... I need to take mosquito.” Fast Pass said. Not only that the formula is in complete compatibility with him, he could also use its full potential with his acting skills. <br>\r\n<br>\r\n“Then I wish you like bzzzt...”<br>\r\n<br>\r\nWith amazing speed, Jimmy chugged the formula in one swig. The effects were instantaneous as he felt being light headed and drowzy. The world turned and back flipped, sending him into a speedy daze that nearly wrecked half their base.<br>\r\n<br>\r\n“Shut it down!” Coon shouted. <br>\r\n<br>\r\nThe mosquito can’t do anything. Fast Pass already drank the formula and it’s a one way ticket to peace or to his death.<br>\r\n<br>\r\nFast Pass slowly came to a halt and passed out among the rubble. It did not take long before he woke up again. <br>\r\n<br>\r\n“Are you alright? Bzztt...” The mosquito asked. Jimmy is looking paler than usual and he seems to be floating inches above ground. He knew the formula worked.<br>\r\n<br>\r\n“Yes Mo- Mo- Mo- Mosquito. I feel weird.” Jimmy smiled.<br>\r\n<br>\r\n“That’s okay. Human Kite. The vitals? Bztt...”<br>\r\n<br>\r\n“No heartbeat. No Brain Waves. Totally undetectable. By God he is the best spy we have.”<br>\r\n<br>\r\nJimmy smiled once again. The formula worked but this is not the last part of it. He dashed straight through the walls and stopped in front of the covered part of the room. “I- Is he here?”<br>\r\n<br>\r\n“Yes Fast Pass. Super Craig took quite a beating just to snatch him.” Coon said. There was something squirming beyond those tattered clothes. It was cursing beyond the gag that was placed on him. The Coon ripped the cloth to reveal...</span></div></div>",
            "created":1540525620,
            "id":2568687,
            "title":"Jimmy"
        },
        "15522":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Explore his New Body",
                "Practice his Lines"
            ],
            "content":"<div class=\"\"><div> <span>“Get me out of here you assholes!” Mysterion growled. The bonds were too tight for him to escape. They wanted to gag him but they ran out of cloth. The only available ones are Cartman’s dirty underwear. “Don’t you think this has gone too far? Waht do you want from me?”<br>\r\n<br>\r\n“You Mysterion. OR should I say, your body. Doctor Timothy’s gaze is far too strong. Freedom Pals forced us to do this.”<br>\r\n<br>\r\n“Forced to do what?” <br>\r\n<br>\r\n“Jimmy.”<br>\r\n<br>\r\nFast Pass walked nearer towards Mysterion. He looked at him with lust and greed. That squirming body is going to be his and he couldn’t wait a minute longer. Fast Pass crouched and dashed with great speed to where Mysterion is sitting. Instead of hitting him, he phased through and was gone beyond Mysterion’s skin. Mysterion on the other hand, lost consciousness on both surprise and the invading mind inside him. Jimmy was too strong mentally and he could not fight back. Mysterion faded with no fighting chance against his intruder.<br>\r\n<br>\r\n“Mysterion? Bzztt... Fast Pass?” Mosquito asked. Fast Pass’ Ectoplasmic reading was gone along with his body. Mysterion’s heartbeat on the other hand died down and returned momentarily. When he woke up, he was smiling.<br>\r\n<br>\r\n“It’s me. I think it’s successful.” Fast Pass in Mysterion’s body said.<br>\r\n<br>\r\n“Code?” Human Kite asked.<br>\r\n<br>\r\n“Cartman is the biggest douchebag.”<br>\r\n<br>\r\n“Positive. Cut his bonds Coon.”<br>\r\n<br>\r\nWith his sharpened claws, the Coon destroyed his mother’s stringy lingerie with ease. <br>\r\n<br>\r\n“How do you feel?” The Coon asked. <br>\r\n<br>\r\n“I feel, amazing. My stutter is gone.” Fast Pass stumbled by the mirror and awed at his new body. He could walk and talk properly. The clutches that anchored him to the ground was gone. He touched his feet and sure, he could feel a touching sensation over them. “This is super the Coon.”<br>\r\n<br>\r\n“Good for you.” The Coon said with a pout on his face. It was supposed to be him who was going to drink the formula not Fast Pass. But the Mosquito said he was too big and the formula is too diluted if he drank it. The Human Kite agreed too even though he don’t know batshit about Chemistry.<br>\r\n<br>\r\n“So Fast Pa- Er... Mysterion, do you still remember your mission.”<br>\r\n<br>\r\nMysterion nodded. He was supposed to infiltrate the Freedom Pals’ base, gather intel, destroy them if necessary and sow doubt between its members starting with Mysterion. He would act like a douchebag and probably focus on being a dick to Timmy. He was their leader after all. <br>\r\n<br>\r\n“We’ll give you a day to internalize yourself and practice your line okay?”<br>\r\n<br>\r\n“Okay.” <br>\r\n<br>\r\nFast Pass walked back upstairs and returned to his house. He was about to enter the Valmer residence when he realized that he wasn’t in his body but Kenny’s. So he doubled back and went to where Kenny’s house should be.<br>\r\n<br>\r\nWhat will Fast Pass do now?</span></div></div>",
            "created":1540539960,
            "id":2568730,
            "title":"Mysterion"
        },
        "1553":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "mr hankey the christmas poo",
                "Towelie the towel ",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about...</span></div></span></div>",
            "created":1508389200,
            "id":2403570,
            "title":"Someone else"
        },
        "15531":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "one of the children",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>Mr Hankey the Christmas Poo is a talking piece of shit literally a talking faeces that lives in the sewers and comes up from the toilet or any drainage that connects through the piping to spread Christmas joy and cheer to all of the citizens of south park.<br>\r\n<br>\r\nMr hankey possesses powers over the waste in southparks sewers and uses the piping to travel in to peoples homes.<br>\r\n<br>\r\nhis small thin size allows him to squeeze through tight places included and not limited to people so long as they help him spread his message or for a bit of fun.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://southpark.wikia.com/wiki/Mr._Hankey\" target=\"_blank\">http://southpark.wikia.com/wiki/Mr._Hank...</a><br>\r\n<br>\r\nwho does he possess</span></div></div>",
            "created":1508389200,
            "id":2403629,
            "title":"mr hankey the christmas poo"
        },
        "155312":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "adults",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about one the adult characters in the show, both main and guests</span></div></span></div>",
            "created":1508389200,
            "id":2403639,
            "title":"more"
        },
        "1553121":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "yes her",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Shelia Broflavski<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://southpark.wikia.com/wiki/Sheila_Broflovski\" target=\"_blank\">http://southpark.wikia.com/wiki/Sheila_B...</a></span></div></span></div>",
            "created":1508389200,
            "id":2403641,
            "title":"adults"
        }
    },
    "info":{
        "author_id":"johneden64",
        "author_name":"That_One_Guy3",
        "brief_description":"Someone in South Park gets some special ablites.",
        "created":1484241720,
        "description":"<td align=\"left\" class=\"norm\">This is really an anything goes type of story but try not to end it.</td>",
        "id":2108532,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602342900,
        "modified":1602342900,
        "pretty_title":"South Park possession story"
    }
}