{
    "chapters":{
        "1":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Straight (Heterosexual)",
                "Gay (Homosexual)",
                "Lesbian ",
                "Giant/Giantess...?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>                 To begin, what sexual orientation are you? Which story type would you like to pursue from that question?</span></div></span></div>",
            "created":1244264400,
            "id":724120,
            "title":"Starting Point"
        },
        "11":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "A guy shrinks.",
                "A girl shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time for another question. Who do you want to shrink? Do you like being a tiny guy? Do you want to see a tiny girl? </span></div></span></div>",
            "created":1244264400,
            "id":703359,
            "title":"Guy or girl shrinkage?"
        },
        "111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Yun-Seong",
                "Siegfried",
                "More guys!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OKay, now comes the final main question. Who do you want to become tiny?</span></div></span></div>",
            "created":1244264400,
            "id":703362,
            "title":"A guy shrinks."
        },
        "1111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Sophitia",
                "Ivy",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>            One morning Yun-Seong found himself reflecting looking at his blade. It seemed so long ago that Seong-Mina had told him of the White-Storm's power. (Anyone who's played the game knows) It had the power to let the holder reflect, see what they were looking for, see inside themselves. He stared deeply into the blade, not worrying about where he was walking. It was an open country anyway, with all kinds of landscapes. As he stared, he began to become entranced, until he actually passed out!<br>\r\n<br>\r\n          Yun-Seong awoke from his nap to find a massive blade near him. He finally realized his situation. \"Holy hell! That's the White Storm!\" He'd been shrunken to a small enough size to fit in the palm of a hand. Snapping from his confusion, he heard a rumbling in the earth. Someone was coming! But who?</span></div></div>",
            "created":1244264400,
            "id":703371,
            "title":"Yun-Seong is shrunken!"
        },
        "11111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "He tries to catch her attention!",
                "He jumps for the sandal!"
            ],
            "content":"<div class=\"\"><div> <span>           Yun-Seong saw the massive Greek woman coming towards him, and she wasn't looking his way. She walked with resolve, straight ahead, booming steps and a hardened gaze. She was a warrior, not a softy. Yun-Seong had a couple of options, but given the time frame, he'd have to act quickly. If he waved her down, she might crush him accidentally. If he did nothing, he'd surely die in the wilderness. If he made a jump for her sandal, he might die in the attempt. Trusting his luck and himself, however, Yun-Seong acted.</span></div></div>",
            "created":1244264400,
            "id":703382,
            "title":"Sophitia"
        },
        "111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "She bends down to examine the sword!",
                "She keeps walking!"
            ],
            "content":"<div class=\"\"><div> <span>            Yun-Seong, all alone and tiny on the road, tries to wave down the massive warrior coming toward him. He jumps up and down, screams loudly, and prays that when she sees the sword lying on the road, he can catch her attention. Sophitia was quickly advancing, and Yun-Seong moved in front of his sword. Sophitia did notice the sword, but not the man near it. Yun-Seong's heart races as she looks down, not seeing him. Sophitia is a busy woman, but could make use of the sword. She thinks as she steps nearer, finally choosing.</span></div></div>",
            "created":1244264400,
            "id":703383,
            "title":"He tries to catch her attention!"
        },
        "1111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Enslave him.",
                "Someone else can choose their story from here."
            ],
            "content":"<div class=\"\"><div> <span>                  Sophitia bends down to examine the sword. Perhaps, she thinks, her husband can use the fine metal it is forged from. As she looks over it, a bug-like being jumps into her sight. As she inspects the bug, she rears back in surprise. \"It's a tiny man!,\" she says with her hand on her chest. Yun-Seong is happy to have received recognition, and moves between her legs. She reaches down, and grasps the little man in her hand, \"A pretty handsome figure on this little doll.\" Yun-Seong yells up, \"I'm not a doll! I'm a warrior!\" Sophitia giggles, \"Sorry little guy, you just look so cute down there!\" She thinks over what to do with her newfound doll.</span></div></div>",
            "created":1244264400,
            "id":703390,
            "title":"She bends down to examine the sword!"
        },
        "11111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "She makes him smell her feet.",
                "She does something else."
            ],
            "content":"<div class=\"\"><div> <span>           Sophitia gave into her personal desires, and propped her sandal right in front of the confused Yun-Seong. \"All right little man, you know what I want you to do for me?\" Yun-Seong had no idea, \"Uhhh, no. What?\" Sophitia giggled, \"Lick my sandal.\" Yun-Seong backed up, \"No way! I'm not licking your dirty, stinky sandal!\" Sophitia feigned anger, stomping the ground, knocking Yun-Seong off his feet. She raised it above him, leaned her head down, and looked at him menacingly. \"Lick it, or get squished. Your choice BUG.\" Yun-Seong was scared now, and obliged. He began to lick the dirty underside of her sandal, occasionally moving a chunk of dirt out of his tongue's path. Sophitia watched him, turned on by what would be a big, strong man, enslaved and worshipping her feet. \"That's right you pathetic, sniveling worm, lick them!\" She got carried away, and Yun-Seong's pride flared. He tried to escape, but Spohitia pinned him. \"You can't escape, you're going to be my pet forever. If you hadn't acted out like that, maybe I would have helped you. However, I see now that you require training...</span></div></div>",
            "created":1244264400,
            "id":703960,
            "title":"Enslave him."
        },
        "111111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Take him home via sandal.",
                "I don't like where this is going..."
            ],
            "content":"<div class=\"\"><div> <span>To Yun-Seong's despair, Sophitia removed her sandal, leaving a road-worn foot. Having walked for so long, Sophitia's feet had been sweating quite a bit, and the smell was noticeable to the tiny fighter. She put her foot down in front of Yun-Seong once more, \"Okay pet, to start your training, you will smell my feet.\" Yun-Seong looked up, dreading it, \"Do I have a choice?\" She only shook her head, \"Nope! So get smelling!\"<br>\r\n<br>\r\nYun-Seong spent a good thirty minutes smelling the feet of the Greek giantess. It was rancid, they reeked like she hadn't washed them in days; she probably hadn't. \"How's it down there? Stinky enough for you? I'm sure you'll make a fine house-pet; I'll even introduce you to my son and daughter, Patroklos and Pyrrha. Maybe even Cassandra could use you to worship her feet.\" Yun-Seong couldn't believe that in the prime of his life, he was being enslaved to a woman's family as a foot servant. \"You can't do this! This is sick and wrong!\" Sophitia laughed, \"And who'll stop me? You? Ha!\" For once in his life, Yun-Seong wished Seong-Mina was there.</span></div></div>",
            "created":1244350800,
            "id":703966,
            "title":"She makes him smell her feet."
        },
        "1111111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Long walk home.",
                "Seong Mina appears!"
            ],
            "content":"<div class=\"\"><div> <span>Sophitia decides to end this game. \"Alright, you've smelled enough, I think it's time we left.\" With that, she put Yun-Seong down on her sandal. Yun-Seong could smell the foot-sweat on it, and gagged. He turned himself upright, only to see Sophitia's gargantuan foot sliding into the sandal. Soon, her soft and smelly foot covered him; he was trapped under the sole, with his head under the ball of the foot. He couldn't escape, but human instinct caused him to wiggle around. Sophitia delighted in this, \"That's right pet, squirm for me! Mm, I love it when insects can't escape.\"<br>\r\n<br>\r\nSophitia giggled, now her family had a pet. She could use it herself, for pleasure and worship. She could give it to her kids, they'd have a new toy to play with. She could give it to Cassandra as a present, whatever she wanted. For the first time in her life, she had a human completely in her power, and she was loving it.</span></div></div>",
            "created":1244350800,
            "id":703980,
            "title":"Take him home via sandal."
        },
        "11111111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Give him to one of her kids!",
                "Give him to Cassandra, or keep him!"
            ],
            "content":"<div class=\"\"><div> <span>And so began Yun-Seong's first real torture. Sophitia took a step, and he was pounded into her soft, sweaty foot. The steps went on and on, for hours upon hours, and still Yun-Seong lived. The smell was bad as usual, progressively getting worse. He tried not to concentrate on how much her feet reeked, and instead braced himself for each step; and each step bore the risk of a broken rib. To Yun-Seong it seemed a painful lifetime, each second his breath was forced from his lungs, only to be replaced by pungent foot odor. Many times, in his gasping for breath, he'd swallow droplets of sweat from Sophitia's foot, choking him for a moment. In essence it was torture. <br>\r\n<br>\r\nSophitia, uncaring of her pet's condition, only giggled at his misfortune. \"I hope he likes it down there with my stinky foot!\", she said to herself. And now she headed home.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nA journey later, through nights of camping - Yun-Seong tied to her foot of course - Sophitia arrived home. She now faced the decision of whom she should give her pet to, or if she should simply keep him.</span></div></div>",
            "created":1244437200,
            "id":704844,
            "title":"Long walk home."
        },
        "111111111111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Pyrrha",
                "Patroklos"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of her children does she give Yun-Seong to?</span></div></span></div>",
            "created":1244869200,
            "id":707627,
            "title":"Give him to one of her kids!"
        },
        "111111111112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Keep him!",
                "Give him to Cassandra!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she give Yun-Seong to her sister Cassandra, or keep him?</span></div></span></div>",
            "created":1244869200,
            "id":707629,
            "title":"Give him to Cassandra, or keep him!"
        },
        "1111111111121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Play with her feet some more.",
                "Actually, she's feeling like a snack..."
            ],
            "content":"<div class=\"\"><div> <span>To Sophitia, the choice was rather obvious. She couldn't let him go, that would be a waste of a pet. She couldn't give him to Cassandra, for she'd either tell Rothion, or she'd never see him again. If she gave him to one of her kids, he'd probably end up as their broken toy within an hour. No, she'd have to keep him, and keep him quiet. Entering her house, she realized quickly that nobody was home. Walking through the house, she saw a note on the dining table. \"Hmm? What's this?\" She read the short note gleefully...<br>\r\n<br>\r\n\"Sorry to worry you if you have returned. I have taken the children on a pilgrammage, you know, let the kids understand the importance of Hephaestus at an early age. We will return in a few days. Cassandra has left on a quest of some measure, though I don't know the details, but that is her business. I love you. -Rothion\"<br>\r\n<br>\r\nSophitia was glad for this; no kids, and time to play with her pet! Speaking of which, it was a marvel that he still lived. He had been trampled for days upon days, and still he squirmed weakly under her foot. She wondered then, what should she do?</span></div></div>",
            "created":1246597200,
            "id":718191,
            "title":"Keep him!"
        },
        "1111111112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Someone or something comes.",
                "Yun-Seong is left alone."
            ],
            "content":"<div class=\"\"><div> <span>\"Actually, I think it would be better for both of us if I just left you alone.\" Yun-Seong didn't believe those words. \"What's the catch?\" Sophitia grinned evilly, \"That I never see you again.\" She stood up, returning her sandal to her foot. She looked like she was just going to abandon him right there-not so. Yun-Seong didn't have time to scream, as a malevolent Sophitia stepped right on him, breaking his bones. Yun-Seong felt the weight forever, so it seemed, but it was just a step. \"So long warrior, let us never meet again.\" With that, she walked away; leaving a broken, and heavily breathing Yun-Seong.</span></div></div>",
            "created":1244350800,
            "id":703972,
            "title":"I don't like where this is going..."
        },
        "11111111122":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Someone finds him.",
                "Reader's Choice."
            ],
            "content":"<div class=\"\"><div> <span>Yun-Seong can do nothing but stay still. His body hurts too much, and he is simply too tired to do anything. Panting heavily, he stifles cries of agony by clenching his teeth. His bones were mostly broken, and every once in a while, he'd cough up some blood. Unable to bear the pain, he passed out. He could only hope that some animal wouldn't make a meal of him.<br>\r\n<br>\r\n......<br>\r\n<br>\r\nDarkness overtook Yun-Seong, but there was something on it's way. A storm began to brew high above, plopping massive raindrops on Yun-Seong. It rained to the extent that a tiny stream was formed, leading off the road into a nearby ditch. From there, he was carried via stream downhill to a nearby pond. His tiny body washed up on the banks of the pond.</span></div></div>",
            "created":1247547600,
            "id":724622,
            "title":"Yun-Seong is left alone."
        },
        "111111111221":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Bear with me..."
            ],
            "content":"<div class=\"\"><div> <span>But someone found Yun-Seong that day. It wasn't a giant or giantess, it wasn't a mammal or bird; nor insect, nor amphibian. No, it was a group of tiny people. The size of Yun-Seong, they had been hunting to keep themselves alive. Stumbling across the boy, they brought him home to their village. Yun-Seong was laid out on a bed, and left alone to heal - with the aid of the village healer. <br>\r\n<br>\r\n...<br>\r\n<br>\r\nWeeks later, Yun-Seong awakes. \"...Why aren't I dead?\" He looked around, seeing a woman his size, wearing the robes of a monk. \"Because we saved you, newcomer. Welcome to our village.\" Yun-Seong's eyes opened wide, \"You mean I'm not small anymore!?\" The woman shook her head sadly, \"Oh no boy, we're all small here.\" Yun-Seong' hopes dropped. \"You mean there's a village of tiny people? That's impossible.\" The woman nodded, \"Seemingly so, but Soul Edge affects the people around the owner in strange ways.\" Yun-Seong didn't say anymore, that was the sword he sought. These people had apparently been shrunken, perhaps the entire village. If that was so, why didn't the owner of Soul Edge just crush the place? But that had been a long time ago, and only the whispers on the winds could tell.<br>\r\n</span></div></div>",
            "created":1247547600,
            "id":724630,
            "title":"Someone finds him."
        },
        "1111111112211":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Ivy, who saw Yun-Seong.",
                "Seong-Mina, who was bathing in the pond."
            ],
            "content":"<div class=\"\"><div> <span>A few more weeks passed, and Yun-Seong was fully recovered. Nobody was in his little room, but he felt fine. He went to get out of bed, and the ensuing earthquake helped him along. He fell flat on the floor, wondering what could have caused the tremor. Of course, he realized that he was tiny, in a world of giants. He ran outside quickly, and was knocked down by another tremor. Someone was coming, somehow from somewhere. Who knew how they had found the village? Maybe they didn't know, perhaps they were just bush-whacking, and were happening across the village by accident. Either way, Yun-Seong decided to go get a better look at who was coming.<br>\r\n<br>\r\nRunning through the village, and escaping through the brush that protected it, he could see a woman coming from the direction of the pond. It was....</span></div></div>",
            "created":1247547600,
            "id":724647,
            "title":"Bear with me..."
        },
        "11111111122111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Ivy gives in to passion.",
                "Ivy studies the village, before doing anything foolish."
            ],
            "content":"<div class=\"\"><div> <span>Ivy was not happy. It was hot outside, and she was looking for shelter. She had walked down from the high road, down to this pond area in hopes of relief. At least it was shady here. But something unexpected had happened. She saw a tiny man, it had to be, for it wore clothes. The man ran into the bushes, and Ivy stomped after, intrigued by the very idea. When she made it past the village, her eyes opened wide.<br>\r\n<br>\r\n\"Shit!\" thought Yun-Seong, and he ran quickly. He hadn't expected to see the giant beauty, and he'd certainly not meant to be seen. Fearing that he had now doomed the village, he ran to cover. Ivy was a known sadist; some of her battle moves displayed that. If she was irritated today, who knows what she would do? Sadists take pleasure in hurting others - a village of tiny people was a perfect target.<br>\r\n<br>\r\nIvy saw the quaint little village, strewen out in front of her - inviting her. It was filled with cowering, small people. The cute little houses were made just like the real thing! Maybe they were, thought Ivy, as she decided what to do with the village. It was a curious case, one that her alchemical studies could be advanced with. Of course, the very thought of crushing it under her boobs and feet was turning her on. Maybe intellect should give in to passion this time.</span></div></div>",
            "created":1247806800,
            "id":726775,
            "title":"Goddess Ivy"
        },
        "111111111221111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Yun-Seong intervenes!",
                "Ivy squishes the town."
            ],
            "content":"<div class=\"\"><div> <span>Ivy looked about, and listened to the sounds of the forest - nothing. Nobody was around, nobody could stop or see her. She was free to act as she pleased, and she immediately removed her clothes as quickly as possible. Her lips formed a fearsom smirk, as she looked down upon her tiny servants. They looked up in blatant horror, as Ivy's massive, exposed boobs blotted out the sun. Her gorgeous, naked body did nothing but instill fear in the unlucky people. Ivy gripped her breasts in her hands, squeezing them together; she giggled at the thought of what she would do.<br>\r\n<br>\r\nShadow covered the miniature village, and Ivy's breasts descended upon it like a ton of bricks. Houses were crushed under the bare mountains of flesh. People screamed as they were swept into the cleavage, and squished inbetween Ivy's boobs. \"Yes, yes! My boobs are hungry!\" Ivy laughed madly. After her first attack, the village was half destroyed. Yun-Seong had gone to the remaining half of the village, trying to think of some way to stop the titaness.</span></div></div>",
            "created":1247979600,
            "id":728218,
            "title":"Ivy gives in to passion."
        },
        "1111111112211112":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Ivy kills you",
                "Ivy keeps you for herself"
            ],
            "content":"<div class=\"\"><div> <span>There was nothing that Yun-Seong could do to stop Ivy's breasts. He desperately looked around the village, most of the villagers were dead or dying under destroyed buildings or had been smashed under Ivy's breasts. <br>\r\nYou (Yun-Seong) looked up in horror at the giantess Ivy she was brushing her breasts down you saw people from your village falling to their certain deaths from Ivy's massive body. Ivy caught someone a young man, he was tiny in her massive grip. You watch shocked as Ivy placed the man in between her huge breasts. She then pushed her breasts together \"Enjoy your death little man\" Ivy mocked. You couldn't see the man in between Ivy's breasts he had been completely consumed by the giantesses cleavage. When Ivy released her breasts all that remained of the man was a bloody mess of twisted limbs and shattered bone. Ivy laughed at the remaining villagers as they cowered in a group in an open area surrounded by the remaining buildings. As Ivy bent down for another attack you saw the crowd scatter in all directions but they were too slow like a comet Ivy's breasts descended and three villagers were crushed along with some buildings. Then you saw Ivy's breasts swing away from you like a pendulum you herd screams and cries for mercy as human and building was crushed by boob. Then you watched as the breasts swung towards you and you saw a woman in front of you get hit by the fleshy pendulum and be thrown into the air screaming. You ducked and Ivy's breasts passed over your tiny body.<br>\r\nYou quickly got up and looked around Ivy's breasts, had completely destroyed the village. You didn't notice as Ivy's breasts swung back and you collided with her breast. You were thrown several metres across the ground dazed you stood you and looked around. Nobody was alive in the village broken bodies’ lie everywhere and the whole town was a ruin. \"Last one left, looks like my boobs didn't get you\" You look up and see the giant naked Ivy standing above you. Her massive boobs were ten times your size. The godlike Ivy smiled down at your tiny body you shivered while you waited for Ivy to decide what to do with you.  <br>\r\n</span></div></div>",
            "created":1278306000,
            "id":911951,
            "title":"Ivy squishes the town."
        },
        "11111111122112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Seong-Mina starts crushing to village.",
                "Seong-Mina makes the vilagers worship her body."
            ],
            "content":"<div class=\"\"><div> <span>Seong-Mina was just getting out of the pond, which she had taken a light dip in, to dry off. Her clothes laid in pile near a tree, shade covered the entire area. She had come down from the road to seek a quick bath, and a quick break. Feeling refreshed, but sopping wet, she walked around in the nude. Nobody was there to see her. Soon, however, she caught something in the corner of her eye. It was a boy, and though small, she recognized him instantly. Her face turned from one of relaxation to one of rage. \"Hong Yun-Seong, you pervert!\" She didn't even ask why he was tiny, nor question how it was possible. Yun-Seong escaped quickly into the bush, and back to the village; he heard stomping feet behind him. Tripping from a particularly violent stomp, he felt a water drop hit his back. Looking up, he saw the angry, and very naked, Seong-Mina; exposed to the entire village. Seong-Mina, just now getting over her initial rage, looked over the tiny village. \"Yun-Seong, I don't know or care how you got tiny, but you're going to pay. I was supposed to bring you home, maybe I'll do that with you under my foot! As for the rest of your peeping Tom friends here....I'd hate to be them right now!\" </span></div></div>",
            "created":1247547600,
            "id":724654,
            "title":"Seong-Mina, who was bathing in the pond."
        },
        "111111111221122":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Seong-Mina makes the villagers lick her feet.",
                "Seong-Mina starts to eat villagers."
            ],
            "content":"<div class=\"\"><div> <span>Seong-Mina decided to spare the little cretins, whom she thought were spying on here. Looking down at the shaking Yun-Seong, she smiled. \"I bet you wanna spend some time under my fine ass.\" Yun-Seong looked around, \"Did she actually just say that?\" No matter what he thought, Seong-Mina lowered herself down on Yun-Seong, trapping him under her wet butt. She laid the rest of herself down, letting the gathering crowd see her beautiful feet. They were soaked still, with bits of grass stuck to them. \"Alright litte people, start worshipping me!\" As tiny people got to work, Seong-Mina picked up three tiny women. She stuck one in her navel, and put two on her breasts. \"Okay, you two start rubbing my nipples.\" She wiggled, feeling Yun-Seong squirm under her ass. And everything was good.</span></div></div>",
            "created":1247547600,
            "id":726767,
            "title":"Seong-Mina makes the villagers worship her body."
        },
        "1111112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "content":"<div class=\"\"><div> <span>             Yun-Seong's hope diminished, as Sophitia takes her eyes off the sword, and keeps walking ahead. He tries to run, he tries to jump, but her massive foot begins to descend; and he's right in her path. Yun-Seong's jumps leaves him directly under the foot, and he looks up to see leathery doom approaching. <br>\r\n<br>\r\n           Sophitia looks up, uncaring of the sword; her husband made hers, she would keep it. She steps down, aiming to walk over it with her next step, and Yun-Seong is squashed, unknowingly, like a tiny bug. The last thing he smelled, before he slipped into death's embrace, was leather and feet.</span></div></div>",
            "created":1244264400,
            "id":703386,
            "title":"SQUASHED!"
        },
        "11113":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Talim</span></div></span></div>",
            "created":1244350800,
            "id":704072,
            "title":"Talim?"
        },
        "111131":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Get her attention from the ground",
                "Try to climb on her to get to her ear level"
            ],
            "content":"<div class=\"\"><div> <span>Yun-Seong looks over to see Wind Priestess approaching towards him.  Was she following him again, Yun-Seong thought. Regardless, this was a blessing since he knew Talim to be kind hearted enough to help him grow back to his original size. First however, he had to get her attention fast. However, if he tries to do so right now, he will take the risk of her not hearing him and perhaps miss him or even worse, step on him by accident! On the other hand, he could try to climb up Talim and perhaps get to ear level for him to yell at her but he runs the risk of falling off or getting crushed. <br>\r\n<br>\r\nAs Yun-Seong was debating the best course of action in his head, Talim was almost near his position and Yun-Seong finally decided to...</span></div></div>",
            "created":1244955600,
            "id":708460,
            "title":"the Wind Priestess approacheth"
        },
        "1111311":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"Yun-Seong?\"",
                "\"Ew, a bug!\""
            ],
            "content":"<div class=\"\"><div> <span>Yun-Seong decided to try to get Talim's attention from the ground. Trying to climb up her may result in you following and running towards her foot would most likely result in a less then happy end. \"Talim, Down here!\" Yun-Seong yelled as loud as possible.  Talim keep walking and Yun-Seong yelled the same message. This time he got Talim's attention. She looked down and said....</span></div></div>",
            "created":1248066000,
            "id":728742,
            "title":"Getting Talim's attention"
        },
        "11113111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Took of her sandals and showed her barefeet to Yun-Seong",
                "Picked up Yun-Seong and moved him toward her mouth"
            ],
            "content":"<div class=\"\"><div> <span>\"Yun-Seong, is that you?\" Talim said, in amazement. \"Of course it's me, if it sounds like me and looks like me, then it must by me\" Yun-Seong replied rudely. Talim sighed and crouched down so she would be able to get a better look at him. \"Wow, how did you get so small?\" Talim asked.  \"Who cares, just find a way to change me back!\" Yun-Seong shouted up to Talim. Talim was incensed. She was just trying to help and Yun-Seong, in his hot headed and arrogant attitude was really ticking her off. \"What are you staring at, just help me out\" Yun-Seong said.<br>\r\n<br>\r\n<br>\r\nTalim glared at Yun-Seong. \"No!\" Talim answered. To say that Yun-Seong was shocked would be a vast understatement. He figured out of anybody in the world, Talim would be the one who would help him. He was in it really deep now. \"What!....but why?\" Yun-Seong asked.  \"Well for one thing, your yelling at me for trying to help you and you attitude probably got you into this mess in the first place.\" Talim replied. \"Look, I'm sorry, just help me out alright\" Yun-Seong begged. Talim smirked at Yun-Seong's begging form. \"Oh don't worry, I'm going to help you but not before teaching you a lesson in Humility first\" Talim said as she.....</span></div></div>",
            "created":1248152400,
            "id":729194,
            "title":"Lesson in Humility "
        },
        "111131111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"Smell my feet\"",
                "\"Lick my feet\""
            ],
            "content":"<div class=\"\"><div> <span>Talim started to unstrap her sandals, smirking at the tiny and helpless Yun-Seong. \"You know Yun-Seong, I rarely have a chance to take these sandals off, and considering the amount of running and traveling I have to do...let's just say that my feet are the perfect teachers to teach your lesson.\" Talim smirked, as she sat down and showed her now bare feet to Yun-Seong. A unpleasant stench hit his nose and he immediately gagged \"Ack....put your feet back in your sandals Talim! I don't want to smell your putrid feet!\" Yun-Seong said. Talim smirked at Yun-Seong's torture.  \"Aw what's wrong Yun-Seong? Don't like my feet? Well too bad, cause they like you\" Talim teased, as she slammed her feet together, with Yun-Seong in the middle. \"Listen, unless you don't want your body to be nothing but a heap of broken bones, you would smell and pamper my feet at my very whim!\" Talim shouted at Yun-Seong<br>\r\n<br>\r\nMeanwhile, Yun-Seong was experiencing his own  personally hell between Talim's feet. The smell was near unbearable and he was starting to regret being so  hotheaded. All of the sudden, Talim released her grip on Yun-Seong and he fall to the ground. He got up and found out he was in the same position he was in not to long ago. \"So Yun-Seong, for the first part of your lesson, you are to....\"</span></div></div>",
            "created":1248238800,
            "id":729851,
            "title":"The Lesson Begins"
        },
        "1111311111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"Lick my feet!\"",
                "\"Get into one of my sandals!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Smell my feet Yun-Seong\" Talim said, smirking. Yun-Seong looked shocked, after being sandwiched between her feet, he had no desire to smell them anymore. \"And what if I refuse\" Yun-Seong said, glaring at Talim. \"Well then...I  guess you'll be stuck like this forever and I won't help you until you learn your lesson. So smell them!\" Talim ordered.  <br>\r\n<br>\r\nYun-Seong gulped. He really had no choice, this is the only chance he had to grow back. If Talim abandoned him, he would be in deep trouble since she was the best choice out of all the people to find them. Besides it could have been worse, Tira could have  found them. \"Hurry up student, the teachers are waiting!\" Talim barked, interrupting Yun-Seong's thoughts.<br>\r\n<br>\r\nYun-Seong sighed and walked up to Talims feet and started to smell them. The smell was anything but pleasant and smelled like they were in those sandals for a long time. Yun-Seong was gagging at the cheesy smell. Talim saw this and smirked \"Heh, you like the smell? I hope you do, since your going to be smelling them for a long time\" Talim laughed, enjoying humiliating and humbling the hot-headed Yun-Seong. After smelling Talims feet for about thirty minutes, Yun-Seong heard Talim order. \"Stop!\"<br>\r\n<br>\r\nYun-Seong gladly obeyed, he then walked back from Talims feet. Talim then spoke. \"Alright student, now I want you to.....\":</span></div></div>",
            "created":1248325200,
            "id":730986,
            "title":"The Lesson Continues!"
        },
        "11113111111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"Make you clean in between my toes\"",
                "\"Force you to pleasure me\""
            ],
            "content":"<div class=\"\"><div> <span>\"Lick my feet\" Talim said. Yun-Seong's eyes widen in surprise and horror, there was no way he could have heard that right. \"I'm sorry?\" he asked with a tone of disbelief. \"You heard what I said, I want you to lick my feet\" Talim responded with a smirk.  Yun-Seong couldn't believe that this was happening to him. Why was treating him like he was some sort of foot slave? Yun-Seong started to get rather angry. Smelling her feet was bad enough, but licking them?! That's where he drew the line. What the hell did he do to deserve this, he thought. Sure, he was kind of a jerk to her  when they traveled together during that one period but he was never an outright jackass to her. The fact that Talim seemed to enjoy tormenting him did not help matters in calming him.  \"ARE YOU CRAZY? THERE'S NO WAY IN HELL I'M  GOING TO LICK YOUR NASTY FEET!\" Yun-Seong shouted up to Talim, with rage in every word.<br>\r\n<br>\r\nTalim's look changed instantly from a smirk of triumph to a glare filled with rage. It was at that moment Yun-Seong realized he had made a mistake but before he could even do anything, Talim with great dexterity and speed, managed to grab Yun-Seong's head between her left big toe and the left index toe and put it in a scissor like hold. Talim then applied pressure. Talim then sighed and said \" You know, this is why I'm teaching you this lesson, not only does your ego need to go down a notch but you also need to control that temper of yours.\"  Yun-Seong was having a hard time hearing Talim due to the hold he was in. Not only did his head felt like it was about to pop off, but he also had to smell the putrid stench between Talim's toes! With his remaining strenght, he yelled up \"OKAY, I'LL LICK YOUR FEET!\"<br>\r\n<br>\r\nTalim smirked and released his head, causing him to stumble back  a little bit. She then lifts her feet and shows her soles to him. \"Now lick my student\" Talim said, as she put her feet in a way that showed her soles to Yun-Seong. Yun-Seong reluctantly walked up to Talim's feet and then stuck his tongue out and licked her heel. To say that the taste was revolting would be a drastic understatement. It tasted as bad as they smelled, cheesy and salty. Yun-Seong used all of his will power to not to gag at the taste, cause if he gagged, he might risk angering Talim. After what seemed like hours of licking her heel, Yun-Seong suddenly found himself under Talim's sole and knew that he had to lick it. Needless to say, but the taste wasn't much better then her heel. Talim however was snickering at the torment you was making Yun-Seong go through and taunted him by saying \"What's wrong student, don't you like the taste of my feet?\" Yun-Seong's tongue was getting tired due to the constant licking and finally, Talim lifted her foot and Yun-Seong crawled from under it.<br>\r\n<br>\r\nYun-Seong felt relived and it seemed as it showed for Talim said \"Don't think your done student, your only half way there.\" She then wiggled the toes on her right foot for emphasis. She then smirked at Yun-Seong's look of horror when he realized that he had another foot to \"attend to.\" With great reluctance and horror in his heart, he walked over to her right foot and once again started to lick her heel. To Yun-Seong, it tasted as revolting as her other foot, though at least he was getting use to the smell. Talim on the other hand was still enjoying the power she had over Yun-Seong and moaned in pleasure at the feel of his tongue against her heel. After what seemed like forever to Yun-Seong, Talim again lifted up her foot and put it down softly on Yun-Seong, so as to not crush him and force him into her sole. Yun-Seong immediately started to lick, fearing that if he hesitated, Talim would squish him. Again, her sole did not taste any better then her heel, though he was finally use to the smell. After what seemed hours on end, Talim lifted her foot and Yun-Seong once again feebly crawled away from the feet that broke his will and as a result his pride. Talim smirked, her plan worked, Yun-Seong was now broken and she was now his mistress. Talim then started to give her next order<br>\r\n<br>\r\n\"Alright, that's enough of that Yun-Seong, now I'm going to........\"<br>\r\n</span></div></div>",
            "created":1255669200,
            "id":776976,
            "title":"The breaking of Yun-Seong"
        },
        "1111312":{
            "author_id":"cm8000",
            "author_name":"masterchief",
            "choices":[
                "Talim removes her sandal",
                "Talim spots something on her foot"
            ],
            "content":"<div class=\"\"><div> <span>Yun-Seong charged over to the massive oncoming foot and leaped straight torwards it, catching one of the straps of Talim's sandal. Yun-Seong knew it would be difficult to get this giantesses attention at barely 1 inch tall in height. He hangs on tightly as Talim stomps through the fields, each step nearly dislodging him from his position. Not to mention the smell of sweaty feet around Yun-Seong makes him nauseus!<br>\r\n<br>\r\nSuddenly Talim feels something irritating her foot and stops walking. Yun-Seong is jarred by the abrupt stop and looks up only to see Talim stairing down at him. In a way he was excited, and yet, terrified she could mistake him for a bug. Talim then,</span></div></div>",
            "created":1248066000,
            "id":728629,
            "title":"On Talim's foot"
        },
        "111132":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>was it Seong Mi-na?</span></div></span></div>",
            "created":1292734800,
            "id":1018033,
            "title":"Seong Mi-na?"
        },
        "1111322":{
            "author_id":"pokemon54321",
            "author_name":"poky",
            "choices":[
                "Kilik",
                "more guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I think we need some male characters here.</span></div></span></div>",
            "created":1292909160,
            "id":1019350,
            "title":"no"
        },
        "11113222":{
            "author_id":"pokemon54321",
            "author_name":"poky",
            "choices":[
                "Maxi",
                "Mitsurugi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these guys?</span></div></span></div>",
            "created":1292909220,
            "id":1019351,
            "title":"more guys"
        },
        "1112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Hilde",
                "Someone else.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before I begin to write a story, I want to know which girl will find him.</span></div></span></div>",
            "created":1248066000,
            "id":729133,
            "title":"Siegfried"
        },
        "11121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Siegfried wakes up in Hilde's personal room.",
                "Siegfried wakes up in the royal kitchen."
            ],
            "content":"<div class=\"\"><div> <span>(This story beginning is based on Hilde's story ending in Soul Calibur 4)<br>\r\n<br>\r\nIt was finished, finally. Nightmare dropped to the ground, defeated in combat by the striking warrior, Hilde. Siegfried couldn't believe that it was finally over, and that his evil had been beaten by another person. His purpose evaporating, he dropped to his knees. There was nothing more to do but demand a swift death for his sins. \"My purpose is no more. Warrior, grant me the eternal sleep of death; perhaps then I can atone for my sins.\" Hilde moved swiftly forward, and put her blade to Siegfried's shoulder. \"You fight for others, the mark of a true warrior. By the name of Wolfkrone, I hearby forgive you for your sins.\" Siegfried bowed his head. Mercy? He didn't deserve it. Mercy was for the strong, but he was weak. \"Your pity is misplaced milady. I am a cur, you ought to do away with me swiftly. Hilde smirked...<br>\r\n<br>\r\nHilde had an idea. \"You know, perhaps I can make use of you.\" Siegfried only shook his already bowed head, his emotions overtook him. \"I asked you for death, do you mock me?!\" Hilde now grew angry in return, \"I would show you mercy, you craven cur!\" She kicked the kneeling man in the chest, and he fell back hard. Before he could react, her spear's butt-end clocked him hard in the forehead.<br>\r\n<br>\r\nHe was out like a light.</span></div></div>",
            "created":1248066000,
            "id":729137,
            "title":"Siegfried is spared...For now."
        },
        "111211":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "She makes Siegfried take huge whiffs of her feet!",
                "She drops him in the royal socks."
            ],
            "content":"<div class=\"\"><div> <span>Siegfried woke up in a groggy state. He could feel a jarring headache - no doubt from that self-righteous wench's spear shaft. He got to looking around, upon the realization that he was still alive, and that he was not atop the tower of lost souls. No, this place was VERY different. It was bright, full of chocolatey browns, and brilliant scarlets. Silvers and golds lined the walls of the...massive chamber? Siegfried fell back...The room was huge! He looked up when he heard a gargantuan shuffling above. It was a gigantic iron boot! And worse still, Hilde's foot was inside it. She sat in a titan-sized throne, almost making Siegfried look like a wad of gum. \"Well, the ungrateful cur awakes.\" Her voice boomed down in a slight humour, as though she enjoyed having him tiny. Perhaps this was her version of punishment. But Siegfried feared nothing, and yelled up in rage, \"Damned witch! How have you shrunken me?!\" As though the answer would solve his problems. Hilde laughed, \"Watch your tone, worm, lest I shrink you to the size of a flea!\"<br>\r\n<br>\r\nAnd now Siegfried was powerless. His weapon was gone for one, and he was about an inch tall, at the feet of a ruler he'd insulted. Without a word, Hilde grabbed her royal boots, and tossed them off, revealing silken socks. The socks had been ruined and browned with travel however, and she pulled them off too. Siegfried soon came face to face with the worst smell he'd ever known. Hilde's feet were hands-down the cheesiest. stinkiest, most rank and foul smelling feet in the world. She had worn her boots during her long campaign against Nightmare, worn them up the tower and down, and all the way back home. Now she rested her heels on the floor, as Siegfried stared directly at the stinking soles. \"You're gonna be my foot-slave, until I decide to crush you, that is.\" Siegfried was forced to bow - the smell was overpowering, and he was totally helpless. But what does Hilde do?</span></div></div>",
            "created":1248066000,
            "id":729144,
            "title":"Hilde's Royal Feet"
        },
        "1112111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Hilde continues the torture with toes.",
                "Siegfried decides it's time to run."
            ],
            "content":"<div class=\"\"><div> <span>Hilde now looked down upon her slave, almost slavering at the thought of punishing him. \"You will now smell my feet. I want to be able to hear you sniffing them.\" Siegfried stared up, past the sweaty feet. \"You want me to what? That's absolutely disgusting!\" Hilde bent her feet further down, so that Siegfried couldn't see anything (or smell anything) but her giant feet. \"I couldn't care less. You accepted this punishment when you chose to disrespect me. Now...Smell or be crushed!\" Siegfried obeyed. He put his hands to her feet so she knew he was actually obeying, and took a huge whiff of her feet. The smell was so bad, his vision went blurry for a second. Hilde, far above, only annoyed him. \"It's tough, being in my position. Having to sit and listen to impetuous cretins insult me. Impetuous cretins who now grovel at my feet!\" Siegfried did not anger easily this time, and instead took another whiff of pure foot odor. The stench was crushing, and her feet near the floor created a hot zone - her feet were still fresh out of her boots after all. Siegfrieds hands became sweaty, but he realized that they were actually drenched in Hilde's foot sweat. </span></div></div>",
            "created":1248152400,
            "id":729659,
            "title":"Royal Smell"
        },
        "11121111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Does she step on Siegfried (lightly)?",
                "Or does she get some string, and make him a toe-ring?"
            ],
            "content":"<div class=\"\"><div> <span>Siegfried felt his hands slide over Hildes feet. At first he thought it was a slip on the wet surface, but it turned out to be Hilde, shifting her disgusting feet. She crossed a foot over her knee, then held it up to smell her own feet. She took a whiff just as Siegfried had done. \"Is this some kind of joke? You mean you don't enjoy the sweet smell of my sweaty feet? You miserable insect! I should squish you like a bug, simply for your arrogance!\" But then she smelled inbetween her toes. Normally, toes don't smell bad. However, when toes are sweaty, they smell worse than the ball of the foot (such has been my experience). \"I have a perfect idea. I'll let you fully appreciate the smell of my feet! You will sniff inbetween my toes!\" Hilde declared triumphantly. Before she put her feet back down to Siegfried, she picked him up, and laid her sweaty socks under him. She then put her feet down on the make-shift carpet, so that the soles were flat. \"I didn't want to ruin the smell of my feet by touching stone, you see. Now, get inbetween the first toe crevice, and sniff!\"<br>\r\n<br>\r\nSiegfried had put up with some terrible things in his life, some serious guilt, and real tragedy. Now, it all seemed like petty consequence compared to this. He walked between the small-and-last toe crevice on her left foot, and put his face on the fleshy web. Inhaling deepy, his lungs were filled with the vilest of odors - the royal toe odor of Hildegard von Krone. After smelling until Hilde gave the order, he eventually smelled each and every toe crevice that Hilde had. But Hilde was far from finished with her toy.</span></div></div>",
            "created":1248152400,
            "id":729666,
            "title":"Royal Toes"
        },
        "111211111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Turn him over, and step on his back!",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>While Siegfried was smelling Hilde's slimy toes, she bent down and scooped him up in her palm. He looked around, vertigo playing with his senses. Hilde grabbed his armour, and ripped it off, piece by piece. She removed all of his armour, then placed it gently on the ground. Siegfried watched, from high above, as Hilde used her heel to crush the armour to dust. Siegfried grew angry, \"How dare you destroy my armour!\" Not the least bit embarassed that he only wore undergarments. Hilde laughed, \"What? It's not as though you'll ever need it. I plan on keeping you, until you are useless to me.\" Siegfried stepped back, unsure of what to say. Is this what his life was worth? Apparently so. Hilde gently removed his undergarments as well, exposing his strangely erect member. Hilde looked down, rather impressed. \"If you weren't so small...My goodness, you're rather large, aren't you?\" Siegfried blushed a little at this, but was placed at Hilde's feet once more. <br>\r\n<br>\r\n\"Now, lie down Siegfried.\" Hilde said. He laid back on her damp, stinky socks, and watched as Hilde's huge foot descended slowly. \"Oh no, please no...\" He said to himself. But it was bound to happen. Hilde slowly stepped on Siegfried's tiny body, and he was completely under her foot. His face was stuck to the ball of her foot, and he was forced to sniff sweaty, rancid feet. Hilde ground him into the socks a bit, by twisting her foot left and right. She was enjoying this punishment very much. \"Oh Siegfried, I can feel your little body massaging my foot. Please do keep it up.\" In fact, Siegfried was doing nothing, but enduring the crushing pressure. Hilde was imposing the massage upon herself. But now that she had him under her foot, what did she want to do next?</span></div></div>",
            "created":1248238800,
            "id":730210,
            "title":"Royal Step"
        },
        "11122":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Ivy",
                "Sophitia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Ivy or Sophitia?</span></div></span></div>",
            "created":1282626000,
            "id":942677,
            "title":"Someone else."
        },
        "111221":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "She hits him with another finisher shrinking him further",
                "She hurts Siegfried very badly"
            ],
            "content":"<div class=\"\"><div> <span>Siegfried looked over at Ivy who was strolling triumphantly towards him. Something was different, she looked huge thought Siegfried. What had happened he had been fighting Ivy when she had hit him with her finisher, he should be dead. He was lying at the edge of the rocky outcrop he reached for his sword and stood up.<br>\r\nSiegfried only came up to Ivy's knees. Ivy smiled \"Like my new finisher?\" she asked <br>\r\nSiegfried swung his sword which had shrunken with him. Ivy stepped back dodging the swing, Siegfried pressed the attack swinging his sword in wide arcs trying to hit Ivy. Smiling Ivy walked back amused at the shrunken man trying to hurt her.<br>\r\nSiegfried suddenly had to block a kick from Ivy. The force of the blow sent his stumbling backwards. Ivy lashers out with her whip, it wraps around Siegfried's sword, she smiles and pulls the sword out of Siegfried's helpless hand. His sword goes flying off the cliff. Shocked at being disarmed so easily Siegfried doesn't see Ivy's whip until its too late. In half a second Ivy's whip wraps all around his body trapping his arms at his sides so he can't move.<br>\r\nIvy walks up to the trapped Siegfried what does she do?<br>\r\n</span></div></div>",
            "created":1282626000,
            "id":942683,
            "title":"Ivy"
        },
        "1112212":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "\"...Okay.\"",
                "\"Burn in hell, whore!\""
            ],
            "content":"<div class=\"\"><div> <span>          Only reaching Ivy's knees, and tied up as he was, Siegfried was helpless under Ivy's cruel gaze. The shrunken warrior was a stoic man, however,and kept his composure. Ivy took the time to taunt her miniature rival. \"Oh, look how small you are!\" she chided. Siegfried snarled in anger, \"Shut up, wench!\" Ivy's eyebrows knitted angrily. \"What did you say, worm?\" She retracted her chain blade, freeing Siegfried. He tried to run for his sword, but Ivy's boot nailed his chest hard. He was sent sprawling, gasping for breath. \"Oh, don't act like such a baby. You're wearing full plate mail!\" She walked causally over to his tiny form, looking down. As Siegfried raised his arm in defense, Ivy stomped on his chest once more. Ivy crouched over him then, and ripped his armour off. When she was done, Siegfried was clad in only his undergarments. Tossing the armour aside, she sat down on him, as though riding his tiny body. He felt the air in his lungs exit quickly. Ivy laughed, displaying her brilliant teeth. She leaned in, meeting Siegfried's eyes seductively. \"I'm going to make you an offer. I get to do whatever I want with you for as long as I want, and I'll spare your life. If you refuse.... Bad things will happen.\"<br>\r\n<br>\r\n         What did Siegfried do?</span></div></div>",
            "created":1286427600,
            "id":970621,
            "title":"She hurts Siegfried very badly"
        },
        "11122122":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "She lets him live...",
                "She kills him."
            ],
            "content":"<div class=\"\"><div> <span>       Siegfried's pride and virtue got the better of his judgement. Any man in such a predicament woud likely try to save his life.Not Siegfried! \"Burn in hell, you whore!\" Were the first words to leave his mouth. This was utterly beyond Ivy's comprehension, but at least she could knock the insolence out of him. Her smile turned to an ugly sneer. \"You're going to regret that.\" She grabbed Siegfried's arms and rose very quickly. Siegfried had not expected such a move, and was stunned briefly. Ivy's tossed him like a ragdoll. He flew through the air, and landed roughly. Ivy quickly made her way over as Siegfried tried to rise. She stomped on his back brutally, and he shouted in pain. Reaching down, her fingers wrapped themselves around his neck. She hoisted him up, choking him, and punched him in the gut. He sputtered and choked as Ivy continued to hurt him.<br>\r\n<br>\r\n        After a severe beating, Ivy let Seigfried drop to the ground. He did not stir, and was apparently unconscious. She grimaced -stupid fool got what he had coming. She placed her boot under him, and rolled him over. He really was knocked out, and bloody in more than one place. She could help him, or at least let him live. But then, the imbecile was practically asking for death.</span></div></div>",
            "created":1286427600,
            "id":970627,
            "title":"Insult Ivy? Hohoho, you fool..."
        },
        "1113":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Kilik",
                "Maxi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How bout  these two?</span></div></span></div>",
            "created":1246165200,
            "id":715437,
            "title":"More guys!"
        },
        "11131":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "The smiling face of Xianghua",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>It was a quite and peaceful day, A perfect on to meditate in fact, Which is what Kilik was doing outside, along the  mountain side. He had been meditating for quite sometime now, that was until he heard something and immediately sprang into guard mode.  Then, he saw what looked like a vial being thrown at him, seemingly out of nowhere. The vial hit the ground and broke. A strange smelling smoke started rising out of it. Kilik's head started to feel dizzy and within seconds, he passed out.<br>\r\n<br>\r\n<br>\r\nWhen Kilik came to, he noticed that he was in a house, on a table, a  rather large table, in fact, everything seemed a lot bigger. Kilik observed his surroundings a little longer, until he heard a voice from behind him.<br>\r\n<br>\r\n\"Ah, I see your finally awake.\"<br>\r\n<br>\r\nKilik turned around and saw....</span></div></div>",
            "created":1246165200,
            "id":715467,
            "title":"Kilik"
        },
        "111311":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Put her barefeet on the table, in front of Kilik",
                "Picked Kilik up and put him between her breasts"
            ],
            "content":"<div class=\"\"><div> <span>Kilik couldn't believe his eyes....<br>\r\n<br>\r\nKilik was now staring at the smiling face of Xianghua.<br>\r\n<br>\r\nNo, correction, of a GIANT Xianghua. Nothing good can come out of this. <br>\r\n<br>\r\n\"Xianghua, is that you?\" Kilik asked, still amazed at what he was seeing<br>\r\n<br>\r\n\"Of course it's me.....I mean if it looks like me then it must be me\" Xianghua giggled. <br>\r\n<br>\r\n\"How did you get so big?\" Kilik asked.<br>\r\n<br>\r\n\"I didn't get big, you just got small silly.\" Xianghua giggled.<br>\r\n<br>\r\n Kilik was now getting angry, here he was shrunken and Xianghua acted like it was some sort of a game.<br>\r\n<br>\r\n\"Well, can you tell me what the hell is going on!\" Kilik shouted.<br>\r\n<br>\r\n\"Isn't obvious, I shrunk you.\" Xianghua replied<br>\r\n<br>\r\nKilik couldn't believe what he just had heard,<br>\r\n<br>\r\n\"What? But....Why?\" Kilik questioned. <br>\r\n<br>\r\n\"Because, You have been training  and working so hard, I figured you needed a bit of playtime\" Xianghua smiled. Kilik stared at her with amazement. That's why she shrunk him, so she could play with him! <br>\r\n<br>\r\nXianghua seemed to have sensed Kilik's frustration and said \"Oh calm down Kilik, it's not permanent.\" Kilik breathed a sigh of relief when he heard that.<br>\r\n<br>\r\n\"Besides, you looks so cute at that size\" Xianghua giggled. Kilik sighed and thought it was best to just play along with her.<br>\r\n<br>\r\n\"Alright Xianghua, lets get started.\" Kilik said.<br>\r\n<br>\r\nXianghua smiled and then.....</span></div></div>",
            "created":1247547600,
            "id":724835,
            "title":"It's Playtime!"
        },
        "1113111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Rub  them",
                "Smell them"
            ],
            "content":"<div class=\"\"><div> <span>Xianghua then put her formally petite feet and are now as big as Kilik. Kilik face then turned red and was blushing. He had always liked Xianghua's feet but didn't want Xianghua or anyone else to know about it....<br>\r\n<br>\r\n\"Er....What makes you that I would like this.\" Kilik said, blushing.<br>\r\n<br>\r\n\"Well Kilik I think it has to do something with the fact that you always seem to stare at my feet when they were bare when were where traveling together.\" Xianghua said, rolling her eyes. She then smirked. <br>\r\n<br>\r\n\"And of course there was also the time you gave me that foot massage\" Xianghua said smirking.  Kilik face now resembled a tomato. He remebered what had happened, Xianghua had been complaining about foot aches and Kilik offered a foot massage. Xianghua accepted and she feel asleep during the massage. In which Kilik had decided to take advantage of and started to worship her feet. He was pretty sure that she didn't know...Unknown to him, she had woken up around the beginning and had pretended to be asleep.<br>\r\n<br>\r\n\"Er....how long were you awake?\" Kilik asked.<br>\r\n<br>\r\n\"Around what I might think the third sniff or so\" Xianghua giggled as she wiggled her toes teasingly at him. \"So tell me, do my feet smell as good big as they do small?\" Xianghua giggled.<br>\r\n<br>\r\nKilik took a few sniffs in the air and smelled the nice scent of Xianghua's. He then walked closer to her feet in order to....</span></div></div>",
            "created":1247547600,
            "id":725071,
            "title":"Kilik's fetish"
        },
        "11131111":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"I would like to lick your feet\"",
                "\"I would like it if you sandwiched me between your feet\""
            ],
            "content":"<div class=\"\"><div> <span>Kilik decided to walk up and feel Xianghua feet, via rubbing. As he got closer, the smell intenseified, much to his pleasure. He finally arrvied at Xianghua's cute feet. He then pressed his body against them, giving them a rubbing sensation. They felt rather hot and must have been in her foot ware in sometime. He pushed himself into her right foot and buried his face in it, and used his hands to give her a mini-massage and he then did the same thing to her left foot.<br>\r\n<br>\r\n\"Ohhh Kilik that feels good.\" Xianghua moaned. Kilik smiled. He was glad that he was making Xianghua happy and was also glad to be rubbing her cute feet. \"I'm glad you like this Xianghua, thanks for letting me play with your feet\" Kilik said, blushing as red as a tomato. \"Your welcome Kilik, I knew you would like it\" Xianghua giggled. After a while, Kilik stopped rubbing her feet \"So what do you want to do next?\" Xianghua said, while wiggling her toes teasingly at Kilik .<br>\r\n<br>\r\nKilik blushed and said....</span></div></div>",
            "created":1248325200,
            "id":730975,
            "title":"Xianghua's massage"
        },
        "111311112":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Put his head between her toes",
                "Picked him up and put him in her undergarmets"
            ],
            "content":"<div class=\"\"><div> <span>\"I would like it if you sandwiched me between your feet\" Kilik said in an embarrassed and low tone, blushing . \"You want me to what?\" Xianghua said, in a playful tone, smiling and pretending not to hear him. \"I said that I want you to sandwich me between your feet\" Kilik said in a regular voice volume but still kept an embarrassing tone and still had a blush on his face. \"Huh, I still can't hear you.\" Xianghua said, trying to keep her giggles in. Kilik started to get annoyed and for whatever \"I SAID THAT WANT YOU TO SANDWICH ME BETWEEN YOUR FEET!\" Kilik yelled but then closed his mouth in embarrassment and his face now resembled a tomato from all of the blushing he did. He then somehow managed to blush even harder as he realized that he had been tricked by Xianghua, as Xianghua had just burst into giggles. \"Okay, if you really want me to.\" She said, still giggling.<br>\r\n<br>\r\nBefore Kilik could even react, Xianghua  brought her right foot in front of him and her left foot behind him and before Kilik knew it, she slammed her feet together. With him being in the middle.  Needless to say,  Kilik felt like he was in heaven, and it was going to get better. Xianghua then started to wiggle her toes on his head. Kilik's pleasure was increasing more then ever and  he had a hard time controlling it ever since this thing started and the position he was in did not help matters in controlling it.<br>\r\n<br>\r\nIn the next few moments however, Kilik will have perhaps the most pleasant experience of his lifetime. Xianghua had just started to rub her feet up and down on Kiliks body. Due to the fact that his entire body was in between Xianghua's feet, Kilik was becoming rather....aroused by the situation. Needless to say, Xianghua noticed it by feeling it. She was not mad however and started to giggle, saying \"Wow Kilik I knew you liked my feet but I didn't you liked them this much.\" Kilik once again started to blush. \"Oh don't be embarrassed about it Kilik, I kinda find it cute\" Xianghua said with a smile. After a few more minutes of rubbing Kilik up and down her feet, she somehow manage to get him to turn in a 360, so that he was facing her left sole. Once agian, she started to wiggle her toes on his head and rub her feet up and down them.<br>\r\n<br>\r\nAfter a couple minutes of playing with Kilik, she released him, much to Kilik's disappointment (which he showed via frowning), which Xianghua giggled at. \"Oh don't worry Kilik, I have something fun planed\" Xianghua said as she.....</span></div></div>",
            "created":1255496400,
            "id":775464,
            "title":"A foot sandwich is the best kind of sandwich!"
        },
        "1113111122":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What side<br>\r\n<br>\r\nfront <br>\r\nor<br>\r\nback</span></div></span></div>",
            "created":1280898000,
            "id":929753,
            "title":"Picked him up and put him in her undergarmets"
        },
        "11131111222":{
            "author_id":"crazyethin",
            "author_name":"Ethin",
            "choices":[
                "She forgets about him",
                "She gets him out"
            ],
            "content":"<div class=\"\"><div> <span> Xianghua picked him up and moved him to her face \"well I think it's time for bed. But I need to put you somewhere you can't get out...oh I know!\" she looked at him with a big smile \"oh your going to love this\". With that she pulled down her pants and thong. With her free hand she spread her ass cheeks and lowerd him down behind her right infront of her ass. \"This is going to be so much fun\" she giggle and looked back at him with a big evil smile.<br>\r\n<br>\r\n\"First stop my anus!\" she yelled and slowly moved him to her asshole \"NO WAIT DONT DO THI-\" he was cut off by her sticking him in head first. He was now half way in \"well all the way in you go\" with her index finger she pushed him in the rest of the way. \"Ohhh you feel good in there I think you will be spending lots of time with my big butt\" she smiles and rubs her ass cheeks. Kilik tryd to stand up but the inside of her anus was to slipery and was really smelly \"hm I feel you trying to move around in there keep it up it feels great\" she begins to lay down in her bed \"I hope I don't forget about you in the morning have fun kilik\" with that she drifted off into a great sleep. <br>\r\n<br>\r\nKilik tryed to stand again and finaly got a foot hold he then tryed to push thro her asshole again but it was no use. Xianghua rold over in her sleep and  made him tumble further into the dark cave now he didn't know where he is. \"Oh god I need to get out of here but witch way it the right way!\". Kilik was lost in her anus.  </span></div></div>",
            "created":1280898000,
            "id":929762,
            "title":"Back"
        },
        "11132":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Yes, I want Maxi to be shrunk",
                "No, I want someone else to be shrunk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maxi? or perhaps someone else?</span></div></span></div>",
            "created":1246165200,
            "id":715439,
            "title":"Are you sure"
        },
        "111322":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "The Apprentice ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Apprentice? Or someone else?</span></div></span></div>",
            "created":1287205200,
            "id":975927,
            "title":"The Apprentice?"
        },
        "1113221":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "The fight continues",
                "The fight continues"
            ],
            "content":"<div class=\"\"><div> <span>You disengaged your lightsaber and stepped past the ruined body of the beast called Nightmare. Even at your current size you had been able to overcome the monster and after the quick butcher of Nightmare you ascended further up the Tower of Remembrance. You were fit but the stairs took longer than you had wanted, your search for the fabled sword Soul Edge had lead you to this tower were other supposably skilful warriors also sought the power of the sword, none had been a challenge for you. Something had caused you to shrink when you entered the tower your force powers reacted badly to the towers magic and now you stood at only 3 feet, your clothing and lightsaber had shrunk with you.<br>\r\nYou reach the top of the stairs and find yourself in a large circular room with big stained glass windows. The beauty of the Spiral of Time was lost on you as you started to cross the room, drawn to the power that lies above in the tower. Suddenly you hear footsteps behind you. You turn around and activate your lightsaber. A girl holding a short sword and pink shield is walking towards you. <br>\r\n\"Hay shortie, get out of my way. I've got big person stuff to do\" Said Cassandra <br>\r\nYour lip curls into a smile \"Die bitch\"<br>\r\nYou jump forward lightsaber humming Cassandra barely gets her shield up in time, she counter attacks with a swing from her sword you jump backwards. Cassandra is twice your height but that is no real problem to you. The arrogant girl will die. Cassandra steps forward and tries to kick you with her white boots, you jump her kick and grab her shield and try to stab her face, you miss barely and land behind her. Your speed was still an advantage. Cassandra turned and swung low, you blocked the blow.<br>\r\n</span></div></div>",
            "created":1287205200,
            "id":975941,
            "title":"The Apprentice vs Cassandra"
        },
        "11132211":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "More fighters enter distracting Cassandra ",
                "Cassandra had some fun with you "
            ],
            "content":"<div class=\"\"><div> <span>Stabbing upwards you connect harmlessly Cassandra's shield, grabbing your shield you swing yourself up and over Cassandra hacking at her armoured shoulder as you pass. You were about to land when Cassandra's boot came up and hit you in the chest lifting you into the air. As you fall Cassandra jumps backwards smashing her butt into your back. You had the wind knocked out of you and you were sent skidding across the floor.<br>\r\nDazed you stood up but had to quickly parry more blows from Cassandra, she was crouching to fight you. You couldn't get enough air back into your lungs, Cassandra caught you off guard when she hit you with her shield, your guard was broken and Cassandra loomed above you. <br>\r\nCassandra jumped into the air she hit you in the face with the butt of her sword and shield at the same time. You stumbled back, through hazy vision you saw Cassandra's butt right before it collided with your face. You landed flat on your back, you took a breath only to have it crushed out of you as Cassandra landed on you torso, her butt covered your whole torso.<br>\r\n\"You like this kind of stuff, don't you?\" taunted Cassandra as she stood up<br>\r\nCassandra jumped again but this time she landed on your face, her whole body weight smashed into your head. Your whole body aced once Cassandra stood up, you desperately gasped for breath. Cassandra stood over you with hands on hips, smiling.<br>\r\n</span></div></div>",
            "created":1287205200,
            "id":975958,
            "title":"The fight continues"
        },
        "111322111":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Yet another fighter enters",
                "Something else happens "
            ],
            "content":"<div class=\"\"><div> <span>Cassandra looks away suddenly, more fighters have arrived. <br>\r\n\"I'll finish you later\" She said before running over to the melee<br>\r\nDespite your bodies protests you roll onto you chest and see Cassandra running into battle against her sister in a white dress Sophitia and a third opponent Taki. You watch the three way fight for a minute, none of the girls seem to be able to gain an upper hand. You reach out and grab your lightsaber standing up you run to rejoin the fight determined to enact revenge against Cassandra.<br>\r\nYou jump and kick Sophitia in the back of the knee causing her to fall over on top of you. You try and stab her but she rolls away. Taki comes to attack you but Cassandra engages her first. Seeing Cassandra open for attack you make your move. You jump and slash at her face but she dives out of the way. You get turned around by a hand on your shoulder, you are face to face with Sophitia's white clad crotch, when she grabs your head and lifts her legs over your shoulders. Before bending you backwards and pulling your face right into her white panties. Her thighs are either side of your head, she shifts them around mashing your helpless face between them. Then Sophitia jumps into the air pulling you with her. Your face is buried under her crotch and butt upon impact. Looking up you see Sophitia fighting Taki above you. The head damage you've taken is taking its toll. You can't concentrate and are being dominated by the women in this fight.<br>\r\nYou get lifted off the ground by Taki who kicks you over to Sophitia, who grabs you head and rams it into her knee. You stumble backwards and drop to you knees, your looking at Cassandra's shins. She nudges you onto your back before she jumps into the air, you know what’s coming but don't have the energy to stop it. Cassandra's butt lands on your face knocking you out, the girls continue to fight.<br>\r\nYour body gets knocked aside, your fate to be decided by the victor of the fight.<br>\r\n</span></div></div>",
            "created":1287205200,
            "id":975976,
            "title":"More fighters enter distracting Cassandra "
        },
        "1113221112":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Stay and fight Taki",
                "Go after Cassandra"
            ],
            "content":"<div class=\"\"><div> <span>You open you eyes slowly. You see the three women fight a few feet away from you, you can't see your lightsaber so you decide to stay down. Better to try and save your energy. The girls still seem to be fighting strongly so attacking them would probably end badly for you again. Suddenly the tower starts to shake and crack a giant diamond shard falls through the room crashing through the rock floor and down into the rest of the tower. You realise the tower is collapsing. You look up and see a diamond rock coming towards you. Drawing on the power of the force you send lighting into the diamond which causes it to explode raining diamond down on you. However the use of your force powers caused you to shrink again, to your horror you realised that you only stood at 12 inches or 1 foot. More shards were falling through the room creating great holes through the floor. You saw Taki running at you followed closely by Cassandra. Taki picks your helpless body up and throws you through one of the glass windows which she jumps through after you followed by Cassandra. <br>\r\nYou turn and see the ground approaching and try to think of a way to land but Taki takes care of that for you. As your falling she grabs you around the back and pulls you into her ample breasts, she holds your arms by your sides and your head is stuck in between her breasts. You try and struggle by Taki is too strong for you in you shrunken state. Being a ninja Taki is able to land the fall from the tower with ease, she doesn't let you go though instead she pushes your head further into her cleavage with her free hand. You’re too weak to stop Taki with brute strength so you use the force. You force push Taki away from you and she lands in some rubble. You remained the same height because you were no longer in the tower, looking around you see Cassandra leaving the battle. You want to get her because she was the one who bested you in the tower.<br>\r\n </span></div></div>",
            "created":1287205200,
            "id":976293,
            "title":"Something else happens "
        },
        "11132211122":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Attack now",
                "Someone comes up behind you"
            ],
            "content":"<div class=\"\"><div> <span>Your hate fuels your chase as you follow Cassandra for several hours. It's hard work but by midday Cassandra had stopped in a forest clearing. The clearing had a clear pool of water surrounded by sand and rocks. You stayed on the edge of the forest as Cassandra stripped naked and went for a swim. The foolish girl had left her weapons with her cloths now was your chance to strike while she was unarmed.</span></div></div>",
            "created":1287205200,
            "id":976299,
            "title":"Go after Cassandra"
        },
        "111322111221":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Cassandra's shield",
                "A rock"
            ],
            "content":"<div class=\"\"><div> <span>Using the force you run and jump from a rock towards Cassandra. She looks shocked to see you land your kick right in the middle of her chest, the force of your blow sends her under the water. You realise how deep the water is and start to swim for the shallows but Cassandra quickly catches up to you. She pulls you into her naked body. While she swims she holds you face first to her belly. The only thing you can see is Cassandra's smooth belly and the feel of her soft skin. The toll of the day has gotten the better of you, too weak to fight and with no energy to call upon the force you are helpless and at Cassandra's mercy.<br>\r\nYou get dragged onto the beach and to your surprise Cassandra lets you get up. She is standing a few meters away from you still naked but ready to fight without her weapons.<br>\r\n\"Let’s finish this\" She said<br>\r\nThe rage boiled over inside you, this girl was mocking you if you could you would relish in her slow and painful death.<br>\r\n\"I will destroy you\" You roared<br>\r\n\"Just don't cry when you lose\" Cassandra mocked <br>\r\nCassandra jumped and kicked at you. You rolled away and punched her in the calf. But you were too slow to dodge Cassandra's hand as she grabbed you and lifted you off the ground. She threw you into the air turned around and jumped backwards causing her butt to collides with your body. You landed on something hard to was....<br>\r\n</span></div></div>",
            "created":1287205200,
            "id":976311,
            "title":"Attack now"
        },
        "1113221112211":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "content":"<div class=\"\"><div> <span>You look around, you had landed in the middle of Cassandra's shield. The shield sloped down on you from all sides and was a bit longer than you were. Cassandra appeared above you still naked she smiled down at you.<br>\r\n\"You know I use this shield as a seat sometimes\" she said<br>\r\nYou try and get up but Cassandra puts her knee on you torso which keeps you pinned down, she grabs your arms and holds them by your sides while she does the strap up around you. Then she holds your legs and does the other strap up around them, then she stands over you. You can't move the straps are holding you in the middle of Cassandra's shield, she disappears for a moment and returns clothed she smiles. You shudder with fear for the first time as Cassandra turns around and starts to lower herself onto her shield. Cassandra's red panties and white butt cheeks are the last things you see before you are plunged into darkness. The seal Cassandra's ass makes with her shield is air tight so you can't breath. You scream desperately only to have them drown out by Cassandra's butt.<br>\r\n<br>\r\nCassandra bounced childishly on her shield a couple of times. The Apprentice could not escape his small body was no match for her. Cassandra listened to the muffled screams coming from below her as she pulled her white boots back on and sat doing up her blue coat. She did donuts on her shield just to pass the time and make the Apprentice's last moments more humiliating for him. Cassandra remained sitting for several minutes after the last cries and squirming from the Apprentice had stopped before she stood up. Her butt had an impression of the Apprentice on it, Cassandra undid the restrains on the Apprentice and let the body fall onto the ground she played with the body with her foot for a moment before she stepped over it and continued her journey home.<br>\r\n</span></div></div>",
            "created":1287205200,
            "id":976332,
            "title":"Cassandra's shield"
        },
        "1113221112212":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "You make it to the forest",
                "Cassandra catches you "
            ],
            "content":"<div class=\"\"><div> <span>You didn't know how it had happened but somehow you landed on a flat rock above Cassandra. Despite aching muscles and likely broken bones you crawled to the edge of the rock to look at Cassandra. She was getting her cloths back on and collecting her weapons getting ready to come after you. <br>\r\nYou looked around and saw that the rock lead straight into the forest and it's thick undergrowth. Crawling you start to make your way towards the forest. However you realised that you were more injured than you thought, your chest burned from several likely broken ribs and you were sure that one of your legs was badly broken. Desperately you crawled towards the forest oblivious to any danger you might be in.<br>\r\n</span></div></div>",
            "created":1292913900,
            "id":1019388,
            "title":"A rock"
        },
        "11132211122122":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Walking away",
                "Just standing over your broken body "
            ],
            "content":"<div class=\"\"><div> <span>Unknown to you Cassandra had caught up to you. She slowly walked up behind you watching with pleasure as you tried to crawl away. Cassandra's heel smashed into your back. The sole of her boot pinned you to the ground while the heel crushed your unbroken leg. Weakly you tried to pull yourself away from Cassandra. You screamed as Cassandra started to put more weight onto your body. Your head was forced to the side and gave you a view along the long leg of Cassandra. She smiled looking at your face as she applied more weight on your body, you were about to be crushed under the dirty sole of the girl who had humiliated several times already today. Suddenly the pressure stopped but the pain didn't. Looking at Cassandra you saw her....<br>\r\n</span></div></div>",
            "created":1292916480,
            "id":1019411,
            "title":"Cassandra catches you "
        },
        "111322111222":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Sophitia",
                "Taki or someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who comes up behind you?</span></div></span></div>",
            "created":1287723600,
            "id":979083,
            "title":"Someone comes up behind you"
        },
        "1113221112221":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Keep playing in the sand ",
                "Go play in the water"
            ],
            "content":"<div class=\"\"><div> <span>You hear a twig break behind you. You spin around just in time to see a bear foot connect with your body. The force of the blow sends you flying out of the forest and onto the sandy beach. You land near Cassandra's clothes. But her clothes aren’t the only ones in the pile. You see the white dress of Sophitia and her brown sandals lying in the pile. Cursing yourself for not paying more attention you stand up and spit the sand out of your mouth, snarling at the approaching Sophitia.<br>\r\n\"Hay sis, look who was spying on you\" Said Sophitia <br>\r\nApparently the sisters had returned to good terms after the tower had collapsed. Cassandra emerged from the water behind you her older sister stood naked a few feet away from you.<br>\r\n\"Looks like he can't get enough of me\" Said Cassandra <br>\r\nYou stood ready to fight between the two naked sisters. Cassandra started to advance behind you, running at Cassandra you jumped high into the air using the force to propel yourself upwards you came face to face with Cassandra. Lighting danced across your fingers as you readied to blast the brats face. Suddenly you were grabbed from behind by Sophitia and thrown onto the sand. Cassandra and Sophitia both lifted their feet above you. You watched as their feet came down on you. The soft soles pushed you into the sand creating a hole abound your body. <br>\r\n\"This is too easy\" Laughed Sophitia <br>\r\n\"Even weaker than when he was in the tower\" Chimed in Cassandra <br>\r\nAs there feet came down again you used a massive amount of force energy. The force of the attack threw both the girls off their feet and created a giant hole around you. It was here you lied too tied to move when the girls appeared over the edge of the hole. They smiled at each other before they jumped into the hole. A giant wave of sand covered you for a moment before you pulled your head above the sand. You looked around, to your horror you saw Cassandra sitting on her side next to you. Her naked body towered above your small form. Behind you Sophitia was lying on her side one of her huge breasts rested just a few inches from your body. Smiling Cassandra pushes you into Sophitia's breast, you struggled as Cassandra moved you in-between Sophitia's boobs. Then Sophitia took over she held you in-between her breasts and rolled onto her stomach. Her breasts sunk into the sand but you were trapped firmly in-between them trapped by sand and flesh movement was impossible and escape futile. You hear Casssandra and Sophitia laughing at your current situation. What do Cassandra and Sophitia do next?<br>\r\n</span></div></div>",
            "created":1287723600,
            "id":979091,
            "title":"Sophitia"
        },
        "1113222":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Yes",
                "No, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A custom character to be described in story......</span></div></span></div>",
            "created":1302595080,
            "id":1086683,
            "title":"How about a custom character?"
        },
        "11132221":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Shura",
                "Ivy"
            ],
            "content":"<div class=\"\"><div> <span>Mark (custom character) slipped through a crack in a wooden plank to be standing on the sunny deck of a half ruined ship. He was immediately taken aback by his surroundings for one they were huge, but looked the same as any ship he would encounter in his world.<i> The quest to destroy this Soul Edge is taking me to strange places </i>Mark thought. Mark reached the edge of the ship's ruined deck; he gazed toward the land mass that it lowly floated towards, beyond that lie the tower where his destiny would be decided. Mark must only been around 6 inches tall judging by the way he sized up against the ship's rail. Mark cracked his knuckles, flexed his neck and rolled his shoulders, something with power was approaching. His first test in this new world was near.<br>\r\nThe door from the captain's cabin opened and out of it stepped.....<br>\r\n</span></div></div>",
            "created":1302595980,
            "id":1086686,
            "title":"Even the small seek the swords"
        },
        "111322211":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "Take the blow like a man",
                "Dive off the ship"
            ],
            "content":"<div class=\"\"><div> <span>Mark was so taken aback by the giant woman who walked through the doors that he almost fell off the ship. Shura dressed in all black with her twin swords was also surprised by thin man without a weapon that opposed her. She walked about half way along the deck before she spoke.<br>\r\n\"What are you doing here? Leave before I have to squash you\" Shura said <br>\r\nMark lowered his head and felt his energy flow through himself, \"You are evil and good always wins\" Mark said (His voice carries fine)<br>\r\n\"This will be fun\" Shura said as she took up her fighting stance.<br>\r\nMark sprang forward and into the air so quickly that Shura was unable to react to his attack. Mark punches Shura right in the chest, Shura gets knocked down and thrown back several feet, Mark lands in a crouched position back on the deck. \"I will destroy you\" Mark said.<br>\r\n\"This willl be interesting\" Said Shura smiling relishing the battle to come.<br>\r\n<br>\r\nMark and Shura exchanged blows as if one was not more than 15 times bigger than the other. Mark would jump around and attack Shura around the waist and sometimes he would go for her head, when he landed Shura would bring her Katarnas down on him. For his part Mark could only dive out of the way of his would be killers. Mark leaped again this time he landed a strong kick on the inside of Shura's hip. However as Mark pulled away from the skin his foot momentarily got caught around Shura's underwear strap. The sudden delay caused Mark to lose control mid air. As he fell Shura was lining up a kick; she to wound her leg back. As Mark was falling he saw the giant foot approaching fast, he managed to twist his body to take the blow.<br>\r\nUpside down in mid air formed a cross with his arms in front of him just before Shura's foot connected with his body.<br>\r\nMark was blasted along the wooden deck, his vision was spotty. Mark had stopped moving on an outstretched plank of wood, which was hanging above the sea.<br>\r\n\"Can you take this?!\" Shura said as she jumped high into the air above the disorientated Mark.<br>\r\nMark looked up he didn't see Shura, and then the sun was blocked out above him. He didn't have any where to go; Mark didn’t have any time either had to take the blow or dive of his plank of wood.<br>\r\n</span></div></div>",
            "created":1302599100,
            "id":1086695,
            "title":"Shura the Giantess"
        },
        "1113222111":{
            "author_id":"firefly32",
            "author_name":"crazyhood",
            "choices":[
                "He has been crushed flat",
                "Readers Choice "
            ],
            "content":"<div class=\"\"><div> <span>Mark meekly raised one arm but it did little to stop the crushing blow of Shura's giant Katanas. Shura watched as the tiny Mark crawled forward then she squatted down right in front of him. \"I'm not impressed\" She taunted.<br>\r\nSuddenly Mark shot forward and punched Shura right in the jaw. Shura slipped over onto her bum. Mark lunged forward again; he was aiming to kick Shura between her breasts. But Mark evidentially didn't think about his action, while his kick connected and he felt the satisfaction of feeling bone under the flesh. Shura smashed her breasts together crushing Mark in-between them. Then she stood up and released her breasts a shocked Mark fell out from in-between them. Shura then kneed the tiny Mark. Shocked and dazed Mark flew out of control threw the air. <br>\r\n\"You like being humiliated, right?\" Shura said as Mark fell towards her breasts.<br>\r\nShura leaned back and pulled her breasts apart so that there was plenty of space for Mark to land.<br>\r\nAs Mark plummeted towards Shura he saw her breasts spread ready to recieve his body. He also saw that her hands were burning in fact so were her breasts. Mark landed in the centre of Shura's breasts; the two giant walls flamed around him. He had just enough time to say \"No\" before the giant breasts smashed him. Shura smiled into her cleavage as she mushed her boobs together. Mark made funny squishing sounds from inside the consuming cleavage of Shura.<br>\r\nWhat has happened to Mark?<br>\r\n</span></div></div>",
            "created":1302608100,
            "id":1086737,
            "title":"Take the blow like a man"
        },
        "11132222":{
            "author_id":"koopish",
            "author_name":"hoshi",
            "choices":[
                "yes",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about kilik's son, xiba?</span></div></span></div>",
            "created":1605175140,
            "id":2938842,
            "title":"Xiba"
        },
        "112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Xianghua?",
                "Ivy?",
                "More girls!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so you like tiny girls. Which little girl do you like most?</span></div></span></div>",
            "created":1244264400,
            "id":703361,
            "title":"A girl shrinks"
        },
        "1121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Mitsurugi",
                "Kilik",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>          Xianghua was travelling through a mountain pass one day, in her search for Kilik. She wanted to find the man she loved, Kilik was always there; compassionate and patient, the one she wanted. She looked up at the bright sun, and felt funny... A blinding flash of light occured, and all went to white.<br>\r\n<br>\r\n          Xianghua was woken by hitting the side of a metal object in a jarring impact. She looked around groggily, only to find that she was in a bird-cage! She wanted to yell, but that might attract the attention of her captor. She couldn't go through the bars of the cage, because she would fall quite a distance to her death. She went to the edge of the cage, and found that her captor was...   </span></div></div>",
            "created":1244264400,
            "id":703374,
            "title":"Xianghua?"
        },
        "11211":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "He takes her home for some fun.",
                "He does something else."
            ],
            "content":"<div class=\"\"><div> <span>Xianghua saw that her captor was none other then the famous samurai Mitsurugi. \"Hey! Just what do you think you're doing!\", she yelled up at him.\" Mitsurugi apparently heard her, for the cage swung up to his face. The motion knocked Zianghua off her feet, and left her staring indignantly at an ogling samurai. \"Nice panties you're wearing there.\" Xianghua blushed, and pulled her skirt down. \"How rude!\" Mitsurugi only grinned, looking her over. \"Yes, you'll make a nice little pet, my dear.\" Xianghua wasn't yet ready to give up. \"You can't just shrink me and expect to get away with it!\" Mitsurugi laughed, \"And who's going to stop me?\" The powerless girl knew. \"Kilik will stop you! He'll find me, and knock you flat!\" The swordsman shook the cage, knocking Xianghua down once more. \"We'll see about that, my pet.\"<br>\r\n<br>\r\nBut what were Mitsurugi's intentions? What would he do with his tiny, helpless captive?</span></div></div>",
            "created":1244437200,
            "id":704837,
            "title":"Mitsurugi!"
        },
        "112111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Take advantage of her?",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Mitsurugi found his way home, with his little birdie in tow. He placed her cage on a table, while he undressed and got a drink. Xianghua pounded on the bars of the birdcage, but it was for naught. In moments, Mitsurugi returned, armourless, shirtless, half-naked really. He had a bottle of alcohol in his hand, and he took large swigs. Deciding that this wasn't enough, he left, and returned with three more bottles. Placing them on the table, he opened up the birdcage. Xianghua was terrified, and couldn't resist as a huge hand grabbed her. Mitsurugi looked at her lustily, taking in her form. \"Yeah, you're a nice lookin' girl huh?\" Before Xianghua could respond, he tore off her clothes in a snap. The exposed girl fell back in the palm of his hand, and he grasped her tightly.</span></div></div>",
            "created":1244523600,
            "id":705382,
            "title":"He takes her home for some fun."
        },
        "1121111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "He takes things a step further."
            ],
            "content":"<div class=\"\"><div> <span>Mitsurugi started rubbing his thumb up and down on Xianghua's breasts. With his other hand, he pulled down his pants. He began masturbating while playing with the tiny girl. Xianghua couldn't do anything but sit back and take it. She was turned on by the fondling, but scared of the giant who had captured her. Mitsurugi was getting off quite well with his new slave, but he wondered if it would be enough.<br>\r\n<br>\r\nMitsurugi brought Xianghua up to his face, and started to kiss and lick her. She gagged at the scent of alcoholic breath, and was drenched in the scent from his saliva. Soon enough, she felt his tongue touch her danger zone, and she yelled out at him, \"Hey! Who do you think you are!?\" He leaned in close, panting from masturbation, \"Your master, so get used to it!\"</span></div></div>",
            "created":1244523600,
            "id":705388,
            "title":"Take advantage of her?"
        },
        "11211111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "He comes.",
                "This is disgusting, something else happens!"
            ],
            "content":"<div class=\"\"><div> <span>Mitsurugi decide to escalate events, and please himself at the same time. He brings Xianghua, still in hand, to his member, and continues masturbating; Xianghua being rubbed up and down on it. Xianghua becomes dizzy, and can't think straight. She is slightly chafed by being used as a tool of pleasure. She couldn't believe this was happening to her, the smiling, wonderful girl she was. What did she do to deserve it? And surely this brutish samurai wouldn't let her go easy, he probably never would. She could smell it - the odor of groin, it made her gag. She was now being physically hurt, her body being thrown up and down like a ragdoll, and still tightly clenched. Above, she heard Mitsurugi's husky voice, \"I bet you like that, don't you, my little doll.\"</span></div></div>",
            "created":1246338000,
            "id":716865,
            "title":"Completely Unecessary"
        },
        "1123":{
            "author_id":"lweldon",
            "author_name":"deathdemon",
            "choices":[
                "Talim",
                "Seung-Mina",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Lady Shrinks?</span></div></span></div>",
            "created":1272085200,
            "id":872625,
            "title":"More girls!"
        },
        "11233":{
            "author_id":"lweldon",
            "author_name":"deathdemon",
            "choices":[
                "Sure",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Hephastuses' daughters?</span></div></span></div>",
            "created":1272171600,
            "id":873386,
            "title":"Greeks"
        },
        "112331":{
            "author_id":"lweldon",
            "author_name":"deathdemon",
            "choices":[
                "One of them",
                "Both, the more the merrier"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of them, or Both?<br>\r\n</span></div></span></div>",
            "created":1272171600,
            "id":873387,
            "title":"Daughter/Daughters"
        },
        "1123311":{
            "author_id":"lweldon",
            "author_name":"deathdemon",
            "choices":[
                "Cassandra",
                "Sophitia"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one will shrink?</span></div></span></div>",
            "created":1272171600,
            "id":873389,
            "title":"Solo Shrink"
        },
        "12":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Kilik",
                "Yun-Seong",
                "Raphael",
                "Maxi",
                "More Guys!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What guy do you want to be found tiny?</span></div></span></div>",
            "created":1244264400,
            "id":703365,
            "title":"Gay (Homosexual)"
        },
        "121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Yun-Seong",
                "Siegfried",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>             Kilik was meditating that night, attaining perfect harmony with nature. However, as hard as he tried to concentrate, his mind kept wandering. Something in the air was distorting him, his head wasn't clear. Failing, he took a walk to get some fresh air. Walking alone, he went into the woods; perhpas there he could find harmony.<br>\r\n<br>\r\n            As Kilik walked, his head began to hurt. Some throbbing pain entered his head, and he began to lose consciousness. His vision spun, and as he fell to the ground, the last thing he saw was a blurry image of a male. Waking shortly after, he found himself at the feet of...</span></div></div>",
            "created":1244264400,
            "id":704898,
            "title":"Kilik"
        },
        "1212":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Siegfried makes Kilik worship him (feet)",
                "Siegfried takes a bath with his new playmate",
                "Siegfried does something else."
            ],
            "content":"<div class=\"\"><div> <span>Kilik found himself at the booted feet of Siegfried, not necessarily a good thing. \"What have we here?\", he asked mockingly. \"A tiny man? And all by himself too. Don't worry, I'll keep you safe.\", he said with a glint in his eye. Kilik tried to run, but an armoured fist grasped him tightly. \"Let me go, monster!\" Kilik's cries were in vain. Siegfried put a finger to Kilik's mouth, \"Hush little one, like I said, I'll keep you safe...\" With that, he placed the wriggling Kilik into a small satchel on his belt. Patting the satchel twice, he left for home. <br>\r\n<br>\r\nKilik was trapped in a tiny sac, trying desperately to escape. He had no weapon, nothing to cut himself out, and nothing to do but wait. Why would this man capture him though? What did he do wrong? He wracked his brain for an answer, but it seemed unprovoked. If that was the case, Kilik knew for sure that he was in trouble.<br>\r\n<br>\r\nSiegfried finally made it to a little cottage in the woods, his temporary home. As he walked through the front door, he faced the decision of what to do with his little toy.</span></div></div>",
            "created":1244437200,
            "id":704913,
            "title":"Siegfried"
        },
        "12121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Worship his feet!",
                "Lick his boots!"
            ],
            "content":"<div class=\"\"><div> <span>Kilik heard many sounds from inside his prison, none of which he liked. There was the sound of a door closing, the sound of armour straps being undone, the sound of pieces of armour being dropped to the ground...Then he started to fall. Siegfried had removed the belt, and placed it on a nearby table; the falling effect came from the sudden swing of the belt. Siegfried began to take off everything, eventually having stripped down to his underwear, but he kept his boots on. He wanted to make his pet squirm.<br>\r\n<br>\r\nKilik once again felt like he was falling, but this time he did; right into Siegfried's warm hand. The first thing he noticed was Siegfried grinning, the second was that Siegfried had no clothes on but underwear. And his boots were on too. \"Okay little guy, let's set you down.\" He proceeded to place Kilik on the ground in front of him. Siegfried pulled up chair, and tapped his boot on the ground, \"And don't go running, or SQUISH, just like a bug.\" He put his massive boots in front of Kilik. \"Alright, you don't really have a choice here, but I'll be nice. Do you want to lick my boots, or worship my feet?\" <br>\r\n<br>\r\nKilik was choked up.</span></div></div>",
            "created":1244437200,
            "id":704922,
            "title":"Siegfried makes Kilik worship him (feet)"
        },
        "13":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Talim",
                "Tira",
                "Cassandra",
                "Sophitia",
                "More girls!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, which girl do you want a bigger girl to find? Unless, of course, you're a voyeur.</span></div></span></div>",
            "created":1244264400,
            "id":703366,
            "title":"Lesbian "
        },
        "131":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira",
                "Taki",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>                 Talim slept well that night. She had been aiding her villagers as usual, acting as a big sister despite her young age. Being a wind priestess, she was accustomed to strange dreams, but this dream was blacker than any other. She dreamt a horrid dream of being shrunken, and captured in the night.<br>\r\n<br>\r\n               The girl who held her was a mystery, as were her intentions, but Talim was scared. Through the night she was carried, until dawn, when she awoke at the feet of her captor. In an epiphanic moment, she realized the dream had come true. She looked up to see her captor...</span></div></div>",
            "created":1244264400,
            "id":703378,
            "title":"Talim"
        },
        "1311":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira plays with Talim using her feet.",
                "Tira \"plays\" with Talim in her bed.",
                "Tira does whatever you want."
            ],
            "content":"<div class=\"\"><div> <span>           Talim looked up in shock and horror, for her captor was the bipolar Tira (Soul Calibur 4 costume, if you please). Tira was grinning cruelly, causing Talim to trip back, falling to the ground. \"Hee-hee, a tiny little bug to squish!\" Tira could be subservient and loyal, at least to Nightmare, but cruel and sadistic to anyone else; it all depended on her ever-shifting mood. Tira raised her booted foot, and Talim began to cry. \"P-please don't kill me!,\" Talim cried pathetically. Tira ignored the plea, and stepped on Talim, pinning her under the boot. Talim began to feel pressure from the boot, slowly squishing her. \"Then beg little bug! Beg me for mercy!\" Talim sobbed more, not comprehending what she had done to deserve this. Tira, not hearing the little girl beg, began to exert more pressure from her foot. \"Do you want to die? Promise you'll be my pet, and I'll let you live!\" Talim had no choice. Tira's boot, smelling slightly of foot odor, was crushing her alive. \"Please, mistress, let me be your pet! Spare my life, and I will serve you forever!\" The boot stopped pressing down. \"Hmm, some more of that, and you might be useful to me...\"</span></div></div>",
            "created":1244264400,
            "id":703591,
            "title":"Tira"
        },
        "13111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Play with her some more.",
                "Drop her into the sock!"
            ],
            "content":"<div class=\"\"><div> <span>Talim was relieved, breathing out a long sigh. The pressure eased up, and lef her body. However, this repose wouldn't last long. Talim caught something in the air, the scent of feet. She looked up, watching Tira remove her boots! Her joy was shattered, she could only look up hopelessly as her cruel master revealed black socks, crusted at the sole from sweat. \"Let's see, how many weeks was it? One, two...Almost three weeks without changing socks!\" She grinned down at Talim, \"I hope you have a foot fetish, or else you might die from the smell alone!\" She lowered her disgusting, stinky sock onto Talim, who was pushed into the sweaty material. It smelled so bad, Talim's vision was going blurry. Tira ground Talim beneath her foot, \"And that's how much you're worth, slave; you're worth less than the dirt beneath my feet!\"</span></div></div>",
            "created":1244955600,
            "id":708238,
            "title":"Tira plays with Talim using her feet."
        },
        "131112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira sleeps with her socks on.",
                "Talim escapes in the night!"
            ],
            "content":"<div class=\"\"><div> <span>Tira quickly swooped her hand down, picking up Talim. She pulled off her as well, and dangled Talim over the sock. \"You look so cold, shivering like that...You wanna go in my warm sock?\" Talim shook her head, but was already falling into the murky and stinky depths of the sock. It was like a hellish version of Tira's feet, twice a stinky, damp from sweat, and very warm. Talim looked up to see all light diminsh in the prescence of Tira foot, entering the sock slowly. Tira was doing this purposely, to scare her captive. Tira's foot came down on Talim, who's body was trapped under the ball of the foot, and her face inbetween the big and second toe. Her face was grazed by the toes, which were soft - but reeked to high and unattainable heaven. Tira put her foot on the ground, squishing the little girl up against her foot. Talim was under great pressure, which winded her. When she swung her face up to catch air, she got a facefull of disgusting, cheesy toe-jam.</span></div></div>",
            "created":1246078800,
            "id":715111,
            "title":"Drop her into the sock!"
        },
        "1311121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "The next morning...",
                "Tira wakes up in the night."
            ],
            "content":"<div class=\"\"><div> <span>Tira, her mood shifting to drowsiness, decided it was time for bed. It was dark out anyway, and sleeping was necessary. Stomping on Talim all the way to the bed, she jumped on. Quickly rising, she started to bounce up and down on the bed. Talim was hit hard, her ribs were only spared of cracking because of the plushy bed. Now Tira's reeking feet were slammed down, and Tira finally fell back, finally tired out. \"Good night, my little pet. Enjoy the smell!\" She closed her eyes, and fell asleep withing minutes. Meanwhile, Tira was unwashed - completely covered in footstink and toe-jam. She was wallowing in filth, and the horrible stench emanating from Tira's foot. Worse still, she was too tired to fight it, she was hurt and sad, and she just wanted to die. She laid down, unable to escape due to the tightness of Tira's sock. Huddled, she closed her eyes and took a whiff of stinky feet - she finally passed out.</span></div></div>",
            "created":1246338000,
            "id":716955,
            "title":"Tira sleeps with her socks on."
        },
        "13111211":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira lets Talim fall safely.",
                "Tira moves too much."
            ],
            "content":"<div class=\"\"><div> <span>\"What a good sleep!\" Tira announced gleefully, completely aware of the shrunken girl in her sock. She wiggled her toes, she noticed the girl had stopped squirming, so she was probably out cold. \"Alright lazy-bones, time to get up!\" Chirped Tira, brightly and obnoxiously. She swung her feet far up, so that the soles pointed to the ceiling. Talim woke up from the violent movement, but she was still trapped in the sock dungeon. Groggy, smelly, and still sad, Talim felt digusting. Talim held on tight though, as Tira grabbed her socks by the toe-end, and pulled them off. Luckily, Talim was on the sole, so she was spared having to come face to face with Tira. Realizing her situation though, Talim looked over the edge of the huge foot platform. She felt sick, as she stared down at the grinning face of her captor far below. \"You like it up there, pet? Get licking!\" Talim obeyed, bending down on all fours, licking the unwashed, stinky foot. Her tongue was covered in the salty taste of dried foot-sweat.<br>\r\n<br>\r\nTira was enjoying all the attention. She actually had a tiny girl licking her foot, balancing dangerously on her teetering foot. If she made a sudden moved, Talim would fall. The worst part for Talim was that Tira was a tad insane, and her whims were dangerous, as she well knew. Talim covered as much of the foot as she could, moving from the heel, up the sole, to the ball and cheesy toes. Talim was scared that she was getting used to the smell. </span></div></div>",
            "created":1248066000,
            "id":728671,
            "title":"Morning licking."
        },
        "131112111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira plays with Talim using her feet.",
                "Tira enjoys Talim as a pussy-slave."
            ],
            "content":"<div class=\"\"><div> <span>Talim, still on all fours, was shaken by a sudden movement. Tira giggled from below, and shook her feet. \"Uh-oh little bug! It's an earthquake!\" Talim hugged tightly to Tira's smelly toe, trying desperately not to fall. However, Talim was not prepared to find what she did - a ball of stinky toe jam between Tira's toes. The smell it gave off was absolutely awful, and she was forced to grab her nose with both hands. Both hands. Talim began to fall, into what she thought was certain death...<br>\r\n<br>\r\nBut alas, Tira's bed had a very nice blanket. The squealing, falling girl fell softly into the folds of the blanket. Tira didn't plan on Talim having a good day however, and dumped the blankets contents (Talim) onto the bed, and threw the blanket off. Talim shivered in terror once more, as Tira set herself up for another scare tactic. She sat up, with feet on either side of Talim. The walls of flesh smelled terrible as usual. Tira's panties tightly covered her pussy, and it was just as intimidating as her feet. Tira began her next domination session...</span></div></div>",
            "created":1248066000,
            "id":728689,
            "title":"Fall to feet."
        },
        "1311121111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Talim bites Tira's foot.",
                "Tira goes too far."
            ],
            "content":"<div class=\"\"><div> <span>Tira leaned over Talim, her head looming fearsomely over the fallen girl. Shadow encompassed Talim, and she held her hands to her chest in fear. Talim smirked, \"You really are trash, aren't you? Pieces of trash get treated like trash.\" Tira opened her lips in a light 'O' shape, Talim could see saliva welling up in her mouth. Covering her head, Talim was washed by a stream of saliva, oozing out of Tira's mouth. Talim was drenched in the sticky substance, not understanding the purpose of the bath. Tira grinned as Talim was unable to move, and she moved her stinky feet over to clamp up Talim. Talim was caught inbetween the soft walls of flesh. Tira started to squeeze. \"No matter how many times I bathe you, and spit is what I'm using from now on, you'll never wash my feet off!\"<br>\r\n<br>\r\nTira continued to squeeze Talim between her feet, pressuring the tiny girl even more. \"...Please...Dont s-squish me...\" She called out weakly. Tira laughed cruelly, \"What, can't handle it you pathetic weakling!? You really are trash. Didn't you grow up when you became a fighter? A wind priest? You can't even handle stinky feet? I oughta' squish you like the insect you are!\" Talim began crying again, \"S-stop...please....\" Tira was only growing more vehement. \"Ha! That's right, cry! Nobody is gonna save you, you're my little foot slave, and you'll enjoy it when I torture you!\"</span></div></div>",
            "created":1248066000,
            "id":728721,
            "title":"Tira's Spit and Feet"
        },
        "13111211111":{
            "author_id":"hotprey",
            "author_name":"HOTprey",
            "choices":[
                "Sorrow. (aww poor thing, I‘ll make it up to her)",
                "Anger. (that’s it! Your sleeping in my back door) "
            ],
            "content":"<div class=\"\"><div> <span>All the blood was rushing to Talim’s face as Tira kept talking. She then started to gnarr in pain and anger with tears streaming down her face. Tira didn’t realize that Talim was about to pop from the pressure of her feet so Talim bit Tira’s sole just as her vision was starting to fade. Tira pulls her feet apart and as Talim falls to the bed unconscious. Tira rubbed the bite mark on her foot. She looks at Talim and had the expression of  <br>\r\n</span></div></div>",
            "created":1290229200,
            "id":997236,
            "title":"Talim bites Tira's foot."
        },
        "131112111112":{
            "author_id":"hotprey",
            "author_name":"HOTprey",
            "content":"<div class=\"\"><div> <span>Just as Tira picked up Talim looking pissed at her as man appears at the foot of Tira's bed. He says, \"A girl how is not even armed? how boring.\" he says as he strikes Tira on the head with the bottom of his rapier. Now Tira is knocked out and still holding Talim. The man picks up Talim and and put her in his poach over his shoulder. With a few gestures of his hands Tira started to shrink to about three inches. He picked her up and put her in the poach as well. The man vanishes without leaving a trace that he was there. (This story continues in the multiple shrunken girls story)    </span></div></div>",
            "created":1290229200,
            "id":997817,
            "title":"another captor "
        },
        "13111211112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "content":"<div class=\"\"><div> <span>Tira laughed madly, crazed with her power. The struggling little girl between her feet only made her laugh harder. Despite her tears, she managed to supress a few, in order to make a few cries of agony. Tira didn't realize how much pain she was putting on Talim's weak frame. \"Stupid, weak bug! Stupid little baby! Smell my feet! Smell them and love them, because you'll be spending the rest of your life with them!\" Tira's words proved true. She squeezed just a little too hard - and a tiny squishing noise could be heard. Tira stopped laughing, and realized that Talim had been crushed between her feet. She shrugged, \"Oh well, I told her she was weak.\" Tira just sat back and laughed.</span></div></div>",
            "created":1248152400,
            "id":729671,
            "title":"Talim goes squish!"
        },
        "13113":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "She continues to play with Talim in this fashion.",
                "Mood swing!"
            ],
            "content":"<div class=\"\"><div> <span>Tira licked her lips, and removed her boot from the wriggling Talim. She reached down, and snatched up the hurt little girl in her hand. Talim came face to face with her tormentor, her tears still ran unchecked. \"Aww, you look so pathetic right now, and I don't like what your wearing. Let's fix that.\" Tira began to rip off Talim's little clothes, leaving a shivering, vulnerable pet. \"You look really tasty too, I bet you taste great!\" Tira's maw revealed shiny white teeth. Her tongue snaked out, and licked Talim's exposed chest. Talim gasped, the warm feeling and the sensuality of the action left her at a loss. Tira slid her tongue down under Talim's pussey. Tira watched in delight as her little captive held herself in discomfoture. Talim was very turned on by the display, but tried not to succumb. Tira licked all over Talim's body, from her feet to her face, and even sucked a bit on the pussey. Talim had not yet reached orgasm, but she was closing in. Tira smiled at her good work.</span></div></div>",
            "created":1244264400,
            "id":703595,
            "title":"Like a lollipop."
        },
        "131131":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Swallow Talim?",
                "Show mercy?"
            ],
            "content":"<div class=\"\"><div> <span>Scaring Talim even more, Tira moves the pet close to her mouth. Talim sees the shiny teeth, the soft tongue, and the glossy lips. Tira had not worn her lip-poison today, because she had a toy that she couldn't risk killing. She licked Talim's tiny feet before sliding them into her mouth. Soon following were the legs, and Tira scared Talim more by playfully pretending to bite them off. Talim was halfway into the mouth, when Tira began to lick the tiny girl's pussey. Talim started to cry again, in confusion and arousal. Small amounts of her love juices dribbled down Tira's throat. \"Mmm, you're tasty huh?\" Tira placed her finger on Talim's head, and pushed her slowly into her mouth. Talim tried to escape, but couldn't get a hold on the soft lips of her tormentor. She succumbed, letting herself be pushed straight into the mouth of a now smiling Tira. Her cheeks bulged from the little human inside her.</span></div></div>",
            "created":1244350800,
            "id":704141,
            "title":"She continues to play with Talim in this fashion."
        },
        "1311311":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "content":"<div class=\"\"><div> <span>Before Talim conprehended what was going on, she felt Tira's tongue licking her all over. The smell of her mouth wasn't amazing, and her saliva was sticky. Soon Talim was turning into a human candy, licked, sucked, toyed with. Tira flicked Talim under her tongue, letting's it's slippery feel cover her. She pushed Talim over to her teeth, and slowly lowered them onto her. Talim was trapped in between the two sets of teeth, feeling them bruise her. They stopped though, Tira was playing with her after all. Talim screamed, but got a mouthful of saliva. Coughing, she tried to pound the tongue, but her fists slipped off, making her fall on her chest. Tira brought Talim up to the roof of her mouth, grazing her on it, then let Talim drop down under her tongue once more. Tira eventually chose that she wanted a snack. She propped Talim back up with her tongue, and spoke. \"You've been fun, but I think it's time I tasted you for real.\" Talim did scream this time, and Tira let out a throaty laugh. \"Bye-bye! Mmm, you're gonna taste sooo good...\" She tilted her throat back, and Talim slowly slipped down into Tira's gullet. Talim tried to grasp the tonuge, but it helped push her down. Finally sealing off all light, the tongue forced Talim to begin her descent to digestion. Tira felt her prey slide down her slippery, wet throat.</span></div></div>",
            "created":1244437200,
            "id":704927,
            "title":"Swallow her!"
        },
        "1311312":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Sleep in her bra.",
                "RUN!"
            ],
            "content":"<div class=\"\"><div> <span>The sound was very faint, almost too quiet to hear, but Tira finally heard it. It was the sound of a tiny girl crying, and while normally this wouldn't be a problem, she felt bad. Something struck a chord with her emotions, and she stopped. She spat out the tiny girl into her hand, looking over the pitiful girl. Uncomfortable with the situation, she replied callously, \"Stop crying will you? You're such a baby...\" Talim wiped the tears from her eyes, looking up at her mistress. \"Okay, I guess I played a little too rough, I'll be nicer.\" Talim was dripping with saliva, wiping it off, but Tira helped her. She used her shirt to wipe off some of the excess saliva. \"Hm, I'm gonna have to take off my shirt.\" Talim was set down nearby, as Tira removed her shirt, leaving only a crimson bra. She smiled kindly down at Talim, \"You wanna sleep up here tonight?\", pointing to her breast. Talim had two options:</span></div></div>",
            "created":1244955600,
            "id":708234,
            "title":"Show mercy?"
        },
        "13113121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Tira cares for tiny Talim.",
                "Tira humiliates her with a change of clothes."
            ],
            "content":"<div class=\"\"><div> <span>Until she eased off it, Tira still had to remain dominant; and that meant she couldn't appear too soft. Talim, nodding her head, was swept off her feet and brought to Tira's bra. Tira moved her hand to put Talim inside, who was placed softly against Tira's breast. It was warm inside, and Talim caught a glimpse of Tira's almost motherly face smiling down at her. She closed up the opening, leaving Talim in darkness. Talim rested her body, facing Tira's breast, and closed her eyes. She felt Tira's heartbeat, it was quick enough, but soothing nonetheless. She felt movement, which was Tira walking to her bed to lie down. Tira did lie down, and that was the last sound Talim heard until the next morning.</span></div></div>",
            "created":1247288400,
            "id":722794,
            "title":"Sleep in her bra."
        },
        "131132":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Torture!",
                "Shame and cruelty! (Bathroom)"
            ],
            "content":"<div class=\"\"><div> <span>Tira's mood shifts drastically, and she grips Talim harder than before. \"W-What are you doing?,\" Talim can only whimper. Tira begins to squeeze Talim like a stress-toy. Talim gasps at the sudden loss of air, and fights to breathe; but the constricting hand won't let up. Tira laughs cruelly form above, \"Ha ha, that's right! Squirm you pathetic maggot!\" Her hand is being clenched even harder into a fist, and Talim's ribs start snapping. She can no longer scream in pain, and her gasps aren't giving her enough air. In a last ditch effort, she manages a few words, \"P-please stop...\" Tira grins, and squeezes one last time, knocking Talim unconcious. \"Aww, the little baby gave up too soon. But I'm not done with you yet.\"</span></div></div>",
            "created":1244350800,
            "id":703993,
            "title":"Mood swing!"
        },
        "1313":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Cassandra!",
                "Sohpitia!",
                "More girls!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Talim gets squished by Cassandra or Sophitia?</span></div></span></div>",
            "created":1248325200,
            "id":730678,
            "title":"Someone else"
        },
        "13131":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Cassandra stomps on Talim.",
                "Cassandra sits on Talim"
            ],
            "content":"<div class=\"\"><div> <span>Talim looked up to see Cassandra, the girl who had shrunken her (jeez, she can't get a break, can she?). Cassandra waited for the little girl to speak, for she would have to explain Talim's situation. Talim didn't understand why this girl would shrink her, and asked a question. \"Why did you shrink me?\" Cassandra smiled, \"You know, I really don't have a reason. The god of the forge, Hephaestus wills it.\" Talim's eyes opened wide, what did she have to do with the Greek gods? Cassandra continued, \"You see, Hephaestus is my patron god. And when you were shrunken, you took on...certain properties.\" Talim had no idea what that meant. \"You mean I'm tiny, but I'm somehow different? What are you planning to do with me?!\" Cassandra giggled. \"Hephaestus is god of the forge, bender of metals...As such, when you were shrunken by his power, you took on the qualities of that which he controls. This is hard to explain, let us say that you are like super-heated metal; you can bend.\" Talim shook her head, \"What are you talking about? You're insane!\" Cassandra only grinned.<br>\r\n<br>\r\nTalim's body, though she didn't know, could now squish, and she woudn't die. Whether she was splattered, flattened, or squashed, she'd never die. Cassandra decided to play with her little captive.</span></div></div>",
            "created":1248325200,
            "id":730679,
            "title":"The Plaything of Gods"
        },
        "131311":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Cassandra contines to squish Talim.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra now spoke rudely to Talim. \"All right bug. If you don't understand, let me show you. You've got some spine to tell me off, but you know what? You're gum under my shoe.\" Cassandra raised her huge, white boot over Talim, and it descended quickly. Talim could only try to run, but failed miserably, as she was stomped by Cassandra...And now she knew what Cassandra was talking about. Her body was squished, just like a wad of gum, under Cassandra's boot. Cassandra giggled at the thought, \"Oh wow, you really are gum under my shoe. You're pathetic, and now you're my plaything.\"<br>\r\n<br>\r\nTalim couldn't believe that she was still concious. She didn't know how it was possible, and all she could feel was her body, stuck under the bottom of Cassandra's boot. It didn't even hurt, it was just insane! Cursing her fate, she remained a wad of gum, as Cassandra walked to a nearby shelter.<br>\r\n<br>\r\nCassandra had previously been in a deep part of the woods, she'd fled their after captured Talim. But now, she headed toward a little abandoned cottage that would be her playground. She pushed open the door, and the inside was well-kept, like somebody lived there part time. Talim was ground into the dust, the dirt, and eventually, the floor of the cottage - not to mention the boot. </span></div></div>",
            "created":1248325200,
            "id":731687,
            "title":"Cassandra stomps on Talim."
        },
        "1313111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Cassandra removes her boots.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra stopped, and let her weight sink into Talim. \"Do you think I'm through yet? Not even close...\" Cassandra put all her weight on Talim, then ground her into the floor with  a twisting motion. She proceeded to scrape her boot across the floor, smearing Talim's gum-like body. Cassandra laughed, \"Isn't it funny that you can go from human to trash in an instant?\" Cassandra used her boot to smear Talim's body back into one piece, and then stomped on her hard. Talim was squashed flat. Cassandra raised her boot, and stomped again, this time shaking some of the ancient furniture in the room. She stomped on Talim a good ten times before she was done, by which time Talim was completely flattened. Cassandra spoke to her little toy, \"The only reason I don't feel bad for you is that you can't feel the pain.\"<br>\r\n<br>\r\nNow Cassandra sat down, with Talim plastered to the ground. \"Okay, now you get double the treatment.\" She picked up the flattened Talim, and stuck her firmly on one of her boots. She then sandwiched Talim between the boots, and rubbed them together, causing Talim's body to spread all over, like butter. Cassandra giggled at Talim's buttery body, \"Ha ha, that's gross, little human goo.\" Cassandra peeled off Talim bits, and rolled her into a ball. Talim did not understand why this was happening, or how. How did she remain concious? It didn't matter though, and Cassandra was just getting started.</span></div></div>",
            "created":1248498000,
            "id":731694,
            "title":"Cassandra's  Squish Toy"
        },
        "13131111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Cassandra removes her socks",
                "Cassandra put Talim in her sock."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra dropped the little ball that was Talim to the ground. It bounced a bit, then lay still. Talim could see Cassandra gripping her boots, and pulling them off slowly, as though savouring the action. Talim couldn't speak, but wanted to yell and cry so badly...She didn't want to smell a girl's stinky feet! But it was bound to happen. Cassandra pulled off her boots, revealing browned socks. \"You know, these socks were white when I got them, and that was only three days ago!\" She giggled, and took a sniff of her own feet. \"Oh boy, my feet smell so bad! Probably because they haven't been washed, and I haven't changed my socks...\" She continued to sniff her own feet, while Talim watched in horrified fascination. <br>\r\n<br>\r\nCassandra finally thought it was time to start again. Her socked foot came down on the little ball, very, very hard. Talim's body was squashed all over the bottom of the sock, the liquified body melding with sock fibres. The smell of Cassandra's rancid filled her body and mind, invaded the senses. It was absolutely disgusting, what girl didn't have good enough hygeine to keep their feet clean? Cassandra rubbed her foot on the ground, spreading little Talim bits on her sock and on the floor. It was a mess, but Cassandra laughed happily. She truly enjoyed making this girl sniff her stinky feet, it was hilarious!</span></div></div>",
            "created":1248670800,
            "id":733150,
            "title":"Sock Squashed"
        },
        "133":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Taki",
                "Amy",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra was out for an afternoon stroll in the forest. The sun was blazing, and she was sweating like crazy. Wiping her brow, she sighed, \"All this for losing weight, this is too much work...\" As she walked along, she heard the snap of a twig. Being a fighter, she ignored it. Assassins didn't go after young girls anyhow. She kept walking, until there was a bright flash of light from behind her. She turned around quickly, but was knocked unconcious.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nMuch later, Cassandra regained conciousness. She got up, and groggily looked around. Her eyes widened as she realized that everything was massive compared to her. She was also in what appeared to be a dilapidated castle chamber. She heard loud foot-steps, and turned to see...</span></div></div>",
            "created":1246078800,
            "id":715095,
            "title":"Cassandra"
        },
        "1331":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Boobs",
                "Feet",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Taki, the ninja/assassin herself, was walking seductively up to Cassandra. Taki shivered in pleasure at the thought of the tiny girl serving her. Cassandra shivered in fear, but also some uncanny arousment. The scene was so cliche feeling, as though she knew she was about to be made a toy. Taki's large breasts bounced when she walked, and Cassandra looked up at them in fear. They could crush her, her boobs alone! \"Hello, little one. As you know, I shrunk you, and have one simple purpose for you. You see, I spend much of my life running and fighting, but today I want a break. I have taken the time to secret you away in this castle, where nobody will ever find you. I'll give you a choice. What would you like to do?</span></div></div>",
            "created":1246078800,
            "id":715100,
            "title":"Taki"
        },
        "13312":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Rub my feet.",
                "Get in my tabi (boots)."
            ],
            "content":"<div class=\"\"><div> <span>Taki looked surprised at the request. \"You'd rather have my gross feet than my boobs? Oh well, it's your choice.\" Cassandra felt a feeling of lust well up in her, for no explainable reason. Taki removed her ninja tabi, showing off her hot, stinky feet. The smell spread quickly, filling Cassandra's nose. The undersides of her feet were completely reddened, showing that she'd been on them all day. \"You know, I find this odd because one would understand that if I worked as hard as I did, I'd have sweaty feet. You choose them, and I wonder why. I've been on these all day, the day before, and the day before that for as long as I've been fighting. My feet are probably the smelliest in the whole world, and yet you long for them?\" Cassandra, of her own volition, walked towards the world's smelliest feet, taking in the euphoraic smell. Taki laid her feet right in front of the tiny girl. \"All right slave, you will now...\"</span></div></div>",
            "created":1246078800,
            "id":715104,
            "title":"Feet"
        },
        "133121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Lick Taki's feet."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra obliged happily, running up to the gargantuan feet. She pressed her face right against the sweaty, smelly foot - Taki's feet truly did reek! Cassandra began to massage the soft, stinky flesh; occasionally she rubbed it with her face. Taki noticed this, and giggled a bit, \"Do you like them that much?\" Cassandra nodded, smiling. \"They smell so good!\" Taki was getting turned on by the display herself, she never expected such willingness to do the lowest of jobs.<br>\r\n<br>\r\nThe rubbing on one foot lasted a full ten minutes, as Taki had to lower her feet to allow Cassandra to get at the ball. At these points, Cassandra would get a whiff of her slimy toes, sweaty and toe-jam ridden. Taki finally decided to escalate it a bit. \"You wanna lick my feet now, little pet?\" Cassandra nodded vigorously.<br>\r\n</span></div></div>",
            "created":1246078800,
            "id":715107,
            "title":"Rub my feet."
        },
        "1331211":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Trap Cassandra between her toes.",
                "Taki kills Cassandra."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra opened her mouth, letting her wet tongue glide over Taki's huge foot. Her feet were salty from sweat, and occasionally a droplet of sweat gave Cassandra a drink. She licked over and over, from the heel of Taki's grimy foot, up to the sole, to the smelly ball, and to the damp toes. Taki was pleased with Cassandra's work, and wanted to reward her. Cassandra was still licking away fervently, and didn't see Taki lean over, pointing her finger at Cassandra. A faint light shone at Taki's fingertip, shooting a small beam at her. Cassandra, her eyes closed in worship, didn't even notice that she was shrinking again. She felt gigantic flesh walls close over her, and lift her high in the air. Being released, she realized that these were Taki's fingers, and that she was less than half of an inch tall, standing inbetween Taki's monolithic toes. The ground, the gap between her toes, was slippery with sweat - and the smell! If it was bad when she was small, it was absolutely crushing at her size. She fell to her knees, and licked the gap between the toes of her goddess. Taki smiled, far in the distance. What does she do?</span></div></div>",
            "created":1246597200,
            "id":719191,
            "title":"Lick Taki's feet."
        },
        "13312111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Taki puts on her tabi.",
                "Taki is shrunken from behind."
            ],
            "content":"<div class=\"\"><div> <span>Taki giggled, though to Cassandra it was like the deep rumblings of a mythical giant. \"Well well, a tiny human speck at my feet!\" Cassandra was very tiny, still licking between her goddess's toes. Cassandra, at her size, could hear the moving of tendons inside the toes; she realized they were moving together. Looking up, she watched as the titanic walls moved closer together. Taki had decided to trap the little girl between her toes, and she was enjoying it. Cassandra was pressed, very hard, between the stinking towers. Stuck by pressure and sweat, Cassandra had been forced to stick to the gap between Taki's toes. \"Aww, you're so cute, my little toe-jam!\"<br>\r\n<br>\r\nCassandra hadn't been mashed to a pulp, but was more so scrunched up. She was sticking firmly, that sweat must have really been something. In moments, she was so drenched that she thought she'd smell like Taki's feet forever. </span></div></div>",
            "created":1246770000,
            "id":719201,
            "title":"Taki's Toe-Jam"
        },
        "133121111":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Takes Cassandra out, and grows her.",
                "Goes for a walk."
            ],
            "content":"<div class=\"\"><div> <span>Taki thought it was best that she torture her captive with a better smell. \"You're probably thinking you can't get much lower right now, but don't worry, I know where you can go.\" Taki picked up her tabi, and slipped one on. The other, still empty, would be Cassandra's temporary home. Taki watched the scrunched up toe-jam inbetween her toes. She looked strangely...Happy? Taki didn't understand why someone would be pleased, perhaps it was an act. Cassandra was plunged into a foot-stink filled dungeon of darkness. Taki slid her foot all the way in, sealing Cassandra in; though she was still stuck between Taki's sweaty toes. Taki laid back on the floor, crossing her feet. Cassandra was left to wallow in the smelly tabi, stuck to the soft flesh of Taki's feet. While Taki sat back, she wondered what to do with the tiny speck of a girl at her feet. She didn't want to squish her, but what could she do with a speck? Perhaps she should grow Cassandra back to a certain size...Or maybe she could just walk around with Cassandra under her foot.</span></div></div>",
            "created":1249016400,
            "id":735506,
            "title":"Taki puts on her tabi."
        },
        "13313":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "No, her ass is soft and she makes sure Cassandra is fine.",
                "Yes, Cassandra pops underneath Taki's weight."
            ],
            "content":"<div class=\"\"><div> <span>Cassandra couldn't answer...how could she?  She was staring up at the woman who saved her sister's life.  She tried to utter out an excuse \"B-But...But you...But...\", which seemed to bring both a smirk from the giant ninja and a chill down the tiny girl's spine.<br>\r\n<br>\r\n\"My butt?  What an odd choice, but I'm sure you'll feel great down there.~\"  She reached down to pick up the tiny warrior.  Cassandra tried to run away, but was easily swiped up by the kunoichi.<br>\r\n<br>\r\n\"Let me go!  Don't hurt me, please!\" Cassandra begged, kicking and flailing her arms in hopes of getting free despite the possibility of getting dropped.  \"I can't believe someone as cruel as you helped my sister!!!\"<br>\r\n<br>\r\nTaki raised the tiny girl to her face with a scowl.  \"Cruel?  What a cruel accusation...I'm not the cruel one...SHE is!  I saved her from death and wished that we could have been together...but...she had a husband...\"  The giant ninja sheds a tear and holds back her sobbing.  \"The closest thing I have is her little sister.  You're not the same...but you'll do just fine.\"<br>\r\n<br>\r\n\"W-Wait!  That's what this is about?!  I know you'll find someone, but that's just how life is.  You can't just--\"<br>\r\n<br>\r\n\"NO!  I'm tired of being left without anybody and I want to be loved by someone!\"  She places the girl onto a chair and turns around, showing her ample and well-tone backside tightly hugged by her outfit.  Cassandra shivered in awe at the ninja's very figure as the fabric tightened against her flesh...Taki was bending over to sit down.  \"WAIT!!!  I'LL DATE YOU!  JUST DON'T HURT--\"<br>\r\n<br>\r\nCassandra's pleas were silenced and replaced by a series of muffled \"Mmphs\" and shrill screams.  Taki wiggled her ass onto the tiny girl with a smile on her face, imagining that it was Cassandra's older sister.  \"Mmm...That's for rejecting me, you Greek bitch.  Athena won't save you from my love.  Kiss it, love it.\"<br>\r\n<br>\r\nCassandra was terrified and kept trying to wriggle out from underneath the ninja's ass.  Does Taki take it too far?<br>\r\n</span></div></div>",
            "created":1605127260,
            "id":2938543,
            "title":"Something else."
        },
        "1333":{
            "choices":[
                "Sophitia",
                "Ivy",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her sister, Sophitia?<br>\r\nor someone else?</span></div></span></div>",
            "created":1328245560,
            "id":1270264,
            "title":"Someone else."
        },
        "135":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Amy",
                "Setsuka",
                "More girls!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some more tiny girls to satiate your sexual intentions.</span></div></span></div>",
            "created":1244264400,
            "id":703367,
            "title":"More girls!"
        },
        "1353":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Hilde",
                "Ivy",
                "More girls?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hilde or Ivy?</span></div></span></div>",
            "created":1246338000,
            "id":719845,
            "title":"More girls!"
        },
        "13533":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Multiple?",
                "More!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could have a story with multiple girls shrunken...</span></div></span></div>",
            "created":1246856400,
            "id":719836,
            "title":"More girls?"
        },
        "135331":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Author's multiple girl shrinkage story.",
                "Another selection (own story)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All right. You can have my story, or make your own.</span></div></span></div>",
            "created":1246856400,
            "id":719837,
            "title":"Multiple?"
        },
        "1353311":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Amy is rough, but nice enough.",
                "Amy is cruel."
            ],
            "content":"<div class=\"\"><div> <span>They were scared stiff, the whole lot of them. Inside the miniature mansion resided multiple dolls. At least, that's what they looked like. Taki, Setsuka, Hilde, Talim, Seong-Mina, Cassandra, Sophitia, Ivy, Xianghua, and Tira had all been shrunken within the past week, brought to a mansion, and kept as dolls for a girl named Amy. When Raphael had said, \"You'll make a fine pet for Amy\", he wasn't kidding. They had been stripped of weapons, and at Amy's own hand, their clothes. Now they huddled in different areas, embarassed at the situation. A high-pitched scream came from one of the upper chambers - it was Cassandra. She heard booming steps, and she knew who's they were. She heard more noise, then a giant eye, red in colour, peek into the tiny chamber. The eye moved away, and smiling lips went up with it.<br>\r\n<br>\r\nIt was play time.</span></div></div>",
            "created":1246856400,
            "id":719844,
            "title":"Amy's Dollhouse"
        },
        "13533111":{
            "author_id":"hotprey",
            "author_name":"HOTprey",
            "choices":[
                "Amy grabs Setsuka and pulls her out and her treats her like a piece of hard cand",
                "Amy sees Hilde in the window and pulls her empty hand out to grabs her "
            ],
            "content":"<div class=\"\"><div> <span>(To the readers. To clear up what is happening in this chapter and explain the situation of the previous chapter is that Raphael one by one fought the ten closest girls around him by beating them, used his mysterious dark powers to shrink them while they were knocked and teleported to the next closed girl. After having a full poach of shrunken women he then went back to Amy. He presented the ten tiny girls to Amy see squeals with excitement while she striped their little weapons and clothes from their unconscious bodies. Out of the bunch Cassandra was barely conscious as she saw a giant Amy picking up little girls and picking their clothes off but went back to sleep. Raphael rolls his eyes to this action and tells her that he was going to build her a place to keep them all. He then started building a mansion with actual miniaturized bricks, cement, glass and wood, ect while Amy was sleeping. When he was building the mansion he put the girls in different rooms when he was building in up of the floor. Amy woke up to the sight of this mansion and was giddy with glee. That’s when Raphael told Amy that he was off to defeat Nightmare. Amy hugged him knowing that he did all this so she wouldn‘t follow him and to have fun while he was gone. Then he left and that’s when Amy looked into the window in the previous chapter. In this chapter some of the girl are just waking up and some have been awake before Amy woke up by the way, the only girls that know each others is Taki+Ivy, Sophitia+Cassandra, Xianghua+Talim and the rest don‘t know each other until they met in the mansion. Now enough of my jibber-jabber time to get back to the action.)<br>\r\n<br>\r\nAmy opens up the tiny window and puts her mouth up to the window and says, “Hey! You should come over here and hop in my mouth , I promise I won‘t eat you.” she says with a giggle and keeps her opened mouth in front of the window. Cassandra took a few steps back until she hit her back the door. Then there was knocking coming from behind the door. She opens it and sees Taki and Talim in the hall way. Taki was covering her breast with one arm while Talim covered her private area with both hands. Cassandra gets in the hall way with them and closes the door just as Amy looks back into the window and sees that the room is empty. “Huh, she must have left. Maybe I should use the front door.” Amy thought to herself.  <br>\r\n<br>\r\nIn the hall way the three girls converse, “Do any of you know how we got here.” Cassandra asks now covering her breast. Talim says, “It was that strange man, he attacked me and knocked me out with the bottom of his rapier.” then Taki says “Me too, he must have brought us all here when we were knocked out and taken our clothes! Lets find him and let him pay!” Taki said walking down the looking angry while Talim followed. “Wait!” Cassandra says while the two turn to look at her. “That man didn’t take our clothes.” Cassandra says and Taki asks, “Then who did?” then she answers, “The giant girl outside this place, and she not a giant. We‘re shrunk.” Taki and Talim are baffled by what they just heard and make funny faces. <br>\r\n<br>\r\nElse where in the miniature mansion Hilde wakes up in the middle of the empty attic with only a window and no stairs to go down. She also sees that she is naked and feels curious to where she is. She walks over to the window and sees that outside was a giant drawbridge door and carpet on the ground. She thinks for a second that she is in a tiny room in a bigger room like a doll house and thought to herself , “How am I supposed to get out of here?” as she leans her back to the window and sees that there are no doors or stairs.<br>\r\n<br>\r\nIn one of the hall ways is a closet door that gets kicked open. Ivy walks out of it and looks both way of the hall ways and thinks, “Where’s sword!” looking as mad as she had ever looked while she went stomping down the hall in search for her blade. In one of the bath rooms of the mansion Sophitia wakes up in a bubble bath and is startled at first but just sits there are wonders how and why she is there. In the master bedroom Xianghua is still sleeping comfortably in the soft warm bed in there. Seong-Mina is sleeping on the long dinning room table with her arms under her face and her rear in the air. <br>\r\n<br>\r\nThe last two girls where in the main hall where the double doors where facing the main stair way. (like the Resident Evil 1 mansion.) Setsuka was walking down the stairs and sees Tira in the corner of the wall on the left side of the doors. She gets to the floor and calls out to her, “Hey? Are you ok over there.” she asks while Tira was sitting in the fetal position with her face behind her knees whispering, “Master will save us, master loves us.” Setsuka walks a little closer. “Hello?” she asks as Tira’s changes to a deeper tone but still whispers, “No he won‘t! He doesn‘t care for us! No one care for us!” then all of a sudden a giant hand comes smashing threw the front door. “Oops, I hope Raphael doesn‘t mind.”<br>\r\n</span></div></div>",
            "created":1290229200,
            "id":997829,
            "title":"Amy is rough, but nice enough."
        },
        "135331111":{
            "author_id":"hotprey",
            "author_name":"HOTprey",
            "choices":[
                "Amy is ready to put Setsuka in her mouth to suck on her body",
                "Setsuka is slippery enough to be sandwiched between he ten toes.        "
            ],
            "content":"<div class=\"\"><div> <span>Amy feels a little girl and grabs her as fast as she could. She pulls her hand out and looks at her little captive with only her head and feet sticking out of her fist. Amy licks her lips and says, “You tiny girls look so yummy! I wanted to taste you earlier but some was watching” <br>\r\n<br>\r\nElse where Sophitia’s bath water shakes in the tub so she jumps out but jumps back in cause of how cold it was outside the tub. The trio in the hall hear the doors getting broken down and rushed to the scene. Ivy also heard this and jiggled and bounced her way down the hall to the scene.  Xianghua and Seong-Mina are still asleep, Hilde is looking out the window trying see if she could spot what that noise was and tira was still in the corner in the fetal position. <br>\r\n<br>\r\nThe three girls get down stairs and saw the door busted open and look out to see Amy licking Setsuka’s face. They three of them hide on the sides of the door so Amy wouldn’t see them. “Oh no, you were right. Were in a Doll house.” Talim says hopelessly. Then looked over to the corner that Tira was and saw her. Talim was in shock to see her cause the last thing she remembered was being squeezed between her feet. Talim held Taki’s hips and ducked behind her hiding from Tira. Taki didn’t mind much cause she was to focused on watching Setsuka getting licked like a lollipop. </span></div></div>",
            "created":1290229200,
            "id":997835,
            "title":"continuing from the lesbian Talim+Tira story"
        },
        "1353311111":{
            "author_id":"hotprey",
            "author_name":"HOTprey",
            "choices":[
                "Taki and Ivy sneak out of the masion and Amy catches Cassandra next",
                "Taki and Ivy run away, Tira follows Talim, and Seong wakes up hungery"
            ],
            "content":"<div class=\"\"><div> <span>Amy puts her lips around Setsuka’s head and sucks her whole body into her mouth with only Setsuka feet sticking out from between her smiling lips. Taki watches is anger thinking of a way to save Setsuka from possibly getting eaten. Then as Cassandra and Taki where watching, Talim was hiding and Tira was rocking herself back an forth in the corner they all heard, “What are you doing  her!” They all look to the stairs and see Ivy walking (bouncing haha) down them glaring at Taki. Taki turns to her and says, “Ha! Looks like your not as undefeatable as you claim.” with a smile. Ivy stormed towards Taki and Taki did the same toward her. Then Talim was in open and Tira looks over to her. Tira smiles as she sees Talim and Talim rans in to the dinning room. Tira just sat there and watched Taki and Ivy standing chest to chest. “I see you are not as nimble as you think you are.” Ivy says bumping Taki back a little with bosom. <br>\r\n<br>\r\nSetsuka is still in Amy’s mouth getting swished around above and below her tongue with her feet still sticking out. Amy pulls Setsuka out of her mouth by her feet and held her upside down before her face. “Yum! You were Delicious and now that your all slippery…” Amy was in her jammy-jams with socks on and started to lower Sesuka down to the back of her. Cassandra gasped at the sight and Taki and goes back the door and sees that Setsuka is getting shoved into the back of her pajama bottoms. Taki looks back at Ivy, “See that?” Ivy walks over to the gapping hole where the doors were. Ivy saw the giant girl with her hand down her pants with a happy closed eyed expression on her face. Ivy jumped to the side of the door where Taki was hiding and asked, “What on earth is going on here?! I demand to know at once!” Taki looked at her and says, “shhh, she might hear you.” Taki looks out and sees Amy wiggling her butt on the floor. “Look Ivy, we may not like each other but we have to find away to survive this. Right now we are shrunken in this place and we need to think of a plan.” Ivy nodded her head, “Fine, all I need is my sword and I could make that girl suffer.”<br>\r\n<br>\r\nMeanwhile in the back of Amy’s bottom Setsuka was laying under Amy’s butt crack. Amy kept wiggling until she had Setsuka deep between her cheeks. Amy just blushes and shy’s in relief. <br>\r\n</span></div></div>",
            "created":1290229200,
            "id":997967,
            "title":"Amy is ready to put Setsuka in her mouth to suc..."
        },
        "13533112":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Hilde under foot.",
                "Hilde gets sat on."
            ],
            "content":"<div class=\"\"><div> <span>Amy was dressed in her regular gothic outfit, meaning that she was also wearing the big, black boots. The tiny girls all heard Amy's voice booming, \"Which one of you wants to be played with first? I promise you, whoever comes out first will be treated far better than the next ones. If nobody steps out, I might just squish you all! Raphael can always shrink me some new bugs to crush.\" The women, for the most part, were a strong-willed lot. However, when faced with humiliation and a giant girl's stomping problem, even Ivy could quiver. But Hilde, the brave commander she was, headed out first. She walked solemnly out of the tiny mansion door, staring up at a happy Amy. Amy loved to play with older girls. She was quite young herself, and it always made her feel powerful to control and hurt these women; mostly in the prime of their lives. They had larger breasts, but they were so tiny, they were like insignificant bugs. <br>\r\n<br>\r\nAnd Amy loved to squish bugs.</span></div></div>",
            "created":1247288400,
            "id":722797,
            "title":"The first girl she can grab..."
        },
        "135331121":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Amy removes her boot.",
                "Amy kills Hilde anyway."
            ],
            "content":"<div class=\"\"><div> <span>Amy pulled out some rope from behind her back. It was actually string, good for tieing little girls to big boots... That was Amy's plan. She grabbed the helpless and brave girl; she never expected to be caught under a boot like this! Amy tied the speechless girl to the underside of her boot, which was relatively clean. However, it smelled of feet, and Amy was always wearing those boots. Hilde was terrified. If Amy put enough pressure on her, she'd be crushed. All the tiny girls in the mansion looked out of different windows, watching the girl suffer. Amy giggled from above, \"Aww, don't you look cute, like gum on my boot! Maybe I should make you gum...\" Amy placed that foot on the ground, hearing Hilde's cries of pain. Amy was pressuring Hilde very much, but this wasn't the first day she'd been captured. Once Amy started doing this, she often got her pet to submit to her. Once that happened, she used her bare feet to torture the girl, then let her back in the mansion. <br>\r\n<br>\r\nHilde was still being crushed, and waited for Amy to stop. Amy's voice boomed down once more. \"I'll let you live, little bug, if you want to be my foot slave.\" Hilde cried through clenched teeth, \"I live to serve your feet, my goddess.\" Amy was delighted, and stopped pressing down so hard.</span></div></div>",
            "created":1247288400,
            "id":722803,
            "title":"Hilde under foot."
        },
        "1353311212":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Amy grabs a new girl!",
                "Amy lets her bugs free... Then starts stomping."
            ],
            "content":"<div class=\"\"><div> <span>Hilde felt the boot being lifted off her, but it was only raised a few inches off her. She could still smell the stinky leather of it, and wondered why it wasn't raised off her by now. Amy's voice could be heard, \"You say you live to serve me?\" Hilde yelled up, \"Yes my master.....Let me worship your feet!\" She said the last in disgust. Amy grinned cruelly, \"You think appealing to me will save your life. That's the only reason you said that.\" Suddenly her eyes turned angry. \"Pathetic, just like a bug!\" Amy stomped down on Hilde, making her scream. \"Goodbye, bug.\" She twisted her foot, squishing Hilde, and leaving a bloody mess under her boot.<br>\r\n<br>\r\nAmy turned her eyes dangerously to the mansion, where the girls still looked on in horror. \"Who's next?\"</span></div></div>",
            "created":1247288400,
            "id":722805,
            "title":"Amy kills Hilde anyway."
        },
        "135331122":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "Amy sticks Hilde in the backside of her panties.",
                "Amy squishes Hilde under her butt - and then the mansion."
            ],
            "content":"<div class=\"\"><div> <span>Amy smiled down at her first prey. She turned around, so that Hilde could get a look at her giant ass. She turned her head as well, to see Hilde better. \"Do you like your goddesses bottom?\" That was an odd question, but Hilde appealed to her owner. \"...Yes, your ass is very...Tight? And firm, yes, beautiful!\" Amy grinned, \"You wanna be under it?\" Hilde's eyes opened wide, and she didn't reply. But Amy didn't give her a chance. She squatted down, holding her ass right over Hilde, \"Squirm for me, like a good cushion.\" Amy sat her full weight on Hilde. Hilde was squished up against Amy's panties. It was warm and soft, but very heavy. Hilde did squirm, but she did so in an attempt to escape. Amy laughed above, \"That tickles!\" <br>\r\n<br>\r\nThe girls in the mansion didn't know what to think; for Amy, this was relatively harmless. It was actually more funny than scary. Hilde didn't like the smell of Amy's ass, what girl would? But Amy had a worse intention for Hilde...<br>\r\n</span></div></div>",
            "created":1247288400,
            "id":722809,
            "title":"Hilde gets sat on."
        },
        "14":{
            "author_id":"shanks49",
            "author_name":"Godot",
            "choices":[
                "A guy grows",
                "A girl grows"
            ],
            "content":"<div class=\"\"><div> <span>Ah, the loss of the \"fucked up\" section. I suppose there's nothing I haven't heard of, fetish-wise anyway. So, I decided to do something else. I enjoy shrinking more than giantess, but if somebody wants to create a giantess/giant story, they may. I will not add to this section, feel free to write what you please. It makes me happy to see any additions.</span></div></div>",
            "created":1244264400,
            "id":724119,
            "title":"Which sex will grow?"
        },
        "142":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Ivy",
                "Tira",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who will become a giantess?</span></div></span></div>",
            "created":1298140860,
            "id":1056807,
            "title":"A giantess to rule the story"
        },
        "1423":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "Sophitia",
                "Taki",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more girls</span></div></span></div>",
            "created":1298140920,
            "id":1056808,
            "title":"other"
        },
        "14233":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "yes, Cassandra",
                "no, someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the butt-smothering Cassandra?</span></div></span></div>",
            "created":1298141040,
            "id":1056810,
            "title":"other"
        },
        "142331":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "\"No way! You're not the boss of me anymore! I'm the one making the rules now!\"",
                "\"Don't worry sis, I won't break anything... I just want to have a little fun!\""
            ],
            "content":"<div class=\"\"><div> <span>One day, Cassandra was relaxing in under a tree having a peaceful picnic with her sister, Sophitia. They were simply chatting as they ate, mostly about their recent battles against the evil sword Soul Edge. Neither of them could have suspected what would happen next. As if out of nowhere, a colossal meteor shot down from the sky and crashed directly in front of the sisters. Cassandra, being the less responsible of the two, couldn't resist the urge to examine it. Sophitia immediately tried to stop her.<br>\r\n<br>\r\n\"Cassandra! What do you think you're doing! That thing could be incredibly dangerous!\"<br>\r\n<br>\r\n\"Oh relax, Sophie! I just want to get a quick peek!\"<br>\r\n<br>\r\n\"But who knows what kind of weird stuff from space that thing could have in it!?\"<br>\r\n<br>\r\n\"Don't worry, Sophie! I promise that I'll be careful... Sheesh...\"<br>\r\n<br>\r\nHowever, just as she approached it, the meteor cracked open and emitted a foul gas that knocked Cassandra unconscious! Sophitia immediately freaked out.<br>\r\n<br>\r\n\"Oh my god! Cassandra! Are you okay?! Cassandra!!!\"<br>\r\n<br>\r\nJust then, Cassandra's unconscious body began expanding rapidly. She was growing at an alarming pace, and Sophitia had to step away to avoid being crushed under her sister's expanding form! Much to Sophitia's dismay, Cassandra's body kept on growing for quite some time. By the time her growth had finished, she was at least 100 feet tall! Sophitia was terrified at the sight of her now-giant little sister. Suddenly, Cassandra stirred.<br>\r\n<br>\r\n\"Ugh... That was the worst thing I have EVER smelled! I guess that I should have listened to you, huh Sophie? Um... Sophie? Sophitia, Where are you?\"<br>\r\n<br>\r\nCassandra looked around for her big sister, but was unable to locate her. Suddenly, a small movement drew her attention. As she looked at the source of the motion, she was shocked by what she saw; Her big sister was jumping up and down to try and get her attention, and she was small enough to fit into the palm of Cassandra's hand! She immediately scooped up her 'little' sister, and try to ask her what happened.<br>\r\n<br>\r\n\"OMG! Sophitia, what happened to you! How the heck did you get so small?!\"<br>\r\n<br>\r\n\"<i>I</i> didn't get small, Cassie! <i>You</i> got big! This is <b>exactly</b> why I didn't want you messing with an unknown rock from outer space in the first place!\"<br>\r\n<br>\r\nCassandra quickly looked around and saw that Sopitia was right; The tree that she was sitting under earlier was now nothing more than a stick of broccoli to her, and the meteorite that was once bigger than her was now the size of a mere pebble!<br>\r\n<br>\r\n\"Wow! I really AM huge! Hehehe... This could be a lot of fun!\"<br>\r\n<br>\r\n\"What are you talking about, Cassandra?! This is dangerous! We have to find a way to fix you!\"<br>\r\n<br>\r\n<br>\r\nHow will Cassandra respond to this?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1298142720,
            "id":1056821,
            "title":"Cassandra the colossus!"
        }
    },
    "info":{
        "author_id":"shanks49",
        "author_name":"Godot",
        "brief_description":"A story that allows all fetishes, all sexual orientations, have some fun.",
        "created":1244316300,
        "description":"<td align=\"left\" class=\"norm\">Personally I just don't care. It used to be that I kept things limited to non-gay sexual stories, but after realizing that in life I didn't care, why should I care here?<br>\r\n<br>\r\nI love Soul Calibur, and I don't see many stories about it. Whatever I write myself will be in the category of feet and shrinking; my fetishes. I do believe that everyone is born the way they are; you don't choose your fetish or sexual orientation.<br>\r\n<br>\r\nPretty much everything is allowed.<br>\r\n<br>\r\n*** BRB UNIVERSITY. No, seriously, I'm not adding any more. Don't be sad that I'm not talking to you and thanking you extensively, though I thank you here for additions.</td>",
        "id":1568495,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1605175140,
        "modified":1605175140,
        "pretty_title":"Soul Calibur Shrink Story"
    }
}