{
    "chapters":{
        "1":{
            "author_id":"josh123313",
            "author_name":"Jmanthedualblade",
            "choices":[
                "Go with bobobo on his quest",
                "Get what you want then betray bobobo",
                "Next stop Don Patch",
                "Next Up Beauty",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>It's the year 3001.5 and you have been in and out of jobs when Czar Baldy Bald came into power. Then his soldiers the hair hunt troops attack your place. After that you try to learn some attacks in case they attack again, just then you find a big guy with a blue shirt, big muscles, sun glasses, black pants, brown shoes,and big yellow afro. \"Hey you alright bro?\" said the man. \"No do I look alright?\" you say then he looks around him then back at you. \"My name's Bobobo-bobobo, just call me Bobobo,\" said Bobobo. \"Wait I've heard of you, you're wanted by the chrome dome empire and a master of the super-fist of the nose hair!!!\" Bobobo just looks at you then says\"Dude I see a super-fist in you that nobody has ever seen and with a bit of training you can harness it's power just know if you attack me I won't hold back.\" There's a slight pause then his afro opens to show a cat then it says\"I'll scratch your eyes out then I'll use them as a litter box.\"</span></div></div>",
            "created":1331867760,
            "id":1295441,
            "title":"The begining"
        },
        "13":{
            "author_id":"josh123313",
            "author_name":"Jmanthedualblade",
            "choices":[
                "Holloween",
                "Food",
                "Cats",
                "Jelly",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>You enter wigginsville when you meet a sort of gang. \"So you've finally shown yourself wig-bro!\" said what appears to be a leader. You've been studying under Bobobo and learned the superfist of the videogame and as an added bonus taught you to master the art of wiggin so you're now a wiggin specialist. \"Wait a minute I don't wear a wig so how can we be this wig-bro guy?\" you ask. However the gang seem not care so they reveal the leader Don Patch. However Don Patch is a little out of it. \"Hey our Christmas ornimate!!\"both you and Bobobo say in unison. Both you and Bobobo put Don Patch in a pine tree like those bobble balls. \"Wait a minute I'm no Christmas ornimate!\" Don Patch exclaimed. He was impressed with both you and Bobobo so he challenged you to a wiggin out contest. The only question is what is the theme.</span></div></div>",
            "created":1335082500,
            "id":1320543,
            "title":"Time to get wiggy with it"
        }
    },
    "info":{
        "author_id":"josh123313",
        "author_name":"Jmanthedualblade",
        "brief_description":"enter the world of Bobobo and work with or against the hair hunt troops.",
        "created":1331866560,
        "description":"<td align=\"left\" class=\"norm\">This must be family appropriate and use yourself I don't want your actual description or name just imagine yourself as a character in Bobobo-bo-bobobo and use an original super-fist power and try not to make mistakes I want this to be random and funny. Make sure you at least got the basics down how this goes and you're at least as strong as bobobo</td>",
        "id":1855218,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1335082500,
        "modified":1335082500,
        "pretty_title":"Bobobo your way"
    }
}