{
    "chapters":{
        "1":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Get up and find out what happened",
                "Stay in bed! Maybe it's all a dream"
            ],
            "content":"<div class=\"\"><div> <span>19-year old Jenna Green slowly awoke. The voluptuous young brunette yawned, and got ready to start her day.<br>\r\n<br>\r\nFor some reason, though, the bed sheets were heavier today, and her pillow felt larger. She opened her eyes, and was shocked to see her bed was the size of a football field!<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1085029200,
            "id":200141,
            "title":"Woke up this morning"
        },
        "11":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "\"Guess I'll wash them\"",
                "\"I'll tell her to put them in the hamper when I find her\""
            ],
            "content":"<div class=\"\"><div> <span>Though she was scared, Jenna needed to find out what happened. She slowly stood up. She looked down, and the only things that shrunk with her were her panties and bra. It was chilly, but she started to venture across her bed.<br>\r\n<br>\r\nShe estimated herself to be one centimeter tall. All of a sudden, her mother burst in her door.<br>\r\n<br>\r\n\"JENNA! WHERE ARE YOU!\" she yelled, sounding like a mythic god to small Jenna.<br>\r\n<br>\r\n\"Mom, I'm here!\" she yelled to the top of her voice, but her mother didn't hear her.<br>\r\n<br>\r\nShe then looked at the bed.<br>\r\n<br>\r\n\"Hmm. Her sheets need to be washed\".</span></div></div>",
            "created":1085202000,
            "id":200232,
            "title":"Journey across the bed"
        },
        "111":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "She falls out in the hallway",
                "She dosen't"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna watched in horror as the sheets seemed to rise at the at command of her mother, trapping her. She screams, but with the sheets covering her, there is no way she can be heard.</span></div></span></div>",
            "created":1085547600,
            "id":200636,
            "title":"Trapped!"
        },
        "1111":{
            "choices":[
                "Her younger sister's barefeet",
                "A spider"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was tossed around inside of the gigantic bedsheets and she knew she had to get out soon otherwise she would drown in washer.  She finally stopped moving and realized that her mom was opening the washer door.  She tried one more time to stop her mom from putting her in the wash.  <br>\r\n<br>\r\n\"mom!!!!\" she screamed at the top of her high pitched voice, \"i'm shrunk inside the sheets, help!!!\"  Her mom could still not hear her however and it wasn't looking good for Jenna.  She was about to say her final prayers when she saw a small gap between two separate sheets.  There was a chance she could escape, but she didn't know how.  The only quick she could think of was to use her gymnastics skills to tumble and leap out of the sheets.  So she took a running start and tucked her bare legs and feet in and rolled out of the sheets just as her mom picked them up and threw them into the washer.<br>\r\n<br>\r\nJenna breathed a sigh of relief as she narrowly escaped death.  She then got to her barefeet and looked around.  She was in the laundry room standing on the tile floor that her mother recently mopped.  She had to figure out what to do next but as she turned around she saw...</span></div></div>",
            "created":1085720400,
            "id":200757,
            "title":"Escape??"
        },
        "11111":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "She wants you as a pet",
                "A doll"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna then looked up and saw her 5-year old sister Sarah looking down. She smiled and reached downed and grabbed her.<br>\r\n<br>\r\n\"Sarah, can you get mom?\" she started to ask, but Sarah ignored her and rushed up to her room.</span></div></span></div>",
            "created":1085893200,
            "id":200946,
            "title":"Little sister, big sister"
        },
        "111111":{
            "author_id":"bask25456",
            "author_name":"bask25456",
            "choices":[
                "...Mom comes in",
                "...Mom yells \"Dinner!\""
            ],
            "content":"<div class=\"\"><div> <span>Sarah takes Jenna to her room. Jenna squeals when she sees the cage, and Sarah giggles:<br>\r\n<br>\r\n\"You’re squeaky, just like Chuckles.\" Sarah told her. Jenna gasped. Chuckles, Sarah's hamster, had died last week. <br>\r\n<br>\r\nSarah came to the cage and dropped Jenna in.<br>\r\n<br>\r\n<br>\r\n\"Oof.\" She gasped as she hit the hard floor. She looked around. She was in a gigantic cage, surrounded by woodchips. There was a water bottle at one end. She looked up at the smirking face of her \"little\" sister. Sarah was looking at her proudly:<br>\r\n<br>\r\n\"Like it?\" she asked. Jenna took a breath:<br>\r\n<br>\r\n\"Sarah, if you let me out of here, I'll get you a much better pet, I promise.\" Sarah giggled:<br>\r\n<br>\r\n\"Nah, you're so much cooler than any other pet.' Jenna got angry:<br>\r\n<br>\r\n\"Sarah, if you don't let me out you're going to be in so much trouble with mom!\" She yells. Sarah frowns, and shakes the cage. Jenna slips in the woodchips and falls down again. Sarah smiles again:<br>\r\n<br>\r\n\"Nah, I don't think so.\" She shakes the cage again and watches with interest as Jenna tumbles around the floor. Just then...</span></div></div>",
            "created":1133758800,
            "id":288041,
            "title":"A new pet for Sarah"
        },
        "1111111":{
            "choices":[
                "a spider crawls into the cage",
                "her little sister returns and wants to play"
            ],
            "content":"<div class=\"\"><div> <span>\"MOMMY LOOK, I HAVE A NEW PET! IT'S JENNA HE HEE HEEE!\" as she points to her sister! Her mom, ignoring her daughters imagnination, replies with a smirk, \"THAT'S NICE DEAR. NOW LET'S GO. WE GOT TO GO SHOPPING. COME ON.\" She puts her arm around her daughter and led her out the room! \"noooooo mom noooooo!\" Jenna is left as her little sisters pet!</span></div></div>",
            "created":1312088400,
            "id":1158504,
            "title":"pet forever!"
        },
        "11111112":{
            "author_id":"doodad",
            "author_name":"smallprint",
            "choices":[
                "\"REPLACE THE WOODCHIPS, SQUEAKY'LL HURT HERSLEF LIKE THIS.\" (Oh no...)",
                "\"LET HER OUT SARAH, WE SHOULD SEE A DOCTOR OR SOMETHING.\" (YES!)"
            ],
            "content":"<div class=\"\"><div> <span>Jenna tried to escape the cage, but wasn't strong enough to open the latch, and bending the wires, which were like steel bars to her, was right out.<br>\r\nA little defeated, Jenna decided to instead go and look around the cage. <br>\r\nWalking around, the wood chips chafing and prodding her feet, and weren't very stable either...<br>\r\n<br>\r\nThe cage was surprisingly clean, Sarah was talking about wanting a new pet for a while...<br>\r\nThe food bowl was empty, the water bottle (luckily?) wasn't. There was a small, plastic hamster wheel in the corner, and a... hamster toilet in the other...<br>\r\nIn the front left corner there was a plastic hide box, somewhat shaped like a log cabin. Looking in, it was filled with cotton fluff or something.<br>\r\nAfter about half an hour of looking around, Jenna gave up. <i>Maybe</i> she could convince Sarah to let her go later, but there was no way she'd be able to escape this cage on her own. This small, child friendly, discount store, pet cage...<br>\r\nJenna went up to the cotton fluff, and decided to sit down. Eventually, she started to doze off a little.<br>\r\n<br>\r\nAt least an hour later, Jenna was loudly awakened by the sound of the door slamming shut.<br>\r\nMaking her way out of the box, she was too late, and Sarah started tapping the wires of the cage.<br>\r\n\"SQUEAKY! COME OUT COME OUT WHEREVER YOU ARE!\" Sarah spoke, before she started laughing at Jenna, groggily covering her ears, just outside the tiny house.<br>\r\n\"Squeaky?!\" Jenna asked. <br>\r\n\"YOUR NAME IS SQUEAKY NOW!\" her little sister said. \"PETS SHOULD HAVE PET NAMES!\"<br>\r\n\"But -\"<br>\r\n\"OH! I'VE GOT SOMETHING FOR YOU!\" Sarah remembered, and raised... an almost empty hamburger box.<br>\r\nOpening the latch, she took out \"Jenna's\" food bowl, and when it returned, Jenna saw it was filled with the remains of a hamburger and some french fries, bitten in (supposedly) little chunks. She was feeding Jenna. Her own baby sister was feeding Jenna food scraps...<br>\r\n<br>\r\nSarah leaned closer, looking at Jenna like she was a little pet. \"SQUEAKY NOT HUNGRY?\" Jenna shook no. \"THEN LET'S PLAY!\"<br>\r\n\"Wha- What are we gonna play?\" Jenna gulped, hoping to play along until she could convince Sarah to show her to their mother, or at least sneak away when her \"little\" sister wasn't looking. \"Dolls? Hide-and-go-seek? A board game?\"<br>\r\nHer little sister's face lit up, probably happy about Jenna playing along, and she pointed past Jenna. Pointing to the hamster wheel behind her.<br>\r\n\"Wha- NO! I'm not a hamster!\" Jenna yelled. \"I'm not gonna run in some stupid wheel!\"<br>\r\nSarah frowned, and her hand moved into the cage. Rather than move her out, though, she moved her into the wheel.<br>\r\n\"SQUEAKY, PLAY.\" her sister commanded. \"GO!\"  ... at least she didn't sound too angry?<br>\r\n<br>\r\nBut Jenna decided sh didn't have much of a choice; she didn't want to make an enemy of her giant baby sister.<br>\r\nShe started running, in  the corner of her eyes she could see Sarah look less angry.<br>\r\nAfter running for about a minute, the wheel suddenly went really fast, Jenna falling over, and getting carried around. Sarah had given the wheel a little push, and was clearly laughing at her \"big\" sister spinning around. Eventually, the wheel stopped abruptly, a giant thumb pressing down on the wheel.<br>\r\n\"THAT WAS FUNNY!\" she had still not completely stopped laughing. \"NOW WERE-\"<br>\r\nThe door flew open, and their mother, walked into the room. \"SARAH, HAVE YOU SEEN JENNA?\"<br>\r\n\"YES, MOMMY!\" Sarah said. Her hand left the cage, and she turned to face her mother, though not before closing the latch. \"SHE'S RIGHT HERE! SHE'S MY PET NOW!\" she turned a little aside to show off Jenna in the cage.<br>\r\n<br>\r\nAs her mother, rolling her eyes, started walking closer towards the cage, Jenna ran up to the edge of the cage and started waving: this could be her way out of here!<br>\r\nMaria looked down, and gasped. Jenna really was there; the size of a hamster and dressed in only her underwear, but definitely there.<br>\r\nShe bent over to get a closer look. Regaining herself, her mother started talking.  But not to Jenna.<br>\r\n\"SARAH? \" her mother turned away from the cage and faced her youngest daughter.<br>\r\n\"YES, MOMMY?\" she seemed actually surprised. After all, she'd already told her about Jenna before.<br>\r\n\"WHY IS YOUR SISTER TINY?\" her mother put her hand on her hips, a display of authority that gave Jenna some hope.<br>\r\n\"DUNNO. I FOUND HER LIKE THAT.\" Sarah answered, puzzled, but, unfortunately, not concerned.<br>\r\n\"I woke up li-\" Jenna wanted to add to the conversation, but  Sarah started tapping the cage again to shut her up. \"SHUSH, SQUEAKY!\" <br>\r\n\"DON'T DO THAT, DEAR, THAT'S MEAN.\" her mother said \"WHY IS SHE IN A CAGE?\" Jenna wasn't sure, looking at the back of her mother's head from below and all, but she thought she could see her raise an eyebrow.<br>\r\n\"BECAUSE SHE'S TINY AND CUTE AND MY PET NOW! I'VE NAMED HER SQUEAKY!\" Sarah perked up, obviously finding this all very amusing.<br>\r\nA short pause followed. Their mother looked puzzled; this wasn't and everyday problem, after all. She even leaned closer to the cage to get a better look at Jenna.<br>\r\nFinally, she turned back to Sarah.</span></div></div>",
            "created":1539450660,
            "id":2563329,
            "title":"Stuck until Sarah returns..."
        },
        "111111121":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Sarah decides to have more \"fun\" with the hamster wheel",
                "Sarah has something else in mind",
                "Sarah decides her pet needs pretty clothes."
            ],
            "content":"<div class=\"\"><div> <span>Maria looked at her young daughter and said, \"Sarah, you have to get rid of those woodchips.\"<br>\r\n<br>\r\nBoth Jenna and Sarah were confused, \"why, mommy?\" Sarah inquired.<br>\r\n<br>\r\n\"Squeaky isn't like Chuckles Sweetie,\" Maria pointed out. Jenna couldn't believe her mother just used the stupid pet name Sarah had given her, \"remember when you lost your shoes at the park and got that splinter?\"<br>\r\n<br>\r\nSarah frowned, \"Yeah, that hurt a lot.\"<br>\r\n<br>\r\n\"Well, Squeaky can't walk comfortably in those woodchips like Chuckles could, especially when she doesn't have shoes.\"<br>\r\n<br>\r\nSarah reached into the cage, and despite Jenna's protests, took her shrunken sister into her hand, \"I'm sorry, Squeaky, I didn't know.\"<br>\r\n<br>\r\n\"I'll watch Squeaky while you dump the woodchips, Sweetie,\" Maria offered as she held out her hand.<br>\r\n<br>\r\nSarah happily put Jenna in her mother's hand, \"thank you, Mommy,\" Sarah thanked as she kissed her mother on the cheek, \"be good Squeaky, I'll be right back,\" she promised.<br>\r\n<br>\r\nAfter Sarah left the room, Jenna looked up at Maria, \"Mom, please tell me you're joking,\" she said hopefully.<br>\r\n<br>\r\n\"I'm quite serious young lady, you've been out of control lately and haven't been pulling your weight around here, and I think some time as Sarah's pet will do you well she's been begging you to spend time with her for months, and I think you owe it to her.\" Maria lectured.<br>\r\n<br>\r\n\"But what if I get stuck like this?\" Jenna demanded.<br>\r\n<br>\r\n<br>\r\n\"I'm sure Sarah will take good care of you.\" Maria coldly replied.<br>\r\n<br>\r\nJenna was about to argue when the door opened and Sarah came back in with the cage, \"I dumped the woodchips Squeaky, and look I put a washcloth was down, so it's nice and comfy.\"<br>\r\n<br>\r\n\"That's very considerate of you, Sarah,\" Maria praised, \"now Sweetie, if you want to keep Squeaky, you have to take care of her; do you promise to do that?\"<br>\r\n<br>\r\n\"I do, Mommy,\" Sarah promised, \"I'll feed her, make sure she has lots of water, clean up after her, and I'll make sure she has lots of fun.\" Jenna didn't think she'd like any fun Sarah had in mind, and she found herself pulled into a tight hug as Sarah took her back from Maria. \"We're going to be best friends.\"<br>\r\n<br>\r\n<br>\r\nWith a pat on the head, Maria left Sarah and Jenna alone, and with a smile, Sarah announced, \"let's play more Squeaky you're super fun!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1580328420,
            "id":2780142,
            "title":"Punished Pet!"
        },
        "1111112":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Get let out of the cage",
                "stay in the cage"
            ],
            "content":"<div class=\"\"><div> <span>\"Dinner\" mom calls.<br>\r\n<br>\r\n\"Coming mommy\" Sarah calls back sealing Jenna's prison. \"I'll be right back be good and I'll bring you food\" she added to her sister as she left.<br>\r\n<br>\r\nJenna tried to escape but the cage proved her match with the lock and only gate on top and the bars being too smooth to climb. Defeated and dejected Jenna laid down on the wood chipped floor and thought \"mom's been distant since dad left she'd eventually realize I'm missing but she's just gonna make excuses say I'm at a friends house for the first few days and then she'll send out the police\" Jenna told herself but that didn't cheer her up. \"They'll look all over town but they'll never look in Sarah's hamster cage\" she said sadly.<br>\r\n<br>\r\nAt that moment the bedroom door opened and Sarah came in with a cracker and small plate \"hi Jenna\" she greeted happily as she put the plate on her bed. Sarah crushed the cracker in her hand and let in fall on the plate \"hi Jenna\" she repeated a little angry this time.<br>\r\n<br>\r\n\"Hi Sarah\" Jenna said back quietly.<br>\r\n<br>\r\nSarah walked over to Jenna and opened her prison \"you don't have to stay in the cage you know\" she said much to Jenna surprise.<br>\r\n<br>\r\n\"I don't?\" Jenna asked hopefully.<br>\r\n<br>\r\n\"But if I let you out I get to take you everywhere\" said Sarah smiling.<br>\r\n<br>\r\n\"Take me everywhere?\" asked Jenna.<br>\r\n<br>\r\n\"Yeah\" said Sarah as she grabbed a pair of pajamas from her closet \"like mommy said it's bath time so you can stay in the cage with your food or I can let you out and you can come with me and after we get clean you can eat your dinner in bed with me\" Sarah explained.<br>\r\n<br>\r\nJenna thought for a moment \"Well...\"</span></div></div>",
            "created":1365821400,
            "id":1570623,
            "title":"...Mom yells \"Dinner!\""
        },
        "11111121":{
            "choices":[
                "Jenna Concorda",
                "Jenna Escapa"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna pensou e Disse, Deixa fóruns da gaiola, Sarah pegou SUA Irmã e levou Ate O Banheiro, FICA Você. Aqui los Cima enquanto eu tomo banho. </span></div></span></div>",
            "created":1399328520,
            "id":1792067,
            "title":"Get let out of the cage"
        },
        "111111212":{
            "choices":[
                "Jenna falls into the laundry basket ",
                "Jenna falls into the trash"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna knows that her sister will not help, she needs help from someone older. Jenna tries to escape, more like? she goes to the tip of the sink and decides to jump in the laundry basket. Jenna skip </span></div></span></div>",
            "created":1399410600,
            "id":1792627,
            "title":"Jenna Escapa"
        },
        "111112":{
            "choices":[
                "Sarah takes Jenna to their mom",
                "Sarah takes Jenna somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Sarah took Jenna to her room and got out her dollhouse and put Jenna next to it.<br>\r\n<br>\r\n\"Jenna, go into the dollhouse!\" Sarah commanded.<br>\r\n<br>\r\n\"Why are you doing this?\" Jenna asked her.<br>\r\n<br>\r\n\"Hee hee hee, you sound like a mouse,\" Sarah replied with laughter.<br>\r\n<br>\r\n\"Sarah, if you get mom for me I'll play with you once I'm big again,\" Jenna said.<br>\r\n<br>\r\n\"Really?\" Sarah asked.  Jenna nodded.  \"Okay, let's go.\"  Sarah stuck out her hand and Jenna got on and sat cross-legged on it.<br>\r\n<br>\r\n</span></div></div>",
            "created":1086066000,
            "id":201210,
            "title":"Jenna the doll"
        },
        "1111121":{
            "author_name":"Lil' Sista",
            "choices":[
                "Does Sara give up?",
                "Does Sara continue to talk to her mom?"
            ],
            "content":"<div class=\"\"><div> <span>I was so excited when we got down, Sarah said to Mom, \"Mommy, something happened to Jenna and now she's small that you can't see her.\"<br>\r\n<br>\r\nMom ignored her than said, \"Sarah I am very busy. Wait about 10 -15 minutes and then I'll listen to your great imaginative stories, okay.\"</span></div></div>",
            "created":1086670800,
            "id":202288,
            "title":"Relieved.....Or Not?"
        },
        "11111211":{
            "author_id":"pkcommado",
            "author_name":"Shrinking Maniac",
            "choices":[
                "No, history repeats itself",
                "Jenna stays in her hand"
            ],
            "content":"<div class=\"\"><div> <span>Sarah looked discouraged and walked away. This was the first time she'd ever given up on something.<br>\r\n<br>\r\n\"No, go back and try again,\" Jenna pleaded as they headed down the hallway.<br>\r\n<br>\r\n\"Gotta go potty first,\" she announced.<br>\r\n<br>\r\n\"No, not yet.\"<br>\r\n<br>\r\nJenna was really scared now. Yesterday Sarah had their mother's car keys when she went potty and dropped them in when she flushed. The same with the goldfish the week before and Sarah's favorite Barbie accessories the week before that. The girl had an obsession with flushing things she liked down the toilet. Now Jenna wished her little sister didn;t like her so much. <br>\r\n<br>\r\nThey got to the bathroom and Sarah easily got on the toilet without dropping Jenna. However, Jenna knew that if it happened, it would be at the end. She started to struggle, but realized she might make a self-fulfilling prophecy. But if Srah could be less persistent, maybe she'd changed in other ways as well.</span></div></div>",
            "created":1089176400,
            "id":206498,
            "title":"The One Time She Gives Up"
        },
        "111112111":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Looked down at Jenna with a grin \"anything?\"",
                "Flushed"
            ],
            "content":"<div class=\"\"><div> <span>Jenna hoped and preyed as Sarah began using the toilet but at the end after wiping the doll sized girls drops from her hand. Jenna lands in Sarah's used toilet water with a splash she looked up at the giant as she reached for the handle \"flushy time\" said Sarah excitedly.<br>\r\n<br>\r\n\"No Sarah no don't flush me\" Jenna begged.<br>\r\n<br>\r\n\"Flushy time\" Sarah repeated her hand on the handle.<br>\r\n<br>\r\n\"Please Sarah I'll do anything\" Jenna begged.<br>\r\n<br>\r\nSarah....</span></div></div>",
            "created":1352689500,
            "id":1466047,
            "title":"No, history repeats itself"
        },
        "1111121112":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "find a way to escape",
                "wait to be discovered"
            ],
            "content":"<div class=\"\"><div> <span>Jenna paddled desperately in the fowl smelling yellow water, screaming up at her little sister not to flush. But it was useless, the little girls just smiled and moved to do what she had been taught to do once she was done with her business. All Jenna could do was watch as that little hand that was now big enough to hold her with ease clutched at the toilet handle and pulled it down.<br>\r\n<br>\r\nOnly for nothing to happen!<br>\r\n<br>\r\nSara toggled the handle over and over with a confused frown, not understanding. Jenna could almost cry with relief as she realized that the toilet must be broken. No trip through the pipes for her! But she still had to get out of the toilet, she still needed Sara’s help.<br>\r\n<br>\r\n“Sara!” Jenna called out to her younger sister. “Sara, the toilet’s broken, you can’t flush it. Just get me out of here and take me to mom, please!” she was really getting desperate now. This had been too close, clearly she couldn’t trust Sara with her safety. <br>\r\n<br>\r\nSara continued to mess with the handle for a bit more before she huffed in defeat, sticking her lower lip out rather cutely. Finally, she looked back down at Jenna, still frowning. “ Guess I’ll just have to leave it.”<br>\r\n<br>\r\nJenna’s panic started rising again. “SARA! Please, get me OUT!” she started splashing more erratically, her arms getting tiered; she’d never been much of an athlete. “SARA!!!”<br>\r\n<br>\r\nSara looked in at her little big sister. She thought it was funny watching her flail around like that, the fact that she was swimming in Sara’s pee was even funnier. But, at the plea to be helped out, Sara scrunched up her face in disgust. “Ew, no, you’re all covered in tinkle. Mom said not to touch that.” <br>\r\n<br>\r\nJenna couldn’t believe this. Her sister dropped her in here and now refuses to get her out because it’s gross! This really couldn’t be happening right now! “Sara, please! Just get me out of here, I’m begging you!”<br>\r\n<br>\r\nJust then they both heard their mother calling them for breakfast, telling them that if they don’t hurry they’ll be late for school. Before Jenna could try and reason with Sara again, her sister cut her off. “ I gotta go now. bye Jenna!” Jenna screamed as her sister shut the lid on the toilet and walked away, leaving Jenna trapped in smelly darkness.<br>\r\n</span></div></div>",
            "created":1583985600,
            "id":2800353,
            "title":"Flushed... or not..."
        },
        "11111211122":{
            "author_id":"shayna01",
            "author_name":"Mary shrink",
            "choices":[
                "a strange object floating in the bowl",
                "that someone forgot to flush"
            ],
            "content":"<div class=\"\"><div> <span>Jenna continued to doggy paddle around the bowl, using the limited light that filtered in from under the edge of the toilet seat and lid so far up above, in hopes of finding some way out. Her sister hadn’t even used toilet paper for crying out loud! Jenna whimpered in the darkness; her arms were really starting to get tiered.<br>\r\n<br>\r\nJust then, she heard the muffled booms of someone approaching. It was too powerful to be her sister, so it had to be her mother! Oh, maybe she could get out of this situation after all! She could even hear her mother calling for her in an increasingly irritated tone. She heard the voice fade away for a few minutes with the booming steps, making Jenna worry again, but then she started coming back!<br>\r\n<br>\r\nMary poked her head into the upstairs bathroom, annoyed that she couldn’t seem to find her oldest anywhere. When she had asked Sara at breakfast, she had just said that Jenna was in the toilet. Mary had assumed that her youngest had meant to say that Jenna was going to the bathroom, so she had dismissed it at the time. But now Sara was on her way to school and Jenna was nowhere to be seen. Mary had checked the entire upstairs by this point, and she was starting to think that Jenna had just gone to school without a word. That was pretty unusual for her, but maybe that talk they’d had last night about responsibility and getting better grades had had an effect; or maybe Jenna was mad about getting grounded and was retaliating by avoiding her mother, again…<br>\r\n<br>\r\nShaking it off, Mary decided not to worry about it anymore. Being in the bathroom at this time, Mary felt the sudden urge to go. Approaching the porcelain throne, Mary’s old ears failed to pick up on the faint screams and cries for help coming from inside the bowl. When Mary lifted the lid off the toilet, she sees…<br>\r\n</span></div></div>",
            "created":1583991720,
            "id":2800375,
            "title":"my mother, mary"
        },
        "111112112":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "house",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Jenna waited in her sisters hand eyes closed as but as she herd the pouring sound and then the flush she opened her eyes and saw she was now standing on the sink counter and she felt extremely relived as Sarah washed her hands. However in the midst of this moment of relief that her mothers voice came from down stairs. \"Girls I have to go there was an emergency at work and they need me\". For a moment Sarah and Jenna stared at each other then Sara quickly grabbed her sister and ran down stairs until she was in front of her mother who's was hurriedly putting on a jacket. \"But mommy what about Jenna she's still tiny and scared what should I do?\" Sarah asked in a concerned voice. \"OK Sarah I'm I need to get going and I don't have time for-\" but Sarah interrupted her. \"But mommy what about Jenna?\". Her mother Responded with out looking at Sara. \"Ok Sweetie here's what you need to do have fun with her, play with her, keep her safe\". Jenna wanted to speak up but at that moment Sarah spoke again. \"So I can have her and play doll's with her and-\" but she was cut off before she could finish. \"Yes Sara do whatever you want too her now I have to go and I wont be back until late kisses\" and with that Jenna's mother was out the door.<br>\r\n\"Oh boy did ya hear that Jenna we get to play together all day long\" said Sarah she then decided too make Jenna play--------.</span></div></div>",
            "created":1300770000,
            "id":1074667,
            "title":"Jenna stays in her hand"
        },
        "11111212":{
            "choices":[
                "She put jenna in a dollhouse",
                "she out jenna on her bed"
            ],
            "content":"<div class=\"\"><div> <span>\"But mom, jenna is very tiny and she is scared. She....\"But her mom cut her off. \"Sara listen I really can't talk right now, ok, I promise to talk to you in a bit, now please go to your room.\" Keeping busy and not really paying attention to her daughter, she finally let Sara talk while she worked, \"Ok Sara quickly what? \"But as Sara started talking, something very important caught her mothers eye and she was distracted again. \" MOM, jenna is small and she is like a doll now what should i do?\" Her mom responded, \"Just play with her honey, is that it?\" Jenna can't beieve it, \"MOM PLEASE HELP!\" But was not heard.Sara continued, \"So is it ok if i keep her mom? Can she be my doll?\" Jenna tried to stop her sis but itwas not working. Her mom replied, \"Yeah whatever dear. Now let me get back to this ok.\" Sara got excited, \" FOR REAL, I CAN KEEP HER! FOREVER MOM REALLY SHE'S MINE!\" \"YES, honey, whatever, she's yours ok, forever, ok, now go play with the doll and I'll take you for ice cream later.\" Sara squeezed jenna and ran to her room.</span></div></div>",
            "created":1295845200,
            "id":1041027,
            "title":"Does Sara continue to talk to her mom?"
        },
        "111112121":{
            "choices":[
                "stay and search the rooms",
                "try too get out and get help"
            ],
            "content":"<div class=\"\"><div> <span>-goes in sara's room-<br>\r\njenna:sara what are you doing?! why are we going too your room?<br>\r\nsara:you heard mom your mine now!<br>\r\n-sara walks too her doll house and puts jenna in one of the rooms-<br>\r\nsara:now be good. mom's gonna take us too get ice cream!<br>\r\n-sara leaves the room-<br>\r\njenna:great no help from her what should i do?</span></div></div>",
            "created":1302584400,
            "id":1087164,
            "title":"She put jenna in a dollhouse"
        },
        "111112122":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Run",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>Sarah threw her door open and ran to her bed where she dropped her sister. Jenna landed on her little sister’s Little Mermaid bedsheets with a plop. Jenna looked up into Sarah’s face which was looking down on her greedily. “Sarah,” Jenna said as she tried to slowly back away, “we have to go back to mom, you have to show me to her.”<br>\r\n<br>\r\n“Nuh uh!” Sarah declared, “you heard mommy, you’re mine now, so you wait right there like a good dolly and wait while I find you a pretty outfit to wear!” Sarah turned her back on her sister and went to the plastic box she kept her dolls clothes in. Jenna knew she could sit tight or run.<br>\r\n</span></div></div>",
            "created":1537259520,
            "id":2549410,
            "title":"she put jenna on her bed"
        },
        "1111121221":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Sarah stops just in time ",
                "Squish"
            ],
            "content":"<div class=\"\"><div> <span>Jenna decided that if Sarah wasn’t going to be of any help to her, she would get to mom herself and hopefully mom would know what to do or at least keep Jenna out of Sarah’s playful hands. Jenna went to the side of the bed as quietly as she could and held onto the sheets as best she could while she slowly lowered herself. Finally, Jenna’s feet touched the ground but just as she let go there came a cry, “oh, I like this one best!”<br>\r\n<br>\r\nSarah turned around and saw her empty bed then lowered her vision to you, “bad dolly!” Sarah stood up and walked over to you as you tried to walk away. The two of you scrambled for a minute, and before Jenna knew what was going on she tripped, and Sarah’s sneaker was closing in on her. Jenna looked up at the sneaker and noticed there was a small piece of gum stuck to it, was this to be the last thing she saw?<br>\r\n</span></div></div>",
            "created":1537271340,
            "id":2549448,
            "title":"Run"
        },
        "11111212211":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "Play along for now",
                "Try to escape again"
            ],
            "content":"<div class=\"\"><div> <span>Jenna looked up the wad of gum less than an inch (to her) away from her face when suddenly it stopped. Sarah removed her foot and was looking down at Jenna in complete shock. “Wha… I… you…” Sarah stammered. Grasped Jenna in her hands and returned the doll-sized teen to her bed but this time continued to look at her shrunken sister than to her feet before tearing off her shoes and throwing them aside. However, Sarah watched her footwear hit the ground with a small thud and gasped, she looked at Jenna and then all around the room. “You’re tiny!” Sarah spoke.<br>\r\n<br>\r\nJenna was annoyed, “really? I had no idea.”<br>\r\n<br>\r\n“No,” Sarah said, “I mean you’re the same size as my Barbies, but you’re not all hard like them. If I stepped on you, I would have squished you like a bug!”<br>\r\n<br>\r\n“Right,” Jenna replied still not seeing where Sarah was going with this.<br>\r\n<br>\r\n“You’re so little, there are so many things that could hurt you,” Sarah explained.<br>\r\n<br>\r\n“Exactly,” Jenna smiled, “that’s why you’ve got to take me to mo…” <br>\r\n<br>\r\nBut Jenna’s sentence was cut off as Sarah pulled her into a hug, “don’t worry Jenna, I’ll keep you safe,” she promised. Sarah returned her sister to her Ariel pillow, “you stay here.”<br>\r\n<br>\r\nJenna watched as Sarah went about her room doing something their mother had been trying to get her to do for years; cleaning. Sarah put away her toys, picked up her dirty clothes, put her shoes in the closet, put away every crayon or marker she could find and threw away every piece of litter and general junk she had once insisted was a precious treasure. “There,” Sarah said satisfied, “now you can move around on the floor, and I can see you so I won’t step on you.”<br>\r\n<br>\r\nJenna was starting to see. Sarah had, at last, realized her sister was not a doll and was beginning to see the shrunken teen as human. Perhaps if Jenna could play along with Sarah for a little while, she could get her sister to understand she needed to be returned to her proper size.<br>\r\n</span></div></div>",
            "created":1537273920,
            "id":2549454,
            "title":"Sarah's close call"
        },
        "1111122":{
            "author_id":"powor",
            "author_name":"Powor",
            "choices":[
                "She takes her to Mom like promised.",
                "\"We gotta eat breakfast firstest!\""
            ],
            "content":"<div class=\"\"><div> <span>Jenna felt a bit more calm. She was happy knowing her little sister was taking her to her mother.<br>\r\nShe saw her mother go down the right down the right hallway. Sarah headed left.<br>\r\n<br>\r\n\"Sarah mom went down the other hallway.\" Jenna told her sister.  \"I'm getting you clothes firstest.\" Sarah said with a pronounced lisp.<br>\r\nSarah took Jena in the hallway closet. There she pulled out a doll in pajamas.<br>\r\n<br>\r\nShe then undressed the doll and gave the clothes. She set Jenna on the floor. <br>\r\n\"Jenna you get dressed!\" Sarah told her older sister. Jenna was not in the right place to argue not only could easily be flattened by her younger sister she was not dressed either.<br>\r\n<br>\r\nJenna quickly got dressed. The clothes fit her well considering how small she was.<br>\r\n\"Alright I got dressed. Now will you take me to mom like you promised?\" Jenna begged her sister.<br>\r\n<br>\r\nSarah thought for a second...</span></div></div>",
            "created":1086066000,
            "id":201248,
            "title":"Jenna the Dolly needs clothes"
        },
        "11111222":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Finally, she brings you to mom",
                "She brings you to her school to show her friends"
            ],
            "content":"<div class=\"\"><div> <span>\"First, you have to eat breakfeast\" Sarah told Jenna.<br>\r\n<br>\r\n\"Sarah, wait-\"<br>\r\n<br>\r\nSarah rushed to the kitchen, and placed Jenna on the table. She was in no position to escape, and besides, Sarah seemed to trying to help in her own way.<br>\r\n<br>\r\nSarah came back and placed a small strawberry on the table next to Jenna, to whom it was the size of her bedroom. Still, she was hungry, and she started to bite into it and eat. Soon, you were full, though you had not eaten even a third of the berry.</span></div></div>",
            "created":1086238800,
            "id":201441,
            "title":"Breakfeast"
        },
        "111112222":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "She shows you to her friends on the bus",
                "Waits until she gets to school to show you"
            ],
            "content":"<div class=\"\"><div> <span>HONK! HONK!<br>\r\n<br>\r\n\"Sarah, the bus is here!\" cried their mom.<br>\r\n<br>\r\n\"Sarah, take me to mom!\" you asked nervously.<br>\r\n<br>\r\nSarah thought about it for a while.<br>\r\n<br>\r\n\"Okay, but first I'm taking you to school!\"<br>\r\n<br>\r\n\"Sarah, no, no\" you ordered, but you were ignored as she carried you to the bus,</span></div></div>",
            "created":1086411600,
            "id":201887,
            "title":"Decision"
        },
        "1111122221":{
            "author_id":"cartoon",
            "author_name":"shadow",
            "choices":[
                "yes I want your help",
                "no after school I am going to show her to my mom"
            ],
            "content":"<div class=\"\"><div> <span>Sarah took a seat in the middle of the school and waited for a while finally her best friends Denise and Michelle got on. \"Hey guys I got something too show you\" said Sarah her eyes twinkling with mischief. \"What is it\" asked Denise a light brown haired girl. \"Look\" said Sarah excitedly opening her hand to frightened Jenna. \"Oh what a cute little doll but it kind of looks familiar\" said Michelle a girl with blond pigtails leaning in from the seat behind for a closer look. \"That’s because it's not a doll its Jenna she shrunk somehow and now like a living doll\" said Sarah shaking her hand a bit so Jenna had to catch herself. Denise and Michelle both gasped and Michelle had to stop herself from falling since she was leaning on the back of the seat.<br>\r\n\"Whoa it is Jenna wow she's so tiny\" said Denise stroking Jenna's hair with her pinky. \"So what happened to her?\" asked Michelle. \"Well it's like I said I don’t know I just found her in the hallway she was naked then so I dressed her in Barbie's pj's\" said Sarah. \"Well what are you going to do with her\" asked Denise but before Sarah could answer Michelle intervened. \"What do you mean she's going to take care of Jenna Herself and she wants’ us to help right Sarah?”  Sarah responded...</span></div></div>",
            "created":1307163600,
            "id":1119665,
            "title":"She shows you to her friends on the bus"
        },
        "1111122222":{
            "author_id":"kev77",
            "author_name":"kev",
            "choices":[
                "Take her to the science lab for more tests",
                "To the locker room "
            ],
            "content":"<div class=\"\"><div> <span>'Hey, Sarah what you got there'? asked her best friend Michelle, Sarah held out her hand and showed her her tiny barefoot sister sitting frightened in her palm. 'Aww a cute little doll....but she looks very familiar.....almost like your sister' 'That's because it is my sister she's been shrunk!' 'Can I hold her? asked Michelle, Sarah handed over her sister to the delight of Michelle, 'I can't believe how tiny she is' as she lifts her tiny foot up with her fingertip, All of a sudden a menacing smile appears on Michelle's face and she turns and runs off with the tiny girl,<br>\r\n<br>\r\nSo where does Michelle take her;</span></div></div>",
            "created":1306645200,
            "id":1115307,
            "title":"Waits until she gets to school to show you"
        },
        "11112":{
            "choices":[
                "Jenna's mom takes the broom and sweeps",
                "Jenna shrinks again"
            ],
            "content":"<div class=\"\"><div> <span>Jenna turns around and sees the scariest spider she has ever seen.  This particular spider is scary because it looked like the size of a bear to Jenna.  She froze in fear as the spider came running toward her.  Jenna screamed and ran as fast as she could but the dirty tile floor was hard on her bare feet so she couldn't run that fast.  <br>\r\n<br>\r\nShe saw a broom leaning up against a wall and she thought she could hide behind that until the spider went away.  As she predicted, the spider went off to find other things to do and Jenna breathed a sigh of relief.</span></div></div>",
            "created":1086238800,
            "id":201475,
            "title":"Itsy, Bitsy Spider and Itsy, Bitsy Jenna"
        },
        "111121":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "You climb out",
                "Today's garbage day"
            ],
            "content":"<div class=\"\"><div> <span>Just as the spider left, Jenna saw a huge broom coming toward her like a tidal wave. <br>\r\n<br>\r\nShe screamed and ran away, but it was a futile effort, and soon she was caught up in the sticks.<br>\r\n<br>\r\nShe was then dropped on a dustpan, and thrown into the trash.<br>\r\n<br>\r\nSwepted</span></div></div>",
            "created":1086325200,
            "id":201722,
            "title":"Swepted away"
        },
        "1111211":{
            "choices":[
                "the living room",
                "the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>Jenna climbed out of the trash can with great ease. she quickly ran out of the room before anything else happened. in the hallway she looked for something that would get her some easy attention. perhaps if she could climb onto a table, she could get a better POV point. but since the hallway had no tables, she had to go somewhere else. so jenna headed off to....</span></div></div>",
            "created":1086843600,
            "id":202633,
            "title":"trying to find attention"
        },
        "11112111":{
            "author_id":"pkcommado",
            "author_name":"Shrinking Maniac",
            "choices":[
                "She gets into hiding",
                "She gets vacuumed up"
            ],
            "content":"<div class=\"\"><div> <span>Jenna darted into the living room and giggled as the carpeting tickled her whole body. She was now up to her neck in the fibers. This was hardly what she wanted, now people couldn't see her. She narrowly dodged a foot slamming down next to her. The wall missed her by mere inches from her perspective. She craned her neck and looked way up to see her mother.<br>\r\n<br>\r\n\"I'm saved, she'll see me,\" Jenna said aloud before she realized there was no one to be talking to except herself. \"Mom! Mom! Look down at the floor.\"<br>\r\n<br>\r\nHer mother turned away and a loud roar deafened poor puny Jenna.<br>\r\n<br>\r\n\"Oh, no!\" Jenna shrieked. \"If she had a broom earlier, that means today's cleaning day. That means vacuuming.\"</span></div></div>",
            "created":1089176400,
            "id":206496,
            "title":"Wrong Day For the Living Room"
        },
        "111121111":{
            "choices":[
                "Her mother starts to vaccuum under the couch",
                "there's an insect watching her."
            ],
            "content":"<div class=\"\"><div> <span>Luckily for jenna, her mother was vaccuuming further from her, so she had one chance to get under the couch. she darted as fast as possible, and made it with enough time to spare. the underneath was a dark place with giant Dust balls, and even wrappers and other lost items underneath. jenna wasted little time and Darted to the far back of the cave that was the living room couch.<br>\r\n<br>\r\nShe sat and kept her hands on her ears as the deafening roar of the vaccuum continued to hum. \"i'm safe here\", she said out loud. and all seemed to be going her way when suddenly....</span></div></div>",
            "created":1089176400,
            "id":206614,
            "title":"couch cave"
        },
        "1111211111":{
            "choices":[
                "Falls out the bottom",
                "Mom missed a spot"
            ],
            "content":"<div class=\"\"><div> <span>Jenna could see the hole from the vacuum cleaner come under the couch and Jenna ran to grab onto the fabric. she held on with all her might as everything was being swept away with the wind. she could not hold on much longer. but before she could let go the wrapper came and surrounded her making her get taken into the tube. the journey was quick as she was immediately spit out into a pile of dust. she coughed multiple times as she got out of the sticky wrapper. The noise of the vacuum stopped and she could see through the plastic to the outside world. she banned a few times till she saw her mother walk away. <br>\r\n\"How am I going to get out of here?\" Jenna thought. She started to look around in the dust only to find nothing but the wrapper she was brought in with. All she could do now was either wait for tomorrows vacuuming and hope her mom throws the dust away or try to escape the way she came, which both were impossible. But she did not give up she started to climb up to the tube only to fall down it and be even more trapped. She walked through the tunnel only to hear the vacuum being lifted up causing her to fall to the ground.<br>\r\nJenna then...</span></div></div>",
            "created":1306645200,
            "id":1115779,
            "title":" in the vaccuum"
        },
        "1111211112":{
            "choices":[
                "she steps on you and the bug",
                "she steps on the bug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the insect chases you out into the open and thats when your mom spots the two of you.</span></div></span></div>",
            "created":1110430800,
            "id":239367,
            "title":"help"
        },
        "11112111121":{
            "content":"<div class=\"\"><div> <span>DAMN BUGS! EWWWWWW! says jennas mom. NO MOM PLEASE IT\"S ME JENNA JUST KILL THE BUG PLEASE! said jenna, but her mom could not hear her as she slammed her foot down! CRUNCH! jenna turned and saw the toe of her moms slipper. the bug was crushed. but jenna new she was next. She tried to run but with out any thought, her mom quickly stepped on jenna making sure this bug would not live another second in her home. The sole of her moms slipper caught jenna quickly and pressed down, pressing jenna into the carpet. all of jennas bones started cracking, her sides started to split, her guts started squishing out of her and finally she popped under the sole of her mothers slipper with a wet CRUNCH!</span></div></div>",
            "created":1295845200,
            "id":1041020,
            "title":"she steps on you and the bug"
        },
        "1111212":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Escape",
                "You end up in a garbage dump"
            ],
            "content":"<div class=\"\"><div> <span>Jenna started to crawl out of the garbage. <br>\r\n<br>\r\nGross, gross, gross, she thought as she touched part of a thrown out hamburger. <br>\r\n<br>\r\nThen, she felt a rumbling, and fell back farther.<br>\r\n<br>\r\n\"CRAP!\" she yelled. Then, she heard footsteps.<br>\r\n<br>\r\n\"HELLO! CAN SOMEONE HELP ME!?\" she yelled.<br>\r\n<br>\r\nNo one answered, and she felt the garbage can being lifted up. She then remembered it was garbage day!<br>\r\n<br>\r\nSoon, the can opened, and she, along with the trash, fell in. Then, she felt the truck leave, far away from her house...</span></div></div>",
            "created":1086584400,
            "id":202211,
            "title":"Trash"
        },
        "11112121":{
            "author_id":"m1lk",
            "author_name":"M1lk",
            "choices":[
                "Run into the High School!",
                "Oh no! RUSH HOUR!!!!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna finds some glass and cuts through the bag, and starts to climb out of the bag. Thankfully, there was a crack left open in the giant door that keeps the trash in, enough for you to slip out...<br>\r\n...into the street. Now, you manage to make it to the sidewalk! Hurrah!</span></div></div>",
            "created":1295240400,
            "id":1037105,
            "title":"Escape"
        },
        "11112122":{
            "choices":[
                "a giant Rat",
                "a Fly"
            ],
            "content":"<div class=\"\"><div> <span>Jenna took a small(well, big to her) piece of glass and Slowly pushed it through the garbage bag. she then climbed out. it didn't take her too long to realize that she was in the local dump. the scent of the garbage was overwhelming to her, and caused her to nearly faint. she then sat on what looked to be a bottle cap. tears in her eyes, she was worried about how she would get home. she knew the way back, but at her current size, it could take a long time.<br>\r\n<br>\r\njenna then looked around, and found that a truck was going out again to collect more trash, if she could get off of the mountain of trash bags, se could find a way to get on the truck. <br>\r\n<br>\r\nshe then felt a shadow behind her, she turned to find....</span></div></div>",
            "created":1086670800,
            "id":202222,
            "title":"down in the dump"
        },
        "111121222":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Head out of the junk yard",
                "Try to find someone"
            ],
            "content":"<div class=\"\"><div> <span>Jenna screamed as a huge fly floated over her. The fly came down to inspect her, the sight of which almost caused her to vomit. <br>\r\n<br>\r\nShe screamed and started to run, and the fly quickly lost interest.<br>\r\n<br>\r\nI have to get out of here, Jenna thought.</span></div></div>",
            "created":1086843600,
            "id":202613,
            "title":"Fly Attack"
        },
        "1111212221":{
            "choices":[
                "her mother",
                "One of her mother's friends"
            ],
            "content":"<div class=\"\"><div> <span>jenna Runs as fast as she can toward the large metal Gate which is the entryway of the junk yard. Jenna quickly runs through the gate. she looks around, and notices that the sidewalk isn't particularl busy, so she keeps walking. but heading one block alone takes forever, she sits on a nearby curb thinking of what to do. she looks at the road, and makes sure that no cars are coming, and starts to run. she makes it accross pretty easy. after several hours, she has only made it past 2 blocks. Jenna starts worrying about her family, what they must think about this.<br>\r\n<br>\r\nsuddenly, a giant medium heeled shoe heads just a few feet (inches really) in front of her. She looks up, and sees that it's....</span></div></div>",
            "created":1086843600,
            "id":202630,
            "title":"the road home"
        },
        "11112122212":{
            "choices":[
                "jump on her shoe and hope she's headed to Jenna's home",
                "Try to get her attention."
            ],
            "content":"<div class=\"\"><div> <span>Jenna Looks up to see that it's Her mother's Old friend from high school Samantha travers. Jenna Remembered that she was going to her place today. Looking up, she could see that Samantha was waiting for the street light to turn green, so Jenna only had a few seconds to come up with a plan.</span></div></div>",
            "created":1088053200,
            "id":204448,
            "title":"Samantha"
        },
        "111121222121":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Jenna decides to climb onto Samantha's Pump. Hse Grabs on to the heel, and climbs as fast as she can. Suddenly, she feels the ground rise. Samantha is on the move. Jenna Clings onto the abck of the heel for dear life, but every time the foot crashes to the ground, she finds it harder and harder to maintain her balance. and Samantha hasn't even fully crossed the street yet. Jenna feels her grip begin to loosen. Can se hold on?</span></div></div>",
            "created":1093842000,
            "id":214302,
            "title":"Shaky ride"
        },
        "1111212221211":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Samantha is going to an interview.",
                "Samantha is going to the bank to deposit some checks."
            ],
            "content":"<div class=\"\"><div> <span>Unaware that a tiny passenger is clinging to her medium heel pump, Samantha makes her way across the street.  Meanwhile, Jenna uses the last bit of her strength to reach up and grab the ankle strap on the pump and holds on.  Jenna says to herself, \"Well, here I am crossing the street,\" hesitantly she finishes her statement, \"the hard way.\"<br>\r\n<br>\r\nSamantha walks a little bit more, then takes an unexpected turn and begins to cross another street.  Jenna notes she is all dressed up.  Why?  More importantly, where is she going?</span></div></div>",
            "created":1203915600,
            "id":502585,
            "title":"Crossing the Street"
        },
        "11112122212111":{
            "choices":[
                "1/8\" tall in Sam's shoe",
                "1/16\" tall on the ground and Sam's gone."
            ],
            "content":"<div class=\"\"><div> <span>Samantha hurries across the street towards a large office building.  <br>\r\n<br>\r\n\"I'm going to be late\" she thinks.  \"Hi, I'm here for my interview.\" The receptionist smiles and points takes her to a large office down the hall.<br>\r\n<br>\r\nSamantha sits across from a large desk.  \"She'll be in in a moment\" the Secretary replies.<br>\r\n<br>\r\n\"Thank you.\" Samantha nervously says.  This is her big chance. As she waits she begins to nervously fidget her right foot.<br>\r\n<br>\r\n-----------------------------------------<br>\r\n<br>\r\nMeanwhile, Jenna is exhausted.  She clings to Sam's right foot as she enters a large building.  <br>\r\n<br>\r\n\"Am I ever going to get home\" She says to herself.  \"At least, I'm with someone who can get me there.\"<br>\r\n<br>\r\nJenna watches from her precarious position, as Sam is led down a hall and sat in a large office.<br>\r\n<br>\r\n\"This must be her big interview\", Jenna thinks to herself.  \"But this is my chance to get her attention\".<br>\r\n<br>\r\nUnfortunately, it's not that easy.  Sam has begun to slide her foot out of her pump, slamming Jenna!<br>\r\n<br>\r\n\"Ahh!!! No Sam please stop!\" Jenna screams but her voice is too tiny to be heard.  Back and forth Sam's foot goes and Jenna begins to lose her grip.  \"This can't get any worse!!\" <br>\r\n<br>\r\nHowever, Jenna feels that strange tingle again and everything around her begins to grow.  \"Not again!!\" She screams as she loses her grip.<br>\r\n<br>\r\nFalling she lands, losing consciousness.  <br>\r\n<br>\r\nWhen she wakes, she's.........<br>\r\n</span></div></div>",
            "created":1236574800,
            "id":658440,
            "title":"Samantha is going to an interview."
        },
        "111121222121112":{
            "choices":[
                "Big foot sounds like a good plan",
                "Maybe I'm better off trying the hall"
            ],
            "content":"<div class=\"\"><div> <span>As Jenna wakes she notices, everything bigger, MUCH BIGGER. She stands up trying to get her barrings trying to figure out how small she's become. To make matters worse, Sam is gone and the office is empty.  Directly in front of her is a huge oak desk.  She begins to walk around looking for a way up to get whoever's office this is attention. As she's walking, she see's a paperclip on it's side and she's as thick as it is tall!!!<br>\r\n<br>\r\n\"Now what am I going to do, no one will see me now!!\" She screams (no one can hear her anyway).  She continues to walk under the desk towards the huge leather chair looking for anyway to get someone's attention.<br>\r\n<br>\r\nAfter some time, she feels a rumble and turns toward the door, seeing it fly open and a pair of huge feet walk through, heading straight towards her.<br>\r\n<br>\r\n------------------------------------------------------------<br>\r\n<br>\r\nMichelle was pretty impressed with Sam her previous interview and was excited about their next.  She strolled back into her office after a delicious (and expensive lunch).  As a single woman in her mid 30's, she always enjoyed the thrill of finding a new minion for her company.  Ever since she started at Smar-Tech, she prided herself on building an empire.  And why not? At 5'9\", a model like build and stunning blond hair she had all the assets to back it up.  Now after lunch, she sat back down in her huge leather chair slipped of her stilletto heels and prepared for her usual Friday afternoon conference call.<br>\r\n<br>\r\n------------------------------------------------------------<br>\r\n<br>\r\nJenna was in awe as the beautiful giantess strode and sat in the chair.  At Jen's size, Michelle was well over a mile tall.  She ran as fast as she could as the huge woman and down.  A huge stiletto heel flew over her head causing her to freeze and two giant bare feet landed on either side of her.  <br>\r\n<br>\r\n\"Her big toe looks bigger than a house\" Jen thought, it was actually over 50' tall.  She could climb the toe and see if this new giantess could help her or maybe she could try her luck in the hallway.</span></div></div>",
            "created":1236574800,
            "id":658452,
            "title":"1/16\" tall on the ground and Sam's gone."
        },
        "1111212221211121":{
            "choices":[
                "Ride this foot out",
                "Jump off, there's got to be a better way!"
            ],
            "content":"<div class=\"\"><div> <span>The decision between the titanic feet and long trek the was a difficult one.  Who knows what would happen on the way to the hall at her new size.  Between giant bugs and huge people, it was a gamble.  However, this new giants feet almost never stopped moving and even if she got her attention, what then?!?! Only if Samantha were still here.... As Jenna checked her options big things were going on above her.<br>\r\n<br>\r\n-----------------------------------------------------------------------<br>\r\n<br>\r\nBoard members... who needed them!  Michelle was getting frustrated as today's call was not going well.  As the call wrapped up, she slammed the phone down.  \"I just wish those bugs would stay out of my way!\" she whispered to herself and stomped her foot. She put back on her stiletto sandals, strapped them up on and headed home for a lonesome relaxing weekend, thinking of her next move.<br>\r\n<br>\r\n----------------------------------------------------------------------<br>\r\n<br>\r\nJenna was starting to get nervous, deciding to hitch a ride with her new giantess friend, she began running towards Michelle's right foot.  The ground rumbled as toes seeming wriggled hungrily in anticipation of their new \"friend\".  In a bit of luck they seemed to settle just as Jenna reached them.  She was surprised that even at her small size, the toes were smooth. Using the ridges as hand holds, she began her climb. <br>\r\n<br>\r\nHowever, about half way up, disaster struck.  The foot lifted and slammed down sending Jenna flying, she landed on a soft slanted surface that smelled of leather and.... peach lotion?  Beginning to realize where she had landed, she stood and saw a huge pillar attached to a huge object.<br>\r\n<br>\r\n\"Oh-no\" she thought \"I'm on her stiletto sandal!\"  The ground lurched as a shadow came over her and 5 monstrous objects rumbled towards her.  She closed her eyes and thought this was the end.  The rumbling stopped and she opened her eyes, breathing a sigh of relief. The pillar was thong of the sandal between Michelle's big and second toe and it had protected her from an impending crushing.  But relief lasted only a minute as Michelle began to walk.  <br>\r\n<br>\r\nWhat's Jenna to do? She travel with this giantess and get some help. Or maybe she was better off hopping off and looking for other options.</span></div></div>",
            "created":1236574800,
            "id":658562,
            "title":"Big foot and Big ideas"
        },
        "11112122212111211":{
            "choices":[
                "Play it safe",
                "Be a daredevil"
            ],
            "content":"<div class=\"\"><div> <span>Jenna lay safely between the ridge of Michelle's toe flesh and her big toe nail.  She had waited until Michelle had settled in what looked to be her car to begin the arduous climb up her big toe nail.  Now with some time to rest she tried her situation..  <br>\r\n<br>\r\n\"What can I do?!?\" she thought, \"Even if she finds me, I'm stuck like this!\"  She looked across the basketball court sized big toe nail up the sky scraper sized leg trying to figure out any way to get some help.  Exhausted and the size of a speck, she lay safe (for now), began to sob and drifted off to sleep....<br>\r\n<br>\r\n----------------------------------------------------------------------<br>\r\n<br>\r\nMichelle relaxed on her way home.  The 45 minute drive gave her time to unwind and it being the weekend, she decided a quiet night was exactly what she needed.  She pulled into her driveway and walked into her huge home.  Through the front door she slipped off her heels, threw last nights chinese food in the microwave and went to change.  Michelle slipped off her skirt and blouse and threw on a nightie before retrieving her dinner and a bottle of wine.  She plopped in her huge recliner, throwing her feet up and began to enjoy her dinner while overlooking some paperwork completely unaware of her smaller passenger.<br>\r\n<br>\r\n----------------------------------------------------------------------<br>\r\n<br>\r\nJenna awoke to a whirlwind.  Safely snug between Michelle's toe flesh and nail, she watched the giantess walk around her house and changer her clothes. Her world spun as she was jarred from her sanctuary as Michelle threw her feet up on the recliner.  Jenna rolled down the foot before  sliding to a stop near Michelle's ankle.  Gathering her senses Jenna followed the vast plane of the leg up towards the mountainous upper body of Michelle.<br>\r\n<br>\r\nWith a new sense of hope and energy, Jenna thought, \"This is my chance! Maybe I can climb up near her face and get her attention\".  She ran as fast as she could over the shin, knee and towards Michelle's waist.  The giantess she noticed the giantess reading from a side table while forking a piece of food from the bowl in the giantess other hand every few minutes.  This would be the tough part, going up her body.  In a bit of luck however, the nightie Michelle wore gave Jenna a nice ladder for climbing.  This trip was going surprisingly well as she climbed Michelle's body.  After a few minutes of climbing, she reached Michelle's shoulder.   <br>\r\n<br>\r\nNow Jenna was left with another decision.  She could climb ups some strands of Michelle's hair and attempt to hop in her ear or she could use Michelle's hair as a swing to climb on her face?  To the ear was safer trip but the giantess may not hear her.  Swinging might get her seen but what if she fell into the bowl of food, she'd be done for!</span></div></div>",
            "created":1236661200,
            "id":658985,
            "title":"Ride this foot out"
        },
        "111121222121112111":{
            "choices":[
                "Put the girl on the desk and see if it's still there in the morning",
                "This can't be real, brush it off her hand and go back to her paperwork"
            ],
            "content":"<div class=\"\"><div> <span>Running on her last bit of adrenaline, Jenna scrambled up a piece of hair.  Quickly she reached the entrance of the giantess' ear.  She lept and landed on the ear's edge and pulled herself in.  She lay there for a moment, reveling in her accomplishment.  \"That was way too easy\" She thought, \"But I made it!\" <br>\r\n<br>\r\nShe walked 75 feet inside the ear (at Jenna's perspective) and screamed \"HELLO!!! PLEASE DON'T FREAK OUT!! PLEASE HELP ME I'M IN YOUR RIGHT EAR!!!\"  <br>\r\n<br>\r\n---------------------------------------------------------------------------- -----------<br>\r\n<br>\r\n\"These proposals are so boring\" Michelle said to herself as she took another sip of her wine.  She glanced at the clock and seeing it read 7:30, she lifted her now half empty bottle of wine.  \"I really gotta lay off the sauce too.\"<br>\r\n<br>\r\nHer thoughts were broken as she heard a faint cry, \"h e l l o p l e a s e h e l p\". <br>\r\n<br>\r\n\"Now I know i've been drinking too much, I'm hearing things\" Michelle thought, chuckling to herself. But the cries started again, \"p l e a s e   d o n t   f r e a k   o u t   i m   i n    y o u r   r i g h t   e a r\"  <br>\r\n<br>\r\nMichelle was really starting to lose it now, how could someone be in her ear???  But the cries continued.<br>\r\n<br>\r\nMichelle decided to appear these \"voices\", she needed a good laugh.  \"Hello in there\", she chuckled \"If you're a person what's your name....\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- --------<br>\r\n<br>\r\nJenna was ecstatic, FINALLY!  \"My name's Jenna, please help, I've some how been shrunk!!!\"<br>\r\n<br>\r\n\"WHICH EAR AGAIN WHATEVER YOU A.... I MEAN JENNA\" the giantess boomed with what sounded like a chuckle.<br>\r\n<br>\r\n\"The right one\" Jenna replied as her landscape suddenly shifted and she began to fall out the ear.  She screamed as she slammed into a huge soft plain and quick got dizzy as the giantess began to move whatever she was on.  The plain had huge ridges and 5 enormous pillars attached.  \"I'm in her palm, I made it!!\" she thought as she smiled.  The hand stopped in front of the giantess' face, with what little energy she had left, she jumped up and down trying to get the giant's attention.  Two huge eyes scanned the plam as the giantess spoke. <br>\r\n<br>\r\n\"THAT DOT CAN'T BE YOU CAN IT?\"  <br>\r\n<br>\r\n\"Yes, yes it's me, please help!\" Jenna responded with some futility, there's no way the giantess could hear her at her size. <br>\r\n<br>\r\n---------------------------------------------------------------------------- -----<br>\r\n<br>\r\nMichelle could barely make out a small dot on her plam.  \"There's just no way that's a person.  I knew I should have stopped drinking\" she said as she got up.  Walking to her desk, she pulled out a magnifying glass and put near her palm.  Scanning idly... she could not believe her eyes.  It's actually a TINY PERSON!<br>\r\n<br>\r\n\"NO WAY!\"  she blurted out \"THERE'S JUST NO WAY\".  She shook her head contemplating if this was real or not, she decided to..... </span></div></div>",
            "created":1236661200,
            "id":658999,
            "title":"Play it safe"
        },
        "1111212221211121111":{
            "choices":[
                "Melissa with the magnifying glass lifting the ring",
                "Aida, the college aged maid cleaning the desk off."
            ],
            "content":"<div class=\"\"><div> <span>Michelle just couldn't believe it, she sounded real, looked real, even felt real (well what little she could feel).  Thousands of thoughts were running through her head.  She stood there for a few minutes looking at this speck of a girl, then she had an idea.<br>\r\n<br>\r\n---------------------------------------------------------------------------- --------<br>\r\n<br>\r\nDown in Michelle's hand, Jenna was getting concerned.  She had shouted a few times, (to no avail) and was beginning to think this wasn't such a good idea. <br>\r\n<br>\r\n\"helllllllooooooooo\" She yelled, are you still there.  Nothing.  Just two huge blue eyes looking back at her through a magnifying glass.  Jenna was about to give up hope when the giantess spoke...<br>\r\n<br>\r\n\"I'M GOING TO SET YOU ON THE DESK\" Melissa said. <br>\r\n<br>\r\nJenna felt the hand lower and tip. \"Hey easy!\" She screamed and slid down Melissa's palm, landing with a thud on the desk.  Like everything else it looked like a huge alien landscape.<br>\r\n<br>\r\n\"STAY PUT, I'll BE RIGHT BACK\", the giantess bellowed.  <br>\r\n<br>\r\nJenna's ears were beginning to ring from how loud Melissa spoke. \"Now what?\" she wondered.<br>\r\n<br>\r\nShe didn't have to wait long as the giantess strolled in with something in her hand.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -----------<br>\r\n<br>\r\n\"Let's see if this is really a dream or not\" Melissa thought to herself.  She walked into her bedroom and pulled out her old silver Tiffany's ring.  She walked back to the and spoke to new friend.<br>\r\n<br>\r\n\"Ok little one.  Let's see how real you are.\"  Placing the ring around the speck sized girl, she spoke again \"If you're still here in the morning, we'll talk but I have a feeling you're just the after effect of a rough day and some wine.  So maybe we'll see you in the morning?\" <br>\r\n<br>\r\nMelissa walked towards her bedroom and chuckled to herself.  \"I'm really losing it.  Nothing a good night's sleep shouldn't fix.\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- -----------<br>\r\n<br>\r\nJenna was in a panic, \"no wait!!! come back!!! I'm real!!!\" But to no avail.  She had been many places today, but she never thought she'd end up surrounded by an arena sized ring.  \"i guess i'm going to finally help tomorrow\", she said.  With that she curled up and drifted off to sleep..........<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe next morning Jenna awoke with a start, everything was rumbling around her.  She looked up to see...............<br>\r\n<br>\r\n <br>\r\n</span></div></div>",
            "created":1236661200,
            "id":659125,
            "title":"Put the girl on the desk and see if it's st..."
        },
        "11112122212111211111":{
            "choices":[
                "Get you some breakfast. You must be starved!",
                "See you climb my toe and your new home."
            ],
            "content":"<div class=\"\"><div> <span>Michelle lifting the ring.  \"WHOA\" Michelle boomed, looking thru the magnifying glass \"YOU ARE REAL!\"  Jenna had to cover her ears from the sheer volume of Michelle's voice, who was visibly excited.<br>\r\n<br>\r\n\"LET'S TALK\" Michelle spoke again and paused.  Jenna watched as the giantess leaned in close attempting to hear the small girl.  <br>\r\n<br>\r\n\"Can you hear me?\" Jenna yelled up towards Michelle's face.  <br>\r\n<br>\r\n\"ARE YOU TRYING TO SAY SOMETHING, JENNA, RIGHT?  THAT'S YOUR NAME, JENNA\"  Michelle spoke.<br>\r\n<br>\r\n\"Yes\" Jenna yelled, \"Oh this will never work!\"<br>\r\n<br>\r\nJust then, Jenna saw the giantess reach over and pick something up next to what looked like a massive computer.<br>\r\n<br>\r\n\"HERE SPEAK INTO THIS\" Michelle said, setting a gargantuan microphone next to the mite sized girl.  <br>\r\n<br>\r\nJenna smiled, She was finally going to get the help she sought, right?  She climbed the mic to make sure this giantess could hear her.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----<br>\r\n<br>\r\nMichelle was proud of herself.  \"That Ivy League education is worth something\" she thought.<br>\r\n<br>\r\n\"Yes my name is Jenna! Can you hear me?  Oh and could you please not talk so loud, your voice is huge!\" Jenna spoke standing on the microphone<br>\r\n<br>\r\n\"Yes, dear I can.  My name's Michelle by the way.  How did this happen to you? And how did you end up in my ear\"  Michelle whispered.<br>\r\n<br>\r\n\"It's a long story, but here it goes\" Jenna replied.  She went through every detail from waking in her bed, to being swept, to the fly &amp; the dump, to Samantha to shrinking again, to her foot ride and her big climb.  After a half hour or so, she finished.  <br>\r\n<br>\r\nMichelle was entralled.  Her company had worked in this area for some time but with little success.  Jenna could put her over the top.  \"Just think they wanted to pull the plug\" Michelle thought, \"This is our big, err little break.\"<br>\r\n<br>\r\n\"That's quite a story little one\" Michelle replied \"You're very lucky because my company is near a break through on size technology.  It sounds like fate that you found me.\" <br>\r\n<br>\r\n\"So you can make me normal?\" Jenna replied.  She was beginning to tear up.  The thought of being this small any longer made her sick.<br>\r\n<br>\r\n\"Well, not yet but soon.  The technology isn't perfected yet.\"  Michelle replied. <br>\r\n<br>\r\n\"Oh, well will you at least take me home?\" Jenna responded<br>\r\n<br>\r\n\"Can't do that either my dear, but I'll keep you safe and sound.\" Michelle responded reaching her index finger toward Jenna.  \"Why don't you hop on?\"<br>\r\n<br>\r\nJenna was concerned.  She didn't want to be some science experiment, she just wanted to go home.  But what could she do?  Reluctantly, she climbed on the enormous finger nail.<br>\r\n<br>\r\n\"Do you mind if I set you on the ground dear? I just want to see what you look like down there.\" Michelle slowly lowered her hand.  \"This is amazing!\" She thought, \"A breakthrough and I found it.  Think of the wealth, the power, my dreams!\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------<br>\r\n<br>\r\nJenna didn't want to go back on the floor.  She held on as hard as she could but to no avail.  The finger tipped up depositing her on the ground.  Michelle stood to her full height.  \"She' like a goddess\" she thought.  \"I think I'm in trouble.\"<br>\r\n<br>\r\nJenna screamed as a shadow over came her and a huge pale wall appeared to her side.  Michelle had placed her foot next to the flea sized girl.  Although gentle, Jenna still went flying.  <br>\r\n<br>\r\n\"I CAN BARELY SEE YOU JENNA\" Michelle boomed \" YOU'RE LUCKY I LOVE SANDALS OR YOU'D STILL BE ON MY OFFICE FLOOR OR WORSE....\" <br>\r\n<br>\r\nThe \"or worse\" sent shivers down Jenna's spine.  Michelle was right, Jenna could have been squished or eaten by a bug or worse.  She looked over at the house sized toes, again seemingly wriggling hungrily in anticipation of their new friend.  Jenna slowly craned her neck towards Michelle gigantic smiling face.<br>\r\n<br>\r\nMichelle spoke once more \"NOW LET'S.........\"  </span></div></div>",
            "created":1236661200,
            "id":659146,
            "title":"Michelle's help?"
        },
        "111121222121112111112":{
            "choices":[
                "Try and escape now",
                "Wait and see if Michelle takes you to work Monday and try then"
            ],
            "content":"<div class=\"\"><div> <span>\"SEE YOU CLIMB MY TOE\", Michelle bellowed to the speck at her feet.  \"I THINK IT WILL MAKE A NICE HOME FOR YOU.\"<br>\r\n<br>\r\nJenna was shocked at what had come out of the huge woman's mouth.  She turned and ran as fast as she could, knowing all too well that it was futile.  <br>\r\n<br>\r\n---------------------------------------------------------------------------- ----<br>\r\n<br>\r\nMichelle giggled to herself.  It looked as if the tiny girl was trying to run.  Grabbing the magnifying glass, she bends down on one knee, setting her other foot next to the moving speck.<br>\r\n<br>\r\n\"Just where do you think you're going?\" She said looking through the glass. The speck seemed to have stopped.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------<br>\r\n<br>\r\nMichelle's next foot fall had sent Jenna spilling to the ground. With tears streaming down her face, she walked up to the huge toe, turning up towards Michelle who was smiling through the magnifying glass.<br>\r\n<br>\r\n\"THAT'S IT DEAR. I'LL TAKE GOOD CARE OF YOU\" Michelle said, \"AND YOU'LL MAKE ME SO MUCH MONEY! HAHAH\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- --------<br>\r\n<br>\r\nMichelle watched the tiny speck of a girl climb up her toe, she felt nothing but power.  \"With her, perhaps we can perfect our shrink ray technology.  She'll make me millions.\" She thought to herself.<br>\r\n<br>\r\nOnce the girl was on the top of her toe, she spoke again. \"NICE JOB DEAR.  I'M GOING TO PUT ON MY SLIPPERS UNTIL I CAN THINK OF A BETTER PLACE TO KEEP YOU.  FEEL FREE TO HAVE SOME FUN, I'M SURE MY TOES WOULD LOVE TO PLAY!! HAHA\"<br>\r\n<br>\r\nWith that she slipped on her slipper and went to the kitchen to make breakfast.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------<br>\r\n<br>\r\nJenna was sobbing clinging to the top of the toe, she entered the huge dark cave.  The foot settled in the slipper and she did her best to hang on.  Michelle's toes were very active, seemingly trying to play with the tiny girl. <br>\r\n<br>\r\nJenna tried her best to compose herself.  \"I have to figure out a plan\" she thought, desperately clinging to moving big toe of Michelle.  She decided she could either stay put and try to wait it out til Michelle went back to work on Monday or she could try and escape now as she was small enough to move away unnoticed.  Either was very dangerous but it appeared that she had no other choice.</span></div></div>",
            "created":1236920400,
            "id":660029,
            "title":"See you climb my toe and your new home."
        },
        "1111212221211121111121":{
            "choices":[
                "Yes! Safety for now",
                "No! I'm in REAL big trouble"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't take this anymore\" Jenna said to herself, \" I have to get out of here!\" The toes of her capturess continued to twitch and in a bit of luck Jenna was flung off to the bottom of the shoe.  The good news is now she have to climb down but the bad news was she could easily become a stain under Michelle's foot.  Luckily at a 1/16\", she could easily maneuver in the shoe without much trouble.  Slowly but surely she made her way along the inside edge of the slipper, towards freedom.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------------<br>\r\n<br>\r\nMichelle cooked a large breakfast, she would need energy for her new \"pet\".  She pondered how this poor girl ended up like this in the first place and how she could use it to make some serious money. She finished breakfast and decided to let the girl suffer in her slipper a little longer while she caught up on some paper work.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ---------------<br>\r\n<br>\r\nJenna had crawled along the edge of the slipper for an hour but her effort had finally paid off.  Now near the heel of the slipper and Michelle's foot, she was clear to escape.  Looking up, she noticed the giantess was sitting, busy with something far beyond Jenna's field of vision.  Jenna ran through the last section of slipper and prepared to jump.  Looking down, it was about a 15' drop.  \"I'm so small... What am I doing?\" She said to herself.  \"But I don't have much choice, Michelle's nuts\"  With that she lept off the slipper and onto the hard wood floor.  Landing with a thud, she gathered herself before receiving that tingling feeling again.<br>\r\n<br>\r\n\"NOT AGAIN\" Jenna said as her world expanded around her.  But this time much less than before, a quick estimation put her a 1/25\" of an inch, barely a speck.  Shocked but undeterred the mite size girl runs as fast as she can.  She doesn't get very far when she hears Michelle speak.<br>\r\n<br>\r\n\"TIME TO CHECK ON MY LITTLE FRIEND\" Michelle bellows.<br>\r\n<br>\r\n\"Oh no, I've got to find somewhere to hide\" peering around Jenna looks for anything but any cover seems miles away. What makes matters worse is Michelle seems to have discovered that Jenna was gone.<br>\r\n<br>\r\n\"WHERE'D YOU GO!\" Michelle booms, \"YOU BETTER BE IN MY SHOE OR YOUR IN BIG TROUBLE\"<br>\r\n<br>\r\nThe titaness gets up grabbing her magnifying glass off the desk.  Jenna quickly spots an overturned purse  under the desk only about a 1/4 mile from her location (at her perspective).  Running as fast as she can towards it, she looks back, seeing Michelle on her hands and knees scanning the floor for any sign of the mite size girl.  Every move makes is an earthquake to Jenna, who is running with all her might to make it to safety. One more glance over her shoulder, as Michelle is looking in her direction. <br>\r\n<br>\r\n\"I'm not going to make it\" She says sprinting as fast as she can.<br>\r\n<br>\r\nDoes she make it?!!</span></div></div>",
            "created":1240203600,
            "id":679269,
            "title":"Try and escape now"
        },
        "11112122212111211111212":{
            "choices":[
                "A pair of closed toe heels",
                "A teeny tiny cage"
            ],
            "content":"<div class=\"\"><div> <span>Jenna screamed in horror as a huge fleshy wall slammed in front of her.   At Jenna's perspective, it was well over 150' tall and 1000' long.  Staring at it, Jenna realized it wasn't a wall at all but Michelle's index finger.<br>\r\n<br>\r\n\"WELL, WELL MY DEAR, IT SEEMS YOU'VE GOTTEN EVEN SMALLER\" Michelle boomed, \"AND IT SEEMS LIKE YOU WERE TRYING TO RUN AWAY FROM ME. HOW DISAPPOINTING...\"<br>\r\n<br>\r\nSlowly Jenna watched as the huge \"wall\" rotated 180 degrees bringing Michelle's upturned finger nail to the floor.  <br>\r\n<br>\r\n\"I SUGGEST YOU CLIMB ON BEFORE I DECIDE YOU'RE NOT WORTH THE TROUBLE\" Michelle spoke, this time without the playfulness that usually accompanied it.  Jenna seeing her dire situation hurried to the upturned nail.  At Jenna's new size the nail seemed a good 18\" thick.  Jenna climbed on and was pushed to the \"floor\" as Michelle stood up.  Jenna's world swirled and finally stopped in front of one of Michelle's titanic eyes. Jenna shivered at the cold stare coming from the huge eye.  She awaited in total fear for what Michelle said next.<br>\r\n<br>\r\n\"YOU'VE DISAPPOINTED ME.  AND NOW YOU MUST BE PUNISHED\" Jenna's world again shifted and Michelle lowered her finger about an inch over her desk.  Jenna screamed as she fell over 100' (at her scale), onto the desk and immediately saw the huge ring around her again.  Jenna looked up at a Michelle's cold face.<br>\r\n<br>\r\n\"FOR NOW, YOU THINK ABOUT WHAT YOU'VE DONE\", Michelle boomed and walked away.  Jenna sat and cried......<br>\r\n<br>\r\n------------------------------------<br>\r\n<br>\r\nAfter some time, Jenna was shaken as Michelle returned carrying....</span></div></div>",
            "created":1253422800,
            "id":763600,
            "title":"Mad Michelle"
        },
        "111121222121112111112121":{
            "choices":[
                "Enough's enough, stay put!",
                "Nobody holds me down, find a way to escape!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was shaken as Michelle spoke upon her return.  <br>\r\n<br>\r\n\"YOU OBVIOUSLY NEED TO LEARN YOUR PLACE\" Michelle said, placing two huge high heels on the desk next to the ring imprisoning Jenna.  \"AND THESE ARE JUST THE THING TO TEACH YOU IT\"<br>\r\n<br>\r\n\"no please!\" Jenna screamed, but at her ultra tiny size, it was no use.  Jenna watched as the ring was quickly removed and a titanic finger tip came racing toward her.  Jenna did the best she could to run but it's hard to get anywhere when you're a 1/25\" tall. The giant pad slammed into her, like a 3 ton pillow and it's oily surface stuck her to it like a fly to fly paper.  Jenna's world swirled as she was brought in front of Michelle's gigantic blue eye. <br>\r\n<br>\r\n\"YOU'LL LEARN THAT YOU'RE NOTHING BUT A SPECK WITHOUT MY HELP AND A DAY IN MY HEELS SHOULD DO THE TRICK.\"  <br>\r\n<br>\r\nJenna tried to speak but before she could get a word out her world spun again and she was face to face with the toe end with one of Michelle's heels.  Jenna was roughly rubbed onto it's leathery surface.  The flea sized girl turned around to see Michelle's hand grab the top of the shoe and lower it to the floor.<br>\r\n<br>\r\n\"michelle please!\" Jenna pleaded but to no avail.  She watched in complete terror as Michelle's foot entered into the arena sized shoe.  She braced herself as Michelle's second toe slammed into her sending her bouncing around. She landed with a thud on the soft warm surface of Michelle's big toe.<br>\r\n<br>\r\nJenna knew this was going to be a long day...... What does she do?</span></div></div>",
            "created":1256187600,
            "id":780025,
            "title":"Prison Sentence"
        },
        "1111212221211121111122":{
            "choices":[
                "The stillettos on the left",
                "The Mary Janes on the right"
            ],
            "content":"<div class=\"\"><div> <span>Jenna rolled over and looked around.  She was still trapped in the giant ring on Michelle's titanic desk.  It was finally Monday morning and she was glad the weekend was over.  The last 48 hours had been horrific.  Michelle had come up with several \"games\" for the two of them to play which included dodging giant feet and teeth, being stuck to various body parts while Michelle went through her day, being trapped in a locket and much more Jenna didn't want to think about.  But now, it was Monday morning, and her plan could finally go into action...<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------------------------------------------------------<br>\r\n<br>\r\nMichelle smiled, walking to her desk and seeing the speck of a girl trapped in her ring.  She didn't even speak to the girl.  Moving the ring, she licked her index finger and lightly touching it to the minute girl and lifted the finger to her face.  She giggled slightly at the sight and spoke.<br>\r\n<br>\r\n\"Well my dear the weekend is sadly over.\" The blond spoke to tiny Jenna, \"And I have to go to work for now. But don't worry, you'll be spending the day with me!!\" <br>\r\n<br>\r\nMoving her finger she lowered it towards the pair of pumps she planned to wear today.  As gently as she could, she tapped the small girl off her finger and into the toe section of the pump.<br>\r\n<br>\r\n\"Now keep my feet happy and we'll play later\" She spoke again, sliding her foot into the shoe.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------<br>\r\n<br>\r\nJenna, now soaked in saliva, ran into the toe section of the pump.  She was relieved that she was riding in Michelle's shoe, not because of comfort, but because of the hope of escape.  As the toes entered, she braced herself, and began to move.  During the car ride, she climbed the toes and was small enough to fit between the space between Michelle's foot and the top of the pump.  However, by the time she was out, she realized Michelle was walking to her office.  She clung to the top of the foot as Michelle walked through the door and sat down.  Another bit of luck was that Michelle didn't even bother checking on her, assuming Jenna was snug and safe in her pump.<br>\r\n<br>\r\nPlanning her next move, the giantess bellowed, speaking into the phone. \"DANIELLE, PLEASE COME IN AND BRING SAMANTHA\"<br>\r\n<br>\r\nJenna was ecstatic! It sounded as if Michelle had hired Sam and she was here.  Hope filled her once again!  Jenna heard the door open and saw two pairs of feet walk in and sit across from Michelle's desk.  She lifted herself onto the pump and ran towards it's tip.  She jumped off and landed safely on the ground, unhurt.  <br>\r\n<br>\r\n\"Apparently there is some advantage to being this size\" Jenna thought to herself.  Looking up at the shoe, it was well over 100' tall.  With what little energy she had left she ran towards the two pair of feet.  However, she did not know which pair was Sam's and which was this Danielle's.  On the left was a person wearing pair of stiletto heels and on the right was a person wearing a pant suit and what looked to be Mary Janes.<br>\r\n<br>\r\n\"Which one is she??!\" Jenna said to herself as the 3 giants booming voices spoke high above her.  <br>\r\n<br>\r\nShe had to decide quick, not know which pair belonged to her mother's good friend.<br>\r\n<br>\r\nShe chose.....</span></div></div>",
            "created":1237870800,
            "id":665975,
            "title":"Wait and see if Michelle takes you to work Mond..."
        },
        "11112122212111211111221":{
            "choices":[
                "Take the rest of the day and watch her. Just don't kill her...\"",
                "Take her to the lab and run some tests\""
            ],
            "content":"<div class=\"\"><div> <span>    Jenna sprinted to the huge pair of feet on the left in hopes that it was her mother's friend. She had to move fast, not knowing when they 3 women would get up. If she didn't make it and Michelle found her, who knows what she'd do to Jenna! After several minutes, Jenna reached the left foot and stared up.<br>\r\n<br>\r\n    \"I still can't see who it is\" she said to herself. \"But anywhere is better than with Michelle.\" She walked up to the shoe, looking for a way up. Luckily for Jenna, her small size allowed her to use the scuffs and ridges in the shoe as hand holds and she began to climb. However, about half way up the shoe, all 3 giantess stood. The 3 booming voices above her seemed to be saying their goodbye's for now. Moving faster, Jenna reached the top of the shoe just as she heard Michelle speak to Samantha.<br>\r\n<br>\r\n\"I LOOK FORWARD TO WORKING WITH YOU\" Michelle bellowed, \"WE'LL SEE YOU TOMORROW\"<br>\r\n<br>\r\n\"THANK YOU SO MUCH\" Samantha replied, \"I CAN'T WAIT\".<br>\r\n<br>\r\nJenna watched in disbelief as the huge pair of Mary Jane's began to move away... she had picked wrong.  She froze realizing her grave error.  What could she do now?  Samantha was gone for the day and she was trapped with Michelle and her assistant making matter's worse she heard Michelle speak.<br>\r\n<br>\r\n\"DANIELLE, COULD YOU PLEASE STAY A MOMENT. I HAVE A 'SMALL' THING TO SHOW YOU\"<br>\r\n---------------------------------------------------------------------------- --------------------------------------------------<br>\r\n<br>\r\nMichelle slid off her shoe and turned it upside down, attempting to shake out the tiny girl but there was no sign of her.  <br>\r\n<br>\r\n\"She's feistier than I thought\" she thought to herself.  \"I bet she tried to get some help.\"<br>\r\n<br>\r\n\"Danielle please stay still\" she spoke to her assistant.  Grabbing a magnifying glass, she slowly (and carefully) walked around her desk.  Checking the floor before kneeling down at Danielle's feet, she began to scan the carpet for the tiny girl.<br>\r\n<br>\r\n\"Are you feeling ok Ms. Smith?\" Danielle spoke to her boss, somewhat concerned. But Michelle did not reply.  She had spotted a small dot on her assistant's foot.  Licking her finger, she pressed the dot into it.  Upon bringing it closer to her face, she smiled, recovering her prize.  <br>\r\n<br>\r\n\"You are feisty\" she spoke to it (Jenna) \"Danielle... Take a look at this\" Michelle stood and showed Danielle what she was looking for.<br>\r\n---------------------------------------------------------------------------- ----------------------------------------------------<br>\r\n<br>\r\nDefeated and covered in saliva, Jenna world twisted and spun as she was brought in front of an enormous hazel eye.<br>\r\n<br>\r\n\"THIS CAN'T BE\" The new giantess spoke, \"I THOUGHT WE COULDN'T SHRINK THINGS YET\"<br>\r\n<br>\r\n\"OH WE CAN'T BUT SHE MIGHT HOLD THE KEY. I FOUND HER IN MY OFFICE FRIDAY.  SHE COULD BE OUR SUCCESS\" Michelle bellowed back.<br>\r\n<br>\r\nAs the two continued their discussion, Jenna sat slimy on Michelle's finger.  She knew whatever was in store for her wasn't going to be good.  What was worse is her options were slim especially now that he had tried to escape and was caught. She waited patiently for her fate as Michelle spoke.<br>\r\n<br>\r\n\"SINCE SHE IS PROVING DIFFICULT TO WATCH, I THINK I'M GOING TO NEED YOUR HELP ON THIS ONE, DANIELLE\"  she bellowed.  Jenna's ears perked as Michelle explained her plan for Jenna.<br>\r\n<br>\r\n\"I WANT YOU TO....</span></div></div>",
            "created":1241326800,
            "id":685794,
            "title":"Escape attempt foiled"
        },
        "111121222121112111112211":{
            "choices":[
                "\"Let's see how you look next to my pretty feet\"",
                "\"I won't let you be a lab rat, go get out of here!\""
            ],
            "content":"<div class=\"\"><div> <span>KEEP AN EYE ON HER\" Michelle spoke, depositing the speck in her assistant's waiting palm.  \"JUST BRING HER BACK AT THE END OF THE DAY... ALIVE PLEASE\"  Jenna looked high into the air at the now smirking intern. Jenna knew now it would be much of the same from Michelle's assistant.  She listened as Michelle again spoke.  <br>\r\n<br>\r\n\"DON'T LET HER OUT OF YOUR SIGHT BUT IF YOU MUST, SHE FEELS GLORIOUS AT YOUR FEET\" The titanic Michelle giggled and her assistant followed suit.  Jenna felt herself rise into the air, towards Danielle's enormous face. <br>\r\n<br>\r\n \"LET'S GO GET TO KNOW EACH OTHER\", Danielle boomed and turned towards the door.<br>\r\n<br>\r\nJenna feared the worst, as she was brought back to Danielle's desk.   She looked for a way off the gigantic hand, but found none.  Jenna again felt herself being lowered to the ground and was sickened at the thought of being trapped in another pair of shoes.  She'd run but at such a tiny size, it would be pointless.<br>\r\n<br>\r\nShe looked up towards the towering titaness, awaiting her fate as Danielle spoke.  She said</span></div></div>",
            "created":1243918800,
            "id":701335,
            "title":"Take the rest of the day and watch her. Just do..."
        },
        "1111212221211121111122112":{
            "choices":[
                "Risk under Lizzy's desk",
                "Try and make the door!!"
            ],
            "content":"<div class=\"\"><div> <span>\"GO ON GET OUT OF HERE\" The titanic Danielle boomed down to the micro-sized girl.  Jenna stood in awe in front of Danielle's huge pair of stilettos.  \"Why would she want to help me?\" Jenna thought.<br>\r\n<br>\r\nDanielle spoke again, \"THEY'RE ALWAYS EXPERIMENTING WITH PEOPLE.  IT'S SO WRONG. I'M QUITTING TONIGHT SO IT WON'T MUCH MATTER ANYWAYS!  MY DESK IS TWO AWAY FROM THE EXIT.  JUST LEAVE MY OFFICE AND TURN RIGHT. \" Jenna smiled, it seems Danielle was a bit of a bleeding heart.  She stood still as Danielle continued.   Jenna turned immediately and began to run under the but stopped as Danielle spoke once more.<br>\r\n<br>\r\nI ALMOST FORGOT, THERE'S PLENTY OF PLACES TO HIDE ON THE WAY FOR YOU BUT DON'T HEAD GO UNDER THE DESK ON THE RIGHT NEXT TO THE EXIT.  THAT'S LIZZY AND IF SHE GETS HER HANDS ON YOU.....\" Danielle paused, \"WELL JUST DON'T\"  <br>\r\n<br>\r\nJenna noted what Danielle said and waved up at the giantess. \"Why am I waiving, I'm way too small for her to see me.\"  She laughed to herself for the first time since she'd been shrunk.  She felt good for the first time in a long time.  <br>\r\n<br>\r\n---------------------------------------------------------------------------- <br>\r\n<br>\r\nAlthough Danielle's office was about 50' from the exit, to the mite sized Jenna it was like miles.  After a few hours of travel, Jenna had experienced very little difficultly.  She hugged the wall to prevent any giants mis-steps from landing on her.  The door was only a mile or so (at her perspective) and she found some new energy.  This however was the most difficult part of the journey as there was no wall between her and the exit, and just Lizzy's desk as Danielle had warned.  <br>\r\n<br>\r\nJenna was halfway to the door when disaster struck.  Jenna heard a noise behind her and screamed as a huge spider was on the floor behind her.  \"Oh no, what to do!!!???\" Jenna had to think fast, she could try and make it to the door or could risk taking refuge under Lizzy's desk.<br>\r\n<br>\r\nShe had to think fast.  Even though she was in a full sprint, the spider seemed to be gaining.  <br>\r\n<br>\r\nWhat does she do?!?!<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1245819600,
            "id":713697,
            "title":"Run to freedom!"
        },
        "11112122212111211111221121":{
            "choices":[
                "Bad... The maid with a broom!",
                "Worse.... Lizzy's nylon clad foot headed in her direction!"
            ],
            "content":"<div class=\"\"><div> <span>Although Danielle had warned her to stay away, the 50' tall spider gaining on Jenna made her rethink her course of action.  The desk was flush with the ground but Jenna spotted a hole used for computer wiring. The spider was getting closer as she reached the base of the wires.  At her current size  (1/16\"), she used as a ladder to climb up and squeeze in through the wiring hole to safety.  She watched as the spider wandered around looking for it's prey, however, the hole Jenna had climbed through was far too small for the large (to Jenna anyways) spider.  Turning around, the tiny girl noticed no one was at the desk.  Taking a moment to relax on the relative safety of a computer wire, Jenna's tired body gave in and she slowly drifted off to sleep......<br>\r\n<br>\r\n-------------------------------------------------------------------<br>\r\n<br>\r\nJenna was shaken awake by huge booming sounds. Momentarily forgetting about her circumstances she screams, \"EARTHQUAKE!\" while falling off the wire and landing on the floor with a thud.  Remembering her situation she turns to escape out the hole in the desk but is shocked to find that something is blocking it!  <br>\r\n<br>\r\nTurning back towards the front of the desk, she screams once again in horror, as she sees.............</span></div></div>",
            "created":1245906000,
            "id":714102,
            "title":"Safe is a relative term"
        },
        "111121222121112111112211211":{
            "choices":[
                "In the maid's purse (on the cart)",
                "On Lizzy's desk"
            ],
            "content":"<div class=\"\"><div> <span>Jenna screams as she sees huge bristles coming in her direction! The tiny girl tried to run but was caught up in the bristles and dragged towards the dust pan.  As the broom suddenly stops, Jenna is ripped from it's bristles and lands with a thud on the dust pan.  She had little time to react more dirt and dust from under the desk, is piled around her.  After a few more sweeps, the mite sized girl is lifted with the dust pan and brought up towards her capturess.  It appears to be an asian woman in her mid-40's. <br>\r\n<br>\r\n\"Please help!!\" Jenna yells up as the titanic woman briefly scans the pan for any valuables, but how could she see a 1/16\" tall girl on the pan.  Jenna desperately looks for something to hold onto as the pan is lowered towards the garbage can. <br>\r\n<br>\r\n\"Oh no! I am not going to the dump again!!\" The tiny girl yells! \"Please see me!!\" Then in a bit of luck the pan slips out of the maid's hand and the pan (with Jenna) lands with a thud on the maid's cart.  The strange turn of events send Jenna flying and she lands safely in a strange new world.<br>\r\n<br>\r\nWhere does Jenna land?</span></div></div>",
            "created":1246078800,
            "id":714831,
            "title":"Bad... The maid with a broom!"
        },
        "1111212221211121111122112112":{
            "choices":[
                "Lizzy, who stopped back in the office.",
                "Danielle, who had frantically been looking for Jenna"
            ],
            "content":"<div class=\"\"><div> <span>Jenna screamed as the huge grey landscape came rushing towards her.  She landed with a hard thud onto the desk, causing her to black out....<br>\r\n<br>\r\nAs she awoke, Jenna tried to remember what happened.  Looking around her surroundings she remembered that she had landed hard on Lizzy's, the bimbo secretary's desk.  The room was dark, with the exception on the desk lamp still lit on Lizzy's desk.  As she stood she realized she wasn't alone, there staring back high above her were a pair of eyes.<br>\r\n<br>\r\nThose eyes were none other than...</span></div></div>",
            "created":1248066000,
            "id":729131,
            "title":"On Lizzy's desk"
        },
        "11112122212111211111221121121":{
            "choices":[
                "On Lizzy's bathroom",
                "On the floor in Lizzy's apartment"
            ],
            "content":"<div class=\"\"><div> <span>\"COOL\", The huge bimbo bellowed, as she had noticed that it wasn't just a tiny bug on her desk, it was a speck sized person.  She had known that the office she had worked in had some pretty crazy experiments, but shrink... people, that was sweet.<br>\r\n<br>\r\nJenna, however, was not amused.  Realizing her predicament, and the excited tone of the titanic blond staring back at her, she took off running. But the empty desk provided little shelter, and the giantess boomed with laughter.  <br>\r\n<br>\r\n\"OH NO LITTLE ONE\" Lizzy said, \"YOU'RE TOTALLY COMING WITH ME\".  <br>\r\n<br>\r\nJenna watched as Lizzy brought her finger down toward her.   Jenna continued running but was stopped in her tracks as the titanic digit lifted and slammed down(at her perspective), causing Jenna's world to shake and send her spilling towards the ground.<br>\r\n<br>\r\nJenna looked up as the Titan laughed down at her, \"WELL, AREN'T YOU GOING TO TRY AND RUN?\" Without another option Jenna got up and attempted to escape again but was only back to the ground as Lizzy tapped her enormous finger on the desk again.  This continued for a few minutes until Jenna was too tired to get up.<br>\r\n<br>\r\n\"YOU'RE NO FUN\" Lizzy smirked, \"MAYBE I SHOULD JUST SQUASH YOU.\" Lifting her finger, she began to lower it onto the now exhausted Jenna. <br>\r\n<br>\r\n\"Noooo! Please!\" Jenna screamed as the huge fleshy finger pressed into her.  She waited for herself to pop but it never happened.  Jenna instead felt herself lift into the air and came face to face with one of Lizzy's monsterous blue eyes. <br>\r\n<br>\r\n\"SORRY, YOU'RE TOO EASY TO SQUISH.\" Lizzy mocked, \"LOOKS LIKE YOU'LL JUST HAVE TO COME HOME AND PLAY WITH ME, HAHA\"<br>\r\n<br>\r\nJenna did not like the sound of that.  She watched in horror as Lizzy opened a huge (to her perspective) locket with her other hand.  She cried out as she felt herself scraped off the finger, only to fall in the giant object.  Still yelling, Jenna was thrown into the darkness as the locket snapped shut.............<br>\r\n<br>\r\n------------------------------------------------------------------------<br>\r\n<br>\r\nSome time later, after a bumpy ride, Jenna covered her eyes as light poured into the opening locket.  Suddenly, she felt her world turn upside down as she landed with a thud on a hard surface.  Looking around she quickly realized she was....<br>\r\n<br>\r\n  </span></div></div>",
            "created":1248066000,
            "id":729140,
            "title":"Big Blond Bimbo = Bad"
        },
        "111121222121112111112211212":{
            "choices":[
                "No.... SQUISH!",
                "Yes... It's a miracle!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lizzy's huge nylon-clad foot flying in Jenna's direction! The mite sized girl has only a second before the huge foot is upon her!  She screams as it's shadow overtakes her position and slams down on top of her!  Does Jenna make it?</span></div></span></div>",
            "created":1245992400,
            "id":714673,
            "title":"Worse.... Lizzy's nylon clad foot headed in..."
        },
        "1111212221211121111122112122":{
            "choices":[
                "Lizzy was headed to the mall",
                "Lizzy was headed home"
            ],
            "content":"<div class=\"\"><div> <span>Jenna curled up in a ball waiting to be crushed by the massive foot but it never came.  She was shaken from her daze by the awful smell of nylon and sweat.  Looking up, she saw she was under arch of Lizzy's toes.<br>\r\n<br>\r\n\"I'm alive!\" She screamed. However, she may have been better off dead.  She was now trapped under Lizzy's foot and to make matters worse, stocking was as thick as ropes and held her to the ground.  Every breath she took smelt of foot sweat and caused her to gag.  She pondered a way out but her answer came soon enough...<br>\r\n<br>\r\n----------------------------------<br>\r\n<br>\r\nLizzy had to make a quick stop at her desk before trying to sneak out early.  She dropped her purse in front of the desk and quickly checked her e-mails.  The blond bimbo slid off her right shoe and placing it under the desk, slid it nervously back and forth.<br>\r\n<br>\r\n\"I totally need a new job\" she mumbled under her breath, \"These people are real losers.\" Signing off her computer, she looked around the corner and not seeing anyone, slipped her right shoe on before heading out the door, unbeknown to her of little companion.<br>\r\n<br>\r\n----------------------------------<br>\r\n<br>\r\nJenna's world was thrown into chaos as the enormous foot on top of her quickly slid back and forth.  Before she knew it the rope like nylon strands had tangled her up and she felt her lifted off the ground.<br>\r\n<br>\r\n\"NOOO\" she screamed, \"NO MORE SHOES!!!! PLEEEASSSEE\" Jenna watched as the foot lifted off the ground and zoomed into the awaiting flat.  Jenna was once again at the mercy of another woman's feet but this time, she didn't know she was there.  Jenna desperately tried to get free but the rope like nylon heldher tight.  Doing her best to stay calm, she waited patiently to be free again.<br>\r\n<br>\r\nWhere was Lizzy headed.....</span></div></div>",
            "created":1246078800,
            "id":714816,
            "title":"Miracle or Curse?"
        },
        "11112122212111211111221122":{
            "choices":[
                "Danielle winking at her.",
                "Michelle's wicked smile."
            ],
            "content":"<div class=\"\"><div> <span>Heeding Danielle's warning, Jenna avoids Lizzy's desk and continues running towards the door.  However the spider is gaining fast.  Beginning to panic, Jenna nervously looks for an escape, but finds none.  Turning while she runs, she sees the the spider with a couple hundred feet from her.  <br>\r\n<br>\r\n\"This is it.. .All this way only to be spider food\" Jenna thinks to herself, frantically looking for a way out.  Her thoughts are shaken though by a huge boom that sends her sprawling to the ground.  <br>\r\n<br>\r\nDusting herself off she looks behind her in shock to see the spider replaced with a massive shoe.  Jenna cranes her neck upwards and is shocked to see....</span></div></div>",
            "created":1246338000,
            "id":716976,
            "title":"Saved?"
        },
        "11112122212111211111222":{
            "choices":[
                "The gym for a good work out.",
                "Her sons school to pick up some paperwork."
            ],
            "content":"<div class=\"\"><div> <span>Jenna sprinted to the huge pair of feet on the right in hopes that it was her mother's friend.  She had to move fast, not knowing when they 3 women would get up.  If she didn't make it and Michelle found her, who knows what she'd do to Jenna!  After several minutes, Jenna reached the left foot and stared up.  <br>\r\n<br>\r\n\"I still can't see who it is\" she said to herself. \"But anywhere is better than with Michelle.\" She walked up to the shoe, looking for a way up.  Luckily for Jenna, her small size allowed her to use the scuffs and ridges in the shoe as hand holds and she began to climb.  However, about half way up the shoe, all 3 giantess stood.  The 3 booming voices above her seemed to be saying their goodbye's for now.  Moving faster, Jenna reached the top of the shoe just as she heard Michelle speak to Samantha.<br>\r\n<br>\r\n\"I LOOK FORWARD TO WORKING WITH YOU\" Michelle bellowed, \"WE'LL SEE YOU TOMORROW\"<br>\r\n<br>\r\n\"THANK YOU SO MUCH\" Samantha replied, \"I CAN'T WAIT\".<br>\r\n<br>\r\nWith that, the foot that Jenna was on began to move.  She had picked right!!  Jenna clung tightly to Samantha's foot as the woman headed out the building.  Jenna watched as Samantha walked to her car, got in and began to drive.<br>\r\n<br>\r\n\"I wonder where she's going?\" Jenna said to herself.  \"I think I'll wait til she gets home before I find a way to get her attention\" Jenna felt relatively safe perched safely above, however, little did she know Samantha had a few stops before she got home.<br>\r\n<br>\r\nFirst was...</span></div></div>",
            "created":1238389200,
            "id":668931,
            "title":"The Mary Janes on the right"
        },
        "111121222121112111112221":{
            "choices":[
                "In Samantha's Gym sock",
                "Another girl's headband"
            ],
            "content":"<div class=\"\"><div> <span>Jenna clung to top of the shoe as the monolithic woman exited her car and began to walk.  She knew Samantha wasn't home but where was she? At this size buildings were far too large to recognize.  Jenna watched as Samantha walked into the huge building and enter a room..... a locker room, Samntha was at the gym!<br>\r\n<br>\r\nJenna watched as the enormous woman began to undress.  In awe, she failed to realize that Samantha was taking off her shoes! Jenna screamed as once again she was sent flying into the air.  She once again landed with a thud.<br>\r\n<br>\r\n\"This is really starting to get old\" she said to herself.  Jenna looked around, she was surrounded by white cloth everywhere.  Even at her minute size, it was still soft.  However, wherever she had landed began to rustle and move.  She held on for dear life and screamed.  Jenna realized she had landed.....<br>\r\n<br>\r\n</span></div></div>",
            "created":1238475600,
            "id":669361,
            "title":"The gym for a good work out."
        },
        "1111212221211121111122211":{
            "choices":[
                "In the gym showers! This can't be good.",
                "At home in her bathroom.  Let's get her attention!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna watched in horror as 5 building sized objects entered her sanctuary.  Those objects were Samantha's toes!  Jenna was thrown around as the sock tightened around Samantha's foot and the enormous toes wiggled.  Jenna landed in the space between Samantha's big and second toe.  She watched as any remaining light disappeared as Samantha's foot entered her sneaker.  Jenna prayed for a light workout as the foot began to move.<br>\r\n<br>\r\nThe next hour was torture.  It must have been Samantha's running day as Jenna's prison was constantly in motion.  Jenna was constantly bouncing around and began stuck to the underside of one of Samantha's toes.  Sweat built up and washed over the minuscule girl, making it difficult for her to breathe.<br>\r\n<br>\r\n\"What am I going to do!\" She screamed \"I have to get out of here!\" The endless motion, heat and sweat were almost too much for tiny Jenna and she passed out......<br>\r\n<br>\r\nJenna slowly regained consciousness as fresh air hit her face.  Looking up, she saw a few huge pillars above her.<br>\r\n<br>\r\n\"I'm still under Sam's foot\" she said to herself, \"But where's Sam?\"<br>\r\n<br>\r\nJenna jumped as the enormous foot lifted, giving her a better view of her surroundings.  <br>\r\n<br>\r\nIt seemed that Samantha was....</span></div></div>",
            "created":1238475600,
            "id":669366,
            "title":"Big workout for the little girl"
        },
        "11112122212111211111222112":{
            "choices":[
                "Climb Samantha, she'll help me out",
                "Find some cover and come up with a plan"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was relieved to see the familiar surroundings of Samantha's bathroom, as she had been her many times before.  She watched as Samantha rumbled out of the room only in a towel. <br>\r\n<br>\r\n\"She must have gotten out of the shower\" Jenna said to herself. Her momentary awe was shaken by the realization that she out in the open and standing in the middle of the bathroom.  To her right was a massive toilet and sink and to her left was Samantha's titanic (to Jenna) shower floor mat in the shadows of the utterly gigantic shower.  <br>\r\n<br>\r\nHowever, any thoughts of Jenna had were interrupted as Samantha walked back into the bathroom, this time in a bath robe.  Jenna froze as Samantha's feet slammed right down in front of her.  Jenna watched as the massive woman sat down and began to blow dry her hair.  To the tiny Jenna, the noise was deafening but this may be her chance to get Sam's attention. Jenna thought she could climb Samantha like she climbed Michelle.  However, the last time she tried to get a giant's attention didn't work out so well and although Sam was a good friend of the family she might not recognized Jenna at a 1/16\" tall.  <br>\r\n<br>\r\nWith time running short Jenna decides to......</span></div></div>",
            "created":1251262800,
            "id":750988,
            "title":"Decisions, Decisions"
        },
        "111121222121112111112222":{
            "choices":[
                "A tiny student for her enjoyment",
                "Some interesting growth on the slide."
            ],
            "content":"<div class=\"\"><div> <span>    Jenna clung to top of the shoe as the monolithic woman exited her car and began to walk. She knew Samantha wasn't home but where was she? At this size buildings were far too large to recognize. Jenna watched as Samantha walked into the huge building... her old school! <br>\r\n<br>\r\n\"Samantha must be meeting with one of her son's teachers\" Jenna said to herself, doing the best she could to hold on.  She watched as Samantha walked through the halls and into a room she recognized.  <br>\r\n<br>\r\n\"Oh great\" Jenna said to herself, \"This looks like Cruella's room\" Cruella was Jenna and her friends nickname for their 10th grade biology teacher, Ms. Cruden.  Ms. Cruden was brutal to the girls throughout her class and the thought of being in this room again sent shudders down Jenna's spine.  Her thoughts were interrupted as she heard another person walk through the door.<br>\r\n<br>\r\n----------------------------------------------------------------<br>\r\n<br>\r\nSamantha nervously waited for her son's biology teacher.  She slowly made her way around the room, looking at the expirements that were laid out.  She bent over to peer into a microscope when she was interrupted.<br>\r\n<br>\r\n\"Please don't touch anything\" The voice behind her said.  It was her son Matt's teacher, Ms. Cruden.  Ms. Cruden was a busty woman in her mid-40's who's attire left someting to be desired.  <br>\r\n<br>\r\n\"Please take a seat so we can discuss Matt's process\" The teacher spoke.  Samantha began to walk to the front of the room but tripped and nearly fell on a cord.<br>\r\n<br>\r\n\"Please Ms. Barnes, BE CAREFUL\" Ms. Cruden spoke.  <br>\r\n<br>\r\n\"Sorry\" Samantha replied as she sat down.<br>\r\n<br>\r\n----------------------------------------------------------------<br>\r\n<br>\r\nJenna's world was thrown into chaos once again. She was caught by surprise when Samantha tripped and was once again sent whisking through the air.  Jenna screamed as she flew and landed with a thud and she slowly drifted off to black.<br>\r\n<br>\r\nSlowly she collected herself and looked around her surroundings.  She was on a vast glass plain and there was a huge tube above her.  She had landed on a microscope!! Not only a microscope, but the one on Ms. Cruden's desk.<br>\r\n<br>\r\n\"Oh no!\" Jenna said, \"I have to get back to Sam.\"  That wouldn't be easy as the two were talking near the door, seemingly saying their goodbyes.  She looked for a way off the microscope but the smooth surfaces made it difficult.  <br>\r\n<br>\r\nPanicking, she looked for an out but was interrupted by the booming of footsteps.  She turned in horror as a massive shadow overcame her.  Her former biology teacher was now sitting down at her desk.  Jenna watched as the Titaness bent over and peered into her microscope. \"Please don't let Cruella see me\" Jenna said to herself.<br>\r\n<br>\r\n\"WELL WHAT DO WE HAVE HERE\", the giantess spoke and smiled.  She had seen.....</span></div></div>",
            "created":1240117200,
            "id":678795,
            "title":"Her sons school to pick up some paperwork."
        },
        "1111212221211121111122221":{
            "choices":[
                "A knock at the door... Ms. Cruden's student teacher",
                "An alarm... Time to go home."
            ],
            "content":"<div class=\"\"><div> <span>\"WELL I DON'T BELIEVE MY EYES\" The huge teacher spoke. \"IS THAT AN ITTY BITTY STUDENT I SEE.  I HAD HEARD ABOUT THIS BEFORE BUT NEVER THOUGHT I'D GET THE PLEASURE TO SEE IT MYSELF\" The giantess chuckled.  This did nothing but scare the pants off of Jenna.  She looked up into the lens seeing a gigantic eye staring down at her.<br>\r\n<br>\r\n\"LET'S GET A CLOSER LOOK AT YOU\", the huge voice boomed from above. Jenna watched two huge tree like fingers grab the lens and rotate it.  <br>\r\n<br>\r\n\"She's switching the lens, she's going to know who I am!\" Jenna shuddered, as she was not the ideal student in Ms. Cruden's class.  The two never saw eye to eye and she couldn't imagine what this wicked teacher would do to her at this size.<br>\r\n<br>\r\nThe enormous eye returned to the lens, larger than before due to the scope's higher power.  <br>\r\n<br>\r\n\"JENNA... JENNA GREENE IS THAT YOU?\" The titaness boomed, \"HOW DID YOU... HAVE YOU BEEN HERE FOR TWO YEARS?\" The giantess almost sounded concerned.<br>\r\n<br>\r\nJenna felt the ground shake as the slide was removed from the microscope.  Looking up at her old bewildered teacher, Jenna had an ounce of hope. However, that would quickly vanish as Ms. Cruden's bewilderment would give way to a slick smile.  The ground tilted, Jenna screamed landing on a wrinkly plain.  She was sitting in the middle of Ms. Cruden's palm, which seemed to stretch out for hundreds of feet.  Five huge fingers rose in the air.<br>\r\n<br>\r\n\"OH THIS IS TOO PERFECT! YOU WERE NOTHING BUT TROUBLE FOR ME A FEW YEARS AGO AND IT SEEMS AS FATE HAS BROUGHT YOU BACK HERE TO REPAY ME!\" Ms. Cruden boomed.  <br>\r\n<br>\r\nJenna panicked not knowing what to do, she was trapped.  She scanned her old teacher.  Her features magnified thousand's of times.  Her buxom figure rose into the air like a mountain.  Slowly a finger began to approach Jenna and she screamed, \"I have to get out of here!\"<br>\r\n<br>\r\n\"WHAT TO DO WITH YOU MY DEAR?\" The giantess' roared, \"SO MANY THINGS.... HAHAHA.\" A huge finger nail scooped up the girl and brought her to her face.  Up close Jenna could see the makeup caked on Cruella's eye. \"AND YOU'RE SO SMALL... NO ONE WILL EVER KNOW\"<br>\r\n<br>\r\n\"f#@% you\" The tiny girl screamed back, just loud enough for the giant to hear.<br>\r\n<br>\r\n\"FIESTY AREN'T YOU... DON'T WORRY YOU'LL PAY\" However, Cruella's thoughts were interrupted by...<br>\r\n<br>\r\n </span></div></div>",
            "created":1240808400,
            "id":682603,
            "title":"Cruel Teacher"
        },
        "11112122212111211111222212":{
            "choices":[
                "Cruella crushes the small girl",
                "Cruella decides that's enough for tonight"
            ],
            "content":"<div class=\"\"><div> <span>A loud ringing broke \"Cruella\" from her trance.  \"OH DEAR IT'S TIME TO GO\" she said, looking at the minute girl on her finger.  \"NOW HOW TO GET YOU HOME?\"<br>\r\n<br>\r\nJenna watched as the titaness shuffled through a drawer with her free hand.<br>\r\n<br>\r\n\"AHH THIS IS PERFECT\" the giantess boomed, pulling out an empty tic tac box.  Tilting her finger.  She deposited tiny Jenna as gently into the opening before snapping it shut. Smiling as she brought it up to her eyes, Ms. Cruden smiled before shoving the small box between her large breasts and headed home.  <br>\r\n<br>\r\n---------------------------------------------------------------------------- ------------------------------<br>\r\n<br>\r\nThe fall into the tic tac box was a traumatic one.  She fell hundreds of feet before slamming into the box's bottom.  Her world went dark as Jenna's cage was shoved into Cruella's bosom.  Jenna sobbed as she waited to see what her wicked old teacher would do to her next.  <br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------------------------<br>\r\n<br>\r\nMs. Cruden went home, made dinner, watched some TV and got ready for bed before checking on Jenna.  Reaching in between her breasts, she pulled out the box and gave it a shake.  She chuckled as the tiny girl bounced around the case like a pinball, giving her a hearty laugh.<br>\r\n<br>\r\n\"WAKEY, WAKEY! TIME TO PLAY\" she stated, opening the case.  She turned it upside down and let the girl fall onto her hand.  Slowly she lowered her hand down before spilling the girl on the floor.  \"AND YOU STILL NEED TO BE PUNISHED FOR YOUR \"LITTLE\" COMMENT EARLY\" The giantess bellowed looking down at her prey, laughing all along....<br>\r\n<br>\r\n---------------------------------------------------------------------------- ---------------------------<br>\r\n\"WAKEY, WAKEY! TIME TO PLAY\"<br>\r\n<br>\r\nJenna awoke with a start as her prison removed from Cruella's breasts, shaken and she was deposited in Cruella's hand.  Her ears popped as Cruella's hand lowered and deposited her between two enormous feet.<br>\r\n<br>\r\n\"No more feet!\" She said, watching the giantess' every move.<br>\r\n<br>\r\n \"AND YOU STILL NEED TO BE PUNISHED FOR YOUR \"LITTLE\" COMMENT EARLIER\"<br>\r\n<br>\r\nJenna did not like the sound of that but was frozen in place.  She watched as the giantess moved her foot towards her slamming it down next to her.  It smelled awful!<br>\r\n<br>\r\nShe watched in horror as Cruella made her next move....<br>\r\n<br>\r\n</span></div></div>",
            "created":1240808400,
            "id":682705,
            "title":"An alarm... Time to go home."
        },
        "111121222121112111112222122":{
            "choices":[
                "Take a chance and escape now",
                "Too risky, Jenna tries again tomorrow."
            ],
            "content":"<div class=\"\"><div> <span>The huge woman lifts her big toe and slams it down in front of Jenna, causing her to scream.<br>\r\n<br>\r\n\"HAHA... FRIGHTENED BY MY TOE\", the titaness booms. \"YOU'RE LUCKY I CAN'T THINK OF ANYTHING GOOD TONIGHT\" she says, scooping up the mite sized Jenna into her fingernail.<br>\r\n<br>\r\nMs. Cruden deposits the tiny girl back into the Tic Tac prison before speaking again.<br>\r\n<br>\r\n\"NOW GET YOUR REST.... YOU'RE GOING TO NEED IT\" she states with that slick smile on her face.<br>\r\n<br>\r\nMs. Cruden sets the box on it's side on the kitchen table before retreating to bed.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------------------------<br>\r\n<br>\r\nJenna clearly traumatized sits in the corner of the tic tac box.  She clearly wants no part of whatever \"Cruella\" has in store for her tomorrow. <br>\r\n<br>\r\nShe walks the length of the box to the cap and notices it's slightly ajar! \"I think I can escape!\" She exclaims!!<br>\r\n<br>\r\nHowever, if she was to leave now, where to? It was a long drop to the floor and even then she needed to get out of the house.  However, staying she ran the risk of whatever \"Cruella\" had in store for her tomorrow.<br>\r\n<br>\r\nJenna decided to.....</span></div></div>",
            "created":1240894800,
            "id":683310,
            "title":"Prison break"
        },
        "1111212221211121111122221221":{
            "choices":[
                "head for the door and head for home.",
                "become a stow-away and go to school."
            ],
            "content":"<div class=\"\"><div> <span>Jenna not wanting to miss this opportunity, runs to the cap opening.  Peering around the corner, she watches as the bedroom light in Ms. Cruden's room turns off.  Jenna walks out of her prison and looks around the table top.  Although its small to a normal sized person, Jenna sees the tabletop stretch for hundreds of feet in all directions.  In front of her is a huge pad of paper and pen and to her right are Cruella's huge reading glasses.  Although these objects are massive, they are of little help to the tiny Jenna.   She turns around to face her prison and sees a ray of hope, a gigantic telephone. And that phone had a gigantic cord that went to the gigantic floor.  <br>\r\n<br>\r\nJenna sprinted the phone and began to shimmy down the cord.  Her small size made it easy to use the cord as a slide.  Reaching the floor, she reviewed her options.  To her right was the Cruella's main hallway, which would get Jenna to the front door.  To her left was Cruella's bedroom.  It was still relatively early and she could try and make under the front door before Cruella woke the next morning.  However, she'd be facing the outdoor world alone and without any protection.  On the other hand, she could head to Cruella's bedroom and find something to hitch a ride into school the next morning.  Although this may be safer, if Cruella were to find her, Jenna would be doomed.<br>\r\n<br>\r\nJenna decides to........</span></div></div>",
            "created":1251867600,
            "id":754647,
            "title":"Take a chance and escape now"
        },
        "1111212221211121111122221222":{
            "author_id":"leem0001",
            "author_name":"Lee3000",
            "choices":[
                "Jenna is stuck all day until Cruella gets home.",
                "Cruella checks on the speck at lunch."
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to risk getting lost in the giant world at night, Jenna decides to wait until morning when her vision is better. She then lays down and tries fruitlessly to sleep. The hours go past but her tired, shaking body just cannot fall into slumber.<br>\r\n<br>\r\nMorning eventually comes and Jenna contemplates escaping. She is terrified and for the longest time waits and waits until eventualyl making a run for it. Just as she is climbing out she hears the BOOM BOOM BOOM of slapping feet on the tiled floor. Cruella has entered the room. She walkes over to Jenna and peers down with a satisifed grin. She is already dressed for work.<br>\r\n<br>\r\n'GOING SOMEWHERE LITTLE SPECK?' She sneers. Jenna is terrified and knows she is in trouble. The huge fingernails of Cruella come down and pinch her miniscule form between them, bringing her to the giant womans face.<br>\r\n'WELL, YOU NEED TO BE TAUGHT A LESSON FOR THAT LITTLE TINY BUG. IF YOU EVER DISOBEY ME AGAIN I WILL SQUISH YOU UNDER MY BIG OLD FOOT! BUT FOR NOW...'<br>\r\n<br>\r\nJenna felt herself plummet, looking down she saw she was heading for Cruellas gian, unwashed foot. The immense smell of sweaty feet assaulted her as she got closer to the giant big toe, it's huge red nail looking ominous. She then stopped just before it, the stink of it washing over her constantly.<br>\r\n<br>\r\n'...FOR NOW YOU GET TO SPEND THE DAY FINDING OUT WHAT ITS LIKE TO BE DIRT UNDERNEATH MY TOENAILS.' Jenna is then thrust into the space beneath her big toenail, becoming wedged between it and the skin of her toe. The smell and heat are even worse in here, causing Jenna to gag and cry. She is so tightly packed she cannot move. She then hears her captors voice again.<br>\r\n<br>\r\n'THAT'S WHERE YOU WILL STAY FOR THE REST OF THE DAY, LEARNING YOUR PLACE TO ME. YOU DISGUSTING LITTLE BUG. She then cackled.<br>\r\n<br>\r\nCruella loved the feeling of the tiny girl stuck under her toenail. How degrading. She could feel the pressure from her tiny from pressing against the skin of her toe an knew the smell would be overpowering. Now she planned to make it worse. She put on some tan nylons and slid her feet into some old, worn, mules. She wiggled her big toes and felt the little girl fight helplessly. She then set off to work.<br>\r\n<br>\r\n</span></div></div>",
            "created":1241067600,
            "id":684171,
            "title":"Too risky, Jenna tries again tomorrow."
        },
        "11112122212111211112":{
            "choices":[
                "College Girl - This other one scares me.",
                "Michelle - Second times the charm"
            ],
            "content":"<div class=\"\"><div> <span>\"Who's that!\" Jenna screamed.  It seemed to be a girl her age of latino decent.  Her dark hair was pulled back in a pony tail, she was shorter than the homeowner giantess but still huge to Jenna.  The latino girl seemed to be moving things off of the desk.<br>\r\n<br>\r\n\"No wait!\" Jenna screamed as the girl pulled away the ring protecting her.  \"Stop I'm here! Don't move that I was so close!\" But this was to no avail as the girl walked away. <br>\r\n<br>\r\n\"Now what do I do?\" Jenna thought. \"How can this get any worse?\" And on queue it did.  The new giantess walked back with a rag. She was dusting off the desk!!!  <br>\r\n<br>\r\nJenna ran as the huge piece of cloth came her way, only to be caught up in it.  \"Not again!\" Jenna cried as she was dragged with the cloth off the desk.  She began to fall only to land on.......a fluffy pink surface?  The house had hardwood floors, so where could she be?  She got her answer as the huge surface lurched forward.<br>\r\n---------------------------------------------------------------------------- ---------<br>\r\n<br>\r\nMeanwhile, Aida had just finished the desk.  The clutz she was, she dropped her rag again. \"I need a new job\" she said to herself as she picked the rag off her slipper (the floors made her feet cold) and continued her work.  She didn't mind cleaning for Ms. Michelle Smith, the pay was great.  It's just that Ms. Smith was so secretive and was always making a fuss about Aida touching things but still doing a good job.  All she wanted was a paycheck. <br>\r\n<br>\r\nShe was just finishing up as Michelle awoke, \"Oh hello dear, almost done I see\". <br>\r\n<br>\r\n\"Yes, Ms. Smith\" Aida replied.  \"Just picking up my supplies and I'll be off\"<br>\r\n<br>\r\n\"Good good\" Michelle said, walking to the desk.  Seeing nothing in the ring, she breathed a sigh of relief.  \"I have to relax more\" she thought.<br>\r\n<br>\r\nTurning around, she made small talk with Aida, thinking about her day.<br>\r\n<br>\r\n---------------------------------------------------------------------------- --------<br>\r\n<br>\r\nJenna was a wreck.  Her one chance, GONE!  Now on some college girl's slipper, she had a choice.  Take a ride and see where the cleaning girl takes me or hop off and try again with Michelle.</span></div></div>",
            "created":1236661200,
            "id":659150,
            "title":"Aida, the college aged maid cleaning the desk off."
        },
        "111121222121112111121":{
            "choices":[
                "Try and catch a ride with one of the girls",
                "Try and escape on her own"
            ],
            "content":"<div class=\"\"><div> <span>Jenna had little time to think as her new giantess quickly took off her slippers and picked them up.  She despirately clung to the fluffy fabric as they were lifted and lowered into a huge bag.  The miniature girl was engulfed in darkness as the bag zipped shut and her world was thrown into chaos as the she felt the bag lift into the air.<br>\r\n<br>\r\n\"I hope she goes closer to home\" Jenna thought to herself.  \"Maybe she can bring me back there\"<br>\r\n<br>\r\nJenna felt the bag settle on what she assumed was the seat of the new giantess' car and plotted her next move.<br>\r\n<br>\r\n---------------------------------------------------------------------------- ----------------------------<br>\r\n<br>\r\nAida was happy to be out of Ms. Smith's home at such an early hour, it was only 10 am.<br>\r\n<br>\r\n\"Great!\" she shouted, \"The girls won't even be awake when I get back, I can catch a quick nap before catching up on some gossip.\"<br>\r\n<br>\r\nAida sped home and pulled into her sorority house parking lot.  She had a busy day again today, a quick nap, gossip and lunch, then finally preparing for tonight's mixer.  She hurried into the house and quietly stepped into her room.  Her roommates, Kel (a tall blond) and Kim (a tall brunette) were still fast asleep.  Aida carefully emptied her bag, depositing the slippers on the floor before crawling back into bed.  <br>\r\n<br>\r\n\"Ahhh, it's going to be a great day\" Aida thought to herself as she drifted back to sleep.<br>\r\n<br>\r\n-------------------------------------------------------------<br>\r\n<br>\r\nJenna desperately clung to the slipper as she felt the big relift into the air.<br>\r\n<br>\r\n\"This new girl must be home\" she thought.  Her world shook as the giantess moved around.  Again, Jenna felt the bag settle and the sky above her burst into light as the bag reopened.  Her eyes squinted as an enormous reach in lifting the slippers and setting them on the ground.  Rubbing her eyes, she watched her new giantess step into bed and began to look around.  The room was gigantic (even at her own scale) and noticed two other beds in the room too.<br>\r\n<br>\r\n\"She must be in college,\" Jenna thought looking around the room.  \"I wonder which one?\"  Something caught her eye far above her head.  Looking up, she noticed the Greek letters DDX on a city block sized shirt.  <br>\r\n<br>\r\n\"This can't be good...\" Jenna said to herself.  She was in a sorority.  Not only a sorority, the richest, snottiest sorority on her college campus.  <br>\r\n<br>\r\n\"I've gotta get out of here!\" Jenna said, \"But how? Who knows where I am in the house?! Maybe I should try and hitch a ride\"<br>\r\n<br>\r\nWhat should Jenna do next?</span></div></div>",
            "created":1237266000,
            "id":662439,
            "title":"College Girl - This other one scares me."
        },
        "111121222121112112":{
            "choices":[
                "She grows to two inches",
                "She shrinks to be 1/32 of an inch tall"
            ],
            "content":"<div class=\"\"><div> <span>Swinging was a bad choice for Jenna she swung once and jumped only to fall and scream and land directly on Michelle's food.  Michelle looked around because she thought she heard a faint noise, but it turn out to be noting and she continued to eat her Chinese food. Jenna looked and saw how she was the same size as the rice. A shadow over took her body as a spoon came down to get some food. Jenna ran and the spoon missed her what looked like feet to her. She continued to run only to hit the foam wall.there were little bumps allowing her to crawl up and over only to land into some sort of sticky liquid. <br>\r\nMichelle decided to eat some of the chicken with the dipping sauce. The chicken came down and stuck to Jenna. She pushed and was able to get free only to land onto a piece of Michelle's clothing. Michelle eventually finished up and went to bed. Jenna was stuck on the shoulder and was screaming and waving her arms to be heard. Once Michelle laid down Jenna started to move and in the dark it took longer than expected.  Once Jenna got near the ear Michell's sleeping hand swung by and swatted Jenna away making her unconscious.<br>\r\nJenna's body started to tingle as she landed in the nighties pocket. Jenna woke up only to be..</span></div></div>",
            "created":1306731600,
            "id":1116234,
            "title":"Be a daredevil"
        },
        "1111212221211121121":{
            "choices":[
                "Michelle goes to work and doesn't notice Jenna",
                "Michelle Sees Jenna"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was now two inches tall and still in the pocket Michelle took it off and put it in the hamper. She changed her clothes and put those on top of the clothes Jenna was trapped on. Jenna finally got free when Michelle walked out the door. She fell to the floor and walked around trying to find a way out. She needed to find a way out. She looked around and heard a noise but it was only the floor once she stepped on it. She walked into a room to find many dolls. She grabbed some clothes to ware before leaving and continued to walk on.<br>\r\nMichelle came home earlier than usual. she walked around and threw her things all over the place. On the floor she found a doll she never seen before she brought it into her doll room. She thought she heard screaming but thought she was crazy. She put it in a doll house and walked away.<br>\r\n\"Hey don't you hear me?\" Jenna yelled. She walked around the doll house trying to find a way out. She found other dolls and so on. She made her way out and saw Michelle's purse she climbed in and waited...</span></div></div>",
            "created":1306731600,
            "id":1116617,
            "title":"She grows to two inches"
        },
        "11112122212111211211":{
            "choices":[
                "Michelle is changing her purses",
                "Someone steels the purse"
            ],
            "content":"<div class=\"\"><div> <span>Michelle never went back to her purse that evening, Jenna ate some gum she found as the night went on. Jenna fell asleep and was awoke by the zipping of the purse and the violent rocking back and forth, She was now trapped in a poor attempt to be found. She had nothing to bang on or even yell out to the out side world. Everything was muffled from the inside of the purse.<br>\r\nMichelle threw her Keys in and then re-zipped her purse before putting it under her desk for the busy day of work. the constant typing at her computer or the answering of phones took up her day, while Jenna remained trapped in the purse. Eventually work ended and Michelle grabbed her keys without looking. Jenna was asleep from boredom and did not notice. Michelle put her purse back still zipped and left it were Jenna found it a day earlier. <br>\r\nThis went on for the next week as Jenna thought she would never be found and eventually die as a two inch woman. The purse around her shook as....</span></div></div>",
            "created":1315544400,
            "id":1184249,
            "title":"Purse Life"
        },
        "111122":{
            "choices":[
                "Jenna's mom returns",
                "the spider is back and, bigger then before."
            ],
            "content":"<div class=\"\"><div> <span>Jenna walked from the broom and scanned in case the spider returned, nope.she breathed a sigh of relief, and got ready to leave the laundry room. <br>\r\n<br>\r\n   suddenly, she felt a warm feeling loom over her. she looked at her body, and noticed that a strange glow was emitting of her body. Jenna then looked up and noticed that the ceiling was rising even more up. clumps of dust now were growing bigger by the second, and she could feel her body feel lighter. <br>\r\n<br>\r\nsoon it stopped, and Jenna looked around. she was now only abou 1/4 of an inch tall. she was freaked out about the whole situation, and ran. suddenly....</span></div></div>",
            "created":1086670800,
            "id":202224,
            "title":"Dwindling down"
        },
        "1111221":{
            "choices":[
                "she's getting the broom",
                "she's looking for something else...."
            ],
            "content":"<div class=\"\"><div> <span>Jenna ran out of the laundry room, but before she could make it out of the room,a large black surface came in front of her. Janna looked up, and noticed that the black surface was the shoe of her mother. Janne was petrified at the new height of her mother as she could no longer see her face.<br>\r\n<br>\r\nJenna Tried to get her attention, but no use. her Mother took one step into the laundry room. jenna looked up as the shoe flew over her head, attached was a leg that stretched up into the sky. the shoe then crashed into the ground, the force so strong, that it sent a tremor that knocked Jenna off her feet. when she got back up, she looked to see the motive of her mother in the laundry room.</span></div></div>",
            "created":1086670800,
            "id":202225,
            "title":"Big Mother"
        },
        "11112211":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Climb out",
                "Today's Garbage Day"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\nJust as the spider left, Jenna saw a huge broom coming toward her like a tidal wave. <br>\r\n<br>\r\nShe screamed and ran away, but it was a futile effort, and soon she was caught up in the sticks.<br>\r\n<br>\r\nShe was then dropped on a dustpan, and thrown into the trash.<br>\r\n<br>\r\n</span></div></div>",
            "created":1087016400,
            "id":202922,
            "title":"Swepted"
        },
        "111122112":{
            "author_id":"carramrod",
            "author_name":"car ramrod",
            "choices":[
                "She gets down",
                "She stays there out of fear"
            ],
            "content":"<div class=\"\"><div> <span>\"I have to get out of here,\" Jenna thinks to herself. Just then, she feels the trash bag she's in being lifted up, and her heart sinks when she realizes it's trash day. <br>\r\n<br>\r\n\"Help!!!Someone!!!\" Jenna screams as the bag is tossed into the truck, but she's much too tiny for the garbage man ot hear. After a while, the bag moves again, and Jenna figures it's being emptied into the dump. Once the bag stopped moving, she managed to make a hole small enough for her to get out of using a \"tiny\" shard of glass, that was about as big as her. <br>\r\n<br>\r\nShe looked around in horror at the giant mountain range of trash she was now on. \"How am I ever gonna get home?\" she thought.  </span></div></div>",
            "created":1227330000,
            "id":610328,
            "title":"Down in the dumps"
        },
        "1111221121":{
            "author_id":"carramrod",
            "author_name":"car ramrod",
            "choices":[
                "She shrinks again!",
                "It starts raining"
            ],
            "content":"<div class=\"\"><div> <span>Jenna goes to the edge of the ridiculously large pile of trash, considering a hike to the bottom, and looks down. She gets dizzy from the altitude. \"I'll never be able to climb down that,\" she says to herself, taking into account the danger at her tiny size. \"Besides,\" she thinks, \" I'm still barefoot and in my bra and panties; not exactly hiking attire.\" <br>\r\n<br>\r\nJust then, a huge shadow casts over her, followed by loud buzzing, and she sees a fly right over her. Scared for her life at first, Jenna then realizes the fly is paying her no attention. \"Hey!\" Jenna thought.\"I can grab a ride off this stinky mountain.\" She grabbed one of the fly's legs and held on for ear life as the fly flew out of the dump, and after a minute or two, got close enough to the ground for Jenna to jump off. \"Thanks for the ride,\" Jenna yelled. <br>\r\n<br>\r\n\"Thank goodness I'm out of there,\" Jenna thought. \"But how am I gonna get home?\" This puzzled her as she started to walk in the direction she thought her house was, but at this size really had no idea anymore. She was just so happy to be out of the dump. But just when she thought she left the worst part in the garbage...  </span></div></div>",
            "created":1227330000,
            "id":610336,
            "title":"Not exactly first class"
        },
        "11112211211":{
            "author_id":"carramrod",
            "author_name":"car ramrod",
            "choices":[
                "An ant approaches Jenna",
                "Someone Jenna knows picks the penny up"
            ],
            "content":"<div class=\"\"><div> <span>The second Jenna started walking, she feels a warm, tingling sensation throughout her body. She looks around at the pebbles and dirt clumps, and is horrified when she realizes they're getting bigger! \" OH NO!! I'm shrinking even more!\" Jenna screams. <br>\r\n<br>\r\nShe stops dwindling down after a few seconds, but knows she shrunk enough to make getting home and finding a solution an even more impossible task than it already was. Not knowing exactly how much she shrunk, Jenna kept walking until she came to a huge, brownish wall in her way. The wall was about as tall as she was, coming up to her eye level. She tried to climb over it, but soon realized it wasn't a wall but a raised surface. Once on the surface, Jenna noticed giant letters that were a little bigger than her. She had to walk along  to read what they spelled. Her heart sank as she read the words ONE CENT. \"Oh my gosh, I'm smaller than the writing on a penny!!\" Jenna cried. She knew this meant she was maybe an 1/8 of an inch tall, if she was lucky. <br>\r\n<br>\r\n\"How can things get any worse?\" Jenna thought. </span></div></div>",
            "created":1227330000,
            "id":610341,
            "title":"She shrinks again!"
        },
        "111122112111":{
            "choices":[
                "A kid trying to make an ant farm",
                "A cloud "
            ],
            "content":"<div class=\"\"><div> <span>Jenna was froze in terror as an ant crawled over to the top.It did not see Jenna as a threat but put its pincer around her and took her away. She wiggled to get free, but it was futile. <br>\r\nThe ant continued to crawl till it got to it's ant hill. Ants were everywhere with all different types of food. Before the ant made it into the ant hill a shadow appeared.</span></div></div>",
            "created":1315803600,
            "id":1186130,
            "title":"Ants, Ants and More Ants."
        },
        "111122112112":{
            "author_id":"typer6x",
            "author_name":"Sci-fi",
            "choices":[
                "Jenna gets out of the pocket",
                "Jenna shrinks some more"
            ],
            "content":"<div class=\"\"><div> <span>While Jenna ponders what to do, Her mon is walking down the dive way pushing the recycle bin. While walking she notices a reflection in the sunlight and sees that its coming from the penny Jenna is laying on. When Jenna sees her mother's fingers grab the penny she holds on for dear life while her mother puts the penny in her pocket and contiues pushing the bin. </span></div></div>",
            "created":1334293200,
            "id":1314806,
            "title":"Someone Jenna knows picks the penny up"
        },
        "1111221121122":{
            "author_id":"trank97",
            "author_name":"JohnD",
            "choices":[
                "She’s blown from the button onto another her 6 year old brother",
                "She holds on and continues toward her moms collar"
            ],
            "content":"<div class=\"\"><div> <span>Jenna was in a state of shock having just been atop the cathedral sized penny to now the deep cavern of her moms white causal button up shirt. All she could collect was seeing her moms giant thumb and index finger pluck the ground right from her without even simply looking at it.<br>\r\n<br>\r\nJenna could also collect her hysterical screams as her giant mother held the penny along with her 1/16 inch self aboard, above her shirt pocket held open by her opposite fingers only to drop it in carelessly.<br>\r\n<br>\r\nThe fall was nothing to Jenna.. at her size she didn’t have the same amount of weight as a penny, meaning her decent included a simple fall as she watched the penny crash into the bottom of her moms pocket, closely followed by her and her Tiny, unheard screams. <br>\r\n<br>\r\n“mom! mom noooo!” She belted before bouncing off the pocket walls and onto the base. Jenna was helpless to her mothers movement as she just finished placing the recycling bin at the curb. Her mom continued for the house with plans of making lunch later, unbeknownst to her that her tiny passenger was about to get a whole lot tinier.<br>\r\n<br>\r\n5 minutes had passed and Jenna was in the midst of her desperate plan: escape. She used the stitchings along the side of the pocket to begin her climb and within 10 minutes she was out and onto the landscape of the shirt covering her mothers breasts. All Jenna could imagine was how she must have looked to a regular sized person.. she put it into perspective as seeing a flea on someone’s shirt.. not to even draw the simplest attention. <br>\r\n<br>\r\nThis meant she had to be heard, and her moms ear was the target. <br>\r\n<br>\r\nJenna moved forward holding her arms out trying to keep her balance as her mom moved throughout the house, her breasts bouncing causing Jenna to stumble. To her left Jenna saw something that gave her an idea.. her mothers shirt buttons in the distance.. if she could head over there and use each one for temporary balance, she would stand a chance. <br>\r\n<br>\r\nJennas mom continued to gather ingredients from the fridge for her lunch. By the time she finished and approached the counter, Jenna had arrived at her 3rd button. Jenna grasped the side of the button like she did the penny, having this support was relieving. She took a moment to look up: over the white shirt button, over the collar, to the expanse of her mothers upper chest and neck that stretched upwards to her massive head. Jenna teared up thinking that she’d never be found, to only become a flea on her mother completely unaware of her. But she couldn’t give up.<br>\r\n<br>\r\nSuddenly a surge went through Jenna.. a familiar one at that. “oh no!” She squeaked before shrinking down to 1/64th of an inch.<br>\r\n<br>\r\nShe woke up in a shade. Jenna looked up to see her mothers shirt button above her like a ceiling.. she was so tiny that she had shrunk beneath it. If he mother couldn’t see her then, she was completely done for now. <br>\r\n<br>\r\nHer mother moved once again, and Jenna grabbed the closest thing near her, the strings holding the shirt button in place.. they were as wide as a redwood tree, but she was able to dig her fingers in the gaps. <br>\r\n<br>\r\nThere was no use in screaming, she didn’t know what to do. She looked up to see light protruding through a massive hole in the sky.. it was one of the holes in the shirt buttons.. if she could traverse up the string and out the hole of the button, maybe she could stay safe for a while. <br>\r\n<br>\r\nThe trek wasn’t too hard as the strings became horizontal as Jennas mother bent over the counter to mix ingredients together.. soon she found herself peering out of the button hole of her moms shirt, the world of her home now visible and overwhelmingly huge. Jenna, trembling, held onto the strings that looped through the hole to keep it in place. <br>\r\n<br>\r\nHigh above, her mother realized she mixed in a wrong ingredient and out of annoyance, simply exhales out her mouth..<br>\r\n<br>\r\nBut to Jenna:</span></div></div>",
            "created":1572631020,
            "id":2741062,
            "title":"Jenna shrinks some more"
        },
        "1111222":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "go away.",
                "hold on his foot."
            ],
            "content":"<div class=\"\"><div> <span>The same spider she saw before appeared again, but much bigger. She started running, hoping that the spider would go away. She got out of the room to the hall, but the spider was almost reaching her. She then tripped. She looked back to see the thing she thought would be the last. She heard booms approaching, and suddenly, an enormous object crashed in front of her, crushing the spider. She looked at the object, which really was a slipper. She looked up to see the enormous figure of his dad. For her, he was now hundreds of feet tall. She ran to his foot and started slamming her fists on it. No response. She decided to...</span></div></div>",
            "created":1129438800,
            "id":279097,
            "title":"Saved by daddy"
        },
        "11112222":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "started climbing his gown.",
                "run towards his hand, which was resting on his lap."
            ],
            "content":"<div class=\"\"><div> <span>She holded on his foot. He then began walking. He went to the living room, sat down on the couch, turned on TV and putted his feet on the table. She got down to the table and thought for a moment. She had to get his attention. She climbed his foot again and started to walk through his leg. When she reached his thigh she...</span></div></div>",
            "created":1129438800,
            "id":279101,
            "title":"Getting dad's attention"
        },
        "111122222":{
            "choices":[
                "Head to his ear",
                "Head to his eye"
            ],
            "content":"<div class=\"\"><div> <span>Once at his hand, Jenna began to pound her father's finger. Suddenly, her father lifted his hand and Jenna was taken with it. Her father itched his head leaving Jenna trapped on his scalp! Jenna eyed her new found surroundings. The hairs were thick as rope, and the landscape was very dark with very little light coming through the thick hairs. Walking forward, Jenna felt a familiar tingling sensation as she began to shrink again! When it finished, Jenna was only 1/8th of an inch tall! Now, the thick hairs on her fathers head looked like sky-scrapers to the minuscule Jenna.<br>\r\n<br>\r\nRealizing her time was running out, Jenna decided she had to alert her father of her presence. She had two options: head to his eyes or his ears. Jenna had to choose carefully...</span></div></div>",
            "created":1315630800,
            "id":1184820,
            "title":"run towards his hand, which was resting on his ..."
        },
        "1111222221":{
            "author_id":"trank97",
            "author_name":"JohnD",
            "choices":[
                "Her mom was about to kiss her dad",
                "Her dad was about to drink his coffee"
            ],
            "content":"<div class=\"\"><div> <span>Jenna, being 1/8 inches tall, decided she’d try the safest option and to travel towards her fathers ear. Luckily he was sitting and the lack of his movements made it easy for Jenna to jog through the dark forest of thick black hair. As she got father, the landscape became steeper.. soon too steep to move forward without losing balance. Jenna then grabbed the hair that began to aim downwards and used them to trek lower towards the fleshy monument before her that was her dads ear.<br>\r\n<br>\r\nWith the ear in view and at a reasonable height, Jenna collected the courage needed and let go of the strand of hair she was hanging onto. In a flash, she landed on top of the ear. Luckily for Jenna, it was wide enough and she was small enough to stand on. <br>\r\n<br>\r\n“alright, now how do I get into his ear canal?” She said to herself. <br>\r\n<br>\r\nSuddenly her father yawned, causing him to flex his ears. The earthquake atop the ear caused Jenna to yelp, reach out and grab one of the hairs on the side of her dads head for support.. but just Jenna’s luck... the hair was loose and she found herself falling. Jenna would have landed on her fathers shoulder hundreds of feet below if it wasn’t for the hair she had gripped. The speck size girl found herself floating with the hair.<br>\r\n<br>\r\nLooking around she could see she was orbiting around her dads face.. and right towards his mustache.<br>\r\n“ahh! Dad help me!” She screamed before the rogue hair crashed into a new forest and sending her back into a familiar but much more difficult landscape.<br>\r\n<br>\r\nGripping the hairs of her fathers mustache, Jenna looked down to see her fathers breakfast and above her, his nostrils that flared as he breathed. Those simple inhales were enough to move Jenna upwards which lead her to grip the mustache hairs even harder.<br>\r\n<br>\r\n“Dad please! Please feel me!” she yelled once again.<br>\r\nBut to her unaware father, she was just another strand of facial hair above his upper lip.<br>\r\n<br>\r\nJenna, mind racing suddenly heard a new noise.. a new person.. it was her mom coming into the kitchen<br>\r\n“good morning, hun” said Jennas mom to her husband.<br>\r\n“Mornin’”. He responded, the action shaking Jenna around.<br>\r\n<br>\r\nJenna looked to see</span></div></div>",
            "created":1577505960,
            "id":2765549,
            "title":"Head to his ear"
        },
        "1111222222":{
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>Jenna decided that the eye was the best course of action. She could climb down his hair then jump on to his eye-lash. It took her a good 15 minutes to reach her father's brow at her current size. Once there, she wrapped her arms and legs around a thick hair and began to slide down the strand. Once she reached the end, Jenna realized the flaw in her plan: the hair stopped just above the eye-brow. She would need to jump to get to his eye. Taking a deep breath, Jenna let go of the hair and went into free-fall. Unfortunately, Jenna's sense of distance was off, and she landed with a thud on her father's nose! She grabbed the bridge of his nose with both arms and legs and began to yell for his attention. <br>\r\n<br>\r\nHer father began to shift and wiggle his nose. To her horror, Jenna saw the massive fingers coming to her position. Oh no! He must think I'm a bug, thought Jenna. She jumped to her right at the last second and went into free fall. Henna fell past the white wall of her father's dress shirt and landed directly in his chest pocket. Picking herself up, Jenna checked her person to make sure she wasn't unharmed from the fall. Looking upward, she realized that she would never be able to climb out of the pocket. She was trapped her until her father took his shirt off. <br>\r\n</span></div></div>",
            "created":1315630800,
            "id":1184833,
            "title":"Head to his eye"
        },
        "1112":{
            "choices":[
                "Jenna's mom shuts the door and turns on the washer",
                "The phone rings before Jenna's mom can start the washer"
            ],
            "content":"<div class=\"\"><div> <span>Jenna screamed as loud as she could because she did not want to be put into the wash.  Still her mother could not hear her.  Jenna was bouncing inside the sheets until her mother stopped walking.  She heard a door open and she realized that her mom was about to put the sheets into the washer.  She yelled again for her mom to stop but was not successful.  Jenna flew with the sheets as her mom put them in the washer.  Jenna knew that this may be the end and she started to cry.</span></div></div>",
            "created":1087362000,
            "id":203458,
            "title":"shrunken girls don't go in the wash"
        },
        "11121":{
            "author_id":"ntisa",
            "author_name":"Nathaniel",
            "choices":[
                "haunt your mother by putting your body into her jeans' pocket",
                "Move to the special home for girl who are shrunken and dead"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your mother starts the was cycle and the water begins to fill up. The thing starts spinning. You hit your head and black out. You wakes up but you dont have a body anymore. Your a ghost. Do you</span></div></span></div>",
            "created":1110430800,
            "id":239368,
            "title":"Death"
        },
        "111212":{
            "choices":[
                "Go back to Earth with Tracy",
                "Stay here with Tracy"
            ],
            "content":"<div class=\"\"><div> <span>Your spirit suddenly teleports to a new location. When you're able to focus, you see a lot of girls like you. You seem to be inside a giant home. You float up to one of the girls and ask what is going on. They smile and somehow put their hand on your shoulder.<br>\r\n<br>\r\n\"My name is Tracy. You got shrunk and were killed. As you can see, many girls had a similar fate. You see, there is a witch who flies around at night and shrinks random girls. The witch doesn't like teenagers, and female teenagers are the worst to her. Luckily, her spell that was used to shrink us also created a place for us to go when we die. We're all friends here, this is our home now. We all died like this, I tried to get my brother's attention when he was in the kitchen. I stood on his plate and he mistook me for food and ate me. That girl over there was sat on by her friend.\" Tracy said, pointing to someone else. She then asked how you died. You explained you got stuck in the washer. \"Well it looks like you died in a unique way, I've never heard of someone dying that way.\"<br>\r\n<br>\r\n\"What is there to do around here?\" You ask.<br>\r\n<br>\r\n\"We hang out, or watch tv. We have special channels only for us.\"<br>\r\n<br>\r\n\"Not to offend you, but is there anyway to come back alive?\" Tracy gets a serious look.<br>\r\n<br>\r\n\"I'm not offended, but the journey is hard. Basically, you can return to Earth in a new body, but you only get three lives, you already used one. Every time you go back, you start to look more like a toy to humans. If you go back now, you're body will be softer than the first, like a plush toy. It's a little harder to die, but you can't speak English. If you die and go back again, you'll return as a doll. Still can't speak, but there's another downside too. Girls who see you will become attracted to you and will have a harder time listening to you. They'll want to play, . . . or hurt you. If you die again after that, you'll be stuck here with us. I haven't used my extra lives left, but some of the others have.\" You couldn't believe all of this.<br>\r\n<br>\r\n\"Is this from the witch's magic?\" Your friend nods.<br>\r\n<br>\r\n\"Yes, it might be because she loves to know that we continue to struggle on Earth. Are you still going to go back? I'll come with you if you are, it's been 20 years since I've been on Earth.\"</span></div></div>",
            "created":1496617380,
            "id":2331026,
            "title":"Why you shrunk, and how to live again, with a cost"
        },
        "11122":{
            "choices":[
                "go to the living room where her mother is",
                "wait for her mother to head back to the laundry room"
            ],
            "content":"<div class=\"\"><div> <span>just seconds before the door of the washer shuts, the phone rings. Jenna's mother lets go of the door to go and answer it. as soon as she leaves the room, Jenna gets out of the washer. she Climbs down to the floor, and starts to walk around. she nneds to get her mother's attention, but in a different way. SHe then thinks of a plan, but to do so, she needs to.....</span></div></div>",
            "created":1087448400,
            "id":203543,
            "title":"saved at the last second."
        },
        "111221":{
            "choices":[
                "Climb her leg",
                "Climb up the Cofee table"
            ],
            "content":"<div class=\"\"><div> <span>Jenna quickly exits the laundry room, and past the hallway to make it to teh living room.upon entry, Jenna is waist-Covered in Carpet shag which tickles her body. she then sees her mother on the phone. looks like the call is from one of her friends. you run to her gigantic Shoe and look around. there are two ways to get attention, either climb her leg, or climb the coffee table.<br>\r\n<br>\r\nmake a choice, and hurry, who knows how long she'll be on the phone.</span></div></div>",
            "created":1087448400,
            "id":203544,
            "title":"Descisions"
        },
        "112":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "someone opens the door.",
                "the bell rings."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Phew!\", she thought, as her mother leaved the room. She slowly slid down the sheets and landed on the floor.<br>\r\n\"Well, now what?\", she thought. Just then...</span></div></span></div>",
            "created":1133672400,
            "id":287742,
            "title":"Glide down the sheets"
        },
        "1122":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Climb his leg.",
                "Shout and wave her arms."
            ],
            "content":"<div class=\"\"><div> <span>She heard the bell ringing. Her mother opened the door.<br>\r\n\"Hi, Andy\", her mother said.<br>\r\n\"Oh no! Not Andy!\", she thought. Andy was her 19 yearold neighbour. He was tall, brown haired and had green eyes. She had a little crush with him. She had promised him that she would help him study for the math exam.<br>\r\n\"Is Jenna home?\", he asked.<br>\r\n\"I don't think so\", said her mom, \"I haven't seen her in all the morning, but you can wait for her in her room\".<br>\r\n\"Thank you, Mrs. Green\", he said, as he walked towards her room.<br>\r\n\"What am I going to do?\", she thought. Just then, Andy opened the door. He looked incredibly tall. He was holding his math book in one hand and a calculator in the other. He walked through the room and sat down on her bed.<br>\r\n\"I wonder how long will it take for her to return\", he said. \"But anyway, I have to wait for her, if I want to pass that exam. After all, she's some kind of math genius\".<br>\r\n\"I have to get his attention\", she thought. \"But how?\".</span></div></div>",
            "created":1133672400,
            "id":287743,
            "title":"Andy's visit"
        },
        "11222":{
            "author_id":"king_yugi2003",
            "author_name":"king_yugi2003",
            "choices":[
                "Jenna gets a little wrapped-up",
                "A Giant"
            ],
            "content":"<div class=\"\"><div> <span>Jenna began to wave her arm and yelled at the top of her lungs as she tried to get Andy's attention, but she was too small to be heard. Seeing the dresser she thought she'd climb it and try to get closer to Andy. <br>\r\n<br>\r\nThe wood was cold on her bare flesh. She got half-way up when she slipped and felt herself falling. Suddenly she landed ontop of something springy and as she attempted to move, sticky. \"no...\" she whispered when she realized she had fallen into a spider's web. Looking around she saw the huge monster slowly cralwing toward her.</span></div></div>",
            "created":1133758800,
            "id":288008,
            "title":"Sticky-Time"
        },
        "112221":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Some knocks apart the web killing the spider.",
                "the Spider succeds"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The spider wrapped Jenna in its web the web got past her legs as she screamed. The spider got its web around her arms.<br>\r\n<br>\r\n\"O GOD!!! GOD!!!!\"<br>\r\n<br>\r\nThe spider nearly gets the web around her mouth when...</span></div></span></div>",
            "created":1145768400,
            "id":314977,
            "title":"All wrapped up"
        },
        "1122212":{
            "choices":[
                "Jenna's death",
                "Jenna's Ghost"
            ],
            "content":"<div class=\"\"><div> <span>The spider continues to wrap her body with the web as she tried screaming but the spider was able to manage to get around her mouth and to her nose Jenna continued to squirm around feeling her whole body being covered in the web she took a quick glimpse at Andy seeing him waiting patiently sitting on her bed as the young teenager slowly closes her eyes from the lack of oxygen she then passes out. The spider then wraps her entire body all the way Jenna was knocked out as she fell victim to the spider.<br>\r\n<br>\r\nThe spider then pulls her wrapped self inside the covered web pulling her above from the web to the ceiling as the arachnid began feeding on her body starting from her head as the spider ate her from head to feet, it took the spider a couple of minutes to finish as Jenna was no longer around as the spider devours her enite body whole leaving nothing but her blood dripping from the spiders mouth onto the floor.</span></div></div>",
            "created":1286600400,
            "id":971639,
            "title":"Jenna is all wrapped up"
        },
        "12":{
            "choices":[
                "Explore under the sheets for a while",
                "Try to get onto the bedroom floor",
                "Try to reach her cellphone on her night stand",
                "Stay in bed, being shrunk is kinda cool",
                "Try to reach the TV remote"
            ],
            "content":"<div class=\"\"><div> <span>Jenna thought that this was just a goofy nightmare so she shut her eyes.  When she opened them again she saw that she was barefoot and wearing a bra and underwear and that her bed was HUGE.  She let out a high-pitched scream when she realized that she really did shrink.  She didn't know how small she was because it was hard to compare her size to a giant pillow.  She guesstimated that she was more-or-less 3 inches tall.  She now had to figure out what to do at her new size.</span></div></div>",
            "created":1085720400,
            "id":200758,
            "title":"Oh, it's real..."
        },
        "122":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Stay in the room",
                "Go into the hallway"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She slowly walked toward the edge of the bed, and looked down. It was somewhat deep, though not as much as she thought it would be. She silently prayed, and jumped down.<br>\r\n<br>\r\nShe was a little shaken, but okay. Now what would she do?</span></div></span></div>",
            "created":1086498000,
            "id":202020,
            "title":"Off the bed"
        },
        "1222":{
            "choices":[
                "go in her mother's briefcase",
                "climb the coffee table"
            ],
            "content":"<div class=\"\"><div> <span>Jenna decided that she needed to get attention in order to get back to normal, so she ran out the door, and into the hallway. she decided that her sister would probably be interested in keeping you that height, and so you search for your mother.<br>\r\n<br>\r\nJenna's mother should be in the kitchen, it's early in the day so she doesen't go to work just yet. So Jenna quickly runs to the stairs, taking extra time to safely get down each one. <br>\r\n<br>\r\nwhen she makes it in the living room, she notices that her mother is all ready for work. She's in a business suit, because she has a really important job. you come close to her shoe.<br>\r\n<br>\r\nJenna tries to get her attention, but notices that She's on a cell-phone. Jenna needs a new plan. she decides to....</span></div></div>",
            "created":1086670800,
            "id":202226,
            "title":"trying to get attention"
        },
        "12221":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Her mother is lowering the cellphone back into the pocket.",
                "Her mother's hand is coming down to take out a document.  Jump onto her hand!"
            ],
            "content":"<div class=\"\"><div> <span>A ride in a briefcase, not exactly what Jenna had in mind but it's all she can do.  If she tries to climb onto her mother's shoe, she might fall and unawaringly get stepped on, so the briefcase is the final decision.<br>\r\n<br>\r\nAt first, Jenna thinks the briefcase is closed and there is no way to get inside; in fact, Jenna knows at her tiny size she can't change the briefcase's combination to open it (the numbers are too big to turn).  So, she prays it's already open.<br>\r\n<br>\r\nAs Jenna turns the briefcase's corner, amazingly it is open!  \"Yes!  I can hitch a ride inside,\" says Jenna as she looks up at her towering mother.  She is unaware that her own daughter is near her high heel pump.  Jenna doesn't hesitate anymore and climbs into the briefcase, sitting in the pocket where her mother's cellphone goes.  Jenna then notices something approaching...</span></div></div>",
            "created":1241413200,
            "id":686294,
            "title":"A Trip that's BRIEF and to the point"
        },
        "122211":{
            "choices":[
                "At the mom's job",
                "left in the suitcase"
            ],
            "content":"<div class=\"\"><div> <span>Jenna is in the pocket and sees the giant phone coming in at her. Her mother does not see Jenna and puts the phone in on top of her and closes the suitcase. the phone is pressed hard against her small body and Jenna is praying that it doesn't ring. she pushes with all her strength but has no luck on moving it. she then tries to wiggle around it and eventually falls below on to a file.<br>\r\nHer mother lifts up her suit case and is off to work not knowing that her daughter is rolling around inside nearly getting crushed.Jenna dodges a few things only to get a folder to get two folders around her. her mother then places it down making Jenna get crushed and trapped between the folders. Jenna tries to wiggle free again, but has no luck, so she lets go and waits for the ride to be over.<br>\r\nthe car stops only to let Jenna...</span></div></div>",
            "created":1306645200,
            "id":1115763,
            "title":"Her mother is lowering the cellphone back into..."
        },
        "12222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna decides to climb the coffee table...<br>\r\n<br>\r\nIs it a wise move?</span></div></span></div>",
            "created":1296018000,
            "id":1042804,
            "title":"climb the coffee table"
        },
        "123":{
            "author_id":"powor",
            "author_name":"Powor",
            "choices":[
                "\"Help me! I'm 3 inches tall.\"",
                "Better play it safe and say I have a sore throat."
            ],
            "content":"<div class=\"\"><div> <span>Jenna first of all wanted to get dressed. Even if she was a 3-inches tall she didn't want to be half naked if somebody found her. She looked around too see if there was anything to wear.<br>\r\nShe saw one of her little sister's dolls on her bed.<br>\r\n<br>\r\nThe doll had on a pink T-Shirt, Blue Jeans, and white Tennis Shoes. \"Well I guess it beats what I'm wearing.\" Jenna said. Jenna walked over to it and started to undress it. She then put on her clothes and to her surprise they fit perfect.<br>\r\n<br>\r\nNow that she was dressed Jenna felt a little more relaxed. \"Now I have to find a way too get noticed.\" Jenna thought she scoped the room to find a way to get noticed. It was Saturday so she knew that her dad was at work and her mom was out shopping. <br>\r\n<br>\r\nShe looked at her night stand to check her alarm clock it was only 12PM so her little sister was out playing at a friends. While she looked at the clock she saw that her cell phone was right next to the clock.<br>\r\n<br>\r\n\"That's it I'll call my best friend Rachel she'll help me.\" Jenna said  But first she needed to reach the nightstand the gap between her bed and the stand was far to wide to jump across. But fortunately her pillow was lined up with the stand's height.<br>\r\n<br>\r\nShe climbed the pillow and judged the distance between the stand and the pillow. She then noticed the pull cord to her window shutters.<br>\r\nShe could use it as a rope. \"Okay here I go.\" Jenna said as she jumped toward the rope. Jenna grabbed the rope and swung all the way over to  the night stand.<br>\r\n<br>\r\nJenna was pleased about how well that worked. She quickly ran over to her cell phone which to her was the size of a pool table. She climbed on top of the phone and jumped on each button and quickly dial Rachel's number. Jenna prayed that Rachel was home.<br>\r\n<br>\r\n\"Hello who is it?\" a voice on the phone asked<br>\r\n\"Hello is this Rachel?\" Jenna asked<br>\r\n\"Whoever it is you'll have to speak louder.\" the voice said Jenna recognized Rachel's voice<br>\r\n\"RACHEL IT'S ME JENNA!\" Jenna yelled into the phone<br>\r\n<br>\r\n\"Jenna? What happened to you voice? It sounds tiny and squeaky.\" Rachel asked in confusion Jenna couldn't notice the change in her voice.<br>\r\n<br>\r\nHow does Jenna answer?</span></div></div>",
            "created":1086066000,
            "id":201266,
            "title":"Cell Phone Adventure"
        },
        "1231":{
            "choices":[
                "tries to call her mom",
                "stays there and sits on top of her cellphone"
            ],
            "content":"<div class=\"\"><div> <span>\"You have to help me!\" Jenna begins, \"I woke up this morning really tiny and I need help!\"<br>\r\n<br>\r\n\"Uh, yeah,\" Rachel said.  \"What would you like me to do?\"<br>\r\n<br>\r\n\"Come over here, no one is home right now,\" Jenna replied.<br>\r\n<br>\r\n\"Alright, I'll be right there,\" Rachel said and hung up.  She thought that it probably was a joke, but Jenna was her friend and would help her no matter what.<br>\r\n<br>\r\nJenna now had time to kill before Rachel came.  Jenna... </span></div></div>",
            "created":1086152400,
            "id":201365,
            "title":"can you hear me now?"
        },
        "12311":{
            "author_id":"ninja0027",
            "author_name":"Tha Black Ninja",
            "choices":[
                "Rachel enters the room",
                "Jenna starts to shrink again!"
            ],
            "content":"<div class=\"\"><div> <span>Jenn dialed her Mom's number and pressed send. Ring. Ring. Ring. \"Hello?\" Her mother's voice spoke. \"Mom! It's me Jenna...\" Jenna was interupted by a loud BEEP from her phone. Then the screen went dark. The battery was dead! <br>\r\n<br>\r\nJenna now had no choice but to wait for Rachel to arrive. \"I hope she gets here soon...\" she mumbled.<br>\r\n<br>\r\nJenna sat down on her oversized cell phone and waited for her friend. After what seemed like an eternity, Jenn jumped to her feet when she heard Rachel's voice call out from the hallway. \"Jenna? I'm here... You were just kidding about that shrinking business, right?\"<br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1240894800,
            "id":683007,
            "title":"Battery dies"
        },
        "123112":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Call Rachel's cell phone again, despite being smaller.",
                "Leap onto Rachel's leg and pinch her foot."
            ],
            "content":"<div class=\"\"><div> <span>Jenna is about to shout in response but suddenly the room expands...No! Jenna is shrinking again.  As the shrinking process happens, Rachel's voice seems to boom and echo.  The process stops and Jenna is now 2 inches tall, a size that will prevent Rachel from spotting her friend.<br>\r\n<br>\r\nRachel enters the room wearing a pink blouse, white skirt, and low heel sandals (She has come from Choir Practice).  \"JENNA?  ARE YOU HERE?\"<br>\r\n<br>\r\nJenna can't believe it.  Her friend is now towering above and has no idea she is standing on top of the cellphone.  To make matters worse, Rachel isn't even looking down.  The only good positive thing is that Rachel has entered the room and isn't turning around to leave.<br>\r\n<br>\r\nJenna has to come up with a plan.  One option is that Rachel still has her cell phone, so she can try calling it again; however, with Jenna now 2 inches tall, Rachel may not hear her at all; but, maybe when she sees the caller ID, she'll see her.<br>\r\n<br>\r\nJenna's 2nd option is difficult, but worth a try.  Jenna knows that Rachel has sensitive skin and she can leap onto Rachel's knee, slide down, and pinch her foot.  It's risky, but better than nothing.<br>\r\n<br>\r\nWhile Jenna picks out her option, Rachel places her hands on her hips and impatiently taps her left sandal on the floor.  \"I KNEW IT; SHE'S PLAYING A JOKE ON ME,\"  Rachel says yet something is keeping her from leaving right away.</span></div></div>",
            "created":1241413200,
            "id":686298,
            "title":"Shrunk...Again...Great"
        },
        "12312":{
            "author_id":"powor",
            "author_name":"Powor",
            "choices":[
                "Rachel begins to shink.",
                "Jenna's little sister  comes in with Rachel's little sister."
            ],
            "content":"<div class=\"\"><div> <span>Jenna sat on her cell phone waiting for Rachel's arrival. Looking around she saw her Tv remote was next to the phone. But it wasn't pointing to her Tv so she hopped of the phone and started to push the remote.<br>\r\n<br>\r\nIt took awhile but she managed to slide it enough so that is pointed toward the Tv. She climbed on the remote and pressed the power button. She began to watch Tv.<br>\r\n<br>\r\nHalf an hour later Jenna heard the door down stairs open. \"I hope that's Rachel.\" Jenna said to herself. Whoever it was didn't hesitate to begin to walk up the stairs. Jenna now a little concerned switched off her Tv.<br>\r\n<br>\r\nThe door to Jenna's room opened. Rachel was at the door. Jenna got up and began too wave her arms and yell. \"RACHEL I'M DOWN HERE!\" Jenna yelled. Rachel at first was confused the room appeared to be empty.<br>\r\n<br>\r\n\"Jenna I hope this isn't a joke!\" Rachel said sternly Rachel searched the room with her eyes.<br>\r\nShe noticed a doll sized Jenna waving her arms franticly on a night stand. \"Jenna? Is that you?\" Rachel said walking closer to the night stand<br>\r\n<br>\r\nJenna nodded her head. \"I guess you weren't kidding!\" Rachel said jokingly \"How did this happen?\" \"I don't know?\" Jenna said <br>\r\nJenna explained everything that happened between when she woke up to when she called Rachel on her phone.<br>\r\n<br>\r\n\"So you were on your bed like this?\" Rachel said getting on the bed and placing her head on the pillow.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1086152400,
            "id":201374,
            "title":"A Friend Indeed"
        },
        "123121":{
            "choices":[
                "Rachel and Jenna explore the bed",
                "Jenna's mom comes in"
            ],
            "content":"<div class=\"\"><div> <span>Rachel put her head on Jenna's pillow and laid down on the bed.  \"Okay, so what should we do?\" Rachel asked Jenna.<br>\r\n<br>\r\n\"I dunno,\" Jenna said with a sigh.  \"We better do something, I can't do much while I'm three inches tall.\"<br>\r\n<br>\r\n\"I agree,\" Rachel said.  Just as Rachel said that, she began to shake.  \"What is going on?\" she asked with a tremble in her voice.  The shaking continued and increased.  Rachel began to panic and then noticed her clothes were becoming bigger and that her feet were getting smaller and sliding out of her flip-flops.  <br>\r\n<br>\r\n\"Oh no, you're shrinking too!\" Jenna exclaimed.<br>\r\n<br>\r\n\"NOOOOOOOOOOOO!\" Rachel said with her voice becoming a higher pitch than normal.<br>\r\n<br>\r\nRachel shrank out of her clothes and shoes until she was 3 inches tall.  Fortunately, she was not completely naked as her bra and underwear were still on her shrunken body just like Jenna.<br>\r\n<br>\r\nRachel got up to her feet and stood on Jenna's pillow and looked for Jenna.  To her surprise, Jenna was on the bed also.  During the shrinking sequence, Jenna went back to her to bed to help her friend.<br>\r\n<br>\r\nRachel and Jenna looked at each other and both said at the same time, \"We've got a small problem!\"</span></div></div>",
            "created":1086238800,
            "id":201478,
            "title":"double trouble"
        },
        "1231211":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Countinue to look at it",
                "Then, your 3-year old brother walks in"
            ],
            "content":"<div class=\"\"><div> <span>Jenna and Rachael started to walk across the bed.<br>\r\n<br>\r\n\"Well, I guess it has something to do with the room, maybe the bed\" Rachel hypothesized. <br>\r\n<br>\r\n\"Well, perhaps we'll find something. Hey, what's this?\" Jenna announced.<br>\r\n<br>\r\nIt was small, even to them. It was a golden bracelet that could fit on their shrunken wrists, with strange writing on it.</span></div></div>",
            "created":1087189200,
            "id":203087,
            "title":"Search"
        },
        "12312112":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "He plays with them",
                "Puts them in a cage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just then, Justin, Jenna's little brother came in.<br>\r\n<br>\r\n\"Justin, get mom!\" she yell.<br>\r\n<br>\r\nHowever, he didn't seem to care about mom. He grabbed both of them, and brought them to his room.</span></div></span></div>",
            "created":1087621200,
            "id":203918,
            "title":"Captured"
        },
        "123121121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "He plays with you with his feet",
                "Other play"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Once he gets inside his room he closes the door. He gives you a one tooth grin, \"Let's pway!!\"</span></div></span></div>",
            "created":1320210000,
            "id":1217095,
            "title":"He plays with them"
        },
        "1231211212":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Cat and Mouse.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"We're gonna pway a game!\"<br>\r\n<br>\r\nWhat gem does he want to play?</span></div></span></div>",
            "created":1322974800,
            "id":1234836,
            "title":"Other play"
        },
        "123121122":{
            "author_id":"blackguard",
            "author_name":"Blackguard",
            "choices":[
                "Justin.",
                "mom."
            ],
            "content":"<div class=\"\"><div> <span>When Justin entered his room, he approached to a little cage he had on the floor. He opened the door and putted them in the cage.<br>\r\n\"I don't know how did you shrunk, but we'll have some fun\", he said. \"But later, I have to eat first\". He then walked out of the room.<br>\r\nThe two little teens were looking at each other.<br>\r\n\"Now what?\", asked Rachel.<br>\r\nJenna then looked at the golden bracelet.<br>\r\n\"Maybe we could use it\", she said.<br>\r\n\"I don't know\", said Rachel distrustfully, \"We don't know what it does\".<br>\r\n\"Yes\", said Jenna, \"but we don't know what does Justin have in mind neither. And I don't want to find out\".<br>\r\n\"Fine, but how does this work?\", asked Rachel.<br>\r\nJenna then looked at the bracelet's writings. She didn't understand them, but they were written with normal letters.<br>\r\n\"Maybe we can read them\", she said. She then started reading. Just as she finished, a white light started to flash from the ring. When the light faded, she opened her eyes and saw Rachel's barefeet, but much bigger than her. Rachel looked down at her micro friend.<br>\r\n\"You are too small, even for me!\", she said.<br>\r\n\"Yes\", said Jenna, \"But now I can walk between the bars\".<br>\r\nShe then walked out of the cage.<br>\r\n\"Now is your turn\", she said to Rachel.<br>\r\n\"I will never do that\", said Rachel.<br>\r\n\"You will if you want to escape\", said Jenna. \"Or will you risk to be Justin's toy?\".<br>\r\n\"Fine\", said Rachel, grabing the bracelet. It shinned again, and Rachel shrunk too.<br>\r\nWhen they were both out of the cage they walked to the door. Just then ,it opened. It was...<br>\r\n</span></div></div>",
            "created":1134104400,
            "id":288806,
            "title":"Micro teens"
        },
        "1231211222":{
            "author_name":"hii'mcool",
            "choices":[
                "Stay here and rest some more.",
                "Leave and try to find the babysitter."
            ],
            "content":"<div class=\"\"><div> <span>Jenna's mom walked into the room, her shoes causing earthquakes that made the two girls lose their balance. Jenna screamed, \"MOM!\" and ran over, about to pound on her mother's shoe to get her attention. But then she realized the futility of it. She was so small now that her mom would never feel it through the material of her shoe and Jenna could likely get herself stepped on. She rejoined Rachel and watched in awe as the human skyscraper carried Justin into the room and put him to bed for his daily nap. <br>\r\n\"All right, you stay here honey,\" she said, \"Mommy has to go to work, but the babysitter will be here any minute now. I'll just wait for her and leave.\" She tucked him in and gave him a goodnight kiss and walked out, closing the door behind her and causing the ground to shake so much that the micro girls almost fell into a crack in the floorboards. As soon as they regained their footing, they rushed toward the crack under the door as quickly as possible, not wanting Justin to find them. Once there, they collapsed under the door in exhaustion as the bracelet had not shrunk with them and they had to drag it along. It was about as big as they were, but surprisingly light. Jenna's tiny doll clothes had not shrunk either, and she shivered as she was once again half naked. Rachel sat there panting and massaging her bare feet. <br>\r\n\"Ooh,\" she moaned, \"I'd say I must have gotten a splinter, but the splinters are all bigger than me now. How tiny are we NOW?\"<br>\r\n\"Well,\" Jenna said tiredly, \"When I shrunk just now, it seemed like you were normal size and I was three inches tall. So...\"<br>\r\n\"So we're about three inches tall compared to what we were a few seconds ago. We're microscopic now!\"<br>\r\nJenna judged them to be just barely an eighth of an inch tall. Too small for anyone to notice unless they had a magnifying glass or unless they got very lucky. What do they do?</span></div></div>",
            "created":1159333200,
            "id":349049,
            "title":"Jenna and Rachel Under the Microscope"
        },
        "12312112222":{
            "author_name":"hii'mcool",
            "choices":[
                "Venture into the carpet.",
                "Give up and stay in the hallway."
            ],
            "content":"<div class=\"\"><div> <span>\"Come on, let's go find the babysitter,\" Jenna said. \"She's our only chance right now with Mom gone.\"<br>\r\nRachel got to her feet and the two mosquito-sized girls started the very, very long walk to the living room, dodging dust bunnies, cracks, and clods of dirt along the way.<br>\r\nJenna sighed, \"You know, Rachel, I've been thinking. We're too tiny for anyone to notice us now. We would just look like little specks to them, if they see us at all.\"<br>\r\n\"That's the story of my life,\" she muttered. \"You're saying we're stuck like this forever?\"<br>\r\n\"I think we need to try something drastic,\" Jenna looked disturbed. \"We're way too small to climb on anything and get to a higher place so that someone might see us. That means we're stuck here on the floor. No one will ever see us while we're this size, unless they're three inches tall.\"<br>\r\nRachel's eyes went wide, \"You want to SHRINK someone? The babysitter? Sounds like it might be fun, but... can we actually do that?\"<br>\r\n\"I don't think we have any other choice. If we don't get help, our lifespans will look pretty similar to our height. Either we shrink her and take the chance that something MIGHT happen to her or that we won't find a way to unshrink her... or we die. But I'm still wondering if I can make myself do it.\"<br>\r\n\"Let's at least try to get her attention first. We can try that if we absolutely have to. Besides, we don't even know how to shrink her with the bracelet. We might just end up shrinking ourselves even smaller! Gosh, I HATE being this tiny!\" A tear slid down her cheek.<br>\r\nJenna gave her a warm smile, \"Oh, cheer up, you little midget, or I'll squish you!\"<br>\r\nThat got a small laugh out of Rachel. \"I'll try, Thumbelina.\"<br>\r\n\"Good,\" said Jenna, \"Being shrunk might not be so bad. I think I'd actually enjoy it if I didn't have to worry about fighting for my life. But I'd much rather be three inches tall than Bacteria Girl. It would be fun if I knew that I could get back to normal size anytime I wanted.\"<br>\r\nFinally, they came to the living room, where they saw Anna, the short fifteen-year-old blond girl next door, sitting on the couch reading.<br>\r\n\"Anna?\" said Jenna, \"I guess she's the babysitter. Let's go.\" <br>\r\nIt was only then that she noticed with a sinking feeling that she was walking from hardwood floor into the carpet. Each strand of the carpet was twice her height, turning the living room into a jungle.<br>\r\n\"This is bad,\" said Rachel. \"We might not be able to see any threats coming, like getting stepped on, if we can't see above the carpet. How can it be taller than us?!\"</span></div></div>",
            "created":1159333200,
            "id":349084,
            "title":"The Chances Look Small...Not to Mention the Girls"
        },
        "123121122221":{
            "author_name":"hii'mcool",
            "choices":[
                "Anna starts wiggling her toes.",
                "Her feet remain stationary."
            ],
            "content":"<div class=\"\"><div> <span>With determination far surpassing their size, the micro girls walked into the vast jungle of the carpet. It was such a strange, surreal feeling walking among the strands, like something out of a dream. Every so often, one of them would climb up to the top of a carpet strand to check their position and make sure they were going the right way.<br>\r\n\"Hey, Rachel!\" Jenna shrieked gleefully from the top of the layer of carpet, \"She's wearing sandals! This is wonderful!\"<br>\r\n\"Why is it wonderful?\" Rachel asked, puzzled and exhausted.<br>\r\n\"That means her skin is exposed! If she were wearing real shoes, she would never be able to feel us climbing on her foot. We could never get her attention. But now, when we get there we can both jump up and down on her foot and her skin will be much more sensitive.\"<br>\r\n\"I don't know,\" Rachel said, \"Will that work? Well, let's look on the bright side. The two of us together make one quarter-of-an-inch tall girl. She's more likely to feel our combined weight.\"<br>\r\nWhen the girls the mountain-sized foot, they were exhausted beyond belief.<br>\r\n\"It's almost over,\" Jenna wheezed encouragingly.<br>\r\n\"We have to climb THAT?\" Rachel said doubtfully, \"I can't believe I'm about to climb someone's bare toes!\"<br>\r\n\"Oh, at least she has nice feet,\" Jenna shrugged, \"I wish I had HER toes.\" She looked down at her feet.<br>\r\n\"That's true. At least her feet aren't smelly.\"<br>\r\nThey both climbed to the top of the carpet, and from there jumped onto her one of Anna's flip flops, right next to the pinky toe. It was the lowest part of the foot, but still twice as tall as them. Rachel gave Jenna a boost on her shoulders. Once on top, Jenna lay on her stomach and Rachel jumped to reach her hand so she could pull her up. It took some doing, but they made it. At this point, they walked toward the center of the foot to a safer area and flopped down for a second, catching their breath.</span></div></div>",
            "created":1159333200,
            "id":349087,
            "title":"Into the Tiny Jungle"
        },
        "1231211222211":{
            "author_name":"hii'mcool",
            "choices":[
                "Anna shrinks to three inches tall.",
                "Jenna and Rachel grow to three inches tall."
            ],
            "content":"<div class=\"\"><div> <span>Without warning, Anna started wiggling her toes absentmindedly. Rachel and Jenna shrieked as they were tossed around in the earthquake. They slid around the foot and tried to grab onto one of the middle toes. Jenna thought she was going to be sick as the toe thrust her up and down. She screamed as she lost her grip and ended up lying on the massive toenail. Unfortunately, the nail was very smooth and she slid off of it almost instantly and plunged into the depths between the crushing toes. Rachel joined her and the girls put their hands in the air as the giant toe came down, to stop it from crushing them. Amazingly, they were able to hold it in place. It seemed that their bodies were tougher at this size. They had to be. Like the way ants were able to lift things bigger than themselves. The toe had stopped for the moment, but both girls knew that their strength couldn't hold out much longer.<br>\r\n\"Now what?\" Rachel grunted under the strain.<br>\r\n\"We have to shrink her. It's our only choice! She'll kill us if we don't.\" Jenna shrieked.<br>\r\n\"Agreed. But we don't know how to use the bracelet! We can't just read it again, or it'll make us smaller.\"<br>\r\n\"We'll find a different way of reading it. If it does shrink us, we'll be smaller than a grain of sand. So tiny that we'll probably be safe. We have to take the chance.\"<br>\r\nRachel nodded, with fear in her eyes, \"Why don't we try reading the bracelet while we're not touching it. Have her touch it instead of us.\"<br>\r\nThey maneuvered the bracelet across the surface of Anna's flip flop with their tiny feet. They got it to where it was braced against the sole of Anna's foot, but not touching them. The two micro girls read the strange words on the bracelet aloud in unison. A blinding white light emanated from the bracelet. And then...</span></div></div>",
            "created":1159333200,
            "id":349090,
            "title":"Bigfoot Strikes Back"
        },
        "12312112222111":{
            "author_id":"carramrod",
            "author_name":"car ramrod",
            "choices":[
                "Anna shrinks to their size",
                "Jenna and Ranchel shrink even more"
            ],
            "content":"<div class=\"\"><div> <span>Anna looks around frightened and confused at what just happened to her. After the initial terror of being shrunk ot of nowhere set in, she became aware of her surroundings. She noticed her now very clothes all around her, and realized she was standing on her giant flip- flops. Then she heard some tiny squeaks,and noticed she wasn't the only one standing on her flip-flops. <br>\r\n<br>\r\n\"Help!!\" scream Jenna and Rachel, jumping up and down next to Anna's not quite as massive bare feet. Anna squats down for a closer look at the two tiny figures. \"Oh my gosh!! Jenna!! How did you and your friend get so small?? And how did I get so small?? Am I gonna get as small as you?\"Anna asks. <br>\r\n<br>\r\n\" I don't know exactly whats happening, but it has something to do with this bracelet,\" Jenna replied. \" Me and Rachel shrunk like you did and found this on my bed. We read the words on it, and thats how we shrunk more.\" <br>\r\n<br>\r\n\"Well then why did you shrink me?\"Anna questioned. <br>\r\n<br>\r\n\"Because, we tried to get your help, but we were too small to get your attention. And since we don't know how to grow, we had to shrink you or be crushed by your toes.\" Rachel replied.<br>\r\n<br>\r\n\"Oh sorry.\" Anna said. \" So that bracelet is how we got small? Is that the way we have to get bigger?\"<br>\r\n<br>\r\n\"We don't know,\" Jenna told her.\"But since it made us small, it must be able to reverse the process.\"<br>\r\n<br>\r\n\"So if reading the words shrinks, then what if we read the words backwards?\" Anna asked.<br>\r\n<br>\r\n\"You know what,that might work. \" Jenna said. \" Ok, we're gonna try and get up to your size.\" <br>\r\n<br>\r\nJenna and Rachel then grab the bracelet, and put their new paln into action with Anna watching very close by. Of course, the plan wasn't as rock solid as they thought... </span></div></div>",
            "created":1227330000,
            "id":610350,
            "title":"Anna shrinks to see them"
        },
        "123121122221112":{
            "choices":[
                "Jennas 12 year old sister comes in ",
                "Mom comes home "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With the now familier feeling they began to shrink to 1/32 of an inch<br>\n?Fucking hell? they both screamed.<br>\nAnna was now still huge but plucked them up when......</span></div></span></div>",
            "created":1227934800,
            "id":613185,
            "title":"Jenna and Ranchel shrink even more"
        },
        "12312112222112":{
            "choices":[
                "A sybling comes and finds them",
                "Mom's home"
            ],
            "content":"<div class=\"\"><div> <span>Once the blinding light faded the girls were surrounded by clothes.Jenna realized they grew back to three inches. The looked around for Ann and found her there size the Bracelet was attached to her leg and she could not get it off. She was confused by her surroundings but once Jenna explained she tried to figure out what to do next. They knew they could not say the enchantment again and risk crushing Anna and if Anna said it she would shrink. There best hope was to find someone. The three girls start there journey and start to look for someone. Just then...</span></div></div>",
            "created":1307077200,
            "id":1119491,
            "title":"Jenna and Rachel grow Anna Shrinks."
        },
        "1231212":{
            "choices":[
                "\"What happened to you two?\"",
                "\"It Worked!!!!!\""
            ],
            "content":"<div class=\"\"><div> <span>Jenna and Rachel walked to the now giant pillow on Jenna's bed and sit down.<br>\r\n<br>\r\n\"OK, now what?\" Rachel asked Jenna.<br>\r\n<br>\r\n\"I dunno,\" Jenna replied.  \"I could call someone, but they might get shrunk just like you.\"<br>\r\n<br>\r\n\"Yeah,\" Rachel said.  \"You know, someone has to be behind this.\"<br>\r\n<br>\r\n\"But who would want to shrink us?\" Jenna asked Rachel.  Just as she finished her question, the door opened.  Rachel and Jenna stumbled to their barefeet. \"Who is that?\"  Jenna asked nervously.  The figure walks through the door and discover that it is just Jenna's mom.  \"Oh, thank god!\" Jenna exclaimed. <br>\r\n<br>\r\nThe girls walked to the edge of the bed and started jumping up and down screaming in their tiny voices.  Jenna's mom is about to leave when she hears them.  She walks over to the shrunken teen girls and after she sees them she says...</span></div></div>",
            "created":1091595600,
            "id":210852,
            "title":"Jenna's mom"
        },
        "12312121":{
            "author_id":"sonicfan287",
            "author_name":"Bobby G.",
            "choices":[
                "Decided to get to the bottom of this",
                "Decided to make them a dollhouse"
            ],
            "content":"<div class=\"\"><div> <span>Jenna's mom kneels down and lets the 2 girls hop into her hand. They're still scared as they're afraid Jenna's mom could crush them on accident.<br>\r\n<br>\r\n\"What happened to you 2?\" Jenna's mom asked.<br>\r\n<br>\r\n\"We shrunk...\" Rachel sighed \"And now we dont know how to get bigger again...\"<br>\r\n<br>\r\nThen Jenna's mom...</span></div></div>",
            "created":1134190800,
            "id":289066,
            "title":"What happened?"
        },
        "123122":{
            "author_id":"pkcommado",
            "author_name":"Shrinking Maniac",
            "choices":[
                "Rachel was Jenna's size",
                "Rachel's believes Jenna's always been a doll"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, what are you doing here?\" Jenna's sister, Sarah, asked Rachel.<br>\r\n<br>\r\n\"I'm just, taking a nap,\" she lied. She wasn't sure if she should tell a five year old her sister's bug-sized. \"Sarah, why don't you and Lacy go play somewhere else.\"<br>\r\n<br>\r\n\"But we want to play right here,\" Lacy, Rachel's sister, replied.<br>\r\n<br>\r\n\"Yeah, our new dolly is here,\" Sarah calmly announced.<br>\r\n<br>\r\nRachel looked but saw no dolls, except.... \"What are you talking about.\"<br>\r\n<br>\r\n\"Jenna's our new dolly, silly. Now we want to play!\" <br>\r\n<br>\r\nAnd then their eyes started to glow and when it was over:</span></div></div>",
            "created":1089176400,
            "id":206490,
            "title":"Troublesome Little Sisters"
        },
        "1231222":{
            "author_id":"pkcommado",
            "author_name":"Shrinking Maniac",
            "choices":[
                "They play with their new dolls",
                "They give their new dolls away"
            ],
            "content":"<div class=\"\"><div> <span>\"What? What was I doing here at Sarah's house?\" Rachel asked. <br>\r\n<br>\r\n\"You brought me over to play with her,\" Lacy explained with a smile Rachel found terrifying.<br>\r\n<br>\r\n\"Oh, okay. Here, have your stupid doll.\" She flung the tiny object at her little sister and her sister's dumb friend and turned to leave<br>\r\n<br>\r\n\"No, Rachel, I'm your friend, Jenna,\" Jenna pleaded. She shrieked for all she was worth, but couldn't get her giant friend's attention.<br>\r\n<br>\r\n\"She can't hear you,\" Sarah gloated. \"She's not even noticing this. No one will ever remember you existed except me and Lacy. Your 'little' sister's a witch and only we can give your life back to you. To everyone else, you're a really real doll. Now this gets better.\"<br>\r\n<br>\r\n\"Rachel, play with us,\" Lacy pleaded.<br>\r\n<br>\r\n\"No way, squirts. If I ever played dolls with you, I'd have to be a doll.\"<br>\r\n<br>\r\n\"Fine!\" Lacy shouted and her eyes glowed.<br>\r\n<br>\r\nNow Rachel was a doll next to Jenna and her memories of ehr friend returned.<br>\r\n<br>\r\n\"I'm sorry, Jenna, now what?\"<br>\r\n<br>\r\n\"It's up to whatever our sisters want to do with us, or to us,\" she gulped.</span></div></div>",
            "created":1089176400,
            "id":206492,
            "title":"Rachel: First Oblivious and Now Helpless"
        },
        "12312222":{
            "choices":[
                "Little girl",
                "No one they escaped"
            ],
            "content":"<div class=\"\"><div> <span>The two little girls looked at their shrunken older sisters who they treated like dolls for all of two minutes and got bored with. They whispered to each other and then took the two tiny teens to Sarah's room. Sarah then grabbed two unopened doll boxes. Their eyes glowed again only to switch the dolls inside with the dolls in their hands. Both Jenna and Rachel squirmed as they were now tied down to the inside of a doll box. <br>\r\nSarah walked over to her mom,\"Mommy i already have these dollies can I get a new one?\" she said in a sweat tone of voice. Her mother agreed and took her to the toy store.<br>\r\n\"Jenna, you no longer need to eat and from now only you two can move when no one is around and are indestructible when people are,\" Jenna's little sister said with an evil laugh as she handed them over to the store clerk.<br>\r\nJenna tried to scream and move but could not since the clerk was right there. The clerk brought them out back to make sure nothing was wrong and put new price tags on the two boxes. Before wrapping them together and put them as mark downs. She tossed them in a bigger box before walking away. Rachel started to scream and so did Jenna.<br>\r\n\"How do we get out of here?\" Jenna said.<br>\r\n\"I don't know,\" Rachel said.<br>\r\nThe next day the two Boxes were put on a shelf with other dolls. People constantly walked by and the two girls were sold to a..</span></div></div>",
            "created":1306645200,
            "id":1115829,
            "title":"Givin Away"
        },
        "1232":{
            "choices":[
                "Explore discarded clothes on floor",
                "Take a nap until Rachel arrives"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah I have a sore throat\", she screamed into the phone, \"and I was wondering if you could bring me some soup after school because I just feel awful.\"<br>\r\n<br>\r\n\"No problem, I'll see you in 2 hours when school gets out, but can i use your shower because I have gym last and will need it badly, were running the mile, you're lucky you have a sore throat.\" Rachel replied.<br>\r\n<br>\r\nYeah I'm real lucky you think to yourself and scream \"okay I'll see you later then,Bye.\"<br>\r\n<br>\r\nWell you think to yourself I now have two hours to kill what am i gonna do now?</span></div></div>",
            "created":1091509200,
            "id":210797,
            "title":"Little White Lies"
        },
        "12321":{
            "choices":[
                "Someones entered your room",
                "You decide to escape the stench and explore more"
            ],
            "content":"<div class=\"\"><div> <span>You begin to climb down off the bed, but quickly realize that it would be faster to jump.  You see an old pair of your slippers on the floor and aim for them.  You hold your breath and leap for them closing your eyes about halfway down.  <br>\r\n                .     .     . <br>\r\nYou wake up on warm soft mattress.  It was all a dream you think as you take a deep breath of the warm air.  Wait a tick.  Why does the air smell like feet.  OH-NO.  I cant believe my own feet actually smell this bad.  Or sweat this much.  You look down to see the dark imprints your size 9 foot has ground into the sole.  Whew. Suddenly...  </span></div></div>",
            "created":1091682000,
            "id":210946,
            "title":"Revalations"
        },
        "123211":{
            "choices":[
                "she squashes you in the shoe",
                "she feels you squirming in the shoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>thats when you sister comes into your room to borrow your shoes.</span></div></span></div>",
            "created":1110603600,
            "id":239730,
            "title":"shoes"
        },
        "1232111":{
            "author_id":"eeiko",
            "author_name":"Eeiko",
            "content":"<div class=\"\"><div> <span>Jenna screamed for her life, but it seemed her sister didn't hear her. Jenna ran to the corner of the shoe as her sister's foot slipped in. She felt a brief impact and then nothing more. <br>\r\n<br>\r\n\"Hm?\" Jenna's sister took the shoe off and turned it up side down. \"Ew...a bug.\" She then put the shoe back on and left the room.<br>\r\n<br>\r\nGame over.</span></div></div>",
            "created":1315198800,
            "id":1181707,
            "title":"she squashes you in the shoe"
        },
        "123212":{
            "choices":[
                "Little sister",
                "Reachel"
            ],
            "content":"<div class=\"\"><div> <span>Jenna got out of the shoe before anyone came. She was still the same size and she looked at the time to see that three hours have passed and assumed Rachel left not seeing her friend. Jenna decided she could not wait any more and walked around her room. She was not sure if she was done there yet. Plus being at this size in her room might be fun. <br>\r\nShe wondered around the room looking at everything at a new height. She continued to walk around till a shadow was behind her. She ran away till she was picked up by the person it was...</span></div></div>",
            "created":1309669200,
            "id":1139567,
            "title":"Out of the shoe you go"
        },
        "12322":{
            "choices":[
                "she spots you and teases you",
                "she thinks you are a bug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you fall alseep on your bedroom floor only to awake to the sound of the ground shaking? thats when rachel enters your room wearing her white socks.</span></div></span></div>",
            "created":1110603600,
            "id":239728,
            "title":"rachel"
        },
        "123221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Rachel puts you between her toes in her sock",
                "Has you worship her bare feet",
                "Sticks you in her panties",
                "Make you perform her annoying nightly rituals for her",
                "She decides to finish you off in the most demeaning way imaginable"
            ],
            "content":"<div class=\"\"><div> <span>Rachel's eyes go wide with glee at recognizing you.<br>\r\n<br>\r\n\"Please! You have to help me!\" You doubt very much that she'd be able to hear you, but you had to try!<br>\r\n<br>\r\n\"NO FUCKING WAY I'M HELPING YOU! You realize all the stuff I can force you to do for me at that size?\" </span></div></div>",
            "created":1593211560,
            "id":2857274,
            "title":"she spots you and teases you"
        },
        "124":{
            "choices":[
                "\"But who shrunk you and what was this method that you used on me?\"",
                "\"Well, it's obvious there's nothing we can do about it. You'll j"
            ],
            "content":"<div class=\"\"><div> <span>Jenna wasn't sure what the next course of action would be, but after thinking for a second, she decided she was in no hurry to be unshrunk. She wanted to explore this exciting new giant world she had found herself in. She had always thought of herself as too tall anyway, and was excited to see what it was like to be Thumbelina. Still being a little tired, though, she smiled and decided and to go back to sleep. She awoke later to the sound of a small voice yelling in her ear. Turning her head to see where the voice was coming from, she froze in shock. Her first thought was that she had gone back to normal size, but when she looked around, her room was still gigantic. She was still tiny. Her mouth hung open. She wasn't big again, there really WAS a girl even tinier than her standing there on the pillow, trying to get her attention. <br>\r\nShe gasped, \"Who are you? How did you get here? And...so...small...?\"<br>\r\nThe incredibly tiny girl was not much bigger than Jenna's thumb. She was very pretty, with light brown hair, and was dressed similarly to Jenna: barefoot, wearing a halter top and shorts. From her clothing, it looked like she had been shrunk in her sleep too.<br>\r\n\"I'm so sorry,\" she said, \"but I was desperate. I had to shrink you, because I'm much too small for anyone of normal size to notice me. I have to get unshrunk and the only way to do that was by making you tiny enough to see me.\"<br>\r\nJenna sat up and yawned, \"Oh, don't worry about it. I like being tiny. I'm excited to try it out! But how did you get so small?\"<br>\r\nThe girl seemed intimidated and shyly looked down at her bare feet, \"I was shrunk in my sleep just like you were. I can't make myself bigger, but I found the method that was used to shrink me. I tried it on myself, hoping it would make me big again. But instead it just made me even smaller. I used it to shrink you too.\"<br>\r\nJenna looked at the near-microscopic girl and said,</span></div></div>",
            "created":1159246800,
            "id":348879,
            "title":"A Tiny Visitor"
        }
    },
    "info":{
        "author_id":"tyrakk",
        "author_name":"tyrak",
        "brief_description":"A teenage girl is shrunken and must struggle to stay alive!",
        "created":1085102340,
        "description":"<td align=\"left\" class=\"norm\">Your basic shrinking story.<br>\r\n<br>\r\nA few rules:<br>\r\n<br>\r\n1. No sex or rape or etc.<br>\r\n2. This is an adventure story, so try to keep it so she has to struggle or such.<br>\r\n3. Try to keep it so nobody notices her.<br>\r\n<br>\r\nAlso, please try to spell check, and take the time to use correct puncuation. And please don't use all-caps or no-caps.</td>",
        "id":850911,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593211560,
        "modified":1593211560,
        "pretty_title":"Shrunk"
    }
}