{
    "chapters":{
        "1":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Male",
                "Female",
                "Hermaphrodite"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now to start the story... Are you Male, Female, Or a Hermaphrodite?</span></div></span></div>",
            "created":1264395600,
            "id":825660,
            "title":"Time to start the Growing!"
        },
        "11":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Be Joe Cruise",
                "Be Alex Hunter",
                "More Choices!"
            ],
            "content":"<div class=\"\"><div> <span>All right since we're gonna start as a guy here's a few choices...<br>\r\n<br>\r\nMeet Joe Cruise...<br>\r\n<br>\r\nJoe is a 22 year-old biologist, who mainly works with genetics and DNA alteration. He's currently trying to successfully bond human DNA with animal DNA. He's also got other side projects that he's been working but the DNA alteration experiment is his main one. He's roughly around 6 feet tall with short brown hair and blue eye's. He's usually seen wearing a long white coat that's buttoned up, he normally wears a light blue shirt. He's a slightly good-looking person but tends to stay by himself.<br>\r\n<br>\r\nMeet Alex Hunter...<br>\r\n<br>\r\nAlex Hunter is a 18 year-old student, he mainly goes to school and has good grades, he isn't majoring in anything in particular but loves ancient history and dreams to be an explorer. He is currently on a school trip to some ruins in South America who knows what he'll find there? He's 5'4 with black hair, black eye's, and with a slightly tan complexion due to his Puerto Rican hertiage.<br>\r\n<br>\r\nThat's all for now!</span></div></div>",
            "created":1264482000,
            "id":826212,
            "title":"Starting out as a guy..."
        },
        "111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Joe falls asleep where he has a strange dream...",
                "Joe suddenly get's a burst of inspiration and begins combining various chemicals"
            ],
            "content":"<div class=\"\"><div> <span>Joe Cruise was in his lab holding a glass beaker, the beaker held a green liquid he stared at it then he set it on a beaker holder. He then headed to the computer and typed a few commands a screen appeared and a picture of a man and a horse appeared. He typed in a few more commands and watched as the two pictures merged... then the words 'Fail' appeared. He sighed and slammed a hand on the desk. \"I'm so close! What's wrong!?\" Joe snarled. He had been trying all different methods to successfully bond human DNA with animal DNA. The reason for this was simple, when he was younger he was fascinated by the idea of anthro or furry creatures. He had been secretly using goverment funding to advance his project in return on the outside he developed bio-weapons. He sighed and went to his chair and sat down, he looked at the various vials and turned his head up to the ceiling. He was so tired he just wanted to sleep...</span></div></div>",
            "created":1264482000,
            "id":826283,
            "title":"Be Joe Cruise"
        },
        "1111":{
            "author_id":"tntdmd",
            "author_name":"TnTdmd",
            "choices":[
                "Fuck it use the serum on your self if you  become a sex crazed giant horse ",
                "try to \"fix\" the serum",
                "test it on someone else"
            ],
            "content":"<div class=\"\"><div> <span>When Joe was asleep he saw a beautiful anthro horse with a dick as big as a skyscraper hell he was a skyscraper with hooves as big enough to wipe out small buildings and balls that would make a mountain jealous but you notice something to hose has moved in a awhile that because the horse has being jacking off his erect cock hanging out at full mast or what you think in full mast after 10 min pre starts flowing from his cock on ground killing 10 - 20 people and destroying over 20 cars ruining 5 houses and then the horse started to move killing more people and crushing more houses.The horse kept moving in till he hot to a skyscraper witch was a little bit bigger then him but the the horse grab the skyscraper and started to to fuck it. and the you wake up and realized the horse was You!!!<br>\r\n<br>\r\nThis couldn't be you wouldn't kill people and fuck a skyscraper unless your serum took over your mind. But you dick was hard at the thought of fucking a skyscraper so maybe you should become that horse no you would you would fix the promlbe</span></div></div>",
            "created":1476825720,
            "id":2225108,
            "title":"Joe falls asleep where he has a strange dream..."
        },
        "1112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Joe tests it on himself after all he developed it!",
                "Joe tests it on someone else!"
            ],
            "content":"<div class=\"\"><div> <span>Joe was about to close his eyes when a sudden thought came to him, he couldn't believe that he hadn't thought of that! He went to the desk full of various vials and beakers. He began to pour various chemicals together he, then activated the flame and watched the chemicals begin to boil. He watched as it changed colors becoming gold. He then grabbed it shook it slightly then he set it next to the computer and activated the computer and inputted the resulting mixture into the computer. He watched as the two pictures came together then he saw the words 'Success' his eye's widened he had successfully found a way to bond animal DNA with human DNA! He stared at the mixture... he had to test it! But where and on who?</span></div></div>",
            "created":1264568400,
            "id":826657,
            "title":"Inspiration!"
        },
        "11121":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "The change is immeadiate!",
                "Nothing Happens"
            ],
            "content":"<div class=\"\"><div> <span>Joe stared at the vial filled with golden liquid he was responsible for this development now he had to test it... what better subject than himself? He grabbed the vial and hurried off to find a dropper. He found one and stuck it in the vial of golden liquid and sucked it into the dropper he then pulled it out and held it staring at the golden liquid in the dropper he then raised it to his lips and swallowed the liquid. He then set down the vial and waited.</span></div></div>",
            "created":1264654800,
            "id":827022,
            "title":"Testing on oneself!"
        },
        "111211":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Joe awakes to find himself a anthro-horse!",
                "Joe awakes to find himself a anthro-mare!"
            ],
            "content":"<div class=\"\"><div> <span>Joe waited silent expectant, he then felt his body tempature begin to rise. He fanned himself however when the heat grew he grabbed his coat and pulled it off. The heat however continued to grow and he felt an uncomfortable itch on his skin. He pulled off his shirt revealing his slightly muscular torso, and threw that to the side. His body grew even hotter and his skin grew even itchier he began to stratch his skin and as he did his fingers began to swell up growing like sausuges! Joe however didn't see this as he was busy scratching his hot irritating skin! He then reached with his other hand and began scratching as he did bit's of skin fell off revealing fur underneath. As he continued to scratch he felt the fur and he stopped and he looked at his shoulder. Dark brown fur was growing where skin had fallen off and he then felt his face begin to stretch forward elongating. He gasped and grabbed his face and slid his fingers down his face his skin peeling off as it did fur appearing where his lost skin fell. He then bent forward as he felt his spine begin to bulge and begin to lengthen as well. Joe's whole body was changing his feet were bulging and soon they ripped out of his shoes and he gave a shout and fell back. He looked as his body grew and hardened becoming more muscular. He then looked as his feet merged and began developing a shiny hardness on the bottom. His feet were becoming hooves! He tried to stand up but he hit his head on a table and he blacked out...</span></div></div>",
            "created":1264654800,
            "id":827095,
            "title":"The change is immeadiate!"
        },
        "1112111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Decides to test his new body in various ways!",
                "Decides to test the mixture on someone else!"
            ],
            "content":"<div class=\"\"><div> <span>Joe awoke to pain on his head, and he raised a hand to rub the sore spot as he did he felt a strangely large amount of hair that ran down he froze then he looked down. He saw his muscular torso along with muscular legs and a large brown dick that hung limply on the ground. He grabbed the dick and raised it to see a large pair of testacles each the size of a grapefruit in a brown sack. He then looked at his feet and saw the large black hooves and he looked at his arms to see the bulging biceps. He stared at this then he stood up but wobbled slightly as he did due to his new balance and his hooves. When he got the hang of his new form he headed for the bathroom and looked in the mirror, he saw a brown furred anthro-horse with a white stripe on the center and white nose. He gave a snort and he looked down at his new body he then...</span></div></div>",
            "created":1264654800,
            "id":827104,
            "title":"Joe awakes to find himself a anthro-horse!"
        },
        "11121111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Joe cums for a whole minute!",
                "Joe cums for 5 minutes!"
            ],
            "content":"<div class=\"\"><div> <span>He decided to... test... his new body he started with the simplest of tests the test of flexing where he flexed and showed off his muscular body. His bicep was big, bigger than before he flexed his legs admiring the bulging legs he was sure that if her kicked someone they wouldn't be able to stand up again. Then his attention went south. He had a sheathe but his horse dick was protruding as if he was still human, it was flaccid but huge had to be to be as thick as a soda can but it was 9 inches flaccid but if he knew the horse anatomy well this dick would expand to nearly 3 times it's size. He looked at the slightly mushroom like head and he wrapped a large strong hand around the fleshy organ. It was surprisingly soft however it twitched and he began to stroke it gently and it began to extend and thicken, he slowly began to pump the length encouraging it to grow bigger and bigger and it did. His hand soon became a blur as his dick engorged itself to full and considerable size 25 inches long and as thick as a tree trunk the mushroom head swelling spreading outward. He also felt his balls swell as if temporarily going into mass production mode. Joe grunted then he gave thrust of his hips as he ejaculated...</span></div></div>",
            "created":1277269200,
            "id":905280,
            "title":"Testing is always good!"
        },
        "111211111":{
            "author_id":"george41",
            "author_name":"george41",
            "choices":[
                "Joe is able to test in peace and quiet.",
                "Someone cums as Joe is finishing cleaning, still with a semi-hard horse cock!"
            ],
            "content":"<div class=\"\"><div> <span>Joe creamed out as he reached his massive orgasm. He felt a massive pressure build up in his balls as it was about to begin. Then he felt his horse cock swell up even thicker as he was about to cum. He then feels the cum race up his cock and out of the head of his cock.<br>\r\n<br>\r\nThe first shot lasted for about 10 seconds, and hit the ceiling and spattered everywhere. The second shot was by far the biggest and longest at over 15 seconds, and almost completely covered him self with it.  The 3rd through 9th shots all lasted about 8 seconds each and went all over his desk and lab. After that, his shots got less powerful, but stayed at a constant time of just over 5 seconds each until his 13th spurt. After that, it just became a drizzle that lasted for about 30 seconds with a rythmic flow of power until it stopped.<br>\r\n<br>\r\nThen end result of all of Joe's cumming was a lab around him that was competely covered in a super thick layer of potient cum. His massive long of a cock softened to a semi-hard state of about 18 inches that hung down to his knee, while laying on top off two massive spheres that where his testicles. After taking a few minutes to bask in the after-glow of his eruption of an orgasm, Joe started to think while his entire body was covered in a thick coating of hot, thick, white, cum. He started to thick about what to do next, that is after he cleans up the flood that occured in his lab. He thought what to do next, test his cum? What would the DNA be, human or horse, or even both? Would it be compatable with Humans, horses, or both? How fertile is his cum compared to before? Is it possible to make an 'antidote' to this form so he could go out in public? If so, would it be possible to only select what to transform? Such as only having the cock and balls to transform? And, is there a way to make money off of this by selling ways to make humans cocks, balls, and orgasms bigger?<br>\r\n<br>\r\nAfter thinking for a few minutes, Joe decides to start cleaning up his now white lab. While doing so, he notices something off. It allears as if his testicles have aftually gotten bigger! He thinks a couple of things from this. One, they are bigger because he is still horny. Two, they are bigger because he didn't finish growing. And three, they are just filled with cum and need to be empytied. Well, he continues on with cleaning. <br>\r\n<br>\r\nSo what happens next. Does Joe finish cleaning up and continue testing, or does someone cum in while he is still nude and semi-hard?</span></div></div>",
            "created":1397538000,
            "id":1779569,
            "title":"Joe cums for more than a minute!"
        },
        "1112111111":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Leave your work and get some relief ",
                "Ignore the pain and push on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As he works his balls start to ache as there over hall hasn't stopped. After about an hour he's about to make his next break through but his balls are starting to become almost mega blue balls.</span></div></span></div>",
            "created":1471755600,
            "id":2198954,
            "title":"Joe is able to test in peace and quiet."
        },
        "11121111112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "It turns him back but his cock and balls are the same but are not overfilling",
                "It doesn't turn him back but his balls stop producing sperm"
            ],
            "content":"<div class=\"\"><div> <span>Joe's body began to sweat as he felt his balls keep swelling bigger and bigger, however he worked ferviously on a cure for his condition. His mind focused on the task as he analyzed, broke down and rearranged genetic information inside of one formula. He could feel his balls distending down the sac stretched by the sheer weight. Even as sweat poured down his horse face and muzzle he kept working, <i>'Just a bit more... and...'</i> he activated the program. His machine whirred as it began creating the formula to the exact specifications he had put in. <i>'I just hope it'll work'</i> he prayed  he watched as his big horsey balls now touched the floor the cool flooring making his mind spike with arousal, he could also swear they were starting to change color. He could only hold on as his machine finished his new formula and deposited it where the first mixture. With that done he reached for the formula and drunk it down.</span></div></div>",
            "created":1471842000,
            "id":2199446,
            "title":"Creating a Cure"
        },
        "111211111122":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Just rub yourself off and find a way to clean later ",
                "Resist the urge and find a better way"
            ],
            "content":"<div class=\"\"><div> <span>In a feeling af joy and disappointed his balls stopped getting bigger but he was still an anthro horse the only problem now was his balls he could barely stand with them so full he had to empty them some how but he didn't want to make his lab an even bigger mess so he started to ponder his options but as he thought he started to rub himself due to his incredible arousal and how hard he was he could swear his dick was like steel and was starting to hurt with all the pressure built up in it and it's starting to look red and a little bigger with all the veins popping out</span></div></div>",
            "created":1471928400,
            "id":2200532,
            "title":"It doesn't turn him back but his balls stop..."
        },
        "1112111111221":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "He empties out some more cum just to be safe.",
                "He's small enough now to take some sperm for the sperm donation clinc"
            ],
            "content":"<div class=\"\"><div> <span>Joe decided to just let it out he could clean it later, plus he had an idea or rather an opportunity. Now he could test the potency of his cum, he turned away from his computer wincing as his balls dragged across the ground. He grabbed his shaft but despite it's steel hard erection a simple touch made him shudder and his cock erupted shooting cum out the huge head flaring as he unloaded a torrent of cum it was so thick and strong it looked like he was shooting out a hose of cum. Jizz sprayed out hitting the ceiling then crashing to the ground splashing and plopping onto the ground. Sperm just kept shooting out till after a few seconds it trickled down to a few weak spurts. He sighed and moved his legs only to find they were quite warm. He looked down and was surprised to see his hooves were covered with sperm that was at least 3 inches high. \"Holy crap I make alot.\" he then looked down at his balls and saw they had shrunken down and were no longer touching the ground...</span></div></div>",
            "created":1471928400,
            "id":2200588,
            "title":"Letting it all out"
        },
        "11121111112211":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Go to the sperm clinic on the second floor of the building ",
                "Start to test with his cum and find out what information he can get out of it"
            ],
            "content":"<div class=\"\"><div> <span>Joe got up to collect some sperm for testing at the sperm clinic on the second floor of the building but gets a great surprise of his cock still as hard as steal but not as swollen and most of his veins on it poping out. After a thinking for a sec he starts to rub his staff again just to calming it down and empty his balls a bit more seeing how there still pritty big. As he rubs more and more pre cum starts to leak out like a water faucet. As he gets closer he feels his cock get harder as all the veins start to pop out making giving his dick a new texture in his hand. After a few more minutes of rubbing his balls release there stored seed and another flood of cum sprays out over his lab. After laying back in his chair in an after glow of pleasure he gets up and grabs a few beakers of his cum and starts to at least clean all his equipment and store the beakers for later. After an hour of cleaning he looks at the floor which now is about five inches of cum. So after trying to find a way to drain this he remembers the industrial drain he had installed just incase the building flooded. After a few minutes of waiding in cum he opens the drain but it's going to take a few hours to drain most of the cum , so in the meantime joe decides to</span></div></div>",
            "created":1471928400,
            "id":2200612,
            "title":"He empties out some more cum just to be safe."
        },
        "111211111122111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "No one was inside, just drop off the sperm and head back to make an antidote",
                "In there was a woman, Joe remembers they were getting a part timer to help"
            ],
            "content":"<div class=\"\"><div> <span>Scooping up as much cum as possible he walked to where a set of hazard suits were. While he realized that it would be slightly tight it should be enough for him to wear till he found a way to turn back to normal. He opened the door kicking off the cum from his feet and went down the hall. He was fortunate that most of the staff were gone by this time but there were a few who worked the late hours like he did. He saw the staricase and turned into it counting his luck for not running into anyone.<br>\r\n<br>\r\nHe got to the second floor and into the hall again in front on the left wall was the sign saying, \"Sperm Donation Clinic,\" he paused and looked through the door window. He saw...</span></div></div>",
            "created":1472014800,
            "id":2201100,
            "title":"Donating super sperm"
        },
        "1112111111221111":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Cover up as much as possible and rush back to the lab",
                "Get up and jack off in the bathtub and hope he can empty his balls "
            ],
            "content":"<div class=\"\"><div> <span>Thankfully no one was there so joe just puts the jar in the drop off fridge with a note on what he wants the clinic to do with it and heads back to his lab. Once in his lab joe pulls the mask off, \"God that uncomfortable.\" he states due to his muzzle not exactly fitting in a mask for human faces. <br>\r\n<br>\r\nAfter an hour he still can't find a way to temporarily change his condition or at least hide his new look but he has managed to find some more DNA matches to test but he'll save all that for later. After another hour he is getting closer but it's too late to continue unless he pulls an all nighter at the lab but he needs sleep to continue, so he gets the hazmat suit and heads to his car and drives home and heads to bed hoping the clinic can give him information in the morning. <br>\r\n<br>\r\nThe next morning joe get up but realizes his balls have filled up again and he starts to panic thinking on what to do.</span></div></div>",
            "created":1472014800,
            "id":2201114,
            "title":"No one was inside, just drop off the sperm and ..."
        },
        "11121111112211112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Joe's efforts are halted by a strong desire to impregnate someone",
                "Joe is able to work on his cure he thinks it'll work question is will it?"
            ],
            "content":"<div class=\"\"><div> <span>Joe got out of his bed, a slight challenge due to his hooves, and went to his bathroom he grabbed his limp cock and began pumping it hard. The cock rose due to the stimulation the head flaring. After a minute of hard pumping his balls swelled rising and then clenched and he gritted his teeth as his cock began spraying out hot potent baby seed. He had to admit he was impressed with the continual firehouse like spray even if it did chip the tiles from the sheer force. His balls shrank as they emptied out their heavy, heavy load. His cock pumped for a whole minute and when it was finished he jerked off one more time to get out the entirety of his cum out. But as he looked at his tub he could see he had filled it just a bit over the top. He decided it was enough for now. He left his dick softening as he went and grabbed the hazard suit and went to his car. It was morning now so other workers would be there he was thankful his lab was more or less restricted to his person due to his isolationist behavior.<br>\r\n<br>\r\nHe parked in the parking lot and got out he could see some workers standing near the front door talking, he walked past them as they stared at him briefly. He could hear one say, \"Hmmm isn't that...? What's his name is in that room by himself all the time?\" the other person gave 'I dunno' and they let it drop. He gave a sigh of relief and went inside of his lab to continue working on the cure...</span></div></div>",
            "created":1472014800,
            "id":2201184,
            "title":"Letting it all out Take 2"
        },
        "111211111122111122":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "They get vary close to the cure but the labs power shuts down and locks the room",
                "Your assistant is skeptical about everything and drinks the new concoction "
            ],
            "content":"<div class=\"\"><div> <span>Joe gets to work as soon as possible and ignores just about everything else but is coming close to his break through until his computer lights up with a notification from the clinic. In a rush he opens the document and starts to find out his speem has dna from his human and anthro form but is an unstable cell so it could not be confirmed if it is fertile and could impregnat a something but that didn't matter he now had to write a response to the clinic about how he got the sperm without giving away his secret.<br>\r\n<br>\r\nAfter writing a letter about some things about testing sperm cells of humans and horses in some mutagens he hoped it was enough to convince the clinic. After that he was about to get back to work but his lab door opens and he instantly turns his head and remembered that today was when his special intern/ lab assistant came in. At first she is terrified about what happened to him  but he manages to barely convince her it's ok and to help fix himself. Hopping to have her come up with an idea on how to fix this he shows her the proses on how he made his dna concoction but uses cow dna this time since he's running low on horse dna samples. After making another beaker he sets it aside so they can get to work on finding a cure.</span></div></div>",
            "created":1472101200,
            "id":2201205,
            "title":"Joe is able to work on his cure he thinks it"
        },
        "1112111111221111222":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Abigail turns into a cow anthro complete with 2 giant milky breasts",
                "Abigail's breasts grow to enormous size but she doesn't turn into a cow anthro"
            ],
            "content":"<div class=\"\"><div> <span>Joe's assistant, was a young woman named Abigail who stood 5'4'', with a B-cup bust, 15 inch buttt, and slight hips, she had her long brown hair tied into a ponytail. She rolled her eyes at his story, \"Joe you sure you're alright? How could your formula do this? It's just not possible, come on take off that costume.\" and she reached for his horse head and grabbing the muzzle she pulled. But it didn't come off, not that it would after all it was all natural. \"Not bad...\" She said as she stopped pulling.<br>\r\n<br>\r\nJoe gave a long sigh, \"Look this is not a joke help me figure out a cure to this mess please? And don't drink that it's another formula but since I didn't have anymore horse DNA I had to use some cow.\" he said and he went back to his computer and began typing away.<br>\r\n<br>\r\nAbigail looked at the formula he had just made. \"And what if I drink this I'll become some kind of half cow half human thing like you?\" she said, \"Sure... right.\" she said.<br>\r\n<br>\r\nThe horse anthro sighed again and turned to her ready to show his transformation only for his eyes to widen as she took a gulp of the formula. \"NO!\" he shouted but she was already setting it down.<br>\r\n<br>\r\nShe stared at him, \"See nothing's happ... what the-?\" she clutched her stomach and doubled over in pain. \"What the... what's happening to me!?\" she groaned even as she felt an intense heat in her breasts...</span></div></div>",
            "created":1472101200,
            "id":2201506,
            "title":"Some people just don't listen"
        },
        "11121111112211112221":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "In frustration joe ignores Abigail and work on a way to stop her breasts lacking",
                "He decides to test the milk and how she is lacking"
            ],
            "content":"<div class=\"\"><div> <span>Joe watches in a mix of shock and annoyance as she starts to change just like him. Her skin thickens as fur starts to grow her face elongates forming a snout of a cow, her hips widen a little as her ass reaches 20\" but what can Catches him the most is her breasts which are growing at an alarming rate as they start to reach the size of basketballs she passes out on the ground. <br>\r\n<br>\r\n30 minutes later Abigail wakes up with joe over her looking concerned. What happened joe? She asks him and gets up but feels a great weight on her chest, she proceeds to look down and almost passed out again in shock. What the hell did you do to me! She starts to get a joe until he explains to her what she drank and it was her stupidity that got her here. Once joes done explaining he starts to run some tests to see how the concoction has affected her and besides her bigger ass , hips and um beach balls she's just a normal anthro. Until here breasts start to leak milk not much but a sizable stream.</span></div></div>",
            "created":1472101200,
            "id":2201548,
            "title":"Abigail turns into a cow anthro complete with 2..."
        },
        "111211111122111122211":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Joe gets Abigail something but another problem comes when his hazmat suit rips",
                "Abigail starts to bombard joe with questions interrupting his work "
            ],
            "content":"<div class=\"\"><div> <span>As joe looks at her physical changes he then notices she's lactating, he then heaves a big sigh and moves to his computer and gets to work on something similar that he used on his balls but for Abigail. Abigail just sits there in amazement on her changes not paying attention to her leaking breasts or that there getting bigger as each minute goes on.</span></div></div>",
            "created":1472360400,
            "id":2202912,
            "title":"In frustration joe ignores Abigail and work on ..."
        },
        "1112111111221111222111":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Joe gets Abigail to work but his cock gets in his way to much as it grows ",
                "Abigail wraps her breasts around his slightly growing cock"
            ],
            "content":"<div class=\"\"><div> <span>About 30 minutes later joe makes something Abigail and hands it to her. <br>\r\n<br>\r\nHere drink this.<br>\r\n<br>\r\nAbigail takes it and drinks. What was that it tastes awful <br>\r\n<br>\r\nSomething for you breasts it should help with the lactating. Joe starts to get back to work until his hazmat suit rips and his again massive balls drop out.<br>\r\n<br>\r\nWhat was that joe your ok.<br>\r\n<br>\r\nUmm yah just keep looking through the samples I send you. Joe try's to ignore the growing feeling and get to work. About an hour later his balls are starting to feel tight and are about a foot from the ground and yet he keeps ignoring it in hopes he can work faster. Another hour passes and his balls are on the ground and bigger then basketballs, trying to find a way to hid them Abigail walks over.<br>\r\n<br>\r\nWhat happened to your balls there huge!<br>\r\n<br>\r\nUm it's a slight side effect of my new body. Joes member started to get hard and he try's to hide it.<br>\r\n<br>\r\nYou seem pent up do you need help joe. <br>\r\n<br>\r\nNo I just need to get back to work. At this point joes cock it's growing from the pressure as all the veins are popping out giving his cock an interesting look.</span></div></div>",
            "created":1472878800,
            "id":2205654,
            "title":"Joe gets Abigail something but another problem ..."
        },
        "11121111112211112221111":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Keep ignoring the pain and keep working ",
                "Find a way to jack of without Abigail knowing"
            ],
            "content":"<div class=\"\"><div> <span>What was that joe?<br>\r\n<br>\r\nOh nothing just get back to work.<br>\r\n<br>\r\nJoe gets Abigail distracted so the could work more but joes arousal has his balls on the ground within an hour and his cock has started to grow eventually reaching eye level and becoming painfully erect.</span></div></div>",
            "created":1473570000,
            "id":2209092,
            "title":"Joe gets Abigail to work but his cock gets in h..."
        },
        "112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Diana agrees to search the deeper parts of the temple",
                "Diana refuses to go to the deeper parts of the temple",
                "Before she can say anything someone else comes along!"
            ],
            "content":"<div class=\"\"><div> <span>Alex Hunter sat near the back of the bus looking out the window at the blue sky dotted with white puffy clouds. \"Hey! Alex look it's the temple.\" Alex looked at his friend Diana, then he turned his gaze to where her finger was pointing at. Indeed there was the temple, large imposing, and crumbling it was still a sight to behold. From what he read this temple was used to pray to a certain god but other than that most of it's history was shrouded in mystery. He was hopeful that he would solve the mystery of this place. Alex had been studying all forms of ancient language so he was well versed in all of them. He watched as they got closer and closer to the temple. The temple wasn't as big as a normal aztecian temple but the answer to that might be inside.<br>\r\n<br>\r\n--A few minutes later--<br>\r\n<br>\r\nAlex grabbed his backpack from the bus' cargo compartment and slung on the 25 pound backpack onto his shoudlers. Next to him Diana was doing the same though her backpack was lighter than his. The teacher, a Mr. Wormwood, told them to gather round, then he explained that they were to remain in pairs. He also told them not to explore the deeper parts of the temple as the archeologists were still excavating that part of the temple. He also told them to be wary of spiders as they might be poisonous. With that he let them go, Alex looked at Diana, \"Well then shall we go?\" He asked, Diana smiled and she nodded. They both entered the temple behind everybody else.<br>\r\n<br>\r\nAlex was overjoyed to explore even a little bit of the temple for he was able to decipher most of the messages with ease. He had so far gathered that like all other temples this was for a god, however interestingly enough a goddess as well. What kind of god and goddess they worshiped he had no clue since the text mentioning that was a huge hole in the wall... Alex however had to know, and the only way he would find was by going deeper into the temple. He looked at his friend, \"Hey Diana wanna come with me to explore the deeper parts of the temple?\" Diana looked shocked.<br>\r\n<br>\r\n\"What!? Why?\" She asked hurridly.<br>\r\n<br>\r\n\"See I'm trying to figure out what kind of deity these people worshiped but in order for me to do that I need to get into the deeper parts of the temple. Come on we'll be in and out so quick nobody's gonna notice.\" Alex said. Diana hesistated...</span></div></div>",
            "created":1271739600,
            "id":870768,
            "title":"Field trip!"
        },
        "1121":{
            "author_id":"7stranger",
            "author_name":"Pseudonym",
            "choices":[
                "The temple relinquary",
                "Another room",
                "A surprise"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine\" groaned Diana, following behind Alex and grabbing her own torch \"You know we're not supposed to though, right?\"<br>\r\n<br>\r\n\"Yeah\" replied Alex \"But look, this is a once-in-a-lifetime adventure. Besides, these inscriptions are absolutely fascinating.\"<br>\r\n<br>\r\n\"Yeah but... aren't you a bit scared? I mean we're the first people to go these ways for many centuries and, I'm sure you know, the priests used to go to extreme lengths to protect the temple secrets.\"<br>\r\n<br>\r\n\"Oh come on\" said Alex \"What's the worst that could hap... ARGH!\"<br>\r\n<br>\r\nIn that moment the floor around Alex's feet caved in, revealing a large pit trap underneath them that seemed to extend infinitely downwards. Alex tried to scramble back to safety but it was too late, as he found himself falling ... before suddenly something roughly caught his arm.<br>\r\n<br>\r\n\"You ok?\" yelled Diana, holding on to Alex by one arm.<br>\r\n\"Yeah\" called Alex, his heart pounding. With his other hand he held on to the ledge, and with some effort, pulled himself up to safety.<br>\r\n<br>\r\n\"That was ... kinda cool\" said Alex, lying on the ground exhausted.<br>\r\n\"Whatever\" replied Diana \"You almost got both of us killed. I think we should turn back.\"<br>\r\n<br>\r\nThen, suddenly, both of them saw and heard a large rock rolling towards them - and it was coming from the direction of the exit!<br>\r\n<br>\r\n\"I don't think going back will be an option!\" yelled Alex, leaping to his feet in spite of his tiredness.<br>\r\nDiana looked around \"We'll have to jump across that chasm left by the pit trap!\" she called out.<br>\r\n<br>\r\nMoving quickly, Diana went back to give herself a running start. Then, with a big leap, she cleared the distance of the pit and landed on the other side, although she nearly fell over as she did.<br>\r\n<br>\r\n\"I'll never make it!\" yelled Alex.<br>\r\n\"Just try!\" called Diana desperately, seeing the giant round rock roll up behind him.<br>\r\n<br>\r\nWith all his strength, Alex ran and jumped across the pit, clearing the distance by a hair. On the other side, Alex's feet landed a little over the ledge, and he almost lost his balance, but Diana pulled him to safety just in time. The huge rock lodged itself in the hole, blocking their escape.<br>\r\n<br>\r\n\"We're trapped!\" yelled Diana desperately.<br>\r\n\"Only one way to go\" said Alex, pointing his torch in the direction of the deeper parts of the temple.<br>\r\n<br>\r\n\"Hey wait a moment\" said Diana \"It says something here on the wall about the four elements. Can you make it out?\"<br>\r\nAlex peered at the ancient script by the light of his torch \"Yeah - it says the two gods to whom this temple is dedicated overcame trials of earth, air, fire and water... very interesting.\"<br>\r\n\"The priests would have used that when designing their traps\" guessed Diana \"See, there we overcame rocks and chasms and such - that must be the trial by earth. Which means...\"<br>\r\n\"One down, three to go\" said Alex \"Then we'll see what secrets this temple holds.\"<br>\r\n\"I feel like I'm co-starring in a tomb raider movie\" said Diana, going off.<br>\r\n\"You've got to admit it's pretty cool, right?\" teased Alex, following her.<br>\r\nDiana rolled her eyes \"Alright fine, just remember I saved your life twice back there.\"<br>\r\n<br>\r\nJust then, a dart narrowly missed Diana and lodged itself in the wall on the other side of the corridor.<br>\r\n\"Look, a dart trap!\" said Diana excitedly \"This must be the trial by air, since arrows fly through the sky!\"<br>\r\nAlex looked at the Dark a little more closely. \"Looks like the dart is coated in some sort of liquid\" he said \"I think it might be a kind of poison.\"<br>\r\n\"Alright\" said Diana \"I guess we'll have to be careful... you check that wall and the floor for dart holes, I'll check this wall and the roof.\"<br>\r\n<br>\r\nWorking very slowly, Alex and Diana slowly advanced forward through the trap-riddled corridor, setting off dart traps just ahead of them as they went. After an excruciatingly long period, they finally passed the area where the dart traps seemed to be.<br>\r\n<br>\r\n\"So that's air and earth covered\" said Diana confidently \"So I guess the next one will be...\"<br>\r\n<br>\r\nJust ahead of them, suddenly, a flame burst up out of nowhere.<br>\r\n\"FIRE!\" both of the teenagers cried out.<br>\r\n<br>\r\nThere ahead of them was a large room, filled with small vents in the ground. Each of them was smoking a little, with the smoke rising up to a tiny chimney on the ceiling. Now and then, a ball of flame would rise up out of the vents, incinerating anything above it. At the far end of the room, the corridor seemed to continue.<br>\r\n<br>\r\n\"How are we supposed to cross this!?\" called Diana.<br>\r\n\"Looks like we'll have to run and dodge the fireballs as they come up\" replied Alex.<br>\r\n<br>\r\nDiana put on a brave face. \"Alright\" she said in a fear-riddled tone.<br>\r\n<br>\r\nWith that she ran as fast as her feet would carry her. Seeing flames ahead of her, she darted this way, and then that, before suddenly she almost ran right into a ball of flame while avoiding another one. In the last second, Alex tackled her out of harm's way. The two fell on each other.<br>\r\n\"You... saved me...\" said Diana.<br>\r\n\"Thank me later - right now we've gotta move!\" yelled Alex, standing up and pulled Diana to her feet.<br>\r\n<br>\r\nDiana was in no position to argue. The two chased down the remaining distance, and as they neared the entrance to the corridor, dramatically dived into the dark hallway. As they did, the whole room behind them erupted in flame and collapsed with a sound of thunder.<br>\r\n<br>\r\nBoth of them breathed heavily. \"That was scary\" said Diana.<br>\r\n\"You mean awesome, right?\" laughed Alex \"Hey look at this - more inscriptions...\"<br>\r\n<br>\r\nAlex held his torch up to some writing on the wall. \"It says here that the god and goddess will return... and then there's a bit here missing... I've never seen that symbol before... looks like a combination between the symbol for big and the symbol for rising. Whatever it means, it says that thing will happen when they do.\"<br>\r\n\"Sounds like they believed the two will return together ... and went away\" said Diana \"That's strange, I wonder where they went. Do you think they might be a metaphor for the seasons or something?\"<br>\r\n\"I don't know\" replied Alex \"A lot of the text is damaged but I can make out a few more words... that symbol there means size ... that one means young ... that one means powerful, or like a ruler ... usually you only see that last symbol in the tombs of kings. I wish I had my camera with me.\"<br>\r\n\"Well let's keep exploring... I think there should be a water trap and then we'll have reached our destination.\"<br>\r\n<br>\r\nThe teenagers didn't have to walk far, as they soon came to an underground river.<br>\r\n\"I didn't know there was an underground river here!\" yelled Alex.<br>\r\n\"It wasn't marked on my map!\" shouted Diana.<br>\r\nThe river was quite wide, but surprisingly fast-flowing. It looked much too dangerous to swim across.<br>\r\n\"Look, over there!\" said Alex \"Looks like some stones we can hop across on!\"<br>\r\n\"I don't know\" replied Diana \"They look kinda wet and dangerous. We might slip.\"<br>\r\n\"Come on!\" said Alex, leaping onto the first stone \"This is the last challenge. Once we get across this we should have overcome all the traps!\"<br>\r\n<br>\r\nCautiously, both teens began hopping from one stone to the next. After some time, they eventually made it to the other side. Here there was a tall door with no key or other means of opening it. It looked to be made of solid rock. However, imprinted on the door were two handprints.<br>\r\n<br>\r\n\"How do we get through?\" asked Diana.<br>\r\n<br>\r\nAlex held his hand up to the door. \"That's weird\" he said \"This looks like MY handprint\"<br>\r\n\"Holy shit ...\" said Diana \"That's freaky!\"<br>\r\n\"Hold up your hand\" said Alex.<br>\r\n<br>\r\nDiana did so, and notice that hers was also a perfect fit for the other hand print.<br>\r\n<br>\r\n\"Do you think... if we put our hands in there... the doors will open?\" asked Diana.<br>\r\n\"Only one way to find out\" said Alex.<br>\r\nWith that, the two teens thrust their hands forward together into the slots of the door.<br>\r\n<br>\r\nA pulse of energy seemed to shoot through them, like a small electric shock, that made them recoil from the door a little. Then, with a great rumble, the enormous doors slowly started to open.<br>\r\n<br>\r\n\"We did it! We made it!\" cheered Alex.<br>\r\n<br>\r\nThe doors slid a little more to reveal...</span></div></div>",
            "created":1474088400,
            "id":2211080,
            "title":"Diana agrees to search the deeper parts of the ..."
        },
        "113":{
            "author_id":"letslive93",
            "author_name":"Sky",
            "choices":[
                "Yes!",
                "Next please!"
            ],
            "content":"<div class=\"\"><div> <span>Eric Smith<br>\r\n<br>\r\n<br>\r\nEric Smith is a 20 year old guy who is 5'10 with size 9.0 feet. He attends a few classes at a local community college while working at a coffee shop. He has medium long blonde hair with hazel eyes. He spends his free time hanging out with his friends and family. He lives on his own in his one bedroom apartment. Secretly though he has a fantasy of wanting to become a giant in a city. </span></div></div>",
            "created":1394082000,
            "id":1756620,
            "title":"Eric Smith"
        },
        "1131":{
            "author_id":"letslive93",
            "author_name":"Sky",
            "choices":[
                "His wish became true!",
                "He finds a miniature city in his bedroom!",
                "Other!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens though? Does his wish become true? Or does he find a miniature city in his bedroom?</span></div></span></div>",
            "created":1394082000,
            "id":1756624,
            "title":"Yes!"
        },
        "1132":{
            "author_id":"bane23",
            "author_name":"Bane23",
            "choices":[
                "Ok",
                "Different anthro",
                "Different story all together "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a horse anthro having a strange day </span></div></span></div>",
            "created":1476765120,
            "id":2224822,
            "title":"Next please!"
        },
        "11322":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Bunny rabbit having a strange day scenario.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Instead of a horse anthro who ends up having a strange day, perhaps a bunny rabbit will have a strange day instead.</span></div></span></div>",
            "created":1520853780,
            "id":2463550,
            "title":"Different anthro"
        },
        "113221":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Experiment gone horribly wrong/right?",
                "Another scenario"
            ],
            "content":"<div class=\"\"><div> <span>Meet Robbie, a white furred lop bunny going to college, nothing eventful happens to this guy. He's your average guy, average looks, average smarts, average luck. With his white and black patterned fur he's not the guy on the girls list... but when he reads of an experiment to increase one's luck with females he's more than happy to get a chance at a girl... but what exactly awaits him inside?</span></div></div>",
            "created":1520906880,
            "id":2463809,
            "title":"Scenario one"
        },
        "12":{
            "choices":[
                "Yolanda Simon",
                "Marietta Taylor",
                "Someone else?"
            ],
            "content":"<div class=\"\"><div> <span>Since you are starting out as a girl, your choices are:<br>\r\n<br>\r\n1. Yolanda Simon is a seventeen year old girl, weighing 130 lbs at 5'5.  She has bronze hair that slowly curls it's way to her lower back, and pale blue eyes, so pale that they seem grey.  She is a good student in highschool, though she could use improvement.  She's never been busty, to say the truth, or to have curves at all.  But all of that is about to change.<br>\r\n<br>\r\n2.  Marietta Taylor is a 23 year old woman with a mocha colored skin tone and deep black hair that was cut into boyish locks.  She works with a section in a science lab that particularly focuses on health and beauty.  She is currently trying to find a way to bring more curves to her 5'8 frame, because 157 just wasn't enough for her.</span></div></div>",
            "created":1317704400,
            "id":1200780,
            "title":"Starting Out as a Girl"
        },
        "121":{
            "choices":[
                "Magic?",
                "Science?",
                "Naturally?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now that you have chosen your character, how should she change size?<br>\r\n<br>\r\nShould she get bigger by</span></div></span></div>",
            "created":1317704400,
            "id":1200781,
            "title":"Yolanda Simon"
        },
        "1211":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She opens the book",
                "She doesn't open the book",
                "Before she can open the book her parents call for her"
            ],
            "content":"<div class=\"\"><div> <span>Yolanda Simon age 17 sighed as she continued to sweep the floor of her attic, she lived with her parents inside her now deceased grandparents' house. She wondered what exactly was the point of sweeping this dustcovered and moldy old attic it wasn't like she was going to visit the place every now and then. But her parents insisted and she had little choice in the matter. So she swept tirelessly at first but now drooping slightly, she groaned and she threw the broom on the ground and sat down. \"Geez it'll take forever to clean the attic!\" She complained the attic itself was average but for her that might've meant that it was as big as a football field. She then got up and walked around she saw a dusty mirror as tall as her and she looked into it. Even with the dust and grime on the glass she could still see her rather slim but very undefined and curveless body. She grabbed her B-cup breasts and pushed them up, \"Man I wish I had a boyfriend... everybody else does.\" Don't get Yolanda wrong she was popular but she wasn't popular enough to get a boyfriend. And like most girls her age the only boyfriend she wanted was a big, strong, jock though she didn't know what she was thinking for she was going with the popular kids insted of her own choices. She sighed and stepped back and her foot bumped into something and she screamed as she fell.<br>\r\n<br>\r\n\"KYAAAAH!\" And she landed on her butt then back groaning she looked at what she had tripped over and saw it was a box and it's contents had spilled everywhere. In it was what looked like a small metal pot, a book, pieces of paper, and a wooden doll. She got up and looked at the stuff grabbing the book she inhaled and blew the dust off the book said. \"A beginners guide to <i>True</i> Magic\" she looked at the cover she didn't know why but she felt very inclined to openign the book.</span></div></div>",
            "created":1317877200,
            "id":1201718,
            "title":"Voodoo and Witchcraft doesn't work does it?"
        },
        "1212":{
            "author_id":"dbarricade",
            "author_name":"Detective Barricade",
            "choices":[
                "A chemical serum.",
                "A growth field device.",
                "Some other scientific creation."
            ],
            "content":"<div class=\"\"><div> <span>Yolanda Simon had just about enough. She knows that she's pretty...but not pretty enough to attract any real attention to herself. Puberty never really hit her, so she feels, as she hardly has any curves to be proud of nor is she all that tall at 5'5\". She envied all the girls in her high school that had breasts and butts worth mentioning, and so wished that she could be one of them. But sadly, she isn't, and she tries to search for something to take her mind off of her misfortune.<br>\r\n<br>\r\nOne day though, Yolanda comes across a giantess fetish site. Intrigued, she continues to investigate it. That settled it. She doesn't merely want to be like her fellow high school girls, she wants to become the biggest girl ever, towering over skyscrapers if not mountains! The thought alone makes her wet between the legs. But there's just one problem with her new found fantasy: how is she going to achieve it? Nature certainly wasn't about to help, as it has left the 17 year old girl high and dry unless it's saving up for a huge late bloom sometime down the road. And she doubts it. Yolanda realizes that science is her answer. Good thing the sciences are some of her best subjects. She just needs to develop something that can trigger the body to grow, far bigger than any person has grown before, and allow her body to be that big without any complications like crushing itself under its own weight. Clothes would be nice, but not really necessary if she can gain the body of her dreams.<br>\r\n<br>\r\nSo for weeks Yolanda works on her scientific creation that would make her growing dreams a reality...with any luck. Sure, there probably is some group out there working on something similar, but she doubts 'wanting to get really really big' would get past their screening processes, and they'd probably cut her off well before she could reach the size that she desires. One thing is certain, she's sick and tired of being almost flat-chested and having practically no ass. And she's going to do something about it.<br>\r\n<br>\r\nFinally, after over a month of painstaking work, Yolanda's scientific creation is ready. And she can't wait to try it out! Her creation is, of course...</span></div></div>",
            "created":1389589200,
            "id":1727086,
            "title":"Science?"
        },
        "12121":{
            "author_id":"hipcomp",
            "author_name":"Hipcomp",
            "choices":[
                "She takes a little of the serum. Just to test if works.",
                "She doesn't care, she takes all of the serum right away."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With this serum, she could grow as big as she wants. Her growing now wasn't far to become reality. But before she can become a hot giatess, she first needs to know that it actually works<br>\r\n<br>\r\nWhat should she do?</span></div></span></div>",
            "created":1471669200,
            "id":2198525,
            "title":"A chemical serum."
        },
        "121211":{
            "author_id":"hipcomp",
            "author_name":"Hipcomp",
            "choices":[
                "Become the biggest girl in history",
                "Go to school with your new body"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe just a little bit, just so i can test that it works. After all, what is the point of using it without knowing if it work\" <br>\r\n<br>\r\nso just like that, she drinks a little bit of the serum and is patiently for her little growth spurt by sitting on a table behind her.<br>\r\n<br>\r\nAfter a few minutes she notice that the table she's sitting on has problems with handling her weight. \"What is wrong with this table? I do not have a weight that much\"  the answer to her was that the table she was sitting broke in half! When she looked behind her she saw that the did break in half. \"What? but how? Did i just-\" behind her she also could notice the her butt is much bigger the normal! WOW! My ass is gigantic! But that means that the serum worked!<br>\r\nwhen she looked her breasts she could see them expanding! \"BREAST EXPANSION?! Is my dream becoming true?!\" When she stood up, she saw the ceiling coming closer \"YES!! FINALLY IT IS HAPPENING! I'M GROWING\"<br>\r\n<br>\r\nHer dream finally she had the body she always wanted. And if it wasn't good enough, it only will get better! While her body keeps expanding, her clothes don't. almost Everything she's wearing begins to rip off! Her shirt, pants, shoes, etc. By the time her head reaches the ceiling her growth spurt comes to a end, and at this point almost all of her clothes where ripped open! The only thing she had left where her underwear and bra. But both of them could snap loose at anytime.<br>\r\n<br>\r\n\"OMG!!! I'M SO GIGANTIC\" she was really happy with her new body and new height. \"I can't believe it actually worked! but now the question is what i should do with my new body and height?\"</span></div></div>",
            "created":1471669200,
            "id":2198553,
            "title":"She takes a little of the serum. Just to test i..."
        },
        "1212111":{
            "author_id":"hipcomp",
            "author_name":"Hipcomp",
            "choices":[
                "Take the swimsuit",
                "Srew the swimsuit!. I don't need it!"
            ],
            "content":"<div class=\"\"><div> <span>\"I think its time for me to become biggest girl history! But now i want to become more then just that, i want to be the GODDESS of this world!\" When she was about to drink the whole serum, she noticed that her bra and underware where at the point of snapping! \"Wow, i'm surpised that my bra and underware didn't snap\" luckily, she had made one special red two piece swimsuit. That could fit any size. (Even giantess size) \"luckily i was smart enough to have prepared myself for something like this. But should i....</span></div></div>",
            "created":1471669200,
            "id":2198562,
            "title":"Become the biggest girl in history"
        },
        "121212":{
            "author_id":"hipcomp",
            "author_name":"Hipcomp",
            "choices":[
                "Begins growing!",
                "Realizes that the serum didn't work"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just like that, she drinks the whole serum in one big gulp. She doesn't care to check if it is safe to use, all that she wants to become the most gigantic girl in history. And after a few minutes she....</span></div></span></div>",
            "created":1471669200,
            "id":2198528,
            "title":"She doesn't care, she takes all of the seru..."
        },
        "122":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "The formula works! Big breasts and ass here we come!",
                "The formula doesn't work back to the drawing board.",
                "The Formula does something unexpected!"
            ],
            "content":"<div class=\"\"><div> <span>Marietta Taylor was a 23 year old black woman who for a long point in her life had always been the wallflower. she had no bust, butt, or any real curves to really speak of. It frustrated her, the girl not noticed or attractive shunted by those that had the big boobs or the big asses, or both! But she studied long and hard to get to where she was today and today would be the day that she would get what she wanted. She stared at the vial of formula she had created. If she drank this she should, theoretically, get great big breasts the size of basketballs with the perfect amount of sag and perk to seem natural, and her butt should go from 10 inches to a sizable 40 inches across. She grabbed the vial and drunk it...</span></div></div>",
            "created":1472187600,
            "id":2201675,
            "title":"Marietta Taylor"
        },
        "123":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "Tasha",
                "Samantha",
                "Sarah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Three more girls, for you to define.</span></div></span></div>",
            "created":1354251600,
            "id":1478604,
            "title":"Someone else?"
        },
        "1231":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "On the Road",
                "In the City"
            ],
            "content":"<div class=\"\"><div> <span>\"You can control your world, simply by willing it\".<br>\r\nTasha sat up in her bed. A bit confused by what was either someone messing with her, or a very bizarre, if not concise dream. <br>\r\nIt was Monday. Tasha hates Mondays, and Tuesdays, and basically any day that's not a weekend. The 24 year old lives in her own house that her parents bought for her in cash, if anything to get her out of their house. The girl is bored. She has no motivation to do anything, except workout. She doesn't work, but rather lives off a healthy trust fund. She did graduate from university, only just. But then again she never even cracked a book. She was bored there too. Extremely smart and devastatingly gorgeous. The only interest Tasha has is Tasha. Somehow she always felt that she was better than everyone else. She always had few friends because she can be quite abusive. These days, she keeps a gaggle of nitwits around because they are easy to manipulate, and take her abuse without offering any resistance. She calls them her friends, but these days, she doesn't have any at all. <br>\r\nHer alarm clock rolled over to noon. <br>\r\nGrumbling she got out of bed and headed for the bathroom. The shower felt good, water running through her blonde hair. <br>\r\n\"Ooh my head. What did I do last night?\" A horrific hangover kept her in a fog. \"I wish this headache would just stop.\"<br>\r\nAnd it did.<br>\r\n\"...the hell?\" Rolling around in her cloudy memory was some faint idea about willing things. <br>\r\nHurriedly, she got ready for... for. Well for the day at any rate. She never has plans for Monday, she's usually too hungover. <br>\r\nShe put on some simple clothes, A nice purple shirt that showed off her ample cleavage, very well fitting blue jeans, and a pair of white sneakers. <br>\r\nShe got in her car and made for the sprawling city nearby, She could see the tall buildings from her house, but there is miles of suburbs between, and it meant about 40 minutes of driving. <br>\r\n <br>\r\n</span></div></div>",
            "created":1354251600,
            "id":1478619,
            "title":"Tasha"
        },
        "12312":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "She Grows",
                "She Doesn't"
            ],
            "content":"<div class=\"\"><div> <span>Tasha was wandering around window shopping. Nothing particularly piqued her interest. Nothing she could wear at any rate. She was actually quite tall and most of her clothes she to order online. That was fine with her. Again she was mainly interest in herself, but loved to lord her 76 inches over anyone she could. Most guys aren't even 6'4\". She would often combine her height with very high heels to exaggerate her presence. Her favorite pair of six inch platform sandals make her two inches taller than a standard door, and she loves it, having to duck to enter a room. And when she felt that she needed to emphasize her height, she would \"accidentally\" bump her head on a door frame to call attention to herself. People would rush to her \"Omigosh! are you ok?\"<br>\r\nRubbing her forehead she would answer, \"Yeah, I don't know why they build these doors so damned low. Not everyone is a fucking hobbit.\" <br>\r\nObviously this would make other people feel inadequate compared to her. Daydreaming about her pastime, Tasha regretted wearing sneakers out today and not heels. Oh, well. But she did have a memory of her disappearing hangover from earlier in the day. <br>\r\n\"No... could I?\"<br>\r\nShe had a desire to grow right here and now, to see if she could. </span></div></div>",
            "created":1354251600,
            "id":1478634,
            "title":"In the City"
        },
        "123121":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "Playtime",
                "Not Even Close!"
            ],
            "content":"<div class=\"\"><div> <span>\"Just a little bit, to see if I can\". She thought; \"No its crazy... is it?\" <br>\r\nWilling herself to expand, just a little bit, she wanted to see if she really could grow. At first it was almost imperceptible, a quarter of inch maybe. Then another, and another, then a whole inch. Now she stood alone, amidst a sea of strangers, standing 6'6\" where a moment before she was 6'4\". <br>\r\n\"Oh this is too good.\" Examining herself she noticed her very long jeans were now riding up her ankles, her shoes were a bit tight and her bust bulged over her bra. \"I guess i have to grow my clothes too.\" And with that thought, all of her clothes stretched to accommodate Tasha's new frame. \"Excellent, perhaps a bit more is in order\"Steadily, deliberately, Tasha continued to rise up and up, 6'7\"...8\"...9\"... 6'10\". She finally stopped at an even seven feet high. She wanted to go find someone to interact with, to show off her superior height, but people on the street were already starting to stare at her. No one saw her grow, they just saw a drop dead gorgeous amazon standing on the street corner.<br>\r\n </span></div></div>",
            "created":1354424400,
            "id":1479953,
            "title":"She Grows"
        },
        "1231212":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "Toys!",
                "A Bad Day to be Downtown"
            ],
            "content":"<div class=\"\"><div> <span>Overcome with excitement for the first time that she could remember in a long time, she had an explosion of growth, she didn't want to tower over and humiliate one person as she had planned. She wanted to tower over <i>everybody</i>. Over the very city itself. The floors of the tall buildings passed by her eye line. Faster and faster as she zoomed up into the sky. 50'... 70'... 120'... 300'. Finally she stopped growing at 500' tall. A crowd of people were gathered around her feet. The didn't show up to investigate, she was among them when she started to grow. Those closest to her had to run to avoid being overtaken by her expanding sneakers, that now had damaged number of parked cars, shoving them aside and into each other. Some people immediately began to run away, others were simply stupefied and stood in awe looking up. Even the rubber soles of her sneakers were higher than anyone was tall. Tasha was enjoying the view. She knew this is her purpose in life to better than everyone else- to be above them all. She didn't want to interact with anybody... yet. As badly as she wanted to look down and really compare the scale of herself, at this point it was more important to establish how much she doesn't care about the insignificant people below her. Yes, she wanted to be feared, not for her cruelty, but for callousness. Without looking down she took a step into the street, her first step as a goddess. With a tremendous BOOM! her foot flattened about a dozen stopped cars and snuffed a few dozen people out of existence. Buildings for blocks shook violently, causing windows to shatter. Then she took her next step, BOOM! Another dozen cars and a bus. This time carelessly erasing 100 people. And not a single one of them was even given a glance of acknowledgment by the titaness. She took her next step BOOM! The process repeated. But now a shoe print was revealed in the pavement. Rock hard tarmac buckled and crushed, revealing flattened hunks of metal and smeared human residue. BOOM! Tasha continued down the avenue with no particular goal in mind.</span></div></div>",
            "created":1354424400,
            "id":1479954,
            "title":"Not Even Close!"
        },
        "12312122":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "The Walk Home",
                "In The Blink of an Eye"
            ],
            "content":"<div class=\"\"><div> <span>Tasha was unleashing hell at her feet, and she still didn't even look down to acknowledge the people she killed. But she finally did look down. <br>\r\n\"Hmmph\" she huffed. She was really regretting wearing sneakers for this historical event. Looking across the city, and past the tract housing of the suburbs, she thought about her house. She willed her house to grow. Far of in the distance a form rose above the land. Thrilled she willed her house and everything inside it to match her scale. <br>\r\n\"Today is going to be a good day.\" Now Tasha had a direction, even though she just got here, she was going home... </span></div></div>",
            "created":1358398800,
            "id":1510230,
            "title":"A Bad Day to be Downtown"
        },
        "123121221":{
            "author_id":"ooo000",
            "author_name":"Me",
            "choices":[
                "Back to the city",
                "Grows some more"
            ],
            "content":"<div class=\"\"><div> <span>The walk home for Tasha was quick, at 500 feet she could go directly as the crow flies, and not surprisingly the city suffered as block after block collapsed under her sneaker clad feet followed by the delightful crunches of suburban houses. \"Today is going to be a good day\", repeated Tasha as she arrived at her front door. Going inside she took off her sneakers and walked to her closet. Looking through her massive footwear collection she opted for some high heeled knee length boots with a bit of a platform. Her winter equivalent of her high heeled summer sandals she frequently flaunted herself to attract attention to her very tall height. Putting the bvoots on over hjer tight jeans she looked in the mirror hands on hips and smiled at what she saw.....\"yes it is going to be a good day......\"</span></div></div>",
            "created":1369198800,
            "id":1595321,
            "title":"The Walk Home"
        },
        "1231212211":{
            "author_id":"ooo000",
            "author_name":"Me",
            "choices":[
                "Continues the destruction",
                "Grows more"
            ],
            "content":"<div class=\"\"><div> <span>Putting on a short close fitting jacket and tight leather gloves she was ready to go. After shutting her front door she sauntered off back towards the city, smiling as she went, arms folded across her ample chest, golden blonde hair flowing and sparking in the winter sun. It was a great day to be alive for Tasha as she trampled the insignificant villages on the road, carelessly and callously, in between destroying all the escaping vehicles on the road. Craters in the landscape showed the path her huge booted feet took.  It was time to kill, time to destroy, all that mattered was goddess Tasha.............</span></div></div>",
            "created":1377666000,
            "id":1653344,
            "title":"Back to the city"
        },
        "123121222":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "Visitor(s)",
                "There Goes the Neighborhood"
            ],
            "content":"<div class=\"\"><div> <span>Just by wishing it, she was standing in her living room. Most people would have been blown away by the ability to teleport at will, but Tasha was mildly impressed. In her mind she should be able to do anything she wants anyway. A glance out the window confirmed that she was still gigantic, just in a gigantic house. Upstairs she selected a new outfit, something more appropriate for a goddess. Ditching the \"normal\" clothes, Tasha pulled out a two piece bikini, blue in color and her favorite platform heels. Making her way out of the bedroom, she hit her head on the door frame... actually on accident. At the front door, she paused a moment, ready to greet the world again, but now <i>knowing</i> she can do whatever she wants. A deep breath, and she pulls open the door. </span></div></div>",
            "created":1358398800,
            "id":1510233,
            "title":"In The Blink of an Eye"
        },
        "1231212221":{
            "author_id":"taekwanjoe",
            "author_name":"TKJ",
            "choices":[
                "Edge of the City",
                "Let's Play!"
            ],
            "content":"<div class=\"\"><div> <span> The street that Tasha lived on was gone, well, it was now under her house somewhere. In the time it took Tasha to change clothes, the police arrived to investigate the appearance of a giant house and filled the street at the end of her patio. They were horrified at the sight of the towering woman approach them. She stopped at the edge of the street and looked down at the miniscule police force. A helicopter loitered near by at about hip high. Somewhere in the distance a dog barked. In disbelief the cops stared up. Her shoes were planted directly in front of the force. Looking down over her boobs, she regarded them a moment... then purposely lifted her right foot and brought her shoe down on top of a police cruiser, disappearing underneath the platform. The vibration knocked everyone off their feet. She had merely taken a step. She didn't stomp, or jump. Just a step sent the police into a frenzy. Drawing their weapons they began shooting wildly at Tasha purely out of fear and instinct. Still without speaking, Tasha laughed a bit, and smirked looking down, Being shot <i>a lot</i>had no effect on her. She raised her left foot and took a step, onto a house, and then she raised her right foot revealing the flattened police car and a red smear adjacent, and stepped away. The ground trembled as she made her way from the scene, looking to reintroduce herself to the world. </span></div></div>",
            "created":1358398800,
            "id":1510235,
            "title":"Visitor(s)"
        },
        "1231212222":{
            "author_id":"ooo000",
            "author_name":"Me",
            "choices":[
                "the military turns up",
                "the carnage continues"
            ],
            "content":"<div class=\"\"><div> <span>*CRUNCH!*<br>\r\n<br>\r\nHer first step outside and her platform heels had crushed a row of houses. \"Ooops! How clumsy of me.........\", Tasha giggled as she looked down and saw the shattered remains at her feet.<br>\r\n<br>\r\nShe felt warm inside, the exercise of unwitting casual destructive power even on her first footstep aroused her, she felt it between her legs.<br>\r\n<br>\r\n\"Clumsy? Are you kidding me? That was AWESOME!\". <br>\r\n<br>\r\nSo she took another step.....\"CRUNCH!\".....another row of houses.....she was delighted at the noise and the demonstration of power over the ants at her feet. Truly a goddess.<br>\r\n<br>\r\nHands on hips, her bangles and rings glistening and jangling (quite apart from her earrings and necklaces), she made short work of a 1000 homes........truly there goes the neighbourhood. Once her home area, now casually matter of factly wiped out. She had truly reintroduced herself to the world.<br>\r\n<br>\r\nOther neighbourhoods followed as Tasha strolled around enjoying herself, a killing machine with a mischievous smile and a giggle..........</span></div></div>",
            "created":1371618000,
            "id":1613919,
            "title":"There Goes the Neighborhood"
        },
        "1233":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Sarah",
                "More slots",
                "More slots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's put some more slots here first, shall we?</span></div></span></div>",
            "created":1369285200,
            "id":1595644,
            "title":"Sarah"
        },
        "13":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Born",
                "Turned into one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where they born a hermaphrodite or turned into one?</span></div></span></div>",
            "created":1317877200,
            "id":1201752,
            "title":"Hermaphrodite"
        },
        "131":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Jessica",
                "Alitta",
                "Some other character"
            ],
            "content":"<div class=\"\"><div> <span>Ok then here's two characters to use<br>\r\n<br>\r\nJessica: Blonde hair, long legs, E-cup bust, a nice 30 inch booty, and with a stunning figure this 22 year old Caucasian every boy's dream. However she also happens to have a cock one that's 12 inches long soft and a monstrous 20 inches hard that's 4 inches thick soft and 8 hard making her a hermaphrodite/futanari. Not that anybody knows about save the Teachers, and Dean and fellow herms. Despite her desire to join the cheerleading squad she's well aware that if she does she'd be the laughing stock. She's desperate to shrink her package down a bit but will her desperation cause her to make mistakes that make her situation even worse?<br>\r\n<br>\r\nAlitta: An Arabian, of 21 years of age, with an overall average body, C-cup breasts, a 12 inch butt, and a round face she doesn't stand out were it not for the fact that she has a 4 inch long soft cock and a 10 inch long hard cock, or her tennis ball sized nuts. However she also happens to be the only one in her generation to have a cock having 3 female sisters. As a result she is pressured into finding a family and finding a wife, or wives, to bear plenty of offspring. But to do that she might need a bit of a boost, after all everybody knows that bigger IS better.</span></div></div>",
            "created":1413349200,
            "id":1871911,
            "title":"Born a hermaphrodite"
        },
        "1311":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Magic",
                "Science",
                "Nature"
            ],
            "content":"<div class=\"\"><div> <span>So how will our Caucasian try to <i>'shrink'</i> herself? Magic: Involves spells, potions, summonings, contracts, wands, magical items and so on and so forth.<br>\r\n<br>\r\nScience: involves chemicals, growth rays, shrink rays, nanomachines, aliens, and or ancient technology<br>\r\n<br>\r\nNature: This includes herbs, fruits, plants, organisms that exist in items like water, venom from animals that can cause growth.<br>\r\n<br>\r\nIt is possible to combine 2 together but if you do so make sure to explain how it's being combined to make it easier for future users to understand.</span></div></div>",
            "created":1413349200,
            "id":1872104,
            "title":"Jessica: Methods of Growth?"
        },
        "13112":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "the serum immediately causes growth of Jessica's dick",
                "it initially appears to work, but ag her home, the growth starts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jessica recently found a doctor, who herself was also a hermaphrodite, and wanted to get volunteers to test her latest serum, which she also intended to use on herself, after a successful trial of course.</span></div></span></div>",
            "created":1431666000,
            "id":1978480,
            "title":"Science"
        },
        "1312":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Magic",
                "Science",
                "Nature"
            ],
            "content":"<div class=\"\"><div> <span>So how will our Arabian achieve growth? Magic: Involves spells, potions, summonings, contracts, wands, magical items and so on and so forth.<br>\r\n<br>\r\nScience: involves chemicals, growth rays, shrink rays, nanomachines, aliens, and or ancient technology<br>\r\n<br>\r\nNature: This includes herbs, fruits, plants, organisms that exist in items like water, venom from animals that can cause growth.<br>\r\n<br>\r\nIt is possible to combine 2 together but if you do so make sure to explain how it's being combined to make it easier for future users to understand.</span></div></div>",
            "created":1413349200,
            "id":1872101,
            "title":"Alitta: Method of Growth?"
        },
        "13121":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "A potion",
                "Some other means"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what does she use that's magical? A potion or something else?</span></div></span></div>",
            "created":1444539600,
            "id":2046350,
            "title":"Magic"
        },
        "131211":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She decides to get the potion tailored to her needs",
                "She get's the potion that causes growth all around"
            ],
            "content":"<div class=\"\"><div> <span>An Arabian girl walked down the alleyway dressed in a red and white salwar kameez. She had a round face and an average proportioned body and skin of a light milky chocolate color. Alitta looked around nervously she stood in an alley, in front of her was a shop with a sign reading 'Relena's Potions and Elixirs Emporium' she then looked down at the paper that had the directions. <i>'I guess this is it'</i> she realized and swallowing she walked inside. A bell rang and a girl about her age walked in,<br>\r\n<br>\r\nThe girl was thin and wore a purple and white embroided robe, she had a round face and long silver hair. \"Hello welcome to my store what can I do for you?\" She asked.<br>\r\n<br>\r\nAlitta blushed, \"Oh uhm... do you... happen to have any growth potions?\" She asked.<br>\r\n<br>\r\nThe girl smiled knowingly, \"Ah got a boyfriend whose not quite the size for you?\" She asked, Alitta shook her head. \"Or you looking for some liquid courage for these,\" And the girl reached down and lifted her bust which Alitta now realized was hidden quite well by the robe, each breast had to be as big as her head.<br>\r\n<br>\r\nAlitta however shook her head again, \"N-Not exactly... um... it'd be easier to just show you.\" And she put the paper away and lifted up her dress. The shop owner blinked then she gaped.<br>\r\n<br>\r\nShe saw a flaccid 4 inch cock complete with tennis ball sized balls.The owner recovered, clearing her throat loudly, \"I see well then what exactly do you want grown?\" She asked as the arabian futa lowered her dress again.<br>\r\n<br>\r\nAlitta's swayed side to side quietly, \"Well my... boy parts mainly, in particular my... uhm...\" She was a murky red color as she blushed, \"My testicles my family wants me to be able to find a wife and be able to impregnate her with many children so...\" she trailed off. The owner rubbed her chin.<br>\r\n<br>\r\nShe then turned to her desk walking toward it, \"Well I don't have a potion that specific I do have a potion that could temporarily serve you but keep in mind it's effects lasts for at least a week which is how long the potion will take to make. But if you want I can just give you another potion I have that should give you what you want plus more, I'll be nice and offer it at 25% less the price it normally would cost.\" she said.<br>\r\n<br>\r\nThe Arabian became thoughtful rubbing her arm, \"What would the other potion grow exactly?\" She asked.<br>\r\n<br>\r\nThe owner nodded, \"It would grow your entire body, your height, your muscles, breasts, butt, hips, penis, balls all of it. However the potion for you would focus growth to your penis and testicles and would even allow continual growth. Meaning they'll never stop growing in particular your nuts. I will say because of the length the potion will cost a bit more than the other one but it's up to you which one you want.\" She said. Alitta considered her options.</span></div></div>",
            "created":1444539600,
            "id":2046372,
            "title":"A potion"
        },
        "1312111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Skip to a week later",
                "What misadventures does Alitta get into with her inifite sperm potion?"
            ],
            "content":"<div class=\"\"><div> <span>Alitta thought about it, \"Well I think I'll get the one that would best fit me, my family won't have a problem with it.\" She said finally.<br>\r\n<br>\r\nThe owner blinked at this, \"What do you mean?\" She asked.<br>\r\n<br>\r\nThe Arabian girl fiddled with her fingers, \"Well they want me to find a person to marry and bear children so they are pushing me to do so.\" She said.<br>\r\n<br>\r\nThe young owner stood there, \"Why? Shouldn't you... I don't know, do what you want?\" She finally asked.<br>\r\n<br>\r\nAlitta nodded, \"And I am I do want to be of use to my family, and well I've... always wanted to have a family of my own so...\" She was blushing and smiling slightly, \"I mean for me I'll find true love, I think... only someone who truly loves me won't care how I look but will love me for who I am rather than the fact that I have both male and female genitals.\" she said.<br>\r\n<br>\r\nThe owner was impressed, \"Well I think that earned you a little discount, until then here,\" she said and she went to a cabinet and opened it. She pulled out a rounded vial with a pink liquid inside. \"This should do it'll make your balls bigger and give them an inifite sperm production careful though cause you can drain yourself out trying to empty your balls but you can't.\" she warned.<br>\r\n<br>\r\nAlitta took the potion, \"Thank you how much for this?\" She asked.<br>\r\n<br>\r\nThe owner waved a dismissive hand \"I'll bill you later.\" She said, \"Now go I gotta start this potion if I want to make deadline.\" She said and she pushed the little Arabian out and then closing the door she held up a hand and her finger glowed using it she wrote on the door closed until further notice. Alitta looked at the potion then bowed at the door and headed home.</span></div></div>",
            "created":1444539600,
            "id":2046417,
            "title":"Special Order"
        },
        "13121111":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Alitta has found a girl but she hasn't mentioned her true nature... yet...",
                "Alitta has used a mail order bride service and should be getting bride tomorrow"
            ],
            "content":"<div class=\"\"><div> <span>The owner of the potion shop sat at her counter flipping through a magazine. She looked at the clock on the upper right wall it read 3:27 PM. \"She should get her soon wouldn't want to miss out on this.\" she said, \"this potion was one hell of a workout.\" and she pulled out a vial about the size of the standard lab vial and set it on the counter. A jingle and the creak of the door opening and standing there was Alitta. She looked somewhat sad. \"Ah there you are.\" said the owner.<br>\r\n<br>\r\nAlitta looked at her, \"is it ready?\" she asked and the owner held out the potion. Alitta grabbed it, \"Thank you.\" she said, \"When should I drink this?\" she asked.<br>\r\n<br>\r\nThe owner rubbed her chin, \"when you're ready I would say you will get a sizable growth spurt after drinking it, but after that you'll keep growing but at a slow rate. It'll take a day to really notice the difference in size. Also it'll pump your production by quite a bit so be sure to empty yourself or you'll get blueballs and trust me when I say that will hurt a lot/\" Alitta nodded in understanding.<br>\r\n<br>\r\n\"Thank you I wish you a good day.\" said the arabian girl and she left the building. Alitta walked home thinking about what had happened during the weeks of waiting...</span></div></div>",
            "created":1472101200,
            "id":2201539,
            "title":"Skip to a week later"
        },
        "131211112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "A Caucasian woman named Wanda",
                "Some other woman"
            ],
            "content":"<div class=\"\"><div> <span>Alitta had tried to find a girl who would like her but her efforts in dating had proven fruitless and in desperation she had used an online dating service as a result. Dating service was a nice way of putting it, it was a mail order bride service where they took her information and matched it with another person who best fit her desires, likes, and dislikes. She had hoped to avoid such a thing but in the end she couldn't. She walked up to her house and grabbing her key's she unlocked the door and walked in. She went inside and to the computer she had where she worked, having studied hard and now was an IT consultant and quite a good one at that. Now she was past the age of marriage and her parents had been insisting she get married soon, though they obviously didn't realize just how hard it was with her personality and her view on her own body. She sighed as she opened up her internet and saw that the bride would arrive tomorrow. She looked at who it was...</span></div></div>",
            "created":1472101200,
            "id":2201567,
            "title":"Here comes the bride"
        },
        "1312111121":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Wanda backs off realizing she went a bit too far",
                "Wanda starts sucking the cock too eager to care about manners"
            ],
            "content":"<div class=\"\"><div> <span>Wanda was a Irish woman with freckles that went from her face down to her chest, and her arms from the shoulders. She was 5’2’’ had a bubbly personality, with large D-cup breasts, a thin waistline, a big 30 inch across booty, long red hair, a slightly muscular build and was… 20 years old? This was odd. Most married at 21, Alitta wondered if the girl was being forced to marry, if so it would not be a happy relationship. She looked at the rest of Wanda’s profile; Wanda grew up in the countryside and had graduated from high school. She had gone to college for two years, she didn’t earn any degrees but the experience had taught her a lot. As for why she wanted to marry it simply said, ‘She want’s someone to settle down whose kind, considerate, and thankful for her presence. Alitta was silent, she stared at the information then sighed, she couldn’t deny someone if she was truly that earnest. She sighed and got up to prepare for tomorrow.<br>\r\n<br>\r\n-The Next Day-<br>\r\n<br>\r\nAlitta sat in her living room, nervous and jumpy, a part of her wondered how Wanda would react to here dual gendered nature. Although the site had plenty of Futa’s seeking for wives she knew that sometimes they were preyed upon by normal people to get shamed. She wondered if Wanda was true to her biography. She heard the doorbell ring and she swallowed the lump of nerves in her throat and she got up. She paused at the door swallowed then opened it. Standing there was Wanda dressed in a loose white gown, her arms bare revealing that her arms and hands were completely covered in freckles, Alitta assumed that the rest of her body followed suit then. Wanda smiled, “Heya you Alitta?” She asked.<br>\r\n<br>\r\nA slightly accented voice but not heavily so, “Yes you are Wanda then?” She asked “Please come in,” she said.<br>\r\n<br>\r\nA nod, and Wanda walked in, “Soooo where are your parents?” She asked.<br>\r\n<br>\r\nAlitta gave a sad smile, “Back in Arabia, my kind… aren’t welcome there.” She said.<br>\r\n<br>\r\nWanda blinked then remembered what she read about Alitta’s profile, “So you really are one? I didn’t think… well…” She trailed off. Then she cleared her throat, “I feel I should explain I’ve been on that site for a while now and each time, so far, that I’ve been asked to be a bride I found out it was a hoax to get pictures, as a result most people think I’m a freak for liking futa’s so I was starting to lose hope, honestly you were gonna be my last choice if you turned out to be fake then well I’d stop.” She said, “But you really are a futa?” She asked.<br>\r\n<br>\r\nAlitta blinked at the story then nodded, “I-If you want I can show you.” She said, an eager nod from Wanda, Alitta blushed then went to the door closing it. She then turned her back on it and grabbed her robes, and lifted them up showing her small but slowly hardening dick.<br>\r\n<br>\r\nWanda bent her legs just enough to be eye level with it, “Oh wow… it’s real right? Can I… touch it?” she asked, Alitta nodded somewhat embarrassed she had hoped she could’ve drunk the potion before this but there was nothing she could do now. She bit her lip as she felt Wanda touch her cock gasp at it’s warmth then began to play with it with both hands, “Oh my god it’s real! This is awesome… it’s so cute!” she said…</span></div></div>",
            "created":1499995620,
            "id":2352828,
            "title":"A Caucasian woman named Wanda"
        },
        "13121111211":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Alitta takes the potion might as well seal the deal!",
                "Alitta doesn't want to have sex yet she wants to know Wanda better"
            ],
            "content":"<div class=\"\"><div> <span>Wanda was about to keep caressing when Alitta’s gasp alerted her to what it was she was doing. She retracted her hand quickly, “Sorry I over stepped myself it-it’s just… I’ve wanted to meet a real live futa for so long it’s… wow.” She smiled sheepishly while Alitta just smiled.<br>\r\n<br>\r\nShe lowered her dress, “Well does that mean… we’ll marry?” she asked.<br>\r\n<br>\r\nWanda nodded, “I don’t see why not?” She asked, “But uh… let’s do some… talking first get to know each other a bit eh?” came the suggestion.<br>\r\n<br>\r\nAlitta nodded, “Y-Yes ok…” She said, and so they talked, Alitta learned of Wanda’s obsession with futa’s of how she heard of their dual gendered nature that they could act as husband or wife or even both if paired with another futa. She just wish she could’ve been born one. While Wanda learned of how her parents had to pay the doctor to prevent her from being sent overseas at birth. How they struggled to hide her condition considering the typical clothing and dealing with her urges. Eventually how they left while she was in her teens and raised her a few years before an agency came and promised to help Alitta with being in America. Which lead to now, despite not being able to acknowledge her publicly they still expected her to marry someone and bear lots of children.<br>\r\n<br>\r\nWanda was silent, “Gee and I thought I had it rough with people making fun of me. You are not only much an exile from your people but your parents expect you to continue their ways through you. That’s… that’s… sad.” She said, and her growing love was just made stronger. She wanted to protect Alitta now, and treat her right. Then it occurred to her, “Not to put a damper on things but your balls aren’t exactly impressive… and…” she saw Alitta’s face and knew she messed up. “I-I’m sorry my mouth get’s ahead of my brain a-a-and… Sorry… I’m not the most ideal wife am I?” She asked.<br>\r\n<br>\r\nAlitta was silent then she smiled, “Well I’m not the most ideal husband either… but I think that’s best…” She reached out a hand grabbing Wanda’s. “For both of us.” She said “Besides I have a solution for that.” She said she got up and gestured for Wanda come. The two went to her room where lying on the table was the potion she had specially made from the witch. “This was specially brewed to give me the size and production power needed to be a productive father…” she said, “It was very expensive… but I think it was worth the money.” Wanda looked at it.<br>\r\n<br>\r\nShe rubbed her head, “What is it?” she asked.<br>\r\n<br>\r\nThe Arabian opened the top, “It’s a potion it would help with what I lack… I was told only to drink this when it was time for… you know.” Wanda got what she was saying.<br>\r\n<br>\r\nShe smiled and she grabbed her top, “I’m ready if you are.” She urged. Alitta swallowed knowing she had the say in what happened next. She watched as Wanda pulled her top up and off her body her breast snagged on by her bra before the shirt came off causing them to jiggle slightly. She then unbuttoned her top and tossed it aside revealing her sizable D-cup chest for the Arabian to see. Alitta had to admit it was an arousing sight. She swallowed the lump in her throat…</span></div></div>",
            "created":1520720040,
            "id":2462871,
            "title":"Wanda backs off realizing she went a bit too far"
        },
        "1312112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She decides to drink the potion that night.",
                "She decides to wait till a potential 'wife' comes to see her."
            ],
            "content":"<div class=\"\"><div> <span>Alitta nodded, \"I think the all around growth potion would best fit my current situation.\" She said.<br>\r\n<br>\r\nThe owner nodded and she went to the back some clinking and rustling later and she was back with a vial in hand. \"Ok so this is it, all you need to do is take this whenever you want. As for any side effects there shouldn't be any just as long as you, A: Don't take this while around a woman who is fertile or in short on their menstrual cycle. B: Don't take this during YOUR menstrual cycle. C: Should you take this drink don't drink anything with heavy chemicals like protein drinks, pills, energy bars, etc., etc.\" Said the owner.<br>\r\n<br>\r\nThe arabian raised an eyebrow, \"Why not?\" she asked.<br>\r\n<br>\r\nThe owner sighed, \"first one reacts with your body causing the growth to focus around your testicles, NOW you might think that's what YOU want!\" She said loudly cutting off Alitta's open mouth, \"but your testicles will grow so large and so quickly you'll be like a beached whale with permanent blue balls but hey if that's what you want go for it. As for the second one it causes your dick to just shoot up in growth speed so the same result as the first one only with this you end up with a sequoia on your groin. As for the third one the chemicals fuck mess with the magic in the potions and cause who knows what kind of crazy growth problems. So you got that? If so that'll be 150 bucks.\" Alitta nodded and she reached for a purse and pulled out a wad of bills she carefully went through the money and handed the proper amount. The owner took the money and gave her the bottle, \"Good luck with your marriage thing.\" said the owner and she went out the back. Alitta took the bottle and walked out she sighed relieved to have gotten what she wanted and headed back home.</span></div></div>",
            "created":1458277200,
            "id":2119321,
            "title":"All around growth potion"
        },
        "13122":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "It was the hormone project",
                "It was another project."
            ],
            "content":"<div class=\"\"><div> <span>Alitta stood in front of the large building labeled Alpha Labs, she swallowed nervously, checked her purse, and adjusted her dress, and tugged her ponytail behind her head then walked in through the front door. The reception was a large room with a reception desk right in front with 3 long chairs set up near it. At the desk was a man, and two women with head sets their eyes focusing on their computer screens while their fingers flew across keyboards. \"Um...\" the man looked up.<br>\r\n<br>\r\n\"Can I help you?\" he asked.<br>\r\n<br>\r\n\"Y-Yes I am Alitta I'm here for the augmentation experiment?\" She asked nervously.<br>\r\n<br>\r\n\"Ah which one did you volunteer for the Hormone project or was it another?\" he asked she thought about it trying to remember clearly...</span></div></div>",
            "created":1413349200,
            "id":1872295,
            "title":"Science"
        },
        "131221":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Alitta get's horny and erect the doctor curious wants to test it all the way!",
                "Alitta get's horny and erect but the doctor moves to testing."
            ],
            "content":"<div class=\"\"><div> <span>\"Yes it was the hormone project,\" she confirmed.<br>\r\n<br>\r\n\"Ah have a seat then please.\" He said, and she did so sitting down and adjusting her skirt slightly. She heard heels clacking and she looked up to see a woman with platinum blonde hair, blue eyes, a decent figure and slim build walk up her hair was tied up into a bun.<br>\r\n<br>\r\n\"Good evenin'\" she said with a distinct russian accent, \"I'm Doctor Lister you must be Alitta da?\" Alitta nodded. \"Hmmm I remember reading that you are a hermaphrodite is this true?\" She asked, Alitta blushed.<br>\r\n<br>\r\n\"I-I would discuss that in private doctor,\" she requested.<br>\r\n<br>\r\n\"Ah da, forgive my bluntness anyway come let us begin.\" And the doctor began to walk away the Arabian herm following close. As they walked the doctor spoke. \"We at Alpha labs are the leading experts in human anatomy, genetic study, and with your help, very possibly, the first in the creation of enlargement treatment without resorting to surgery this could be the beginning of a porofitable and successful business!\" Doctor Lister said her voice high with excitement.<br>\r\n<br>\r\n\"Will I get any parts of the profit if this is successful?\" Alitta asked.<br>\r\n<br>\r\n\"Oh da you will receive 20% of the profits, I will send them myself,\" the doctor confirmed, \"Here's the lab,\" and she turned into a steel door with a keypad, and a card reader. The doctor touched the keypad, it beeped and the card reader lit up. She reached into her breast pocket pulled out a card and slid it along the reader. There was a pause then the sound of a door unlocking. \"This way please.\" she opened the door and gestured for the herm to walk in which she did. They came to a room that had a seat in the middle, \"Now then if I may ask can you please show me?\" the Arabian was confused then she remembered. She nodded nervously and blushed. She set her purse down and began to strip down to her underwear with her bra, and panties. \"Fascinating! I've heard of your kind but to see you for real is quite... no words can describe this!\" the doctor bent in close.<br>\r\n<br>\r\n\"Remarkable does it react like a normal phallus?\" And she began to touch it...</span></div></div>",
            "created":1413349200,
            "id":1872330,
            "title":"It was the hormone project"
        },
        "1312212":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "The experiment is a success her cock and balls have grown slightly",
                "The experiment was a bit too successful her cock and ball are enormous!"
            ],
            "content":"<div class=\"\"><div> <span>The Doctor's fingers touched the dick probing with every move, Alitta began to pant softly and closed her eyes trying to muffle her voice as her dick swelled into erection. \"Fascinating.\" the doctor said looking at the 10 inch cock. \"let's see now ejaculation.\" and she began to pump the cock hard Alitta squirmed and bit her lip hard, then the muffled sound of release a spray of cum shot out, the doctor's hand moved and she caught the sperm where it pooled slightly before the spray lessened to mere squirts of jizz that splattered to the floor. \"Hmmm thick consistency which is a good sign indicates you are capable of impregnation. Curious, and now let's see here.\" the doctor turned the somewhat frazzled futa.<br>\r\n<br>\r\nShe could see it the clear vagina indicating she was still part woman. The doctor stood and went to a stack of cups grabbing one and sliding the sperm on her hand into it then returning to Alitta where she began to probe the vagina. \"Mmm hmm clear vaginal passage and... a cervix amazing! You truly are a hermaphrodite which means we can proceed straight to testing.\" she said. Alitta was in a foggy haze she had never been jerked off before, she had masturbated once but her father had become angry when she did and forbade her from doing it ever again. She was fortunate she had a low sperm production as it prevented her from developing blue balls. However she had began to feel her balls felt a bit overstuffed lately the orgasm helped get out some of that buildup but the sensation had put her mind on a spin cycle. She wasn't even aware that she was being lead into a room. In it was a table with a light above. When she was put on the table the cold metal was enough to snap her out of her daze.<br>\r\n<br>\r\nAlitta looked around confused. \"What happened where am I?\" she asked.<br>\r\n<br>\r\n\"Oh you are awake good, well we'll begin testing the formula.\" said the doctor, Alitta blinked confused, \"Ah yes forgive me, the experiment works like this, we will introduce a chemical that will cause your body to emit growth hormones. However these hormones will be centered around  the growth of your phallus and testicles. After that we can monitor the hormones and should, theoretically, control the size and rate of growth.\" the doctor explained.<br>\r\n<br>\r\nAlitta blinked, \"I didn't fully understand but I I assume we'll start right now?\" she asked the doctor nodded, Alitta laid down on the table.<br>\r\n<br>\r\nThe doctor stepped back and shouted, \"inject the anesthetic!\" a arm came out from the ground with a needle it stuck in Alitta's arm. Alitta's vision became blurry and unfocused eventually she passed out...</span></div></div>",
            "created":1471582800,
            "id":2198042,
            "title":"Alitta get's horny and erect but the doctor..."
        },
        "13122122":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Alitta doesn't want to get shrunk in fact she wants to use it now!",
                "Alitta is eager to get shrunk but how?"
            ],
            "content":"<div class=\"\"><div> <span>Alitta woke up to bright light, she blinked then sat up, she put a hand to her head groaning. She felt very dizzy, like she had been put through a spin cycle. \"Ah you are awake.\" she turned and saw the bleary form of the doctor.<br>\r\n<br>\r\nThe arabic girl sighed, \"Oh doctor did... did the experiment work?\" she asked.<br>\r\n<br>\r\nThe doctor approached her and she felt a sharp sting, \"Yes it worked but... you should see for yourself.\" the sting helped whatever it was. Alitta could see the doctor who looked worried Alitta looked down and she could only gape. Her former 10 inch long cock was now in the neighborhood of 20 inches, and her tennis sized balls looked like over-inflated basketballs. Thick veins ran along the length of them both and her balls gave a slight gurgle sound as if the cum that was inside was roiling about. She touched her balls and lifted them up feeling the heftiness of them. She then grabbed her cock lifting it and even running a finger up to the head the motion caused a surge of arousal to hit her and she shuddered as her dick began to get hard. It grew in thickness and length as it filled with blood and adrenaline. She could only watch as it swelled to full mast a jaw dropping 29 inches.<br>\r\n<br>\r\nAlitta could only mouth out. \"Oh my...\"<br>\r\n<br>\r\nThe doctor looked apologetic, \"I am sorry we did not think you're body would respond to the hormones so well it's just... we'll find a way to shrink this I promise you.\" she said.</span></div></div>",
            "created":1471928400,
            "id":2200608,
            "title":"Alitta's massive endowments"
        },
        "1313":{
            "author_id":"sweetsurrender",
            "author_name":"GrowthLover",
            "choices":[
                "Bailey",
                "Robin",
                "Someone Else"
            ],
            "content":"<div class=\"\"><div> <span>Bailey: Black hair, brown eyes, tan skin, age 25, with a C cup breast size. She only stands at 5'1, but she has an 3 inch long dick [soft]. Her balls are average sized. She makes money starring in pornos, something she started when she was a teenage but she always felt inadequate, given her short size and small dick. She is willing to do anything to increase her size and the length of her dick. What will happen to her?<br>\r\n<br>\r\nRobin: Redhead, blue eyes, pale skin with freckles. Age 28, DD cup size breasts, height 6'2. She was recently fired from her job as a businesswoman, because her sleazy boss found out her secret: She has a dick. This was a secret she was working to conceal ever since she got to work for this particular company. Her dick is 5 inches long [soft], 2 inches around. How will she get her revenge and rise to the top?</span></div></div>",
            "created":1471496400,
            "id":2197889,
            "title":"Some other character"
        },
        "13133":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Leila it is",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>Maybe someone younger?<br>\r\n<br>\r\nLeila Crux - Blonde hair, green eyes, white skin, age 12, with a B-cup bust, stands at 4'11'' with a 4 inch long dick, soft, with balls the size of chicken eggs. Leila lives with her mother, Margret, whose father divorced when he learned of his 'daughter' being born with a full functioning cock and balls. As a result her mother became severely depressed and began dating men left and right. Leila loves her mother but wants to be more than her 'daughter' rather she wants to be the 'main man' in her mother's life. She's noticed that her mother likes men with big dicks, and she knows that the only way to win her mother's heart is for her little 'Janice' to become MUCH bigger and she'll do anything to make her mom happy!</span></div></div>",
            "created":1488448200,
            "id":2284095,
            "title":"Another character"
        },
        "131331":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She chooses searches relating to magic",
                "She chooses searches relating to other forms of growth"
            ],
            "content":"<div class=\"\"><div> <span>Leila stared at the room where her mother lay moaning and gasping as she was being screwed by a man with a 13 inch long dick. The only reason why she knew this was because she had seen his junk when he and his mother were drunkenly going about the house. Leila herself was nothing special, thin girl with slight limbs, a B-cup bust, with long blonde hair and green eyes. The only thing remotely 'special' about her, was the fact that she had a dick and balls as well as a fully functioning vagina. The Doctor had told them that she was a hermaphrodite one of many that were now starting to pop up in the world. This fact was hidden from her father till about 2 years ago. He found out when he had been drunk and stumbled into the bathroom where she was going to the bathroom. He didn't take it very well, within a month the divorce papers were signed and he was gone.<br>\r\n<br>\r\nHer mother was devastated she began to drink and smoke but didn't do drugs... at first. Lately though she had been coerced into trying some due to her newer boyfriends but never long enough to get addicted. There was that too, she had been jumping from man to man hoping to find the 'right one' again. Within 2 years she had gone through more boyfriends more than most people go through bags of sugar. All of them had one special trait, big dicks and big balls. And there were all kinds like that surprisingly enough. Skinny guys, fat guys, muscle guys, nerdy guys, gangbangers, and once an escaped convict. Leila kept to her room playing video games and reading books. She used whatever allowance she got to buy them, also she used it to buy a laptop in secret. Which she now used to formulate her plan.<br>\r\n<br>\r\nLeila loved her mother as a daughter and more, she thought her mother was a beautiful and a very kind woman who deserved a loving, caring and ultimately supportive lover. In her mind Leila was her mother's perfect lover, the only thing she lacked was a huge set. She needed a great big one at that bigger than anything a person had ever seen. She closed the door to her room and grabbed her laptop and opened it showing the search of what she was looking for 'methods of growth' which had a few suspicious looking links...</span></div></div>",
            "created":1488467520,
            "id":2284154,
            "title":"Leila's Story"
        },
        "1313311":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She chooses the magical items emporium time to get her fingers sticky",
                "She goes for the more complicated yet cheaper stores"
            ],
            "content":"<div class=\"\"><div> <span>She chose a search related to magic and her screen loaded a site that read 'The beginner's guide to body altering magic! Useful tips and pointers for the young sorcerer/ess!' Leila was a little skeptical but in a world where herms/futa's were being discovered everyday she supposed she could accept that magic did exist. She looked and saw a few links to some store locations, one of which was a magical items emporium that had various items that could be used to alter the body more easily, but had a warning said items were extremely pricey. There were listings for other stores too that said to be cheaper yet more complicated to use items. Leila rubbed her chin, money was an issue, it took her about 10 months to scrounge up enough money for her four hundred eighty nine dollar. To get the money for these things she would have to steal some from her mom's current 'boyfriend' she bit her lip wondering what to do.</span></div></div>",
            "created":1488471840,
            "id":2284177,
            "title":"She chooses searches relating to magic"
        },
        "13133112":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Go for the cheaper more labor intensive stuff",
                "Keep looking for cheaper prices"
            ],
            "content":"<div class=\"\"><div> <span>She decided to check on the cheaper stores, and found those stores sold books that told how to do things from spells, to potions to even summoning but that it was a difficult practice on all accounts and could go wrong quite easily wrong. Some results could be fatal other's not so much. The only people looking into buying any of these books should expect to gather lots of materials and to study the books VERY carefully. Once sold the shop held no responsibility for the customer afterward. Not that Leila had any problem with studying materials what she was worried about was how long it would take to not only gather ingredients but to do the instructions properly so that no unforeseen side effects occurred or worse she ended up killing herself. She saw another listing for shops though had a bad feeling about those...</span></div></div>",
            "created":1488611340,
            "id":2284792,
            "title":"Cheaper but harder to work with"
        },
        "131331122":{
            "author_id":"roboblok",
            "author_name":"Hoax",
            "choices":[
                "Her package arrives in the morning",
                "Her package doesn't arrive"
            ],
            "content":"<div class=\"\"><div> <span>After nearly an hour of scrolling Leila came across a sketchy website with only one item for sale. A book Titled \"Penis Growth (Ingredients included)\". Leila found that there was no description or sender address.<br>\r\n<br>\r\nSketchy as it was Leila decided to buy it anyway, she scraped up all her money from her previous birthday and bought it.<br>\r\n<br>\r\n\"Thank you for your purchase ;). Your package will arrive soon\" The computer spurts out before closing the website itself.<br>\r\n<br>\r\nLeila didn't think much of it and decided to go to bed for the night.</span></div></div>",
            "created":1598565240,
            "id":2892701,
            "title":"Keep looking for cheaper prices"
        },
        "1313311221":{
            "author_id":"roboblok",
            "author_name":"Hoax",
            "choices":[
                "Right now (fast burn)",
                "Tomorrow (slow burn)"
            ],
            "content":"<div class=\"\"><div> <span>Leila awoke to the sound of her doorbell ringing. She jumps out of bed and makes a mad sprint for the door.<br>\r\n<br>\r\n*Creak* Leila opened the door and there it was, a brown box with no labels or anything. All it read was \"To: Leila\".<br>\r\n<br>\r\nBut she was too excited to try it out to even bother how the sender knew her name. She tore open the box with whatever pair of scissors she could find.<br>\r\n<br>\r\n... There it was, a Leather clad book titled \"Penis Growth Ritual\". Leila was ecstatic, she threw open the book to find a single page with the spell.<br>\r\n<br>\r\n\"Penis Growth Ritual:<br>\r\n<br>\r\nYou will need: Candles, Herbs, p̨̞̩̯̳̼͎̟͎̲͚̂̊̉͆ͩ̍̌͐̏ͩ͆̽ͧ̐̆ͤ̋ͫ̏͐͗ͯ̈́͑̚͡ͅͅÍ \u009d̵̵̸̵̸̢̧̢̧́̀͘͘͘͠͝͝͏҉̶͞͏҉̸̡́́͢͜͢҉̢͟͠͏̸̷͝͠Ì ¸̷̨̛́͟͝͠ā̠͇̤͓̺͕̺͐̍͊̍̾̈ͧͧ̇ͬ́̈́ͮ̑͒̎̈ͤ̉͒̽͐̈̚ ͍̺̻̞̝҉̶̀͜҉̶̡͘͜͜͡͏̶̷̷̵̵̵̶̨̨̨̛́́̀̕͘͟͟͢͝͞͡͡ ̵̶̷̨̨͘̕͜͜͟͞͞҉̷҉ŝ̿̄͊̆ͣ͌̄ͩ̑ͩ͂̌͂͒ͣ̈̇͛̅̂͊̈́͐Í ª̵̷̸̡̧̧̧̢̝̻̗͇͖̪̬̣͖̫͚̜́͟͢͡͞͝͠͏̷̡͞͏̶̷̢́́͜͝Ì ·̶̵̷̢̡̧̀́̀̀̕̕̕͜͟͜͝͏̧͠҉̸tͭ͂͐͛̈͂͊ͪ̑̍̾ͤ̌͊͗͗̄ ̸̸̶̷̡̢̛͉̤͍̫̮̩̰̤̺̱̺͐ͯ̈̓ͫ̎ͣ̓̀́̀̕͟͟͜͟͠͡͝͡͡ͅ ̵̴̶̨̢̨̢̧̕͘͡͡͏̷̵̷̧̨̡̧̨̨̀̀̕͜͝͠͡͞ẽ͊ͩ͛̾́̎͆͐Í Š̬̬͍̩͙̱̰͉͇̠̳̺̑ͫ̆ͯ̏̾ͫ̃͊̿̃̆ͥ͋̚͝͝͠͞͏̵̨̧̢́͜͟Í \u008f̶̷̴̸̶̵̸̨̧̡̧̛́̕̕̕̕͟͟͠͠͡҉̨҉̡̡̢̧͞҉̡͜͞҉͢͏ , and a drop of your own blood\"<br>\r\n<br>\r\n<br>\r\nLeila looked in the box again, the ingredients were all their \"Candles, Herbs, and a drop of my own blood\" Leila whispered under her breath while taking the items out of the box.<br>\r\n<br>\r\nLeila remembers the last ingredient... but she didn't know what it was. Leila began to freak out wondering whether or not she had lost it.<br>\r\n<br>\r\nLeila checks in the box again and sees a small pile of black goo in the corner of the box. She picks it up with her hands and puts it with the rest of the ingredients.<br>\r\n.<br>\r\n..<br>\r\n...<br>\r\nAfter a minute or two Leila gets to the last step where she has to draw her own blood, she hesitantly pokes herself with a needle and let's the blood drop onto the black goo.<br>\r\n<br>\r\nLeila Laid back and sighed in relief, she stared at her ceiling till she heard a *pop*. Leila shoots up to see everything from the box to the goo was gone, the only two things left were the book and a note which read \"Enjoy the new you ;)\".<br>\r\n<br>\r\nAs Leila is putting away the book she hears her garage door open as her mom arrives back home.<br>\r\n<br>\r\nLeila sits in her room as she hears a new person her mother had brought home. \"I wonder when this will kick in\" She thinks to herself.<br>\r\n</span></div></div>",
            "created":1598594820,
            "id":2892921,
            "title":"Her package arrives in the morning"
        },
        "13133112211":{
            "author_id":"roboblok",
            "author_name":"Hoax",
            "choices":[
                "Masturbate again",
                "Go to bed"
            ],
            "content":"<div class=\"\"><div> <span>You hear your mother and her knew boyfriend enter their room and lock the door behind them. You decide to play some video games to keep your mind off your mother. You boot up your PC and begin playing.<br>\r\n<br>\r\nYou completely forget about the ritual for the next hour or two... You finish up your gaming session to see your penis had not grown an inch. Dissapointed you go to take a shower.<br>\r\n<br>\r\nEntering the bathroom your hit with a massive urge to masturbate. You throw off your pants and slowly stroke your cock, thinking about all the amazing things you could do with a larger cock... You cum releasing your sperm all over yourself.<br>\r\n<br>\r\nYou start up the shower and wait for the water to heat up. Before the water can heat up you feel tingling in your crouch. You look down to see a 6 inch soft cock laying on from your crotch. \"It worked!\" You scream.<br>\r\n<br>\r\nYou feel your cock tingle again growing longer and thicker by the second. It was now 10 inches long and 8 inches thick. \"Look at this thing... It's amazing!\" You say, slowly rubbing the underside of your shaft... <br>\r\n<br>\r\nYou quickly shower and enter your room, locking your door behind you. \"No pants fit anymore\" you say. \"Oh well, not like I need to hide this thing\" you say. You feel your crotch tingling some more. \"Oh god yes!\" You scream as your 10 inch softie grows to a foot long.<br>\r\n<br>\r\n Your so amazed by your cock it's almost as if It has you in a trance. So much so you fail to realize how sensitive your cock has become. You stroke your cock, moaning with each movement of your hand.<br>\r\n<br>\r\n\"I wonder what to do next\" you say...</span></div></div>",
            "created":1599283380,
            "id":2897800,
            "title":"Right now (fast burn)"
        },
        "1313312":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "She checks up on some offers for experiments",
                "She looks up natural ways to get bigger"
            ],
            "content":"<div class=\"\"><div> <span>She went to look at the other search choices, one read 'Volunteer today to earn a place in the study of growth science, you can be the start of a new generation of the 'big people' in the world!\" More than likely growth via the study of science chemical's and biology as such.<br>\r\n<br>\r\nThe next one read, \"Nature has many gifts, gifts that are being discovered everyday, sorcery and science are products of man and man is flawed but Nature is pure. With the power of nature you can achieve true peace with oneself and discover the power of nature on your very being.\" nature lovers so called miracle plants and what not perhaps even causing growth through manipulation of internal energy? Which to choose though?</span></div></div>",
            "created":1488514380,
            "id":2284394,
            "title":"Alternative choices"
        },
        "132":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Magic",
                "Science",
                "Nature"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How was the character turned?</span></div></span></div>",
            "created":1318050000,
            "id":1203050,
            "title":"Turned into one"
        },
        "1321":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "Jackie's Magic Book",
                "Belinda's Gypsy Curse",
                "Some other character"
            ],
            "content":"<div class=\"\"><div> <span>And here are our candidates<br>\r\n<br>\r\nJackie Albert, at 20 years of age Jackie is not a pretty girl but not an ugly one, Caucasian, she stands at 5'1'' with red hair, freckles, and a very average body, a B-cup bust, and a 18 inch butt. She is quite intelligent but a bit of a society odd duck. For one thing she believes in magic, and has devoted a good 9 years of her life to magic. Despite public opinion she believes that one day she'll find a magic book and could  use it's spells to make herself more attractive and liked by both girls and boys... but when she finally buys said book her curiosity might get the better of her.<br>\r\n<br>\r\nBelinda Salazar, Belinda is a 19 year old hispanic girl who has the looks of a super model, but the personality of a bitch. She stands a 5'9''  with long black hair, olive brown skin, a E-cup bust, and a 35 inch butt, she believes her looks can get her anything and get out of anything. However when she mocks a gypsy woman she might find that said gypsy's curse is gonna turn her life utterly upside down.<br>\r\n<br>\r\nAnd if these aren't good maybe you have a character story in mind?</span></div></div>",
            "created":1472533200,
            "id":2203888,
            "title":"Magic"
        },
        "13212":{
            "author_id":"kentenko",
            "author_name":"Silent Soul Ken SSK",
            "choices":[
                "It's effects is immediate",
                "The effect happens when she get's home"
            ],
            "content":"<div class=\"\"><div> <span>Belinda Salazar was with some friends, they were at a local fair, they were only there because they were bored and couldn't think of anything neat to do. Of course they weren't gonna skip out on some entertainment and food, but Belinda wanted to do more than that. With each stand they went to she had to make a sneering comment, \"Oh my god look at that, what is that?! People used to eat this stuff? No wonder they don't anymore!\" Or \"Ugh how tacky this isn't even worth half of what you say it is I'd probably get that for like a penny!\" and it went on and on. Her friends would chuckle but after a while they grew tired of her antics.<br>\r\n<br>\r\nNow they were heading toward the jousting stage when one of Belinda's friends, a boy named Mick Rogers, pointed at a small purple tent that was near a pond. \"Yo check it out a fortune teller.\" he said.<br>\r\n<br>\r\nThey stopped and looked, on the ground in front of it was a sign saying, Gypsy Fortune Teller. A girl, a caucasian girl named Erica Mathiss, saw the sign, \"Gypsy? Like those people on the river? Don't they use magic or something?\" she asked.<br>\r\n<br>\r\nBelinda laughed, \"Are you serious? That's stupid magic doesn't exist!\" she said, \"Look I'll prove it!\" and she walked up to the tent and pushed the entrance flap up. Her friends stood there waiting.<br>\r\n<br>\r\nInside Belinda was surprised to see that the inside was much larger than it appeared, in fact it couldn't be this big, it was like she was standing in her own bedroom. A large 9X9 feet circular room with a table with a dull orb sat a woman appeared from the side. \"Come to read your fortune young one?\" she said her voice carrying a slight accent. Belinda was surprised the woman wore an elegant blue gown with golden moons and stars pattering it, she also had a veil that hid her lower face but not enough to show that she was of supreme beauty, and that more than anything made Belinda angry. Belinda hated the idea of anybody prettier than her, especially if they were older or the same age as her.<br>\r\n<br>\r\nBelinda sneered, \"So you can read my fortune huh? You use magic too?\" she asked the woman nodded.<br>\r\n<br>\r\n\"I can but only when I deem it necessary to do so. Like teaching someone a lesson but I shouldn't need to... hopefully now do you wish to have your fortune read or not?\" asked the woman.<br>\r\n<br>\r\nThe hispanic beauty queen just scoffed, \"Uh huh and how much  is a fortune a 100 bucks?\" she asked.<br>\r\n<br>\r\nThe woman folded her arms over her chest, \"it depends on the person I'm reading some people it only costs about a dollar other's thousands it's entirely dependent on the person.\" she said.<br>\r\n<br>\r\nBelinda was losing her cool, \"Oh yeah? And how much do I cost?' she snarled.<br>\r\n<br>\r\nThe woman looked her carefully, then folded her arms over her chest, \"for what you want 500 dollars.\" she said.<br>\r\n<br>\r\nThe hispanic drama queen scowled, \"Yeah fucking right you're just a scam operation is what you are, slut!\" a wind suddenly began to blow but Belinda ignored it, \"500 bucks what you think I just have that kind of money? Fuck you! Fuck your fortunes and fuck your bullshit magic!\" and she ran up and tossed the table the orb flew into the air and hit the ground with a hard thunk. she turned and walked off.<br>\r\n<br>\r\nThe woman snapped her fingers and the table and orb set themselves back to normal. She then went up to the orb held up her hands and a green energy emanated from them the orb became clear and showed the image of Belinda mouthing off to her friends. \"Well she's got a mouth alright but I think she needs a lesson in humility.\" and her hands gently stroked the orb, \"Belinda, Belinda you foolish little girl, a curse I now bestow will surely make you hurl, when you learn the to never scorn, only then will the curse break that is now born.\" and with that the spell was cast...</span></div></div>",
            "created":1472619600,
            "id":2204079,
            "title":"Belinda's Gypsy Curse"
        },
        "1322":{
            "author_id":"barackobama2",
            "author_name":"Broken 6",
            "choices":[
                "Sophie",
                "Analise",
                "Jocelyne"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky character?</span></div></span></div>",
            "created":1394600400,
            "id":1759448,
            "title":"Which Character?"
        },
        "13221":{
            "author_id":"barackobama2",
            "author_name":"Broken 6",
            "choices":[
                "A guy who had a crush on her in Middle School gets his revenge",
                "Her boyfriend cheats on her"
            ],
            "content":"<div class=\"\"><div> <span>Sophie was a 15 year old cheerleader at Red Creek High School. She always had the time of her life with her great friends and her amazing boyfriend. She was 5'8\" with a relatively small chest (an A cup) but she was very pretty with her flowing dirty blonde hair. Her hips were slightly wider than average with an average butt as well. She modeled for the local clothing stores and was pretty smart too. Sophie was living her life quite happily and had no regrets. That is, until....  </span></div></div>",
            "created":1394600400,
            "id":1759456,
            "title":"Prelude to new beginnings..."
        },
        "132212":{
            "author_id":"sweetsurrender",
            "author_name":"GrowthLover",
            "choices":[
                "Nothing happened... yet.",
                "She passes out as changes occur to her body."
            ],
            "content":"<div class=\"\"><div> <span>Sophie stormed home in a rush. She was SEETHING with anger!<br>\r\n<br>\r\nEarlier that day, she had gone back into a classroom looking for a book for next period when she saw her \"perfect\" boyfriend, Avery, tall dark and handsome, making out with her ex-friend, Leona. Leona had beautiful brown eyes, a nice big butt and boobs to match. When she confronted them, he told her that he no longer loved her and that she was as flat as a table!<br>\r\n<br>\r\nSophie was fairly smart for her age. Her Dad was a scientist and every so often, he would allow her into his lab to help with his experiments.<br>\r\n<br>\r\nBut little did he know that she was sneaking into his lab when he wasn't home... and experimenting with chemicals. Sophie had a couple of fetishes. One of them was becoming a hermaphrodite... She had a few dreams where a penis would be growing out off her... and it felt awesome, having both sets of genitals. When she had these dreams, she would wake up, aroused. The other was growing.... Into a goddess. Having her way with cities or even planets... and maybe, if she felt like it, restoring everything back to the way it was.<br>\r\n<br>\r\nHastily, Sophie broke into her father's lab. He was a single father, since Sophie's mother ran off when she was little, and worked hard and late.<br>\r\n<br>\r\nFor the past few nights, she had been working on this particular formula... If her theory was right, it should do what she wanted to: Goddess-hood.<br>\r\n<br>\r\nShe drank the formula...</span></div></div>",
            "created":1408078800,
            "id":1841791,
            "title":"Her boyfriend cheats on her"
        },
        "13223":{
            "author_id":"pointlesssmut",
            "author_name":"SmutScrawler",
            "choices":[
                "Accidentally injected with compound",
                "Jackie planned to make her this way all along"
            ],
            "content":"<div class=\"\"><div> <span>Jocelyne had always been a city girl. She really only agreed to pay her sister a visit on her dairy farm when she offered to pay all her expenses. Her sister made a big deal about a new compound that was going to make her rich. Jocelyne had no idea how big a role she had to play in all this until that fateful day. Jocelyne was a black girl who got along with most people and spent alot of time hanging out. She wasn't exactly the hottest girl on the block but she wasn't the wall flower either, thin build, B-cup breasts, a sizable 28 inch booty, long hair brown hair done in a ponytail, and was rather tall standing at 5'11'' just a bit short from the big 6 feet. She also had very dark skin that was almost pure black something she obtained from her mother. As for her sister Jackie, she was quite different, serious, dedicated and smart. Body wise she was a bit similar, small bust, big butt, tall body, though unlike Jocelyne she actually did hit the 6 feet mark, and her skin was a lighter shade of brown something she got from her dad.<br>\r\n<br>\r\nAs to why Jackie decided to call Jocelyne of all people Jocelyne would find out soon enough.<br>\r\n<br>\r\nJocelyne sat in the bus, she was by herself as all the other passengers had exited the bus by now the darkness of the night pressing down. She sighed as it the view showed nothing but more and more farmland. She looked at her phone where her sister Jackie had taken the time to send her a text putting in the stop off address. <i>\"Stop at Willow Rd. Cyu soon<img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\">\"</i> she sighed and lowered the phone. Then from the bus' speakers rattled, \"Stopping at Willow Rd. I repeat Willow Rd.\" the black girl couldn't help but smirk at the timely arrival. She got up went out the door, and out the bus to the side where the baggage compartment was opening. Luckily her bag was inside, she grabbed it and looked around, there was nothing but a sign, along with the dirt road and some fences. She sighed, and set her bag down \"Well now I'm stuck in the middle of nowhere in the middle of the night!\" She said.<br>\r\n<br>\r\nSuddenly a voice shouted, \"Hey if it isn't my favorite baby sister!\" She recognized the mature, yet youthful yell, she turned to see her sister walking up to her. She was dressed in a white tanktop and blue cotton pants and seemed to be jogging. \"Finally you're here! Come on let's go! It's dark out.\" She said.<br>\r\n<br>\r\nJocelyne followed her sister eagerly, \"So what's this compound or whatever you have?\" She asked.<br>\r\n<br>\r\nJackie just smiled, \"I'll tell you more tomorrow I'm sure you're exhausted. Let me just say it'll rake in dough like wheat on a field.\" she said. Her house was a few steps down the road then down a turn where tire tracks were.<br>\r\n<br>\r\nThe younger sister noted this, \"You have a car?\" She asked.<br>\r\n<br>\r\nHer big sister shook her head, \"Not really sometimes a company guy comes for some details or some farmer to deliver some goods and sometimes they give me a ride. Otherwise nothing much to it.\" She then pointed ahead, \"There it is!\" she said and Jocelyn saw a 2 story house, that looked rather well maintained, aways from it was a large barn house in fact it was so large it dwarfed the actual house by quite a bit. \"Your beds upstairs so get some sleep I'll explain everything tomorrow!\" She said and she grabbed the handle of the screen door and pulled it open, she then opened a wooden door and walked inside, Jocelyne followed after her sister and looked around, the interior was so lavish she was surprised she wasn't in the city again. She would ask about it tomorrow, she went up the stairs to the hall and looked for her room, it didn't take long there was a door with her name on it. She walked in and saw a simple room with a single bed, window, desk, night desk, a drawer and a closet sighing she put her bag on the ground and slid into the bed and fell asleep too tired to even change clothes. Quite a fate awaited Jocelyn but how would this fate be thrusted upon her by accident or intent?</span></div></div>",
            "created":1454648400,
            "id":2099688,
            "title":"Jocelyne"
        },
        "132231":{
            "author_id":"pointlesssmut",
            "author_name":"SmutScrawler",
            "choices":[
                "You feel a burning sensation in your breasts",
                "You feel a burning sensation in your crotch"
            ],
            "content":"<div class=\"\"><div> <span>\"The company promised at least 2000% increases in production\" Your sister said. \"Apparently it's some combination of bovine and equine genes, it's going to change the whole world\" she said with total enthusiasm. The two of you were in her main barn, she was just about to administer the first dose to the lucky cow when it happened. The needle held enough for 20 cows it later became known, but neither of you knew that when you tripped and fell on it. The entire needle full dumping into your bloodstream before you even had a chance to react.<br>\r\n </span></div></div>",
            "created":1454648400,
            "id":2099691,
            "title":"Accidentally injected with compound"
        },
        "1322312":{
            "author_id":"roboblok",
            "author_name":"Hoax",
            "choices":[
                "Your sister comes back",
                "You attempt to move some more"
            ],
            "content":"<div class=\"\"><div> <span>You stand up and pull the needle when you suddenly feel a burning sensation in your crotch. It felt as though you were on fire...<br>\r\n<br>\r\nYou pass out from the shock and awaken on bales of hay. Your sister is nowhere in sight, and standing before you is a monstrous 10 foot hard cock.<br>\r\n<br>\r\nYou attempt to stand but your newly found penis weighs you down. Giving up on attempting to move you examine yourself. Whilst examining yourself you find that you have massive balls to match your cock. You estimated them to be about the size of large bean bag chairs.</span></div></div>",
            "created":1598590860,
            "id":2892903,
            "title":"You feel a burning sensation in your crotch"
        }
    },
    "info":{
        "author_id":"kentenko",
        "author_name":"Silent Soul Ken SSK",
        "brief_description":"Basically grow big! As big as you can and as big as you want!!!",
        "created":1264459260,
        "description":"<td align=\"left\" class=\"norm\">Basically grow to your hearts content the bigger the better... No guy on guy stuff please... No toliet or vore either! I don't care! Try to make the growth as realistic as possible also try to give a reasonable explanation for everything that happens. You can start as a guy, a girl, or a herm... which is short for Hermaphrodite if you don't know what that is I'll explain. A hermaphroidte is a person with both male and female organs... it doesn't matter how big a person get's the bigger the better. Also if your gonna put in sex try not to make it forced, give it some thought. Shota's and Loli's can be done and same rules apply.<br>\r\n<br>\r\nNo getting fat<br>\r\nNo Toliet<br>\r\nNo Vore<br>\r\nNo Random Killing of the current MC (Plotted killings allowed)<br>\r\n</td>",
        "id":1639480,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1599283380,
        "modified":1599283380,
        "pretty_title":"The Size Story!"
    }
}