{
    "chapters":{
        "1":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Natsu",
                "Lucy",
                "Gray",
                "Erza",
                "Wendy"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day at the Fairy Tail Guild Hall. The wizards were either guzzling down beer, picking fights, or just chatting with each other.<br>\r\n<br>\r\nOne wizard was looking at the Request board and spotted a translation request and decided to check it out.</span></div></div>",
            "created":1594184520,
            "id":2863905,
            "title":"The Magic begins"
        },
        "11":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Lucy and Natsu",
                "Levy and Wendy",
                "Natsu and Happy",
                "Other pair"
            ],
            "content":"<div class=\"\"><div> <span>Natsu decided to check out the request and smiled, \"Ha this should be easy we just need to translate this I'm sure we can figure it out easily! Lucy is really smart after all! She's always reading!\"<br>\r\n<br>\r\nHappy said, \"Aye sir! Let's bring it over to her!\"<br>\r\n<br>\r\nThe two approached Lucy who was chatting with Levy. <br>\r\n<br>\r\nNatsu said, \"Hey Luce! We found an easy job! It's just a translation one. I bet you can figure it out!\"<br>\r\n<br>\r\nLucy said, \"What?! A translation job! No way Natsu! Did you forget what happened last time?\"<br>\r\n<br>\r\nWendy approached the group and asked, \"What happened last time?\"<br>\r\n<br>\r\nLucy said, \"We ended up switching bodies with each other. We barley managed to get back to our own body last time.\"<br>\r\n<br>\r\nNatsu said, \"Come on the chances are slim it'll happen again! Let's go for it pays really well!\"<br>\r\n<br>\r\nLucy said, \"Not happening Natsu.\"<br>\r\n<br>\r\nNatsu said, \"Fine I'll figure it out myself then all the reward will be mine.\"<br>\r\n<br>\r\nHe began to read it, \"O, oi kathodigoúmenes neráides mas dínoun mia néa ápopsi tis zoís. Antalláxte mas makriá kai dóste mas mia néa ápopsi. antístrofa\"<br>\r\n<br>\r\nLucy tried to stop him but it was too late as they were blinded by a flash of light that filled the guild hall.<br>\r\n<br>\r\nWho was swapped?</span></div></div>",
            "created":1594185300,
            "id":2863912,
            "title":"Natsu"
        },
        "111":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Body ",
                "Body part",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The poor Celestial wizard and Fire Dragon have fallen victim to the spell. What was swapped?</span></div></span></div>",
            "created":1594185360,
            "id":2863913,
            "title":"Lucy and Natsu"
        },
        "1111":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Each other",
                "Other Fairy Tail members",
                "Othet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The two fell victim to the body swap spell but who did they swap with?</span></div></span></div>",
            "created":1594185420,
            "id":2863917,
            "title":"Body "
        },
        "11112":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Wendy and Carla",
                "Mavis and Levy",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did they swap with the little sky dragon that could and the Future seeing Exceed or did they swap with the first master and solid script mage?</span></div></span></div>",
            "created":1594185540,
            "id":2863918,
            "title":"Other Fairy Tail members"
        },
        "111122":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "Lucy to Mavis, Natsu to Levy",
                "Lucy to Levy, Natsu to Mavis",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who swapped with who?</span></div></span></div>",
            "created":1594185600,
            "id":2863919,
            "title":"Mavis and Levy"
        },
        "1111221":{
            "author_id":"icypika",
            "author_name":"Icypika",
            "choices":[
                "The paper was no longer there",
                "It is still there."
            ],
            "content":"<div class=\"\"><div> <span>When the light died down Lucy was the first to recover and see what had happened. She gasped as she looked around the guild hall everything seemed much bigger than before. A lock of platinum blonde hair fell into her face. She grabbed a lock of hair and moved it out of her face.  <br>\r\n<br>\r\nShe said, \"What the!? Why do I look like the first master?\" She covered her mouth, \"I event sound like her too!\"<br>\r\n<br>\r\nShe turned to face Natsu who seemed to have snapped out of shock. <br>\r\n<br>\r\n'Natsu' said, \"Ahhh! I'm Natsu! How did this happen? I wasn't touching the paper! My voice is so much deeper now!\"<br>\r\n<br>\r\nLucy asked, \"Who are you in Natsu's body?\"<br>\r\n<br>\r\nNatsu said, \"I'm Levy!\"<br>\r\n<br>\r\nLucy said, \"Wait but does that mean?\"<br>\r\n<br>\r\nShe looked to her fellow bookworm. Who seemed to be grinning goofily.<br>\r\n<br>\r\nLevy's body said, \"Whoa! I'm Levy! This feels so weird! I wonder can I use your magic now?\"<br>\r\n<br>\r\nNatsu in Levy's body tried to use her solid script magic, \"Solid Script Fire!\" They spelt out the word fire but nothing happened.<br>\r\n<br>\r\nNatsu said, \"Ah man! This didn't work! I know I spelt it right!\" He was really angry you could hear it in Levy's voice.  Suddenly fire appeared around Levy's fist.<br>\r\n<br>\r\nLevy said, \"What the heck!? Is that your magic?\" <br>\r\n<br>\r\nNatsu looked down at his new hand surrounded by fire and grinned. \"let's see! I'm coming for ya Levy! Fire Dragon Iron fist!\" He aimed a punch at his old body who quickly reacted, \"Solid Script Water!\" A floating water script appeared as the attack hit landing but failing to burn.<br>\r\n<br>\r\nNatsu said, \"This is awesome! We still have our own magic!\"<br>\r\n<br>\r\nLucy said angrily, \"Natsu this isn't funny! We have to switch back!\"<br>\r\n<br>\r\nLevy said, \"I agree with Lucy. This is interesting but I'd like my own body back.\"<br>\r\n<br>\r\nShe turned to where the paper had been.</span></div></div>",
            "created":1594186440,
            "id":2863925,
            "title":"Lucy to Mavis, Natsu to Levy"
        }
    },
    "info":{
        "author_id":"icypika",
        "author_name":"Icypika",
        "brief_description":"A strange new translation request appears on Fairy Tail's request boardm",
        "created":1594184340,
        "description":"<td align=\"left\" class=\"norm\">Here is my first attempt at an interactive story. This is partially based on the changling episode of Fairy Tail. A new translation request appears on the request board and one wizard decides to attempt it. This changling spell is a bit different from before. It can swap several different things.<br>\r\n<br>\r\nStandard Body Swap: Two wizards swap bodies at random.<br>\r\nBody part swap: Two wizards swap a body part at random<br>\r\nLife Swap: Two characters switch lives<br>\r\n-body and life Swap<br>\r\n- Only life Swap: The wizard keeps their own body but are percieved as the other<br>\r\n<br>\r\nAge Swap: Wizards swap ages <br>\r\n<br>\r\nPersonality swap: Wizards switch personality<br>\r\n<br>\r\nMagic swap: Two wizards swap magic <br>\r\n<br>\r\n</td>",
        "id":2226299,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594186440,
        "modified":1594186440,
        "pretty_title":"Fairy Tail Changling"
    }
}