{
    "chapters":{
        "1":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "Saying a certain word (either by Megan or by another character--or both)",
                "Simply saying the word 'shrink' or 'grow'",
                "Lying",
                "Anger",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what makes Megan shrink?</span></div></span></div>",
            "created":1225170000,
            "id":671323,
            "title":"Beginning"
        },
        "11":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "Back Home..."
            ],
            "content":"<div class=\"\"><div> <span>\"Hi, welcome to Nanotech Labs. Do you have an appointment?\" the receptionist asked.<br>\r\n\"Megan Johnson,\" Megan replied, shouldering her bag. \"I'm here for the nanite experiment.\"<br>\r\n\"Oh, yes! Please, go right on through that door. Dr Morgan is waiting for you.\"<br>\r\nMegan headed through the door, brushing her red hair from her face. Frankly, she needed money for college, and her part-time job wasn't going to cut it. She'd seen the ad in her local paper looking for medical test subjects, and the money was pretty damn good, so she figured she'd sign up.<br>\r\n<br>\r\nShe found a door marked \"Doctor Janice Morgan\", and pushed it open.<br>\r\n\"Ah, you must be Megan,\" the black woman inside greeted her warmly. \"I'm Dr Morgan. You're here for the matter reduction experiment?\"<br>\r\n\"I guess,\" Megan replied.<br>\r\n\"Excellent. Well, I'll have to run some preliminary tests.\" Dr Morgan shut the door. \"Please take off all your clothes and stand over here.\" She gestured to a height marker on the wall, like the kind in police lineups.<br>\r\nMegan reddened, and Dr Morgan laughed gently. \"Relax, nobody but us girls here. I'll turn my back if you like.\"<br>\r\nMegan nodded and Dr Morgan turned around while the red-haired girl undressed and stood up next to the wall.<br>\r\nOver the next half an hour, the doctor recorded Megan's height, weight, breast size (C, if you were wondering) and other vital statistics.<br>\r\n\"Alright, you can get dressed now,\" the doctor said.<br>\r\nMegan pulled her clothes back on and sat up on the bed as per Dr Morgan's instructions. \"Now, I'm going to inject you with some nanites, so hold still.\" She produced a hypodermic syringe, filled it with a yellowish fluid and injected it directly into Megan's arm.<br>\r\n\"So what'll these do, exactly?\" Megan asked.<br>\r\n\"Basically, they're programmed to respond to a certain command word. When that word is spoken by anyone within earshot, including yourself, the nanites will activate and reduce the amount of empty space between the molecules in your body.\"<br>\r\n\"What will that do?\"<br>\r\n\"Shrink you.\"<br>\r\nSeeing Megan's look of alarm, the doctor laughed. \"Relax! They're programmed to only halve your size each time, the process is perfectly painless, and a second command word will immediately return you to normal size, no matter how small you are.\"<br>\r\nMegan swallowed and nodded. \"What are the command words?\"<br>\r\n\"Nothing that is likely to come up in normal conversation. The failsafe command to return to normal size is 'ante-meridiem', and the command word to shrink is 'post-meridiem'.\"<br>\r\nMegan suddenly felt a tingling spread through her body, and the room seemed to get larger around her. Her shoes fell off her feet, and her clothes became a lot baggier. Within a minute, she was half her normal height- about two feet, nine inches.<br>\r\n\"Aaaah!\" she cried out in shock.<br>\r\n\"See? No pain at all,\" Dr Morgan said. \"Ante-meridiem.\"<br>\r\nMegan's body tingled, and she shot back up to five foot six.<br>\r\n\"Alright! Take this journal, write about your experiences, and I'll see you in two weeks. Here's my card if you need me.\" She handed Megan a business card.<br>\r\n\"Th-thankyou,\" she stammered, pulling her shoes back on and leaving.</span></div></div>",
            "created":1226034000,
            "id":604824,
            "title":"The Experiment Begins"
        },
        "12":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "'Shrink' will make you lose half your height, 'Grow' will double your height.",
                "'Shrink' will shrink you by 3 inches, 'Grow' will make you gain 3 inches back.",
                "'Shrink' will shrink you by 6 inches, 'Grow' will make you gain 6 inches back.",
                "'Shrink' will shrink you by 1 foot, 'Grow' will make you gain 1 foot back.",
                "Hearing the words 'Shrink' and 'Grow' will cause random size changes."
            ],
            "content":"<div class=\"\"><div> <span>“Alright, Miss Johnson. You’re all set!” the doctor said, as Megan sat on the chair in the small room. She was in the lab, and she had just received multiple injections of various types. She signed up for some experiment where she would get paid $25,000 for her participation.<br>\r\n<br>\r\n“Thank you, Doctor Williams. So, what happens now?” the young woman asked him.<br>\r\n<br>\r\n“Over the next four weeks, you will experience various changes in your height and weight, due to others saying certain words. Certain triggers will cause your body to increase or decrease in size. All we ask, is for you to start an online blog, and to post your experiences every day!” he explained.<br>\r\n<br>\r\n“Fair enough! Are these changes permanent?”<br>\r\n<br>\r\n“Yes, until we inject you with some antidote. You may actually enjoy this, Miss Johnson!” he smiled.<br>\r\n<br>\r\n“So, what are the triggers and how will I change?”<br>\r\n<br>\r\n“Well, stand up and come stand over here so we can try it, shall we?” the Doctor suggested.<br>\r\n<br>\r\nShe got on her feet and stood right before him.<br>\r\n</span></div></div>",
            "created":1238994000,
            "id":671614,
            "title":"Simply saying the word 'shrink' or '..."
        },
        "121":{
            "author_id":"zsderr",
            "author_name":"kenny",
            "choices":[
                "Megan goes to her boyfriend house ",
                "Megan goes home",
                "Megan goes to the mall"
            ],
            "content":"<div class=\"\"><div> <span>Doctor Williams tells Miss Johnson stand up and lets test it out and see do the experiment work are you ready yes replied Megan Doctor Williams says shrinks Megan begins to feel the effects on her body it begins tingling all over then all of sudden she begins to feel her clothes becoming looser her pantyhose fitted snug now they are loose and begins to slide off her bottom her skirt begins to fall down she tries to catch her clothes with her hands now her blouse begins to loosen her bra begins to fall down,Megan I can't believe I am shrinking it working doctor.Hold on Megan I am going to say it again are ready yes Megan replied Doctor William say shrink this time Megan clothes peels off her body quickly she holding just her panties as hiding her naked body from the doctor now Megan is just two inches tall everything is huge in the lab Dr.Williams bends down Megan how do you feel I feel find doctor just small we are making history now lets test the second experiment Dr. Williams says grow Megan's body begins to grow to half of her height she fumbles as she try to hide her naked body from the good doctor. Dr. Williams say grow she back to her regular size Megan says I am back to my normal size then the doctor say grow again her body grows more now her head is at the ceiling Megan still can not believe Megan likes the feeling of becoming taller it was beginning to make her arouse her breasts was more sensitive as normal her nipples were erect now and her clitoris was sensitive now she tries to control her urges she feels that she feels so horny right now she feels that she can't hold out any longer then the doctor says shrink and the shrink again she back to her regular height Megan thinking to her self that was close a couple more seconds and me and the good doctor was going to get to know each other better Dr. Williams was telling her you can get dress now Megan as she was standing naked in front of him she was turning red as grab her clothes and begins to get dress behind the blinds. Dr Williams explained to Megan that they are side effect when you grow you have a heighten sensitivity and increase sexual desire we think this is cause because of the serum be honest did you feel it when you grow Megan smirk yes I did doctor you said shrink out the right time Megan say I shouldn't say it I am going to start to shrink now but nothing happen hey doctor I didn't shrink when I say shrink the doctor explained only change when somebody else say the words Megan finished dressing and the doctor gives her log book to record everything that happens to her body.Megan is ready to leave the lab and have some fun with her new found power the doctors warns her be careful and remember to document everything.</span></div></div>",
            "created":1350622800,
            "id":1449836,
            "title":"'Shrink' will make you lose half your h..."
        },
        "124":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Megan goes to school",
                "Megan goes home",
                "Megan goes to the mall"
            ],
            "content":"<div class=\"\"><div> <span>“Let’s give this a try, shall we?” the Doctor said to the young woman, who was standing 5 foot 4 inches tall.<br>\r\n<br>\r\n“Sure…”<br>\r\n<br>\r\n“Shrink!”<br>\r\n<br>\r\nSuddenly, Megan was overcome by a tingling feeling. Her entire body began to shorten: her arms, her legs and her torso began to compact all at once. She began to rapidly dwindle from 5 ft 4” to 4 ft 4”, in a matter of just 3 seconds!<br>\r\n<br>\r\n“Oh my gosh!” she gasped, as she realized everything getting bigger around her.<br>\r\n<br>\r\n“There! It works! Now, let’s reverse it!” the Doctor said. “Grow!”<br>\r\n<br>\r\nMegan was overcome by the tingling again, and she rapidly grew back to 5 ft 4”, her original height.<br>\r\n<br>\r\n“That… That is amazing!”<br>\r\n<br>\r\n“Every time you hear the s-word, you will lose a foot in height, until you’re 4 inches tall. You’ll remain at that size, of course…”<br>\r\n<br>\r\n“Oh, thank goodness…”<br>\r\n<br>\r\n“You’re all set! Have fun!”<br>\r\n</span></div></div>",
            "created":1239080400,
            "id":672007,
            "title":"'Shrink' will shrink you by 1 foot, "
        },
        "1242":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Amy shrinks Megan some more",
                "Amy makes Megan grow back",
                "Amy makes Megan shrink and grow a few times"
            ],
            "content":"<div class=\"\"><div> <span>Megan finally arrived home. Her parents weren’t home, and Amy, her 12-year-old sister, was playing with the next door neighbor. For the moment, she had forgotten about the experiment, although she was totally looking forward to receiving the money. After all, it seemed like money that was earned for doing nothing. As long as she stayed home, who would shrink her?<br>\r\n<br>\r\nAmy finally came home. She slammed the door shut, and raced through the room.<br>\r\n<br>\r\n“Hey! Settle down, will you?” Megan said her sister.<br>\r\n<br>\r\n“Oh, be quiet!” Amy shouted back.<br>\r\n<br>\r\n“Hey! Behave!”<br>\r\n<br>\r\nAmy was a nice girl, but she had a big mouth now and then and she hated to be told what to do.<br>\r\n<br>\r\n“I am behaving! Don’t act like I’m not being nice!”<br>\r\n<br>\r\n“You better behave, or else you’ll drive me up the walls!” Megan replied.<br>\r\n<br>\r\n“Yeah…” Amy responded, as she sat on the couch. “You’ll go crazy and then you’ll need to go see a shrink…”<br>\r\n<br>\r\nSuddenly, Megan was overcome by a tingling feeling. Luckily, she was sitting on the big lounge chair. Her arms were dwindling in size. Her hands were retracting, and her fingers started to shrink as well. Her feet became smaller, to the point where her shoes fell off! Megan felt her clothing feel looser and wider, as her body slowly decreased in size. After a few seconds had passed, she had lost a foot in height, and she was now only 4 foot 4 in height! Her jeans looked far too big on her!<br>\r\n<br>\r\nAmy looked up and noticed something odd had happened to her sister.<br>\r\n<br>\r\n“Hey… what happened to your clothes?” <br>\r\n<br>\r\n“Nothing…” Megan replied.<br>\r\n<br>\r\n“You look different…”<br>\r\n<br>\r\nMegan carefully tried to get back on her feet, by sliding off the lounge chair, which seemed bigger to her. Once her feet were on the floor, she was standing straight up. Amy got up and walked up to her.<br>\r\n<br>\r\n“Hey! I’m just as tall as you are!” Amy noted. “What happened?”<br>\r\n<br>\r\n“Well, uhmm… I went to the doctor, and…” Megan started to explain.<br>\r\n<br>\r\n“Did you shrink?” Amy asked her.<br>\r\n<br>\r\nSuddenly, Megan was overcome by that tingling feeling again. She began to shrink again, dwindling further from 4 foot 4 to 3 foot 4 inches tall, while standing right before her little sister!<br>\r\n<br>\r\n“Oh, COOL!” Amy cheered out loud. <br>\r\n<br>\r\nMegan just looked up to her sister as she slowly dwindled down to 3 foot 4 inches tall. Her clothes were far too big for her. Her jeans were all wrinkled around her short, little legs. Her shirt was almost handing to the floor, and her arms were far too short for the shirt sleeves.<br>\r\n<br>\r\n“Hey, Amy? If you say the words ‘shrink’ and ‘grow’, you will change my size by a foot every time you say them…” Megan explained to her sister.<br>\r\n<br>\r\n“Ooooh, really?” Amy replied with a grin.<br>\r\n<br>\r\nAmy was going to have some fun with this!<br>\r\n<br>\r\n</span></div></div>",
            "created":1241240400,
            "id":685276,
            "title":"Megan goes home"
        },
        "12421":{
            "choices":[
                "The shop with my friends",
                "The pool with my friends"
            ],
            "content":"<div class=\"\"><div> <span>\"Please, stop with that!\" - Amber screamed.<br>\r\nShe looked up to her little sister, that now was smiling down to her<br>\r\n<br>\r\n\"I just want to see you SHRINK one more time!\" Amy said.<br>\r\nAnd then it was. Amber loosed all of hers clothes.<br>\r\nAmy start laughing at a small-naked Amber, with only 2 feet and 4 inches.<br>\r\n<br>\r\n\"I want to grow, grow, GROW!\" Amber screamed.<br>\r\nHer legs started to get bigger and her fingers to grow, and in just a few seconds a normal-sized Amber was yelling at a poor Amy.<br>\r\nAmber started to dress her, and she was talking to Amy<br>\r\n\"If you say the S word, i'll make mom punish you!<br>\r\nI'm out, i'm going to...</span></div></div>",
            "created":1309842000,
            "id":1140945,
            "title":"Amy shrinks Megan some more..."
        },
        "12423":{
            "choices":[
                "Opened Megan's legs.",
                "Unzipped her jeans?!"
            ],
            "content":"<div class=\"\"><div> <span>''Heh heh heh...'' Amy giggled, looking down at her shrunken older sister, ''I could have so much fun with this...''<br>\n<br>\nMegan didn't like the look in Amy's eyes.<br>\n<br>\n''With the power I have over you, sis, you'd have to do everything I say, wouldn't you?''<br>\n<br>\nMegan gulped.<br>\n<br>\n''Yup, that's right!'' Amy laughed fiendishly, ''I can make you... Do... Anything.''<br>\n<br>\nTwo huge hands clamped down on her shoulders, and Megan felt herself getting picked up with sheer ease.<br>\n<br>\n''Shrink! Shrink! Grow! Shrink! Grow! Grow! Shrink! Grow! Shrink!''<br>\n<br>\nStill clamped in her sister's hands, Megan felt rather nauseous after her size changing rollercoaster ride. After all of that, she was even smaller now, at just 16 inches tall!<br>\n<br>\n''So, are you ready to <i>play</i>, 'little' sis?'' Amy threatened, her blue eyes sparkling impishly.<br>\n<br>\n''Put me down, Amy!'' Megan cried, ''You can't do this to me!''<br>\n<br>\n''Oh? I can't?'' she laughed derisively, ''who's gonna stop me?''<br>\n<br>\n'Mom will!' Megan considered saying, but something told her Amy hd thought of that already.<br>\n<br>\n''Heh. Thought not.'' Amy chuckled, sweeping her black hair from her eyes, ''So it looks like you're my little slave then, huh?''<br>\n<br>\n''And slaves do whatever their mistress tells them to.''<br>\n<br>\n''No! NO!'' Megan screamed, flailing against her sister's superior strength.<br>\n<br>\n''Yes YES!'' Amy bellowed, bringing her lips right up to her sister's face, to the point where her breath blew Megan's hair back, ''Or do I have to say that word again?''<br>\n<br>\nMegan stopped struggling immediately, ''...no.''<br>\n<br>\n''Then you'll do it?''<br>\n<br>\n''...yes.''<br>\n<br>\n''Perfect!'' Amy laughed, planting a face devouring kiss upon her sister, ''Alright slave, you got yourself a deal. If you behave, I might even say the other word! But you'll always be smaller than me, and always be my slave, got it?!''<br>\n<br>\n''...got it.'' Megan sighed, ready to face the worst.<br>\n<br>\n''Heh heh, perfect...'' Amy laughed, ''Alright slave, I give you your first task!''<br>\n<br>\nMegan's fears grew to new heights when Amy...</span></div></div>",
            "created":1419310800,
            "id":1906648,
            "title":"Sizing her up."
        },
        "124232":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Agreed. She'll do whatever Amy wants.",
                "Did nothing. Amy will have to force her."
            ],
            "content":"<div class=\"\"><div> <span>Panic shone in Megan's eyes as she watched her little sister pull the zip down on her jeans.<br>\r\n<br>\r\n\"You know where this is going, right?\" Amy grinned, as the button was undone, and her jeans flopped to the ground.<br>\r\n<br>\r\nMegan could only nod in response.<br>\r\n<br>\r\n\"Alright, that's good. Saves some time.\" Amy said. Lowering her shrunken sister to her panties, she said, \"Now, you can do this, or I can make you do this. Which will it be?\"<br>\r\n<br>\r\nMegan gulped. \"Umm...\" she hesitated, and</span></div></div>",
            "created":1456290000,
            "id":2108953,
            "title":"Unzipped her jeans?!"
        },
        "1242321":{
            "author_id":"doodad",
            "author_name":"smallprint",
            "choices":[
                "\"Please grow me back. You'll be in trouble too, if mom finds out!\"",
                "\"M-may I sleep with you tonight, m-mistress? I like -no- love being your toy.\""
            ],
            "content":"<div class=\"\"><div> <span>\"... I'll do it.\" Megan said softly, her face reddening as she thought about what she was about to do.<br>\r\nAmy's face went from surprised, to confused, to utter glee in only a fraction of a moment.<br>\r\nA brief disorienting swing followed, then a sudden drop, as Amy turned around and plopped down on the couch next to the chair Megan had just been sitting in.<br>\r\nAmy settled in, each little wiggle, twist, and turn jerked and swayed Megan, effortlessly and incidentally.<br>\r\nShe was moved, put down to sit on Amy's still clothed stomach, and looked up at her little sisters face.<br>\r\nShe was still smiling, now flushed and breathing heavy in anticipation, her head raised by some pillows, looking down her own body,<br>\r\nThere, on her very body, her 1'4\" 'big' sister sat, naked and at her mercy.<br>\r\nShe ogled Megan, Amy's grip prevented her from covering herself, in fact, the sheer difference in strength meant Amy wasn't even sure she made an effort to do so.<br>\r\n<br>\r\n\"Say it .\" Said Amy, who let go with one arm, and started running a finger almost the size of a whole arm through Megan's hair.<br>\r\n\"Say you <i>want</i> to go down on me.\" Her smile grew and she let out an audible chuckle as Megan was hit by the shock.<br>\r\nShe hesitated, but there was no way she could draw this out long enough for their parents to come home, and she swallowed her pride.<br>\r\n\"Please may I eat you out.\" If she could have turned any redder, she definitely would, as she continued. \"I- I wish to please you, mistress.\"<br>\r\nAmy went from slightly flushed to fully red, bit her lip, and let out a soft, long, moan.<br>\r\nHer hands let go and moved away from Megan, who fell backwards on Amy's lap, as the tween removed her shirt, revealing her training bra, followed by being tossed to between Amy's legs as the removal of the giant white panties easily threw her off her footing.<br>\r\nAs she gathered herself and looked up, she could see the last of the movement of Amy removing her bra, dropping it on the floor.<br>\r\nAmy settled back into the couch, and she started playing with her budding breasts, her eyes locked back onto Megan, eagerly awaiting 'lip service'.<br>\r\nMegan looked down to between Amy's giant thighs, a glistening, pink crevice, covered by a forest of thin, frizzy hairs.<br>\r\nAs she crawled forward from between Amy's knees, and as she came close enough to feel the heat, she slowed down, starting to feel...<br>\r\nIntimidated.<br>\r\nThe cavity could easily swallow her head, and if Amy said shrink one more time, here whole body.<br>\r\nEvery wiggle and shake Amy made while playing with herself were violent shakes and grand movements for her, and her cunny was starting to moisten.<br>\r\n<br>\r\nAmy was still watching Megan with great interest, slowly losing her patience with the tiny woman.<br>\r\nMaybe she should say shrink, and stuff her in entirely for making her wait, even if only for a few seconds.<br>\r\nOr maybe she could make her grow a little, a little encouragement for being a good girl...<br>\r\nAmy let out a surprised yelp.<br>\r\nBefore she could make her choice, Megan had made hers.<br>\r\nTaking a deep breath, she pressed her face onto Amy's womanhood, her tongue lapping at the engorged clitoris, as her left hand worked the outer folds and curtains, and her right arm thrust into the glib, muscular debts of her sister's slit.<br>\r\nHer mouth filled with the taste of Amy's arousal, sweat built from a hot summer day, and grime and urine from a tomboyish lack of hygiene.<br>\r\nHer skin chafed by the coarse fuzz and rubbed raw by the rubbery skin as Amy bucked and twisted.<br>\r\nHer arm tugged, clamped, and kneaded by the walls of her little sister's cavern.<br>\r\nFor the next ten minutes, this was Megan's world, and she grew disheartened as she realized how much power Amy had over her, just from a few injections.<br>\r\n<br>\r\n\"More! More!\" Amy stammered, with little control over the volume of her voice.<br>\r\nThe bucking became more intense, and Megan started to lose her grip, and started to get concerned, sure she would be punished if she couldn't bring her to orgasm.<br>\r\nWithout hesitation, but some reluctance, she stood up, and climbed onto her sister's twitching body, and, with the frizzy bush underneath her, laid down on her stomach, reaching her head back down between Amy's thighs.<br>\r\nAwkwardly, she reached her left hand, now massaging and squeezing the burning love button, as she lowered herself down, her right hand feebly keeping her from falling, and resumed licking, kissing, and nipping at Amy's folds.<br>\r\nA heavy weight landed on Megan's back, a hand holding her in place.<br>\r\nTaking the opportunity, she had her right hand free to join in.<br>\r\nThe movements became more intense, the pressure on Megan increased as Amy's muscles tenses.<br>\r\nIt took another five to fifteen minutes, Megan was beginning to lose track of time, but she was suddenly shot upwards, as Amy arched her back in climax, still held in place  by Amy's iron grip, freed as she came down, her face moist with her little sister's love juices.<br>\r\n<br>\r\nAmy laid on the couch, catching her breath, practically purring, mentally gloating.<br>\r\nMegan still laid face down on her pubic mound, looking away from Amy.<br>\r\n\"You've been a good girl. Or a dirty slut.\" She said, as she pinched Megan's cheeks, who let out a short yelp in surprise and pain.<br>\r\n\"Thank you, mistress.\" Megan meekly replied, sitting on her knees, still on Amy's bush, still avoiding looking at her.<br>\r\nAmy smiled at the thoughts and feelings that were no doubt going through her sister's head.<br>\r\nWith little ceremony, and as sudden as she could muster, she got up, causing Megan to fall and crash into the couch.<br>\r\nShe gathered her clothes, and Megan's too, for good measure.<br>\r\n\"Later, slave girl.\" she said, lightly sniggering, as she left her sis- no, plaything, behind, and started moving towards the stairs.<br>\r\n<br>\r\nMegan got up. \"W-wait!\" but she was ignored.<br>\r\nShe got up, or rather, dropped down, from the couch, and attempted to keep up with Amy.<br>\r\nEven with her shrunken strides, she could almost keep up with the casual stroll her sister had put up.<br>\r\nUntil she got to the stairs.<br>\r\nEach step reached up to her knees, and she couldn't even hope to reach the railing at this size, and climbing a the same speed as Amy walking was nothing but wishful thinking.<br>\r\nBy the time Megan got to the second floor landing, Amy had already reached her room on the third.<br>\r\nStopping to catch her breath, she pushed through and started to climb the next flight of stairs.<br>\r\nAmy's door was open, and she ran as fast as her tired legs could carry, fearing Amy would close the door at any moment, dreading she would close it in her face for laughs.<br>\r\nShe didn't, and as she reached the door frame, she could see Amy had already had time to put on a nightshirt, sitting on her bed, fiddling with her phone.<br>\r\n\"You followed me. I don't remember telling you to follow, -\" She said, turning to the 16 inch woman. \"- but now you're here, come over.\" She pointed at the floor, right next to her bed.<br>\r\nMegan gulped, and started to approach the 20-something foot girl, and as she reached her, a hand descended upon her.<br>\r\n\"Shrink.\"<br>\r\nThe world expanded as Megan shrunk to 4\" tall, still held in Amy's hand.<br>\r\nThe grip adjusted, and Megan was held high and tightly, her breasts resting on Amy's fingers, as she was drawn closer to her face, and made to face the camera of Amy's phone.<br>\r\nThe image of Amy pulling a duckface, holding helpless little Megan not an inch away from her face, greeted her, as Amy made a selfie.<br>\r\nA selfie celebrating Amy's domination of her not-so-big sister.<br>\r\nShe was dropped, right next to Amy's hips, as the now 80 foot tween returned to her phone.<br>\r\n\"Now then.\" Amy said, putting the phone on her nightstand, now looking down at Megan. \"What brings you here, togygirl?\"<br>\r\nMegan was lifted up again, but was allowed to sit down on Amy's open palm this time, faced with her sister's titanic face.</span></div></div>",
            "created":1578786420,
            "id":2772436,
            "title":"Pleasing Amy"
        },
        "12423212":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Sit on her face",
                "Return the favour"
            ],
            "content":"<div class=\"\"><div> <span>“I like, no, love being your toy.”<br>\r\n<br>\r\nAmy just smirked down at her. “Well of course you do. I’m cute as fuck.”<br>\r\n<br>\r\nMegan just forced a smile. Since when was the brat so cocky? <br>\r\n<br>\r\n“I wouldn’t have it any different, ‘little’ sis.” Amy winked, cupping Megan into her hands. “And you know what, you’ve been a good girl tonight, so grow.”<br>\r\n<br>\r\nA sudden jolt burst through Megan’s body as the world around her crunched inwards. The process happened twice more, and Amy’s hands were reduced from boats, to turtle shells, to those novelty foam hands you got at football games.<br>\r\n<br>\r\n“Err... I’m still tiny?” Megan said.<br>\r\n<br>\r\n“Oh, is someone ungrateful?” Amy narrowed her eyes. “Sounds like a little sister could do with some more sh-“<br>\r\n“-no!” Megan interrupted. “This size is good!”<br>\r\n“That’s more like it.” Amy said. “Now, if there aren’t any issues with your current size?”<br>\r\n<br>\r\nMegan just sat there in confusion as her big little sister - now only twice her size, more or less - decided to</span></div></div>",
            "created":1602361320,
            "id":2918684,
            "title":"A night with Amy"
        },
        "124232122":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Meeting Amy’s girlfriend ",
                "Experimenting with Amy."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Megan’s world was taken out of her hands one again as her little sister lifted her up into the air. Floating there, naked and confused, with enormous hands around her waist, the shock was only doubled when cute little Amy sunk her face in between her thighs. <br>\r\n<br>\r\nMegan let out an almighty yelp as her little sister’s tongue squirmed into her pussy, practically engulfing her middle and slurping her juices up.<br>\r\n<br>\r\n“Nnf!” Megan gasped, flailing about on top of Amy’s face. “Wh-where’d you learn this?! And why’re you so good at it?!”<br>\r\n<br>\r\nAmy’s tongue curled around Megan’s crotch. “You’re not the only one with secrets, little sis. Mine happens to be a girlfriend, and trust me, she’ll <i>love</i> to meet you.”<br>\r\n<br>\r\n“Girlfriend?!” Megan gasped. Amy was full of surprises today. Secret dominatrix, has a girlfriend, doesn’t care about that weird boundary between sisters...<br>\r\n<br>\r\nAmy’s tongue continued to control Megan, slurping away at her insides and forcing the loudest orgasm out of her. Megan collapsed forwards onto her little sister’s face, puffing and panting. Amy simply pulled her off and lowered her down, hugging the smaller girl against her chest.<br>\r\n<br>\r\n“For being a good girl.” She squeezed her sister. “And as long as you stay a good girl, we can try out all the things. Got it?”<br>\r\n<br>\r\nMegan frowned. Squashed between her ‘little’ sister’s tiny yet huge boobs, she nodded.<br>\r\n<br>\r\n“I’d like that.”<br>\r\n<br>\r\nLimbs wrapped around each other and pleasantly exhausted, the two sisters dozed off.<br>\r\n<br>\r\nThe next morning...</span></div></div>",
            "created":1602366300,
            "id":2918704,
            "title":"Return the favour"
        },
        "1242321222":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Amy moved, trapping her",
                "Amy sat on her"
            ],
            "content":"<div class=\"\"><div> <span>Megan was first to wake the next morning. With an entire face full of her sister’s left tit, it was inevitable. Amy’s grip had loosened overnight, and while one leg was stretching across her body, there was just enough space for her to wriggle out.<br>\r\n<br>\r\nA few minutes of freedom? Space away from this sweltering nightmare?<br>\r\n<br>\r\nIt was better than just laying there. Dragging herself downwards with coordinated work between her elbows and feet, she crabbed her way slowly lower, sinking beneath Amy’s belly button and meeting at the apex of her thighs. <br>\r\n<br>\r\nOf all things, she had to be grateful her sister wore panties in bed. Scooching under the tiny gap between her legs was unpleasant enough as it was. Her boobs were tickling fabric, which was preferable to pussy, by any standards.<br>\r\n<br>\r\nMegan took in a breath and inched her way underneath Amy’s crotch, slowly but surely passing underneath the tween’s panties. Every movement was an inch closer to freedom. Sure, she was still stuck at this size, but at least then she’d be able to move around, maybe relax a bit. Whatever the weird agreement they made last night was, surely she didn’t have to commit to it all the time? They were allowed to just be sisters, right?<br>\r\n<br>\r\nHer shoulders squeezed through the gap under Amy. It was just her head to go. The vast stretch of white panties spread out above her, and she could taste the fresh air.</span></div></div>",
            "created":1602965700,
            "id":2923520,
            "title":"Experimenting with Amy."
        },
        "12423212222":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Grow her",
                "Shrink her "
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, the weight shifted, and Amy’s crotch slammed down on top of her, pinning her into the bed. Megan struggled for breath as her little sister slowly brought herself into a sitting position, finally noticing her squashed against her panties.<br>\r\n<br>\r\n“...huh. Interesting start to the morning.” She yawned. You trying to escape, Meegs?”<br>\r\n<br>\r\n“No!” Megan gasped. “I was just trying to get some fresh air! Spending all night with your tit in my face wasn’t fun...!”<br>\r\n<br>\r\n“That so...?” Amy mused. “Well in that case, I guess it’s time for our first experiment then!”<br>\r\n<br>\r\nThe blood drained out of Megan’s face. Just what was she planning on doing?<br>\r\n<br>\r\nAmy smirked, and decided to</span></div></div>",
            "created":1603877520,
            "id":2930403,
            "title":"Amy sat on her"
        },
        "124232122222":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Try to grow Megan while she was inside her",
                "Get dressed and go downstairs "
            ],
            "content":"<div class=\"\"><div> <span>“Shrink.”<br>\r\n“Shrink.”<br>\r\n<br>\r\nSuddenly Amy’s weight slipped away from her as the girl above her grew to titanic heights. The veil of white panties surrounding her were now a towering wall, and her thighs were like fleshy redwood trunks.<br>\r\n<br>\r\n“Huh. So you moved away when you shrunk. That’s interesting.” Amy said. “Ah well. Makes this bit easier.”<br>\r\n<br>\r\nShe cupped a hand behind Megan, now just a few inches tall, and pulled her panties aside with the other.<br>\r\n<br>\r\n“No no! No no wait!” Megan cried, but was powerless to stop her little sister from slotting her into her sex. Squashed between Amy’s lips and straight into the heat of her pussy, she was swallowed right up to the neck with ease. <br>\r\n<br>\r\nMegan cried out, flailing amidst her sticky pink situation, but then an enormous index finger pushed against her head, submerging her fully.<br>\r\n<br>\r\n“Ng! Ohh yeah...!” Amy twitched, feeling her big sister inside of her. “I think I’ve found where you belong, Meegs.”<br>\r\n<br>\r\nAmy then decided to...</span></div></div>",
            "created":1603878600,
            "id":2930411,
            "title":"Shrink her "
        },
        "1242322":{
            "author_id":"shrunkenlesbo",
            "author_name":"TheEvilOnion",
            "choices":[
                "Changed her size again.",
                "Started forcing her finger inside!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh? So you're not gonna choose?\"<br>\r\n<br>\r\nQuaking with fear, Megan slowly looked up, scaling her sister's gigantic frame. From her cotton blue panties, to her fully clad upper half, to the devilish grin that was spreading upon her face, she was completely and utterly intimidating at this size.<br>\r\n<br>\r\n\"Good. I like it this way!\"<br>\r\n<br>\r\nWithout so much as a warning, the panties were pulled forward, and Megan was crammed beneath the fabric head first.<br>\r\n<br>\r\nHer face was immediately ground into her sister's young pubescence, where a tiny tuft of hair atop her mound was the vaguest of signs that she had even started puberty. That was all water under the bridge now however, as the giant preteen was attempting to force Megan's head inside of her. The girl's curtain like labia were threatening to swallow her face, and breathing was a luxury she could scarcely afford right now.<br>\r\n<br>\r\nShe thrashed her limbs for all she was worth, but her efforts were completely in vain, due to Amy's far superior strength. With a face full of giant pussy, and her body pinned by a giant hand, things weren't looking great for Megan.<br>\r\n<br>\r\nThey only got worse, however, when Amy...</span></div></div>",
            "created":1456290000,
            "id":2108958,
            "title":"Did nothing. Amy will have to force her."
        },
        "13":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Later on that day...",
                "The next day..."
            ],
            "content":"<div class=\"\"><div> <span>One fine day, Megan accidentally ate the last piece of butterscotch pie from the fridge. \"Megan, did you eat the pie?\" asked her mother, \"No\" replied Megan. It wasn't until she passed the mirror later that day that she noticed that she was a few centimetres shorter...</span></div></div>",
            "created":1463821500,
            "id":2151420,
            "title":"Lying"
        },
        "131":{
            "author_id":"aretesong",
            "author_name":"AreteSongstress",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>== Side note. Megan's original height is going to be 5'11 and Selena(Sister) is going to be 4'8 why? Because I wrote this chapter so it's my call. ==<br>\r\n<br>\r\nMegan was going about her usual business when she caught a side glance of herself in the mirror. \"Huh\" she remarked. \"I thought the neck of this shirt was tighter\" the reason for this was that she had shrunk an inch earlier, bringing her total height to 5'10. She shrugged it off, atoning the change to the shirt being a bit worn. <br>\r\n<br>\r\nLater, Megan was sitting in her room scrolling through FaceBook when her sister came in \"Megan? Could we play?\" Megan replied \"No, I'm really busy right now and don't have time\". \"Okay\" Selena replied. As she left Megan shrank another inch for her dishonesty, bringing her to 5'9.<br>\r\n<br>\r\nThat night as she slept, the lie replayed in her mind. Does it make her shrink?</span></div></div>",
            "created":1490556360,
            "id":2295139,
            "title":"Later on that day..."
        },
        "1311":{
            "author_id":"demwrite",
            "author_name":"Demetri",
            "choices":[
                "9 inches",
                "1 foot",
                "5 feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megan was dreaming of the lie over and over again but how many times is the question </span></div></span></div>",
            "created":1584129540,
            "id":2801028,
            "title":"Yes"
        },
        "15":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "When Megan's aroused or when she's having sex",
                "A curse",
                "Another character can control Megan's height with their thoughts  ",
                "Fear",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices:</span></div></span></div>",
            "created":1225170000,
            "id":601011,
            "title":"More Choices"
        },
        "151":{
            "author_id":"zerx45",
            "author_name":"sedf",
            "choices":[
                "sex",
                "arousal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does she shrink due to arousal or sex</span></div></span></div>",
            "created":1259643600,
            "id":800014,
            "title":"When Megan's aroused or when she's havi..."
        },
        "1512":{
            "author_id":"zsderr",
            "author_name":"kenny",
            "choices":[
                "Megan goes to her boyfriend house ",
                "Megan goes home",
                "Megan goes to the mall"
            ],
            "content":"<div class=\"\"><div> <span>The doctor explained to Megan that the formula is activated by arousal when she is arouse she will shrink down to two feet. Megan couldn't believe it at first she was scared and excited at the same time she ask the doctor can we test it right now the doctor say yes but I will have to documented with the camera to show the results of the formula I will block out you face to hide you identity. Megan asked how can I get arouse with a camera watching me it is no way I am going to masturbate in front of you even if my face is block out, the doctor had the perfect item vibrating panties that doctor can control them with remote control the doctor gave them to Megan she went behind the curtain to change her panties she ask the doctor should she keep her street clothes on or put on a changing gown the doctor told her to keep her street clothes on it was good thing she wore her dress today it was black and tight fitting showing her curvy figure show wore a white blouse that showed her firm breast and her high heel shoes with black stockings she was ready now the doctor told her to stand next to the wall and he mark her height at five feet five. The doctor says this is test subject one Megan age twenty formula five causing shrinking when subject is aroused we are using vibrating panties to stimulate the subject the doctor ask Megan are you ready Megan nervously replied yes the doctor hit the button Megan bite her lip the panties was at the right spot right at her clitoris it was swelling she could feel herself becoming wet her stockings was filling up she felt funny a little dizzy the pleasure she felt between her legs she didn't notice that she was shrinking her white blouse was loosening it no longer fit her firm breast she look down she could see her toes shrinking back in her shoes her dress no longer fitted her hips she was holding them in her hand she was getting smaller by the minute she kicks her shoes away her stockings and panties around her ankles her shirt is now covering her nakedness her bra has unbuckled and fell to the floor only thing left is her blouse that looks like a dress now Megan thought will she shrink away to nothing now the shirt has covered she scrambles to get from under her shirt Megan stands now at two feet</span></div></div>",
            "created":1351746000,
            "id":1457678,
            "title":"arousal"
        },
        "152":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "A random witch",
                "her sister",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who curses her?</span></div></span></div>",
            "created":1463720400,
            "id":2151104,
            "title":"A curse"
        },
        "1522":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Whenever Susan wanted",
                "When Megan lied",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Megan had just gotten home after passing her first semester in college was enjoying her time with her parents and friends that were in town. It had been months since she last saw them and while at times she hated them for certain things, she loved them very dearly. Her younger sister Susan however...was another story.<br>\r\nHer sister was a very strange girl, at times she would seem like any other girl but, the girl was into strange stuff. Before she left, She caught Susan reading a book on spells and chanting over something. Her parents did try to stop such strange behavior but it would seem that they gave up after Megan left as she noticed Susan has amassed more strange books overtime. While she did try to spend time with her sister as well as her parents, the black haired twelve year old would barely say anything to her or they would just argue. Megan sighed as she straightened her long brown hair while thinking about her sister, Susan was younger she was more outgoing and social as well but that changed when she made friends with those older kids and slowly the adorable younger sister changed into a spiteful young girl.<br>\r\nShe was really surprised however when her parents left her to watch her younger sister while they took care of their grandfather who was just recovering for surgery and needed help around the house for a few days. Megan was confused as she knew that their grandfather died several years ago when she was still a sophomore in high school. Perhaps her parents wanted a break from the antics of her younger sister? Changing into a pair of blue jeans and a white shirt, she heard her younger sister chanting in a strange language, almost sounded like her professor in her Latin classes but the language seemed off...<br>\r\nIt was no matter though, she would only watch Susan and stay out of her way of her hobbies. heading down to the kitchen of her parents house she found a unwelcomed surprised. It would seem that her sister had made breakfast for her and her favorite at that, Eggs, bacon, toast, and a glass of orange juice. Is Susan trying to get on her good side or something? Perhaps she was still cared for her deep inside after all? With a smile, Megan took up a fork begun to eat her breakfast.<br>\r\nMegan heard a door opening as Susan came to the kitchen as well. Her sister seemed to have grown a little now that she noticed that she no longer had to stand o her tip toes to reach the cereal on the higher shelves. That would make her sister almost 5'  coming closer to her 5 \"8. Susan used to wear bright colors but now she wore a dark t-shirt with grey jeans. Sometimes she would wear other colors like red but they were all dark colors. Megan missed that sister but perhaps this one was not so bad?<br>\r\n\"Did you make this breakfast for me?\" Megan asked as her sister as sat on the other side of the family dining table.<br>\r\n\"Yes....do you like it?\" Susan replied back.<br>\r\n\"Yes,\" Megan said after eating the last bite of bacon and started to work on the eggs and toast. \"But why didn't you make some for yourself?\"<br>\r\n\"I'm a vegan remember? I can barely stand watching you eat that meat.\" As Susan began to eat her cereal.<br>\r\n\"I...see. What were doing in your room, a curse of some kind?\"<br>\r\n\"No a good luck charm that will keep mom and dad safe on the road. Why do you think I was doing something bad?\"<br>\r\n\"I'm sorry but-\"<br>\r\n\"Fine I'll eat upstairs.\" without listening to Megan, Susan huffed and went back to her room, slamming her door. With a sigh, Megan finished her breakfast.<br>\r\nUnknowing to Megan though Susan did create a curse, a curse for a big sister in fact that made her shrink or grow....</span></div></div>",
            "created":1463720400,
            "id":2151130,
            "title":"her sister"
        },
        "15223":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about if she fluctuates she shrinks but if she burps she grows?</span></div></span></div>",
            "created":1463720400,
            "id":2151133,
            "title":"Other"
        },
        "152231":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Random",
                "Cartain rate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Megan's shrinking or growing random or is at a certain rate?</span></div></span></div>",
            "created":1463804160,
            "id":2151351,
            "title":"Yes"
        },
        "1522311":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "To take her sister out.",
                "A date."
            ],
            "content":"<div class=\"\"><div> <span>After washing her dishes, Megan's stomach cramped and made a large gurgling sound.<br>\r\n\"What wrong with me?\" Megan manage to get out before a blast of air leaves her rump. Her face immeaditealy truns red at what she had un willing just done and lokked around around to see if anyone was there to witness that mainly her sister. Unknownly though, megan failed to notice the few inches she lost leaving her at 5' 6\"<br>\r\nSeeing that no one was around, Megan sighed with relief as she made preparations for-</span></div></div>",
            "created":1463927880,
            "id":2152014,
            "title":"Loose air"
        },
        "15223111":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "holding a strange doll",
                "reading a \"intresting\" book"
            ],
            "content":"<div class=\"\"><div> <span>Megan made mental preparation in order to take her sister out. While she id love her sister dearly, she knew that they both had nothing in common. A successful college  student that never failed a test and hardly ever partied except when certain men of course invited her to a twelve year old girl who hated being at school an most people in general. But she did want to at least try to understand Susan that much she wanted to do. Megan walked to her sister room noticing that she had a bit more wiggle room for her toes due to being slightly shorter but thought of it nothing more then her shoes being slightly stretched out due to the use they always get. They have been with her since her senior year in high school after all.<br>\r\nKnocking on her sister door Megan called out to Susan who was inside the room,\" Hey sis, can I come in I want to talk to you about something.\"<br>\r\n\".....come in\" Susan replied robotically as if not caring the door was knocked on or that her sister was coming into her room.<br>\r\nMegan came inside only to find Susan sitting on the bed-</span></div></div>",
            "created":1464061920,
            "id":2152879,
            "title":"To take her sister out."
        },
        "152231111":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "It looked a lot like Megan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did the doll look like?</span></div></span></div>",
            "created":1471623300,
            "id":2198195,
            "title":"holding a strange doll"
        },
        "1522311111":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Megan and Susan leaves the house.",
                "Susan decides to give the doll a good squeeze"
            ],
            "content":"<div class=\"\"><div> <span>Everything to the hair to the eyes to even the removable clothes to even the skin tone. It looked almost exactly like a plushy her. It was not very big fitting perfectly in her sister's hand. While it did creep her out perhaps Susan made in order to.....honestly she cannot think of why Susan would make a doll that looked like her but it is what it is.<br>\r\n<br>\r\n\"Hey sis are you all ready to go?\" Megan asks as she observes her sister's room. Not much has changed. It's a bit cleaner due to her mother pushing Susan to keep it clean but sewing material is all over the place along with various finished and half finished stuffed objects are all over the place.<br>\r\n<br>\r\n\"Almost I suppose.\" Her sister gives the doll that looks just like her a light squeeze. As she does so, Megan feels her stomach gurgle once more. Susan gives a satisfied smirk as she hears a faint squeaking sound coming from Megan's behind as she blushes just the slightest, most likely trying not to embarrass herself in front of her weird sister. The change in height is barely noticeable unless you’re watching for the changes like the few slight wrinkles being added to Megan's shirt or the way the jeans seems a bit looser. <i>\"The curse....it actually works!\"<br>\r\n</i><br>\r\nOutside her thoughts Susan plays it calm, playing the fool, \" Sis, did you hear something?\"<br>\r\n<br>\r\n\"Uh,\" Megan seems flabbergasted as she unconsciously plays with her jeans.\" No, I heard nothing.\"<br>\r\n<br>\r\n\"Huh, it must have been the wind outside or something then.\" Susan shrugs secrtly enjoying her big sister's blushing face. \"Well let’s get going okay.\"<br>\r\n</span></div></div>",
            "created":1525626360,
            "id":2489203,
            "title":"It looked a lot like Megan"
        },
        "153":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "Megan's mother",
                "Megan's younger sister",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which character can control it?</span></div></span></div>",
            "created":1225170000,
            "id":601006,
            "title":"Another character can control Megan's heigh..."
        },
        "1532":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "...Ashley's room",
                "...Megan's room",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>The sunlight was slowly streaming along Megan Thompson's bedroom floor when her alarm clock went off, bringing her out of her peaceful slumber.  She hit the Snooze button before covering her head with her pillow.  Oh, how she wanted to sleep in just a little bit longer, but she had a lot to do today.<br>\r\n<br>\r\nMegan got out of bed and stood up, looking at herself in her bedroom mirror.  She sighed.  She was still a few inches shorter than she was yesterday, thanks to her 12 year-old sister, Ashley...<br>\r\n<br>\r\n****************************<br>\r\n<br>\r\nEver since Ashley was a little kid, she had the ability to control her sister's height with her mind.  She could either shrink her or make her grow, though she usually chose the former.  Megan usually didn't mind, as long as no one saw her shrink.  Fortunately for her, however, Ashley chose to shrink her older sister inside the house, primarily so the 12 year-old could have someone to play with.<br>\r\n<br>\r\n*****************************<br>\r\n<br>\r\nMegan put on one of her favorite shirts, a dark blue t-shirt she had bought at Old Navy and she immediately noticed how loose it felt on her, especially around the shoulders.  If she had to guess, Megan would say she was around 5'1,\" instead of her usual 5'5.\"<br>\r\n<br>\r\nMegan walked downstairs and entered the kitchen.  Her sister was sitting at the kitchen table, having a bowl of cereal; her mother had already left for work.  The 20 year-old decided to have cereal for breakfast, too.<br>\r\n<br>\r\nShe went to get a bowl, noticing the cabinets were a little higher than usual, obviously due to her 4-inch reduction in height.  The bowls were kept on the highest shelf, meaning Megan had to stand on the tips of her toes just to reach them.  Just as she was about to get one down, however, she could feel herself shrinking again.  It didn't last long; probably only 30 seconds or so.  Still, Megan assumed she had shrank another 4 inches or so.<br>\r\n<br>\r\n\"Why did you do that?\"  she snapped at her younger sister, turning around as she did so.  \"I don't have time for this today.\"<br>\r\n<br>\r\nAshley smiled confidently as she stood up and walked over to Megan.  Both girls noticed that they were roughly the same height.  <br>\r\n<br>\r\n\"Because it's fun,\" the younger sibling replied, causing Megan to shrink another 2 inches for emphasis.  \"See?\"<br>\r\n<br>\r\nMegan readjusted her shirt, noticing that the sleeves went halfway up her arm now.  She looked up at her younger sister, sighing in frustration.  <br>\r\n<br>\r\n\"What do you want to do?\"  Megan asked.<br>\r\n<br>\r\n\"Follow me.  I'll show you.\"  The 20 year old stood her ground, shaking her head no and crossing her arms, the first time she had stood up to Ashley in a long time.  Because of her defiance, Megan shrank again, now only coming up to Ashley's nose.  <br>\r\n<br>\r\n\"What about now?\" Ashley asked, smiling down at her sister.  <br>\r\n<br>\r\n\"That depends,\" Megan replied.  \"Are you going to shrink me every time I tell you no?\"<br>\r\n<br>\r\nAshley thought for a moment.  \"Yeah, pretty much.\"  She held out her hand.  \"Shall we?\"<br>\r\n<br>\r\n\"Fine,\" Megan replied bitterly, taking Ashley's hand and walking beside her much taller younger sister.<br>\r\n<br>\r\nThe two girls go to...</span></div></div>",
            "created":1226379600,
            "id":606588,
            "title":"Megan's younger sister"
        },
        "15321":{
            "choices":[
                "Ashley's friend's house.",
                "The playground."
            ],
            "content":"<div class=\"\"><div> <span>Ashley leads Megan into her room. Ashley goes over to her drawer and begins rifling through her clothes. Megan examines herself in Ashley's mirror. Her shirt hung low on her, like a dress. She had to be about 4' 5'' now. <br>\r\n<br>\r\n\"I don't know what you have in mind, but I don't think I'm fitting into any of your clothes.. unless you make me a little bigger.\" Megan said.<br>\r\n<br>\r\n\"Oh, don't worry, I'm looking for clothes that don't fit anymore.\" Ashley replied.<br>\r\n<br>\r\n\"Hey, remember when I said I had a lot to do today?\" Megan said, crossing her arms.<br>\r\n<br>\r\n\"Come on, you do nothing but sit around all day.\" Ashley pulled out a T-Shirt with Unicorns all over it. She shook her head and put it back.<br>\r\n<br>\r\n\"I promised mom that I'd find some job applications today. She's been after me for weeks to get a job.\" <br>\r\n<br>\r\n\"Well, you can totally do that tomorrow, today I really need your help with something.\" <br>\r\n<br>\r\n\"With what?\" <br>\r\n<br>\r\n\"You'll see...\" Ashley pulls out a plain blue T-shirt and shorts. \"Perfect, just like what you're wearing now.\"<br>\r\n<br>\r\nAshley walks over to Megan and hands her tiny big sister the clothes.<br>\r\n<br>\r\n\"Please help me out, sis?\" Ashley gave Megan a big set of puppy dog eyes. Megan sighs and grabs the clothes from her sister.<br>\r\n<br>\r\n\"Fine. You want me to change into these?\" Megan asked. Ashley nods, excitedly.<br>\r\n<br>\r\n\"Well don't look.\"  Ashley nods and turns around.<br>\r\n<br>\r\nMegan slips easily out of her over-sized clothes. She squeezes into the new outfit provided by her kid sister. Her breasts are practically popping out of the shirt, and her ass is hanging out of the shorts. <br>\r\n<br>\r\n\"A little tight?\" Megan wheezes.<br>\r\n<br>\r\n\"No problem\" Ashley smiles. Megan felt the clothes grow looser, and more fitting. The feeling stopped a few moments later and she found herself looking up at her kid sister who was now a head taller than her. She was just under 4 feet tall now.<br>\r\n<br>\r\n\"These are too big for me now!\" Megan growled.<br>\r\n<br>\r\n\"It looks fine! Come on!\" Ashley grabbed Megan's little hand and pulled her out of the room. <br>\r\n<br>\r\n\"Hey, where are we going!? You aren't taking me outside like this are you?\" Megan squeaked.<br>\r\n<br>\r\n\"Who's going to recognize you? Come on!\" Ashley tugged at Megan. Megan resists.  \"Oh come on. I promise that this will be fun!\" <br>\r\n<br>\r\nMegan thinks over what her sister possibly could have in store.<br>\r\n<br>\r\n\"I'll give you some of the money I have saved up from baby-sitting?\" <br>\r\n<br>\r\nMegan still seems unsure.<br>\r\n<br>\r\n\"And I wont shrink you again for a whole month!\" Ashley added.<br>\r\n<br>\r\nMegan sighed. \"Fine... Just promise that whatever you have in mind, you wont embarrass me.\"<br>\r\n<br>\r\n\"Promise.\" Ashley crosses her fingers on her right hand. \"Hmmm... looks like you could use another little spurt.\" <br>\r\n<br>\r\nMegan dwindles another inch, leaving her at 3 foot 10. <br>\r\n<br>\r\n\"Perfect! Let's go, 'lil' sis!\"<br>\r\n<br>\r\nMegan and Ashley leave the house, and go to...</span></div></div>",
            "created":1226466000,
            "id":606897,
            "title":"...Ashley's room"
        },
        "153211":{
            "choices":[
                "playing dolls with Ashley and Kerri",
                "no, we have to get back home"
            ],
            "content":"<div class=\"\"><div> <span> Ashley's friend Kerri's house. Kerri is the same age as Ashley, and she also has a sixteen year old brother (David). Megan realizes where her sister is headed and starts to protest.  We can't go over to Kerri's house Ashley, I don't want your friend to see me like this. I was talking to her a couple of days ago and was teasing her a little bit about a boy she likes. Don't worry about it Meg, Ashley says as she turns to face Megan,holding her hand. Once again Megan starts to get a little light headed as she sees Ashley start to grow,but realizes Ashley isn't growing, she is shrinking her again. When it stops she realizes she is staring into her younger sisters tummy.  She slowly raises her head and is feeling more embarassed at how small she is to her younger sister, who is turning into an amazon compared to her. What are you doing, you've never made me this small before.  We' ll tell Kerri your my little cousin, Ashley winks to Megan. Looking past Ashley, Megan sees Kerri coming up behind her. To her dismay Kerri is even taller than Ashley. Hi Ashley ! Kerri says. Whose your little friend ? She's my little cousin..Melissa! Feeling very intimidated by the amazonian teens Megan simply says hi!, while keeping her head down, not wanting to be recognized.  She looks awful familiar to me Kerri says. Kneeling down to get a closer look, she places her finger under Megans chin and lifts her face up. In an instant a wide grin forms on Kerri's face, Megan! she exclaims, what happened, how did you get so small she says as she looks her up and down.  Feeling intimidated Megan slowly backs up to Ashley and find herself looking up to her younger sister to answer, all the while feeling very submissive about it. I did it Ashley responds. That is so cool Ash! Kerri says. How did you do it? I can't tell you out here.  Then why don't we bring her up to my room and you can tell me about it, and while we're at it we can play dolls with little Megan, Keri says..</span></div></div>",
            "created":1233032400,
            "id":639342,
            "title":"Ashley's friend's house."
        },
        "1532112":{
            "choices":[
                "Around 1/2\" to 3\"",
                "Around 6\" to 12\""
            ],
            "content":"<div class=\"\"><div> <span>While walking back, in Ashley's mind, i wonder just how small i can make her, i've never had Megan this small before, i'd like to see how much more i can go with her, while Ashley is day dreaming she looks at Megan with a mischievous smirk. What you thinkin Ashley, Oh, Don't worry nothing much Ashleys says, Well as soon as we get back can you restore my height to normal?! i would like to go out, megan said, Yeah sure what ever Ashley said, Oi can you open the Ash, i can't reach ! As they step through the door, Megan come on lets go upstairs (giggle) and put you right (giggle) when they reach the room what size does Ashley try</span></div></div>",
            "created":1234328400,
            "id":645667,
            "title":"no, we have to get back home"
        },
        "15321122":{
            "choices":[
                "spa night-paint the nails..",
                "watch a movie"
            ],
            "content":"<div class=\"\"><div> <span>Hold still Megan, Ashley says. Putting her finger under her older sister's smaller chin, she looks into her eyes. Megan finds herself getting lost in Ashley's gaze as her body starts to get that familiar tingling sensation. \"Your making me bigger aren't you Ashley\", she nervously asks? Ashley just nods while slowly kneeling down to confuse her sister.  It takes a minute or two before Megan comes out of her confusion and realizes her sister's face is getting bigger, and bigger. \"What are you doing Ash ?\", Shhh, Ashley says as she puts her index finger on Megans shrinking mouth.  \" I've decided my newest toy is staying home with me tonight\".  Megan can only stare speechless as her younger sisters face gets larger and farther away. Ashley has never made her this small before, her younger sister is becoming a giantess. When the shrinking stopped, Megan couldn't believe how big  Ashley was to her now. Megan looked down at her feet in embarrassment, she didn't know what to say or do, it felt humiliating to her to be made so small by her formely little sister. \"Wow, look at how little you are now dollie\", Ashley said. Then,before Megan could react she felt Ashleys hand wrap around her waist. She couldn't believe her sister was carrying her in her hand. Ashely set Megan down on her dresser, and told her to stay put. Megan didn't move. When Ashley came back she said, \" Alright little Megan, stand straight up next to the ruler \". She stood next to the ruler and felt her sisters giant fingertip on the top of her head. Exactly eight inches Ashley said proudly. You could be Barbies little sister now.  Since I'm the one in charge now, what do I want to do Ashley says. Do I want to watch a movie, or make it a spa night, and have my newest little pet paint my finges and toes?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n'</span></div></div>",
            "created":1236315600,
            "id":656660,
            "title":"Ashley in charge"
        },
        "153211222":{
            "author_id":"metaru",
            "author_name":"Metarusonicu",
            "choices":[
                "Ashley returns after the movie. She's in a playful mood.",
                "Ashely returns the next morning. "
            ],
            "content":"<div class=\"\"><div> <span>\"I'm gonna watch a movie, and I want my brand new dollie to come with.\" Ashley said in a cheerful voice as she reached for you again. Having had enough of her childish pranks... you slap away at her hand, \"Leave me alone you giant brat! I don't want to watch some movie. I want you to make me big again!\" Though, your yelling and slapping did more harm to the child then you thought, as tears started to well up in her eyes. What worried you... was when those eyes full of tears dried, and when sorrow turned to rage.<br>\r\n<br>\r\n\"I'm not a brat! You're a horrible sister!!\" and with that, Ashley grabbed you by the waist, tight, and focused on you, \"I'm going to make you so small, you'll know how horrible a sister you are!\" <br>\r\n<br>\r\nUh oh...<br>\r\n<br>\r\nHer stare was intense, and you felt yourself getting dizzy under her glare. Though, her hand started to get bigger around you, and that's when you started to panic. \"Ashley! I... I'm sorry! I'll watch any movie you want!\" but she kept staring at you. Soon your head was all that was poking above her hand, and then you were completely held in her hand, and still you felt yourself getting smaller and smaller... you felt Ashley move to somewhere new, and you heard her moving some things around, but you couldn't see. Only when she opened her hand did you see, and were you terrified. <br>\r\n<br>\r\nShe was enormous. You weren't really sure how tiny you were, and Ashley didn't seem intent on telling you. \"You're going to spend some time in time out until you learn how good of a sister I am, and how you should be nicer to me. See you in the morning, tiny little sister.\" She then plucked you up and dropped you in a cage... a plastic cage. You look around, and nearly scream.<br>\r\n<br>\r\nLooking at you from the corner was a very young infant doll, about two inches tall, which towered over you. All around you you saw you were in some form of doll baby crib, and all around the crib you saw nothing but various Barbie dolls, with some dolls of Barbie's little sister, all arranged to surround the pen, all arranged to be looking into the pen, perhaps it was just a trick of the eye that they all seemed to be following her. She backed away, looking everywhere.... she had to be smaller then an inch. These dolls were immense.... </span></div></div>",
            "created":1241931600,
            "id":689227,
            "title":"Defiance..."
        },
        "153212":{
            "choices":[
                "grew Megan a few inches",
                "shrunk megan a few inches"
            ],
            "content":"<div class=\"\"><div> <span>Why the hell are at the playground?\" asked Megan as they passed the swing set megan noticed that she was only a few inches higher than.<br>\r\n\"Well you see all my friends are all busy this week, so I need someone to play with!\" said Ashley \" and since your usually to emmbaressed to play with me I did this!\" pointing at the colthes megan was currently wearing.<br>\r\nAs Ashley sat on swing set Megan realized that she had to hop in order to sit down. when megan was comftable in the swing she asked ashley, \"what happens to me if I don't want to play with you?\" with sneer Ashley </span></div></div>",
            "created":1302584400,
            "id":1086777,
            "title":"The playground."
        },
        "1532121":{
            "choices":[
                "yes I'll play with you",
                "Go to hell"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Megan said as her feet touched the ground from the swing. suddenly she realized why ashley was doing this as it became diffcult to breath for her breast was squeezed by the kid shrit and her ass popped out of the shorts slightly. \" well,\" said ashley\" are you going to play with me?\" finding her words Megan managed to wheeze out..</span></div></div>",
            "created":1303794000,
            "id":1094687,
            "title":"grew Megan a few inches"
        },
        "15321212":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Made Megan OutGrow Her Clothes",
                "Shrank Megan"
            ],
            "content":"<div class=\"\"><div> <span>\"Go to hell.\" Megan wheezed out. Sure she usually had no choice but to go along with her younger sister's orders due to Ashley's power over her overtime. Megan has just gotten tried of being dragged around by a child! She is 20 years old(even if she is 4 feet tall and in children clothes), she shouldn't have to deal with THIS!<br>\r\n\"Wha...?\" Ashley's face went from a sneer to a surprised expression. While Megan has gone against her before she was surprised that her older sister was trying to be forceful.<br>\r\n\"You...heard me..\" Megan shifted uncomfortable on the swing, as if try to get her cruves that were being tightly squeezed in a more comfortable position. \"go to hell.\"<br>\r\nAshley's face became blank for a second before she smiled,<br>\r\n\"Alright sister, then let me give you hell...\"</span></div></div>",
            "created":1460782800,
            "id":2134166,
            "title":"I'm the big sister!"
        },
        "153212121":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Hurry her way home",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright sister,\" Ashley said with a smile. \"I'll give you hell.\"<br>\r\nConfused Megan had no idea what Ashley was talking about till felt herself grow. Perhaps she had finally got thought to Ashley? That line of thought instantly disappeared though when she felt her blue shirt almost spill out her breast and her shorts slowly becoming booty shorts. The white shoes and socks she was wearing were starting to feel tight.<br>\r\n\"What are you doing?\" Megan hissed as her growth seemed neither to slow or stop at 4' 2\".<br>\r\n\"I'm just giving you hell remember?\" Ashley said coldly. \"Don't you want everyone to see the real you?\"<br>\r\nSuddenly Megan realized what she was doing to her. If she continues to grow her will not fit! and in such a crowed place? Megan didn't want to imagine what people at the college dorms or the people here would say if they saw that! She would be nothing of a joke!<br>\r\nThinking this, Megan stood up as the laces on her shoes snapped. She had cross her arms over her chest as her breast threatened to bounce out the shirt.The waistline of her shorts as they slowly revealed more of her butt. All the while Ashley started to giggle at her sister's expense.<br>\r\nThinking fast Megan decided that she had to....<br>\r\n</span></div></div>",
            "created":1460782800,
            "id":2134192,
            "title":"Megan is a growing girlafter all!"
        },
        "1532121211":{
            "author_id":"keefe1993",
            "author_name":"Codx",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Megan make it home before she out grows her clothes?</span></div></span></div>",
            "created":1460955600,
            "id":2135368,
            "title":"Hurry her way home"
        },
        "15323":{
            "author_id":"mreddie",
            "author_name":"mreddie",
            "choices":[
                "play with her litter sister",
                "talk to her crush"
            ],
            "content":"<div class=\"\"><div> <span>The two girls go the living room.<br>\r\n<br>\r\nMegan still angered about Ashley's plans decides to go with the flow. Megan, now 4'5, tells Ashley, \"Okay, what are your plans for today, sis?\" Ashley explains.\" We going to Kerri''s house and you're coming with me.\" Megan hesitates but accepts. Megan is then dragged to Ashley's room to fit some clothes. \"You know, this would be easier if you made me bigger.\" Megan said. \"You're right\" Ashley answered.<br>\r\nMegan felt herself grow however it was only two inches but than shrinking to Megan. Ashley and Megan were the same height. \"Here, try this, this looks cute.\" Ashley commented. It was a sky blue shirt with a guitar and the word \"RockStar\" embedded on it. After she put the outfit on, Megan noticed that breasts popped out of the shirt and her ass popped out of the pants Ashley gave her. \"Ash, this outfit is too big, you sure about this.\" Megan argued. \"Okay, I'll fix it\" Ashley answered. Megan felt the silimar seneration, only shrunk by an inch. Ashley thought she was now the right size since it looks like Megan is a developing 12 year old like herself. \"Those boobs are getting in the way\" Ashley said. \"Boobs?, Where the hell you get that from?\" Megan wondered. \"Um, you, TV, and my classmates.\" Ashley answered.<br>\r\n\"Okay, let's go.\" Ashley said<br>\r\nDuring the trip, Megan looked all around seeing if anyone would reconize her, more notably, her old high school classmates.<br>\r\nMegan then noticed someone, \"Aww shit, it's Christie, let's go, now!\" <br>\r\nAshley wondered \"Wait, slow down, why are we in a hurry?\"<br>\r\n\"That's Christie from my old school, she made fun of me because of my height, because of you.\"<br>\r\n\"But I made you bigger to get her back\"<br>\r\n\"Yeah, but what if she puts two and two together.\"<br>\r\n\"I don't see what's the rush.\"<br>\r\n\"You'll understand when you get to high school.\"<br>\r\nAshley and Megan dashed to Kerri''s house.<br>\r\n\"Okay, you're visting Kerri but I don't see how I'm involved.\" Megan protested.<br>\r\n\"You want to talk Edward don't you\" Ashley said.<br>\r\n\"Wait, all this for Edward, then why the hell you shrank me!\"<br>\r\n\"Because other than Kerri, I have no one to play with tonight.\"<br>\r\n\"Wait, tonight.\"<br>\r\n\"You see I arranged a sleepover and said I would bring a friend but you're the only friend I got and besides after this, I won't shrink you without your permission until otherwise.\"<br>\r\n\"You better.\"<br>\r\n\"Oh, you're name is Melissa, okay.\"<br>\r\nThe door opened. It 's Kerri<br>\r\n\"Hey guys, oh, who's this Ash?\"<br>\r\n\"Her name is Melissa.\"<br>\r\n\"Hi\"<br>\r\n\"Hi, hey, My mom and dad are gone for the week, Ed ordered pizza and were gonna watch a movie, come on\" Kerri said, to in a hurry to notice Megan<br>\r\n\"Alright, let's go Meg...I mean Melissa.\"<br>\r\nMegan, now taking part in her little sister's plans, walks with Ashley but notices Edward playing video games.<br>\r\nMegan thinks about Edward and looks at Ahley and Kerri, fearing that Ash might shrink her <br>\r\nEdward and Megan have been friends for the longest times and Megan thinks she go to him but hesitates and looks at Ashley and Kerri.<br>\r\nChoosing between going with the Ashley's plans and talking to Edward, she decides to go to...</span></div></div>",
            "created":1236574800,
            "id":658413,
            "title":"Somewhere else"
        },
        "153231":{
            "author_id":"mreddie",
            "author_name":"mreddie",
            "choices":[
                "get something to make her feel better",
                "give Megan a few inches back"
            ],
            "content":"<div class=\"\"><div> <span>As much as she wanted to talk to Edward, she decided to \"play\" with Ashley and Kerri. As Megan came up to the girls, she felt herself getting smaller. Megan looked around and saw Ashley behind her.<br>\r\n\"Ash, what the hell!\" Megan shouted<br>\r\n\"Remember, you're supposed to be my friend and I was calling you over here like 20 times.\" Ashley explained<br>\r\n\"Alright, fine, let's play your bullshit dolls and singing crap!\" Megan said angrily<br>\r\nMegan and Ashley walked towards Kerri who was watching The Disney Channel.<br>\r\nAshley heard one of her favorite songs and started singing along with Kerri. \"Come on and sing, Melissa!\" Ashley shouted.<br>\r\n\"This isn't my favorite song, but thanks.\" Megan said. Then Megan felt that similar sensation, she saw the room grow go bigger, her clothes got even looser especially from a shirt meant for a 12 year old. The sleeves got looser, and pants started sagging. Megan looked uncomfortable as Ashley kept shrinking her until she was 4 feet tall. <br>\r\n“Damn it!, this isn’t fair, why did this happen? “Wondered Megan.<br>\r\nMegan remembered that since Ashley was seven, she inherited the power to shrink others. Megan’s family from her 27 year old sister, Ellen to Ashley, everyone had it except Megan. Megan always got shrunk down instead of shrinking others. Megan even lived in Ashley’s dollhouse for almost a month for punishment. Megan was always angry that she never had this power. As she remembered the past, a voice snapped her back to the present.<br>\r\n“Kerri, come over here and look what I can do!” shouted Ashley. Kerri rushed over to see.<br>\r\n“Look at Megan!” Ashley said as Megan lost another 2 inches. “Wait, did you say Megan? Holy Shit!” “Yep” “How did you do that? My family has had this power for some time… <br>\r\n When a knock at the door distracted Ashley, Megan‘s shrinking stopped.<br>\r\n“Kerri, get the door, it’s the pizza!” Edward shouted.<br>\r\n“Aww man!“ Kerri said as she ran to open the door and gave the pizza boy the money and tip, in return, got the pizza.<br>\r\nEdward got out and sat down in the family table, Kerri did as well. Ashley looked for Megan though each room until she found her in the bathroom. Ashley found Megan sobbing listening to some Bowie though her iPod. Her shirt, hanging down, exposing her shoulder and half her breast and her pants sagging, exposing her ruffled panties. Basically, she clothes looked like they were sliding off if not for Megan catching them and keeping them on.<br>\r\nAshley felt guilt-tripped and sighed. “Alright, I’ll do it.” thought Ashley as her mind focused on Megan.<br>\r\n<br>\r\nWhat does Ashley do?<br>\r\n</span></div></div>",
            "created":1236920400,
            "id":660419,
            "title":"play with her litter sister"
        },
        "1532312":{
            "author_id":"vrain",
            "author_name":"Vrain",
            "choices":[
                "Ashley gets angrier at her.",
                "Ashley stops arguing."
            ],
            "content":"<div class=\"\"><div> <span>Megan continued listening to her song, not even noticing her sister, although her eyes opened after she felt herself grow about half a foot.<br>\r\n<br>\r\n\"Are you ok?\" Ashley asked. \"Are you trying to mock me or something...\" Megan replied, not angrily in fear that she would get shrunk again.<br>\r\n\"What do you mean?\" Ashley said confusingly.<br>\r\n\"Lately, youve just been shrinking me for no reason... Just because you can do this doesnt mean you can just do it whenever the hell you want!\"<br>\r\n\"Because your the only one I can do it to! Ellen isnt here anymore, and i dont even wanna try it on mom or dad...\"<br>\r\n<br>\r\n\"Then what makes you think im alright with this!!\" Megan snapped back, getting angrier with every word. Both girls stared at each other for a moment, but the silence broke when Megan noticed Ashley starting to cry. When Megan approached her, she could see that she was barely but a bit taller than her little sister now, \"Sorry, but have YOU every been shrunk? Ellen never did this to you, and ive never seen you try it on yourself.\"<br>\r\n\"Ive tried on myself... It doesnt work!\" She yelled back, starting yet another argument, but Megan was smart enough to walk away instead of pissing her off further.<br>\r\n<br>\r\n\"Just stop for now ok?\" Megan said before stepping out of the room. It wasnt long before </span></div></div>",
            "created":1253768400,
            "id":765476,
            "title":"Few inches bigger"
        },
        "15323122":{
            "author_id":"vrain",
            "author_name":"Vrain",
            "choices":[
                "She shrinks her",
                "She declines"
            ],
            "content":"<div class=\"\"><div> <span>Ashley slowly walked to the table with Kerri and her brother. Not really caring her sister didnt join them.\"<br>\r\n<br>\r\n\"Weres uh... Melissa?\" asked Kerri.<br>\r\n\"Think she went to your room.\"<br>\r\n\"Shes not gonna eat?\"<br>\r\n\"Dont think so...\"<br>\r\n<br>\r\nAfter they finished eating, Ashley and her friend went back to Kerri's room, were Kerri was hurrying to get back on their previous subject. She pointed to Megan who was sitting on her bed, \"Howd you make her so small!?\" Ashley thought for a moment and gave her an answer, \"Like I said, me and my family have had this kind of power.\"<br>\r\n\"Can you make her bigger too?\"<br>\r\nAshley nodded,<br>\r\n\"Can you do it to me too!?\"<br>\r\n\"No, only to family members.\"<br>\r\n\"Awh! That would be so cool though! O yeah we were playing huh!\" she said, turning the subject without noticing.<br>\r\n\"Wait, could you shrink her sister to were she was a doll!?\" she excitingly continued.<br>\r\n<br>\r\nMegan turned her head to Ashley, who was thinking it over...</span></div></div>",
            "created":1253768400,
            "id":765490,
            "title":"Ashley stops arguing."
        },
        "1533":{
            "choices":[
                "Stan, the male friend",
                "William, the family friend",
                "Somebody else entirely"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, how about Stan, a male friend of Megan's who has always had a secret crush on her? Or possibly William, an older friend of the family whom Megan has always considered an \"uncle\" type? Or mayble somebody else entirely?</span></div></span></div>",
            "created":1251954000,
            "id":754783,
            "title":"Someone else"
        },
        "15332":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So \"Uncle\" William, the family friend, can <b>slowly</b> shrink Megan with his mind? Is he aware he has this power?</span></div></span></div>",
            "created":1251954000,
            "id":754784,
            "title":"William, the family friend"
        },
        "153321":{
            "choices":[
                "Megan to stay with William for a month",
                "William to stay with Megan for a month"
            ],
            "content":"<div class=\"\"><div> <span>Science is a wonderful thing, if for no other reason than its so flexible in what it defines and what it embraces.<br>\r\n<br>\r\nA thousand years ago, alchemy was the realm of wizards and madmen. Now it's consider the forerunner of modern chemistry.<br>\r\n<br>\r\nA hundred years ago, it was thought that gravity was instantaneous. Now we know that not only does it travel at the speed of light, but that it behaves differently on different scales and different environment.<br>\r\n<br>\r\nSo it should not come as a shock that there are still some things, in the small unexplored corners of the world, that would be considered impossible and akin to magic, but that perhaps a thousand years from now will be considered very common place, commercialized, categorized and...well, you get the idea.<br>\r\n<br>\r\nSuch was a small spell that William discovered that allowed a man to use his thoughts to shrink his subject down to a mere one-twelfth of their normal size.<br>\r\n<br>\r\nOf course, the laws of conservations would say you couldn't shrink someone down to that size, or if you could, the density of their new size would make the living being quite dead. But the spell reduced the weight of said subject proportionately, without making them superdense, or super frail, or basically unable to interact with the normal sized world.<br>\r\n<br>\r\nThere were some limitations, however. Take a subject who was only five foot four (like Megan, for instance). William could only shrink her three inches in a day, and it would not be in one little \"burst.\" It would take place from the rising of the sun to its setting. And, ultimately, Megan could only be shrunk down to five inches tall. So it would take quite a while for William to shrink Megan down to the ultimate goal of five inches tall, and long before he reached that goal, Megan would become aware that she was shrinking, even if it was ever so slowly.<br>\r\n<br>\r\nThere were other limitations too. The spell would only allow William to shrink just one subject --ever--, and said subject had to remain within five hundred feet of him when he sent his thoughts toward them. And said thoughts had to be sent forth just as the sun was rising over the horizon.<br>\r\n<br>\r\nThere were some other considerations, too, and the materials that William had acquired to cast the spell that gave him these powers had been almost prohibitively expensive. William would not have even tried to acquire the materials if the shaman who had taught him the spell hadn't shown him the tiny warrior he had shrunk for his own amusement.<br>\r\n<br>\r\nSo why did William choose Megan?<br>\r\n<br>\r\nWell, William had known Megan all his life, but he had spent most of that life as a modern day explorer, occasionally dropping in to see Megan and his family. Three years had passed when he had left Megan at thirteen as a gangly, shy girl. When he had come back, he was floored. Megan at sixteen was absolutely gorgeous, and the following years had only improved her. At twenty, 5'4\" Megan, with her fit and yet very femininely curved body, long dark hair falling to the small of her back, angelic face, soft brown eyes, warm smile and lightly tanned skin was definitely a head turner.<br>\r\n<br>\r\nWilliam found himself almost obsessed with the young woman who had always thought of a gangly kid for most of her life.<br>\r\n<br>\r\nBut Megan did not lack for suitors, and William knew that, as dashing as he might appear to a thirteen year old Megan, twenty year old Megan was more enamored with men her own age.<br>\r\n<br>\r\nWilliam knew Megan was very conservative, and hadn't done anything more than some heavy kissing and light petting above her clothes and waist. Still, William was obsessed with becoming her first lover; he just didn't know how to accomplish that goal.<br>\r\n<br>\r\nUntil he learned the secret of shrinking Megan.<br>\r\n<br>\r\nStill, there was the problem of getting Megan in range so that he could continually shrink her for twenty days.<br>\r\n<br>\r\nThis problem was solved when the opportunity arose that would require</span></div></div>",
            "created":1252040400,
            "id":755312,
            "title":"Yes"
        },
        "15333":{
            "choices":[
                "Daddy's in Control",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Megan's 40 year old father, who has secretly had a crush on her for a few years. <br>\r\n<br>\r\nWith a few simple thoughts, he can control Megan's entire world. </span></div></span></div>",
            "created":1562031000,
            "id":2681211,
            "title":"Megan's Daddy? "
        },
        "155":{
            "author_id":"wvababy",
            "author_name":"milkbaby",
            "choices":[
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices:</span></div></span></div>",
            "created":1225170000,
            "id":601033,
            "title":"Other"
        }
    },
    "info":{
        "author_id":"wvababy",
        "author_name":"milkbaby",
        "brief_description":"You choose the method in which Megan shrinks ",
        "created":1225137900,
        "description":"<td align=\"left\" class=\"norm\">In this story, I would prefer if the shrinking would progress slowly (hence the title.  <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/wink.png\" alt=\"*Wink*\" class=\"emoteZ\" title=\"Wink\" border=\"0\" width=\"15\" height=\"15\">)  <br>\r\n<br>\r\nMegan is a 20 year old spending the summer with her parents before she goes back to college.  <br>\r\n<br>\r\nYou get to choose the method in which the main character shrinks.  Everything from a certain emotion (fear or anger, for example), to having another character shrink Megan using only his or her thoughts.  And anything in between.<br>\r\n<br>\r\nMegan has a younger sister, age 12.  <br>\r\n<br>\r\nSex, profanity, whatever else, is okay to use in this story.  I won't edit much, save for the occasional typo, or something like that.<br>\r\n<br>\r\nEnjoy!</td>",
        "id":1489437,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603878600,
        "modified":1603878600,
        "pretty_title":"Slowly Shrinking Megan (SW Story)"
    }
}