{
    "chapters":{
        "1":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Man",
                "Woman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will gender will be eating?</span></div></span></div>",
            "created":1123736400,
            "id":266799,
            "title":"Man or Woman?"
        },
        "11":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Goku",
                "Vegeta",
                "Gohan",
                "Goten",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which man will it be?</span></div></span></div>",
            "created":1123736400,
            "id":266804,
            "title":"Choose a man"
        },
        "111":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Goku"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266814,
            "title":"POV"
        },
        "1112":{
            "choices":[
                "He grows through the roof (his clothes dont grow with him)",
                "He grows until just his head goes through the ceiling"
            ],
            "content":"<div class=\"\"><div> <span>Goku's stomach growled, he was starving. And not just his regular hunger either. It was a ravenous hunger he couldnt control. He had eaten most of the food in the house yet it hadnt satisfied him. He kept nagging her about when dinner was gonna be ready, and he always got the same answer \"You'll just have to wait! Dinner wont be ready for a few hours\" and everytime he groaned and went back to training.<br>\r\n<br>\r\nBut since this is Goku we're talking about, we all know  he's weaker when he's hungry. Try as he might he just didnt have the energy. So he gave up and went into the living room. He sat on the couch and turned on the tv. Unfortunately it was the food channel, he turned the station, cooking show, he turned the channel and it was a soap opera. \"Well i guess this is ok...\" he thought relieved. Then it went to a commercial, it was a commercial advertising a fancy chinese resturaunt. \"ARRGH!!!!!!!!!\" he yelled as he threw the remote down and ran out fo the room.<br>\r\n<br>\r\nHe got weaker and weaker, his stomach seemed to begin to growl louder with every second. It was like it was taunting him, he couldnt stand it any longer! \"Ahh! I can't take it anymore!!\" he screamed. And then....he began to grow.</span></div></div>",
            "created":1168232400,
            "id":372101,
            "title":"Hungry Goku"
        },
        "11122":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "Chi-Chi's looking mighty tasty..."
            ],
            "content":"<div class=\"\"><div> <span>As the hunger expanded inside Goku's belly, his body began to swell to match it. As Goku's head inched towards the ceiling, a loud ripping sound was heard throughout the room he was in (his bedroom) revealing his defined body. The growing continued on and on until Goku's head was pressing up against the ceiling. A few seconds later, cracks started appearing in the plaster around the top of his head. In less than a minute after that, Goku's head passed through the ceiling up to his neck. He panted as he finished growing, his mind clearly elsewhere. Now that he was over ten feet tall, the hunger plaguing him increased. He groaned and grabbed his stomach, the need for food overwhelming. Goku ducked down and moved towards the door, heading to the kitchen to see if Chi-Chi had finished cooking dinner yet. He lumbered down the stairs causing the whole house to shake. Goku's huge body appeared in the kitchen doorway and before he could even say anything, Chi-Chi said (without turning around), \"You're going to have to wait just a little longer Goku. So please stop stomping around the house and be patient!\"<br>\r\n<br>\r\nGoku groaned loudly again, clutching his midsection. He needed food and he needed it NOW!</span></div></div>",
            "created":1208149200,
            "id":519862,
            "title":"Growing Hunger"
        },
        "112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Vegeta"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266815,
            "title":"POV"
        },
        "1121":{
            "author_id":"future707",
            "author_name":"RedAngel7",
            "choices":[
                "Add another chapter"
            ],
            "content":"<div class=\"\"><div> <span>Vegeta glared at Bulma long and hard. Did she really think he was going to put up with all this?!<br>\r\n\"Woman, I need the gravity room fixed. Now!\" he demanded; ignoring the fact that she was cooking his dinner.<br>\r\n\"Sheesh, Vegeta, you think you can hold on a minute. Whats gotten into you, anyway? I eman, I know you've always been cranky, but I've never seen you like this!\" Bulma said, staring at him thoughtfully, \"You're gonna have to wait if you wnat me to do anything. Sit down and eat something.\"<br>\r\nVegeta grunted. As much as he hated the thought, he had to admit that the woman was right. Lately, he just found himself getting angry quickly. Everything bothered him. Her cooking, her weakness, her slowness...and the baby Trunks....oh god!....the midnight wake ups with his earth-shattering shrieks; it was all too much to bear. It was almost as if...as if his body...no...his brain and his own personality screamed at him that he wasnt supposed to be living this kind of human life. A mate, a child- acting as both, a husband and a father- refraining from killing people. No. This wasnt the way he was raised. <br>\r\nAnd suddenly, it was as if the evil side of him that had hid for a while, was now returning and revealing himself once again.<br>\r\n\"I'm not hungry,\" he grunted turning his back to her, making for the door. He needed to get some fresh air.<br>\r\n\"Wait, Vegeta,\" Bulma called to him. She wondered why he was acting like that and if he was okay, \"are you okay? Where are you going?\"<br>\r\nHe gave her the coldest stare she had ever received from him- not even back on Namek had he glared at her with such hatred.<br>\r\n\"I'm going out, woman, dont question me,\" he said dangeroulsy, and with that, he opened the door and went outside, letting it slam. Hard.<br>\r\nThe air was fresh and cool outside. He wanted to clear his mind of all these evil thoughts that were coming back. Yes, tehy were all back. The desire to kill, to enjoy the pain and the death of a weak one at his feet, to watch them squirm in agony...He stopped himself. H eknew he couldnt do it. As much as he hated to do it, he had to admit that he no longer wished to live the life he'd lived before. If he once hated love, he'd met Bulma. And try as he might, he could deny the way he felt about her- and his son.<br>\r\nIf he'd ever wanted to beat Kakarot, now he had no reason to. Why, he had become supersayin already. And Kakarot posed no threat, anyway.<br>\r\nAll he'd ever lived for, he had achieved.<br>\r\nAnd with that satisfaction, the evil thoughts quickly vanished from his mind. He turned around to go back in to his house...<br>\r\nAnd there it was...<br>\r\nHe looked up to the sky and saw a full moon.<br>\r\nAs he contemplated it, he felt a twitch in the area where his extra limb used to be.<br>\r\n* It cant be. It's been gone for years now!* he thought incredulously, as he felt something at his backside extending.<br>\r\nHe looked back and sure enough, it had grown out.\"Impossible!\" he almost yelled.<br>\r\nBut then, there was no more time to question what had just occured. His thoughts were clouded by a blind need to satisfy his hunger. The floor beneath him became smaller and smaller, and so much smaller. The ape- for it looked nothing like Vegeta- looked up with furious eyes, as if yellin at the moon, and let out an enraged growl.<br>\r\nWith a whisk of his huge hands, the roof of the Capsule Corp mansion was gone.<br>\r\nBulma looked up in confusion; her eyes widened as they took in the monster in front of her. She let out a shriek as the ape's claw came towards her and grabbed her by her waist.<br>\r\nIt didnt take long for her to realize that this ape, in fact, was Vegeta, the man she loved.<br>\r\n\"Oh god, Vegeta, stop! Please! Dont do this!\" she yelled hysterically as she came coser and closer to his mouth, her head bumping hard into one of his canines.<br>\r\nBut he heard nothing. Not the shrieks, the tears, the pleading, the voice of the woman he refused to admit he loved. Nothing. The only thing he heard was his growling stomach- demanding that it be fed.<br>\r\nWith one gulp- a clean swallow-she was gone.<br>\r\nAll that was left of her was a strand of her blue hair on his teeth.<br>\r\n</span></div></div>",
            "created":1151557200,
            "id":327477,
            "title":"How the VORE began"
        },
        "113":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Gohan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266816,
            "title":"POV"
        },
        "1132":{
            "author_name":"ghost",
            "choices":[
                "You grow quickly",
                "You grow slowly"
            ],
            "content":"<div class=\"\"><div> <span> Today you and the rest of the son family had been invited to see a new experiment Bulma was working on. She had said it would change the world but then again, she says that about all her inventions!<br>\r\n<br>\r\n After traveling at high speed with your wife Videl. You had noticed that your dad, Mom, Goten, Yamcha, Krillen and 18 had been invited (Pan didn't come because she blew up half the house and was grounded for it.) He noticed Mirai was there as well. <br>\r\n<br>\r\n He had came back a while ago and told you that he was in love with you, but you told him you couldn't be together cause you were married. \"Hey Mirai\" you said sending your from your side to shake \"Hey Gohan and Videl\" he said as he shaked your hand. \"Well, since your all  here lets begin the exhibit.\" Bulma said through a speaker.<br>\r\n<br>\r\n They all watched as she pulled out a capsule and pressed it. And with a burst of smoke, a 8 ft. ray gun appeared. \"This is my newest invention. The Grow-a-matic 9000\" (What a stupid name) you thought as you looked on. \"This invention will change the world because everyone will no longer starve.\" As Mirai headed for the gun he aimed it at a small Tree. And with a hum the shot a black beam at the Tree. Nothing happend. <br>\r\n<br>\r\n You and everyone else who watched were expecting more but then they watched as the small 3ft. tree grew quickly to a 60ft. tree. You all watched amazed and Bulma continued \"With this new device, well will be able to make food 100 times its size feeding everyon around the world with fewer animals dying as well!\" You clapped as well did everyone else when the machine began to go berserk, twisting and circling everywhere it shot one black beam at you....</span></div></div>",
            "created":1130389200,
            "id":281000,
            "title":"Bulmas new invention"
        },
        "11321":{
            "author_name":"ghost",
            "choices":[
                "Gohan eats his wife",
                "Gohan eats one of his friends"
            ],
            "content":"<div class=\"\"><div> <span> Mirai and Bulma were in shock when and quickly began to start fixing the machine so that you could return to normal. But you weren't paying attention to them. You felt power surging through you as your clothes tighten as you began to grow, and sense you wore nearly tight clothing they quickly began to stretch.<br>\r\n<br>\r\n Your muscles were becoming more defined as you grew,  and your spikey hair had even grown a bit, but you were surprised at how big you were getting. Already at the twelve foot mark and your clothes finally shredded freeing your new body. Your underwear were still on but were quickly losing the battle. Everyone looks up at you as you grow, they quickly moved away from you as you grew and you hear your dad say \"Gohan! Are you ok?\" <br>\r\n<br>\r\n \"Yeah, I'm fine\" You say in a deep rumbling voice. Your underwear finally lost the battle as your dick was freed. At normal size, it would have been a decent 8 in. but now at normal size it would have been 12 in. flaccid! Quickly rising past 50 you stopped at 65 ft. tall<br>\r\n<br>\r\n Mirai meanwhile was paying attention to Gohan rather than the gun. \"Mom, shouldn't Gohan have grown to 120 ft. because of his height? he asked \"Yeah that would be true but this gun has never been tested on live animals before.<br>\r\n<br>\r\n Meanwhile, Goku and the gang ran over to Bulma \"Bulma, can you fix this?\" Videl asked half-heartedly not wanting this giant husband gone. \"Yes, but we aren't sure if it will affect him. The gun was set to 20x the organisms original size but it must cut it down to half when it is shot at animals.\" Bulma says<br>\r\n<br>\r\n However, Gohan was paying more attention to his body. He felt power, strong, even more powerful than his dad ever could be. He slowly explored his body pleasing himself when he begins to feel hungry.....</span></div></div>",
            "created":1130389200,
            "id":281004,
            "title":"Gohans acension from demiSaiyan to Giant"
        },
        "113211":{
            "author_name":"ghost",
            "choices":[
                "He grows to Gohans size",
                "Someone gets in the way"
            ],
            "content":"<div class=\"\"><div> <span> Suddenly a large gurgling sound came from Gohans belly.  Everyone looked up and knew what was wrong with Gohan:hunger. Feeling a hunger a hunger like never before. He rubbed his stomach as he looked for food and he found it. His wife looked simply delicious on the ground. As he headed towards the spot she stood.<br>\r\n<br>\r\n \"Son, stop now!\" Goku said aiming a hand at him. But Gohan simply ignored him. \"Listen to your father Gohan!\" Shouted Chi-chi but for some reason her words no longer affected him. And soon everyone but Mirai and Bulma(She can't fire ki Blasts) began to fire them at Gohan. Gohan payed no attention because he couldn't even feel their attacks.<br>\r\n<br>\r\n As he got close to the group they tried to fly away. Gohan payed no attention to any of them except his wife. As she tried to fly away he snatched her like a fly. \"Let me go Gohan!\" she cried not wanting to become her husbands snack. <br>\r\n<br>\r\n \"But Videl, your cute enough to eat!\" he said licking her body. As she protested to be free, he ignored her pleas and siply threw her in his mouth. As he slowly licked her in his mouth, he felt no remorse as he swallowed her whole. As he tasted her he had felt no snack taste like her before. She was the best food he had ever eaten. \"Ahhh! That hit the spot!\"<br>\r\n<br>\r\n As Mirai and Bulma fixed the machine Mirai had looked up at Gohan. A larger body, toned muscles, a bigger dick, and even his looked a few years younger. He was complety turned on by Gohan. And as he thought of the Titan eating his own wife he thought to himself 'He's not married anymore.' he smiled as he thought those words 'He's not MARRIED anymore!'<br>\r\n<br>\r\n At this thought, Mirai decided to do the most logical thing possible. Shoot the Ray Gun at himself. As he went for the controls and began to activate the growth program his mother shouted at him \"What are you doing Mirai!?\"<br>\r\n<br>\r\n \"I'm joining the man I love in Godhood!\" he say with a wicked smile. As the Ray Gun hummed he stood in front of the Ray as it shot out a black beam....</span></div></div>",
            "created":1130389200,
            "id":281087,
            "title":"Goodbye Videl!!!"
        },
        "1132111":{
            "author_id":"alexistibbs",
            "author_name":"alexis",
            "choices":[
                "the z fighters try to fight the giants",
                "mirai gets in gohans way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mirai grows to Gohans size to be with his love.</span></div></span></div>",
            "created":1357016400,
            "id":1499941,
            "title":"He grows to Gohans size"
        },
        "1132112":{
            "author_id":"alexistibbs",
            "author_name":"alexis",
            "choices":[
                "Gohan grabs Chi Chi",
                "Gohan grabs Bulma"
            ],
            "content":"<div class=\"\"><div> <span>As mirai was about to be hit by the black beam someone zipped in front of him. It was Goku. “I can't like Gohan hurt any one any more. Plus our atacks are usless to him” he said as he grow into a giant. Goku's clothes had also ripped off in this motion. As Gohan saw what was happening he an idea...</span></div></div>",
            "created":1357016400,
            "id":1499951,
            "title":"Someone gets in the way"
        },
        "114":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Goten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266817,
            "title":"POV"
        },
        "1141":{
            "author_id":"tripleqmark",
            "author_name":"TripleQuestionMark",
            "choices":[
                "Gohan",
                "someone else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And who will you be?</span></div></span></div>",
            "created":1141102800,
            "id":303911,
            "title":"And you are..."
        },
        "115":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Yea",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about trunks?</span></div></span></div>",
            "created":1123736400,
            "id":266805,
            "title":"Will it be Trunks?"
        },
        "1151":{
            "choices":[
                "Chibi",
                "Older"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Should it be Chibi Trunks, or Future/GT Trunks?</span></div></span></div>",
            "created":1129179600,
            "id":278562,
            "title":"Age"
        },
        "11511":{
            "choices":[
                "Yours",
                "Trunks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from? </span></div></span></div>",
            "created":1129266000,
            "id":278724,
            "title":"POV"
        },
        "115111":{
            "choices":[
                "Trunks",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question, are you Chibi Trunks or someone around him? </span></div></span></div>",
            "created":1129266000,
            "id":278725,
            "title":"Who are you?"
        },
        "1151111":{
            "choices":[
                "Accept the offer and keep your mind.",
                "You can always just eat the demons and stay sane!"
            ],
            "content":"<div class=\"\"><div> <span>The demon world was a shadow of the known universe, home to countless powerful demons. With an iron fist, the realm was ruled over by the demon king Dabura, until the day that a strange magician came to the court. Few of the demons know precisly what occured next, but regardless the king was spirited away to the Earth and a barrier established to prevent their following. What began soon after was a war of succesion, divided between those whom wished to find the king and those that wished the throne for themselves, which ended with victory for the loyalists. Slowly they began to plan, searching for the way to break Babidi's seal.<br>\r\n<br>\r\nOf course you have no idea of this political crisis, and are far too occupied with being bored. Goten and his parents are away for the weekend, and while you could easily fly to visit him you also happen to be grounded. This whittled down your choices to staying at home, or spending the day at the Capsule Corps R&amp;D lab. Given that Capsule Corp has a hand in almost everything you decided they must have something interesting you could play around with, and you decided on the latter. Overall you are not much impressed with the lab however, and most of the inventions are quite boring. Suddenly you are distracted from looking amidst the shelves of rejected prototypes as an explosion rips through the nearest wall. Standing in the new opening are two beings, whom appear to be human save pointed ears. The taller of the two, a man with rather spiky red hair, immediatly points at you. \"What luck, let's grab 'em!\" At this point the shorter intruder, a young lady with chinlength green hair, elbows him in the side. She than walks a bit closer and gives a little bow. As she speaks, you quickly realize from their voice that both are actually male. <br>\r\n<br>\r\n\"Sorry, Girtil has never been big on manners; he likes to blow things up first and ask questions later.\" Girtil looks annoyed at this remark, but says nothing, allowing his comrade to continue. \"My name is Kirt, and we're lieutenants in Micheel's force. We've heard quite a bit about you, and wanted to request that you help us with a matter.\"<br>\r\n<br>\r\nPerhaps it was just Girtil's first impression, but you get a very bad feeling from these two. On the other hand you are bored out of your skull and their job might prove interesting. You decide to at least find out what it is. \"If you want to ask somebody for help, you might want to think about not blowing everything up on your way in.\" Crossing your arms, you nevertheless continue. \"But, what is it exactly that you want me to do?\" Kirt begins to speak but quickly stops, staring behind you. There is no sense of ki behind you, however you also feel nothing from the two strangers and quickly spin around. A glint of metal flashes, and the other thing you see before blacking out is the blade of a scythe approuching your face.<br>\r\n<br>\r\nAs you slowly awake you can feel your limbs bound and a cold metal table beneath you. As you try to struggle free your tail flails rapidly. Suddenly it dawns on you that you have a fifth limb, and quickly look down. Sure enough a brown fuzzy tail is squirming about at your feet. Since you were a baby your tail had been cut off continually, and you were quite certain it was too early for it to be back. Noticing that you have awoke, a man with long blue hair and silver eyes turns his attention to you. \"Well, so you awake at last. I am Micheel, acting ruler of the demon world. Some time ago our king went missing, apparently taken by a strange mystic. The Wizard created a barrier between the worlds that would keep us from coming to locate him, however it recently weakened. In this time we were able to get through a small force, whom were to locate King Dabura and bring down the barrier.\"<br>\r\n<br>\r\nThe only wizard you know of was Babidi, and since he had a demon with him you assumed that this had to be Dabura. \"I don't care about your problems right now, why am I strapped to this table?!\" Micheel gives you a smooth bow, which doesn't seem very appologetic. \"We were pressed for time, and could not risk you refusing our offer. You must help us find the King.\" In a flash of energy you try to pull free of the restraints, but find them too strong. With a sigh you let your body fall limp. \"Was this king of your's a tall red guy with horns?\" Micheel smiles, which sends a chill down your spine, and steps closer. \"So you have seen him afterall? This makes things far simpler. Do you know his location at the moment?\" The memory is still shocking to you, but you relate it calmly. \"He was eaten by a creature called Buu, sorry but your king is dead.\"<br>\r\n<br>\r\nMicheel seems far from sad, and simply closed his eyes. \"Well, then that means I am rightful ruler; and my second wave can commence.\" The demon seems far less benign by the second, and you struggle with renewed effort. \"But none of this is answering why you trapped me here, and why I have a tail again!\" Micheel's smile twists, allowing a small glimmer of fang to shine through. \"It's simple really. You are of Saiyan blood, and therefore capable of becoming an Oozaru. However in this state you lose your mind and most your abilities. We have developed a method in which you will gain the size and power of an Oozaru, but retain your normal shape. With Dabura dead I rule the Demon World, and I have found this one quite to my liking. Therefore it is only natural I expand my empire. It's ironic that Dabura would have been eaten, as that is the fate that will befall this world's citizens. With a shout you charge all your power, but still the restraints hold you in their iron grip. \"Noway! My dad and the others will never let you do that!\" Micheel brakes into laughter, low and manic, his eyes locked upon you. \"No no, it's you that will devour each and every one of them.\"<br>\r\n<br>\r\nAt this point a sharp pain pierces through your stomach, and you can feel the clasps growing tighter. Micheel gives you an inquisitive glance. \"Oh? Has it begun already? We have used the strategy of living siege engines in the past, but Saiyans seem to be the best suited for it. Soon you will begin to grow rapidly, eventually dwarfing even the Oozaru. Your hunger will burn eternally, and if you do not eat your loved ones eventually you will go mad. Once your mind is broken, you will become an engine of sheer destruction. Either way they will all die, it's up to you wether you maintain your sanity. As the Earthlings bodies digest you will absorb there ki, adding to your own power.\" Micheel stops speaking as the clasps grow tighter still and finally burst. You are now free and quickly hop to your feet; now easily twelve feet tall. Micheel stares up with no fear at all. \"So, will you serve me willingly, or simply go mad?\"         </span></div></div>",
            "created":1130216400,
            "id":280570,
            "title":"An offer you can't refuse?"
        },
        "11511111":{
            "author_id":"xenophage17",
            "author_name":"Zeromus",
            "choices":[
                "Give in and eat the man",
                "Try to fight back against the demons"
            ],
            "content":"<div class=\"\"><div> <span>Trunk’s Brief could be pretty hot headed and immature but he wasn’t a complete idiot. The feeling of hunger was already stabbing at you like a thousand flaming knives. You look down at Micheel’s smug demonic grin and you grunt in a manner not dissimilar to the giant beast of your Saiyan lineage “Fine”.<br>\r\n<br>\r\n“Excellent, well let's get started” Micheel clapped his silver eye’s flashing with glee as all of a sudden your growth exploded. In just a moment your body erupted out smashing through the top of the Capsule Corp lab. The harsh light of day highlighted the bustling city before you and all of the stunned citizens. Your eyes narrow as your vision blurs, the tiny moving shapes of humans seeming to glow each one teasing your stomach. Without thinking reflexively flick your tail snapping a traffic light in two and sending hover cars flying. <br>\r\n<br>\r\nGirtil and Kirt hovered up around your head snickering. “Look at them run” the green haired demon cackled. For a moment you contemplate using your power to swat her out of the sky but the second you try to muster your Ki a searing pain strikes your stomach an echoing groan erupts from the angry organ.<br>\r\n<br>\r\nMicheel teleported right next your head, now big enough for the demon to comfortable fit in your ear. “The only way to stave off the agony is to feed” he whispered and in one fluid movement glided forward pointing at the street below. The damage caused by your casual tail swipe had left a man injured trying to dislodge himself from the wreckage of his car.<br>\r\n<br>\r\nJust one gulp and the pain would stop, you could fight back be the hero and then just fix everything with the dragon balls right?<br>\r\n</span></div></div>",
            "created":1517806800,
            "id":2449611,
            "title":"Accept the offer and keep your mind."
        },
        "1152":{
            "choices":[
                "Jr.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Pan's Grandson, Goku Jr?</span></div></span></div>",
            "created":1129179600,
            "id":278563,
            "title":"Goku Jr."
        },
        "11521":{
            "choices":[
                "You",
                "Goku Jr."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from? </span></div></span></div>",
            "created":1129179600,
            "id":278564,
            "title":"POV"
        },
        "115211":{
            "choices":[
                "Goku Jr.",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question, are you Goku Jr. or someone around him?</span></div></span></div>",
            "created":1129179600,
            "id":278565,
            "title":"Who are you?"
        },
        "1152111":{
            "choices":[
                "Head home for the moment.",
                "See if you can find out more about your condition."
            ],
            "content":"<div class=\"\"><div> <span>Ever since your adventure to Mount Paozu, Pack has been your closest friend. But despite the good results neither of you are much interested in returning. You were far more content to enjoy a less eventful life with Grandma Pan. It was as you were returning from school that you felt a sudden fluctuation. There was no word to describe what you felt, it was like a powerful wind tugging at your very soul. This was infact the beginnings of your ability to sense ki surfacing, but it was impossible for you to know. You were certain however that the pull was coming from your home. At this point you broke into a run, and to your horror saw smoke rising over the horizon. Sure enough, your house was in shambled when you arrive. The house was not burned down as you feared, someone had simply been using the fireplace to produce thick smoke, but it had certainly seen better days. Grandma Pan was nowhere to be seen, and a single word was simply scrawled upon the door \"Paozu\". The very thought of Grandma Pan in danger twisted your stomach, and you immediatly packed what little you could find and set out alone for the mountain.<br>\r\n<br>\r\nThe trip is uneventful, and you soon reached Mount Paozu. A steady ache fills your legs however you do not notice it in the slightest; your thoughts are completely on Pan. As you near the mountain you once more feel the strange gale, and cautiously follow after it. It's fairly obvious this is a trap, likely Mombi, but you dare not risk bring anyone else and endanger Grandma. As you turn a bend on the mountain you can make out three figures ahead, one of them Pan. The other two turn quickly, you made no sound yet they somehow knew of your presence. The taller of the two people resembles Mombi, however he is a bit taller and with straight red hair. The other is a boy your own age, dressed in an outfit that reminds you of royalty. The man leaps high above and comes down with a crash, causing you to stumble back, however a hand gesture from the boy halts him.<br>\r\n<br>\r\n\"Now now, that is enough Servill.\" The demon nods and takes a step back, allowing his apparent master to approuch you. \"Well well, at last we meet Son Goku. I am Maou Yamu, ruler of Mount Paozu.\" This demon seems far more polite than the previous ones you encountered, however you are confused as to how he could be whom he says. \"But I thought the Demon Lord was killed by the bear.\" Yamu chuckles a bit at this. \"The bear you say? Interesting. And yes, while that oafish boar was the former lord of Mount Paozu, I claimed it for my own shortly after he fell.\" As you speak Yamu gestures to Pan to allow you to check that she is alright, and sure enough you find that she is simply unconcious. You are still furious with Yamu however. \"Why did you have to take Grandma, what do you really want me here for?!\"<br>\r\n<br>\r\nChuckling again, Yamu brushed a hair from his face. \"I hate to burst your bubble, but the bears never really fought Yamao, the one whom killed him was you.\" Your memory of the time was fuzzy, yet your only recollection of the fight was running from Yamao, and than awakening to find him slain. It didn't seem possible that you could defeat such a powerful being. You shake your head as you think, apparently amusing Yamu quite a bit. The small demon now grins, stepping towards you. \"Without you, I would never have become Maou. But all the same, my rule can never be concrete as long as you exist. You slew one Demon Lord and could very well slay another; that could cause some to question my absolute authority. Therefore, I'm simply going to have to eat you.\"<br>\r\n<br>\r\nConsidering that just about everyone you met on Mount Paozu in the past wanted to eat you, Yamu's announcement wasn't a huge surprise. However you still are made quite nervious and ty to back away. \"Really, I couldn't have killed him! And even if I did somehow, I have no reason to try and hurt you!\" It obviously has no effect on Yamu however and he dives at you again and again, embedding his fist in the ground each time. Finally you lose control of your emotions, and a clear wave of ki bursts up around your body. Yamu is blown back, falling flat on his face. Rocks explode all around as the small demon bursts back to his feet, a look of madness on his face. As he stands his neck twists forward, extending his head to a good five feet away. Immediatly you regain your senses. \"A... Rokurokubi?!\" Yamu regains control of his emotions as well in a moment, and his neck shrinks back. \"Yes, I have a small amount of Rokurokubi blood, about as much as you have Saiyan blood infact.\" <br>\r\n<br>\r\nPan had never told you precisly what a Saiyan was, however you had a feeling that it had to do with the reason that only you had to cut off a tail now and again. Yamu did not clarify this as he continued on. \"Yes, I had such a delightful discussion with Pan while we were waiting for you. She told us about the Saiyan, and your heritage, though I must admit it seemed she only let out what she wanted us to know. An odd one, your grandma.\" Yamu had apparently dropped his combat stance, though you stayed in your own, however he was not done yet. Gradually a ball of light began to form in his hand. \"Maou's ultimate corruption, MINIMIZE!\" With a shout he flung the ball towards you, and it seemed far to speedy to dodge. All you could do was shut your eyes and wait for the inevitable. As your eyes faded to white however you once more lost control, and a powerful aura erupted around you. You could hear Yamu screaming, and gradually opened you eyes. A rush of power unlike any you had ever felt was surging through you, and the minimize ball was nowhere to be seen. Yamu was staring in shock, and gradually slinking back. \"It can't be... the energy inverted. Heh, I had intended to eat you after you shrunk, but now it seems you reversed the flow of energy and absorbed it. The process seems to be slower than the minimize; but it should still be as effective. I wonder how life will be when your a couple hundred feet tall, hehe. Enjoy it, because once I find out how you absorbed it than I'll return for you. Know that you are the ultimate rival of Maou Yamu!\" With that Servill leaped upward and vanished, and Yamu lifted from the ground, floating back and over a mountain cliff with incredible speed.<br>\r\n<br>\r\nAll that mattered to you was rescuing your grandmother, however you worried that Yamu would do something really horrible next time; and that the trip was still in a way a failure. Nevertheless you and Pan are safe. Bending down over Pan you try to rouse her with your voice, and finally a pat on the cheek. Slowly her eyes begin to open, and she blinks up at you. \"G...Goku? Well, I see you handled that demon pretty well. I knew even with me he wouldn't stand a chance against you.\" Smiling you help Pan up and began to tell her what really happened, when suddenly she interrupts. \"Goku, have you grown from this morning?\" Yamu had mentioned this, and while being a bit taller may be nice it still worries you.</span></div></div>",
            "created":1129266000,
            "id":278723,
            "title":"Yamu's Curse"
        },
        "1152112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You find the Shrink ray",
                "Something unplanned occurs"
            ],
            "content":"<div class=\"\"><div> <span>Never mess with a hungry Saiyan. You had to learn that the hard way. You have always had a deep passion for fighting, that is, before you fought Goku jr at the last Martial Arts Competition. Afterwards, you were completely convinced that he was cheating, so you felt like showing him a thing or two. You found out that he would be taking a trip to the CC (capsule corporation) the next day. That is when you would strike. You had a plan too. You would sneak inside the CC building and steal one of the shrink ray prototypes that they had. You read all about these in a magazine, they were planning to sell them to medical corporations so that scientists could go and directly observe the body. As a plus to shrinking, it also made the person immune to things like stomach acid and also gave the person regenerative abilities for a certain amount of time. You would use it on him and run before anybody saw you. This way it would take hours to find him. You laugh at the thought of this and approach the CC building. Nobody would be dumb enough to sneak into such a big corporation so as a result, it wasn't guarded very well. You could easily slip in without anyone noticing. </span></div></div>",
            "created":1129266000,
            "id":278694,
            "title":"Your Revenge Against Goku Jr"
        },
        "11522":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Gotenks, via Potoroa or such?</span></div></span></div>",
            "created":1129266000,
            "id":278726,
            "title":"Gotenks?"
        },
        "115222":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Yeah",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><br>\r\n<br>\r\n  Okay, how about Cell?   Why can't villians have thier fun too??  </span></div></span></div>",
            "created":1129266000,
            "id":278790,
            "title":"Cell?"
        },
        "1152222":{
            "author_id":"alpha2omega",
            "author_name":"ghost",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> How about Mirai Trunks?</span></div></span></div>",
            "created":1151730000,
            "id":327859,
            "title":"Mirai?"
        },
        "11522222":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Krillin?</span></div></span></div>",
            "created":1190005200,
            "id":445161,
            "title":"What about Krillin?"
        },
        "115222222":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "Yes, lets see them eat the other characters",
                "No, move on."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some of the furry characters? Like the Bear or Tiger bandit, or how about Man-Wolf?</span></div></span></div>",
            "created":1275109200,
            "id":891292,
            "title":"Obscures Furries do ti for you?"
        },
        "1152222221":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "The Badnits",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, which furry characters shall we use?</span></div></span></div>",
            "created":1275109200,
            "id":891293,
            "title":"It's a animal's world"
        },
        "11522222211":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "The Bear Bandit, the one that tired to eat Roshi's turtle.",
                "The Tiger bandit from episode \" Plague  and Terror.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which bandit do you want to use?:<br>\r\n</span></div></span></div>",
            "created":1275109200,
            "id":891295,
            "title":"Bandits have to to eat."
        },
        "11522222212":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Emperor Pilaf's ninja lackey Shu? </span></div></span></div>",
            "created":1397883600,
            "id":1782667,
            "title":"others"
        },
        "1152222222":{
            "author_id":"silverzeo",
            "author_name":"Joe",
            "choices":[
                "Yes, King Yamma it is.",
                "No, move on."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Kign Yamma? The big guy has a big gut so he must have a big appetite </span></div></span></div>",
            "created":1275109200,
            "id":891296,
            "title":"No, move on."
        },
        "11522222222":{
            "author_id":"milesprower",
            "author_name":"Miles Tails Prower",
            "choices":[
                "Majin Buu",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of the Buu forms?</span></div></span></div>",
            "created":1280120400,
            "id":924679,
            "title":"Buu!"
        },
        "115222222221":{
            "author_id":"milesprower",
            "author_name":"Miles Tails Prower",
            "choices":[
                "Kid form",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Starting up, how about Kid Buu?</span></div></span></div>",
            "created":1280120400,
            "id":924680,
            "title":"Majin Buu"
        },
        "115222222222":{
            "author_id":"ph0220",
            "author_name":"ph0220",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The big Giran with his big appetite?</span></div></span></div>",
            "created":1338958800,
            "id":1353874,
            "title":"Giran"
        },
        "1152222222222":{
            "author_id":"alexistibbs",
            "author_name":"alexis",
            "choices":[
                "vegito",
                "gogeta"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about the two fusions</span></div></span></div>",
            "created":1359003600,
            "id":1516407,
            "title":"no"
        },
        "11522222222221":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes",
                "No next please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>R U sure??</span></div></span></div>",
            "created":1562970540,
            "id":2685865,
            "title":"vegito"
        },
        "115222222222212":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yed",
                "Next option."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about going through this as ur self? (?(*NOTE* IF USING THIS DO NOT GIVE URSELF A NAME TO ALLOW EVERYONE TO BE THEMSELVES WITHOUT BEING FORCED TO USE SOMEOBE ELSE'S NAME*)</span></div></span></div>",
            "created":1562970660,
            "id":2685867,
            "title":"No next please"
        },
        "1152222222222121":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Bullma",
                "Pan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who r u shrunk near/by?</span></div></span></div>",
            "created":1562970720,
            "id":2685868,
            "title":"Yes"
        },
        "11522222222221211":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do u want to pick Bullma?</span></div></span></div>",
            "created":1562970840,
            "id":2685869,
            "title":"Bullma"
        },
        "115222222222212111":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Unaware",
                "Aware"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this Unaware? Or Aware?</span></div></span></div>",
            "created":1562970900,
            "id":2685870,
            "title":"Yes"
        },
        "11522222222221212":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do u want to pick Pan?</span></div></span></div>",
            "created":1562970960,
            "id":2685872,
            "title":"Pan"
        },
        "115222222222212121":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Unaware",
                "Aware"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this Unaware or Aware?</span></div></span></div>",
            "created":1562971020,
            "id":2685873,
            "title":"Yes."
        },
        "11522222222222":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "Gogeta",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gogeta, or others?</span></div></span></div>",
            "created":1439269200,
            "id":2019724,
            "title":"gogeta/ other"
        },
        "115222222222222":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "Lord Beerus",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Lord Beerus?</span></div></span></div>",
            "created":1439269200,
            "id":2019725,
            "title":"God of destruction"
        },
        "1152222222222221":{
            "author_id":"carzyturtle",
            "author_name":"bill",
            "choices":[
                "Beerus decides to wait for his godly meal",
                "He can't bear he will have to deal with a normal saiyan"
            ],
            "content":"<div class=\"\"><div> <span>When Beerus woke up from his decade slumber he was hungry.  He was hungry for some thing more meaty. he wanted to taste the strongest of foods. something that could make his stomach grow in power. He wanted to eat the being he had seen in his dream. He calls upon whis so he may learn where his most delectable snack is. He is told by Whis that he can travel to then North Kai's planet. When he arrives he is informed on who is in front of him. It is a saiyan he then ask the saiyan You there can you transform into a super Saiyan God. Super Saiyan God I have never heard of thta. Beerus tuned out and started wondering do this meal exist. But before he could finish his thought Goku charged forward. But Beerus quickly knocked him out.</span></div></div>",
            "created":1551223800,
            "id":2623461,
            "title":"Hunger of a god"
        },
        "1152222222222222":{
            "author_id":"rainbowriderv",
            "author_name":"rainbowriderv",
            "choices":[
                "Sure",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Whis?</span></div></span></div>",
            "created":1534482000,
            "id":2535030,
            "title":"more"
        },
        "12":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Chi-Chi",
                "Bulma",
                "Android 18",
                "Videl",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman will it be?</span></div></span></div>",
            "created":1123736400,
            "id":266800,
            "title":"Who will it be?"
        },
        "121":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Chi-Chi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266809,
            "title":"POV"
        },
        "1211":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You shrink",
                "She grows"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, just one more question. Will you shrink or will she grow?</span></div></span></div>",
            "created":1129352400,
            "id":279014,
            "title":"Shrink or Grow"
        },
        "12111":{
            "author_id":"ajbomb333",
            "author_name":"AJBOMB",
            "choices":[
                "1 inch",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so what size</span></div></span></div>",
            "created":1410066000,
            "id":1853502,
            "title":"You shrink"
        },
        "122":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Bulma"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266810,
            "title":"POV"
        },
        "123":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Android 18"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266811,
            "title":"POV"
        },
        "1232":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Wish",
                "other means"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n   As far back as she can remember, Android 18 was fascinated about giants and giantess's.  She wasn't sure where her fascination came from.  It could've come from watching the both versions of \"Attack of the 50 foot woman\" before she became an android.  Back then, she was a  care-free person.  But when Dr. Gero had changed her into an android, she had gotten more stern.  Android 18's brain was part biological and part mechanical.  In fact, Android 18 had both biological and mechanical parts all over her body.  This is why she could have offspring with Krillin.  <br>\r\n     Her fascination of being a giantess could've come from sexual intercourse with Krillin, who was 2 feet smaller than her.  <br>\r\n       Android 18 was obsessed by the idea of her becoming a giantess. But how would she become a giantess?  By making a wish with the dragonballs, or by other means? </span></div></div>",
            "created":1123736400,
            "id":266836,
            "title":"Android 18 wants to be BIG"
        },
        "12321":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Where she is standing",
                "A nearby island"
            ],
            "content":"<div class=\"\"><div> <span>Android 18 wasn't sure how else she could grow into a giantess other than the dragonballs. Of course, a weird invention by Bulma would have worked, but 18 was far to impatient to wait for that. The dragonballs though, were easily accesible; her husband Krillin was always hanging out at Kame house so she knew that the balls were gathered over there. As 18 flew over a massive city, she couldn't help but think what it would be like to return to the same city, only a hundred or more times bigger; the excitement was killing her. Finally, she spotted Kame island in the distance. Quickly but carefully, 18 landed softly on the ground, hoping not to stir up any attention. After doing some crafty stealth work, thanks to her mechanical self, she left the house as quickly as she entered. Now carrying a red sack, only one question remained; Where would she summon the dragon?</span></div></div>",
            "created":1140670800,
            "id":303167,
            "title":"The wish..."
        },
        "123212":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Only about as big as the island",
                "Mega Goddess baby!!!"
            ],
            "content":"<div class=\"\"><div> <span>18 figured that if she were to summon the dragon on Kame island, somebody would surely catch her before she even made the wish. She knew she would find a way to get the balls again, but she also wanted to grow in this episode! (yea i know...corny joke) She landed on a remote island and quickly emptied the bag. As soon as the balls were in place, she quickly went about summoning the dragon. The sky grew dark, everything was chaotic, you know the routine...<br>\r\nShenron, big as ever, uttered, \"Speak your wish\"...<br>\r\n18 yelled up, \"Please make me into a giantess! I want to be huge!\"<br>\r\nAfter a brief pause, the dragon said, \"It shall be done\"<br>\r\nAs this was said, the eyes on the dragon began to glow a deep red. 18 couldn't believe that her dream of becoming a giantess would finally come true. As if it was natural, the android began to grow bigger. She noticed that the rocks under her were cracking. Even her clothes were biginning to feel small. <br>\r\n<br>\r\n<br>\r\nHow big does she grow?</span></div></div>",
            "created":1140670800,
            "id":303171,
            "title":"Distractions don't help"
        },
        "1232122":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Kame house",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Bigger and bigger she grew. Her clothes were eventually no more, and the island on which she was standing was now becoming too small for her to stand on. <br>\r\n<br>\r\n(a few miles away, on kame island)<br>\r\nKrillin came through the door in shock, followed by Master Roshi with a pair of binoculars (that dirty perv, lol). They couldn't believe what they were seeing. The woman that Krillin fell in love with now appeared to be a hundred feet tall, and yet she was still growing! Neither of them even noticed that the dragon was summoned. Of course, Roshi couldn't keep his perverted mouth closed and said, \"do you think she would make an old man like me happy?\"<br>\r\nKrillin, now with flat eyes, said sarcastically, \"Yea, i'm sure thats the first thing she wants to do\"<br>\r\n<br>\r\n(meanwhile, back at the island)<br>\r\n<br>\r\n18 couldn't believe her size; she now had one foot in the water and the other covering the entire island! She looked for the dragon, but couldn't see it anymore. She wondered why that was, because the sky was still dark. Finally she looked down and gasped; she was now even bigger than the dragon! The dragon now only looked like a floating lizard to 18 now. Finally, after she reached about a couple thousand feet tall, the dragon said, for the first time with a hint of fear, \"your wish has been granted\" and disappeared. As the balls split up, two of them flew toward 18, one of which flew into a private spot. The other hit her skin and bounced off. 18 truly felt like a goddess; even with the z team's combined power she coulnd't be stopped. She did admit to herself that she was still a tad bit evil. The only thing left to decide would be where she would start her reign of terror.</span></div></div>",
            "created":1140670800,
            "id":303180,
            "title":"Mega 18"
        },
        "12321221":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Krillin and Roshi land in 18's stomach",
                "18 eats the city"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n  Android 18 was 4,000 feet tall by now.  She could see for miles around her; she saw Kame House and a city on the horizon.   Her clothes were gone, and she looked like a kid in a candy store.  She walked off the island, the ocean only reaching to her ankles. 18 made it to Kame House in two short (for her) steps.  18 looked down to see Krillin and Master Roshi on the small island and smiled.<br>\r\n      Krillin and Master Roshi barely came up to 18's little toe!  18 was truly a goddess now.  Nobody would be able to stop her, not even a super saiyan, or even a super saiyan 4!  18 picked up Krillin and Roshi and brought the two up to her face.  <br>\r\n         \"Hi there, 18\" said Krillin in a falsely bright voice.  Roshi looked down to see...well, I think you know what he was looking at!  <br>\r\n          \"Hello, my tiny husband\" said 18.  \"I'm a goddess now.  And I'm gonna have fun!\"<br>\r\n           18's stomach growled loudly.  <br>\r\n          \"First, I need a snack\" said 18, and tossed in Krillin and Roshi in her open mouth and swallowed the pair!  18 looked over to the city and smiled.  Time for a feast!  </span></div></div>",
            "created":1140843600,
            "id":303483,
            "title":"Feast of a Goddess begins"
        },
        "123212212":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "She grows yet again",
                "Its nothing, probably the city digesting."
            ],
            "content":"<div class=\"\"><div> <span>18 felt Krillin and Roshi slide down her throat; it was an amazing feeling. She had never before considered vore, but now that she had actually eaten someone, she realized how sensational it was. <br>\r\n\"Well, I looks like I know how I’m going to play with this planet\", 18 said in a voice so loud that it made ripples in the water far below. She started to walk over to a nearby city, which to her was about as wide across as a normal bedroom. Buildings were at the highest, no taller than her small toe. Once 18 was near the city, she got on her knees in the water so she could see the city better. Below, she could see tiny little people running about in panic. Since she was too big to pick them up, she simply lowered her head and breathed in as hard as she could. Hundreds of people began to fly up into the goddess’s mouth due to the insane winds on the street. 18 increased the intensity of the wind and now cars and buses were flying up into her mouth. Once she had enough, she slowly raised her head. In her mouth were many hundreds of people, cars, buses, and pieces of buildings. 18 loved the incredible sensation of half the city's population moving around in her mouth. She slowly began to move the people around her mouth, getting them as wet as she could se they would slide down her throat with ease. Finally, 18 gulped them down; hundreds of people, people with dreams and hopes, were reduced to nothing but food for an android. 18 suddenly noticed that there were helicopters flying nearby. It appeared as if Z-tv was trying to make a story out of her recent meal. She simply smiled and said, \"Hey you.\"<br>\r\nThe reporters in the helicopters heard this (which almost made them deaf as well!) and looked up at 18's face. 18 couldn't see the people in the helicopters because she was too big, yet she knew she had their attention, so she continued, \"If you want a story so badly, why don't you report this...\" <br>\r\nAs soon as she finished, she began sucking air in very quickly, as she had done before with the people on the ground. The helicopters tried to fight the hurricane force winds, but to no avail. One by one, all the helicopters were sucked into the android's mouth. 18 felt a little prick as the blades of the helicopters came to an abrupt halt in her mouth, causing her to giggle for the first time in Dragonball history!<br>\r\n\"Hmm...hopefully they were reporting live, hehehe\", 18 said evily as she looked back down at the city in front of her. This time, she picked up entire buildings off their foundations and dropped them into her wet awaiting mouth; she didn't even chew the buildings, just swallowed. She kept eating and eating, as if her stomach had no limits. One by one, every skyscraper that used to stand proudly in the city was now travelling through the android's digestive track. The city was now no more, there were only a few people running for their lives away from the city. 18 didn't feel like wasting her time with them, she had just eaten an entire city. \"Besides, they will probably run to another city, which I'll probably eat as well\", she thought to herself and laughed. She then burped loud enough to make a window break and then stood up. She suddenly felt something as she was standing; it was a wierd sensation. What happens now?<br>\r\n</span></div></div>",
            "created":1141016400,
            "id":303725,
            "title":"A gigantic appetite"
        },
        "1232122121":{
            "choices":[
                "Full moon time"
            ],
            "content":"<div class=\"\"><div> <span>18 felt a weird sensation as she began to grow again. She now had one foot covering 3 feet away from the city and the other covering the entire city. Her feet were covered in sweat and blood, making it very squishy when she took a step. She was over 7 thousand feet tall, almost reaching the first level of the atmosphere.<br>\r\n<br>\r\nAfter letting out a belch, that felt like a powerful shockwave to anyone a few kilometers away from 18, she felt something in her ass. <br>\r\n<br>\r\nAfter scratching it, feeling wet from the pleasure, she then felt fur around it. <br>\r\n<br>\r\nAfter turning around, she noticed that she had grown a Saiyan Tail, over 9 feet long and 3 feet wide. She also found it very soft and fluffy when she touched it with her hand.<br>\r\n<br>\r\nThat was when she had an idea, when a full moon popped out she would look into it and complete her rule.<br>\r\n<br>\r\nThe power that could be at her fingertips made her moan in pleasure<br>\r\n<br>\r\n</span></div></div>",
            "created":1397365200,
            "id":1778428,
            "title":"She grows yet again"
        },
        "1232122122":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "18 eats Goku's house",
                "Gohan goes to rescue Videl...only to be swallowed"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n     18 felt that the feeling in her stomach was just the city digesting.  She never had a meal big as that before.  Normally, she wouldn't eat that much, but now that she was a goddess...well, it would be a waste being this big and not eat an entire city.  Rubbing her stomach, 18 walked to the next city.  She would eat a couple of cities first, than demand that the people worship her as a goddess.  And she would demand human sacifices whenever she felt like it.  Yes, 18 was on her way to taking over the world.  <br>\r\n     The next city she came too was bigger than the last city.  18 bended low over the city and started to suck people, cars, busses and small buildings into her waiting mouth.  There were hundreds of people on her tongue before she gulped them all down.  She next turned to the skyscapers, swallowing them down in one gulp.  18 rubbed her stomach, which wasn't half full yet!  <br>\r\n      <br>\r\n<br>\r\n         \"As you can see, we are still broadcasting in the stomach of this woman\" said the reporter in one of the many helicopters that was in 18's stomach.  The view behind the reporter was that of a roof of a skyscaper.  <br>\r\n         Gohan stopped eating when he saw 18 on TV.  So did Goku and Chi-Chi.<br>\r\n          \"What happened to 18?\" asked Goku.<br>\r\n          \"And what caused her to grow that big?!\" asked Chi-Chi.<br>\r\n           \"The dragon balls?\" suggested Gohan.<br>\r\n           \"Wait!\" said the reporter.  \"you're Videl, daughter of Herclue!\"<br>\r\n           Sure enough, there was Videl on TV.  <br>\r\n           \"Yes\" said Videl.  \"I've been trying to free everyone in here, but it's no use.  Maybe my husband and some of his friends could help\"<br>\r\n             \"How are we supposed to stop 18 when she's that size?\" asked Chi-Chi.  </span></div></div>",
            "created":1141016400,
            "id":303744,
            "title":"Reporting from 18's stomach"
        },
        "12321221221":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Go to the Son family's POV",
                "Go to Android 18's POV"
            ],
            "content":"<div class=\"\"><div> <span>As Goku, Chi-Chi, and Gohan pondered what to do with 18, the house shook a bit. <br>\r\n\"Did you feel that?\" Gohan asked.<br>\r\nGoku and Chi-Chi nodded to this as the house shook yet again. Pretty soon, the Son family noticed that it wasn't the house that was shaking, it was the ground.<br>\r\n\"Footsteps...Shes coming!\" Goku said.<br>\r\nBefore any of them could do anything though, the house really did start to move...right off its foundation!<br>\r\n\"Dammit\", said Chi-Chi aloud, \"I thought she was on our side!\"<br>\r\n\"Apparently not\", Gohan replied.<br>\r\nThe house started to rise and rise; the only reason why it was probably staying together so well is that Goku made the house strong in case of villains, not that it would matter now that they could destroy planets. The house suddenly stopped rising at what seemed like the height of an average mountain. <br>\r\nThe Son family was oblivious to what was happening, but they all knew that it was 18 out there, and she was not in a good mood.<br>\r\nGoku finally managed to power up and blast tons of furniture that fell on him when the house moved. After he was free to move about his messed up house, Goku headed toward the window and thought to 18 telepathically, \"18! What are you doing? Stop this nonsense and put my house back on the ground!\"<br>\r\n18 smiled at this and thought back, \"I'm sorry Goku, but that I can't do. See, I've been pretending I was one of the you ever since Cell arrived because I knew there was no way that I'd defeat any of you, but now I am the invincible one!\" At this she tilted her head back and laughed evily, making the windows on Goku's house shatter.<br>\r\nAt this Goku and Gohan turned into Super Saiyan 2's and prepared to jump out towards the Goddess android. She finally noticed and shaked her head as if she was tsk tsking them and said, \"uh uh, i'm the more powerful one so now I make the rules...and I say you are lunch!!!\"<br>\r\nWith that, the entire house moved toward 18's face as she opened her collosal mouth. She finally let go of the house and the Son family along with their home flew into the Goddess's mouth. She wasted no time enjoying the shear power of what she was doing. She smiled as she felt two Super Saiyan 2's attacking her mouth, trying to break free. It felt only like minor pricks on the inside of her mouth. She once again spoke telepathically, this time to all three of them, \"It dosn't matter what you guys do your still going to my belly! Hahahaha!\"<br>\r\nWith that, she swallowed Goku's house, along with Goku and Gohan at SS2, and also with Chi-Chi still inside the house doing the \"what did i do wrong\" speech. <br>\r\nThe house slowly traveled down as 18's throat slowly squeezed it toward her belly. 18's laugh could still be heard when the house landed on the warm, moist surface of the android's stomach.<br>\r\n</span></div></div>",
            "created":1141016400,
            "id":303763,
            "title":"The Son house no more"
        },
        "123212212211":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Switch to the Son Family",
                "18 has some fun with the next city"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n   The Son family house landed on a 'dry' patch of stomach floor.  Goku and Gohan managed to save Chi-Chi from being crushed under the stove as it fell to the house's floor thanks to the house's landing within the stomach of 18.  <br>\r\n      The Son family walked out of the house to see 18's vast stomach.  Here and there, they could see electric lights and headlighs from cars.  Some sections of the cities that 18 had eaten still had power, thanks to the fact that 18 had swallowed several power plants along with the two cities in her stomach.  The 'floor' of the stomach was devoid of stomach acid, but made squishy sounds as you walked on it.  <br>\r\n     The stomach was so vast that the Son family couldn't see the sides of the stomach, or the 'roof' of the stomach so many miles up.  <br>\r\n         \"Great\" said Gohan.  \"how are we supposed to get outta here?\"<br>\r\n          \"It would be impossible\" said Gohan.  \"18 is so large that she couldn't feel our attacks on her\"<br>\r\n        \"That's right\" said 18, speaking telepathicaly to Gohan.  \"you're all small ants to me now\"<br>\r\n        \"18 is large because of the dragon balls\" said Goku.  \"what else could make 18 so big?\"<br>\r\n        \"But the dragon balls won't be in here\" said Chi-Chi.  \"They scatter everytime someone makes a wish.  I doubt that 18 could catch them as they're scattering\"<br>\r\n       \"And besides\" said Gohan.  \"the dragon balls turn into ordinary rocks once the dragon's been summoned\" <br>\r\n         \"I think 18 was right\" said Chi-Chi.  \"nothing can stop her now\"  <br>\r\n           <br>\r\n<br>\r\n           18 was walking her way towards yet another 'big' city.  She wasn't going to eat the city...yet.  She'll let the people have a head start and then eat the city.  Nothing could escape her.  Everything would end up in her belly.  By the time her stomach is full, she would've ate everything on Earth.  <br>\r\n       18 was passing by a lake just then.  It was a pretty good-sized lake, even to the giant android.  She smirked when she saw boats on the lake and tiny little humans swimming in it.  18 bended over and stuck her head in the water.  There, she sucked up the water and everything that was in it or on it. In 5 short minutes, the entire lake was in her stomach.  <br>\r\n       \"Yum, that hits the spot\" said 18.  </span></div></div>",
            "created":1141016400,
            "id":303787,
            "title":"18's feast continues"
        },
        "1232122122111":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Its Krillin and Roshi",
                "Its yours truly  *ahem*"
            ],
            "content":"<div class=\"\"><div> <span>As the Son family and countless others looked up in the massive belly of the android, a wall of water came crashing down. It was as if niagra falls had just opened up over them. Many people tried to desperatly flee the raging waters. Luckly, the water finally settled in the lower part of 18's belly. Everyone in the stomach was drenched with lake water by then. <br>\r\nA while went by without anyone saying a word. Everybody knew what was happening but nobody knew what to say. Gohan finally broke the silence by getting very angry and flying up. Turning Super Saiyan 2, he started throwing Kamehamehas and Masenkos at the side of 18's stomach walls. <br>\r\n<br>\r\n(Meanwhile, outside of 18's body)<br>\r\n18 felt little pricks on the inside of her belly. This made her smile and rub it, saying, \"Aww whats a matter? Don't want to be eaten by a gorgious woman like me?\"<br>\r\nThis voice was loud enough to be heard inside her, as she felt the attacks stop. She simply laughed at this, and waited for the next city to panick enough for her pleasing.<br>\r\n<br>\r\n(Back in 18's stomach)<br>\r\nGohan quickly tired himself out and went back to normal as he descended back onto the ground. Goku then approached him and said, \"I know your mad son, but your not going to get out of here just by attacking the wall...why do you think I didn't turn into a Super Saiyan 3 or 4? Just conserve your energy, we have to use our heads to win this fight.\"<br>\r\nGohan looked up and said, \"okay.\"<br>\r\nSuddenly, a familier sound could be heard by the the two of them; it was the sound of someone flying!</span></div></div>",
            "created":1141016400,
            "id":303823,
            "title":"The flood and the rage"
        },
        "12321221221111":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Bulma just happens to be working on a shrinking ray",
                "18 has some fun in the city before eating it"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n    Krillin was flying towards the three Son family members.  Krillin was carrying Master Roshi with him.  Roshi had never learned to fly (since he was the oringal owner of the Nimbus Cloud), so Krillin was carrying Roshi to Goku and family.  Those two weren't the only ones flying towards the trio; Videl was also flying towards her in-laws.  <br>\r\n         \"Ah, I was wondering if you were going to show up\" said Krillin, landing on the floor of 18's stomach.  Videl landed beside Gohan.<br>\r\n         \"So, how are we gonna get out of here?\" asked Videl.<br>\r\n          \"I don't think we can\" said Goku.  \"18 will just swallow us again if we get out of her belly\"<br>\r\n         \"I argee\" said Roshi.  \"but what's so bad about being in a stomach of a babe like 18?!\" (you gotta love that perv, lol)<br>\r\n         \"Well, I didn't imagine spending the rest of my days in the belly of Android 18\" said Gohan.<br>\r\n            \"We need to come up with a plan\" said Krillin.<br>\r\n          There was a pause.<br>\r\n         \"Hey, why aren't we digesting?\" asked Videl.<br>\r\n          \"You know, I've been wondering about that\" said Gohan.  \"maybe 18's stomach doesn't digest food anymore since she's an android now\"<br>\r\n          \"Maybe\" said Krillin.  \"she doesn't eat that much...well, when she was normal-sized\"<br>\r\n         \"Maybe Bulma has something that can shrink 18 down to size\" suggested Goku.<br>\r\n          <br>\r\n<br>\r\n<br>\r\n    *Outside*<br>\r\n<br>\r\n     18 rubbed her stomach, missing the tickling of the attacks by Gohan.  Those attacks didn't hurt her, in fact they made her giggle again.  How she loved being a goddess now!  <br>\r\n      18 spotted a city on the horizon.  She also spotted Kami's lookout.  Or..was that Dende's Lookout nowadays?  It didn't matter either way.  The Lookout came to 18's neck, which impressed her.  She didn't realize that the lookout was so high in the air.  She smiled as she reached for the lookout and swallowed it in one gulp.  Then, she headed for the city.  <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1141016400,
            "id":303839,
            "title":"Lookout on the way down"
        },
        "123212212211111":{
            "choices":[
                "SSJ5 Gohan kills Android 18",
                "SSJ5 Gohan turns on his family and then kills Android 18"
            ],
            "content":"<div class=\"\"><div> <span>As Bulma was working on a shrinking ray, Gohan's fury was overpowering his conscious. Tired of wasting any more of energy, the stressed out Gohan began to glow with energy attempting to transform into a Super Saiyan 3 but failing miserably due to his half saiyan blood. Fortunately the stress did cause Gohan to grow his tail back. Taking advantage of the situation Vegeta suddenly appeared and threw a lunar blast in the bowls of 18's gut. \"NOW KAKAROT'S SON! DESTROY THE UNIVERSE! MWAHAHAHA!!!!\"<br>\r\n<br>\r\nBulma sighed to Vegeta's senseless rambling and continued working on her shrinking ray. \"That man. Sometimes I worry about him.\" <br>\r\n<br>\r\n\"VEGETA NO!!!!\" Goku shouted with all the air in his lungs as Gohan transcended to a Golden Oozaru. \"Vegeta, why did you do that? Didn't I say you couldn't break out of here even if you turn SSJ4? Anyways, how did you get in here?\"<br>\r\n<br>\r\n\"There is no time for answering your questions, clown. Soon my master plan will come into being and we will all be free!\" Vegeta exclaimed with pure delight. <br>\r\n<br>\r\n\"But Vegeta...\" Goku said before being cut off by Vegeta.<br>\r\n<br>\r\n\"Don't you find it strange that whenever your son transforms he ascends to a powerlevel far greater than our own. Even now he potentially has as much power as we either have as Super Saiyan 4 as just a mere Super Saiyan 2. So just imagine how powerful he'll become as a Super Saiyan 4 unless he should ascend to a higher level, Kakarot.\"<br>\r\n<br>\r\n\"You don't mean?\" Goku questions Vegeta.<br>\r\n<br>\r\n\"YES! KAKAROT! Super Saiyan 5!\" <br>\r\n<br>\r\n\"GRAAH!\" Gohan screeches out as his body begins to glow again and transcends into a Golden Super Saiyan 4. <br>\r\n<br>\r\n\"AHAHAHA! Success, Kakarot. Now let's see if miss Goddess Android can handel the power of a true god,\" Vegeta declared to Goku and his friends. <br>\r\n<br>\r\n </span></div></div>",
            "created":1227157200,
            "id":610019,
            "title":"Bulma just happens to be working on a shrinking..."
        },
        "123212212211112":{
            "choices":[
                "SSJ5 Gohan kills Android 18",
                "SSJ5 Gohan turns on his family and then kills Android 18"
            ],
            "content":"<div class=\"\"><div> <span>As 18 made her way to South City, to devour it, Gohan's fury was overpowering his conscious. Tired of wasting any more of energy, the stressed out Gohan began to glow with energy attempting to transform into a Super Saiyan 3 but failing miserably due to his half saiyan blood. Fortunately the stress did cause Gohan to grow his tail back. Taking advantage of the situation Vegeta suddenly appeared and threw a lunar blast in the bowls of 18's gut. \"NOW KAKAROT'S SON! DESTROY THE UNIVERSE! MWAHAHAHA!!!!\"<br>\r\n<br>\r\nAndroid 18 took a moment to notice what was going on inside of her, but turn her attention back the city. <br>\r\n<br>\r\n\"VEGETA NO!!!!\" Goku shouted with all the air in his lungs as Gohan transcended to a Golden Oozaru. \"Vegeta, why did you do that? Didn't I say you couldn't break out of here even if you turn SSJ4? Anyways, how did you get in here?\"<br>\r\n<br>\r\n\"There is no time for answering your questions, clown. Soon my master plan will come into being and we will all be free!\" Vegeta exclaimed with pure delight. <br>\r\n<br>\r\n\"But Vegeta...\" Goku said before being cut off by Vegeta.<br>\r\n<br>\r\n\"Don't you find it strange that whenever your son transforms he ascends to a powerlevel far greater than our own. Even now he potentially has as much power as we either have as Super Saiyan 4 as just a mere Super Saiyan 2. So just imagine how powerful he'll become as a Super Saiyan 4 unless he should ascend to a higher level, Kakarot.\"<br>\r\n<br>\r\n\"You don't mean?\" Goku questions Vegeta.<br>\r\n<br>\r\n\"YES! KAKAROT! Super Saiyan 5!\" <br>\r\n<br>\r\n\"GRAAH!\" Gohan screeches out as his body begins to glow again and transcends into a Golden Super Saiyan 4. <br>\r\n<br>\r\n\"AHAHAHA! Success, Kakarot. Now let's see if miss Goddess Android can handel the power of a true god,\" Vegeta declared to Goku and his friends. <br>\r\n</span></div></div>",
            "created":1227157200,
            "id":610025,
            "title":"18 has some fun in the city before eating it"
        },
        "12321221221112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "He leads them towards the opening of the mouth",
                "Number two...."
            ],
            "content":"<div class=\"\"><div> <span>As the sound grew louder, Goku and Gohan knew right away that it was the sound of someone flying using ki, but who? Finally, a figure could be seen flying towards them. No details could be seen of this strange being, all that could be seen was a single sword on the person's back, sort of like trunk's. <br>\r\n\"Who's that?\" Goku asked as the figure got closer.<br>\r\nGohan simply shook his head in confusion and said, \"One of the Z team maybe?\"<br>\r\nGoku didn't buy it though, \"Nah, I don't recognize the energy, its someone new.\"<br>\r\nFinally, the being came into full view and landed in front of the two saiyans. He looked as if he were 17 years old and had medium long black hair. He also had a scar under each eye, forming sort of like X's.<br>\r\n\"Looks like you two could use a hand\", the man said in a calm voice.<br>\r\nGoku and Gohan just stared in silence before noticing that he had a tail!<br>\r\nGoku, being his usual discrimitary self against saiyans, put his guard up and said, \"your a saiyan arn't you!\"<br>\r\n\"Yes\", the man replied, \"but not an evil one.\"<br>\r\nGoku and Gohan looked at each other and then back at the mysterious man.<br>\r\nGohan then spoke, rather skeptically, \"Who are you, and what can you do to help us?\"<br>\r\n\"My name is Gotan and I can help you get out of here\", the man replied.<br>\r\n\"how?\" Goku asked.<br>\r\nGotan simply smiled at this and said, \"I come from a world of saiyans, yes. Though its probably not the one you are thinking of. My home planet is called Collossu, it is located in the south galaxy; its one of the few planets that were not destroyed by Broly.\"<br>\r\nGoku and Gohan exchanged confused faces. <br>\r\n\"On the planet there are two types of saiyans...the small ones, and the big ones. The small ones are about the size of you and me, we were actually pioneers from the old planet Vegeta. We fled the planet due to Frieza and the planet pirating business\", Gotan continued.<br>\r\nThere was a short pause in his voice and then he finally said, \"The other type is the big kind of saiyans; they are kinda like us but not. They are very much like saiyans and have the same basic abilities, only they are about as big as this woman that has seemed to grow herself. I can help you because I've been eaten many times...it happens on my world...\" <br>\r\nGotan seemed to be a bit embarrased as he said this, but then put on his serious face once again. <br>\r\nGoku and Gohan were having trouble in believing the young man's story, but they were screwed either way.<br>\r\n\"Hmm, well...might as well trust him, things can't get any worse\", Gohan said.<br>\r\nTo this Gotan smiled and said, \"Follow me then, and don't forget the girl.\"<br>\r\nTo this Chi-Chi's face got solid red and she screamed, \"I am not a girl!!!I'm a woman!!\"<br>\r\nTo this everyone fell anime style.</span></div></div>",
            "created":1141016400,
            "id":303838,
            "title":"Gotan, the Vore expert (Gotan is my nickname btw)"
        },
        "123212212211122":{
            "author_id":"peacefrostwolf",
            "author_name":"frostwolf",
            "choices":[
                "they all go down and 18 does a #2",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>apparently the lights mis guided them, because they moved farther into androids bowels. Pretty soon, everyone was heading toward the bottom of her stomach. this mmade her feel full, and they all got coated in acid as they were sucked into her intestines/rectum.</span></div></div>",
            "created":1358744400,
            "id":1513188,
            "title":"Number two...."
        },
        "124":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Videl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266812,
            "title":"POV"
        },
        "1241":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Videl grows fast",
                "Videl grows slowly"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n  You're a worker at the famous Capsule Corp.  which makes all sorts of useful things.  You have worked for the company for 12 years now.  You're the head of security, not that anybody attacks Capsule Corp.  Capsule Corp. had always had strange protection.  That protection came in the from of several remarkable people.  People who had saved the world several times.  You know all these people by name, for some of them live at Capsule Corp HQ.  Dr. Brief's daughter is even married to one of these supermen.  <br>\r\n       It was a dark and story night, and you were at your post, safe and dry in the building.   All of your staff has left for the night, and your shift is about over.  Capsule Corp.  hardly received anybody past midnight.  Suddenly, the doors open and in walked in Videl, daughter of Hercule.  Videl was another wife to one of those world-saving people.  She usually visited Capsule Corp.  in the day, making this quite an unusuall change.  <br>\r\n          \"What can I do for you?\" you ask, as Videl came to the front desk.<br>\r\n          \"Is Gohan here?\" asked Videl.  <br>\r\n          \"No\" you say.  \"he was here, but he left some time ago\"<br>\r\n          \"Well, I'm here to see Bulma\" said Videl.  <br>\r\n          \"Oh right\" you say, picking up the phone and punched in the number of Bulma's room.  Bulma answered it on the first ring.  <br>\r\n       \"Videl is here to see you\" you say.<br>\r\n      \"Oh right!\" said Bulma.  \"I almost forgot!  Escort her to Lab 4\" <br>\r\n        \"I believe she knows where that is\" you say.  <br>\r\n         \"Just do it\" said Bulma, sounding angry.<br>\r\n         \"Okay\" you say, hanging up the phone. <br>\r\n         You fall in step behind Videl as she walks towards Lab 4.  Once or twice, Videl glances back at you.  She licks her lips the second time she glances back.  You smile back, not knowing why Videl was looking at you in hunger. <br>\r\n          Videl and you enter Lab 4.  Bulma was already there, working at a machine at the far end of the room.<br>\r\n        \"Bulma?\" asked Videl, walking towards Bulma.<br>\r\n        \"Yes, yes\" said Bulma.  \"come over here, and you too\"<br>\r\n          The machine that Bulma is working on looks like something you stand in.  <br>\r\n          \"Is this the machine you've told me about?\" asked Videl.<br>\r\n        \"Yes\" said Bulma.  \"Gohan had to go home.  Chi-Chi and Goku are going on vacation, and Gohan is going to help pack\"<br>\r\n        \"That's alright\" said Videl.  \"I'll get Gohan sooner or later\"  The two girls giggled.  What was going on?<br>\r\n         \"Well, it's ready\" said Bulma.  <br>\r\n         \"Good\" said Videl.   Videl steps into the machine.  Bulma activates the machine and the machine hummed.  5 minutes later, the machine stopped and Videl steps out of it.  </span></div></div>",
            "created":1123736400,
            "id":266831,
            "title":"Lab 4"
        },
        "12411":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "She \"haves\" you now",
                "Wait until she gets Gohan"
            ],
            "content":"<div class=\"\"><div> <span>You are completely bewildered as to what the two women are up to, yet you go about minding your own business. You try to ignore their laughing, but this proves quite impossible, because out of the corner of your eye, you see something that makes you think twice about whether or not you are dreaming. Videl starts to grow, and at a very high pace! You are frozen in terror as the girl you just escorted inside this lab, a girl who was just a minute before shorter than you, is now touching the cealing of the enormous laboratory. You look back and see Bulma smiling, as if satisfied with herself. You hear a crack above you and look up to see cracks starting to appear at the cealing of the warehouse-sized room. You now realize that Videl is so big that not even this huge lab can fit her! Her head is now completely outside and all you can see is her massive body (now clothless obviously). You again look at Bulma and see her punch a button on the wall. All of a sudden, you hear a deafening noise coming from above and look up to see what it is. When you do, you see the entire cealing moving apart, as if they were doors. The two halves of the cealing (whatever's left of them) finally dissapear on each side of the room, revealing the dark sky above. Water is falling inside the room but Bulma dosn't seem to be worrying about the equipment. You look back up and for a minute, you can't help but notice the beauty of what you are seeing. You do admit to yourself that you have always liked the idea of a giantess, but you never thought you would see one. Videl is looking off in the distance above you, and finally she looks down at you. You can hear Bulma next to you say, \"Hurry up a grab this guy so I can close the door\". You are not sure why she said this, but you don't have time to think, because you feel something sqeezing you hard. Once you are used to the pressure you realize that the giantess has just grabbed you! You feel a sudden rush and you accelerate into the air very quickly. You expect to see the roof of the building or Videl's face, but when you look down you realize that Videl is now flying away from the building! She looks at you and says, \"Should I have you now, or should I wait until I get Gohan?\" You have no idea what she means by this, but you do know it can't be good.</span></div></div>",
            "created":1129179600,
            "id":278560,
            "title":"Videl's Sudden Growth"
        },
        "124111":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Videl meets up with Gohan",
                "You explore Videl's innards"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n  \"I'm pretty hungry\" said Videl.  \"so, in you go!\"<br>\r\n    With that, the giantess tosses you into her mouth!  She doesn't chew, she just rolls you around her big mouth.  Her tongue is smooth and slimy.  Soon, you are drenched in salvia.  That's when Videl swallows you.  The journey down her throat was a quick one.  You are forced through a ring of muscle and enter a large chamber--her stomach.  You land in the stomach with a loud 'SQUISH' and you expect to be digested in a matter of minutes.  But...you don't digest.  You don't even feel the burn of the stomach acids that surround you.  What was  going on?  <br>\r\n      \"Hmm...Delicious\" said Videl's voice from all around you.  <br>\r\n      You have no hope of climbing out of the stomach; the walls are far too slippery to climb.  So you decide just to wait and see what happens next.<br>\r\n       Why aren't you being digested?  Maybe that machine did something else to Videl.  </span></div></div>",
            "created":1129179600,
            "id":278602,
            "title":"Videl's stomach"
        },
        "1241111":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Time to Chow!",
                "Continue to Gohan"
            ],
            "content":"<div class=\"\"><div> <span>(Switches to Videl's POV)<br>\r\nVidel flew over West City, still amazed that the machine had actually worked. Bulma had brought the idea of growint up after just a few days ago, when Videl was complaining about Gohan's lack of attention. In fact, he was now back into fighting and let his work life rest a little. She wasn't mad about that; what she was mad about was he would always be training when he SHOULD be paying attention to her! She didn't care much anymore, though. She had a plan (I bet you all know what that is!) that would garentee them spending more time together. She was now leaving West City, and the rain was now stopping down below (she was flying above the clouds). She could feel you inside her stomach. It was a good feeling, especially the feeling of power it gave her. She also couldn't help but notice how much flavor someone of that size could have! Videl was now flying above a small city. She could very easily (and gladfully) go and eat more people, yet she DID want to get to Gohan.</span></div></div>",
            "created":1129179600,
            "id":278685,
            "title":"Satisfaction of the Giantess"
        },
        "12411111":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Videl sees another small town",
                "Videl meets up with Gohan"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n   Videl's stomach gave a mighty growl.  She smiled wickedly and landed in the middle of the small town.  The town only had up to 3,000 people in it, Videl guessed.  At this time of night, the town's streets were empty and few people were out and about.  Videl looked around, feeling like a kid in a candy store.  She didn't knew where to begin her feast.  Then,  she noticed a sweet shop.  She licked her lips and ripped off the roof to the shop.  There, Videl ate all the cakes, candies and people that were in the shop.  She was careful not to chew anybody.   Of course, the people that Videl swallowed would stay alive within her stomach.  Videl had asked Bulma for that feature, for Videl didn't want to kill anybody.  Some people did recongize her before she ate them. <br>\r\n      After the sweet shop was empty, Videl moved to the grocery store.  There, Videl bended over and put her mouth over the entrance and sucked all the food and people that was in the store into her mouth.  People had no hope of fighting off the sucking of Videl, so they went flying into her mouth down to her stomach to join you.<br>\r\n       After that, Videl moved to the residental streets.  She ripped off roofs of houses and eat all the people in there.  <br>\r\n      A little over an hour later, there was no people left in the small town.  Videl rubbed her people-filled belly.  She enjoyed the sense of power she had over the people in her stomach.  <br>\r\n        \"Your turn is coming, Gohan\" said Videl as she flew off into the night sky. </span></div></div>",
            "created":1129266000,
            "id":278735,
            "title":"Videl's feast"
        },
        "124111112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Videl eats Goku's house",
                "Videl eats Gohan"
            ],
            "content":"<div class=\"\"><div> <span>Videl figured that eating a town was quite enough for now. After all, she was way to anxious to get Gohan. Part of the reason why she stopped at this town was just to savor the feeling of all this power. She couldn't forget about why she grew herself in the first place. She headed east towards Goku's house. She heard that he would be helping Goku pack for a vacation, so he must be there. It wasn't a long trip; after all, she WAS flying! She saw the house in the distance. The house was even smaller than she thought it would be. In fact, she could probably swallow the whole house if she felt like it! It didn't seem like good enough revenge on Gohan though; he might not even know who it was if she did that, and that is not what she wanted. She wanted him to see her right before she ate him. She could just wait for him to come out and surprise him. </span></div></div>",
            "created":1129266000,
            "id":278783,
            "title":"A New Thought of Revenge"
        },
        "1241111122":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Videl eats more people",
                "Videl does something naughty"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n   Videl landed a little ways from Goku's house as softly as she could.  She was perhaps 20 feet from the house.  Indeed, there was Gohan packing the car.  Goku and Chi-Chi was nowhere to be seen...probably asleep in the house.  Gohan continued to work, not noticing the gigantic Videl not 20 feet away.  Videl could feel all the people in her tummy move around.  Soon, she would feel Gohan move around in her tummy too.  <br>\r\n       \"That's the last of 'em\" said Gohan, as he threw one more bag atop of the car.  That's when Videl made her move.  Before Gohan could react, he was in Videl's fist.  She brought Gohan up to her bill-board sized face and smiled.  Gohan's eyes grew wide and tried to struggle out of Videl's hand.  When Videl's hand refused to move, Gohan turned into a Super Saiyan.  Gohan was able to move Videl's fist an inch or two apart, but couldn't get loose of the vice-like grip that Videl had on him.<br>\r\n        \"Hi there, Videl\" said Gohan.  \"When did you get so big?\"<br>\r\n          \"You can thank Bulma for this\" said Videl.  \"but let's forget about her.  Let's talk about us\"<br>\r\n        \"Us?\"<br>\r\n       \"Yeah\" said Videl.  \"you've been ignoring me for sometime now.  Well, I'm going to make sure you don't ignore me anymore\"  She said this with a laugh, allowing Gohan to see into her mouth.  A second later, Gohan was tossed into the mouth of Videl.  Videl's tongue was stronger than the puny Gohan, even when he was a Super Saiyan.  Videl quickly swallowed Gohan,  not wanting him to escape.  Gohan was by far the most delicious person she had ever eaten that night.  <br>\r\n        \"Enjoy my stomach, Gohan\" said Videl.  \"I'll let you out....eventually!\"  </span></div></div>",
            "created":1129266000,
            "id":278789,
            "title":"Super Saiyan snack"
        },
        "1241112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You continue to the intestines",
                "You give the energy a try"
            ],
            "content":"<div class=\"\"><div> <span>You conclude that the machine must have been planned to make her acids non-lethal, but why? You don't think about this too long because let's face it, you are in the stomach of Videl! You know that finding a way out of here would be a much better thing to do with your time. \"Hmm, how do I get out of here?\" you ask yourself but stop right after. A chill runs down your spine because you know exactly how you would get out, the natural way. You stop thinking about it though. \"This is a human body, there must be another way out!\" You mumble to yourself as you make your way across the pool of acid. You feel a wall, probably the side of Videl's stomach. It is slimy and slippery. You know that there are no places to climb, and you conclude that the only way out would be the intestines. An idea does come to your mind though; its a longshot, but its still an idea. While you worked at CC (Capsule Corp.), you got to know all these superior fighters personally. In fact, you even learned from Goku how to form small amount of that light that they use to fight with. You know that it is very hard to make, and you only did it once, but it might be worth a shot. At least you would be able to see down here. </span></div></div>",
            "created":1129179600,
            "id":278691,
            "title":"Videl, Up Close and Personal"
        },
        "12411122":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "You try to fly out of the stomach",
                "you see another way out"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n     You only tried to make a ball of energy once.  It was VERY hard, and it was really weak.  Goku was impressed with your effort, however.  You begin to form the energy ball within your two hands.  It takes a full ten minutes to gather enough energy to light the stomach.  The ball of energy was slightly brighter than the average flashlight, so you could see Videl's stomach better.  The remains of Videl's dinner is floating around your legs, making you gasp.  You see the entrance to the intestines.  You see no other exits, save the one high above you.  Videl had taught you to fly, but you were never good at it.  You really don't want to exit through her intestines.  <br>\r\n       <br>\r\n          </span></div></div>",
            "created":1129266000,
            "id":278707,
            "title":"Energy Gathering"
        },
        "124111221":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Gohan crashes into you!",
                "You can't get through!"
            ],
            "content":"<div class=\"\"><div> <span>\"Its worth a shot\", you think to yourself. It would be hard though, since making regular energy was in itself a challenge. Before you start on this hard task, your mind wanders a little; mainly on why Videl would do this to you to begin with. She was always very nice to you and you even met her whole family, including your FORMER hero, Mr. Satan. Once you learned energy however, you really got to see just how much of a fraud Mr. Satan was. You half hoped that he would be on Videl's menu, just to see something not go his way for once. You concentrate your hardest to direct your energy to your feet, and slowly you feel yourself rising out of the stomach acid. You are amazed at how quickly you were able to do this as a posed to forming the energy. You try to control the energy enough to bring you up to the opening of Videl's stomach when all of a sudden, something happens!</span></div></div>",
            "created":1129352400,
            "id":279010,
            "title":"Flying is a cinch"
        },
        "1241112211":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Goku's house comes into the stomach",
                "Goten enters the stomach"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n      You might've made it out of Videl's mouth, if it hadn't been for Gohan crashing into you.  You only get a split-second look at Gohan before he crashes into you.  You stop flying and fall back to the stomach acid, along with Gohan.  Gohan was able to stop himself from entering the stomach acid.<br>\r\n      \"Umm....Hi there\" said Gohan.  <br>\r\n     \"Hello\" you say.  <br>\r\n     \"Funny meeting you here\" said Gohan.  \"so...uhhh...what happened at Capsule Corp?\"<br>\r\n     You explain to Gohan what has happened thus far.<br>\r\n     \"Videl said something about Bulma...\" said Gohan.<br>\r\n    \"I was about to fly outta here when you came\" you say.<br>\r\n     \"Who taught you to fly?\" asked Gohan.<br>\r\n     You gesture at the stomach walls.  <br>\r\n      \"Videl, huh?\" asked Gohan.  \"well, I must say, I'm quite impressed.  Not everybody can fly\"<br>\r\n        Videl told you that Goten, Gohan's little brother, mastered flying pretty much when he learned how to.  Of course, Goten had better pratice at gathering energy then Videl was back then.  <br>\r\n       \"So I've heard\" you say.<br>\r\n      \"So...why did Videl ate you?\" asked Gohan.  <br>\r\n      \"I dunno\" you say.  \"I suppose she was HUNGRY!\"<br>\r\n     \"Oh yeah...\" said Gohan, who had a sweatdrop. <br>\r\n     \"I spent 20 minutes to get in the air\" you say.  \"and now...\"<br>\r\n       You both hear a 'gulp' from above you and...</span></div></div>",
            "created":1129352400,
            "id":279034,
            "title":"Gohan joins you"
        },
        "12411122112":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Through Videl's body!",
                "Someone else gets eaten"
            ],
            "content":"<div class=\"\"><div> <span>Goten flew into the giant stomach where you and Gohan were. He landed into the acid, making a big splash. When he finally surfaced, he did so with the funny upside down \"U\" shaped eyes. He scratched the back of his head and said, \"Well, guess I wasn't quick enough!\" This causes Gohan to fall anime style and land into the acid. \"Great..\", Gohan sihed while Goten and you (you couldn't help it) started laughing. Gohan didn't seem to think it was funny. He seems to keep his cool though and instead he turns to you and says, \"We should probably find another way out of here. I mean, if we fly out through her mouth, she will feel us in there and just swallow us again\" Goten seems to be kind of confused. \"But Gohan, won't a Super Saiyan's speed be enough to make it out before she notices?\" Gohan shakes his head to this and says, \"No, trust me, her mouth would be too quick\"<br>\r\nGoten can't help but chuckle a little at this and says, \"I think I know how you know that!\" Gohan gets a little red and says, \"Shut up Goten\" He then turns to you and asks, \"Did you find any other way out?\" You say nothing. Instead, you look down to the exit of the stomach. Gohan and Goten seem to get the idea. Gohan doesn't say anything. Since Gohan was at a Super Saiyan, the whole stomach was lit up. \"Hmm, we could always make a hole in the stomach or something\", Goten says. This makes Gohan's head grow twice the size. He then says angrily, \"NO WAY I'M NOT LETTING YOU BLAST HOLES INTO VIDEL!!!\"</span></div></div>",
            "created":1129438800,
            "id":279106,
            "title":"A Journy Begins?"
        },
        "124111221121":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Videl has 'fun' with you three",
                "The army comes to attack Videl"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n  \"Well, I guess there's no other choice\" you say.  \"we take the natural way out\"<br>\r\n       Gohan nods.  <br>\r\n       Gohan grabs you and Goten and fly into the intestines.  Compared to the massive stomach of Videl, the intestines were cramped.  Gohan had barely enough room to fly.  Since Gohan was a Super Saiyan, the trip through the intestines is short.  Once Gohan had entered the Large Intestine, the trip sped out considerably.   Gohan flew out of Videl's rear...which wasn't as easy as it sounded, because Videl had clenched her butt cheeks together.  However, Gohan was strong enough to push the massive cheeks apart, allowing you and Goten to exit her body.  Videl grabs the three of you and bring you three up to her face.<br>\r\n      \"Very good...you've escaped\" said Videl.  \"but this isn't over, my dear Gohan\"<br>\r\n       Gohan and Goten try to push Videl's fist apart, but the super-sized Videl has a vice-like grip.<br>\r\n      \"The 'great' Saiyaman can't escape from me\" laughed Videl.  \"in fact, nobody can escape from me now\"<br>\r\n        Gohan and Goten gave up and awaited for Videl's next torture.  You can't beileve how strong Videl is.  Must have gotten it from her father.  Mr. Satan might be a phony, but he IS strong.  <br>\r\n           \"What shall I do with you three next?\" asked Videl.  <br>\r\n</span></div></div>",
            "created":1129438800,
            "id":279213,
            "title":"Out of the frying pan..."
        },
        "1241112211212":{
            "author_id":"malee7",
            "author_name":"Function",
            "choices":[
                "the jets fly around videl shooting her",
                "a helicopter lands and brings you,s back to the aircraft carier"
            ],
            "content":"<div class=\"\"><div> <span>over sea: videl opens her mouth wide and  holds you up to her lips showing her shiny teeth when you hear a loud noise you look to see what it was. you see two battleships a fleet of jets and a aircraft carrier moving towards you ( bang) the big guns go off and a part of videls hand explodes. Screaming she lets go of you. you fall for what seems to you like forever you look at gohan and goten the apear to have fainted from the presher of videls grip. Darkness closes in around you. You too fiant</span></div></div>",
            "created":1257397200,
            "id":787350,
            "title":"the start of the battle"
        },
        "12411122112122":{
            "author_id":"malee7",
            "author_name":"Function",
            "choices":[
                "she eats the carrier",
                "she use,s a energy blast to destroy the carrier "
            ],
            "content":"<div class=\"\"><div> <span>you wake up to the sight of a huge explosion. you can hear people yeling around you. You single out gohans voice.<br>\r\ngohan: No you cannot defeat her pull your men out now!<br>\r\n<br>\r\n???: i am highest rank here! and i say we keep attacking it. Hit it anoth times and it will fall<br>\r\n<br>\r\ngohan: No she,l kill you all!<br>\r\n<br>\r\n???: captin get this man of the bridge!<br>\r\n<br>\r\n<br>\r\ncaptin: yes sir!<br>\r\n<br>\r\n( you get up and look out the bridge window you see videl throw two ki blasts they hit the two battle ships destroying them. She turns. Now faceing you she slowly walks towards you smilling)<br>\r\n<br>\r\nvidel: ha ha ha haaa........did you expect me to be defeated like that? I,l destroy YOU!<br>\r\n<br>\r\n Now running towards you she say,s fee five fo fum i smell the blood of sayian man!</span></div></div>",
            "created":1257397200,
            "id":787369,
            "title":"the carrier"
        },
        "125":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Pan",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1123736400,
            "id":266801,
            "title":"More choices"
        },
        "1251":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You",
                "Pan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose point of view will this story be from?</span></div></span></div>",
            "created":1123736400,
            "id":266808,
            "title":"POV"
        },
        "12511":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Pan's Mouth",
                "Next one"
            ],
            "content":"<div class=\"\"><div> <span>You were confused to where you are and the last thing you remember was falling asleep in your bed. To your surprise, you have shrunk! \"WHAT THE HELL?! WHY AM I SMALL AND WHERE AM I?!\" you said and soon the ground started to shake and you look around yourself it looks like some sort of room like for an adolescent tomboy girl. Then, a girl screams as she looked down at you and said \"Ugh what is THAT?!\" and girl lifted up her like she is going to squish you and you yelled out, \"NO DON'T!! I DON'T KNOW WHY I'M HERE!!\" then the giant girl stopped after hearing that and slowly put her foot down. \"So, you don't know. What's your name? Mine's is Pan.\" said Pan, \"My name is ___________ nice to meet ya.\"  you said. But suddenly, your mind just cannot stop on how hot Pan's body is for a young girl and also you noticed she has big boobs as well and Pan notices this. \"So you like my body huh?\" said Pan as she teases you. So, you nodded to it as an answer. Then Pan gets an idea and says, \"Hey, _________ how about I let you live in my body! I mean you don't home at all. How does that sound? You can also pick if you want!\" said Pan and you have easily agreed to the terms.<br>\r\n<br>\r\n\"Okay little guy, you get to choose the following parts of me. It is either my mouth, my big boobs, my wonderful big ass, or my smooth pussy?\" said Pan as she point to her mouth, feels her breasts and then, turns around to show her ass in her jeans and takes her one of her finger-less gloves go under her and slides up and down on her pussy that was popping out in the fabric and moans in anticipation. You had thought long and hard (don't get the wrong idea) and you made a decision and you choose...</span></div></div>",
            "created":1416459600,
            "id":1890350,
            "title":"A WINNER IS YOU!!! (Sudden +18 Go Back)"
        },
        "125112":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "YEP!",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So it's Pans boobs then?</span></div></span></div>",
            "created":1416459600,
            "id":1890358,
            "title":"No?"
        },
        "1251122":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "ASS! (CLEAN aka no shit or farts or toilet stuff!)",
                "PUSSY! (Must be livable! No pregnancy!) "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So last two.....IS IT HER ASS or HER PUSSY?!</span></div></span></div>",
            "created":1416459600,
            "id":1890363,
            "title":"The place behind her jeans"
        },
        "12511221":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Your POV.",
                "Pan want to help you feel comfortable and homely."
            ],
            "content":"<div class=\"\"><div> <span>You have chosen Pan's ass and Pan nods her head and comes down to her knees and picks you up with her left finger-less glove and placed you on her bed. Soon after, Pan unbuckles her belt and zips down her zipper and bends forward as she smiles brightly and grabs her jeans as well as her panties and pulls it down, revealing her huge and sexy ass. You were in awe as you looked at her ass and after that, Pan goes a little bit lower for her to reach the edge of her bed and to have her asshole like a doorway; sort of like a house on the edge of a mountain. Once her ass touched the side of her bed, her ass jiggled with joy as it prepares for a resident to live inside it. You then walk slowly towards Pan's giant (to you) puckered asshole.<br>\r\n<br>\r\n\"*giggles* Come on in! There's no need to be afraid. There's enough of me to go around in my ass! *closes eyes and smiles*\" said Pan. Pan's asshole then opens up and you climbed it like it was a step ladder without steps and it had made Pan gasp in pleasure and then with that, it had made Pan's asshole clench up a little bit and trapped you by accident but you are still alive and she said, \"Oop. Sorry. Let me help you there, _________.\" so Pan takes her left finger and unclenches her asshole and pushes your feet and body all the way inside her and she gasped in pleasure again. Once that ended, Pan sighed and went down on the floor and picked up her jeans and panties and hoisted them up and buckled her belt and zipped her zipper back up again. Pan turned her head for a minute to look at her ass and she liked the thought of having a person up her ass and in her body as it would have the feeling that you are a house yourself and a person would be walking and sleeping in your innards and also at the same time you would be protecting them or him or even a her. \"Have a great time being in my ass and in my body, _________!\" said Pan and then she did a little dance that made her ass jiggle with joy and ends it with a little smack for a little kip.</span></div></div>",
            "created":1417496400,
            "id":1896950,
            "title":"Pan's ass"
        },
        "12512":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Continued"
            ],
            "content":"<div class=\"\"><div> <span>Free PICS/How Pan is in the story (Design/not owned/made by me): <a rel=\"nofollow\" href=\"http://giantessbooru.com/post/view/180172?search=pan\" target=\"_blank\">http://giantessbooru.com/post/view/18017...</a> (face), <a rel=\"nofollow\" href=\"http://giantessbooru.com/post/view/33342?search=pan\" target=\"_blank\">http://giantessbooru.com/post/view/33342...</a> (body change), <a rel=\"nofollow\" href=\"http://paintbeginner.deviantart.com/art/Giantess-Pan-52881167\" target=\"_blank\">http://paintbeginner.deviantart.com/art/...</a> (pussy), <a rel=\"nofollow\" href=\"http://giantessbooru.com/post/view/179874?search=pan\" target=\"_blank\">http://giantessbooru.com/post/view/17987...</a> / <a rel=\"nofollow\" href=\"http://giantessbooru.com/post/view/179875?search=pan\" target=\"_blank\">http://giantessbooru.com/post/view/17987...</a> (for the ass) ---- first three is created by JodaGee and the other two is made by xniclord789x of DeviantART.<br>\r\n<br>\r\nPan was flying towards the Capsule Corp building so she can hang out with her friend Bulla (English version of the anime) and Marron but, as she was told, she was sick today. How can someone who is half cyborg/android and human be sick? But Pan didn't mind. Once Pan touched down to the entrance of the Capsule Corp building, she found something on the concrete. \"Huh? What's this some sort if watch? It belongs to the Capsule Corporation. It doesn't look like it tells time...hmmm...\" Pan then stuck the watch on her wrist and the logo read \"Self-Growth/Shrink Watch\", It got Pan curious and pressed a few buttons and she grew huge and in the process, she grew huge breasts and her clothes ripped. \"Wha..what the heck?! What is going on??!!\" yelled Pan. Soon, she stopped growing and she looked around and then, looked at herself and turned red and covered her herself. <br>\r\n<br>\r\n(To be continued....-XU3)<br>\r\n<br>\r\n</span></div></div>",
            "created":1414558800,
            "id":1879336,
            "title":"Pan's GIANT fun!"
        },
        "125121":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Goddess worship",
                "NEXT!"
            ],
            "content":"<div class=\"\"><div> <span>(Remember the Maron chapter? Yeah this might have a sudden rating change too. So young people GO BACK!)<br>\r\n<br>\r\nIn the Capsule Corp. building, Bulla was getting ready for Pan's arrival to hang out with her until it got dark inside her room. \"What the heck?! Why did it suddenly got dark?!! *growls*\" yelled Bulla but, as soon as she looked out the window, she ran downstairs and came out and saw Pan as a giant! \"HEY PAN!!!!\" screamed Bulla, her screams were so loud even Pan in that even in her height could hear her. \"Huh? Bulla? Is that you?\" spoke Pan. \"YEAH! IT'S ME, PICK ME UP WITH YOUR HAND!\" called Bulla and Pan did as she was told and sat on the floor and covered her breasts with her left arm. \"Whoa Pan, how did you get big like this?\" asked Bulla, \"Well, this watch I think made me grow and it DID say Capsule Corp.\" replied Pan. \"Hey, my mom told me she made something like that and threw it away as it was nothing but trouble for her! That is so cool!\" said Bulla, \"No! Not cool! How am I going to get normal again? I tried using the self-shrink button but it's not working!\" said the nervous Quarter-Saiyan, \"Plus, *whispers* I'm totally naked.\"<br>\r\n<br>\r\n\"Aw *raspberry* it's not that bad! I mean look at you! You have all the power in the world right now. You might be stronger than my dad or your dad (Vegeta and Gohan)! OR even your grandpa Goku!\" said Bulla trying to convince Pan. \"I don't know Bulla...\" responded Pan then, Bulla added \"Also with that new body of yours, you can make the world your playground and the people your toys or worshipers.\" Pan did like that idea and soon, she took off her arm and stood up high. \"*giggles* Maybe I will do that!\" spoke Pan. \"Now THAT'S the Pan I KNOW!\" shouted Bulla.<br>\r\n<br>\r\nPan walked to the middle of West City (I would like to add that Pan's iconic bandanna is still on her head) with Bulla now on her left shoulder. Once Pan got there, the citizens were stunned in fear and Pan swore she heard a guy say her other grandfather's name to help them and it was Mr.Satan/Hercule. \"Now, what should I do to them.....hmmm this is gonna be tough one to think of.\" and soon enough she looked at her own body and started thinking ideas.<br>\r\n</span></div></div>",
            "created":1414645200,
            "id":1879686,
            "title":"Back to the Chapter!"
        },
        "1251211":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "East City",
                "South City"
            ],
            "content":"<div class=\"\"><div> <span>\"Citizens of West City, I am your new goddess! You will be under my every whim and if you go against me, you will lose your pathetic life to me!\" responded Pan. Everyone shivered in fear completely over the thought of losing their lives so, they did what the giant Pan said. \"Cool Pan! You got everyone of West City under your power almost immediately!\" said Bulla, \"Yeah, you're right Bulla! This is gonna be fun!\" replied Pan. Later, as Pan got everything in order for her, she finally gave her first command to her new servants. \"Ok, my little people, my first order for all of you is to fill my body, but wait, it's not with food...it's every single one of you. I bet you're thinking, \"What?! First day on the job and she's ALREADY killing us?!\" Yep! Sorry about all your luck. Now stand in groups of four! Military style! NOW!\" ordered Pan. <br>\r\n<br>\r\nThe citizens gathered in groups of four for each of her pats. \"Group 1, POSITION!\" said Pan. The group did as they were told and Pan felt her stomach rumble and took ALL of the 1st group and puts them in her mouth and swallowed them whole. \"Oh MAN Pan!\" said Bulla, \"If you were actually older and get yourself a boyfriend you can do alot with that mouth of yours. *giggles*\" Pan blushes at that comment made from Bulla. Everyone else were in shock, and soon enough, Pan got the second group in order and said, \" Alright, Group 2. I want all of you to charge into my pussy! No questions asked! GOT IT?!\" The 2nd group gulped in fear and did as they were told once Pan crashes on the road and sat down (look at the 2nd pic at the start of the Pan chapter to know what position) and they all ran in forcefully, causing Pan to moan in pleasure. \"Yes! Yes, go in deeper in me, deeper until you go past my cervix! Yes!!\" A few minutes later, Pan couldn't feel them anymore, so they must have went past her cervix like what she had said during her horny session. \"Don't you dare one of you be inside my womb and become a weird baby while you're in there! I would seriously abort myself right now if I needed too! If only I can find a medic.\" shouted Pan. \"Ok, two more to go.\" said Pan.<br>\r\n<br>\r\n\"Group 3, split into halves for me.\" asked Pan, the group did they were told and Pan continued as she stood up, \"Now, go to that double rectangular building and walk on it and you must go inside my big breasts by entering my nipples!\" said Pan. Once Pan got into position and the servants got into their position, they each went in one-by-one as it pleases Pan. As the the final servant went in, Pan plays with her boobs for a little bit and touches her nipples. Now as that was finished Pan has one body part and one group left for her body to eat and that is with her ass. \"Ok, ya final worthless pieces of space, time to feed you to my glorious ass!\" said Pan, \"Oh man, I'm having so much fun watching all this!\" said Bulla. \"Yes, master goddess...\" said the servants of Group 4 in despair. Pan then, places her hand in front on Group 4 and they all got on. Pan turns around and gets on her knees and places her hand horizontally in front of her puckered asshole with a little opening for the servants to walk in to. \"Have fun!\" said Pan sarcastically, \"Little bugs!\" finished Bulla for Pan. Soon, Group 4 walked into her  rectum and Pan was loving it as well just like what Group 2 did with her pussy. Soon after Group 4 went in, Pan's asshole closed behind them all and Pan stood up and Bulla fell from Pan's shoulder as Pan saved her from her death. \"*whew* Thanks Pan.\" said Bulla, \"You're welcome!\" said Pan as she smiles and turns and uses her left hand and pats her big ass-cheeks. \"Mmm..thant felt great to be a goddess!\" spoke Pan, \"You know, I wanna be big forever with this gorgeous body I have! As I already know, I was BORN to have a great ass like this one that I have right now!\" Bulla spoke, \"Hey Pan, where should we conquer next? With the next set of people to feed your body now?\" Pan thought about it and said \"Let's go to...\"</span></div></div>",
            "created":1414990800,
            "id":1881409,
            "title":"Goddess worship"
        },
        "12512112":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Continue Choice",
                "New Pan Arc"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is a new arc to go along with it!</span></div></span></div>",
            "created":1415077200,
            "id":1881726,
            "title":"South City"
        },
        "1251212":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Pan's new breasts (Nipple Vore)",
                "Next Choice.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which body parts would Pan use?</span></div></span></div>",
            "created":1414731600,
            "id":1879905,
            "title":"Forceful AND pleasurable"
        },
        "12512122":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "It's VAG TIME!!",
                "Bring out the beautiful bubble ASS to me!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Pan going to choose to feed her hungry pussy or her starving huge ass?</span></div></span></div>",
            "created":1414731600,
            "id":1879908,
            "title":"Final two choices"
        },
        "1252":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Sure!",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bra?</span></div></span></div>",
            "created":1123736400,
            "id":266802,
            "title":"Even more choices"
        },
        "12521":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "You",
                "Bulla"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, who's POV?</span></div></span></div>",
            "created":1538802000,
            "id":2560195,
            "title":"Sure!"
        },
        "125211":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "You shrink",
                "You grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What next?</span></div></span></div>",
            "created":1538802000,
            "id":2560197,
            "title":"You"
        },
        "1252111":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Get put in her \"lower parts\"",
                "Get eaten"
            ],
            "content":"<div class=\"\"><div> <span>Time to begin...<br>\r\n<br>\r\nYou and Bulla were good friends. You had been going to school in West City together since you both were young kids. Now, you were both teenagers. You and your friends could tell she had a crush on you. One day, she asked you to come over and hang out at her place. You decided to accept. When you got there, she eagerly brought you to her room.<br>\r\n<br>\r\n\"You wanna see something cool I made?\" She asked. \"Sure\" you replied. She got out a medium black case from under her bed. She opened it up and got out a wierd-looking gun.<br>\r\n<br>\r\n\"Taadaa! My brand new Shrink Ray!\" You could already tell she wanted to test it on you. Sure enough, she asked. You accepted.<br>\r\n<br>\r\nShe zapped you with the ray, shrinking you, but not your clothes.<br>\r\n<br>\r\n\"Whoops, gotta fix that.\" She said. But first, she wanted to have some \"fun\"</span></div></div>",
            "created":1538885760,
            "id":2560198,
            "title":"You shrink"
        },
        "12521111":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Her butt",
                "Her pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which lower part?</span></div></span></div>",
            "created":1538886000,
            "id":2560203,
            "title":"Get put in her \"lower parts\""
        },
        "125211112":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Eat you",
                "Keep you in there forever"
            ],
            "content":"<div class=\"\"><div> <span>She took off her skirt and panties, revealing her sexy lower regions.<br>\r\n<br>\r\n\"Hope you're ready for some fun!\" She eagerly said. She picked you up, and shoved you into her soaked pussy. You were soon covered in her juices. Not too long after, she was called for dinner. She kept you inside, lifted up her panties, put on her skirt, then went and ate. As she talked with her family, she totally forgot about you until you started squirming. She soon excused herself and returned to her room, thinking what to do next.</span></div></div>",
            "created":1538886480,
            "id":2560211,
            "title":"Her pussy"
        },
        "1252111121":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "content":"<div class=\"\"><div> <span>\"Hmm, I think I'll punish you for messing with me while I was eating.\" She said. She managed to slide you out of her pussy, and lifted you into her mouth.<br>\r\n<br>\r\nAs you fell into the back of her throat, your hopes of freedom were crushed. You went down to her stomach<br>\r\n<br>\r\n\"Mmm... delicious.\" She moaned happily. As you landed in her stomache, she burped, lowering your air supply. You began kicking the wall, but it had no effect. You were going to be digested in here.<br>\r\n<br>\r\nSoon, your body gave out. You surrendered to her stomach's power and you digested, becoming a part of her. All that remained were your clothes on her floor and a little layer of butt fat on her.<br>\r\n<br>\r\n\"Don't worry, my next boyfriend will get to enjoy what you did.\" She said, as she went to the bathroom, disposing of your digested remians.</span></div></div>",
            "created":1538886780,
            "id":2560213,
            "title":"Eat you"
        },
        "12522":{
            "author_id":"darthtidus",
            "author_name":"DarthTidus",
            "choices":[
                "Sure",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Don't forget Launch!</span></div></span></div>",
            "created":1129352400,
            "id":279018,
            "title":"Hmmm"
        },
        "125221":{
            "author_id":"pickles1998",
            "author_name":"Pickles123",
            "choices":[
                "You",
                "Launch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's Pov </span></div></span></div>",
            "created":1364101200,
            "id":1557189,
            "title":"Sure"
        },
        "125222":{
            "choices":[
                "Sure",
                "nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Marron?</span></div></span></div>",
            "created":1398402000,
            "id":1786520,
            "title":"Nah"
        },
        "1252222":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Fuck yeah!",
                "more? (is there??)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Krillin's hot blue haired ex from the anime? Maron.</span></div></span></div>",
            "created":1408338000,
            "id":1843853,
            "title":"The Blue haired stupid bimbo"
        },
        "12522221":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Anal Vore (clean colon/sorry)",
                "Nipple Vore (peeps alive) or more"
            ],
            "content":"<div class=\"\"><div> <span> One day in the Dragon Ball Universe, a certain ditz went out shopping as usual in South City and guys staring the hell out of her and being a Bulma lookalike. Yes, it's Krillin's ex G.F. Maron from the anime. \"Hmmm....I wonder what I else I could buy with daddy's money? Huh?\" She then found a strange vending machine out in the open and she felt thirsty. \"Well, shopping is hard work! *giggles*\" she placed  the dollar in and when it came out she drank and threw into a recycling bin; she may be dumb but at least she helps the environment; \"Oh, I'm guessing that's the last one. Oh, well!\" *smiles* as she walked away, we skip over to the next few blocks over and she starts to get this weird feeling in her stomach. \"Oh..what's wrong with my tummy...\" then, as she dropped her bags, she kneels down to the ground and she suddenly gasped as she started to grow and grow more and as she grew, her little dress ripped completely apart and became totally nude and stopped until she grew 200 ft tall! *looks around* \"ooooo....wow the city shrunk!\" *looks at her nude body* *gasp/scream* \"Oh no! I think I actually grew! How does that work? I don't care anymore.\" The males got nosebleeds and the females screamed and the moms closed their child(ren's) eyes from the blue haired giant naked chick. \"You know, I could have fun with this!\" said Maron seductively. But then, her stomach growled at her \"WHAT WAS THAT SOUND?! oh. It was you tummy! I'm busy here! *growls louder* Ok, I'll feed you. Now, where can I get some food...? *looks down* oh. *squeal!* Tiny people shaped stick candies!\" *citizens scream* Maron being the idiot she is mistaken the people of South City for candy sticks;WHAT'S IN THAT EMPTY HEAD OF HER'S?!!; she then picked up everyone she saw currently and tossed everyone in her mouth without thinking and swallowed them whole! \"MMMMM...de-lish!\" Maron tripped and spun around and landed on a tall building with an orb for apartments and a roof with her ass but she blushed and gasped when the building is deep inside her pussy (she landed by sitting).<br>\r\n   Without a second thought Maron slid up and down on it like it's a misshapen dildo and every time she would go down the round apartment/roof would keep on hitting her cervix and she was looking every second of it. \"Ohhhh....this is sooooo...GOOOOOD!!! I'm...I'm going to cum...I'm going to cu..I'm cumminngggg!\" Then the white stuff splattered all over the building she was one, probably breaking it in the process (during that sequence everyone who lived there were scared to death.) As Maron got up and saw more people she got an idea as she looked at her own gorgeous body. </span></div></div>",
            "created":1410238800,
            "id":1854869,
            "title":"The giant Ditz. (Warning: sudden 18+ Kids go back)"
        },
        "125222211":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Continue the story."
            ],
            "content":"<div class=\"\"><div> <span>XtremeUniverse3: I missed some commas and I mistakenly replaced \"liking\" with \"looking\" and \"on\" with \"one\". Sorry for the inconvenience.<br>\r\n<br>\r\nSorry for the people who like it dirty. I'm writing this so I like it clean.</span></div></div>",
            "created":1410238800,
            "id":1854883,
            "title":"Anal Vore (clean colon/sorry)"
        },
        "1252222111":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "East City",
                "West City (Where Bulma lives)"
            ],
            "content":"<div class=\"\"><div> <span>   As Maron looked at her gorgeous bod, she look at one specific part and that was her ass. Then, she started to remember something as she once again looked at the scared citizens and thought (Oh my Kai, it's a miracle! She has thoughts). \"Hey, maybe I can use these people shaped candy sticks just like that one time back home when I bought those OTHER candy sticks and ate some; delish still ; and shoved a bunch of them up my ass. It was a fun time for me! I wonder if they are still inside me? *smiles* well, I don't care anymore!\" As she bent down to reach more people, she took a fistful of citizens and then, she held herself up on one of the two identical flat buildings with tubes leading to a parking lot full of cars and as she did, Maron stuffed her fist that is full of what she thinks as tiny people-shaped \"candy sticks\" inside her asshole and gasped in pleasure again. \"OOOOOHHHH! This SOOOOOO feels like time I did it back at my house before I met....\"what's-his-face\"! (Krillin) [Krillin Owned count:999-*ding* 1,000 *fireworks!*)\" Maron moved her whole arm forwards and backwards for fun and as she realized, she finally lets go of the people and they screamed for their lives by being Maron's ass snacks like her previous \"candy sticks\" (it came with multiple colors).<br>\r\n    Maron went on finding more of her said \"candy sticks\" and stuffed them all up her ass and she was loving it. \"Oh! Now the candy sticks move now too! Probably like those candies that fizzes and becomes sour in your mouth with the flavor!\" She kept on filling more people inside her ass without a care in the universe and would only care what SHE wants; being a rich girl and all ; and then as she sets the final batch of people in her ass she looks around and says, \" *looks to the right* Uh...*looks to the left* uh....*looks down behind her* hmmmm....*closes eyes and giggles* I guess that was the last of those candy sticks!\" *realization! (it's not what YOU are thinking of! XD)* \"*gasp!* Wait! Maybe there is more out there....*looks all over* hmm? This looks like South City...maybe this is a model! And this is a world where people are candy sticks! *squeals* Yay! More candy sticks to eat and shove up my ass!<br>\r\n     Where the giant retarded blue bimbo go next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1410411600,
            "id":1855766,
            "title":"The Cavern of the stupid blue whore."
        },
        "125222212":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Stay with Nipple Vore (ALIVE)",
                "Pussy Vore (No PREGGERS)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>XtremeUniverse3: I missed some commas and I mistakenly replaced \"liking\" with \"looking\" and \"on\" with \"one\". Sorry for the inconvenience.<br>\r\n<br>\r\nOnto the decisions!</span></div></span></div>",
            "created":1410238800,
            "id":1854881,
            "title":"Nipple Vore (peeps alive) or more"
        },
        "1252222121":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "East City",
                "West City"
            ],
            "content":"<div class=\"\"><div> <span>   Maron looked at her sexy body and then had to reminiscent something with her thoughts (BAH GAWD SHE HAS A THOUGHT?!!! IT'S A FREAKIN' MIRACLE!!!!) by the time she looked down to her ass and pussy, up to her big breasts. \"Hey...maybe I could use these people shaped candy sticks just like that one time when I was at my beach house near East City and I ordered 2 packs of the limited edition version of the candy sticks called \"Tinies\" for 2,000 zeni and it was worth it and I ate some and also shoved the rest inside my boobs! It was so fun for me! Are they still inside my boobs? *smiles* well,don't care now!\" Maron bent down and took the citizens she saw and took a fistful of them and went down to her knees onto the streets, now being broken by her, and she shoved in each citizen inside her left and right titties by cupping her hand a in a cone shape and the citizens slid down her titty holes (Maron is 152 ft. in both new additions) and she was liking it (titty sensitivity as a giant) as she remembered the feeling she had the first time she had done it the first time back her beach house.\"Mmmmm....it feels soooo goood of the feeling of my boobs being filled by every stick going down in my titty holes..ooooh....\" She then filled up more and more with each citizen going in and her face was at a type of point that her mind was going to break but she has no brainwaves but she still has that pleasure face on her. Then as she placed in the last of the people of South City, she realized there was no more around her. \"Ohhhh....there's no more?\" Then, as we zoom inside her breasts, we (the readers and creator of said chapter) have discovered that when the citizens had saw Maron at first they were scared of their brains but, right now....they were having FUN! (readers: \"WHAT?!!! WTF?!!\") They were swimming in the milk pools, resting on the flesh, kids running around (you name it! *that is non-fighting DBZ logic*). Then, we go back outside as Maron now noticed a city up ahead of her and said *gasp* \"MORE CANDY STICKS! YAY!\" Which city did she find?<br>\r\n<br>\r\nHey guys free photo to see who Maron is: <a rel=\"nofollow\" href=\"http://dbcproject.deviantart.com/art/Dragon-Ball-Z-Maron-410368016\" target=\"_blank\">http://dbcproject.deviantart.com/art/Dra...</a> (it's not mine though)</span></div></div>",
            "created":1410584400,
            "id":1856195,
            "title":"The floating jug's holes."
        },
        "12522222":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Yeah",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bulma's mother Mrs. Brief?</span></div></span></div>",
            "created":1527570000,
            "id":2500288,
            "title":"more? (is there??)"
        },
        "125222222":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Yes please",
                "Maybe someone else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about Bulma's sister Tights?</span></div></span></div>",
            "created":1527570000,
            "id":2500292,
            "title":"More?"
        },
        "1252222222":{
            "author_id":"foreoseven",
            "author_name":"Fouroseven",
            "choices":[
                "Fuckkkkkk yeahhhhh",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about caulifla</span></div></span></div>",
            "created":1543059120,
            "id":2581352,
            "title":"Maybe someone else?"
        },
        "12522222222":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Yeah",
                "Naw, next please "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Caulifa's sister, Kale?</span></div></span></div>",
            "created":1575427260,
            "id":2755122,
            "title":"Someone else?"
        },
        "125222222222":{
            "author_id":"mariosonicfan4",
            "author_name":"Echo",
            "choices":[
                "Sure",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Whis's twin sister, Vados?</span></div></span></div>",
            "created":1579043820,
            "id":2773803,
            "title":"Naw, next please "
        }
    },
    "info":{
        "author_id":"jpelchat",
        "author_name":"Jpelchat",
        "brief_description":"Characters from Dragonball-Z-Gt Grow and eat people.",
        "created":1123747020,
        "description":"<td align=\"left\" class=\"norm\">Pick any character you see fit to grow (Try to keep this a Giant/Giantess or Shrinking story; some same size vore is okay, just don't overdo it.) and the rest is pretty much up to you. And PLEEAASSEE do not ignore the main topic which is vore. Oh, one more thing...you can now add hard vore if you want, just stay away from chewing  (I just think thats kinda gross)</td>",
        "id":1000251,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579043820,
        "modified":1579043820,
        "pretty_title":"Dragonball Vore"
    }
}