{
    "chapters":{
        "1":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Cartoons",
                "Comics",
                "Anime",
                "other of the category/crossover",
                "a combo of any of the previous 4"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is where we shall begin choose your type of media</span></div></span></div>",
            "created":1301202000,
            "id":1077296,
            "title":"Beginning"
        },
        "11":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Cartoon Network",
                "Nick",
                "Disney",
                "DC",
                "Marvel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select your network</span></div></span></div>",
            "created":1301202000,
            "id":1077300,
            "title":"Cartoons"
        },
        "111":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Ed, Edd, n' Eddy",
                "Billy and Mandy",
                "Power Puff Girls or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>choose your show</span></div></span></div>",
            "created":1301202000,
            "id":1077301,
            "title":"Cartoon Network"
        },
        "1113":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Powerpuff Girls",
                "Kids Next Door",
                "Ben 10 (any of the series) or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077304,
            "title":"Power Puff Girls or"
        },
        "11132":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "kids next door ",
                "johnny test"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>kids next door or</span></div></span></div>",
            "created":1309299360,
            "id":1136615,
            "title":"Kids Next Door"
        },
        "11133":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Ben 10 (any of the series)",
                "total drama or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077307,
            "title":"Ben 10 (any of the series) or"
        },
        "111332":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Total Drama",
                "Totally Spies or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077311,
            "title":"total drama or"
        },
        "1113322":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Totally Spies",
                "Juniper Lee or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077312,
            "title":"Totally Spies or"
        },
        "11133221":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "They arrive at the village and meet some shady characters.",
                "The village is farther away then they realize and they start to get hungrier"
            ],
            "content":"<div class=\"\"><div> <span>It all started out as an ordinary day in Beverly Hills. The three spies had each gone to do something on their own. Each one of them had there own plan for what to do that morning. Alex was out doing gymnastics, Clover was out shopping, and Sam was checking out new books in the library. They all agreed that after they had done their own activities they would all met together to have a lunch break. Once the spies reunited, they left for the restaurant. They were all outside the door of their favorite restaurant when suddenly they felt something suck them up and they were teleported to WHOOP headquarters.<br>\r\n<br>\r\n\"Hello girls it's time for a mission, and an important one.\" said Jerry. <br>\r\n<br>\r\n\"Awww, come on Jerry! We were about to eat lunch.\" yelled Clover as she heard her belly give a  growl of hunger.<br>\r\n<br>\r\n\"You're not the only ones that are hungry girls. For the past there has been massive thefts on food across the world. The thefts seemed to begin at a small country called Starvania. Your mission is to try and find out what happened there and find any leads on whoever is behind this. Good luck girls!\" said Jerry as he pushed a button. The button transported them on to a plane heading towards Starvania. <br>\r\n<br>\r\nSoon the plane landed and they girl stepped outside. They all noticed how barren the land was. The few trees that were nearby were barely alive. The soil was dry and hard with no grass to be found. The only part of the surrounding that looked nice was the small lake with crystal clear water.<br>\r\n<br>\r\n\"Okay now we need a plan to see if we can catch this thief!\" said Sam. \"Yeah, but how do we find someone that steals food?\" asked Alex. \"That's easy, we just need to find someone that isn't starving. There should be a village up ahead, we're bound to find someone that isn't suffering from a lack of food.\" <br>\r\n<br>\r\n\"Okay, but please don't try to talk about food so much. I'm still pretty hungry since we missed lunch.\" said Clover as she rubbed her belly.<br>\r\n<br>\r\nSoon the spies began their walk towards the village Sam mentioned. <br>\r\n<br>\r\n</span></div></div>",
            "created":1301768700,
            "id":1080771,
            "title":"Totally Spies"
        },
        "111332212":{
            "author_id":"strangemind45",
            "author_name":"Very-Strange?",
            "choices":[
                "..the Village, hopefully there's food there!",
                "...a small animal. (They must be desperate for food)"
            ],
            "content":"<div class=\"\"><div> <span>It had been five hours since the Spies started their journey towards the village, but they didn't realize that. They were too exhausted and tired from their long walk to realize how much time had gone by, but they knew they had been walking for quite sometime. The walk was taking it's toll on the girls. Normally they would have used their jets or some other gadget that Jerry should have given them, but Jerry had just sent them without gadgets. He was so concerned with getting this mission solved that he actually neglected to give them the tools to help them. The spies didn't realize that they were gadgetless until some time after they started their journey.<br>\r\n<br>\r\n\"How could Jerry leave us out here without any gadgets?\" asked Alex almost out of breath.<br>\r\n<br>\r\n\"He could have at least sent us a snack since we missed lunch.\" said Clover as a large growl came from her stomach and she began to rub it in hopes of giving it temporary satisfaction.<br>\r\n<br>\r\n\"Relax guys, we've got to be close to this village by now.\" said Sam trying to sound confident, yet her tone sounded uncertain.<br>\r\n<br>\r\n\"You've said that at least a dozen times now. If we were close to the village, you would have had to said it so many times. When we do get to the village, the first thing we should do id order some lunch.\" said Clover as she imagined pizza, ice cream, chocolates and other yummy treats. Of course imagine such sweet food on an empty stomach made her hunger even worse. Her growls from her stomach became louder and she desperately rubbed faster to try to keep it quiet.<br>\r\n<br>\r\n\"Clover, you've got to be tough on a mission like this. A true super spy should be able to last long on an empty stomach, like me and Alex.\"<br>\r\n<br>\r\n\"Uhhh, actually Sam, all this talk about food is making me hungry too.\" said Alex as a small grumble came from her stomach, almost as if on Que.<br>\r\n<br>\r\n\"Well, at least I'm not not Hungry!\" said Sam right before a growl came from her stomach and she too, began rubbing her stomach.<br>\r\n<br>\r\n\"We've got to get some food said Clover. Then the spies see... <br>\r\n<br>\r\n    </span></div></div>",
            "created":1302306720,
            "id":1084507,
            "title":"Are we there yet?"
        },
        "11133222":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Juniper Lee",
                "Dexter's Lab"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077313,
            "title":"Juniper Lee or"
        },
        "112":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Danny Phantom",
                "Fairly oddparents",
                "Tuff Puppy or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>choose your show</span></div></span></div>",
            "created":1301202000,
            "id":1077314,
            "title":"Nick"
        },
        "1123":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Avatar",
                "The X's",
                "El tigre or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077319,
            "title":"Tuff Puppy or"
        },
        "11233":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "El Tigre",
                "My Life as a teenage robot or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1301202000,
            "id":1077322,
            "title":"El tigre or"
        },
        "112332":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "teenage robot",
                "chalkzone or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1301202000,
            "id":1077327,
            "title":"My Life as a teenage robot or"
        },
        "1123322":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Chalkzone",
                "Wayside or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1301202000,
            "id":1077329,
            "title":"chalkzone or"
        },
        "11233222":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Wayside",
                "mighty b"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077330,
            "title":"Wayside or"
        },
        "113":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Kim Possible",
                "Proud Family",
                "Emperor's new school or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>select your show</span></div></span></div>",
            "created":1301202000,
            "id":1077333,
            "title":"Disney"
        },
        "1133":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Emperor's new school",
                "Lilo and stitch",
                "Jake Long or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077335,
            "title":"Emperor's new school or"
        },
        "11333":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Jake Long",
                "Jimmy Two shoes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>short List </span></div></span></div>",
            "created":1301202000,
            "id":1077338,
            "title":"Jake Long or"
        },
        "113332":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "jimmy two shoes",
                "lilo and stitch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>jimmy two shoes or</span></div></span></div>",
            "created":1309299420,
            "id":1136616,
            "title":"Jimmy Two shoes"
        },
        "114":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Teen Titans",
                "DCAU",
                "The Batman or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all cartoons produced by DC are listed here</span></div></span></div>",
            "created":1301202000,
            "id":1077339,
            "title":"DC"
        },
        "1141":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Group up with the other girls",
                "Search out food",
                "Handle the remaining villains running rampant around the world"
            ],
            "content":"<div class=\"\"><div> <span>\tDarkseid was making another play for Earth. The universes greatest heroes were aligned for this battle. The Justice League was spread thin along with all the other super hero teams defending the planet with their lives. Things were no different for the Titans. They’re numbers weren’t great at the time. The youthful heroes were taking care of Earth’s own villains who were taking advantage of Darkseid’s siege. With all the major heroes busy who was going to stop them. Now the Titans were separated into smaller teams based on their abilities that work together ideally taking on villains who originally would be way out of their league. In their current circumstances though, with so much on the line, the Titans were fighting in a way never seen before. They were redefining team work. Together they were crushing individual villains one by one, and growing in power. The team of Starfire, Raven, and Terra were in the midst of one of their greatest battles. Sinestro had the upper hand the entire battle. In a last ditch effort Raven uses her abilities to launch an oil tanker at Sinestro in a middle of a monologue. Without hesitation Sinestro goes to defend himself, but Terra was reacting quicker as if she knew what her desperate ally was thinking sends a tremendous boulder through the tanker releasing a ball of flaming oil towards the surprised super villain. With little time to spare Sinestro begins to spread a wall of his random magics of the Anti-verse. With little to no hesitation Starfire was already barreling through oil ball of fire feeling her righteous anger fist forward. She makes it past the wall before he can complete it, but right when she reaches him she has a  horrendous revelation. She’s terribly hungry. The vicious growl of her stomach works to her advantage scaring the wits out of Sinestro.<br>\r\n \t“What kind of beast are you!?” yells the frightened villain as Starfire collides into him.<br>\r\n\tThe two of them careen into the ground the fireball following in suit. Terra screams in horror seeing the fireball hit Star. Staring at the smoldering pile Terra begins to cry. She then notices a little black energy leaving the ball more and more. Raven had caught Starfire in one of her spells before the fireball had hit them.<br>\r\n\t“Star!” screams Terra elated.<br>\r\n\tTerra looks back towards Raven then hurries over to her friends. Raven gently puts down Star’s body, and releases the spell. Partially exposed because of the fireball Star laid in front of the two girls scarred and seemingly broken.<br>\r\n\t“Is she ok?” ask Terra still afraid for her friends life.<br>\r\n\t“I don’t know.” replies Raven. “Star?”<br>\r\n\tStarfire doesn’t move. The look of concern grows on the others face. Suddenly Starfire stomach growls again, and she rolls onto her back.<br>\r\n\t“I’m so HUNGRY!” screams Starfire rubbing her growling stomach.<br>\r\n\t“Uggh!” sigh the two other girls falling over backwards.<br>\r\n\tThe three of them lay there.<br>\r\n\t“Me too!” says Terra.<br>\r\n\t“Yea.” agrees Raven.<br>\r\n\tThere stomachs were growling like a brutal symphony of grunts. They lay there for a little while longer rubbing there stomachs. The battle had took a lot out of them. The hunger was making them feel severely weak.<br>\r\n\t“This unbearable.” says Raven still rubbing her growling stomach.<br>\r\n\t“Uh huh.” grumbles Terra also rubbing her stomach in agreement.<br>\r\n\t“Lets go home and eat!” yells Starfire.<br>\r\n\t“Yea!” scream the girls in unison jumping up excited at the thought of a  meal. The same thought brings them all to their knees though. Reminding their stomachs what their greatest desire they to rumble in agreement. The girls all rub their stomach. Starfire taking the initiative gathers the two in her arms using their bodies to cover up flies quickly to the tower. There three separate on their own agendas. Star flies to her room to change while Terra heads to the kitchen. Raven goes to the communication room to see the status of the situation happening across there little planet. Terra reaches the kitchen first. She immediately starts rummaging through cupboards, the pantry, and the fridge to find nothing. She rubs her growling stomach in disappointment. Then Terra has an epiphany. The entire kitchen was clean, and there was no garbage to be found. No one has been in the kitchen in a good while yet there was no food. The Titans had  stocked up way before the battle on Earth, and it made no sense for it all to be gone. Star rushes into the kitchen.<br>\r\n\t“You made it here first so whatcha make?” says Star childishly.<br>\r\n\t“There’s nothing.” says Terra looking towards the ground.<br>\r\n\t“Did you eat it all?” questions Star.<br>\r\n\t“NO!” answers Terra. “Do you think I had the time to eat all that food?”<br>\r\n\t“No.” sighs Star rubbing her growling stomach. “So what happened?”<br>\r\n\t“I have no clue.” replies Star. “Nothing here makes sense.”<br>\r\n\tRaven walks into the room with a paler than usual look on her face that was noticed immediately.<br>\r\n\t“So you heard the foods all gone.” says Terra.<br>\r\n\t“The foods gone!” yells Raven as a little spark of her power explodes from the side of her temple from her emotional outburst.<br>\r\n\t“By the look you had on your face I figured you knew.” says Star.<br>\r\n\t“Yea.” agrees Terra “What’s wrong with you?”<br>\r\n\t“You have to see it for yourself.” says Raven now rubbing her growling stomach in disappointment.<br>\r\n\t“Ok.” says Terra and Star nervously.<br>\r\n\tThe girls reach the communication room the monitor still on the news.<br>\r\n\t“I repeat,” says the reporter, “It seems all the fighting has been extinguished. All at once random heroes, and all of Darkseid’s minions had vanished from the sky. Random battles with Earth’s own villains are still under way, but by the way things look there are no male heroes in these battles. Or in that case any males on the planet. We currently can not cut back to the station because both anchor men have vanished from set including all the other male employees in the building. It seems this is happening all..”<br>\r\n\tThe broadcast is interrupted by an incoming communication from Wonder Girl.<br>\r\n\t“Donna are you okay!” ask Star before she even could get the chance to speak.<br>\r\n\t“No I’m Starving!” yells Wonder Girl over her growling stomach. You could tell by her body motion on the screen she was rubbing her tummy. “I know that’s a terrible way to start…”<br>\r\n\t“Not to cut you off, but I understand.” says Raven. “We’re all starving here too.”<br>\r\n\tThe news of the other girls take Donna aback.<br>\r\n\t“My whole team’s hungry too.” says Donna as the communicators camera scans back across both Bumble Bee and Aquagirl. The two of them huddle in a corner rubbing their growling stomachs. “Robin also disappeared from the battlefield.”<br>\r\n\t“All men on Earth have vanished apparently.” says Terra rubbing her growling stomach. Seeing the other two Titans huddle in the corner rubbing their stomachs was a gruesome reminder of their own predicament. “It was just on the news.”<br>\r\n\t“You think they took the food with them?” ask Star with a blank look on her face. She too was rubbing her rumbling stomachs intensely.<br>\r\n\t“No I don’t think they took it with them,” sighs Raven, “but I do think the two are connected.”<br>\r\n\t“How?” ask Terra. “That doesn’t make sense yo.”<br>\r\n\t“Doesn’t it?” replies Donna still rubbing her roaring stomach angrily. “All at once the major battles on the planet stop at once, all the guys are gone, and I’m sure we are not the only ones starving right now.”<br>\r\n\t“I agree.” says Raven. “That’s too much just to be a coincidence.”<br>\r\n\t“What do you think happened?” ask Terra.<br>\r\n\t“Its too soon to begin speculation.” says Raven.<br>\r\n\t“That sounds like something Robin would say.” mumbles Star.<br>\r\n\tThe girls go quite for a bit. The silence gets broken by the sounds of a roaring stomach choir. The girls rub their growling stomach’s in unison. The hunger was becoming unbearable.<br>\r\n\t“All I know is we need to decide on something.”  says Donna rubbing her growling stomach. “This is becoming too much.”<br>\r\n\t“Yea.” agrees Terra. “The Earth still needs our help too. So many super villains are rampaging right now. We have to put them back in line.”<br>\r\n\t“So what do you suggest?” ask Raven.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1333140780,
            "id":1305988,
            "title":"War on Earth"
        },
        "11411":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Stop for Food",
                "Continue their path"
            ],
            "content":"<div class=\"\"><div> <span>\t“The wisest solution would be to join up.”  says Donna rubbing her growling stomach.<br>\r\n\t“What’ll that solve?” ask Terra.<br>\r\n\t“Terra calm down.” responds Raven. “You’re just hungry it’s a good idea.”<br>\r\n\t“Yes I am hungry!” yells Terra rubbing her growling stomach. “So are you! So are they! They can hardly move!”<br>\r\n\t“That’s why I’m saying you three should come here.” says Donna.<br>\r\n\t“Whoa. You never said that.”  says Raven.<br>\r\n\t“I’m so hungry!” screams Starfire rubbing her growling stomach.<br>\r\n\t“Yea,” agrees Raven also rubbing her growling stomach. “You expect us to come all that way?”<br>\r\n\t“What do you mean?” says Donna also screaming at the top of her lungs. “My people are injured? Do you know where we even are?”<br>\r\n\tStar, Terra, and Raven all look at each other dumbfounded.<br>\r\n\t“No.” says Raven under her breath. “We figured.”<br>\r\n\t“You figure what!” responds Donna angrily rubbing her growling stomach sore. “Were in some magical burning street, and we‘re hungry too! All three of you can fly. I need help getting them out of here.”<br>\r\n\t“Fine we’re coming!” replies Terra shutting down the monitor.<br>\r\n\tTerra reaches into pouch, and pulls out her personal communicator.<br>\r\n\t“I guess we’re going to get them.” says Star disappointed.<br>\r\n\t“Yea,” says Terra looking at the tracking device on her communicator, “but they’re not far though. Not flying anyways.”<br>\r\n\tOn the other side of town. Donna Troy was putting her personal communicator away. They had just finished a battle with Jinx. Jinx was backed up by Gizmo, but in the midst Gizmo up and vanished. Jinx was left to defend herself. With three Titans still standing it was an unlikely effort. Aquagirl had sustained an injury, but nothing worth really mentioning. Now Jinx laid unconsciously on the side walk. She laid there unconsciously rubbing her stomach hoping the growling how hungry she is also. <br>\r\n\t“Did they buy it?” ask Aquagirl rubbing her growling stomach.<br>\r\n\tDonna falls on her back holding her stomach.<br>\r\n\t“Ugh,” replies Donna, “they are coming.”<br>\r\n\t“I couldn’t walk back like this.” says Aquagirl. “I’m so hungry.”<br>\r\n\t“Me too.” agrees Donna rubbing her growling stomach gently not to hurt her raw skin.<br>\r\n\t“I don’t think I can move I’m so hungry.” says Bumblebee.<br>\r\n\t“At least you could fly!” yells Aquagirl.<br>\r\n\t“Yea,” says Bumblebee, “but I’m just gonna shrink down so I can fit in someone’s pocket. They won’t even notices me there.”<br>\r\n\tAquagirl’s stomach belts out. <br>\r\n\t“So now what?” asks Donna holding still rubbing her growling stomach.<br>\r\n\t“Now we wait.” replies Aquagirl.<br>\r\n\t“Uggh,” the girls groan in unison.<br>\r\n\tTerra, Raven, and Starfire were in flight above the city heading towards the mark indicated on Terra’s communicator. They passed all these sign advertising all kinds of foods. Starfire will power begins to bend. She had been watching the signs past, and it was just too much. She started barreling off towards a giant burger sign in the sky. Raven had been watching her the entire time. She was already halfway through her chant before Star took off. Star is engulfed in Raven’s black magic before she can smash through the sign, and attempt to eat this giant plastic cheeseburger. Raven hauled Star’s grumbling body back onto course.<br>\r\n\t“Why?” screams Star rubbing her growling stomach.<br>\r\n\t“Yeah why?” ask Terra. “I could have used the laugh.”<br>\r\n\t“We don’t have the time.” replies Raven. “Do you want to have to pick her up out of that rubble, and carry her back along with the other Titan’s?”<br>\r\n\t“I could’ve eaten it.” says Star disappointedly.<br>\r\n\t“I think I could have too.” agrees Terra rubbing her still growling stomach. “The way I feel I could eat anything.”<br>\r\n\t“Why don’t you eat some dirt?” ask Raven rubbing her growling stomach now as well. “Isn’t it in easy access to you?”<br>\r\n\tTerra shoots Raven a angry look.<br>\r\n\t“Why don’t your eat dirt?” questions Star.<br>\r\n\tThe other girls drop their heads, and continue their path toward the other Titans. They’re journey slowing down minute by minute. Star kept bouncing back, and forth from billboard to billboard.  The flight was wearing Starfire down, but the needless use of Raven’s magic now began to weigh on her. The hunger was steadily becoming more vicious the more signs they past. Raven was even beginning to feel her will power wear away. Terra remained laid out upon her flying stone. She held her stomach rubbing it to calm the growling. It didn’t do a thing. How hungry she is now amount of rubbing is going to help her. Terra still kept watch on her communicator to make sure nothing happened to the other homing beacon.<br>\r\n\t“We should just stop, and find some food.” says Raven still rubbing her growling stomach.<br>\r\n\t“Weren’t you the one who said we didn’t have time?” responds Terra.<br>\r\n\t“Why  do you care?” says Starfire rubbing her rumbling stomach slowly.<br>\r\n\t“I’m sure the others would be happy if we brought food with us.” responds Raven. “Why are you complaining? I can hear you from here.”<br>\r\n\tTerra’s stomach bellows out as she rubs it. It seems as if her stomach was in agreement with Starfire and Raven. She still felt adamant about heading towards the others though.<br>\r\n\t“The faster we get there at least we can search the area for something with them.” explains Terra. “If we stop now we might not be able to get back going.”</span></div></div>",
            "created":1333190640,
            "id":1306492,
            "title":"Group up with the other girls"
        },
        "114112":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Attack the figures",
                "Rescue Donna, Bumblebee, and Aquagirl"
            ],
            "content":"<div class=\"\"><div> <span>\t“We find the others first.” says Terra.<br>\r\n\t“You right.” agrees Raven. “We first check to see if they are alright then we take care of our stomachs.”<br>\r\n\t“Sounds like a plan.” replies Terra.<br>\r\n\t“But I’m hungry now!” screams Starfire rubbing her growling stomach. “Can’t we just bring them food?”<br>\r\n\t“You want to leave them hurt out there waiting for us?” questions Terra as she rubs her violently growling stomach. “You’re not the only one who is hungry. We have to make smart decisions.”<br>\r\n\t“You’re right.” says Star disappointed.<br>\r\n\tA couple blocks away Donna, Aquagirl, and Bumblebee were getting impatient. None of them were seriously injured, and they were only waiting out of sheer laziness. Their stomachs were now growling terribly loud. Donna laid on her back rolling on the floor rubbing her stomach. Aquagirl and Bumblebee sat there and watched. They too were rubbing their stomachs, but their stomachs did not growl with the ferocity of Donna’s.<br>\r\n\t“This is ridiculous.” says Donna. “Why am I so hungry?”<br>\r\n\t“I don’t know girl?” replies Bumblebee. “I’m hungry too, but it looks to me like you’re completely suffering.”<br>\r\n\t“We have to do something?” says Donna. “When will the other girls get here?”<br>\r\n\t“The communication device says they’re close,” replies Bumblebee, “but they’re not moving though.”<br>\r\n\t“You think something happened to them?” ask Aquagirl with a look of concern on her face.<br>\r\n\t“I doubt it.” says Bumblebee. “How close they are I would think we would hear something.”<br>\r\n\t“I think that’s them.” says Donna pointing at  two silhouettes in the distance.<br>\r\n\t“I hope so.” says Bumblebee rubbing her growling stomach. “I sure am hungry.”<br>\r\n\t“I don’t know.” says Aquagirl. “Something doesn’t feel right.”<br>\r\n\t“What do you  mean?” ask Donna still rubbing her grumbling stomach. <br>\r\n\t“If that was them why would they stop right there, and not approach.” replied Aquagirl.<br>\r\n\t“Well the communicator says they’ve stopped close, those figures line up to where close enough to where they are, why wouldn’t it be them?” ask Bumblebee. “I think the hunger is making you paranoid.”<br>\r\n\t“I think the hunger taken you off your guard.” says Aquagirl rubbing her growling stomach. “I don’t think we should approach them. We need stay here, and be prepared for the worse.”<br>\r\n\t“Yea,” agrees Donna finally standing, but still rubbing her growling stomach, “this doesn’t feel right at all. I don‘t agree that we should stay still though.”<br>\r\n\t“What do you think we should then?” ask Aquagirl.<br>\r\n\t“This is what we should do.” replies Donna. “Who’s out there! Come out now or I’m coming at you!”<br>\r\n\t“That sounds like Donna!” says Terra excited.<br>\r\n\t“Good,” replies Star rubbing her growling stomach, “Can we find some food now?”<br>\r\n\t“Something doesn’t sound right though.” says Raven ignoring Starfire. “What did she say?”<br>\r\n\t“Maybe they can see us.” replies Terra rubbing her growling stomach. “It sounds like she was calling out to us.  I told you we need to move forward and find them.”<br>\r\n\t“She sounds fine!” yells Star also rubbing her growling stomach. “I’m hungry now! She’ll be ok. I promise.”<br>\r\n\t“You see that building top Terra?” says Raven still ignoring Star. “We should fly up there, and observe what’s going on before we just jump in recklessly.”<br>\r\n\t“Sounds like a solid plan.” replies Terra. “Then after we gather them up we find some food.”<br>\r\n\t“Agreed.” says Raven also rubbing her growling stomach.<br>\r\n\t“Uggh!” says Star also rubbing her growling stomach. “Lets just do it then.”<br>\r\n\tThe trio takes off into the air ascending the side of the skyscraper . Upon reaching the top they land, and Terra pulls out her personal communicator for the tracking device. She turns it back on, and the girls head toward the little blips on  Terra’s tracking device. <br>\r\n\t“I think that’s them!” says Star pointing off the roof. “Let’s go come on, come on!”<br>\r\n\t“What’s that?” ask Terra pointing off in a different direction.<br>\r\n\t“I don’t know, but it’s huge.”  answers Raven while pointing in a different direction. “There’s a duo in that alley over there as well.”<br>\r\n\t“There they are!” says Terra pointing at Aquagirl, Donna, and Bumblebee. “There surrounded.”<br>\r\n\t“I can’t fight I’m so hungry.” yells Star rubbing her growling stomach. “I need food now!”<br>\r\n\t“I know we’re hungry too,” says Terra also rubbing her stomach. “but we can’t leave them like this though. I can’t tell if any of those figures down there are friendly.”<br>\r\n\t“Yea, we can’t leave them like this.” says Raven. “They might be in serious danger, and by how it looks I think they’re only aware of the duo in the alley. They’re completely unaware of the giant whatever that’s behind them.”<br>\r\n\t“I think I’m to hungry to fight also.” says Terra rubbing her growling stomach.<br>\r\n\t“Not you too.” says Raven. “We can’t leave them like this.”<br>\r\n\t“I know.” agrees Terra. “I’m not saying we bail on them. I just don’t think I can fight like this.”<br>\r\n\t“Me too.” says Star pathetically. “I’m so hungry.”<br>\r\n\t“Ugghh I know!” gripes Raven frustrated rubbing her growling stomach. “You don’t think I am as well.”<br>\r\n\t“So what should we do?” ask Terra.</span></div></div>",
            "created":1333470540,
            "id":1308597,
            "title":"Continue their path"
        },
        "1141122":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Look into the creature",
                "Hunt for food"
            ],
            "content":"<div class=\"\"><div> <span>\t“We make a move to save the other girls.” says Raven rubbing her growling stomach.<br>\r\n\t“We’re closer to the pair in the alley below us.” says Terra. “We could at least get a sneak attack in on them then push toward the others.”<br>\r\n\t“In our condition its going to make it hard.” replies Raven. “I can assume there condition is worse. We need numbers right now. I‘m too hungry to fight on my own.”<br>\r\n\tTerra and Starfire rubs their growling stomachs from the painful reminder. <br>\r\n\t“Lets go.” says Raven flying towards the Donna, Aquagirl, and Bumblebee.<br>\r\n\tThe other two follow right behind. Donna looks above to Raven and the others following. Raven is chanting her magic words, but she is facing directly at Donna.<br>\r\n\t“What is she thinking?” thinks Donna. “Is she aiming at me?”<br>\r\n\tThen Donna realizes what’s going on and turn her back towards Raven. She notices the huge creature behind them. Tentacles, eyeballs, slime coming from multiple mouths. She rubs her growling stomach knowing she is not ready for this. Bumblebee and Aquagirl notices the creature as well.<br>\r\n\t“I’m probably going to be fighting this by…” thinks Donna.<br>\r\n\tBefore Donna could finish her thought Raven, Star, and Terra are chunking what they have left at it. The mess was getting angrier and angrier. Donna starts to grab any close object with weight, and starts hurling projectiles. Cars, Mailboxes, Light post, whatever she could put her hands on. Bumblebee and Aquagirl  rubbing their growling stomachs watch as the four girls go to work. The two felt to weak to help. Their attacks were having effect, but it wasn’t enough. Raven, Star, and Terra land next to Donna. The four of them look at each other clueless on their next game plan. Their stomachs were all growling viciously as well. Raven looks over her shoulder remembering the other two figures that were behind them. There is nothing to be seen behind them anymore. <br>\r\n\t“Their gone?” says Raven.<br>\r\n\t“Who are?” ask  Terra rubbing her growling stomach.<br>\r\n\t“The other two behind us.” replies Raven. “Remember there was two other figures there.”<br>\r\n\t“That just means we’re not surrounded anymore.” says Donna. “I noticed them earlier also.”<br>\r\n\t“You didn’t see this thing to it was almost to late.” says Terra.<br>\r\n\t“I so hungry.” says Star rubbing her growling stomach. “Get out of our way!”<br>\r\n\tStarfire goes flying towards the huge creature.  The other girls are shocked by her actions. As she makes a beeline for the monster two other figures are falling from above as well. The three all crash into the blob. Tentacles, mouths, eyes, slime went every where. <br>\r\n\t“Did Star do it?” ask Bumblebee still rubbing her growling stomach.<br>\r\n\t“I don’t know what just happened, but two figures came in from above.” replies Donna also rubbing her stomach. “Either way we need to clean up this mess, find our Star, and get out of here.”<br>\r\n\t“I agree.” says Raven<br>\r\n\t“Good then.” replies Donna. “Lets get started.”<br>\r\n\tRaven does her chant and starts carrying chunks of the anamorphous creature, and placing the pieces inside one of the destroyed buildings next to them. Movement is now noticeable under the pieces. Star stands up covered in monster goop rubbing her growling stomach with a look of despair on her face.<br>\r\n\t“I’m so hungry I want to eat this.” says Star. “It smells so gross though.”<br>\r\n\t“Yea I wouldn’t try eating that mess.” replies Terra rubbing her growling stomach. “That probably make you sick.”<br>\r\n\t“Yea, it looks gross.” says Aquagirl rubbing her growling stomach as well.<br>\r\n\t“Ugggh!” exclaims Star as she blast away the rest of the goop.<br>\r\n\tTwo other figures could be seen  rising from the ashes from the remaining monster mess.<br>\r\n\t“What did you do?” yells Supergirl.<br>\r\n\t“Hey what are you doing here?” ask Raven.<br>\r\n\t“We were tracking that thing.” says Supergirl as Wonder Woman was rising from the ashes as well.”<br>\r\n\t“What for?” ask Star.<br>\r\n\t“To eat.” replies Supergirl rubbing her growling stomach. “From my side of the universe those Sniorf are a delicacy.”<br>\r\n\tThe other girls faces go blank.<br>\r\n\t“We could’ve ate that?” ask Raven rubbing her  growling stomach.<br>\r\n\t“Are you girls hungry as well?” ask Wonder Woman rubbing her growling stomach.<br>\r\n\t“You have no idea.” says Terra. “I wished we went to the alley first now.”<br>\r\n\t“I’m sorry.” says Raven dropping her head still rubbing her growling and now angry stomach.<br>\r\n\t“Don’t be.” says Wonder Woman. “You did the best thing  in that situation. If we were enemies this could‘ve been bad if you girls didn‘t immediately group up. Especially seeing that we’re all starving too. ”<br>\r\n\t“Yea,” says Raven rubbing her growling stomach. “Thanks.”<br>\r\n\t“What do we do now?” ask Aquagirl.<br>\r\n\t“We should go find food!” exclaims Starfire.<br>\r\n\t“I agree with her.” says Bumblebee rubbing her growling stomach.<br>\r\n\t“I want to know why Sniorf is here.” says Supergirl rubbing her growling stomach in thought.<br>\r\n\t“What kind of question is that now?” ask Donna.<br>\r\n\t“Think about it.” says Raven. “Those things are a delicacy.”<br>\r\n\t“I don’t want to.” says Donna now rubbing her growling stomach from the thought of missing out on food. “Why do you have to remind me?”<br>\r\n\t“Because they’re on the opposite side of the universe.” replies Raven.<br>\r\n\t“Exactly.” says Supergirl. “How did it get here?”<br>\r\n\t“Could there be more here?” ask Starfire rubbing her growling stomach excitedly.<br>\r\n\t“Doubt it.” replies Supergirl. “They usually travel in packs so if there were there probably would have been with this one.”<br>\r\n\t“Awwww.” says Star disappointed.<br>\r\n\t“I want to know how it got here.” says Supergirl. “We may even find more if we keep looking.”<br>\r\n\t“I curious too.” says Raven still rubbing her growling stomach.<br>\r\n\t“I want to find food.” says Starfire.<br>\r\n\t“I agree with you.” says Aquagirl rubbing her growling stomach in agreement. “Where would we look though.”<br>\r\n</span></div></div>",
            "created":1337794320,
            "id":1343421,
            "title":"Rescue Donna, Bumblebee, and Aquagirl"
        },
        "11412":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Continue the Search for food",
                "Examine the Resturanit"
            ],
            "content":"<div class=\"\"><div> <span>\t“I’m too hungry to keep waiting!” screams Starfire rubbing her growling stomach.<br>\r\n\tDonna looks shocked at Starfire’s outburst.<br>\r\n\t“We’re all hungry sweetie.” says Donna trying to calm Starfire. “If we don’t think of something the world could be in danger.”<br>\r\n\t“You know,” says Terra still rubbing her stomach. “This is getting us no where. I don’t know about you girls, but I can’t think when I’m hungry.”<br>\r\n\t“Lets find some food.” replies Raven as her stomach rumbles. “I need to eat anything.”<br>\r\n\t“Hey wait.” says the panicked Donna rubbing her growling stomach at the thought of food. “We’re all hungry. Just hold on and…”<br>\r\n\tBefore she could finish her sentence Raven turns off the communicator monitor. <br>\r\n\t“That’s a bunch of whatever.” says Raven rubbing her growling tummy. “I’m too hungry.”<br>\r\n\t“To food!” screams Star right before she burst through the wall, and now flying her way to the city.<br>\r\n\t“To food.” says Terra and Raven as they shrug their shoulders then take off to follow her.<br>\r\n\tRaven, Starfire, and Terra take off over the city. Starfire had major head start on the other two. Rubbing her growling stomach Star went on a rampage. Wrecking building after building. Terra and Raven did not care to stop her. They are to hungry to even try. Raven watches Star as she destroyed the city in front of her. Something wasn’t right. <br>\r\n \tOn the other side of town Donna was putting her personal communicator away. Still rubbing her growling stomach she sits down slowly on the concrete.<br>\r\n\t“So what happened?” ask Bumblebee. “Did you convince them to come?”<br>\r\n\t“No.” says Donna disappointed. “They’re so distracted by their stomachs I didn’t get a chance to even to come this way.”<br>\r\n\t“Arggh!” yells Aquagirl rolling on the ground rubbing her growling stomach. “What’s the matter with them?”<br>\r\n\t“You know Starfire has the attention span of a humming bird.” replies Donna. “She just took off, and the others had to follow her.”<br>\r\n\t“So what do we do now?” ask Aquagirl.<br>\r\n\t“I don’t know.” replies Bumblebee. “We have to think of something though. I’m so hungry.”<br>\r\n\t“Me too.” agrees Donna rubbing her growling stomach.<br>\r\n\t“I can shrink down, and look around for food.” says Bumblebee. “Or something to help, or to find help.”<br>\r\n\t“I don’t understand how we got so hungry so quick.” says Aquagirl. “I don’t know about you girl, but I ate a lot before I left.”<br>\r\n\t“Stop talking about food.” says Bumblebee rubbing her growling stomach as she got off the ground. “I’m getting out of  here. Keep you communicators on. I‘ll radio back in a few to see what‘s up.”<br>\r\n\t“Good luck and be careful.” says Donna.<br>\r\n\t“Yea, and please find something.”  says Aquagirl rubbing her growling looking desperate.<br>\r\n\t“I’ll try my hardest.” replies Bumblebee as she shrinks down and flies away.<br>\r\n\t“I don’t understand why I’m so hungry.” yells Aquagirl.<br>\r\n\t“This isn’t normal.” says Donna rubbing her stomach. “That’s for sure. I didn’t eat a lot, but I did eat before I left as well. If the other girls are hungry that means the tower is devoid of food as well. I know the kitchen was full this morning when we left.”<br>\r\n\t“What do you think’s going on?” ask Aquagirl.<br>\r\n\t“I don’t know,” replies Donna, “but I don’t think Bumblebee’s going to find anything.”<br>\r\n\t“Uggh,” cries out Aquagirl rubbing her growling stomach, “don’t say things like that. We have to keep faith.”<br>\r\n\t“I know.” agrees Donna. “I just have this feeling though.”<br>\r\n\tStarfire has had enough. Now way to tire to continue Star was now just lying on Terra’s rock as they continued the search through the city. Now with some thought though. The first place they are heading is the nearest burgershack. They’ve already went through a couple restaurants during Starfire’s rampage. Even through the rubble there was no food to be found. Now they were just going to examine the place to see if it was robbed. The trio lands by Burger Bandits. They approach the door. Star was still on one of Terra’s floating rocks just rubbing her growling stomach. Raven and Terra walk to the back.<br>\r\n\t“It smells so good in here, but where is everything?” ask Terra.<br>\r\n\t“I think we missed someone.” replies Raven. “They must of cooked some food and left.”<br>\r\n\t“That doesn’t make sense though.” says Terra rubbing her growling stomach at the thought of someone running out with all the food. “We flew in. I didn’t see anyone around. There’s no dishes or filth to say this placed was used. How they cook the food?”<br>\r\n\t“I don’t know.” said Raven rubbing her growling stomach. The smell was starting to get to her. “Then what’s with the smell? You telling me it doesn’t smell like food back here.”<br>\r\n\t“French fries!” yells Star sitting up rubbing her roaring stomach in excitement. “That smell is French fries.”<br>\r\n\t“Yea, it is.” agrees Raven.<br>\r\n\t“That’s probably the fryers.” replies Terra pointing towards them. “I’ve worked fast food. It always smells like French Fries. You go home smelling like them too. It’s terrible. It’s weird though. The grease is completely clean. There’s not even any burnt fries floating around. Someone was here though. The fryer are still on. The grease is still clear.”<br>\r\n\t“Can I drink that?” ask Star rubbing her growling stomach. “It looks delicious.”<br>\r\n\t“I wouldn’t suggest.” replies Raven .<br>\r\n\t“Yea, you wouldn’t have any insides left.” agrees Terra.<br>\r\n\t“Then I wouldn’t have to think about my stomach.” says Star.<br>\r\n\t“Yea.” says Raven and Terra at the same time rubbing their growling stomachs also.<br>\r\n\t“Let’s not be stupid.” says Terra. “That will kill us. We need to figure out what happened here?”<br>\r\n\t“It looks like everything just vanished.” says Raven. “The food and the people.”<br>\r\n\t“I’m hungry!” screams Star.<br>\r\n\t“We know.” says Raven rubbing her stomach. “You’re not the only one.”<br>\r\n\t“So what do we do?” ask Terra.</span></div></div>",
            "created":1333324260,
            "id":1307543,
            "title":"Search out food"
        },
        "114121":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Find the scream",
                "Look for food"
            ],
            "content":"<div class=\"\"><div> <span>\t“I’m not done!” yells Star.<br>\r\n\t“What’s your problem?” ask Raven.<br>\r\n\t“I’m so hungry it’s ridicules.” says Raven rubbing her growling stomach. “I’m not done look for food here. There has to be something here. Anything. I’m so hungry I can eat a Gororflax!”<br>\r\n\t“We all are.” agrees Terra also rubbing her growling stomach. “I don’t care anymore. Keep searching around. We are bound to find something. There’s no way this entire resturaunt is empty.”<br>\r\n\t“What about the others?“ ask Raven. “They’re out there waiting for us injured.”<br>\r\n\t“Do you think Donna would be yelling like that if the others were injured?” ask Terra. “She had no look of concern on her face the entire time we were talking on the communicator.”<br>\r\n\t“What are you saying?” ask Raven rubbing her growling stomach.<br>\r\n\t“They’re just as hungry as the rest of us.” replies Terra. “They probably just wanted a ride back home.”<br>\r\n\tStarfire without warning burst outside the building, and flies directly into the next restaurant over. The other girls look in shock , and jump to follow their frantic friend. When Raven and Terra arrive inside the other restaurant they only find Starfire on her knees with a look of despair in her eyes. <br>\r\n\t“What happened to you?” ask Terra.<br>\r\n\tStar points forward rubbing her growling stomach. There in front of her is a pack of raccoons ravaging away at the only edible food they’ve seen. Disappointed the Star, Raven, and Terra slowly walk out rubbing their hungry, growling stomachs. They leave the kitchen area, and star digging through the trash in the dinning room of the Mexican restaurant. Slop only remained in the trashcans. The girls disgusted in themselves and the slop they were digging through, and went to clean up in the women’s room. <br>\r\n\t“Why’d we do that?” ask Raven.<br>\r\n\t“Cause your just as hungry, just as desperate as the rest of us.” replied Terra.<br>\r\n\t“Yea,” agrees Star wearily, “hungry like the rest of us.”<br>\r\n\t“I know,” says Raven “but there has to be a better way. I mean come on we’re digging through trash.”<br>\r\n\t“So does that mean you have a better idea?” ask Terra rubbing her growling stomach getting her shirt moist from still washing their hands. “All honesty I’m so hungry I could eat a dog.”<br>\r\n\t“Are dogs good?” ask Star.<br>\r\n\t“Don’t think about that.” says Raven. “Let’s just get cleaned up.”<br>\r\n\t“Then what?” ask Terra “We’ve been searching through these empty building not coming up with anything. Do you think we should waste our time going through another empty or animal infested building?”<br>\r\n\t“I don’t know what to do.” says Raven. “There just has to be another way.”<br>\r\n\t“We give it one last go.” says Terra. “Check one last building, and then while we are searching we can think of our next plan. Any objections?”<br>\r\n\t“What else are we gonna do?” says Raven. “There’s no point in standing around arguing.”<br>\r\n\t“We could get some food.” suggest Star.<br>\r\n\t“If it was that easy.” says Raven.<br>\r\n\t“Yea, lets go.” says Terra.<br>\r\n\t“I’m not holding back this time.” says Star.<br>\r\n\tThe other two glance her direction with a look of concern on their faces. The two of them shrug off her comment. The girls leave the Mexican place, and go into the next little restaurant. A Chinese place with just as little to offer. Knowing this the girls enter the building not expecting much, but hoping for the best. The smell of fried noodles still lingered in the air. This stirred up the girls hunger even more. <br>\r\n\t“Oh my stomach.” says Terra rubbing her growling stomach.<br>\r\n\t“I know.” agrees Star also rubbing her growling stomach. ”It smells so good I don’t know what to think.”<br>\r\n\t“Lets look around.” says Raven.<br>\r\n\t“You look a little happier than normal.” notices Terra.<br>\r\n\t“We might get to eat.” says Raven with a little smile now rubbing her growling stomach as well.<br>\r\nThey excitedly move to the kitchen to see what was in store for them. On they’re arrival they see a stock full of food. So much to feed a army. Star starts to shiver excitedly. Terra looks towards her with concern.<br>\r\n\t“Star what’re you thinking?” ask Terra.<br>\r\n\t“I’m just so excited!” yells Star.<br>\r\n\t“Me too!” screams Raven “Woo!”<br>\r\n\t“Jeez no!” yells Terra realizing she was watching the wrong girl.<br>\r\n\tRaven body erupts with energy.  She lost total control of her emotions, and that was not a good thing. The restaurant was covered in black flames. Cans were popping, the walls were burning, and Terra and Starfire are in cover behind Star green energy.  Screams are bellowing through the kitchen. Terra and Star look at each other in worry knowing the screams were not coming from each other. Just as quick as it started the whole mess came to a quick halt. Raven’s energy has now ran dry. She collapses from exhaustion. The restaurant was in shambles none of the food was remaining. Just debris and ashes. Raven lifts her head off the floor slowly.<br>\r\n\t“I’m so sorry.” says Raven rubbing her angry stomach.<br>\r\n\t“Ahhhh!” screams Star frustrated.<br>\r\n\t“Don’t worry about it.” says Terra rubbing her growling stomach. “It has to be hard for you to keep control the things are. Besides I doubt any of that was edible. I know I saw some cans of lard.”<br>\r\n\t“Thanks for lying to me.” says Raven.<br>\r\n\t“Yea, I’m just hungry. “ says Star rubbing her growling stomach. “I can’t think straight. I’m sorry.”<br>\r\n\t“So what do we do now?” ask Star. “I don’t think any of us had the time to think of anything.”<br>\r\n\t“I heard a scream.” says Terra. “Should we find out what it was?”<br>\r\n</span></div></div>",
            "created":1336356420,
            "id":1331118,
            "title":"Continue the Search for food"
        },
        "11413":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Stay and Fight",
                "Run away"
            ],
            "content":"<div class=\"\"><div> <span>\t“No matter how we feel we have to handle what’s going on in the rest of the world.” said Raven.<br>\r\n\t“What?” replies Starfire angrily.<br>\r\n\t“Hold on,” says Donna, “what about us?”<br>\r\n\t“You should be doing the same.” responds Raven.<br>\r\n\t“But I’m so hungry.” cries Starfire rubbing her growling stomach.<br>\r\n\t“I think we all are Star.” says Terra. “Stop thinking of yourself for one second. We have a job to do, and Raven is correct.”<br>\r\n\t“My girls over here can’t handle another battle.” says Donna.<br>\r\n\t“They don’t look anymore battle hardened than the rest of us. “ replies Terra. “You’re all just hungry like the rest of us, and being lazy.”<br>\r\n\tDonna looks down rubbing her growling stomach.<br>\r\n\t“I guess your right.” says Donna disappointed.”<br>\r\n\t“If you’re lucky you might find some food on your next mission.” says Terra.<br>\r\n\tRaven rubs her stomach growling stomach at the thought.<br>\r\n\t“Please don’t mention food right now.” says Raven. “Seeing that we are going back out there I don’t need any distractions.”<br>\r\n\t“I understand.” says Terra also rubbing her growling stomach. “The computer still shows action happening all over the planet. It’s not as much before, but that is not a bad thing.”<br>\r\n\t“So many people went missing also. I wonder if this is a part of Darkseid’s plan?” ask Bumblebee in the background of Donna’s communicator. She to was rubbing her growling stomach, but now she is standing. There was no point in laying around pretending to be really injured anymore.<br>\r\n\t“Doesn’t matter.” responds Terra. “We crush any who oppose us, return what little normality to this planet we can, and then get something to eat.”<br>\r\n\tAs Terra says the last part she slowly slides down to her knees. The hunger is getting to her to, and as hard as she tried to hide it she could not help but to rub the growling beast. She looks up to the other two in the room. Raven and Starfire look at her understandingly. <br>\r\n\t“I think I should head back to Atlantis.” says Aquagirl interrupting the moment.<br>\r\n\t“Atlantis, Why now?” ask Donna. “Should’ve you gone back when this all started?”<br>\r\n\t“I checked with them before the war, and they were untouched. I want to see if the disappearances happened there as well.”<br>\r\n\t“You just want to get something to eat.” says Star.<br>\r\n\t“Yea,” says Aquagirl rubbing her growling stomach. “but I can bring food back. The entire kingdom can’t be empty.”<br>\r\n\t“What seaweed?” ask Bumblebee rubbing her growling stomach with a look of disgust on her face. “No thanks.”<br>\r\n\t“We could get some fish!” yells Terra.<br>\r\n\tA look of disgust flashes over Aquagirl’s face, but no one noticed. No one cared to notice.\t“We have a mission.” says Raven rubbing her growling stomach. “I know we are starving, but we have a world to protect. Order to restore.”<br>\r\n\t“I wish we could order pizza.” says Star rubbing her growling stomach.<br>\r\n\t“You never let up do you Starfire?” ask Raven.<br>\r\n\t“Forget it.” yells Terra. “There’s a major battle going down on the bridge as we speak. We all meet up there and assist. After that you’re free to go Aquagirl.”<br>\r\n\t“Thank you.” interrupts Aquagirl.<br>\r\n\t“Once together we can figure out our next game plan after the fight.” continues Terra. “We are closest to the bridge so we will be the direct support. We won’t wait for your team Donna so hurry. If we get in trouble we will need you as a surprise.”<br>\r\n\t“Ok.” replies Donna. “We are moving out  now.”<br>\r\n\t“Now?” says Bumblebee rubbing her growling stomach. “Can’t we at least search around for food for a little? I’m so hungry.”<br>\r\n\t“Are you deaf or stupid?” yells Donna now rubbing her growling stomach. “We are all hungry! We have a job to do thought. So stop complaining. The same to you Aquagirl.<br>\r\n\t“Yes Ma’am.” replies Aquagirl also rubbing her growling stomach.<br>\r\n\t“We will see you girls there.” says Donna to the other three girls across the communicator.<br>\r\n\t“Good,” responds Terra, “we are taking off immediately.”<br>\r\n\tStarfire, Raven, and Terra immediately leaves the Tower, and heads towards the fight in the distance that was still going strong.  Rampant explosions were erupting across the bridge. When the girls get in view of what is going on  across the bridge they find Powergirl in a struggle with quite a few of robots of Brainiacs design. Donna’s team now on the move were not covering enough ground.  Powergirl is holding her own, and has been doing so for quite sometime. The robots were not stopping though. No matter how much she pummeled them the robots would repair, and keep coming. It was beginning to look hopeless. Powergirl now collapses to her knees.<br>\r\n\t“Not one of you could touch me. I’m just to hungry to finish this.” says Powergirl rubbing her growling stomach.<br>\r\n\tTaking advantage of the moment of weakness the robots close in. All five of them were approaching for a devastating blow. Before they could make it Starfire slams into one of them. Terra and Raven launch volleys at the remaining four while Star slung the one she carried off back into the group then started blasting star bolts. The girls send pieces of the robots flying everywhere. They now approach Powergirl to check on her condition.<br>\r\n\t“Are you ok?” ask Raven.<br>\r\n\t“Yea, what’s wrong with you?” ask Terra. “That should’ve been a cake walk for you.”<br>\r\n\t“I’m to hungry.” says Powergirl rubbing her growling stomach. “It’s unbearable.”<br>\r\n\tReminded of their situation the other girls look down in pain.<br>\r\n\t“Yea, we’re starving too.” says Star rubbing her growling stomach.<br>\r\n\t“Yea.” says Terra and Raven also rubbing their growling stomachs.<br>\r\n\t“Shame.” says Powergirl.<br>\r\n\t“Yea I know.” says Terra.<br>\r\n\t“No you don’t.” replies Powergirl pointing behind the other three. “We’re not done here.”<br>\r\n</span></div></div>",
            "created":1336687620,
            "id":1334042,
            "title":"Handle the remaining villains running rampant a..."
        },
        "1142":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Batman TAS",
                "Superman TAS",
                "Batman Beyond or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Several DC cartoons shared the same continuity they are listed here</span></div></span></div>",
            "created":1301202000,
            "id":1077343,
            "title":"DCAU"
        },
        "11423":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Batman Beyond",
                "Static Shock or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1301202000,
            "id":1077344,
            "title":"Batman Beyond or"
        },
        "114232":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Static Shock",
                "Zeta project or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list goes on</span></div></span></div>",
            "created":1301202000,
            "id":1077347,
            "title":"Static Shock or"
        },
        "1142322":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Zeta Project",
                "Justice League"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends here</span></div></span></div>",
            "created":1301202000,
            "id":1077348,
            "title":"Zeta project or"
        },
        "1143":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "The Batman",
                "The Legion of Superheroes",
                "Batman the and the brave and the bold or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077356,
            "title":"The Batman or"
        },
        "11433":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Batman  the brave and the bold",
                "Young Justice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list end</span></div></span></div>",
            "created":1301202000,
            "id":1077357,
            "title":"Batman  the brave and the bold or"
        },
        "115":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "MAU",
                "X-men evolution",
                "spectacular spiderman or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list begins</span></div></span></div>",
            "created":1301202000,
            "id":1077363,
            "title":"Marvel"
        },
        "1151":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "X-men",
                "Iron man",
                "Fantastic Four or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>like dc marvel also had several shows that shared continuity</span></div></span></div>",
            "created":1301202000,
            "id":1077366,
            "title":"Marvel animated univers"
        },
        "11513":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Fantastic Four",
                "Spiderman or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077367,
            "title":"Fantastic Four or"
        },
        "115132":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Spiderman",
                "Avengers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077368,
            "title":"Spiderman or"
        },
        "1153":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Fantastic Four worlds greatest heroes",
                "spectacular spiderman",
                "Wolverine and the x-men or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077369,
            "title":"spectacular spiderman or"
        },
        "11533":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Wolverine and the xmen",
                "Iron Man: Armored Avengers or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077371,
            "title":"Wolverine and the x-men or"
        },
        "115332":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Iron Man armored avengers",
                "Avengers earth's mightiest heroes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077373,
            "title":"Iron Man: Armored Avengers or"
        },
        "12":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "DC",
                "Marvel",
                "Crossover"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>all comic book stories star here</span></div></span></div>",
            "created":1301202000,
            "id":1077376,
            "title":"Comics"
        },
        "121":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Batman family",
                "Superman family",
                "Wonder Woman Family or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm going to put the girls in groups</span></div></span></div>",
            "created":1301202000,
            "id":1077378,
            "title":"DC"
        },
        "1213":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Wonder Woman Family",
                "Justice League",
                "Teen Titans or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077381,
            "title":"Wonder Woman Family or"
        },
        "12133":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Teen Titans",
                "JSA or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077382,
            "title":"Teen Titans or"
        },
        "121332":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "JSA",
                "Oustsiders or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077384,
            "title":"JSA or"
        },
        "1213322":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Outsiders",
                "Birds of prey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077386,
            "title":"Oustsiders or"
        },
        "122":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "X-men",
                "Spiderman",
                "Fantastic Four or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girls of the mu will be split inot groups</span></div></span></div>",
            "created":1301202000,
            "id":1077387,
            "title":"Marvel"
        },
        "1223":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Fantastic Four",
                "Avengers",
                "Hulk or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list continues</span></div></span></div>",
            "created":1301202000,
            "id":1077389,
            "title":"Fantastic Four or"
        },
        "12233":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Hulk",
                "Marvel Knights"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the list ends</span></div></span></div>",
            "created":1301202000,
            "id":1077391,
            "title":"Hulk or"
        },
        "123":{
            "author_id":"kid_rancid",
            "author_name":"Kid Rancid",
            "choices":[
                "Move out as a single group",
                "Split up while Emma rest",
                "Stay together and rest then move out"
            ],
            "content":"<div class=\"\"><div> <span>\tBatgirl wakes up on the floor confused. The area is dark and unfamiliar. She gets up, and takes a look around.<br>\r\n\t“Hell... Ooooh.” says Batgirl. Her stomach starts growling. “Oh I’m so hungry.” She rubs her belly in contemplation. “Why am I this hungry? I know I ate... Well I don’t know how long I was out for. Where am I?”<br>\r\n\t“We’re in a cave.” says Huntress walking in rubbing her growling stomach. “I’m starving as well. This place looks barron.”<br>\r\n\t“Huntress how did we get here?” ask a confused Batgirl still rubbing her stomach. “I don’t remember even getting into costume. I’ve never been this hungry before in my life either.”<br>\r\n\t“I don’t know.” replies Huntress. “I awoke to find myself laying next to two girls in a middle of a field. I was hungry, not as hungry as I am now, and I did not recognize any of the plant life in the area. The animals either.”<br>\r\n\t“So as far as we know we’re on another planet?” ask Batgirl shocked.<br>\r\n\t“Thats what I thought.” replies Huntress. “Then I looked...”<br>\r\n\tHuntress stomach growls louder while she is rubbing it.<br>\r\n\t“I’m sorry. I’m so hungry.” says Huntress. “Well I looked at the sky. I didn’t know what to think then.”<br>\r\n\t“What do you ooo...” says Batgirl trying to get up. She stumbles back to the floor light headed rubbing her growling stomach.<br>\r\n\t“Don’t get up too quickly.” says Huntress rubbing her stomach. “You were out at least six hours. No telling how long before I woke up.”<br>\r\n\t“Sorry, I got too excited there.” says Batgirl rubbing her stomach. “What do you mean you didn’t know what to think?”<br>\r\n\t“Get yourself together.” says Huntress. “The only way is to show you.”<br>\r\n\t“You’ve been by yourself for six hours?” ask Batgirl. “I’m hungry enough to destroy every Gotham Burger in Gotham...”<br>\r\n\t“Gross.” says Huntress.<br>\r\n\t“... and you’ve been here awake by yourself for that long.” says Batgirl finishing her last sentence. “You must be starving.”<br>\r\n\t“I admit that eating at Gotham Burger right now is better than this,” says Huntress rubbing her growling stomach, “but I wasn’t by myself. I woke up next to two of you.”<br>\r\n\t“There’s someone else here?” says Batgirl on getting up again.<br>\r\n\t“Yea she helped me carry you here.” says Huntress. “I’ve never seen her before. She comes off a little stuck up, but she seems good. She was unconscious next to us when I awoke.”<br>\r\n\t“Where is she now?” ask Batgirl.<br>\r\n\t“We had split up to look around for some food.” says Huntress.<br>\r\n\tThe thought of food made her collapse. Her stomach was growling even more.<br>\r\n\t“I feel so empty inside.” says Huntress on her back rubbing her stomach.<br>\r\n\t“Are you ok?” ask Batgirl also rubbing her growling stomach.<br>\r\n\t“Just let me sit a second.” replies Huntress rubbing her still growling stomach. “She suggested we take a look around the area after we got here. We were supposed to meet up after we were done.”<br>\r\n\t“How are you supposed to when to meet her back?” ask Batgirl.<br>\r\n\t“She told me to think about her, and she’d come back to the cave.” says Huntress.<br>\r\n\t“What does that mean?” says Batgirl confused.<br>\r\n\t“It means think about me, and I’ll show up.” says Emma Frost walking in slowly.<br>\r\n\t“How’d you do that?” ask Batgirl.<br>\r\n\t“Well aren’t you full of questions.” says Emma sitting down against the cave wall.<br>\r\n\t“I’m a bit confused.” says Batgirl. “Aren’t you?”<br>\r\n\t“Yes, but seeing that we’re all in this together that means you know as much as I do. Well except that I’m psychic as well. Now you know as much as I do about the situation.” says Emma.<br>\r\n\t“You find anything?” ask Huntress rubbing her growling stomach.<br>\r\n\t“Does it look like I found anything? replies Emma rubbing her growling stomach also with her head against the cave wall.<br>\r\n\t“What’s your problem?” ask Huntress.<br>\r\n\t“I’m hungry, and a little snippy.” responds Emma rubbing her growling stomach. “Just like you.”<br>\r\n\t“Yea.” says Huntress sitting up. “So we don’t really know you so you can just call me Huntress.”<br>\r\n\t“And the other growling belly over there is Batgirl right.” says Emma. “I already know more than your code names.”<br>\r\n\t“Yea well we’re not psychic.” says Batgirl rubbing her stomach.<br>\r\n\t“Yea,” agrees Huntress, “ and I don’t know how comfortable I am with you know what you know.”<br>\r\n\t“Well we’re from two entirely different places.” responds Emma. “Maybe even dimensions. I’ve never even heard of the people or things from your memories. I couldn’t do anything to you anywhere else than here, and I really can’t do much here.”<br>\r\n\t“Thats fine I guess, but I still don’t know your name.” says Huntress rubbing her growling stomach.<br>\r\n\t“That thing sounds like a dump truck.” says Emma.<br>\r\n\tBatgirl giggles.<br>\r\n\t“Funny.” says Huntress. “I still need to know what to call you.”<br>\r\n\t“I have no problem giving my name.” responds Emma.<br>\r\n\tA loud rumbling sound is heard. Everybody but Emma looks confused.<br>\r\n\t“Where did that come from?” ask Batgirl shocked.<br>\r\n\t“Was that you?” ask Huntress looking at Emma<br>\r\n\t“It’s ok.” says Emma laughing. “All of you need to calm down. Nobody here trust each other, but I’m the only one who has told a lie.”<br>\r\n\tBatgirl and Huntress looks at each other confused.<br>\r\n\t“We trust each other.” says Batgirl rubbing her stomach.<br>\r\n\t“Yea, but the psychic already knows that.” says Huntress. “And what are you talking about lying?”<br>\r\n\t“My name’s Emma. Emma Frost. I run a school for gifted children”<br>\r\n\t“That sounds like a lie.” says Huntress rubbing her growling stomach. “You taking care of the handicapped. Seems like you’re trying to sell your self as good.”<br>\r\n\t“What is your growling belly a lie detector?” laughs Emma. “That shows we are from two different worlds. By gifted I mean mutants like me. Children gifted with powers from birth. I’m apart of the X-Men.”<br>\r\n\tBatgirl and Huntress look at each other confused.<br>\r\n\t“They’re pretty big. Loved and hated.” says Emma. “The lie that a told is that I did find something out... Ow don’t jab me with your elbow. Just sit there rubbing your stomach. They’re good people.”<br>\r\n\t“Who are you talking to?” ask Huntress rubbing her stomach.<br>\r\n\t“This is Sue Richards.” says Emma gesturing at the empty space next to her. “Show your self.”<br>\r\n\tAfter a few seconds Susan reveals herself reluctantly. Batgirl and Huntress look surprised.<br>\r\n\t“She is the Invisible Woman from the Fantastic Four.” continues Emma.<br>\r\n\t“The Fantastic Four?” says Batgirl rubbing her stomach looking more confused.<br>\r\n\t“You never heard of the Fantastic Four?” ask Susan rubbing her growling stomach.<br>\r\n\t“No.” says Huntress.<br>\r\n\t“You see.” exclaims Emma. “The FF is one of the biggest names from our realm just as the X-Men. The Fantastic Four though is known and loved by nearly everyone for their scientific leaps and bounds. For their generosity too. They’re practically America’s First Family.”<br>\r\n“Oh wow.” says Batgirl.<br>\r\n“These two are vigilantes from where they’re from.” says Emma. “Pretty big names as well. If we were where they’re from we would have heard of them.”<br>\r\n“So we have no issues then why we shouldn't work together?” says Susan now lying on her back rubbing her stomach now growling more than ever. “I want to find some food!”<br>\r\n“I hear ya.” agrees Batgirl rubbing her growling stomach also. “I’m so hungry I can eat an elephant.”<br>\r\n“Yea I don’t see why we shouldn’t work together.” says Huntress also rubbing her growling stomach. “And I’m up to do some more looking around. We don’t know why we are here, where we are, and if we don’t get some food we will be powerless if anything comes up.”<br>\r\n“Yea, but I just got back.” says Emma rubbing her growling stomach. “I just need a little rest. We could split up. We’ll meet up the same way we did before. Just my team will wait here a minute so I can catch my breath.”<br>\r\n</span></div></div>",
            "created":1354663260,
            "id":1481970,
            "title":"Crossover"
        },
        "13":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Pokemon",
                "Digimon",
                "Yugioh (any of the series)",
                "Naruto",
                "One Piece or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>choose your shows</span></div></span></div>",
            "created":1301202000,
            "id":1077398,
            "title":"Anime"
        },
        "135":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "One Piece",
                "Bleach",
                "Megaman or"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>short list</span></div></span></div>",
            "created":1301202000,
            "id":1077401,
            "title":"One Piece or"
        },
        "1353":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Megaman",
                "Sailor Moon",
                "Dragon Ball"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>end of list</span></div></span></div>",
            "created":1301202000,
            "id":1077403,
            "title":"Megaman or"
        },
        "13533":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "Dragon Ball Z",
                "Dargon Ball GT"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>take your pick</span></div></span></div>",
            "created":1301277660,
            "id":1077405,
            "title":"Dragon Ball"
        },
        "14":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "other",
                "other",
                "crossover",
                "crossover",
                "crossover"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here you can put in any other cartoon/anime/comic you can think of or make a crossover of girls from multiple categories</span></div></span></div>",
            "created":1309299600,
            "id":1136619,
            "title":"other of the category/crossover"
        },
        "15":{
            "author_id":"edward10",
            "author_name":"phantom writer",
            "choices":[
                "other",
                "other",
                "crossover",
                "crossover",
                "crossover"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here you can put in any other cartoon/anime/comic you can think of or make a crossover of girls from multiple categories</span></div></span></div>",
            "created":1309299660,
            "id":1136620,
            "title":"other of the categories/crossover"
        }
    },
    "info":{
        "author_id":"edward10",
        "author_name":"phantom writer",
        "brief_description":"You are now entering a place where your favorite female characters stomachs are never full",
        "created":1301270460,
        "description":"<td align=\"left\" class=\"norm\">rules are very simple<br>\r\n<br>\r\n1. Characters stomachs must be making noise and they must be rubbing them in other words they have to be hungry every chapter<br>\r\n2. girls only<br>\r\n3. no sex or toilets<br>\r\n4. I will allow vore/weight gain every once in a while during the story<br>\r\n6. try to use all the girls in the series you select<br>\r\n5. I'm the only one who writes option chapters</td>",
        "id":1763020,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1354663260,
        "modified":1354663260,
        "pretty_title":"Hunger female zone"
    }
}