{
    "chapters":{
        "1":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "The RA, Cathy. Introducing herself",
                "Mary. She decided to take you with her",
                "The students from across the hall",
                "Betty the guidance counselor. Checking on Sam",
                "A pair of sorority sisters advertising their sorority"
            ],
            "content":"<div class=\"\"><div> <span>Sam sat helplessly on the kitchen counter as he watched the numerous boxes being brought up to the apartment. He was finally here, he made it to college. His mind was racing and his palms sweat as he began to panic over the coming school year. Just then, Mary came in and gently picked him up. \"What's the matter, sweetie? Nervous?\" Sam nodded. Mary giggled, \"You'll be fine. We're taking almost the same schedule!\" Sam remembered. They were both culinary arts majors and would be in a lot of the same classes. Though Sam was focused more on baking.while Mary was looking into catering. Sam let out a sigh of relief as the last of the boxes were brought up. Mary hugged her mother as she waved goodbye and left. \"Well, Sammy. Here we are. A college couple.\" she giggled again as she gently kissed Sam. Her soft, crimson lips pressed against his entire body as he blushed bright red. \"Well, you be safe, dear. I have to buy our books. You stay put and don't go wandering. You might end up a meal.\" Mary giggled as she shut the door behind her. Sam found himself alone in the apartment. He decided to take a nap and was heading to his custom-fit bed when suddenly the door knocked, and without waiting for a response it opened.<br>\r\n<br>\r\nWho was at the door?</span></div></div>",
            "created":1361422800,
            "id":1536693,
            "title":"Moving In"
        },
        "11":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "The Welcome Festival was going on",
                "She was going downtown",
                "She wanted to go hang out with some friends across campus",
                "Cathy was going to stay at the apartment and watch a movie"
            ],
            "content":"<div class=\"\"><div> <span>Sam saw a figure enter the room, and quickly approach him. With an ear piercing pitch the woman spoke, \"Hi there! I'm Cathy! The RA!\" Sam was going to have to get used to her personality but she seemed nice enough. He introduced himself and was taken off guard as Cathy scooped him up and pressed him tight against her chest, not that Sam was complaining about this fact. She was pretty cute. \"Aren't you just the cutest thing! I'm going to love you to pieces.\" And before Sam could say another word he was quickly escorted out of the apartment and down the hall in a blur as she flew to her apartment and slammed the door behind her. She dropped Sam on her bed and plopped down beside him, smiling wide. \"I am so glad I found you! I was sooooo lonely. But now I got a new pet and I am so happy!\" Sam was confused and began to protest, \"I'm not a pet! I'm a student, like you.\" Cathy's expression turned grim, \"Are you back talking? I'm in charge and you'll obey lest you end up dead. Understood?\" Sam nodded his head and Cathy snapped back to her bubbly attitude from earlier, \"Great! You're going to have so much fun! Just watch out for Celeste.\" Sam was concerned, \"Uh. Who's Celeste?\" Cathy responded, \"My apartment mate, she hates me and always breaks my pets.\" Sam became even more worried. But he couldn't dare escape and face Cathy's wrath. He was snapped out of his thoughts when he heard Cathy's voice again, \"So, what do you want to do today? Classes don't start for another day, so we can have fun! Oh! I know!\"<br>\r\n<br>\r\nWhat did Cathy have planned for the day?</span></div></div>",
            "created":1361422800,
            "id":1536844,
            "title":"The Welcome Party"
        },
        "111":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "The food stall",
                "The student government stall",
                "A game stall"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's check out the Welcome Festival!\" Before Sam could protest, he was quickly scooped up and place tight in Cathy's cleavage. It was a comfy trek down to the college green where the festival was held. Sam was in awe. There were numerous stalls set up, food stalls, student organization stalls, face painting stalls, everything a festival would have. There were rides and games. He figured something wasn't right but Cathy was moving too fast for him to think straight. She bounced from stall to stall, trying food, winning prizes and the like. She barely paid Sam any attention. So it was no surprise that when she was bumped by a passing student, causing Sam to fall out, she didn't notice. Sam was now lost at the festival. Numerous students walking all around him, he knew he had to get help soon or end up crushed. He couldn't read any of the signs so he just headed to the closest stall and hoped for the best. It was risky, but better than the alternative. Sam ventured out and approach the stall, the nailed 2x4 boards and uneven paint job was a dead give away that is was constructed at the last minute. He chuckled to himself and went around back.<br>\r\n<br>\r\nWhich stall was he at? </span></div></div>",
            "created":1361422800,
            "id":1536849,
            "title":"Festivals Are Fun. Right?"
        },
        "1111":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Sam would belong to Sara",
                "Sam was now on the food stall menu"
            ],
            "content":"<div class=\"\"><div> <span>Sam went around the back of the stall and knew from the smell that it was the food stall. The fresh aroma of pastry and the warm smell of cooked food was enough for Sam to realize he hadn't eaten all day. But he needed to get the stall attendant's attention. He began to climb her denim jean leg, the large seams provided a nice holding. He was able to quickly climb up the pants and leap over to the counter. After a short scream from Sam, the student discovered him and gently picked him up. She had long black hair, green eyes, heavy makeup and a filled out body. \"Hiya, little guy. You must be new to school. I'm Sara.\" Sam introduced himself and told Sara what had happened and that he needed to get back to Mary. Sara listened but seemed to have different plans in mind. \"You know what? That sounds fine and all but I got a better plan.\" Sam was nervous but curiosity got the better of him. \"What's your plan?\" He asked. Sara grinned an evil grin, \"You'll see soon enough, little one. Just hold on tight.\" Sam was scared now and he had to get away. While Sara was dealing with a customer, he made a break for it and began to run. Sara spotted him and quickly slammed her hand down on him. \"Not so fast now. You haven't heard my plan yet.\"<br>\r\n<br>\r\nWhat was her plan? </span></div></div>",
            "created":1361422800,
            "id":1536853,
            "title":"Never Trust Festival Food"
        },
        "11111":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "She missed, she was only teasing him",
                "She missed. She wasn't joking but wanted to save him for last"
            ],
            "content":"<div class=\"\"><div> <span>\"You're mine now!\" Sara said with a smirk. Before Sam could protest, Sara dropped him in her open purse and zipped it up behind him. Sam was now trapped and could do nothing but just wait it out and see what she had planned for him. He soon dozed off, and before he knew it, the zipper was reopened and Sam was removed to find himself in a standard dorm room. \"Welcome home, little guy.\" Sara said as she grabbed some water from the micro fridge. From out the window he could see it was now evening. \"Let me go! I'm a student!\" Sam yelled at the giant woman almost causing her to choke on her water from laughter. Sara sat down the water, sat on her bed and turned her head to Sam on the desk. \"You don't know, do you?\" Sara asked, \"If you go missing, the school doesn't care. It's finders-keepers. And I'm keeping you!\" And with that Sara got back up and proceeded to make herself a simple PB&amp;J on white. Sam sat down as he had to soak it all in. He was in disbelief. Sara, realizing this, felt a little sorry. \"Hey, cheer up little guy. Or I'll put you in my sandwich.\" She giggled, but didn't let on if it was really a joke. Sam continued to be in disbelief, it just couldn't be true. This college was the end of him? He was shaken from his thoughts as Sara picked him up. \"I told you to cheer up and you didn't.\" She then presses Sam into the peanut butter covered slice of bread, it was so fluffy and soft Sam almost felt relaxed if it wasn't for the danger. But he was too depressed to care. Sara pressed the jelly slice of bread on top of him, with only his head sticking out. Using the palm of her hand she pressed it tight and picked up the sandwich. Sam was completely stuck, immobilized. The jelly began to drip into his eyes and blurred his vision of Sara's ever-approaching maw. Licking her lips she moved in for the bite.<br>\r\n<br>\r\nAnd then...?</span></div></div>",
            "created":1361422800,
            "id":1536864,
            "title":"Property of Sara"
        },
        "111111":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Made his escape to find Mary",
                "Lay down, get some sleep, and stay with Sara"
            ],
            "content":"<div class=\"\"><div> <span>Sara took a bite to the left of Sam. He could feel her breathe upon him, her hot and humid breathe. But to his surprise he was still alive. He watched as Sara chewed the sandwich up and swallowed it. He watched the lump go down her throat and knew that he would be in that position soon enough. But to his surprise, Sara sat down the sandwich, peeled the top slice back and plucked Sam out. She then proceeded to wash off the jelly and peanut butter with her tongue, gently grazing over his body, leaving a slim layer of saliva behind, soon Sam was completely cleaned off and Sara sat him to the side as she finished her sandwich. Sam didn't say a word but just watched her eat. Knowing that he was so close to being eaten. Sara finished up, wiped her mouth with her sleeve then turned to Sam. \"Don't think I like you or anything. It's just you're too cute to get rid of so quickly.\" Sara smiled, and then got ready for bed. Sam couldn't help but stare as she removed her clothes and slipped into a long shirt. It's like she wanted him to look, but he wasn't sure yet. As Sara got in bed, she placed Sam on the desk, planted a kiss on him and went to bed. Sam was confused and didn't know what to think. But he knew he needed to find Mary. Or did he, Sara seemed to be taking a liking to him, and she was pretty cute. Sam was torn, but if he was going to do something, now was the time.<br>\r\n<br>\r\nWhat did Sam do?</span></div></div>",
            "created":1361509200,
            "id":1537413,
            "title":"Just Joking!"
        },
        "11112":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Sam reforms the next day",
                "No luck. Sam's dead"
            ],
            "content":"<div class=\"\"><div> <span>\"We are running low on food, and I think you'll do perfectly.\" Sara picked Sam up, and run her tongue all over his frightened, shivering body. \"Mmmmm. You are so sweet, yes. You'll do fine.\" Sam was terrified. He began to cry as a student approached the stall. She was a junior, red hair, green eyes, tall and athletic. She spied Sam and asked Sara if he was on the menu, Sara confirmed it, and the student became giddy. She looked at the menu hanging above the service window. It was a basic menu with the standard festival fare, hot dogs, cakes, corn dogs, and the like. After a few minutes, the student had decided. She told Sara she wanted a corn dog. Sara nodded in acknowledgement and went to the prep station. With the still-frightened Sam in hand she prepared the batter, and coating. Humming to herself she placed Sam on the worktop, and forcefully rammed the wooden stick down his throat. At this point, Sam was loosing consciousness, he was fading in and out. The last thing he remembered was the sound of sizzling oil and the sticky feel of batter and then an immense heat as he was held under.A few minutes later, Sara presented the student, who's name was Erica, with the corn dog. Unassuming on the outside, but as Erica cheerfully chomped, the darker secret was revealed. But no one seemed to pay it any mind as Erica enjoyed the festival and the food. </span></div></div>",
            "created":1361422800,
            "id":1536873,
            "title":"You Are What You Eat"
        },
        "111121":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Miss Jackson wanted to see Sam after class, alone",
                "Mary dropped her pencil, and Miss Jackson was just returning it. Off to class!"
            ],
            "content":"<div class=\"\"><div> <span>To Sam's luck, he re-awoke the next day in his bed. He was confused, he thought he was dead, but he obviously wasn't. His confusion was interrupted as Mary barged in the room, \"Sam! Hurry up! We're going to be late for class!\" Mary snatched Sam up, threw him in her book bag and rushed to class. Sam was all disoriented but he was lucky to have a girlfriend who cared. Mary made it to class on time and sat Sam on the edge of her desk. The class was Food-Science He was too busy taking notes to pay attention to all the eyes trained in on him. The professor was a 30 year old, brunette, short hair and glasses. Her name was Miss. Jackson and she seemed nice enough. She was strict but not mean. Sam quite liked her and thought it would be a good class. Before too long, the class was dismissed, and Mary picked up Sam and began to walk out. All the other girl's still continued to stare at Sam as they walked out. Each one probably with their own ideas. \"Wait just a minute!\" Miss Jackson yelled at Mary. Mary turned around and waited for Miss Jackson to continue.<br>\r\n <br>\r\nWhy did she stop Mary?  </span></div></div>",
            "created":1361422800,
            "id":1536887,
            "title":"Lucky Day"
        },
        "1111212":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "There would be one group of three",
                "There would be 6 groups and Sam was now an ingredient "
            ],
            "content":"<div class=\"\"><div> <span>\"You dropped your pencil!\" Miss Jackson said as she handed the pencil back to Mary with a smile. Mary smiled back and then continued on her way. The two walked down the hall and reached the next classroom. \"Well, this is the time where we split, I'll pick you up after class, so don't go wandering off.\" Mary said as she gently set Sam down at the entrance to his baking class.Sam smiled back up at Mary as he walked in to his class, Mary was off to her catering class and he missed her. The classroom was set up more like a lab, than a classroom. There were long tables with stools, and various machines strewn across the top. Sam struggled to get on top of the stool, and was taken by surprise when a mysterious hand helped him up. Sam looked behind him to see who it was, but the student was already gone. Sam gave it a shrug and prepared for class to start. The professor made her way to the front of the class and ordered everyone to pair up. There were about a 13 students in total, and of course Sam was the odd one out due to his size. The professor noticed this, and she seemed to have gotten an idea.<br>\r\n<br>\r\nHow would she remedy the odd number?</span></div></div>",
            "created":1362775560,
            "id":1546286,
            "title":"All Alone In Class"
        },
        "111122":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "content":"<div class=\"\"><div> <span>No such luck. Sam was dead for good, and as Erica's sharp pearl-white teeth cut through his tender body, all he was now, was food. His body dipped in ketchup and munched on by a pretty young lady. He was no longer a living being, just food. Providing her plenty of nutrients and essential fats as what was once Sam was now helping Erica make it through the school year. Giving her the energy she needed to make high-marks. But Sam didn't care, all he was now was fat on her boobs. Erica went on to become a successful lawyer. Mary never figured out what happened to Sam, soon forgot about him and lived happily. And soon, no one remembered the aspiring man. He was but a faded memory. The school never gave a direct answer, but then again, no one really cared about some nobody like Sam.</span></div></div>",
            "created":1361422800,
            "id":1536880,
            "title":"Keeping Her Figure"
        },
        "1112":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "A snack",
                "Kelly's Personal Assistant "
            ],
            "content":"<div class=\"\"><div> <span>Sam found himself at the student government stall. This was presumably an attempt to get new students involved in the workings of the student government. Sam was mildly interested in politics so while he was here he might as well learn more about it. There was one student working the stall, handing out flyers, answering questions, and the like. Sam climbed the supports of the stall and made it to the stall's flat top where he tried to get the student's attention. Before too long, the woman looked down and realized Sam was there. \"Why hello there, little guy. You interested in the government here?\" Sam nodded as the woman gently picked him up, bringing him to her smooth, delicate, face. \"Awwww isn't that the cutest thing?\" she continued, \"I'm Kelly, the student body president. And I think there is a position you would fill quite nicely.\" Sam was somewhat confused, normally student government involved campaigns and elections but here was Kelly giving him a position in the government body. \"What position would that be, President?\" Sam asked confidently.<br>\r\n<br>\r\nWhat was the position?</span></div></div>",
            "created":1361509200,
            "id":1537392,
            "title":"The President's Orders"
        },
        "11121":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Yes. He awakes safe in bed",
                "No. He nourishes the president"
            ],
            "content":"<div class=\"\"><div> <span>\"You're going to be my food,\" Kelly said with a smug look on her face, \"And just in time, I'm so hungry!\" Sam began to protest but it was to no use as Kelly pulled out her lunch from under the counter and with Sam in one hand, she began to lay out her food. Sam tried to struggle and squirm but her grip just got tighter. She hummed to herself as she laid out her veggie wrap. She began to unroll it as Sam got even more scared. And before he could blink he found himself tossed onto the cold expanse on lettuce. The cold hit him head on as he soon became drenched in salad dressing that Kelly was pouring. \"You're going to be so tasty!\" she said as she sprinkled some shredded carrot across the wrap. Satisfied with the creation she began to roll it back up. Sam became dizzy as the surroundings just spun, his head was sticking out of the wrap but it was so tight there was no chance of escape. He could only look head on as Kelly licked her lips and opened her maw to him.<br>\r\n<br>\r\nThe humid air hit Sam immediately as he found himself being slowly placed in her mouth, he went past her crimson lips and was greeted by her tongue playfully stroking his face. With a loud crunch, Sam fell. Kelly had bitten the wrap and he was now trapped in the dark expanse of her mouth. Again, her tongue harassed him. It slid across his body, wrapped around him, and just toyed with him, as the teeth effortlessly masticated the wrap. Flashes of white was all Sam could see. Soon the chewing stopped, and he could hear the muscles begin to churn as the wad of food made its way to the throat. Sam tried to stay away, but the tongue pushed him down. Sam could feel the pulsations as the muscles rhythmically brought Sam down to the stomach where he landed with splash. The immediate burn of the acid was too much, as Sam screamed in agony. Before too long, he blacked out due to the fumes.<br>\r\n<br>\r\nDid Sam reform?</span></div></div>",
            "created":1362259260,
            "id":1542461,
            "title":"Secretary of the Interior"
        },
        "112":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "A Bar",
                "A nice little cafe",
                "The downtown park"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go downtown! It's going to be fun!! C'mon!\" Cathy said as she grabbed Sam, ran down the apartment stairs and out to her car. She got in, placed Sam in the cup holder, and then began to drive downtown. \"We got such a variety downtown! I know you're new so it'd be good for you to know the surroundings! It'll be great!\" Sam began to zone out as Cathy talked non-stop the entire trip. Sam could see out of the side windows as the car left campus and began to enter a more urban environment. The college was located out of the way and it took a 10 minute drive to reach the downtown area. There were plenty of bars and restaurants. There were the typical cafes and coffee shops. A couple of drug stores and a grocery store. It was a good-sized downtown, and Sam would hate to be lost here. There were crowds of people walking down the sidewalk on both sides, it was definitely bustling. \"So, where do you want to go?!\" Cathy asked with her normal cheery spirit.<br>\r\n<br>\r\nWhere did they go?</span></div></div>",
            "created":1361556420,
            "id":1537419,
            "title":"Hitting The Town"
        },
        "114":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Yes. Celeste was busted",
                "No. Celeste got away with it!"
            ],
            "content":"<div class=\"\"><div> <span>\"We're going to watch movies!\" Cathy said with the same enthusiasm she gave everything. Before Sam could say a word, he was quickly taken into the main room, placed on the couch and told to stay while Cathy got everything situated. After she turned off the lights and popped in the movie, she sat down on the couch and placed Sam on her lap. She gently stroked his tiny body as he layed out on her leg. He was enjoying this and could get used to this set-up. A few hours later, the second movie had ended, and both Sam and Cathy had fallen asleep on the couch. The door to the apartment slowly opened and in walked Celeste. Medium height, slightly chubby, black hair and blue eyes. She wasn't unattractive. She saw Cathy was asleep and then quickly noticed the tiny guy. Grinning an evil grin, Celeste sneaked up to the couch and gently plucked Sam from Cathy's leg. Sam was still asleep and Celeste headed to her room. Just then, Cathy began to stir. Celeste stopped in her tracks, her heart beating faster.<br>\r\n<br>\r\nWas Cathy awake? </span></div></div>",
            "created":1361422800,
            "id":1536894,
            "title":"Movie Night!"
        },
        "1142":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Celeste spit Sam out. She wasn't done with him",
                "Celeste took a sip of water to wash it all down",
                "Celeste began to choke!"
            ],
            "content":"<div class=\"\"><div> <span>Cathy was just turning over. She was still sound asleep, which meant Celeste had gotten away with it. She took Sam into her room, dropped him in her book bag and then went to sleep. Sam didn't wake up until mid morning the next day. He was confused and disoriented as he found himself in a dark area. He tried to feel his way around and came across the familiar feel of brown paper. Sam knew it was a lunch bag, and he realized he hadn't eaten in the longest time. He easily ripped through the bag and felt a bottle of water, an apple, and plastic wrap. Sam peeled back the plastic wrap and his smell told him he had come across a salad. Hungrily he dove into the salad and quickly ate his fill. But by this time he heard a rumbling coming from above and a sudden jolt as the bag was removed roughly. Sam tried to get out of the salad but as he climbed the side of the container he lost his grip and fell back in, getting covered with dressing and having a slice of cucumber fall on top of him. He was stuck as light poured into the bag and the salad was removed. Celeste smiled down at him. \"Looks like you did the work for me.\" She licked her lips and pulled out a fork. Fiercely stabbing the surrounding lettuce, spinach, cucumber, and carrots, Sam knew he was doomed. Before too long he found himself being brought towards Celeste's crimson lips and gaping maw, the humidity of the cave struck him like a bus as it got dark. Her tongue ran down Sam's sides, caressing him all over. Sam couldn't help but be slightly aroused by this but he was still horrified. Just when the chewing stopped around him and he thought swallowing was near. Everything became still.<br>\r\n<br>\r\nAnd then?</span></div></div>",
            "created":1361509200,
            "id":1537399,
            "title":"Spending the Day With Celeste"
        },
        "11423":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "On top of one of the tables.",
                "A food station. "
            ],
            "content":"<div class=\"\"><div> <span>Sam heard the deep, throaty cough, the gasping for air, and realized Celeste was choking. There was nothing he could do but panic as he was violently tossed back and forth as Celeste flailed about. Sam heard muffled screams from the other girl's and then the pounding which he identified as the Heimlich. And soon enough, the breathing became regular again. But the cucumber slice she was choking on came up so violently that as it slammed into Sam and flew out of Celeste's mouth, Sam flew with it, screaming the whole way as everything around him was a blur. He was just fortunate enough to have escaped. Soon, the cucumber slice landed across the cafeteria, and came to a stop on the floor. Sam brushed himself off, and looked around. He needed to find Mary, and hoped she was here. Sam began to look around but knew he needed a better view. He needed to climb. He climbed the nearest structure he could find. The climb was long and tough but soon Sam made it to the top. But to the top of what? Sam looked around to gain his bearings.<br>\r\n<br>\r\nWhere was Sam now?</span></div></div>",
            "created":1361509200,
            "id":1537401,
            "title":"Enjoying the Flight"
        },
        "12":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "She caved in and turned over Sam",
                "She left the bookstore without the books",
                "She called for management"
            ],
            "content":"<div class=\"\"><div> <span>It was Mary. \"I just know you'll get into some kind of trouble. Come with me.\" Mary picked up Sam and pressed him down in her cleavage, it was his favorite way of getting around. And together they headed to the campus bookstore. So did every other student, it seemed from the line. Mary hummed gently to herself as she picked out books that were on the schedules, occasionally checking on Sam. Who was getting some odd looks from some of the other students. They seemed to be confused by his presence and a little angry. Sam felt disturbed but paid them no mind as Mary got in line with a huge stack of books. Eventually it was their turn and Mary set down the books at the register and smiled at the student cashier who scanned the books in and added up the total. \"That'll be $798.72.\" She said. Mary opened up her purse and sorted through her cash, \"Oh dear. I seem to be twenty dollars short.\" Mary said with dismay. The cashier shrugged as if to say \"tough luck\", then noticed Sam tucked into the cleavage. It was the first time the cashier noticed him. \"I could overlook the twenty dollars in exchange for that tiny guy there?\" the cashier said. Mary was in shock, \"What no!\" The cashier responded, \"Then I guess you don't get your books.\" Mary looked defeated. She thought long and hard.<br>\r\n<br>\r\nWhat did Mary do next?</span></div></div>",
            "created":1361557380,
            "id":1537426,
            "title":"Second Thoughts"
        },
        "121":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Sam was to be an item for sale",
                "Caroline was going to use Sam as her assistant "
            ],
            "content":"<div class=\"\"><div> <span>Mary frowned deeply and apologized to Sam, \"I'm sorry Sammy, but I need these books.\" She plucked Sam from her cleavage and handed him over with the money. The cashier smiled as she put the money in the register, and put Sam in her shirt pocket. Sam watched as Mary left the book store, books in hand. He had never felt so betrayed before in his life. His girlfriend just traded him for textbooks. And now he belonged to the bookstore. The cashier admired the tiny guy, then proceed to stamp \"Property of the Bookstore\" across his chest in purple ink. The cashier, who had redish-blonde hair, icy blue eyes, and a soft young face. Sam guessed she was about 20. \"Well, little guy, you belong to the bookstore now. We needed a new stock boy.\" The cashier then took Sam over to a stack of books and told him to get to work shelving them. As the cashier, who's name tag read Caroline, turned away, she got an idea. She turned back around to see Sam struggle with the first book that was twice his size. She picked him back up and brought him to her face. \"I actually have another job you can do,\" she said with a fiendish smile.<br>\r\n<br>\r\nWhat did Caroline have planned?</span></div></div>",
            "created":1361558160,
            "id":1537433,
            "title":"Betrayal For Books"
        },
        "1212":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "She would keep Sam in her panties",
                "She would deal with Sam, at her lunch break"
            ],
            "content":"<div class=\"\"><div> <span>\"I think it'd be better if you worked for me,\" Caroline said as she picked Sam up and placed him in her work apron pocket. Sam was terrified as Caroline would periodically smile down at him. As she worked at the register, Sam tried to think of a way to escape. When Caroline was busy with a particularly big order, Sam began to climb out of the pocket, and with Caroline preoccupied, he slowly climbed down the apron strings and made it to the floor behind the counter. Just as he hit the floor, Caroline got up off the stool to put some books back and realized Sam was missing, she quickly found him and scooped him back up, \"Tsk, Tsk. Trying to escape, are we? That's no good.\" Caroline said as she held Sam up to her face. Sam tried to deny these charges but it was no use as she didn't listen. \"I guess I should punish you for your misbehavior. But how should I punish you?\" Caroline said to herself as she stared off in thought. Sam just hung there in front of her face, anxiously waiting his sentence. <br>\r\n<br>\r\nWhat did Caroline decide?</span></div></div>",
            "created":1362854040,
            "id":1546808,
            "title":"Working For Caroline"
        },
        "12122":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Caroline grabbed him again",
                "Caroline gave up and Sam could walk to another group"
            ],
            "content":"<div class=\"\"><div> <span>Caroline shoved Sam down into her cleavage and continued to work. She was going to have to deal with him when she got a break for lunch. About 2 hours later, the break came around and Caroline went to a nice shady spot on the campus green. She fished Sam out her her cleavage, just when Sam was starting to get comfortable between those two fleshy mounds he found himself staring Caroline right in the face. \"You misbehaved, and I've decided you're not worth the trouble of keeping around. So you're going to help me get through the day as nourishment.\" Sam screamed in disapproval but Caroline just chuckled as she brought her brown paper bag in front of her. She slowly opened it and pulled out a sandwich. Sam knew where this was going and tried to break free from her grasp. Sam then sunk his teeth into her hand, and Caroline dropped him in astonishment and screamed in pain. Sam was free and had to take advantage of the opportunity. The campus green was huge for him, but there were some groups nearby, enjoying the weather and eating between classes. Someone had to be nicer than Caroline. He began to run, knowing Caroline wouldn't let him escape too easily. But Sam began to tire out and his fear rose.<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1364489400,
            "id":1559346,
            "title":"Lunch Break"
        },
        "13":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "They were going to take turns keeping him",
                "They were going to keep him as a pet",
                "Sam was to be dinner"
            ],
            "content":"<div class=\"\"><div> <span>The door opened to reveal two silhouettes against the light, as they approached Sam, he could make them out better. The first woman was medium height, slender build, nice chest, short black hair and green eyes, she had a smile on her face and was obviously the leader as she reached down to shake Sam's hand. \"Hi! I'm Linda! I'm a 3rd year and live next door. Just wanted to stop by and introduce myself, I assume your apartment mate is out?\" Sam nodded, \"Yeah, she just left to pick up the text books. I'm Sam, and my apartment mate is Mary. We're first-years.\" Linda nodded, but didn't seem to be really listening. Sam's eyes moved over to the other student, who was still partly hiding behind Linda. \"Um. Who do you have with you, Linda?\" Sam asked as he gestured towards the other girl, his motion causing her to shy away. \"Oh,\" Linda replied, \"That's just my apartment mate.\" The other girl interrupted Linda stepping into the light for the first time, \"I'm Iris,\" she said in a soft tone. She was taller than Linda when she stood up straight, she was very lean, modest chest, long blond hair, and soft blue eyes. She obviously had some problems with social situations and seemed to feed off of Linda's extroverted nature. Iris was shy but she looked kind as she gave Sam a split second smile. \"Well, it was nice meeting you two.\" Sam said as he gestured toward the door. \"Oh. I don't think we're leaving yet,\" Linda said with a fierce look in her eyes. And before Sam could react he found him tossed in a bag and carried out of the apartment, a few minutes later he was dumped out of the bag and onto the carpeted floor of an apartment similar to his but he knew it was Linda's and Iris'. \"Why'd you kidnap me?! I demand you take me back right now!\" Sam yelled to his captors as they towered over him. Linda was still smiling, \"I don't think that's possible. When we heard there'd be a tiny on our floor we knew we just had to get him for ourselves.\" Iris nodded her head in agreement, still shy but Sam could feel her warming up towards him. \"We got big plans for you.\" Linda continued. \"Plans?\" Sam echoed.<br>\r\n<br>\r\nWhat plans?</span></div></div>",
            "created":1361561940,
            "id":1537457,
            "title":"Meet The Neighbors"
        },
        "132":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Make a run for it",
                "Get something to eat",
                "Go over to the girl's and accept his fate"
            ],
            "content":"<div class=\"\"><div> <span>\"We are going to keep you as our apartment pet.\" Linda said with great pride. Sam was in shock. \"You can't do that! I'm a person. Not a pet.\" Linda laughed at this statement. People aren't four inches tall. YOU'RE our pet, or you're dead. Understood?\" Sam was afraid now and meekly shook his head in acknowledgement. \"Great!,\" Linda continued, \"We just need to brand you, and then you'll be officially ours.\" Sam's eyes widened greatly, \"Br..Br..Brand me?\" he stammered. Iris nodded her head enthusiastically as Linda picked Sam up and carried him to the sink. Iris turned on the cold water and Linda gently ran Sam under the water to get him clean. Iris then took a small pole with a simple \"LI\" at the end and proceeded to heat it over a small open flame. Sam tried to squirm and break free, but Linda's grasp was too tight and his squirming only made it tighter. Iris took the pole which now grew red hot, and Linda held Sam still as Iris placed the pole against the bare flesh of Sam's side. Sam screamed in pain, Linda laughed, and Iris cringed, turned away and closed her eyes as the burning of skin resounded. Soon the branding was complete and the area was washed with cold water again. \"There we go!\" Linda said with a smile so wide. Tears flowed from Sam's eyes as he tried to get over the pain. \"Oh, cheer up.\" Linda retorted as she gently placed a small leather collar around Sam's neck, it fit snugly. \"He's so cute!\" Iris said to Linda. Linda agreed and set Sam down on the counter. \"Welcome to your new home, Sammy.\" Iris said in a sing-song voice as she gently patted his head. Linda and Iris then left Sam alone as they went into the living room to watch TV. Sam just sat huddled on the counter, still in pain, still in shock. But he knew he had to do something.<br>\r\n<br>\r\nWhat his is plan of action   </span></div></div>",
            "created":1361563020,
            "id":1537468,
            "title":"Kept On A Short Leash"
        },
        "14":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Sam would work the front desk",
                "Sam would have to tutor Betty's 18 yr old neice",
                "Betty would sell Sam to the highest bidder",
                "Betty would give Sam to the secretary instead of pay"
            ],
            "content":"<div class=\"\"><div> <span>Sam knew the voice instantly, it was his assigned guidance counselor, Betty. \"Hello, Sam. I see you got moved in alright. That's good.\" Betty said as she approached Sam, wearing a white blouse and black skirt. \"Um. Yes I have. I'm doing well. Thanks for checking in. See you later!\" Sam said trying to end the encounter. He always had an uneasy feeling around Betty, just something about her gave him a bad vibe. \"Not so fast, Sam. We have to go check your file.\" Betty said as she picked up Sam and carried him to the administration building. It was a long modern building, brick sides and sparse windows. Betty took Sam inside, said hello to the secretary and then went into her office, shutting the door behind her. She sat Sam down at the desk, and pulled out his file. \"Ah. Yes. I thought so. You applied for financial aid, but I just got a call saying the money never came through. So you technically haven't paid for college. That's a bit of problem, Sam. The college needs its money.\" Sam felt uneasy as Betty approached him with each sentence. \"I'm sure it'll be alright.\" Sam replied nervously. \"No it won't.\" Betty snapped back, \"We need that money. OR you get kicked out.\" Sam gulped at this sentence. Betty continued, \"There are some ways to make it up though.\" she said with a wink.<br>\r\n<br>\r\nWhat did Betty have in mind?</span></div></div>",
            "created":1361565840,
            "id":1537486,
            "title":"Checking the File"
        },
        "144":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "She was going to have him with lunch",
                "He was going to watch after her two daughters"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll just give you to the secretary and not pay her. That would take care of the extra money.\" Betty said with a flash of evil. And before Sam could object he found himself being given to the secretary, a 32 year old woman with dirty-blonde hair, and green eyes, she was medium height and looked good for her age. Betty placed Sam on the secretary's desk and said a simple \"Here you go.\" She left and went back to her office. The secretary looked confused but then was able to talk to Sam. \"So, uh, you're mine now I guess.\" Sam reluctantly nodded and simply just looked down at his feet pathetically. \"So, what are you going to do to me?\" The secretary, who's name was Tiffany, thought about this question long and hard. She never was in a position like this before but she knew she had to take advantage because she didn't know when the chance would come again. After a long while in thought, Tiffany looked Sam square in the eyes and said \"I know exactly what to do with you, little guy.\" A wide smile came across her face as she told Sam her plans..... </span></div></div>",
            "created":1361578080,
            "id":1537571,
            "title":"Sam, The New Currency"
        },
        "1442":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "It was late. Time for bed",
                "Sam wanted to learn more about Sue and Kim"
            ],
            "content":"<div class=\"\"><div> <span>Tiffany stowed Sam away in her purse, and continued to work until the day come to a close. Sam was trapped and just had to accept his fate now. He drifted into a slumber that was interrupted as he was tossed out onto a table. He rubbed his eyes and looked around to see two young faces staring in awe at him. Tiffany explained to the girls that Sam was going to look after them while she was at work and they were to respect and acknowledge him. Not to hurt him. The girl nodded and Tiffany smiled. She patted Sam on the head, obviously genuinely caring about him. Sam's focus then switched back to the girls who were still staring at him. The taller one spoke up first, \"I'm Sue.\" She appeared to be about 18, she was a senior in high school, tall, long red hair, and a good personality, obviously mature and responsible. Sam felt at ease around her. The other child gave Sam less comfortable feelings, she was reserved, and never introduced herself. Her long black hair cover most of her face, but Sam could feel her glare cut through him. \"And that is Kim.\" Sue added, \"We're so glad to have you around. We promise we won't be a hassle.\" She smiled and Sam realized, that this could work out. \"So, what do you want to do, Sam?\" Sue said cheerily.<br>\r\n<br>\r\nWhat was next?</span></div></div>",
            "created":1362251760,
            "id":1542395,
            "title":"Caretaker Sam"
        },
        "15":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Sam was to be the sorority pet",
                "He was to be the toy of the sorority president",
                "They would play some \"games\" with him",
                "He would be their slave"
            ],
            "content":"<div class=\"\"><div> <span>The door opened to reveal two female students, both blonde, one taller than the other. They both rapidly approached Sam, since he was the only thing in the apartment. The shorter one spoke first, \"Hi! My name's Valerie. We were looking for your roommate but she seems to be out.\" Sam nodded in agreement at this assumption. It seems the whole campus knew of the tiny guy who was allowed at the all girl's school. \"And I'm Jen,\" the taller one added, \"We're representing the largest sorority on campus, but since your roommate is out, I guess we'll be going.\" Sam acknowledged this and paid them little mind as they began to leave, when suddenly everything went dark. It seems Sam was ambushed and stuffed in one of the girl's purses. He was tossed around and pummeled with the many various items in the purse. A few hours later light returned as Sam was dumped out onto the table of the sorority, surrounded by a half dozen peering and curious eyes. A collective awe was drawn as they stared at him. Sam became scared, and tried to run, but didn't get far as a hand slammed down upon him. He was pinned and could do nothing as the girls talked about what to do with their new toy. Eventually a consensus was reached and as the verdict was passed down, Sam shuddered.<br>\r\n<br>\r\nWhat did the girls decide?</span></div></div>",
            "created":1362851160,
            "id":1546790,
            "title":"Sisterhood"
        },
        "151":{
            "author_id":"ncc-1701",
            "author_name":"T34/85",
            "choices":[
                "Pass him around ",
                "Feed him",
                "Play with him "
            ],
            "content":"<div class=\"\"><div> <span>“He’s so adorable Val!” Said a pale red headed girl who looked to be around 24. “How did you find him?” <br>\r\n<br>\r\n“Well” Valarie said, addressing all the girls. “I went to his roommate’s dorm to try and recruit her into our sorority but she wasn’t home. Instead, Jen and I found this little guy. I couldn’t resist and I snatched him while his back was turned and put him in my purse to show you guys”<br>\r\n<br>\r\n“He’s so precious!” Said another girl with long straight black hair of Asian decent. “Can we keep him?!” <br>\r\n<br>\r\nSam was shocked at what he was hearing. He didn’t want to be a pet. He was a student and a human being.<br>\r\n<br>\r\n“Please?” Said a brunette girl with brown eyes. “I just want to cuddle him all day!”<br>\r\n<br>\r\n“Now hold on” said Valerie. “Let’s put this to a vote. All in favor of keeping Sam as our pet say Aye”<br>\r\n<br>\r\nSam held his breath hoping that they would let him go.<br>\r\n<br>\r\n“AYE!” all the girls shouted at once.<br>\r\n<br>\r\n“Hey!” Sam shouted. “Don’t I get a say in this? I’m not going to be your pet!”<br>\r\n<br>\r\nSuddenly, Valarie plucked Sam off the table with her fingers and placed him on her open palm. All the girls surrounded them and all Sam could see was their smiling faces.<br>\r\n<br>\r\n“Little boys like you don’t get to make decisions” Valarie Said in a babying tone. <br>\r\n<br>\r\n“That’s right you need big people to make decisions for you.” Added the red headed girl. “And who better than lovely ladies like us huh?” <br>\r\n<br>\r\n“Don’t worry Sam, we will take good care of you” said Valarie as one of the other girls started stroking you with their finger. “You’re going to be our new mascot and pet”<br>\r\n<br>\r\nAll the girls squealed in excitement after hearing this. <br>\r\n<br>\r\n“What should we do with him first?” Asked the Asian girl<br>\r\n<br>\r\n“Well..” Valarie starts.<br>\r\n</span></div></div>",
            "created":1590108480,
            "id":2839311,
            "title":"Sam was to be the sorority pet"
        },
        "1511":{
            "author_id":"ncc-1701",
            "author_name":"T34/85",
            "choices":[
                "The girls take him to get pet supplies ",
                "There’s a knock on the door ",
                "The girls show him around the house "
            ],
            "content":"<div class=\"\"><div> <span>“We should probably introduce him to all his new owners shouldn’t we?” Valarie said with a smile.<br>\r\n<br>\r\n“Oh can I hold him first?” The curvy brunette girl exclaimed. <br>\r\n<br>\r\n“Sure” Valarie said gently sliding you onto the girl’s open palm. “Just be careful with him.” <br>\r\n<br>\r\n“Oh I will” she said in a bubbly voice before turning her attention to you. The girl lifted you up to her pale, soft face. <br>\r\n<br>\r\n“H-hello” Sam says nervously. “I’m Sam, please don’t hurt me.”<br>\r\n<br>\r\n“Well hello there cutie. My name is Pamala, but everyone calls me Pam” the girl said smiling at you. <br>\r\n<br>\r\nSam just stared up at her shaking in fear. <br>\r\n<br>\r\n“Awww, don’t worry I won’t hurt you” Pam says softly stroking your head. “I would never hurt anything as precious as you. None of us would right girls”<br>\r\n<br>\r\nSam look around and saw all the girls nodding in agreement with their eyes glued to you.<br>\r\n<br>\r\n“Let me hold him” shouted the Asian girl.<br>\r\n<br>\r\nBefore Sam could protest he was plucked off Pam’s hand and placed on the palm of the Asian beauty. <br>\r\n<br>\r\n“I’m Mia!” She said with excitement. “I’m so glad Valarie caught you. I just want to cuddle you all day!” <br>\r\n<br>\r\nWith that she smooshed Sam up against her cheek and softly rubbed him up and down. Sam felt really embarrassed being treated this way even though he knew he was in no real danger. He still wanted to be treated like a grown man in college. <br>\r\n<br>\r\n“My turn!” Shouted the red headed girl. <br>\r\n<br>\r\nMia looked disappointed as she pulled Sam away from her cheek but nonetheless gave him to her.<br>\r\n<br>\r\n“And I’m Emily” she said cupping you in her hands. “Don’t worry little man, you’ll get used to being a pet. You wouldn’t survive long without us anyway. Now how about giving mommy a kiss?” <br>\r\n<br>\r\nBefore Sam could react with the indignation he felt, he was brought to Emily’s puckered lips and kissed rapidly multiple times. The other girls giggled as Sam laid there helplessly knowing there was nothing he could do to stop the bombardment of kisses. <br>\r\n<br>\r\n“Okay that’s enough Emily!” Jen said snatching you away. “You’ll smother him” she said gently petting you. <br>\r\n<br>\r\nSam was red in the face feeling more embarrassed than he ever had in his life. All the girls did was smile down at him and go “awwww” at his obvious sense of embarrassment, each one taking turns at stroking him while he sad in Jen’s palm.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1590112020,
            "id":2839339,
            "title":"Introductions "
        }
    },
    "info":{
        "author_id":"samiam123",
        "author_name":"Ashley",
        "brief_description":"Trying to survive college at 4 inches tall is tough. Please add. ",
        "created":1361474760,
        "description":"<td align=\"left\" class=\"norm\">Sam Williams' life has just gone from bad to worse. The good news is, he got into Diminutive State. The bad news was he was only four inches tall. He had been this way since puberty. It was only by exception was Sam allowed to attend the all-girl's school. And not every girl would be kind towards a powerless guy. His girlfriend, Mary had also been accepted, they had been going out for three years and he felt safe around her. However, would Mary be enough to keep Sam alive?<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. Only one male. Sam<br>\r\n2. Only one tiny. Sam. Though others can be referenced, they can't be actual characters. <br>\r\n3. Posts will be written in third person. (Sam did... She did... they did.... etc.)<br>\r\n4. Any death is allowed, though vore is preferred. If Sam is eaten with food, he's the meat.<br>\r\n5. New characters are allowed, just be descriptive. Only female. Regular sized. Age from 18-35. <br>\r\n6. At least five good sentence per addition.<br>\r\n7. After a death, there is a chance Sam can reform as a result of the shrinking. The reformation takes a day.<br>\r\n8. I reserve the right to change or delete any chapter I deem violates these rules.<br>\r\n<br>\r\n9. Please have fun and enjoy it!<br>\r\n<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\nSam Williams: An 18 year old, four inch tall male with brown hair and blue eyes. A first year student at Diminutive State, he will be rooming with is girlfriend in an on campus apartment.<br>\r\n<br>\r\nMary Douglas: A 19 year old red-head with green eyes, and a nice body, with D cup breasts. She has a very protective nature and would never think of harming Sam knowingly, though she has been known to have mood swings, one time tossing Sam across the room. Could be dangerous if caught in the wrong mood.<br>\r\n<br>\r\nBetty Davis: The 25 year old guidance counselor. She has been personally assigned to Sam and will keep an eye on him. Though behind the blond haired, green eyed exterior could lie a dangerous predator.<br>\r\n<br>\r\nKelly Michael: The 21 year old student body president. She acts like she owns the campus, and will do as she pleases. A very cruel and merciless woman.<br>\r\n<br>\r\nCathy Wallace: A bubbly personality wrapped in a brown haired exterior. She seems gentle enough but is incredibly unpredictable. She is the RA for the building and no one knows exactly what to expect from her.<br>\r\n<br>\r\n<br>\r\nFeel free to add more characters during the story. I will as well. Please enjoy. Tell me what I can do to improve and please add.</td>",
        "id":1920638,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1590112020,
        "modified":1590112020,
        "pretty_title":"Tiny U"
    }
}