{
    "chapters":{
        "1":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "...a female student he would soon become\"acquainted\" with.",
                "...one of the female foreigners attending the school.",
                "...Barbara Jacobs, the vice principal. :O",
                "...a female non-student. (Uh oh)"
            ],
            "content":"<div class=\"\"><div> <span>As the Sun peeked its head over the tops of the mountains, Jesse woke to the sound of his alarm.  Sporting plaid pajamas and a messy bed head, he aroused himself from his bed.  Today was his first day at Cynthia Jacobs Secondary School and he did not want to be late.<br>\r\n<br>\r\nAs long as he could remember, Jesse Cartier had five main attributes: friendly, mnemonic, naïve, timid, and cute.  Each of these traits stick with him to this day.  Jesse stood at a good height for his age, about five feet seven inches.  His short, layered, black hair and light blue eyes were the highlights of his boyish appearance, as many of the girls he shied away from acknowledged.  The only thing that stood out more than his face was his feet, much to his chagrin.  At Jesse's height, they were quite big.  Wearing size 13 shoes, the fifteen year old boy's feet stood out from his pale, slender body.  Oddly enough, these large appendages never took any points off the cuteness factor.  Another interesting note was that Jesse's mother Tessa was experienced in pedicures.  As a result, she took the liberty of keeping her son and daughter's feet perfectly groomed, thus making them nice and soft.<br>\r\n<br>\r\nAfter his shower, Jesse went down to the kitchen table for breakfast.  He was dressed in a red T-shirt with black trimming, dark blue denim pants and his lucky blue pebble tied around his neck.  Because his mother never bought him or his sister socks, he never wore them and today was no different.  However, that never bothered him even though he was a bit perplexed at why almost everyone else wore socks with their shoes and not his family.<br>\r\n<br>\r\nJesse sat down to his favorite breakfast: flapjacks, bacon, toast with Camembert, strawberries and Spam with a glass of orange juice.  He was later joined by his sister Melody; his Irish twin of about eight months.  Before sitting at the table, she snuck up behind her brother and gave his right foot a quick scribble with her fingers, forcing a loud giggle out of him.  Melody knew her brother had a love/hate attitude towards tickling but they both knew it was just her friendly way of saying \"good morning\".<br>\r\n<br>\r\n\"I hear this place is really big,\" said Jesse.<br>\r\n<br>\r\n\"It is.  The picture shows just how awesome it looks,\" replied Melody, \"I don't know why all schools can't look like Cynthia Jacobs.\"<br>\r\n<br>\r\nMelody passed Jesse the article about the school.  While eating his syrup drenched flapjacks, he read all about his new place of learning.  On the second page, he realized why Melody was so happy about this place.  She was referring more to the recreational facilities than she was to the size of the complex.  Jesse went wide-eyed at the detailed descriptions of the indoor swimming pool, library, fitness centre, the mess hall (which was more like a high class lounge), the Pizza Hut in the cafeteria and the chocolatier set up near the campus.  Jesse then saw the reason why Melody bargained and begged their mother into letting them go to Cynthia Jacobs Secondary.<br>\r\n<br>\r\nContaining his excitement, Jesse said, \"For a school that had its grand opening yesterday, it sure is making a name for itself rather quickly.  It even says there's going to be a lot of students coming from out of town just to go there.\"<br>\r\n<br>\r\n\"Like us, for example,\" added Melody.<br>\r\n<br>\r\n\"They say the government funded for this school's creation so that Lillooet becomes a city,\" said Tessa setting her own plate on the table.  \"Though some people say this new school is an indignant display of the Jacobs' family's wealth, I think that, without fear of contradiction, the kids benefit the most.  Before Cynthia Jacobs, students excelled in \"Hookey\" more than anything.\"<br>\r\n<br>\r\nUpon hearing her mother talking about Hookey, she quickly ate a piece of Spam. \"Yeah... I can't stand those people either, Mom.\" she said laughing weakly.<br>\r\n<br>\r\nOnce breakfast was over, the two teens brushed their teeth and got ready for the bus.  After Jesse put on his unisex slip ons and Melody put on her sneakers, they both decided to wait outside for the bus while the breeze was still blowing.  Two minutes before the bus came, Tessa gave them both some money to buy their lunch on their first day.<br>\r\n<br>\r\n\"I hope you two enjoy your new school.  I'm sure you'll make some new friends out there, Jesse.  Melody, try not to get your new jeans dirty this time.\"<br>\r\n<br>\r\n\"Yes, Mom,\" they unanimously replied.<br>\r\n<br>\r\n\"Have a good day, kids.\"  And with that, Tessa hugged her children and went back inside.  Afterwards, the orange sunlight glow of the school bus peeked from around the corner.<br>\r\n<br>\r\nThe Cartiers arrived at their school.  Upon walking past the big arch, they were even more amazed seeing the school up close than in the photographs.  However, their moment of awe was interrupted when an anonymous student accidentally stepped on the back of one of Jesse's slip on shoes, causing him to \"slip out\" and fall face down on the pathway.  Some had a cheap laugh at his expense, others didn't.  Melody was one of them; and she also helped him up.  In silence, Jesse put his shoe back on and kept walking towards the main entrance.  He sincerely hoped that that single embarrassing moment didn't come back to bite him in the ass.<br>\r\n<br>\r\nUnbeknownst to him, Jesse's minor \"slip up\" attracted more attention that he would have liked.  The moment his foot came out of his shoe and his velvety pink sole was exposed, things were set in motion.  Never would things be the same for him after that.  The one to cause those \"changes\" was...</span></div></div>",
            "created":1268197200,
            "id":849103,
            "title":"First day of school"
        },
        "11":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Maria",
                "Cathy",
                "Dana",
                "Victoria",
                "It wasn't any from this lot."
            ],
            "content":"<div class=\"\"><div> <span><b><u>Maria Stone</u></b> <br>\r\n<b>Birthplace:</b> Lillooet, British Columbia, Canada<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'6\"<br>\r\n<b>Eyes:</b> Brown<br>\r\n<b>Hair:</b> Brown, Long (straight)<br>\r\n<b>Shoe size:</b> 7.5<br>\r\n<b>Persona:</b> A rather intelligent girl, though she has a penchant for acting like the smartest girl in the room.<br>\r\n<br>\r\n<b><u>Cathy Simmons-Smith</u></b><br>\r\n<b>Birthplace:</b> Penticton, British Columbia, Canada<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'5\"<br>\r\n<b>Eyes:</b> Blue<br>\r\n<b>Hair:</b> Blond, shoulder length (straight)<br>\r\n<b>Shoe size:</b> 7<br>\r\n<b>Persona:</b> An inquisitive, outgoing girl with a Tyrannosaurus sized sweet tooth.<br>\r\n<br>\r\n<b><u>Dana Gaudreau</u></b><br>\r\n<b>Birthplace:</b> Trois-Rivières, Quebec, Canada<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 9<br>\r\n<b>Height:</b> 5'7\"<br>\r\n<b>Eyes:</b> Green<br>\r\n<b>Hair:</b> Brown, shoulder length (straight), has a red hair pin on the left side<br>\r\n<b>Shoe size:</b> 7.5<br>\r\n<b>Persona:</b> An energetic human being that believes friends should come before herself.<br>\r\n<br>\r\n<b><u>Victoria \"Vic\" Wallace</u></b><br>\r\n<b>Birthplace:</b> Kamloops, British Columbia, Canada<br>\r\n<b>Age:</b> 16<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'8\"<br>\r\n<b>Eyes:</b> Blue<br>\r\n<b>Hair:</b> Black, long (straight), tied in a ponytail<br>\r\n<b>Shoe size:</b> 9<br>\r\n<b>Persona:</b> A true tomboy who is always uneasy around those of her own gender, but always at home with the opposite.</span></div></div>",
            "created":1269147600,
            "id":854748,
            "title":"It's fun to make friends."
        },
        "111":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "Maria does the test again",
                "Jesse begs her to stop"
            ],
            "content":"<div class=\"\"><div> <span>Maria Stone had been sitting on a bench near the school's entrance, reading book, when she saw Jesse's stumble and catch a glimpse of his sole. It was maybe a few seconds, a quick flash of pink, before the boy was helped up by his sister and quickly slipped his foot back into his sneaker. <br>\r\n<br>\r\nMaria adjusted her round glasses atop the bridge of her nose and stood up, the book in her hands forgotten. <i>Gorgeous</i> She thought, heart hammering. The emotionless exterior she radiated as she collected her things and followed that boy, as though an invisible cord had attached herself to those pink, soft looking feet, was at odds with the riot of lust in her mind.<br>\r\n<br>\r\nFor as long as Maria could remember, she had been fascinated by boy feet. It was her one vice and most of the time, she kept it buried down by studying hard in school and always learning something new. But today, the sudden glimpse of the dark haired boy's foot shot that vice back up like a thunderhead, setting her body on fire in an instant. As she weaved through the cluster of shouting students, she kept her eyes fastened to Jesse's skinny frame, trying to picture him without his shoes or socks. <br>\r\n<br>\r\nThey ended up having science together as the first class. Maria typically went for the back of the class, but today she sat near the middle because that was where Jesse was sitting. The fifteen year old boy was slouched in his seat, one leg crossed over his lap, and fighting back a yawn. <br>\r\n<br>\r\n\"Hello class,\" said their teacher, a man in a white sweater with the body shape of a basketball. \"Today we will be going over some biology. In particular these health and safety tests. I want everyone to group in pairs and choose one test to practice to each other.\"<br>\r\n<br>\r\nThe class quickly exploded into frantic motion as friends latched onto friends. Jesse was frozen in indecision. He hadnt met anyone yet and was too shy to approach any strangers. <br>\r\n<br>\r\nThe perfect opportunity for Maria to snatch her prey. <br>\r\n<br>\r\n\"Hi,\" she introduced herself. \"It seems neither of us know anyone here. Want to be partners?\"<br>\r\n<br>\r\n\"Ok,\" said Jesse, relieved. \"Which test do you want to do?\"<br>\r\n<br>\r\n\"How about the babinski test?\" Maria suggested, watching his face closely for a reaction. <br>\r\n<br>\r\nBefore Jesse can say no or think or a plausible excuse, the new girl is taking one of his shoes in both hands and pulling his leg outwards into her lap. She grasps the heel of his sneaker possessively and yanks it off, exposing Jesse's bare foot. <br>\r\n<br>\r\n\"No socks?\" Maria asks, causing Jesse's ears to get hot with embarrasment. <br>\r\n<br>\r\n\"It's just a preference I have...\" Jesse trails off awkardly. He really wants to pull his bare foot out of Marias lap but doesnt know how to tell her. <br>\r\n<br>\r\nInstead, she casually wiggles his middle toe between two fingers. \"Well I guess this makes the babinski test more effective right?\" The fingers travel down the underside of his toes lightly, and Jesse's leg jerks a little in response; he has to clamp both hands to his mouth to stop from giggling. \"Yknow because without socks, people are alot more sensitive.\"<br>\r\n<br>\r\nJesse fights down his giggles, though he cant stop staring at her fingers which just barely stroke his oval shaped toes. A few people are watching curiously as squeaks pop out of the ticklish boy's mouth. <br>\r\n<br>\r\nMaria pretends to be oblivious to all this. She feels Jesse try and pull his foot away but she grips his ankle roughly with her other hand. Mine, she thinks. <br>\r\n<br>\r\n\"Now then,\" She says. \"Lets begin.\" Her fingers suddenyl skitter across Jesse's soft sole, and Jesse barks out a girlish scream, the chair skittering as he tries to break loose. Maria is implacable, and runs her fingers down from his toes across his arch to his heel. <br>\r\n</span></div></div>",
            "created":1573173240,
            "id":2743680,
            "title":"Maria"
        },
        "112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "You want to come over to my house?",
                "Do you...Like feet?",
                "Want to come to the ice cream parlor with me?"
            ],
            "content":"<div class=\"\"><div> <span>Cathy was intrigued by Jessie's bare foot, but would not see him again until lunch.<br>\r\n<br>\r\nCathy was by herself eating an enormous chocolate sundae when Jessie suddenly sat right next to her.<br>\r\n<br>\r\n\"Hey.\" Jessie said bashfully as he put his lunch tray down.<br>\r\n<br>\r\n\"Hey.\" Cathy said, looking at his lunch tray, she always took notice of what people eat because she believed you could learn a lot about people by what they ate.<br>\r\n<br>\r\n\"You like pizza?\" Cathy asked <br>\r\n<br>\r\n\"Yeah.\" Jessie said timidly \"It's really great there is a Pizza Hut in the cafeteria.\"<br>\r\n<br>\r\nWhat does Cathy say next?  </span></div></div>",
            "created":1336329000,
            "id":1330778,
            "title":"Sugar Surprise"
        },
        "114":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "At Lunch",
                "At the end of school",
                "During P.E."
            ],
            "content":"<div class=\"\"><div> <span>Victoria 'Vic' Wallace was one of those girls who had seen Jessie's bare foot.<br>\r\n<br>\r\nVic was a bit of an odd girl, she hated dresses, cosmetics, deodorant and all those other 'girly' things. She much rather would hang out with the boys and play sports.<br>\r\n<br>\r\nShe also had a secret, she liked feet, boy's feet specifically. When she saw Jessie's bare sole it felt like she had fallen in love for the first time.<br>\r\n<br>\r\nBut how did she even get around to getting at those feet? She was such a tomboy that the idea of admitting feeling of love made her want to cry.<br>\r\n<br>\r\n\"Maybe I can just be friends with him.\" She murmured to herself, just ask him if he wants to play darts or basketball or some junk like that.<br>\r\n<br>\r\n<br>\r\nWhen does she next meet Jessie? </span></div></div>",
            "created":1336284240,
            "id":1330537,
            "title":"The Tomboy"
        },
        "115":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Lilli",
                "Sarah",
                "Keep moving, junior."
            ],
            "content":"<div class=\"\"><div> <span><b><u>Lilli Galvin</u></b><br>\r\n<b>Birthplace:</b> Nanaimo, Vancouver Island, British Columbia, Canada<br>\r\n<b>Age:</b> 14<br>\r\n<b>Grade:</b> 9<br>\r\n<b>Height:</b> 5'5\"<br>\r\n<b>Eyes:</b> Hazel, wears glasses<br>\r\n<b>Hair:</b> Brown, over the shoulder (straight), tied in French braided pigtails<br>\r\n<b>Shoe size:</b> 5<br>\r\n<b>Persona:</b> A very humble and bashful girl that comes from a rich family.  However, if given the chance, she can show a passionate side she would otherwise not know about.<br>\r\n<br>\r\n<b><u>Sarah Peachtree</u></b><br>\r\n<b>Birthplace:</b> Prince Rupert, British Columbia, Canada<br>\r\n<b>Age:</b> 16<br>\r\n<b>Grade:</b> 11<br>\r\n<b>Height:</b> 5'6\"<br>\r\n<b>Eyes:</b> Green<br>\r\n<b>Hair:</b> Auburn (dyed a peachy color to fit her namesake), bob cut (straight)<br>\r\n<b>Shoe size:</b> 6<br>\r\n<b>Persona:</b> Though she looks like a cheerful person, it is only a mask to hide her sorrow and loneliness. </span></div></div>",
            "created":1270702800,
            "id":864463,
            "title":"The Mouse and the Peach"
        },
        "1151":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "Lilli decides to invite an unsuspecting Jessie over to her house",
                "Lilli tries to befriend Melody to get closer to Jessie and his feet",
                "Lilli bides her time for now and come up with a plan at her home"
            ],
            "content":"<div class=\"\"><div> <span>After his embarrassing \"slip-up\", Jessie had hoped that everyone would forget about it later in the day. For the most part, he was right, everyone did forget about Jesse tripping and losing his shoe. Everyone except a young grade nine girl; and this girl happened to be the one who tripped him and got the best view of Jesse's sole. This girl was Lilli Galvin, the only daughter of Kimberly Galvin; one of Canada’s most successful and ruthless business people, and owner of the nationwide chain of restaurants called “Galvins”.  Because of her mother’s success, Lilli was very rich. In fact, this is the first time she had ever been to a school due to being homeschooled by the best teachers money could buy. When her fourteenth birthday came however, her mother decided to enroll her in a public school so Lilli could acquire the proper skills for interacting with people…as well as having Lilli get over her shyness. <br>\r\n<br>\r\nDressed in a blue blouse with a long skirt, white knee high stockings and black heels to match and her beautiful brown hair styled in French braided pigtails, the hazel eyed, glasses wearing Lilli looked the epitome of cuteness and innocence and her shy and bashful attitude only added to that statement.  However, no one, not even Lilli herself would guess that deep down inside her; there was a lustful passionate side of her that seemed to surface when she saw a pair of beautiful feet, and the most beautiful foot she had ever seen was mere inches from her face. It had taken all of her will power not to grab the unknown boy’s foot and rub it against her face.  In fact, the image of the boy’s foot had been stuck in her mind for the entire first period. <br>\r\n<br>\r\nShe had hoped that she would forget it in her next period Advance Chemistry.  Although it was a grade ten class, Lilli had already taken the equivalent of Advance Physics while she was being homeschooled, so the school decided to have her take some grade ten classes instead.  Unfortunately, it seemed that fate had other plans for Lilli. For when Lilli took her seat, she saw the cute boy with the flawless feet take a seat in the row in front of her.  Also, a girl who had looked just as cute as the aforementioned boy took a seat next to him, causing Lilli’s face to blush as red as a tomato.  The boy and the girl chatted for a bit until the teacher then requested the students' attention and took roll call.  When the name Jesse Cartier came up, the boy answered, “Here”. <br>\r\n<br>\r\n<i>“So…that’s his name.  Such a lovely name, especially for a boy of his looks and feet,”</i> Lilli thought, still blushing. <br>\r\n<br>\r\nThen the name Melody Cartier had come up and the girl responded “Here”. <br>\r\n<br>\r\n<i>“So…they are brother and sister.  I wonder if she has feet as pretty as he does…Oh dear did I just think that?!”</i> Lilli thought, now blushing harder than ever. <br>\r\n<br>\r\n“Lilli Galvin,” the teacher said, with his eyes still looking on the clipboard. <br>\r\n<br>\r\n“He-Here,” Lilli meekly responded.  A few minutes later, the teacher was finally done with roll call and started his lecture.  But Lilli wasn’t able to pay attention, as she noticed Jesse starting to play with his feet and taking off his slippers in an attempt to get comfortable. Once again, with a great view of Jesse’s feet Lilli began to formulate a plan.  <br>\r\n<br>\r\n<i>“Oh my…those feet.  I must have them…but how am I going to get them?”</i> Lilli thought as she continued watching Jesse’s feet.</span></div></div>",
            "created":1293512400,
            "id":1023871,
            "title":"The Lilli of the Galvin Family"
        },
        "11511":{
            "author_id":"cronman",
            "author_name":"BreaktheWalls",
            "choices":[
                "\"Sure I'll be able to come Lilli\"",
                "\"Sorry Lilli, but I don't think I can make it today\""
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes of intense internal debate, Lilli decided to throw caution to the wind and invite the cute boy and possibly his cute sister as well, over to her house. <i>“Hopefully he would be easy to find at lunch. Maybe I can even convince his sister to come, I bet she would also have pretty feet,” </i>Lilli thought, as she tried her hardest to listen to the boring teacher’s lecturing about the course syllabus and not focus on the Jessie’s feet. So far it had been a difficult task. Somehow, Lilli managed to have the willpower to pull it off as the class ended after what felt like an eternity and the teacher assigned them their homework, which was to type at least three pages on the history of Chemistry…with APA format and foot notes! Lilli sighed to herself as she began to pick up her things and depart for her next class, thinking of how she will go about to invite Jesse to her house.<br>\r\n<br>\r\nLilli could barely concentrate in her classes, as she was still nervous going about her invitation to the Cartier siblings.  It was finally her last class before lunch and as soon it was over, she packed up her things and almost bolted out of the door. Lilli then went towards the lunch area looking for the Jesse and Melody. <i>“Oh my…this is a huge cafeteria! I hope I can find those two before lunch hour ends,”</i> the mousey girl opined, as she began her search. Lilli was so into her search that she didn’t even stop to eat, in fear that if she did, she might not have enough time to find the two.  After many minutes of searching, Lilli finally found the two sitting at a table together.  <i>“Okay Lilli…this is it, don’t be nervous or shy right now. You have to do this, you put too much time to chicken out,” </i>Lilli thought, as she took a big breath and went over to the duo. <br>\r\n<br>\r\nThe two were having a friendly about what they thought of the new school, as Lilli walked up and sat down across from them. The siblings noticed the braided hair girl and paused their conversation, setting their eyes on her. “Um hello…excuse me I…I don’t mean to interrupt it’s just that…I…I came to apologize,” Lilli stuttered in her soft voice, barely able to prevent herself from looking down as she blushed a deep shade of red.<br>\r\n<br>\r\nThe siblings looked at each other confused. “Apologize? With all due respect what do you need to apologize for, since I don’t believe we’ve ever met,” Jessie stated, now looking at Lilli puzzled.<br>\r\n<br>\r\nThis caused Lilli’s face to glow redder. “Well…I…I accidentally tripped you earlier this morning an…and you got up and walked away before I got the chance to say sorry,” she explained.<br>\r\n<br>\r\nJesse’s puzzled look turned into a cute smile. “Oh, that’s alright, most people forgot about it anyways. Apology accepted,” he said then offering his hand. “How about we introduce ourselves properly, I’m Jessie Cartier.”<br>\r\n<br>\r\n“And I’m Jessie’s sister, Melody,” Melody piped, smiling at Lilli and then offered her hand.<br>\r\n<br>\r\nLilli’s blushed at the boy’s cute smile, causing Lilli to blush even redder.  She couldn’t help but think that this young man was the boy of her dreams. She then took his hand, which was extremely soft for a boy’s. <i>“Oh…his hands are soft…I have a feeling that his feet will be just as soft,”</i> she mused, before introducing herself and shaking Melody’s hand. “It is nice to meet you two, I’m Lilli Galvin.”<br>\r\n<br>\r\n“That name does sound familiar, aren’t you in our Chemistry class?” Melody asked, curious.<br>\r\n<br>\r\nLilli nodded. “I am…and I also tried to apologize you there Jessie but the teacher started his lecture and I never got the chance to,” Lilli answered.<br>\r\n<br>\r\n“Ugh, the teacher, I can’t believe he assigned that ridiculous assignment on day one! I mean I don’t mind home work but a report with foot notes and APA format that’s due in two days! Doesn’t help that he’s pretty boring” Melody complained, sighing. “Well, I guess I might have a candidate for new least favorite teacher,” she joked, causing Jessie to chuckle.<br>\r\n<br>\r\n“Oh come on, Melody, it’s the first day, he can’t be that bad,” Jessie said, chuckling a bit.<br>\r\n<br>\r\nLilli widened her eyes for a few seconds, then blushed. <i>“Now’s my chance…this is the perfect time to invite them,”</i> Lilli thought. “Well…I was wondering…maybe we can work on this project together at my house after school, if it’s okay with you that is,” Lilli asked bashfully.<br>\r\n<br>\r\nMelody smiled and looked like she was about to say yes then suddenly frowned. “Oh danm it! I would accept Lilli but soccer try-outs are hold after school and I won’t be done until later tonight,” Melody explained in a regretful tone, frowning. “Sorry I can’t come.”<br>\r\n<br>\r\nLilli blushed even harder. Although it was unfortunate that Melody won’t be able to come, this also meant that she got to have Jessie alone. “Wh…what about you Jessie, will you be able to come?” the glasses girl offered.<br>\r\n<br>\r\nJesse took a second to think before responding with…<br>\r\n</span></div></div>",
            "created":1328044920,
            "id":1268942,
            "title":"A Polite and Bashful Invitation"
        },
        "1153":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Julie",
                "Sylvia",
                "Again, keep moving."
            ],
            "content":"<div class=\"\"><div> <span><u><b>Julie Townsend</b></u><br>\r\n<b>Birthplace:</b> Vancouver, British Columbia, Canada<br>\r\n<b>Age:</b> 17<br>\r\n<b>Grade:</b> 12<br>\r\n<b>Height:</b> 5'6''<br>\r\n<b>Eyes:</b> Green-grey<br>\r\n<b>Hair:</b> Dark brown (with blond highlights), over the shoulder (straight)<br>\r\n<b>Shoe size:</b> 7<br>\r\n<b>Persona:</b> A pretty yet enigmatic individual, Julie is a girl of few words and few friends.  This does not mean she is unfriendly to others, but the only one who knows about her is herself.  Actually, we know she has a foot fetish but only she knows that, technically speaking.<br>\r\n<br>\r\n<u><b>Sylvia Lemorande</b></u><br>\r\n<b>Birthplace:</b> Toronto, Ontario, Canada<br>\r\n<b>Age:</b> 16<br>\r\n<b>Grade:</b> 11<br>\r\n<b>Height:</b> 5'7\"<br>\r\n<b>Eyes:</b> Green<br>\r\n<b>Hair:</b> Golden blond, shoulder length (straight), worn in ringlets<br>\r\n<b>Shoe size:</b> 8<br>\r\n<b>Persona:</b> A girl who had recently arrived from Toronto to attend Cynthia Jacobs Secondary, Sylvia struggles with a reputation typically assigned to anyone from her home city.  Many people tell claim she is the centre of the universe simply because of her origins, and the fact she comes from a wealthy family doesn't help her case.  The truth is this misunderstood teenager is nothing like the others back home and the theory is someone more understanding will see that.</span></div></div>",
            "created":1333952820,
            "id":1311943,
            "title":"The well known and the unknown"
        },
        "12":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Dominique",
                "Francisca",
                "Anne",
                "Cäcilia",
                "Any other \"imports\"?"
            ],
            "content":"<div class=\"\"><div> <span><u><b>Dominique Benoit</b></u><br>\r\n<b>Birthplace:</b> Bordeaux, Aquitaine, France<br>\r\n<b>Age:</b> 16<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'6\"<br>\r\n<b>Eyes:</b> Blue<br>\r\n<b>Hair:</b> Brown, shoulder length (straight)<br>\r\n<b>Shoe size:</b> 7<br>\r\n<b>Persona:</b> A cheerful, fun loving gal; a day with Dominique is never dull.  But be warned, she's a real tickle monster.  Dom has also developed this smart-ass trait of sniffing her armpits when around others due to bust a certain preconceived notion about French people.   <br>\r\n<br>\r\n<u><b>Francisca Rosa Portillo</b></u><br>\r\n<b>Birthplace:</b> Zaragoza, Aragon, Spain<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 11<br>\r\n<b>Height:</b> 5'4\"<br>\r\n<b>Eyes:</b> Brown<br>\r\n<b>Hair:</b> Dark brown, over the shoulder (straight), tied back<br>\r\n<b>Shoe size:</b> 6<br>\r\n<b>Persona:</b> Ever the studious student, Francisca always has her nose in the books.  Unfortunately, this makes people think of her as a complete stick in the mud and avoid her.  Francisca can be fun company, she only needs the opportunity.<br>\r\n<br>\r\n<u><b>Anne Sproxton</b></u><br>\r\n<b>Birthplace:</b> Colchester, Essex, England, UK<br>\r\n<b>Age:</b> 14<br>\r\n<b>Grade:</b> 9<br>\r\n<b>Height:</b> 5'5\"<br>\r\n<b>Eyes:</b> Green<br>\r\n<b>Hair:</b> Bleached blond, short cropped (straight)<br>\r\n<b>Shoe size:</b> 7<br>\r\n<b>Persona:</b> A very beautiful and intelligent girl who dreams of becoming a foot model.  Her favorite course is English, even though she can't speak it.  The reason being she cannot speak at all.  Anne is a mute.  But this year, she feels that her \"quiet days\" will come to an end; and when they do, she will be grateful...<br>\r\n<br>\r\n<u><b>Cäcilia \"Maulwürfe\" Hermann</b></u><br>\r\n<b>Birthplace:</b> Vaduz, Liechtenstein<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'4\"<br>\r\n<b>Eyes:</b> Pastel blue (blind)<br>\r\n<b>Hair:</b> Golden blond, long (straight), tied in a braided ponytail<br>\r\n<b>Shoe size:</b> 6<br>\r\n<b>Persona:</b> Cäcilia comes from a family loyal to the princes of Liechtenstein since the state was formed.  Though blinded by an accident a few years back, Cäcilia shrugs off any dependencies with a brave smile.  She is also a karate expert despite her blindness; hence her nickname \"Maulwürfe\" (The Mole).</span></div></div>",
            "created":1276405200,
            "id":899009,
            "title":"Nothing like genuine import"
        },
        "125":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Lijuan",
                "Nadira",
                "Nah.  Move on."
            ],
            "content":"<div class=\"\"><div> <span><b><u>Xue Lijuan</u></b><br>\r\n<b>Birthplace:</b> Hangzhao, Zhejiang Province, China<br>\r\n<b>Age:</b> 15<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'3\"<br>\r\n<b>Eyes:</b> Dark brown<br>\r\n<b>Hair:</b> Black, over the shoulder (straight)<br>\r\n<b>Shoe size:</b> 5<br>\r\n<b>Persona:</b> Back in her place of origin, Lijuan was considered a prodigy.  However, she was educated in an all girls school her whole life, becoming unsure of how to act around other boys as a result.  For some reason, Lijuan believes her time studying overseas will help her overcome her insecurity.<br>\r\n<br>\r\n<br>\r\n<b><u>Nadira Ba'albaki</u></b><br>\r\n<b>Birthplace:</b> Aleppo, Aleppo Governorate, Syria<br>\r\n<b>Age:</b> 16<br>\r\n<b>Grade:</b> 10<br>\r\n<b>Height:</b> 5'5\"<br>\r\n<b>Eyes:</b> Brown<br>\r\n<b>Hair:</b> Dark Brown, chest length (straight), wears head scarf<br>\r\n<b>Shoe size:</b> 7<br>\r\n<b>Persona:</b> A conversation with a girl like Nadira never lasts too long.  Nadira's words are always concise and to the point.  The drawback in her choice of speech leads to others calling her a stiff.  However, Nadira's mind became stiff when she saw Jesse for the first time...</span></div></div>",
            "created":1286773200,
            "id":972936,
            "title":"A taste of the East"
        },
        "1253":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Kagiso",
                "Sydney",
                "Someone else, please."
            ],
            "content":"<div class=\"\"><div> <span><b><u>Kagiso Kefilwe</u></b><br>\r\n<b>Birthplace:</b> Gobabis, Omaheke Region, Namibia<br>\r\n<b>Age:</b> 17<br>\r\n<b>Grade:</b> 12<br>\r\n<b>Height:</b> 6'0\"<br>\r\n<b>Eyes:</b> Dark brown<br>\r\n<b>Hair:</b> Dark brown, neck length (curly)<br>\r\n<b>Shoe size:</b> 12<br>\r\n<b>Persona:</b> Kagiso is more shy than a bushbuck, yet she gets really angry when someone pushes her to the limit.  Both traits she would have to get over to start her own business one day.  If she spends more time with people, she just <i>might</i> get over them.<br>\r\n<br>\r\n<br>\r\n<b><u>Sydney Hampson</u></b><br>\r\n<b>Birthplace:</b> Melbourne, Victoria, Australia<br>\r\n<b>Age:</b> 14<br>\r\n<b>Grade:</b> 9<br>\r\n<b>Height:</b> 5'6\"<br>\r\n<b>Eyes:</b> Green<br>\r\n<b>Hair:</b> Chestnut, shoulder length (straight)<br>\r\n<b>Shoe size:</b> 8<br>\r\n<b>Persona:</b> Athletic and peppy, Sydney lives for excitement.  Her farmer's tan is a clear sign of her preferring outdoor activities than being indoors.</span></div></div>",
            "created":1286859600,
            "id":973748,
            "title":"A taste of the South"
        },
        "13":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Casually; just by walking up to Jesse in the hallways.",
                "By visiting the cafeteria at lunch and meet him there.",
                "By making up an excuse to send him to her office.",
                "When Melody introduces Jesse to her.",
                "Author's choice"
            ],
            "content":"<div class=\"\"><div> <span>The Jacobs family is famed throughout the centuries.  Byron Jacobs bore the name of this clan, but the credit goes to his wife Cynthia for making the Jacobs' name back to being an august lineage.  Cynthia Jacobs was a woman of progress; a woman who believed for her to go forward, society must go forward.  Cynthia helped society go forward; be it for women's rights, workers' rights, aiding the evicted, proper health care - she and her followers played a huge role in humanitarianism.  Calling Cynthia a saint, however, is an overstatement, through her perspective.  A reporter quoted her saying, \"I only wish to help all people see light at the end of the tunnels they are trapped in.  They must dig themselves out but it does not mean I can't guide them.\"<br>\r\n<br>\r\nTo this day, those words echo in the memories of many individuals, including her descendants.  Bryce, son of Byron and Cynthia Jacobs, dedicated his life to helping the homeless.  Often, Bryce and his children would do volunteer work in the homeless shelters' soup kitchens or raise money for charities to keep the facilities running.  To this day, he continues to give something to those with nothing.<br>\r\n<br>\r\nNow comes the story of Barbara Jacobs, daughter of Bryce, granddaughter of Cynthia.  Barbara possessed ideals like her grandmother, only she wanted to improve student education.  At the age of eighteen, she trained at college to be an assistant principal.  Ten years later: as fate would have it, she became the vice principal of a new school; a school her grandmother had designed in her final years.  When it was near completion, Barbara made her grandmother the namesake of the high school.  When all was ready, she waited for the summer holidays to end.<br>\r\n<br>\r\nWill Barbara's work as the new school's vice principal match the accomplishments of Cynthia?  We shall soon find out...<br>\r\n<br>\r\n<u><b>Barbara Jacobs</b></u><br>\r\n<b>Birthplace:</b> Ottawa, Ontario, Canada<br>\r\n<b>Age:</b> 28<br>\r\n<b>Height:</b> 5'10\" (6'0\" when wearing heels)<br>\r\n<b>Eyes:</b> Green, wears glasses<br>\r\n<b>Hair:</b> Brown, long (straight), tied in a bun<br>\r\n<b>Shoe size:</b> 11.5<br>\r\n<b>Persona:</b> Generally, Barbara is a kind and mild mannered lady.  However, if anyone should embarrass her in public, she can be a real hard ass; a rather scary hard ass.  She can see the potential in students when she looks into their eyes.  Barbara could see it in Jesse too.  Of course, she looked at his foot first before she even thought of looking into his eyes.<br>\r\n<br>\r\nBarbara will know whether Jesse has the potential to become great once she meets him face to face (and later, foot to face).  But how would she introduce herself?</span></div></div>",
            "created":1279342800,
            "id":919334,
            "title":"The Jacobean era"
        },
        "133":{
            "choices":[
                "The secretary sends him immediately",
                "He’s truant, but was spotted near the campus",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><i>Those feet.</i><br>\r\n<br>\r\nThe image was seared into Barbara’s mind. It was the first day of a brand new school year, at a brand new school, at a school named after her own grandmother. She struggled through a decade of gruelling education, bore the incredible burden and responsibility of being a Jacobs, and clawed her way to a well-deserved and well-earned position that was now about to begin. Yet Barbara couldn’t concentrate. Her office, a tidy and utilitarian affair, seemed as distant as the sky. Piles of letters sat on her desk, messages were filling up her voicemail, and the agitated buzzing of her blackberry was ignored. <br>\r\n<br>\r\n<i>Those gorgeous feet</i>, Barbara thought, a smile growing on her lips. Over and over she replayed the scene in her head - remembering that skinny boy tumbling, revealing that stunning skin for all to see. What a surprise to see on the way to her office. She would trade in everything – her career, her name – to own those feet. And of course, the boy attached to them.<br>\r\n<br>\r\nThe Jacobs gene, as her father often called it, was borderline obsessive. It meant that they could achieve great things; for her grandmother and father, it was progress and humanitarianism. For Barbara, it was childhood education. At least, it was, until this morning.  When she saw that boy, the neurons in her brain seemed to reconfigure themselves. <i>I’m going to have him</i>, she thought, her heart accelerating with the idea. The Jacobs gene, that tool which gave her family such glory, was going to give her something much more tangible.<br>\r\n<br>\r\nAdjusting her glasses, she leaned in to look at her desktop. Finding him would be step one. He was of average height, with slight build, black hair, and of course, the most gorgeous feet she had ever seen. Methodically, Barbara went through every student photo she had on record. Nothing else mattered – not the inane faculty all around her, not the annoying tremble of her blackberry, nothing.<br>\r\n<br>\r\nSoon, she found the face she was looking for. Jesse Cartier. She whispered the name, repeating it over and over. <i>Cute</i>, for a fifteen-year-old, she thought, her smile quivering at his beautiful blue eyes. <i>Let’s see what kind of potential you have.</i><br>\r\n<br>\r\nBarbara picked up her phone, and it instantly went to her secretary. “Hello, Susan,” she greeted, as warmly as she could. “I need you to send a certain boy to my office. There appears to be a discrepancy with his record, and I’d like to have it resolved before noon.”<br>\r\n<br>\r\nBarbara said the name, and couldn’t help but bite her lip. <br>\r\n<br>\r\n“Jesse Cartier.”<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1286514000,
            "id":971431,
            "title":"The Jacobs Gene"
        },
        "1332":{
            "choices":[
                "Jesse bolted into the forest",
                "Jesse reluctantly entered her car",
                "A young girl stepped out from the forest"
            ],
            "content":"<div class=\"\"><div> <span>“Thank you Susan. No, no. I’ll deal with it personally.”<br>\r\n<br>\r\nBarbara returned the phone to its cradle, and leaned back in her chair. According to her secretary, one Jesse Cartier was apparently absent during class roll call. Student truancy, the bane of childhood educators, was a persistent problem throughout the school system. In this case, however, it provided Barbara with a rather fortuitous opportunity. <i>You naughty little boy,</i> she chuckled to herself, absently adjusting her glasses.<i> Slipping out on the first day? My, what punishment I have in store for you.</i><br>\r\n<br>\r\nThrowing her vibrating blackberry into the trash, Barbara rose from her seat and began to prepare for an extended leave of absence. Formally, she was just the vice principal of a high school. But her name revealed her true position – as a Jacobs, she had free reign over the building and everything in it. The rights earned by her grandmother were not mere platitudes. Cynthia Jacobs afforded her descendents certain inalienable privileges, which no one would dare question. Certainly no one in a backwater town like Lillooet. Although Barbara doubted her grandmother would approve of what she was about to do, she also knew that the Jacobs family had plenty of skeletons of its own. In the grand scheme of things, manipulating a boy into her possession was inconsequential. <br>\r\n<br>\r\nBarbara adjusted her grey skirt and put on her matching blazer. Appearance was part and parcel of her success, adding to the reverence she experienced daily. Probably the youngest principal in the province, she was by far the most attractive. Unfortunately, her career and ambition had kept most men away – and certainly none knew of her well-guarded obsession with feet. Soon enough, however, a certain young boy was about to learn all that and more about Barbara Jacobs.<br>\r\n<br>\r\nCollecting her briefcase and writing a short note to explain her disappearance, the 28-year-old vice principal carefully rehearsed a plan in her head. Barbara’s secretary had mentioned that a black-haired boy was spotted just outside of school property – a distance that afforded her just enough cover to avoid suspicion. It wasn’t clear what he was doing there, but Barbara could take a guess. Often, senior students dared the more naive and impressionable freshmen to leave the campus, usually for their own amusement. But it was a good sign for Barbara: Jesse would likely put up little resistance when she came for him. A timid boy would be quicker to accept her demands, and easier to force into submission.<br>\r\n<br>\r\nSaying a farewell to her office and her life as Barbara Jacobs: Vice Principal, she made her way to the parking lot and her BMW. It would only be a few minutes until she reached him now, and her body was shivering with anticipation. Once the boy was in her possession, there would be no need for secrecy. No more hiding in plain sight as a well-respected educator of a high school. Jesse Cartier would be the first person to see Barbara as she truly was: aggressive, dominating, and obsessed with feet.<br>\r\n<br>\r\nThe drive was quick, and it was easy enough to spot the boy. Jesse had made it to the edge of a massive forest surrounding Cynthia Jacobs Secondary School.  Even from the car, Barbara could sense the boy’s apprehension. He was wringing his hands, and pacing back and forth beneath an oak tree. The school itself was just out of sight, and there were no cars or pedestrians anywhere. “Perfect,” Barbara whispered, pulling her car to the side of the road. With a graceful movement, she opened the car door and walked towards Jesse.<br>\r\n<br>\r\nHis eyes, a distinctive blue even at a distance, widened as Barbara approached. She smiled widely, trying to avoid staring at his feet. “Mr. Cartier, I presume?” At an even 6’ in her heels, she had no doubt her figure was intimidating.<br>\r\n<br>\r\nJesse nodded slowly, his mouth quaking ever so slightly. “Y-yes?” He cowered away from the approaching principal.<br>\r\n<br>\r\nBarbara sighed with a well-practised intonation. “It seems you and I need to have a discussion about truancy,” she said, gauging the boy’s reaction carefully. “My name is Ms. Jacobs, and you’re quite a distance away from my school. I want you to come into my car, and we’ll discuss how you’ll make it up to me.” <br>\r\n<br>\r\nShe studied his fearful eyes, and made a mental note. <i>Potential.</i><br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1286686800,
            "id":972475,
            "title":"He’s truant, but was spotted near the campus"
        },
        "13322":{
            "choices":[
                "A small isolated villa",
                "A sprawling multi-level estate"
            ],
            "content":"<div class=\"\"><div> <span>Barbara smiled as the slight boy made his way towards the passenger side door. <i>Clearly, this was going to be easier than I thought.</i> Jesse's walk was initially hesitant, but with a quick glare from her green eyes, he hurried his pace. The vice-principal was careful to hide her smirk as she entered her car after him.<br>\r\n<br>\r\n\"So, young man,\" Barbara Jacobs began, settling in and buckling her seatbelt. She turned her eyes towards the fifteen-year-old, fighting the urge to glance at his feet. \"There are several ways we can proceed.\" The truant boy tried to avoid her piercing gaze, but Barbara would have none of it. \"Look at me when I am speaking, Jesse Cartier.\"<br>\r\n<br>\r\nThe black-haired boy's eyes met with hers, and Barbara could feel the anxiety beneath them. He was continually wringing his hands, and a slight, subtle tremble of his lip revealed his fearful thoughts. <br>\r\n<br>\r\n\"Please, Ms. Jacobs, I didn't mean to...\" Barbara held up a single elegant finger, silencing the boy's excuses.<br>\r\n<br>\r\n\"As I said before, Jesse, there are several ways we can proceed. Normally, truancy is a mere suspension,\" she spoke carefully, watching Jesse with a predatory gaze. \"However, truancy on the first day? Before the first class?\" Barbara shook her head with a disappointed flourish. \"That is grounds for immediate expulsion.\"<br>\r\n<br>\r\nJesse shuddered involuntarily. \"Ex... expulsion?\" His bright blue eyes were beginning to tear up, and Barbara almost felt a pang of guilt. \"But my mom... she went through so much to get us here...\" His voice was on the verge of cracking.<br>\r\n<br>\r\n\"However,\" Barbara intervened, and Jesse's face snapped towards her. <br>\r\n<br>\r\nShe smiled as gently as she could. \"However. I can make alternate arrangements, provided you accommodate my wishes.\" Barbara paused, savoring the eagerness in the boy's eyes. \"Anything!\" he nearly shouted, his tears quickly drying. \"Anything you ask, Ms. Jacobs! Just, please don't tell my mom.\"<br>\r\n<br>\r\n<i>Oh, but of course</i>, Barbara thought lustily. <i>No one will</i> ever <i>know about our activities</i>. The vice-principal reached out with a welcoming hand, and Jesse eagerly shook it. She smiled with ruby-red lips.<br>\r\n<br>\r\n\"I will do what I can to prevent the expulsion, young man, but this will require concessions on your part. You must not speak of this incident to anyone - <i>anyone</i>. Including your parents, your siblings, your friends... if anyone found out that I prevented this expulsion, then I may very well be stripped of my position.\" It wasn't true of course. A Jacobs' word was law around this town, and no one would dare question her actions as vice-principal. Still, Barbara felt a little guilty about lying to Jesse.<i> But the ends would justify the means</i>, she thought. <i>Particularly if those ends involved a certain boy's feet.</i><br>\r\n<br>\r\nJesse nodded solemnly, unaware of the true nature of the agreement. \"Of course, Ms. Jacobs.\"<br>\r\n<br>\r\n\"Well then,\" Barbara smiled. \"It's agreed. I'll drive you back to my chateau and we can discuss the precise nature of your concessions.\"<br>\r\n<br>\r\nThe boy shot her a quizzical glance, but quickly looked away.<br>\r\n<br>\r\n\"Ah yes,\" the vice principal muttered, gently slapping her forehead. \"I can make some calls about you from my chateau, and this way, no one will suspect that you were off school property.\" <i>It's also where I can begin my domination of your feet</i>, Barbara thought absently. <br>\r\n<br>\r\nJesse seemed appeased, if a little uncertain. <br>\r\n<br>\r\nBarbara placed her keys into the ignition, and began to pull away from the wooded area. But she was somewhat distracted during the drive; Jesse's long term prospects would have to be considered. Just how long could Barbara keep him? She was certain he would stay quiet with threats of expulsions, but sooner or later those may become useless. After all, Barbara did plan to do some very unusual things to his feet. Soon, however, the BMW reached her chateau, which was...<br>\r\n<br>\r\n</span></div></div>",
            "created":1294376400,
            "id":1031090,
            "title":"Jesse reluctantly entered her car"
        },
        "133222":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "She ties him up first",
                "She tickles his feet immediately"
            ],
            "content":"<div class=\"\"><div> <span>It was cute that Jesse was trying not to gawk. <br>\r\n<br>\r\nThe BMW had pulled up to Barbara's estate, a sprawling declaration of architectural achievement, roofs and balconies unwinding endlessly amid a scattering of spruces and pines. Barabara had not chosen this particular house her family owned by accident; she knew that Jesse would feel her authority all the more palpable in such an unfamiliar setting and wealth. <br>\r\n<br>\r\nHis anxiety momentarily forgotten, the fifteen year old boy was fidgeting his hands in his lap, looking out the window, eyes wide. The simple clothes he wore, a loose black and white striped T shirt, denim jeans that made his legs look skinny, and slip on sneakers, made him feel young and immature in comparison. <br>\r\n<br>\r\n\"Step outside,\" Barabara ordered, exiting the BMW without pausing for a second. She didnt have to turn around to know he was following her obediently. \"Follow me.\"<br>\r\n<br>\r\nAt this point Jesse was beginning to regret his rash decision to take his principal on her offer. Now he was completely out of his element, unsure of what to do, what to say. Feeling self conscious, he had no choice but to let the older woman lead him up the porch steps and into the big imposing mansion. <br>\r\n<br>\r\nInside, Barbara crossed her arms and said to Jesse, \"I'll need your shoes before we continue. As insurance in case you try and run.\"<br>\r\n<br>\r\n\"My...shoes?\" Jesse asked blankly, a lump forming in his throat. <br>\r\n<br>\r\n\"Is there a problem?\" Barbara asked, raising an eyebrow. \"And thats Ms. Jacobs to you, young man.\"<br>\r\n<br>\r\n\"Ehm, no - no Ms. Jacobs,\" Jesse muttered, feeling his cheeks heat up at the admonishment. He bent down and quickly stripped off his footwear, aware that the older woman was watching him intently. The slender boy hopped slightly, struggled to remove his shoe. Finally he handed both sneakers, their insides slightly warm, over to Ms. Jacobs, who wordlessly accepted them. She felt a rush of power as the boy yielded his sneakers over, as though his baring of his feet and surrender of shoes symbolized giving control to her. <br>\r\n<br>\r\nAs for Jesse, it seemed the baring of his large soles seemed to raise his self consciousness and sense of vulnerability even if he didn't understand the nuances of why. As he handed his shoes over, he avoided eye contact with his principal. When he saw her looking at his feet, he felt his face heat up in embarrassment.<br>\r\n<br>\r\n\"No socks, young man?\" Barbara asked, pretending she barely noticed his big pink feet poking out of his jeans. <br>\r\n<br>\r\n\"No Ms. Jacobs,\" Jesse stammered. \"I don't usually wear socks. It makes me uncomfortable and my feet get really hot and...\" He trailed off into a mumble, realizing that he was oversharing.<br>\r\n<br>\r\n\"Socks are a major part of human hygiene,\" Barbara said, letting a dribble of condescension into her voice. She shot him a disappointed look. \"You've been a very bad boy Jesse. Skipping school and disregarding school hygiene policies.\"<br>\r\n<br>\r\nIn reality no such policy existed but poor innocent Jesse seemed to shrink into himself, his slender shoulders shaking slightly. \"How much trouble am I in?\" he ventured bravely. <br>\r\n<br>\r\n\"I'm afraid I'll have to punish you,\" Barbara said, trying not to let her excitement leak into her voice. \"Got that, Jesse? This is what happens to silly boys who skip class and go barefoot.\"<br>\r\n<br>\r\n\"Yes Ms. Jacobs,\" Jesse agreed. <br>\r\n<br>\r\n\"Now sit on that chair.\" Jesse did so. \"And put your legs on the table, feet facing me.\" The dark haired lad did so, unsure of what the older woman was planning. He assumed the position, throwing his skinny legs on the wooden table so his heels rested on the edge and his soles dangled off it. Barbara sat down opposite to him.<br>\r\n<br>\r\nThis is it, the 28 year old vice principal thought, her heart racing. The boy's big, pink soles were mere inches from her, practically glowing. She could feel their natural heat from where she sat, and they looked ridiculously soft. <br>\r\n<br>\r\n\"Say, are you ticklish?\" Barbara asked, reaching out and gently stroking one finger down his soft sole. A stutter of giggles burst from Jesse's mouth and the foot shot back. The anticipation had made him unprepared which had heightened his ticklishness dramatically.<br>\r\n</span></div></div>",
            "created":1573029000,
            "id":2742958,
            "title":"A sprawling multi-level estate"
        },
        "1332221":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "She blindfolds him",
                "Jesse tries to escape"
            ],
            "content":"<div class=\"\"><div> <span>Barbara's calloused thumb pad brushed just under Jesse's soft toes, the nail accidentally caressing between his two smaller toes. At this contact, Jesse yelped and shot his leg back, nearly kicking the vice principal in the process. Even without physical contact, phantom giggles wracked the poor boy's body and he was a mess of giggles and shaking as he rolled onto the floor. <br>\r\n<br>\r\nWhen Jesse rose back up, rubbing his head where he'd fallen, he found Ms. Jacobs standing over him, not a wrinkle in her navy business suit, hands on her hips. At the sight of those talon like nails, Jesse crossed his legs, hiding his large feet under him instinctively. A rush of embarrassment came over him as he took in his position, giggling, hair a mess, sitting sheepishly on the floor. Still, he couldn't bear the thought of those fingers touching his feet again...<br>\r\n<br>\r\n\"Please Ms. Jacobs,\" He said. \"I won't ever be late again or skip school, I promise. I've learned my lesson.\"<br>\r\n<br>\r\nHe was staring hopefully at his shoes which were situated innocently behind the vice principal. Barbara noticed this, and subtly shifted her body to hide them from view. \"I don't think so young man,\" She said, entering a full on disciplinary tone. \"You've shown nothing but disrespect and ill regard for rules. Now that I think of it, you deserve more reparation.\" <br>\r\n<br>\r\nShe watched with secret glee as the hope on Jesse's face fell. He wanted to protest but before he could think of the right words to say, Barbara grabbed his slender wrist and instructed him to lie on his back on the table. The order was so bizarre that the dark haired boy blinked, confused. \"Now,\" said Barbara. <br>\r\n<br>\r\nJesse climbed on top and then laid down, staring up at his vice principal's expensive chandeliers hanging from the ceiling. He felt a hand close over his ankle and looked down to see the older woman tie it down to the table's leg. \"Wait!\" He said, startled. <br>\r\n<br>\r\n\"What was that?\" Barbara asked, not even paying him any attention. As she walked to his other foot, she casually swiped his bound one, causing him to gasp and shudder. She neatly gave his other three limbs the same treatment. </span></div></div>",
            "created":1575779100,
            "id":2756866,
            "title":"She ties him up first"
        },
        "13322211":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "she continues his upper body",
                "She moves onto his feet"
            ],
            "content":"<div class=\"\"><div> <span>The bondage alone wouldnt be enough. Barbara had a taste of power, of dominance, and she wanted more. Moving swiftly, she rummaged into a closet until she found what she needed. Jesse waited fearfully on her table, too scared to say a word. <br>\r\n<br>\r\n\"There we are,\" said Barbara with satisfaction. She turned around and showed it to Jesse. He quirked his head in obvious confusion and she waved the nylon socks in front of his face. \"You've been a very bad student today Jesse, and bad students dont get to see how theyll be tickled.\"<br>\r\n<br>\r\nJesse winced at the last word. \"Please dont blindfold me Ms. Jacobs!\" He pleaded. <br>\r\n<br>\r\nBarbara smiled at the genuine innocence and fear in the youths eyes. He began to buckle and squirm as she drew closer, those big sexy feet flapping on the edge of the table. She afixed the nylon socks over his eyes and tied them firmly behind his head. Leaning closely into his ear, she whispered \"I recently walked a full week in these. Do you like the smell?\" She trailed a tantalizing finger along his neck, watching him squirm. \"Well?\" <br>\r\n<br>\r\nJesse buckled, biting down giggles as he tried to formulate a coherent, respectful response. With his eyes forced closed, his entire world became his vice principal's fickle touch, and the unyielding bondage she'd put him in all the more apparent. Meanwhile the musk of the older woman's feet assualted his nostrils, rendering thought hazy and difficult. Something about being so vulnerable, so helpless before the older woman made the young naive Jesse feel heat rushing over his face and neck. <br>\r\n<br>\r\n\"I bet you love it, you naughty boy,\" Barbara continued, not letting his struggles escape her single finger. It stroked across his collar and then over his bare chest under his shirt before playfully pinching his nipple. Jesse groaned as the erogenous bud was toyed with. <br>\r\n<br>\r\nBarbara smiled wider and let her other hand suddenly ram into his armpit. Jesse shrieked, movement suddenly exploding out of his body and peals of laughter shooting out of his mouth. Her hand moved downwards, torturing his ribs and hips, her strong fingers squeezing without remorse. <br>\r\n<br>\r\nThe reserved and sometimes shy boy was losing his mind, squirming like crazy back and forth along the table. It was satisfying, watching his taciturn speech devolve into rampant screaming and pathetic, incoherent begging. Meanwhile Barbara's other hand began goosing his opposite side, making Jesse dance back and forth on the table, spit flying from his mouth as he laughed uncontrollably. <br>\r\n<br>\r\n\"Tickle tickle tickle,\" said Barbara cruelly. \"Cootchie cootchie coo. All naughty boys are so ticklish. Did you know that?\" She slid her rough hands under his shirt and stabbed her fingers into his flanks. \"Youre no exception it seems.\"<br>\r\n<br>\r\nJesse had never been tickled so badly before. Not by his family or friends or past bullies. The dark haired boy gasped and howled, bumping his head against the table, begging between laughter for mercy, for respite, for anything. He felt those rough hands ruck up his T-shirt and the cold breeze press against his slightly sweaty skin. Then the older woman beginning to play with his nipples again. Not quite the break hed been hoping for. <br>\r\n<br>\r\n\"N-not there Ms. Jacobs,\" He stammered. \"Ive learned my lesson. Please Ill be good. Just not there.\"</span></div></div>",
            "created":1578423840,
            "id":2770695,
            "title":"She blindfolds him"
        },
        "1332222":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "Barbara tickles his ribs",
                "She writes on his feet"
            ],
            "content":"<div class=\"\"><div> <span>Oh my god yes, Barbara thought, her eyes fastened hungrily to the dark haired boy who was quivering with one leg bent, the other still extended, and still giggling, trying to recover. The sheer contrast between his pink soles and the dark skinny jeans he wore seemed to emphasize the nakedness of his feet. Barbara tried to control her breathing and said sternly \"I think I know a good punishment for you now, based on that reaction.\"<br>\r\n<br>\r\n\" No no!\" Jesse exclaimed, suddenly bringing both feet away. He curled his knees protectively, tucking his feet under him. \"Please I cant stand tickling, anything else, Im begging you Ms. Jacobs.\"<br>\r\n<br>\r\n\"Im afraid thats not an option Jesse,\" Barbara glared. \"Feet back on the table. Now.\"<br>\r\n<br>\r\nJesse looked hesitant, wedging his feet deeper into the couch as though trying to hide them. \"Anything else, Ms. Jacobs. I really cant stand to be tickled.\"<br>\r\n<br>\r\n\"One,\" said Barbara. <br>\r\n<br>\r\n\"Please Ms. Jacobs! Not my feet!\"<br>\r\n<br>\r\n\"Two.\"<br>\r\n<br>\r\nBefore she could say three, Jesse caved in. The dark haired boy placed his soles back in front of his principal. He flinched as she leaned forward. <br>\r\nThe thought of having his school principal touching and tickling his feet made Jesse want to run and hide<br>\r\n<br>\r\n\"I'll have to teach you to follow orders better next time,\" said Barbara, sliding one finger slower now up the length of Jesse's velvety flushed sole. He gasped and squeaked but Barbara continued talking as if she hadnt heard. \"I wont stop until Im sure you have learned your lesson, boy.\"<br>\r\n<br>\r\nBarbara explored her finger up and down that divinely soft sole, loving how silky and warm his boyish soles were, how they twitched and jerked ever so slightly at her personal whim. It felt like she had perfect control of those big rosy feet. Barbara skittered her nails on the other foot as well, making Jesse squeak and shake terribly. The boy had scrunched his blue eyes and was shaking his head. <br>\r\n<br>\r\n\"Keep your feet where they are,\" ordered Barbara  quickening her pace. \"And I dont want to see those toes scrunched, understand?\"<br>\r\n<br>\r\n\"Y-ye-ahahahaha-es Ms. Ja-Jacobs,\" Jesse said, giggling. <br>\r\n<br>\r\nBarbara smiled, loving the position of power she was in. She explored every contour and secret space along those big feet, letting her fingers drift from his heels to his shallow arches and up up up to those bubbly toes and right under them in the sensitive webbing. Barbara wanted to control every aspect of Jesse Cartier's feet, she wanted to own them, to dominate them.</span></div></div>",
            "created":1573030380,
            "id":2742961,
            "title":"She tickles his feet immediately"
        },
        "13322222":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "She plays a game with him",
                "She makes him beg"
            ],
            "content":"<div class=\"\"><div> <span>Jesse let out a uncontrolled gasp as he felt his vice principal shift the pressure on his feet from her nails to the rough pads of her thumbs and forfingers. It was a surprising sudden change and not entirely unpleasant either. The calloused hands moved with rythmic familiarty across his soft sensitive soles. Jesse felt confused at the pleasant sensations now moving through his feet. <br>\r\n<br>\r\nBarbara smiled inwardly, continuing her massage. It would be good to dangle the carrot and the stick for him. \"Scooch closer,\" she ordered, tapping a nail on Jesse's heel. \"How am I supposed to get all of your foot if you keep shying away.\"<br>\r\n<br>\r\n\"Yes Ms. Jacobs,\" said Jesse sheepishly. He wiggled forward on the couch so now his large feet were dangling off of the older woman's lap, his skinny ankles and calves resting over her knees. Barabara stroked the tops of his feet, tracing the hints of veins and the parallel tendons of each toe. \"Did you know you have very soft feet for a boy?\" She asked, causing Jesse to blush. <br>\r\n<br>\r\n\"It's not a bad thing,\" she continued, emphasizing with a gentle massage and squeeze of his feet. Jesse squirmed in discomfort - whether at the unfamiliar feeling of a foot massage or from nervousness at his vulnerability she could not say - and flexed his toes. <br>\r\n<br>\r\n\"Say thank you for massaging my soft boy feet Ms Jacobs,\" Barabara said, not even looking at him, her fingers still roving diligently across those velvet soles. <br>\r\n<br>\r\n\"Thank - thank you for massaging my soft boy feet,\" Jesse said, his voice hitching a little at the sudden touches to his soles. He couldnt even comrehend what he was saying, entirely focused on the new and pleasant sensations on his feet.<br>\r\n<br>\r\n\"Thats a good boy,\" Barabara smirked. She skittered her nails along his arch causing Jesse to yelp in shock. \"Good good boy,\" She continued, now using a baby voice. \"Spread your toes Jesse.\"<br>\r\n<br>\r\nHe did so and Barbara uncapped a ballpoint pen. Noticing this, Jesse's eyes widened and the boy pleaded. \"No no nono please not that ms Jacobs.\"</span></div></div>",
            "created":1576354260,
            "id":2759591,
            "title":"She writes on his feet"
        },
        "133222222":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "Barbara uses brushes",
                "Barbara strips him down to his underwear"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh uh uh\" Barbara tutted. \"Dont you dare close those naughty toes, Jesse Carter.\" She brushed the opposite smooth end of the pen against his sole. \"Am I understood?\"<br>\r\n<br>\r\n\"Y-yes Ms. Jacobs\" Jesse said, submissively. He spread his toes further, widening the gap between each one. His principal casually inserted the back of the pen between two toes. The metal felt old and smooth, clearly an expensive brand, between his senstive feverish skin. <br>\r\n<br>\r\n\"Now Jesse\" said the rich woman. \"If you dont want me to write on your soles - which clearly deserve some writing if you ask me- you will have to beg.\" <br>\r\n<br>\r\n\"Beg?\" <br>\r\n<br>\r\n\"Thats right.\" She patted some dust off of Jesse's left sole. \"I want you to convince me, to make me believe that youre being honest.\" <br>\r\n<br>\r\nWith that, she got up and sat down on his ankles. Jesse flinched as his principal was now much closer to him, her hands within range of the rest of his body. The boy tried to lean sideways, to see the tops of his feet, but they remained hidden. Not weighing much, there was little Jesse Carter could do to break free. <br>\r\n<br>\r\nBarbara uncapped the pen and this time set the writing tip just under her prisoners big toe. Two calloused fingers held the hapless toe in the place and the other hand began looping a slow cursive letter on the sole. <br>\r\n<br>\r\nJesse instantly started bucking, tossing his head and laughing uproariously as the pen traversed his trapped foot. <br>\r\n<br>\r\n\"Ahhahahhahaha pl-pleassehhhahahahaha please stopp hahahahhaha!\" <br>\r\n<br>\r\n\"You'll have to beg harder that that\" scowled Barbara as though such weak begging disgusted her. She continued tracing the pen across his helpless boy feet. The word 'ticklish' was scrawled in elegant cursive across the length of one foot. <br>\r\n<br>\r\n\"Pleaashahahhaha I-I dont knowahahaha how to beggahahahaha!\" Jesse's face contorted into a laughing frenzy. \"Nohahahaha not myhahahaha not my toes pleeeaaase!\" <br>\r\n<br>\r\nBarbara wrote 'Barbara Jacob's tickle slave' on his other foot, ending it at the aforementioned toes. Her penmanship was quite phenominal, legible even across the valley of boyish wrinkles on Jesses sole. <br>\r\n<br>\r\n\"Keep begging!\" Barbara ordered. She capped the pen and began scrolling it up and down Jesse's feet while holdkng them in place by the big toes with her other hand. Jesse twisted and screamed, his attempts at begging jumbled into pathetic laughter. His slim body was growing hot underneath Barbara from all the thrashing and tickling. <br>\r\n<br>\r\n</span></div></div>",
            "created":1581649680,
            "id":2787018,
            "title":"She makes him beg"
        },
        "14":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Liz",
                "Vellicatrix Maximus",
                "Chisato",
                "Makka",
                "Gabrielle"
            ],
            "content":"<div class=\"\"><div> <span>Though the feet of Jesse Cartier was enough to fix the eyes of any lass with a foot fetish, none of the girls saw a chance to make his soles their own.  However, beyond the gates of Cynthia Jacobs Secondary, those very feet sparked the interest of another.  One glimpse was enough to implant the image of Jesse's most captivating body part into her brain.  From there, this lady began a plan made for the \"sole purpose\" of conquering Jesse.  A single mishap on the boy's account has given her an opportunity... and she will seize it both hands.<br>\r\n<br>\r\nHowever, the big question is: who is she?<br>\r\n<br>\r\n<b><u>Elizabeth \"Liz\" McFarlane</u></b><br>\r\n<b>Birthplace:</b> Vancouver, British Columbia, Canada<br>\r\n<b>Age:</b> 15<br>\r\n<b>Height:</b> 5'7\"<br>\r\n<b>Eyes:</b> Brown<br>\r\n<b>Hair:</b> Blond (with dyed green highlights), shoulder length (straight)<br>\r\n<b>Shoe size:</b> 8.5<br>\r\n<b>Persona:</b> Liz MacFarlane was (and still is) the epitome of the schoolyard bully archetype back in her grade school days.  She always considered Jesse as her favorite \"toy\".  However, this has given rise to a rather silly belief that it was some form of \"affection\" towards Jesse.  Whether that is to be believed is debatable.  What can be believed, however, is that Liz has found her old toy again...<br>\r\n<br>\r\n<b><u>Vellicatrix Maximus</u></b> <br>\r\n<b>Alter ego:</b> Unknown<br>\r\n<b>Birthplace:</b> Unknown<br>\r\n<b>Age:</b> Vague police records state she has a young lady's physique, but actual age is indeterminate<br>\r\n<b>Height:</b> 6'5\"<br>\r\n<b>Eyes:</b> Purple(?)<br>\r\n<b>Hair:</b> Black, long (straight)<br>\r\n<b>Shoe size:</b> 15<br>\r\n<b>Persona:</b> Though she has the fashion sense of a comic book villainess, she is as cunning as one.  VM is a notorious criminal yet very little is known about her.  What people do know is that VM kidnaps boys and girls between the ages of twelve and nineteen.  They are eventually released but what she does with them has never been spoken; not even by the former abductees...<br>\r\n<br>\r\n<b><u>Chisato Yamada</u></b><br>\r\n<b>Birthplace:</b> Victoria, British Columbia, Canada<br>\r\n<b>Age:</b> 10<br>\r\n<b>Height:</b> 4'7\"<br>\r\n<b>Eyes:</b> Brown<br>\r\n<b>Hair:</b> Dark brown, long (straight)<br>\r\n<b>Shoe size:</b> 3<br>\r\n<b>Persona:</b> Do not be fooled by this girl's cute, cuddly, and approachable façade.  Chisato is always the child babysitters always woke up in a cold sweat from.  This is due to her true nature; her mischievous nature.  But the babysitters who remove their shoes on their otherwise bare feet due to Japanese customs; they are at the most risk. If Jesse were ever asked to watch her, his only hope would be to place his finger in the proverbial dike and pray...<br>\r\n<br>\r\n<b><u>Makka Korobkina</u></b><br>\r\n<b>Birthplace:</b> Vedeno, Vedensky District, Chechnya, Russia<br>\r\n<b>Age:</b> 16<br>\r\n<b>Height:</b> 5'8\"<br>\r\n<b>Eyes:</b> Blue-green<br>\r\n<b>Hair:</b> Brown, short cropped (straight)<br>\r\n<b>Shoe size:</b> 8.5<br>\r\n<b>Persona:</b> A secret admirer of Jesse from afar since the sixth grade.  Though normally a calm and reserved teenager, the very thought of Jesse gives Makka a fluttery feeling.  But it was not until today that she noticed another interesting \"aspect\" of her crush; an aspect that sparked an interest she had never known to exist until the moment Jesse slipped up...<br>\r\n<br>\r\n<b><u>Gabrielle \"Gabby\" Kowalski</u></b><br>\r\n<b>Birthplace:</b> Vancouver, British Columbia, Canada<br>\r\n<b>Age:</b> 20<br>\r\n<b>Height:</b> 5'11\"<br>\r\n<b>Eyes:</b> Dark brown<br>\r\n<b>Hair:</b> Red, over the shoulder (curly)<br>\r\n<b>Shoe size:</b> 13<br>\r\n<b>Persona:</b> Gabrielle was Jesse and Melody's babysitter years ago.  The three of them were very good friends, mainly because the siblings saw the ever kind and patient redhead as a very \"cool\" girl.  To this day; Gabrielle, or Gabby as the little Cartiers called her, fondly remembers the times she would play with them and tickle them, especially Jesse.  And seeing as how Jesse's feet are as cute today as they were before, Gabrielle believes a reunion is in order...</span></div></div>",
            "created":1276059600,
            "id":896811,
            "title":"Misadventures off campus"
        },
        "141":{
            "author_id":"klepto",
            "author_name":"klepto",
            "choices":[
                "Grab Jesse and drag him to the empty playground.",
                "Taunt him in front of everyone.",
                "Let him go for now. Maybe something will happen during the school day."
            ],
            "content":"<div class=\"\"><div> <span>It was strange how the smallest details could give the biggest secret away. Such was the case for Jesse this time.<br>\r\n<br>\r\nWhile his trip was nothing but a simple accident, that pinkish sole caught the attention of someone far behind him. She was fairly tall compared to the students around her, and her green highlights made her stand out even more. Jesse probably could have melted into the crowd and faded amongst them all, but his feet were something that Liz couldn't forget.<br>\r\n<br>\r\nShe teased him about it specifically. Rosie. Pinky Jesse. Everything that brought extra attention to them, especially because Jesse seemed rather self-conscious about his feet, which only spurred her on more.<br>\r\n<br>\r\nOn one of the last days of school, Jesse had his bare feet propped up on a chair when Liz had walked by. She had swung her hand out, planning on swatting his feet off the chair, but she misjudged the distance and ended up merely grazing her nails along the arch of his foot. The boy had let out such a loud squeal that nearly everyone in the class turned their heads to look. Even Liz had frozen, her face feeling a bit hot. However, before she could even say something the bell rang and Jesse grabbed his shoes and ran.<br>\r\n<br>\r\nShe still didn't understand why she felt odd after accidentally tickling him. It felt like a little flutter in her stomach that made her feel... good. It swirled in her mind for the months that school was out for summer, but now her \"favorite toy\" was back in her sights.<br>\r\n<br>\r\nThis was probably her best chance of making up for lost time.</span></div></div>",
            "created":1286168400,
            "id":969018,
            "title":"Liz"
        },
        "1411":{
            "author_id":"klepto",
            "author_name":"klepto",
            "choices":[
                "Liz ignores him and tickles him",
                "Liz listens to Jesse's offers",
                "Liz offers a deal to him"
            ],
            "content":"<div class=\"\"><div> <span>Liz, with surprising agility, moved through the crowd in a bee-line towards Jesse. He was already getting back up on to his feet when she reached him from behind. Her hand shot out and grabbed a hold of his left wrist in a firm grasp. He gasped and looked up at his assailant, only to gasp again.<br>\r\n<br>\r\n\"Y-Y-You,\" was all he could muster, memories quickly rushing back of all the times Liz had bullied him. Now she was back in his life. <br>\r\n<br>\r\nLiz didn't respond to him. Rather, she tugged him hard and made her way towards the side of the school, pulling Jesse along with her. He tugged on her hand, but to no avail, and even tried to dig his slip-ons into the ground for some sort of resistance. They were almost to the playground, which was empty as it was still morning, when Liz suddenly pulled Jesse forward and released him.<br>\r\n<br>\r\nHe was caught off guard, and after a few stumbling steps he ended up falling face-first into the soft grass. He winced and was prepared to feel a punch or a noogie to his head, but instead he felt her grab on to his right ankle and lift his foot up.<br>\r\n<br>\r\n\"We have unfinished business, Jesse,\" she spoke matter-of-factly while popping his shoe off with one finger. She tossed it off to the side and stared down at the uncovered foot. So soft and smooth looking, and practically glowing pink, her heart began beating faster. Why did this make her feel so funny? It was just the foot of a boy! And yet, some fascination caused her to do all of this.<br>\r\n<br>\r\nJesse's foot twisted uselessly in her grasp, and his toes curled and flexed. He was looking back at her with a mixture of fear and confusion. Liz was transfixed for at least a good ten seconds before she broke out of her reverie and grinned down at him.<br>\r\n<br>\r\n\"You know,\" she said, \"The last time we saw each other, you had a very interesting reaction to when I touched you here.\"<br>\r\n<br>\r\nShe quickly stroked a finger down the length of his sole, from his toes to his heel. Instantly, a squeal slipped past Jesse's lips and his whole body jumped as though he were hit by lightning.<br>\r\n<br>\r\nLiz's grin grew into one full of elation. \"I knew it! You're super ticklish! Oh wow, if I knew this earlier, I <i>really </i>could have made things hell for you!<br>\r\n<br>\r\nJesse shook his head and grabbed a fistful of grass, worried. \"W-W-Wait! Is there anything I can do so you won't do this?!\"</span></div></div>",
            "created":1286773200,
            "id":973449,
            "title":"Grab Jesse and drag him to the empty playground."
        },
        "14112":{
            "author_id":"treefelldown",
            "author_name":"Ricketychair",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"We-ell\" Liz sang, putting one finger on her chin as if in thought. She knew that Jesse was naive and trusting. Maybe she'll mess with the poor boy too. <br>\r\n\"What do you have in mind exactly?\" <br>\r\n<br>\r\nJesse's face lit up with hope. \" I'll - I'll do your homework for a week Liz. How about that?\" <br>\r\n<br>\r\n\"A whole week?\" Liz grabbed Jesse's ankle and the boy flinched. She gave him a warning look that told him not to move or else. Jesse gulped. Liz smirked and played with her new captive's rosy toes, as if actually considering it. \"Spread em,\" she ordered.<br>\r\n<br>\r\n\"Wha-?\" <br>\r\n<br>\r\n\"Do I need to repeat myself Jesse? Your toes.\" Liz cruelly raked her nails under the bottom of the dark haired boy's warm sole making Jesse let out a girlish scream. He tried to tug his foot back but she wrestled it down, throwing her whole body over his leg. \"Oh no you dont!\" She kept tickling him. <br>\r\n<br>\r\nJesse gasped for breath, trying to dislodge his bully futilely. \" NoHAHAHAA Eek! LIZ NOO IM SOOOORRY STAWP HAHAHAHA!\" <br>\r\n<br>\r\n\"Has widdle Jesse learned his lesson?\" <br>\r\n<br>\r\n\"Yyeesss!\" Jesse hated being baby talked. Liz used to do it all the time to him when she wrestled him and pinned him down but with tickling it was so much more humiliating. <br>\r\n<br>\r\nLiz finally stopped and slapped his naked foot. She pulled off his other shoe and placed both pink bare feet on her lap and made Jesse spread his toes. She placed his shoes neatly on the grass next to them. Her heart was beating faster. Liz felt a rush of power at the barefoot, helpless boy before her and had to keep her excitement from showing on her face. <br>\r\n<br>\r\nShe slipped one nail threateningly under Jesse's spread toes. \"I dont think one week is enough.\" <br>\r\n<br>\r\n\"A month then,\" Jesse begged. \"And I promise I'll do whatever you say.\" <br>\r\n<br>\r\n\"Is that so?\" Liz flicked one finger across his left foot. Jesse squeaked. \"Are you sure you want to offer that?\" She stroked his right foot. Jesse gasped. \"ANYTHING I say...\" She began to gently scribble her fingers across his large vulnerable feet, trapping his ankles between her legs in a lock. Jesse began to giggle and beg incoherently, thrashing about as he clawed the grass. <br>\r\n<br>\r\n\"Cootchie cootchie coo!\" <br>\r\n<br>\r\n\"Ahahhaahhahaa Liiizz Please!!\" <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1514462820,
            "id":2433606,
            "title":"Liz listens to Jesse's offers"
        },
        "141121":{
            "author_id":"treefelldown",
            "author_name":"Ricketychair",
            "choices":[
                "Jesse makes it",
                "Jesse doesnt"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright'\" Liz smirked. \"Get up.\" <br>\r\n<br>\r\nShe didnt wait for him to obey. Jesse let himself be grabbed by the bicep and dragged up. \"Lift up your sole,\" Liz said. <br>\r\n<br>\r\nJesse lifted his foot, hesitantly meetint Liz in the eye. She giggled and clapped her hands in glee. <br>\r\n<br>\r\nShe grabbed him by the hair and dragged Jesse across the playground. \"Ow ow ow!\" He complained. \"My shoes! Theyre back on the grass.\" <br>\r\n<br>\r\n\"Looks like youre going to have to stay barefoot then,\" said Liz poking his side. \"Poor Rosy Jesse.\" <br>\r\n<br>\r\nJesse blushed. He was forced to stand on the flag pole where alot of Lizs friends were. They were all girls, a few were one year younger than him. They all smirked as Jesse was tied by in skipping rope to the flag pole, his wrists behind him. <br>\r\n<br>\r\nLiz had tied him up before when they were younger. Jesse gulped, fear making him sweat. <br>\r\n<br>\r\n\"Lift up those legs,\" ordered Liz. <br>\r\n<br>\r\n\"Please Liz...I...\" Jesse shut up as she wiggled her fingers threateningly at him. He curled his legs so that his feet were upturned, soles up, behind him. Liz tied them there with more skipping rope. <br>\r\n<br>\r\n\"Pinkey Jesse all tied up,\" taunted Liz. \"Aww is widdle Pinkey going to cry?\" <br>\r\nBy now quite a crowd had gathered, snickering. Jesse blushed heavily, trying to look away. He wiggled his toes nervously. <br>\r\n<br>\r\n\"Alright Jesse,\" Liz said, turning to the crowd. \"If you can go thirty minutes of tickling without saying 'Princess Liz, I'm a helpless tickletoy' I'll let you go and wont bother you again. But if not then not only do I get to KEEP  torturing these tootsies,\" she punctuated this by stroking under Jesse's rosy sole making him yelp. \" but you STILL have to do what I say for a month. Got it?\" <br>\r\n<br>\r\nJesse's eyes widened. \"Ple - please Liz, not thirty minutes.\" <br>\r\n<br>\r\nLiz snickered. \"Too late widdle Jesse. Come on girls.\" <br>\r\n</span></div></div>",
            "created":1514463900,
            "id":2433616,
            "title":"Yes"
        },
        "1411212":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "she parades hin baredoot acroas school",
                "Jesse goes to her house"
            ],
            "content":"<div class=\"\"><div> <span>Jesse had never been great in crowds, usually avoiding eye contact or shifting away from attention to some obscure safe corner. His shy nature meant that he sometimes stuttered in front of alot of people, or if they were focused on him. <br>\r\n<br>\r\n\"Cootchi cootchi coo,\" sang one of Liz's friends, a redhead with a splash of freckles and taunting green eyes. She wiggled her fingers under Jesse's shirt and jabbed them into his ribs. Jesse squirmed and giggled, tossing his dark hair. <br>\r\n<br>\r\nAnother girl tickled the other side of his ribs, making him dance like a puppet between them, helpless to keep from thrashing to one side or the other. <br>\r\n<br>\r\n\"Staawwhp!\" Jesse begged. <br>\r\n<br>\r\nTwo girls stroked his neck and collar, near his ears and scratched under his chin like he was some puppy. Jesse tossed his head and snorted, hopelessly trying to avoid their touch. When one girl licked her finger and then gave the poor boy a wet willy, he nearly screamed, hating the wet feeling in his ear. <br>\r\n<br>\r\nBut worse of all was Liz who was joined by two girls who had taken the liberty of raking their nails mercilessly across his bare boyish soles. The ordinarily shy boy was screaming and begging as his most sensitive soles were ravaged without care. Liz peeled his toes backwards, stretching his velvety sole, and skittered her fingere across it. <br>\r\n<br>\r\n\"Pleaaasse!\" Jesse begged, tears streaming down his face. <br>\r\n<br>\r\n\"Rosy Jesse, Rosy Jesse,\" taunted Liz. \"Cant even take some tickling on his rosy soles.\"<br>\r\n<br>\r\n\"What a weak boy,\" said one of her friends. <br>\r\n<br>\r\n\"These feet are so soft! Theyre like girl feet.\"<br>\r\n<br>\r\nFinally Jesses will crumbled. He cried out \"No more princess Liz! Im too ticklish! Im a ticklish boy toy!\" <br>\r\n<br>\r\nLiz snapped her fingers and everyone stopped. \"28 minutes,\" smirked Liz. \"I knew you couldnt handle it.\"<br>\r\n</span></div></div>",
            "created":1575275220,
            "id":2754471,
            "title":"Jesse doesnt"
        },
        "142":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "\"I'll just wait out here until he's finished school.  Better that way.\"",
                "\"I cannot wait anymore.  I'll go in and make up a plan as I go along.\"",
                "\"On second thought, fuck it.  I have three nice pairs of feet anyway.\""
            ],
            "content":"<div class=\"\"><div> <span>Vellicatrix Maximus found another toy.<br>\r\n<br>\r\nThe woman had told herself before that Cynthia Jacobs Secondary School would be the ideal place.  As usual, her instincts were right.  This school was indeed the ideal place to acquire a new pair of feet.  No, she <i>has</i> feet; she just needed another pair to play with.  Boy, girl.  Gender mattered not to her.  As long as they were well crafted (and ticklish), she would be happy.  In this case, it was a boy.  Through her binoculars, she detected many girls, and a few boys, wearing sandals, flip flops, or slip on shoes; and their feet made VM grin like a bobcat.  But a certain accident concerning the aforementioned boy and one of his shoes left the woman's jaw fall to the pavement.  His foot looked well groomed and, judging by how rosy his sole was, very tender.  VM could not help but lick her lips.  From behind that bush, the foot crazed bandit began to plan her next move.  And like always, she would begin her plans by thinking the same thought every time.<br>\r\n<br>\r\n\"By the end of this day, I'm going to have lots of fun.  Whether it will be fun for my 'playmate' or not is debatable, but if I'm happy, that's all that matters.\"<br>\r\n<br>\r\nVellicatrix Maximus found another toy.<br>\r\n<br>\r\n\"Now, what should my next move be?\" she asked herself.</span></div></div>",
            "created":1276491600,
            "id":899206,
            "title":"A new target spotted."
        },
        "1421":{
            "author_id":"klepto",
            "author_name":"klepto",
            "choices":[
                "Her home with other captives.",
                "A well-equipped hide-out for just the two of them.",
                "Deep in the woods where no one usually goes."
            ],
            "content":"<div class=\"\"><div> <span>\"It's too dangerous to go in,\" VM muttered to herself with a frown. To many people could see her, or worse yet there may have been a security camera to capture her on tape. Her greatest asset was that no one knew anything about her. Well, her second greatest asset. She always considered the first to be her finely shaped fingernails. They were nearly an inch long, tapered off into points, and painted the same shade of purple as her eyes.<br>\r\n<br>\r\nShe set down the binoculars and waited... time dragged on and on due to her excitement, but the sun slowly passed in the sky, and eventually the school bell rang. The doors opened and students came pouring out to split off in every direction. For a moment, VM was worried that she may have lost sight of her original target, but after a few seconds she locked on to him again. She started the car and began slowly moving along the curb towards him.<br>\r\n<br>\r\nJesse paused on the sidewalk and looked over his shoulder. Melody was hurrying over to catch up to her brother, already calling out to him. \"How was your first day, hmm?\"<br>\r\n<br>\r\nJesse turned to face her and matched her smile with one of his own. \"It was pretty good,\" he responded before tilting his head down the sidewalk. \"You know, with the new school hours you might miss your favorite show.\"<br>\r\n<br>\r\nMelody, confused, looked down at her watch. Her eyes shot wide open. \"Oh no! C'mon, we have to hurry!\"<br>\r\n<br>\r\nJesse laughed and shook his head. \"You go on ahead. I'll catch up with you. I may swing by the store and get a soda.\"<br>\r\n<br>\r\nWith that, Melody bolted off like a gazelle, leaving Jesse mostly alone. Almost all the students had already ran off, leaving just a few stragglers. It was about then that a car pulled up alongside him from behind and a young woman's voice spoke up. \"Excuse me... I think I'm lost.\"<br>\r\n<br>\r\nJesse turned around to face the woman. Despite his best efforts, he couldn't hide some of his surprise at her features, mainly the purple eyes which shone back at him. \"Ah, s-sure. Where are you trying to go.\"<br>\r\n<br>\r\n\"I'm trying to find Cynthia Jacobs Secondary School. I know it's around here somewhere, but I can't find any signs.\"<br>\r\n<br>\r\nJesse nodded and turned around to point at the large building behind him. \"Actually, ma'am, that's it right there. There's actually a-mphhhh!\"<br>\r\n<br>\r\nSuddenly, a hankerchief was clamped firmly over Jesse's mouth and nose, muffling his voice. He gasped in surprise and took in a large whiff of a sickly-sweet aroma. He grabbed on to her wrist, but already his muscles were feeling weak, and within a few more seconds his eyes drooped shut. VM quickly opened her car door and pulled Jesse inside before sitting him up in the passenger seat. To any onlooker, it looked like a sleeping boy being driven by his mother.<br>\r\n<br>\r\nWith a careful look around to make sure no one had seen her, VM inconspicuously drove off to a place where she could enjoy her prize...</span></div></div>",
            "created":1286254800,
            "id":969236,
            "title":"\"I'll just wait out here until he's..."
        },
        "1422":{
            "author_id":"thetickler",
            "author_name":"Icy yet Warm",
            "choices":[
                "Meanwhile..."
            ],
            "content":"<div class=\"\"><div> <span>Room 308.  First class: Remedial Italian.  That's what Jesse's class schedule said.  It was too bad he had to run around the entire third level to find the door.  He found the room in a nook at the other end of the corridor, right where he was standing before.  Could the architect have picked a spot any more secluded?  It mattered not.  Jesse found his class with seconds to spare.  That was all that mattered.<br>\r\n<br>\r\nThe inside of the classroom was nothing special.  It looked like an ordinary classroom with Italian words, phrases, photographs of parts of Italy, etc.  It was what Jesse expected to see when he thought of an Italian course.  There were about twenty-seven students in the room, including himself and Melody.  The two Cartiers sat side by side together as they waited for their instructor to show up.<br>\r\n<br>\r\n\"Ms. Maroni,\" read Melody.  \"I guess it's only natural that we get an Italian person to teach this subject.  Right, Jesse?\"<br>\r\n<br>\r\nJesse said nothing.<br>\r\n<br>\r\n\"Jesse, it's natural to get lost on your way to classes during the first week.  Why are you beating yourself up over it?\"<br>\r\n<br>\r\nHer brother said, \"Well... this is a prestigious school, isn't it?  It's kind of embarrassing to do something as stupid as that.\"<br>\r\n<br>\r\nMelody nodded understandingly and replied, \"You may have something there.  However, I have a gut feeling that between now and the end of the second semester, everybody here is going to do dumber things than getting lost.  Something as simple as getting lost doesn't make you stupid, especially in a school this huge.  Besides, I know for a fact that you are one of the brightest people I have ever met.  If you can remember every cake recipe and the names of all the world's major cities, I'm sure you can remember your way around this school.  No one has a better memory than you, Jesse.\"<br>\r\n<br>\r\nFor the first time since getting separated from Melody and getting lost, Jesse smiled.  \"Thank you, Melody.  You're also one of the nicest people I've ever met.\"<br>\r\n<br>\r\n\"Naturally,\" said Melody.  \"I am your sister.  It's in my blood to comfort you.  But don't get all misty-eyed on your first day here.  That <i>would</i> make you look foolish.\"  Melody giggled.  Jesse laughed along with her.  \"Tell you what, bro.  Come lunchtime, we'll sit outside and I'll give your feet a nice rub.  Sound good?\"<br>\r\n<br>\r\nJesse smiled and laughed.  \"Sounds good to me.  Just be careful around my toes.\"<br>\r\n<br>\r\n\"I'll try,\" said Melody.  And with that, Jesse awaited his teacher in higher spirits.</span></div></div>",
            "created":1277355600,
            "id":905412,
            "title":"Of adversity and close family"
        },
        "143":{
            "author_id":"klepto",
            "author_name":"klepto",
            "choices":[
                "Put a babysitting flyer in his locker.",
                "Steal one of his easily-removeable shoes and run.",
                "Wait and continue to plan. Something better may happen..."
            ],
            "content":"<div class=\"\"><div> <span>With everyone's minds on school, friends, or plans for the afternoon, no one took much notice of the girl sitting on one of the benches by the school's entrance. She could have been another student, or perhaps just someone watching the crowd, but she was neither.<br>\r\n<br>\r\nShe was Chisato Yamada.<br>\r\n<br>\r\nHer feet, clad in white sandals, swung back and forth, and her hands were folded properly in her lap over her sky blue sundress. Those close enough to her could hear a soft tune she hummed to herself while her brown eyes scanned the crowd. They stopped and focused on whatever she had been waiting for.<br>\r\n<br>\r\nA boy had tripped, and his foot slipped out of his shoe, revealing a flawless sole to her. Her legs froze in mid-swing. What was it about that scene that had caught her full attention? It wasn't clear on her neutral face, but her mischevious mind was whirring up plans and evil thoughts for the boy. She had so much fun torturing her babysitters, and as many of them removed their shoes due to the custom in her household, it made it that much easier to indulge in her favorite method.<br>\r\n<br>\r\nThey all reacted nicely, but something about Jesse felt right to her. If there was anyone who would react so beautifully to what she had in store, it would be him.<br>\r\n<br>\r\nHowever, it was the beginning of the school day, and she wasn't even a student here. How could she get him away? She frowned and rubbed her chin to formulate a plan...</span></div></div>",
            "created":1286168400,
            "id":969008,
            "title":"Chisato"
        },
        "1431":{
            "author_id":"klepto",
            "author_name":"klepto",
            "choices":[
                "Jesse arrives at the house",
                "Chisato meets Jesse before his destination",
                "Something impedes Jesse's way"
            ],
            "content":"<div class=\"\"><div> <span>When the final bell rung in the afternoon, Jesse was more than ready to go home and relax. He had plenty of new classes to prepare for, and there was also the situation of making some money. At lunch he had noticed that many of the goodies one could buy were a bit more expensive than he was used to.<br>\r\n<br>\r\n\"Maybe I can bag groceries,\" he muttered to himself as he turned the combination for his locker. Chances are he could get a job there, but he didn't want to lose that much free time in such a boring place. When he opened his locker up, a white piece of paper fluttered out and landed between his feet. He bent over, confused, and scooped up the paper to read what was written on it.<br>\r\n<br>\r\n<i>Seeking babysitter for young girl, aged ten. Hours are from 5:00 PM - 10:00 PM. You will be reimbursed $50 at the end of each day. If you are interested, please go to...</i><br>\r\n<br>\r\nJesse's eyes practically bulged out of his head. This was perfect! The hours were after school, there was money involved, and he could easily get his homework done and relax while watching the girl.<br>\r\n<br>\r\nSlamming his locker shut, he bolted out of the school and down the sidewalk. If he got the job, he could then tell his mother that he would be back late. The address was not that far, and he wanted to apply before anyone else could.<br>\r\n<br>\r\nLittle did Jesse know that he was the only one who got the advertisement.</span></div></div>",
            "created":1289019600,
            "id":988232,
            "title":"Put a babysitting flyer in his locker."
        },
        "14311":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "Jesse gets stuck under a bed",
                "Chisato 'catches' him"
            ],
            "content":"<div class=\"\"><div> <span>Jesse arrived at Chisato's house just like she planned. He arrived on bike and pulled off his helmet, sweeping his gaze to verify the house's number. It was just like the one in the flyer. Satisfied, the boy walked his bike to the entrance and rang the doorbell. <br>\r\n<br>\r\nUnbeknowist to him, Chisato had been watching him from a curtained window, as sly as a lynx. She bounded down the stairs and watched as her mother greeted Jesse and welcomed him inside. Noticing that both Chisato and her mom were shoeless, Jesse removed his slip on sneakers as well. <br>\r\n<br>\r\nNow Chisato reconciled the burning image in her head of that velvet flash of silky smoothness with the bare feet of the older boy in front of her. His dark blue jeans ended at the ankle, and served to emphasis the flushed color of his feet. They look smooth, Chisato thought sadistically. <br>\r\n<br>\r\n\"What would you like to do?\" Jesse asked, after her parents had left. <br>\r\n<br>\r\n\"Lets play cops and robbers,\" the young girl said sweetly. \"Ill be the cop and you be the robber. You hide and I catch you.\"<br>\r\n<br>\r\n\"Sure!\" said Jesse, naively, mussing Chisato's hair. \"Just dont run too wild.\"<br>\r\n<br>\r\nChisato maintained her angelic smile even though inside she was glaring at the childish gesture. Oh I'll make you pay for that, was the sadistic little girls declaration. Ill make you my helpless ticklish slave boy. <br>\r\n</span></div></div>",
            "created":1575274260,
            "id":2754469,
            "title":"Jesse arrives at the house"
        }
    },
    "info":{
        "author_id":"thetickler",
        "author_name":"Icy yet Warm",
        "brief_description":"A high-schooler gets to know his female classmates in an unorthodox manner...",
        "created":1267055580,
        "description":"<td align=\"left\" class=\"norm\">Enter Jesse Cartier, a boy born and raised in Vancouver, British Columbia, living an awesome summer.  Unfortunately, his summer is over.  The unfortunate part is that he won't finishing high school in the place he had grown to love.  Because his mother has scored a golden opportunity, he is now living in Lillooet.  Here he will be attending a new school, and I mean a <i>new</i> school.  Having been finished earlier in the year, this institution is now flocking with students and Jesse is one of them.  To his surprise, 65% of the students are female.  The only thing he doesn't know about them is that they have hidden foot fetishes.  And once they get a glimpse of his feet, Jesse's life will never be the same.<br>\r\n<br>\r\n<b>Jesse Cartier:</b> The main character.  Fifteen years old, 5'7\", 160 pounds, slender build, blue eyes, short layered black hair, size 13 feet.  Described as being timid, approachable, polite, and thoughtful.<br>\r\n<b>Melody Cartier:</b> Jesse's (Irish twin) sister.  Fifteen years old (eight months younger than her brother via premature birth), 5'7\", 148 pounds, slender build, blue eyes, neck length black hair, size 8 feet.  Described as being outgoing, slightly tomboyish, lax, and cordial.<br>\r\n<b>Tessa Aiken:</b> Mother of Jesse and Melody.  Thirty-six years old, 5'8\", 180 pounds, swimmer's build, green eyes, shoulder length black hair, size 10 feet.  Often described as a kind, loving, empathetic, strong, and patient woman with a sense of humor.  In short, your typical \"good mother\".<br>\r\n<br>\r\nRULES:<br>\r\n<br>\r\n-Write in 3rd person<br>\r\n-No spam or ridiculously short chapters.  I also appreciate proofreading.<br>\r\n-Unlike other foot fetish/tickling stories, the content will be about girls doing that stuff the guy's (Jesse's) feet.  Let's try and keep it that, you know what I mean?<br>\r\n-Developing the characters of Jesse or any of the girls won't hurt.  Don't be afraid to do so.<br>\r\n-Jesse worshipping any of the chicklet's feet is acceptable, but try not to let that become the main subject.  Jesse feet are the \"stars\", after all.<br>\r\n- Keep all the people from their respective story arcs in character.<br>\r\n<br>\r\nThat's pretty much it.  Like all fetish stories, go crazy. <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smile.png\" alt=\"*Smile*\" class=\"emoteZ\" title=\"Smile\" border=\"0\" width=\"15\" height=\"15\"><br>\r\n<br>\r\n<b>Author's Note(s):</b> As you've noticed, this story's subject matter is the rarest of the rare.  Very few write about it, so why not make another?  But if the content in this story doesn't sit well with you, then go to my other stories instead.  Let's acknowledge that nothing good comes out of bitching.<br>\r\n<br>\r\nI shall reward well-written chapters with fifty points - just so long as they follow the rules.</td>",
        "id":1649366,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1581649680,
        "modified":1581649680,
        "pretty_title":"Role Reversal: The Jesse Cartier Story"
    }
}