{
    "chapters":{
        "1":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Plot Routes 1",
                "Plot Routes 2",
                "Plot Routes 3",
                "Plot Routes 4",
                "Free Reign"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, are you free reign or are you part of one of the many soon to be fanfictions?</span></div></span></div>",
            "created":1470718800,
            "id":2193615,
            "title":"The obvious setting set up"
        },
        "11":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Bell the Ally Magic",
                "Plot Routes 1",
                "Plot Routes 2",
                "Plot Routes 3",
                "Plot Routes 4"
            ],
            "content":"<div class=\"\"><div> <span>Plot one: Bell Cranell leveled up after slaying the Black Goliath and has gained the new Magic of 'Summonnr' which allows him to summon one of ten monster girls from the Deadline Summonrr series.  <a onclick=\"$('#dropNote1').toggle (200);\" style=\"cursor:pointer;color:#0000ff;\" title=\"\"><span style=\"text-decoration:underline;\">Here is the link.</span> <span style=\"font-size:8pt;opacity:.75;text-decoration:none;\">▼</span></a><div id=\"dropNote1\" style=\"padding:0px;display:none;\"><a rel=\"nofollow\" href=\"http://www.mangahere.co/manga/deadline_summonnr/c001/01.html\" target=\"_blank\">http://www.mangahere.co/manga/deadline_s...</a></div>   If you do this route then I'll post the designs and characteristics of the girls that I plan on using in the route.  <br>\r\n<br>\r\nOther plot choices will lead to more plot options until I can think of anything else.  Or someone else can.</span></div></div>",
            "created":1470718800,
            "id":2193620,
            "title":"Plot Routes 1"
        },
        "111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Begin Route",
                "These monsters are good, but lets try some different ones",
                "I like this idea, but I don't like the personalities."
            ],
            "content":"<div class=\"\"><div> <span>Mummy- Sahara:  Sees herself as a queen and claims to be rich in riches from her personal realm, but is constantly broke and requesting money from Bell.  She's also always hungry which is odd for an undead.  <br>\r\n<br>\r\nGolem/Gauntlet- Earthaterra. (German like.)  Has a Koneko (highschool dxd) like personality almost capable of reading Bell's thoughts and calling him a pervert when another woman is near by.  She also enjoys sitting on his lap when hes resting.   <br>\r\n<br>\r\nScallya- Nami  Has a severe dislike for land and phobia to earth, so much so that she causes a flood of water to wash away the earth, making the dungeon room waist high in water.  This often upsets Lilly and Welf.<br>\r\n<br>\r\nCentaur- Cylla/Cyllara (Is like Caboose, but lusty.  So a combination of Sister and Caboose.  If you've ever seen Red Vs. Blue you know what Im talking about.  Unintelligent, often hits her own allies and is turned on whenever she is touched by Bell in any way.)<br>\r\n<br>\r\nSlime Girl- Tiialia/Tidia/Tiddie (Innocent little sister sterotype that says inappropriate things innocently.)  She'll say things like Tiddie needs a good sucking when she wants to drink from the water bottle that Bell carries or wants to suck his sweat directly.  <br>\r\n<br>\r\nLamia- Piper (Rattlesnake ish.)  Feeling like a baby sitter of Bell's party members and sighs alot at having to have to take care of Bell's dead weights.  <br>\r\n<br>\r\nWerewolf- Scooter.  Enjoys fighting and doing things for Bell, often desiring to make him happy.  And expecting pets on the head from him.  Often will chase after her own tail when not fighting monsters.  Feels like she's in competition with Lilly as she sees fetching the magic stones as a game and gets rewards with head pats.<br>\r\n<br>\r\nAlrune- Floret (French maid.)  Has a french maid personality and wants to clean up after Bell while revealing her busty and lewd body.  She often cleans up in front of him both to get his eyes to gaze at her and to clean up the area where he's going to walk, claiming that he shouldn't dirty himself by walking that far ahead.<br>\r\n<br>\r\nHeadless Knight- Maid Marian.  Often will despense justice and make sure everyone is safe.  If a pass parade ( when one party of adventurers passes a bunch of monsters to another) happens she'll slay the monsters as quick as she can and then chase after the dishonorable party.  <br>\r\n<br>\r\nHarpy- Aero.  Loves to fly and only does things for Bell with the promise of sex later.  She will try and have sex anywhere, but if often told that sex is in only in a hotel.  She likes to have her breasts caressed by Bell and likes to caress him as she carries him in flight.  Often trying to stroke him off through his pants.</span></div></div>",
            "created":1470718800,
            "id":2193635,
            "title":"Monster Girl Allies Names and Personality Traits"
        },
        "1111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Aiz, wants to see his new spell and could use the alone time with Bell",
                "Lilly, would love to see his new spell and could use some extra coin",
                "Welf, wow that's cool to hear"
            ],
            "content":"<div class=\"\"><div> <span>Bell waited patiently as he laid down on the sofa that was in the room under the church.  He was laying face down with Hestia on his back updating his status.  <br>\r\n<br>\r\nBell asked his goddess with a small smile, “So, what is my new status?”<br>\r\n<br>\r\nHestia was silent until she said to him, “It looks like you have gained a new spell.\"<br>\r\n<br>\r\nBell asked with a small smile of excitement trying to hold his giddiness inside, “What is this new skill like?”<br>\r\n<br>\r\n“Summon.”  That was Hestia’s reply void of any emotion other than shock.  How could Bell be gaining so many unique abilities, skills and spells?  This puzzled her very much.<br>\r\n<br>\r\nWith a small quick nod Hestia used her blood to update the hieroglyphs.  Making his status update official.  She had then had paper copied his Falna.  After pulling the paper off his back she climbed off his back a she showed the paper to the sitting up Bell.    <br>\r\n<br>\r\nOn the paper was the new status and new spell.<br>\r\n<br>\r\n<span class=\"clred\"><b>Level 2 Strength: D 578    Defense: D 500    Utility: F 356    Agility: E 499    Magic: G 271    Luck: H 187</b></span><br>\r\n<br>\r\n<span class=\"cred\"><b>Magic Firebolt- Swift Strike Magic    Summon- Swift Assist Long Duration Magic</b></span><br>\r\n<br>\r\n<span class=\"cmaroon\"><b>Skill Heroic Desire, Argonaut- Charges Automatically with Active Action</b></span><br>\r\n<br>\r\nBell was all sorts excited as he said to the Goddess, \"Goddess, can I go try out this new spell.  Please?\"<br>\r\n<br>\r\nThinking about it with her index finger touching her chin she told him, \"Only on the upper levels, I don't want you going past level five trying it out for the first time.  After you tell me about it, then we'll see if you can use it past that.\"<br>\r\n<br>\r\nBell as a bit depressed by the answer, but decided to not show it.  After all he did almost die a few days ago.  Still, he couldn't wait to show off his new spell.  He walked out of the church to find someone to show off his new spell to.<br>\r\n<br>\r\n<i><span class=\"cpgreen\">Who was the person he ran into?</span></i></span></div></div>",
            "created":1470718800,
            "id":2193650,
            "title":"Bell gets a monster girl ally"
        },
        "11111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "In the Dungeon",
                "Lilly interupts",
                "Loki appears!"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nBell was walking down North Main heading south to get to the Babel Tower.  Where the Dungeon was located at its base.  He was wearing his new Pyonkichi Mk-IV which was made by Welf rather quickly yesterday.  He had picked it up at the post office since Welf wanted to mail it saying he'd be out of commission on personal business.  The silver and red armor went well with his black under clothing as usual.  The main difference with this armor set was that he has his minotan daggers on his back now in back sheathes.  In the left sheath was the shorter of the daggers Ushiwakamaru and in the right the longer dagger that was made just yesterday along side the armor thanks to Welfs new Forge ability Ushiwakamarunishiki.  On the back of his waist above a square boxish potion pouch was the sheathe to his new baselard made from a drop item by the Baby Dragon from the eleventh floor Drahoine.  And safely tucked into his left fore arm protecting light armor was a armor sheathe that housed the most treasured item of all, the Hestia Knife.<br>\r\n<br>\r\nBell closed his eyes as he thought to himself on what the possibilities of this new magic could be.  Suddenly, he bumped into something that made him open his eyes and look up from the blue sweater tank top.  The gold hair and eyes of Aiz Wallenstien who seemed rather silent and said to him with her stotic expression, \"...Where are you off to Bell?\"<br>\r\n<br>\r\nRed flooded his face as Bell leaped back and bowed several times, \"I'm sorry, so sorry Aiz.  Please, forgive me.\"<br>\r\n<br>\r\nSullen by his shyness Aiz walked up and hugged his head into her breasts again, \"...Please, don't apologize.\"<br>\r\n<br>\r\nJust quivering and knees buckling Bell nearly fell down from the embarrassment.  Disappointed she decided to stop making him so vulnerable and embarrassed.  She released his head and said to him, “...So, what are you doing today?\"<br>\r\n<br>\r\nBell then placed his fist into his hand as he told her with his embarrassment gone, \"Oh, that's right.  I just got a new magic that was going to try out today.\"<br>\r\n<br>\r\nAiz quickly said before he could escape based on his facial gestures, \"I'm going with you.\"<br>\r\n<br>\r\nBell loss for words could only nod in defeat.</span></div></div>",
            "created":1470718800,
            "id":2193721,
            "title":"Aiz, wants to see his new spell and could use t..."
        },
        "111111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Aiz is fascinated by this and wants to know more",
                "The Dungeon summons a powerful monster",
                "Bell's stomach growls the three go to the Hostess of Fertility"
            ],
            "content":"<div class=\"\"><div> <span>The Kenki stood back behind Bell and watched as he went in with his two minotan daggers, Ushiwakamaru and Ushiwakamarunishiki.  Crimson slashes with sparks licking the blades crossed and jabbed the goblins.   The white haired 'rabbit' boy with red eyes landed with a skid as he put his daggers away.  Trying out his new magic he threw up his right hand, \"Summon!\"<br>\r\n<br>\r\nThe goblin looked at him expecting something, but nothing happened.  Bell looked at his right hand and stuck out his left hand not thinking about it.  He looked at his right hand as he said questioning, \"Why didn't my Summon-\"<br>\r\n<br>\r\nFrom his left hand came a burst of green light.  The light smashed through the dirt and stone as if formed into a seal.  From the seal came out a <a onclick=\"$('#dropNote1').toggle (200);\" style=\"cursor:pointer;color:#0000ff;\" title=\"\"><span style=\"text-decoration:underline;\">small blonded haired girl</span> <span style=\"font-size:8pt;opacity:.75;text-decoration:none;\">▼</span></a><div id=\"dropNote1\" style=\"padding:0px;display:none;\"><a rel=\"nofollow\" href=\"https://67.media.tumblr.com/d1e2608654f186b04ceac01c65b77978/tumblr_oaeej4CLcc1u7d6ako4_250.jpg\" target=\"_blank\">https://67.media.tumblr.com/d1e2608654f1...</a></div> .  Her hair was like that of pyrite and ruby red eyes.  Her giant gauntlet fists went in and slammed into a goblin that made a dash for Bell.  <br>\r\n<br>\r\nThe goblin crashed and turned into ash as the magic stone in it's chest broke.  The golem girl looked stotically at Bell as she said to him, \"Summoner.\"<br>\r\n<br>\r\nAiz looked at the girl and saw that the golem girl had several of her own traits and Bell's.  She gave a slight smile with a faint blush as she said, \"...She looks like our daughter.\"<br>\r\n<br>\r\nBell looked at Aiz as he said to her, \"Uh?!\"<br>\r\n<br>\r\nHis first thought was of if the golem girl was being nursed and then cared for by Aiz.  And then Aiz was in an apron welcoming him home.  The golem girl interrupted his thoughts by calling him out, \"Summoner is a pervert.\"<br>\r\n<br>\r\nStruck by the statement Bell lost his face.  After regaining his face he then asked the golem girl, \"So, uh, I'm Bell.\"<br>\r\n<br>\r\nThe golem girl replied to him, \"I know that already, Summoner Bell.  I am Earthaterra or Terra for short.  I am your Golem and Gauntlet.  Should anything need punching, I'm your summoning you want.  The others wanted to come, but I assessed the situation and decided you needed my help.  It would be more useful next time if you simply aim your left hand and called my name after saying Summon.  Or you can call on any of your other summonings: Sahara, Nami, Cyllara, Tidialia, Piper, Aero, Scooter, Floret or Marian.  Id suggest only summoning Cyllara if you need to make a quick reckless mistake.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1470718800,
            "id":2193741,
            "title":"In the Dungeon"
        },
        "1111113":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Yes",
                "Tione and Tiona the Amazon twins interupt",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell just looked at Terra as he then said to her, “Wow.”<br>\r\n<br>\r\nHis stomach then growled as he flushed and looked down at his stomach.  Looking at all the goblin bodies he then said to the pair of girls, “Uh, with my Familia’s life savings given to the search party that took the request.  I kinda am broke, so let me just collect these magic stones and drop items.  And exchange them up in the Babel Tower’s Exchange and then we can go to lunch.”<br>\r\n<br>\r\nAiz then said as she pulled out a small knife, “I’ll assist in doing so.  I am hungry as well.”<br>\r\n<br>\r\nAiz and Bell gutted twenty goblins as Bell looked at Terra and asked putting the last of the magic stones away, “So, why are you still here?  Also, why don’t I feel more Mind Down symptoms while you are here?”<br>\r\n<br>\r\nTerra explained as Aiz got her last goblin, “The spell is a low mind cost long duration swift assist magic.  Meaning that the cost of the magic is relatively low per summoning you summon.  And once we’re summoned our duration is based on how much energy we the summons have, so I won’t return til I choose to or am over thrown by fatigue.  And we are a swift assist meaning that we need a single word to summon us.”<br>\r\n<br>\r\nAiz then said to Bell and Terra, “...I’m done, shall we go?”<br>\r\n<br>\r\nThe three went up to the surface and got on the Babel Tower elevators.  It was a little cramped inside with Aiz having Bell in front of her.  And the back of his head resting against her bosom. <br>\r\n<br>\r\nBell noticed that Terra rested her cheek against his groin.  She rubbed her cheek on his zipper making him blush.  He was completely still from the nuzzling that he felt from Terra.  What happened next was almost worse, Aiz put her arms on his shoulders.  And pulled him into her bosom tightly, then placed her nose in his hair.  <br>\r\n<br>\r\nThe elevator opened and the three got out.  Bell pulled himself away from the two girls and stumbled a bit.  Panting he caught his breath as he then gained back his pale skin.  <br>\r\n<br>\r\nThe three arrived at the exchange as Bell noticed Eina and said with realization, “It’s Tuesday, right? Miss Eina should be running the Babel Tower Exchange today.”<br>\r\n<br>\r\nThe woman heard her name as she said to Bell with a small smile, “Bell.  I’m glad to see you are alright.”<br>\r\n<br>\r\nHer eyes lids lowered as she said to him sternly, “What have I told you about not adventuring?”<br>\r\n<br>\r\nSighing she said to him pushing her glasses back up, “Never mind that, so, what do you have for me today?”<br>\r\n<br>\r\nAiz and Bell placed the two bags of magic stones on the counter.  The tray was pulled behind the glass wall and the stones were counted.  Eina placed several Valis into the tray and said to them slidding it back, “You have been given 4,000 Valis.”<br>\r\n<br>\r\nA small bob of gold hair at Bell’s waist moved as Terra asked, “Summoner, is this the Ms. Eina that you think about for hours after visiting the Guild?”<br>\r\n<br>\r\nGasping Bell said to Terra, “Hey, stop reading my thoughts!”<br>\r\n<br>\r\nEina gawked as she stood up from her chair to look down at the short golem.  She looked down at the golem and asked shocked, “Who is that Demiperson?”<br>\r\n<br>\r\nBell smiled nervously as he told her, “I learned a new magic called Summon.  And I summoned Terra here.  We’re going to get lunch now.”<br>\r\n<br>\r\nLooking at her clock Eina said to the three, “Lunch is right now and I’ll be coming with you.  I’d like to find out more about the summonings.”<br>\r\n<br>\r\nNow with four in the group outing they arrived at the Hostess of Fertility.  Syr smiled as she greeted them holding up her tray, “Hey, Bell, the usual table in the corner?”<br>\r\n<br>\r\n</span></div></div>",
            "created":1470718800,
            "id":2193781,
            "title":"Bell's stomach growls the three go to the H..."
        },
        "11111131":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "\"You have summon magic, now?\"",
                "\"You must enjoy her sitting in your lap.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah, that'll be fine,\" Bell said, nodding. He smiled at Syr, and she smiled back very widely. <br>\r\n<br>\r\nThen Syr bowed and gestured for them to follow her. Modest endowments hung down within her blouse with the angling of her torso before she straightened back up, and Bell couldn't help looking. <br>\r\n<br>\r\nTerra glanced up at him.<br>\r\n<br>\r\n\"Pervert,\" she deadpanned in a quiet voice. <br>\r\n<br>\r\n\"Uh, it's not like that...\" Bell softly sputtered, his face going pink. \"I don't know what you're talking about.\"<br>\r\n<br>\r\n\"Liar,\" said Terra. There was no heat in her tone, nor ice. It was merely a statement.<br>\r\n<br>\r\nThey followed Syr to the corner. Aiz walked on the other side of Terra, her eyes flitting down to the girl semi-frequently. Her expression was, like Terra's, difficult to read. Eina walked behind Bell and Terra, looking curiously down at the little demihuman. Syr glanced over her shoulder only once, when they had finally reached the table. She looked thoughtful and bemused at the sight of the golem girl.<br>\r\n<br>\r\nThey seated themselves at the table. Bell took a seat opposite Eina, and Aiz chose the seat next to him. Terra, without a moment's hesitation, seated herself squarely on Bell's lap. She did it in a very matter-of-fact way, too.<br>\r\n<br>\r\nSyr looked amused at this.<br>\r\n<br>\r\n\"She's cute,\" the waitress commented, nodding to Terra. \"How old is she? Twelve?\"<br>\r\n<br>\r\n\"Twelve and a half,\" said Terra flatly. \"<i>Centuries</i>.\"<br>\r\n<br>\r\nSyr blinked. It was a testament to her professionalism that she did not especially react to this claim.<br>\r\n<br>\r\n\"I'm sure you are,\" she said in the kind of softly indulgent tone that one might use with a very small child. \"Now, may I take your orders?\"<br>\r\n<br>\r\nBell, Aiz, and Eina each placed their usual orders. Terra did not. She simply sat on Bell's lap, shifting now and then, resting the back of her head against his chest.<br>\r\n<br>\r\nSyr left, and Eina turned to Bell, glancing curiously at Terra.<br>\r\n<br>\r\n\"So...\" she began.</span></div></div>",
            "created":1470805200,
            "id":2193960,
            "title":"The Usual Table"
        },
        "111111312":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She says yes",
                "Syr interrupts with their food",
                "No, not quite"
            ],
            "content":"<div class=\"\"><div> <span>\"You must really enjoy it, how that cute little girl is sitting in your lap.\"<br>\r\n<br>\r\nBell flushed at Eina's remark.<br>\r\n<br>\r\n\"It's not like <i>that</i>,\" he said. \"She's...\"<br>\r\n<br>\r\n\"Isn't it, Summoner?\" said Terra, looking up at Bell with an inscrutable expression. She backed up a little. \"But you're thinking differently. You wish Aiz and Eina were sitting on your lap, too. Pervert.\"<br>\r\n<br>\r\nThough she said this, it did not seem at all like a remonstrance. She was simply stating a fact.<br>\r\n<br>\r\nEina quirked an eyebrow at Terra's remark, and at Bell's telling lack of a response.<br>\r\n<br>\r\n\"Is that so?\" she said, looking at Bell half-amusedly. Privately she felt a little giddy at the thought, but it was easier to tease. \"I wonder how she knows that, if it's really the case.\"<br>\r\n<br>\r\nBell did not look Eina in the eye. <br>\r\n<br>\r\n\"Uh... I'm not really sure, myself,\" he said. \"It's n-not like I'm <i>really</i> thinking those kinds of things about you two!\" <br>\r\n<br>\r\nEina could tell right away that this was a lie, and quite a feeble one, but Aiz seemed to  believe it, judging by how her face imperceptibly fell.<br>\r\n<br>\r\n\"You aren't?\" she said in a tone that was subtly disappointed. <br>\r\n<br>\r\nBell looked at her for a long moment. His face slowly lost some of its excess color.<br>\r\n<br>\r\n\"Well, maybe a little,\" he admitted shamefacedly. <br>\r\n<br>\r\nAiz perked right up at this, although again it would have been difficult for a casual observer to tell.<br>\r\n<br>\r\nTerra cocked her head.<br>\r\n<br>\r\n\"Those two want to sit in your lap, too, Summoner,\" she said, glancing from Aiz to Eina. \"I don't want to let them, though.\"<br>\r\n<br>\r\nNow it was Eina's turn to blush and abashedly avert her eyes. Aiz simply nodded a quiet confirmation, as if this was perfectly normal.<br>\r\n<br>\r\n\"Guh...\" muttered Eina, looking very red indeed. \"What are you, girl, a mind-reader?\"<br>\r\n<br>\r\nBluntly, Terra answered. </span></div></div>",
            "created":1470805200,
            "id":2193965,
            "title":"\"You must enjoy her sitting in your lap.\""
        },
        "1111113123":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Let's look at what Aiz and Terra are doing.",
                "Continue with this part, who is the mummy?",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>As per her now established stotic blunt and matter of factly personality Terra deadpanned to Eina, \"No, not quite.  I am a demihuman summoning known as a golem.  We are made with one face and one face only.  Humans and other humanoids plus some other species of demihumans were made with many faces.  It is easy to read the faces of humans because there are so many.  With constant observation of my stotic face, I can gather all details of your current face.  Even Aiz is easy to read.  Though among humans she is the toughest to read of you all.  With a golem it is impossible to read their face.  If I met another golem, I would observe that golem single face.  If they were a happy face then they'd be excited at all times and unpredictable, because they'd only do more and more excited things to maintain their happy face.  With my face, of being stotic, I shall always be matter of factly and dead pan.  If I exhibit an unusual emotion it could very well cause a crack and any small crack will lead to bigger cracks.  And those cracks lead to broken pieces of this body.  And that would be dangerous for master.\"<br>\r\n<br>\r\nBell looked sad as he was about to say something to him when Terra interrupted him seeing a tear and almost quivering that went unnoticed by everyone but Aiz who noticed a small crack appear on her neck, \"Master, please no tears.  I erode easily.\"<br>\r\n<br>\r\nBell sniffed as he then wiped his eye and said to her, \"Right, right.\"<br>\r\n<br>\r\nShifting her neck Terra felt her crack and maintained her same stotic behavior.  She then looked to Eina, Aiz and back at Bell.  Terra then asked Aiz, \"Aiz, would you mind escorting me to the ladies room?  I require to powder my nose as they say.\"<br>\r\n<br>\r\nAlthough Aiz didn't look or seem it, she did apply a little bit of make up and knew the phrase.  She nodded as she pushed her seat out and stood up.  She then walked behind Terra as the pair went off.  Leaving and Bell and Eina alone with each other.<br>\r\n<br>\r\nEina then asked him looking at him, \"So, how did you summon such a lovely little girl?\"<br>\r\n<br>\r\nBell tried to recall the events as he moved his left hand forward unconsciously, \"Well, I threw my right hand out trying to do my new magic.  But, it didn't work.  And when I put my left hand out by accident and said Summon-\"<br>\r\n<br>\r\nSuddenly brown lightning birthed forth from the outstretched left hand and at the seat right beside Eina.   From the lightning came a <a onclick=\"$('#dropNote1').toggle (200);\" style=\"cursor:pointer;color:#0000ff;\" title=\"\"><span style=\"text-decoration:underline;\">sandy brown fleshed girl with black hair</span> <span style=\"font-size:8pt;opacity:.75;text-decoration:none;\">▼</span></a><div id=\"dropNote1\" style=\"padding:0px;display:none;\"><a rel=\"nofollow\" href=\"https://65.media.tumblr.com/47c42ec558ac5e1f989da972c42e64ac/tumblr_oaeej4CLcc1u7d6ako6_250.jpg\" target=\"_blank\">https://65.media.tumblr.com/47c42ec558ac...</a></div> .  Her sand gold eyes looked at the food that was placed down by Syr.  Syr made an surprised 'ooo' sound as the bandaged covered mummy girl said pointing at the plate with a smile, \"Oh, is that food?  I hope you don't mind if I have some.\"<br>\r\n<br>\r\nShe then grabbed Eina's ramen and poured the hot liquid down her maw.  Eina just starred slack jawed as her left eye twitched.  </span></div></div>",
            "created":1470805200,
            "id":2194048,
            "title":"No, not quite"
        },
        "11111131231":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "And now we meet Sahara",
                "Tione and Tiona the Amazon twins see Aiz and think Terra is her daughter!",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Terra held her neck as still as possible as Aiz took some sand paper to her neck.  She grinded the stone made girl's neck until until the heat made the clay near liquid again.  The clay was arranged to cover the crack and repair it.  Terra thanked Aiz with her usual stotic face, \"Thank you Aiz.  It is troublesome to maintain one's body because of irrational fears such as erosion.\"<br>\r\n<br>\r\nAiz felt sorry for the demihuman that looked like a future child of hers and Bells.  She wrapped her arms around Terra from behind the short two and a half feet tall golem.  Showing an unusual amount of humanity Aiz said to the golem with a slight smile, \"You will never crack while I am here.  Understand this.\"<br>\r\n<br>\r\nTerra knew that her neck was still drying and said looking straight forward in her usual deadpan style, \"I can't look up at your smile, but I would like to make your smile even bigger.  I may be twelve and a half centuries old, but golems are made of magic clay.  And when we are contracted with a new summoner.  We are reduced to a fresh pile hot clay.  Clay that is arranged by the dreams of our new summoner.  If it pleases you, I am the image of what Summoner envisions his future daughter would look like if you and he ended up making off spring.\"<br>\r\n<br>\r\nAiz widen her eyes as she let out a small gasp.  A smile that was unusually long came to her face and her eyes closed in happiness.  A giddy feeling rushed in her as she quivered in happiness.  The giddiness calmed and receded like a wave.  <br>\r\n<br>\r\nTerra then said to Aiz, \"Shall we go and rejoin Summoner?\"<br>\r\n<br>\r\nAiz smiled still and said as they left, \"Yes, let's go rejoin your father.\"</span></div></div>",
            "created":1470805200,
            "id":2194057,
            "title":"Let's look at what Aiz and Terra are doing."
        },
        "111111312311":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Sahara over reacts and shouts that she'll eat if she wants to",
                "Eina asks tries to make new conversation",
                "Sahara is refined enough to let Bell and the others eat their new plates of food"
            ],
            "content":"<div class=\"\"><div> <span>Bell looked at the mummy who just ate his and Aiz's food.  She didn't even bother chewing the rice with mushrooms from Bell's plate.  She did cut up Aiz's steak and consume it with fevor.  Terra didn't even look still aware of her neck and said to the mummy, \"Sahara, stop eating everything.  Summoner doesn't have that much money.\"<br>\r\n<br>\r\nSahara wiped her lips with a bandage in a very lady like manner, which was odd cause she just ate everything like a boar.  Closing her eyes and acting rather refined like a queen, \"Of course, Lady Terra.  Master Bell, I have forgotten my manners.  I am Sahara, the mummy summoning.\"<br>\r\n<br>\r\nTerra sat back down in Bell's lap and pulled his arms around her waist.  She said explaining to the slack jawed Eina, \"Sahara is undead and because she died of starvation she is constantly hungry.  Summoner must have summoned her by accident explaining how he summoned me.\"<br>\r\n<br>\r\nSahara looked at Syr as she said to her, \"Oh, which reminds me.  Do you have any more food?  Or wine?  I'll eat and drink anything.\"<br>\r\n<br>\r\nEina asked questioningly, \"But, how is she not full?\"<br>\r\n<br>\r\nSahara looked at Eina she said to her resuming her regal manner that she had broken out of character asking Syr about food, \"Being undead has it's benefits.  Such as not gaining an ounce of fat.  Having many scarabs in my body prevents the food from needing to be emptied out.\"<br>\r\n<br>\r\nFrom Sahara's belly came a few scarabs from under bandages.  The scarabs walked around the table scaring Syr.  Syr pointed at them saying, \"Can you please recede your bugs?\"<br>\r\n<br>\r\nLyu walked up as she said holding new plates of food, \"Momma Mia says that the new girl doesn't get any more food.\"</span></div></div>",
            "created":1470805200,
            "id":2194063,
            "title":"And now we meet Sahara"
        },
        "1111113123113":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "\"It's our pleasure, Bell-kun.\"",
                "\"Who said it was free?\"",
                "Loki barges in"
            ],
            "content":"<div class=\"\"><div> <span>For a moment, it looked like Sahara was about to throw a tantrum. Her face contorted and she tensed up like a tightly coiled spring. But then she took a slow, deep breath and relaxed, easing her body and calming her expression. With a sovereign mastery of her demeanor she nodded and waved this away, taking it with apparent good humor.<br>\r\n<br>\r\n\"Is she afraid I'll eat her out of house and home?\" the dusky-skinned mummy lightly inquired as Lyu set the new plates of food before the others. <br>\r\n<br>\r\n\"Mm,\" Lyu hummed, an uninvested and noncommittal response. \"I didn't ask. But your little friends are unsanitary.\" She gestured to where one of Sahara's scarabs scittered across the table. \"Do try not to let them out.\"<br>\r\n<br>\r\n\"Of course,\" said Sahara, but her face twitched a little. \"They might be sacred creatures, but if you think they're <i>unsanitary</i>...\"<br>\r\n<br>\r\nBell interjected before anything could be said that might later be regretted. <br>\r\n<br>\r\n\"So, you're a mummy,\" he said. \"And another summon? How many are there?\"<br>\r\n<br>\r\nSahara inclined her head, looking at Bell with a gracious expression.<br>\r\n<br>\r\n\"For you, master? There are ten of us.\"<br>\r\n<br>\r\nSyr made an impressed <i>\"Oh!\"</i> sort of sound. Lyu cocked her head. <br>\r\n<br>\r\n\"Ten?\" said Aiz, swallowing a mouthful of meat pie. \"That's a good-sized party.Two times more than the whole rest of Hestia Familia, isn't it?\"<br>\r\n<br>\r\n\"Summoner can't have us all out at once, though,\" Terra remarked, giving Sahara a blank look that somehow managed to convey a whole world of emotion. The mummy smiled right back at the golem in a faux gracious manner.<br>\r\n<br>\r\n\"Right, but of course,\" said the dark haired, bandaged beauty. \"The number and duration are restricted by his level of magic, naturally. At most, at present, I guess he'd be able to summon three of us at a time. But even just one summon as noble and distinguished as myself is worth a whole army of lesser mortals,\" she added a touch airily.<br>\r\n<br>\r\nBell finished his food with a contented sigh, smiling gratefully at Syr and Lyu. The former blushed but returned the smile. The latter inclined her head and afforded him something that might have been a small, subtle grin.<br>\r\n<br>\r\n\"Thanks for the free seconds,\" Bell said.<br>\r\n<br>\r\nSyr giggled.</span></div></div>",
            "created":1470891600,
            "id":2194523,
            "title":"Sahara Maintains Her Dignity"
        },
        "11111131231133":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She assumes Terra is Aiz and Bell's daughter",
                "She recognizes Terra as a golem and a summon",
                "She is struck by a pervy big-sister type infatuation with Terra"
            ],
            "content":"<div class=\"\"><div> <span>\"Aiz, my daaaarling~!\" came a sudden, drunken cry. <br>\r\n<br>\r\nThere was a slight commotion as Lyu ducked aside and Syr was nearly bowled over. Eina watched bemusedly, Sahara interestedly, and Bell abashedly as the petite form of the redheaded goddess of chaos, mischief, and the hearth, Loki, came barreling at them and threw herself at Aiz in a sodden glomp. <br>\r\n<br>\r\nThe blonde herself did not particularly react, not even though Loki buried her face in her chest and quite publicly nuzzled her bosom.<br>\r\n<br>\r\n\"Hello,\" she said to Loki, outwardly unperturbed. <br>\r\n<br>\r\n\"Aiiiiz!\" Loki gushed. \"Where weeere you? Don't leave me all alone, you awful girl!\" <br>\r\n<br>\r\nBell tried not to stare at the way Aiz's breasts rolled and mashed with the press of Loki's rosy cheeks.<br>\r\n<br>\r\nEina watched with a kind of vaguely morbid fascination as the clearly intoxicated goddess showered kisses on the Kenki. Sahara clapped as if entertained by the spectacle. Syr sheepishly averted her eyes, and Lyu watched unfazed.<br>\r\n<br>\r\nTerra quietly stared. <br>\r\n<br>\r\nLoki continued snuggling Aiz for a few moments longer before finally raising her face from the blonde's bosom. Squinting, vulpine eyes fell upon Terra.<br>\r\n<br>\r\nA beat.<br>\r\n<br>\r\nLoki stared at the thirty inch tall golem with her golden hair and striking red eyes. She blinked, and looked up to see the girl was sitting in Bell's lap. Bell who was sitting next to Aiz. With a girl in his who looked like she could have been his and Aiz's illegitimate daughter.<br>\r\n<br>\r\nThrough the spinning of her head, Loki latched onto this with a sense of something not unlike revelation. <br>\r\n<br>\r\nShe looked again at Terra. Then at Bell. Then at Aiz.<br>\r\n<br>\r\nSahara quirked an eyebrow, bemused by the redhead's actions. Eina shrank a little nervously in her seat. Syr was hesitantly backing away. Only Lyu looked unbothered by the look in Loki's eyes.<br>\r\n<br>\r\nAnd Loki herself stood up to her full, diminutive height and crossed her arms over her flat chest, expression unreadable.</span></div></div>",
            "created":1470891600,
            "id":2194531,
            "title":"Loki barges in"
        },
        "111111312311331":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Terra interjects and corrects the matter",
                "Syr protests this with a blush",
                "Loki snaps and turns on Bell"
            ],
            "content":"<div class=\"\"><div> <span>\"When did you two have a kid?\" Loki said, turning a baleful eye on Bell. The room temperature dropped by several degrees.<br>\r\n<br>\r\n\"Eh? No, she's not--\"<br>\r\n<br>\r\n\"She just arrived today,\" said Aiz in complete seriousness, addressing the goddess. <br>\r\n<br>\r\nLoki pulled a face that was hard to read, and she stepped backwards as if flinching from a strike.<br>\r\n<br>\r\n\"J-Just today?!\" said the goddess. She muttered, looking troubled. \"You were pregnant and I didn't notice? I'm slipping up... and sheesh, I know human life cycles are really quick compared to our own, but do your babies usually grow this fast...?\" <br>\r\n<br>\r\nEina sweatdropped. Bell looked bewildered. Aiz seemed faintly amused.<br>\r\n<br>\r\n\"Oh, yes,\" said the Kenki blithely. \"Terra here is a perfect mix of Bell and myself.\"<br>\r\n<br>\r\nLoki grimaced, and she looked uncertainly at Terra. <br>\r\n<br>\r\n\"Hnng... I can see the resemblance, yeah,\" she said. \"She's definitely got his rabbity looks.\"<br>\r\n<br>\r\n<i>'Rabbity?'</i> thought Bell.<br>\r\n<br>\r\n\"I think there's a misunderstanding here,\" said Eina. \"Terra isn't Aiz and Bell's child.\"<br>\r\n<br>\r\nLoki turned on Eina with a skeptical look. <br>\r\n<br>\r\n\"Do you really expect me to believe that?\" she said, gesturing to Terra. \"Just LOOK at her!\" <br>\r\n<br>\r\n\"Um, yes,\" said Eina, perplexed and a little uncertain. \"Er, it's the truth. Sahara-san, could you explain?\"<br>\r\n<br>\r\nThe mummy looked up from Eina's plate, which she had swiped and emptied during the half-elf's brief exchange. Her mouth still full with the last of Eina's meal, she grinned cheekily, a mischievous gleam in her eyes.<br>\r\n<br>\r\n\"Well, when a man and a woman love each other <i>very much</i>...\" she began.</span></div></div>",
            "created":1470978000,
            "id":2195068,
            "title":"She assumes Terra is Aiz and Bell's daughter"
        },
        "1111113123113312":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Lyu names an exorbitant figure",
                "Lyu says, \"A date with Syr.\"",
                "Aiz offers to cover it in exchange for a favor"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't lie, Sahara!\" said Syr, her face very pink. \"Aiz and Bell-kun haven't... er, they don't have any children. They're not even dating.\"<br>\r\n<br>\r\nShe paused at this, collecting herself, and sent a curious look at the pair as if to say <i>You AREN'T, right?</i><br>\r\n<br>\r\nBell sputtered, but he nodded in the affirmative. Aiz confirmed this as well a moment later, her expression a tad sullen.<br>\r\n<br>\r\nLoki seemed to deflate, though she still looked at Terra a little suspiciously.<br>\r\n<br>\r\n\"So you say... but if that's the case, then whose kid is she?\"<br>\r\n<br>\r\n\"No one's,\" said the blonde. \"I'm a summon.\"<br>\r\n<br>\r\nLoki blinked.<br>\r\n<br>\r\n\"A summon,\" the goddess parroted, as if testing the word out on her tongue. \"Oh. Okay. So that means...\" She turned, her expression bright and enthusiastic once more. \"...my lovely Aiz is still pure and unsullied!\"<br>\r\n<br>\r\nAnd with this exclamation the goddess once more sprang at Aiz. But this time the blonde ducked, and instead of glomping her favorite human's chest Loki was propelled by her leap straight past to Bell and Terra. Her body knocked the golem out of Bell's lap, and she landed with her face planted squarely between the adventurer's legs. <br>\r\n<br>\r\nThere was a long, pregnant silence. Bell looked down at Loki, his face as red as the goddess's hair, his body tense as a bowstring drawn nigh to snapping. Loki was stock still, as if frozen by mortification, her shorts-clad posterior sticking up comically in the air.<br>\r\n<br>\r\nThen a massive stone fist threw Loki bodily through the table, smashing it and sending their dishes crashing down. Terra, the crack in her neck reopened and widened by an almost worrying degree, moved herself back into Bell's lap, her face once more impassive.<br>\r\n<br>\r\nLyu looked down at the wreckage caused by the diminutive summon's sudden attack, and at the unconscious form of the goddess, Loki.<br>\r\n<br>\r\n\"You know you'll have to pay for that, right?\" said the retired adventurer. Syr nodded.<br>\r\n<br>\r\nBell paled.<br>\r\n<br>\r\n\"Er... how much?\" he asked worriedly, his recent earnings suddenly seeming very insubstantial.</span></div></div>",
            "created":1470978000,
            "id":2195075,
            "title":"Syr protests this with a blush"
        },
        "11111131231133122":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Uh, I can't answer that!",
                "Yes",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Lyu looked at Bell as she said to him, \"Searching for you was a favor to Syr. Vouching for you about Lord Hermes's peeping was a favor to you. You can repay that favor with either a date with Syr or paying the table?\"<br>\r\n<br>\r\nThe aforementioned waitress let out a surprised meep as she blushed. She looked at Bell and gave him a puppy dog pout. And just like a house made of straw, he fell down, \"Uh, a date will do.\"<br>\r\n<br>\r\nSyr's face became the very definition of a rose. Chloe the cat animal person meowed as she could practically see the steam coming out of Syr's ears. Chloe smiled as she then said landing on Syr's back, \"Oh, is meow going on a daaate!\"<br>\r\n<br>\r\nLyu shot a glare at Chloe as she leaped back with an eep. Aiz looked at Syr and then at Terra. She stood up looking at Bell, \"...Bell, date me as well.\"<br>\r\n<br>\r\nHis eyes wide Bell gains a red face and Sahara smiles bemusedly, \"Oh, master, such the player.\"<br>\r\n<br>\r\nTerra said matter of factly, \"Summoner will not be sleeping peacefully. He will be dreaming of all the girls.\"<br>\r\n<br>\r\nWith Syr running to the ladies room to collect herself Aiz returned to her seat. Eina asked after looking at the watch, \"So, what are the other summonings?\"<br>\r\n<br>\r\nSahara sighed disappointed that all the romance was over with now, \"Honestly, it's not our place to reveal the summonings other than their names. But, what I can tell you is. That we were created by the minor god Okayado. The god that created us did so to create a popular hero. The popular hero was named Kimihito and had six popular summons. And we are his failures.\"<br>\r\n<br>\r\nBell had shock come to his face. Sahara laughed as she then said to him, \"Well, looks like we need to go.\"<br>\r\n<br>\r\nTerra said rather matter of factly, \"We are being called back. The others are upset at us. We'll be back soon.\"<br>\r\n<br>\r\nThe pair popped into clouds of smoke. Bell coughed as he said looking for them, \"Where did they go?\"<br>\r\n<br>\r\nAiz stated something that shocked him, \"...Do often think of what our future child would look like?\"</span></div></div>",
            "created":1470978000,
            "id":2195080,
            "title":"Lyu says, \"A date with Syr.\""
        },
        "111111312311331221":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Hestia answers the door ",
                "Bell answers",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell replied rather embarrassed with a red face, \"Uh, I can't answer that!\"<br>\r\n<br>\r\nBell dropped his bag of valis as he ran out of the Hostess of Fertility.  Aiz looked a bit sad, but remember Terra's words.  She knew that Bell liked her and for now that was enough.  Besides, she had a date with him to prepare for.  <br>\r\n<br>\r\nEina picked up the valis bag as she said to Aiz, \"As his advisor, I'll return this to him.  I hope that your date goes well.\"<br>\r\n<br>\r\nAiz looked at Eina before she opened her mouth, \"...I too hope that your date with him goes well when it happens.  I'll request Tione and Tiona's help in picking something out nice for the date.\"<br>\r\n<br>\r\n----In the back with Mia----<br>\r\n<br>\r\nMia spied on the situation as she then wrote in a magic book the events.  The page had the ink disappear and have ink appear soon after.  <i>Excellent, my little rabbit is going to be well entertained.  And hopefully, he'll only grow brighter.  I am intrigued by this new magic, find out more.- F.</i><br>\r\n<br>\r\n----At the Guild----<br>\r\n<br>\r\nEina was called into her superior's office.  Eina reported as a member of the guild.  The superior was a black lab animal person.  His ears perked up and then flopped down as he said clearing his throat while holding the papers of Bell Cranell's file, \"Eina, the record holder is becoming more and more interesting.  It currently is in the guild's best interest to have him be direct contracted and chronicled.  His own accounts and the accounts of others can no longer hold up his file.  We smell something fishy going on.  And so, we are directing you to be apart of the Hestia Familia.\"<br>\r\n<br>\r\nEina gasped as she looked at the papers placed in front of her.  Her superior told her looking straight into her eyes as calmly as he could, \"From today onward you are a Chronicler and Dungeon Advisor with field duty.  Meaning, you will be going into the dungeon.\"<br>\r\n<br>\r\nEina looked somewhat fearful as she then calmed herself.  She pulled the paper up as she said to the man, \"Understood.  And these papers will make sure I get a Falna from Hestia?\"<br>\r\n<br>\r\nHer superior gave a short nod, \"Yes, if she refuses then she'll have to pay the entire debt of 30,000 valis she owes Hephaestus and she'll have to face having Bell Cranell being black listed.  If she wishes to avoid these things, she'll have to give you a falna.\"<br>\r\n<br>\r\nEina did not feel comfortable with this, but these were orders from the Guild.  She walked out of the office and arrived at the Hestia Familia's house.  She held her breath as she knocked on the secret door under the church.  </span></div></div>",
            "created":1470978000,
            "id":2195081,
            "title":"Uh, I can't answer that!"
        },
        "1111113123113312211":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Yes",
                "Loki knocks on the door angry about Aiz dating Bell",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Eina sat on the sofa as Hestia looked over the papers.  She was not happy about being forced to accept a new child into her Familia, especially one that liked Bell so much.  But, at the same time, the very threats she was getting were making her worried.  And the papers did mention that her main job would be to observe Bell for whoever was mysteriously pulling the strings.  Making him slay a minotaur or learn a magic from a Grimoire and the attack from several black robed attackers.  <br>\r\n<br>\r\nHestia sighed as she said to Eina grabbing a sewing kit, \"Very well, Eina.  You shall be the second member in my Familia.  You'll have to take off your shirt so I can give you a Falna.  But, try not to swing those sweater puppies in my face.  Just cause you are a bit bigger than me, doesn't mean you have to show off.\"<br>\r\n<br>\r\nBlushing at her new goddess's unusual mannerisms Eina did as she was told.  Eina laid on Hestia's bed with her tatas resting on the mattress.  Her back exposed to the small goddess, she felt the ichor drip on her back.  <br>\r\n<br>\r\nHestia placed a paper on Eina's back.  Pulling the paper off she hands the paper and glasses to the half elf.  Eina looked at the paper as she read it to herself.<br>\r\n<br>\r\n<br>\r\n<span class=\"clred\"><b>Level 1 Strength: I 0    Defense: I 0    Utility: I 0    Agility: I 0    Magic: I 0</b></span><br>\r\n<br>\r\n<span class=\"cred\"><b>Magic []</b></span><br>\r\n<br>\r\n<span class=\"cmaroon\"><b>Skill Healers Desire, Hippocrates- Healing Touch when emotion is devotion</b></span><br>\r\n<br>\r\nEina asked curious, \"I already have a skill?  Really?\"<br>\r\n<br>\r\nHestia shrugged her shoulders as she told the older half elf, \"What can I say, you are in my Familia.  You all some how start with a skill.  I mean, forget I said anything.\"<br>\r\n<br>\r\nHestia threw her arms down as she said to her, \"Now, be happy that you are a child in my Familia now.  But, don't think that you can hog Bell.  He is my child and my child only.  Understand?\"<br>\r\n<br>\r\n<span class=\"cbgreen\"><i>Did Eina tell Hestia about Aiz and Syr's dates?</i></span></span></div></div>",
            "created":1470978000,
            "id":2195082,
            "title":"Hestia answers the door "
        },
        "11111131231133122111":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She wants a date with him before he goes on dates with the others",
                "She wants to supervise the dates",
                "She decides to have Eina spy on the dates, promising \"a very nice reward\""
            ],
            "content":"<div class=\"\"><div> <span>\"Does that include, uh, dating?\" Eina asked somewhat hesitantly. Her breasts mashed beneath her, and she shivered as the Falna sent new sensations through her body. <br>\r\n<br>\r\n\"Especially dating,\" said Hestia sharply. \"Why? You aren't planning to seduce him, are you?\"<br>\r\n<br>\r\nShe said this with more seriousness than jest, and Eina winced.<br>\r\n<br>\r\n\"N-No,\" she replied, not a lie but not entirely the truth, either. \"But, er... well, he is his own person, after all. If a girl asks him out...\"<br>\r\n<br>\r\nHestia frowned.<br>\r\n<br>\r\n\"Who asked him out?\"<br>\r\n<br>\r\n\"No one,\" Eina said a little too quickly.<br>\r\n<br>\r\nHestia was silent. She pressed her knees into Eina's sides, causing the half-elf to wince. Her chest felt squashed and she was having a little trouble breathing with Hestia atop her. <br>\r\n<br>\r\n\"Okay,\" Eina said, a little stressed. \"So maybe he has dates with Syr and Aiz. But the first is just to pay for damages at the Hostess of Fertility, and the second... well, er.\"<br>\r\n<br>\r\nHestia did not lose her temper as Eina would have expected. She did not declaim or curse or sulk. Instead, Hestia patted her on the back like a dog that had fetched its master's slippers and earned a little praise. Eina blushed at this imagery and tried to pretend she hadn't thought that.<br>\r\n<br>\r\n\"I see,\" said Hestia in a thoughtful tone. \"Thank you for telling me that. That deserves a treat.\"<br>\r\n<br>\r\n\"Um... should I ask what sort?\"<br>\r\n<br>\r\n\"Not if you don't want me to spoil the surprise.\"<br>\r\n<br>\r\nDespite herself Eina thought of several absurd possibilities, many of them distinctly erotic in nature. Lying here, topless, with Hestia on her back was giving her all kinds of crazy ideas.<br>\r\n<br>\r\nHestia, for her part, was deep in thought of what to do about Bell's dates.</span></div></div>",
            "created":1470978000,
            "id":2195085,
            "title":"Eina Squeals"
        },
        "111111312311331221112":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Yes",
                "Tione and Tiona the Amazon twins interupt",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Hestia turned to the left and sat on Eina's butt while kicking her feet on the bet like she was on a porch swing.  Hestia said to the new child, \"Alright, well.  I want your first job for this Familia to supervise these dates.  No matter where they go.  If the Guild has sent you here to keep close to Bell, then these dates might just be a distraction from whoever has eyes on my child.\"<br>\r\n<br>\r\nEina told the goddess not believing that whoever was manipulating Bell would use dates as a distraction, \"Understood, goddess.\"<br>\r\n<br>\r\n---------Aiz and Riveria Ljos Alf on the 26th floor----------<br>\r\n<br>\r\nAiz slashed at the Wooly Rhinoman cutting off it's head and seeing it's landform axe drop in the snow.  The Amazoness twins Tione and Tiona attacked at a pair of yetis.  And all Riveria could do was walked near Aiz asking the blonde, \"So, you made Bell go on a date with you.  And your logic is killing a Mammoth to gets it's drop items.  To make a new outfit for your date?  What kind of date do you think you're going on?\"<br>\r\n<br>\r\nAiz ducked under a Yeti's swing and thrust desperate her rapier into its chest.  The Yeti burst as it's magic stone was pierced.  Aiz looked back at Riveria as she heard the prize blow from it's trunk, \"What other kind of dates are there besides recreating your first encounter?  I read that it was romantic to recreate your first encounter.\"<br>\r\n<br>\r\nSighing Riveria placed her head on her head as she watched the Kenki race up to the Mammoth.  Leaping up at the mammoth she went in for the attack.  Hacking off it's ivory tusks making a pair of drop items.  And going for it's body next.  After slaying and cleaning the monster of it's magic stone which was the size of a woman's shoe.  Aiz picked up the Mammoth Fur and said to Riveria, \"It'll make a nice scarf or shaw.\"<br>\r\n<br>\r\nRiveria couldn't exactly argue with her logic.  With a shrug of her shoulders she said defeated, \"A very nice shaw.  What are the Mammoth Tusks going to be?\"<br>\r\n<br>\r\nAiz replied picking them up, \"...One will be my new sword, Snow White.  And the other will be a present.  For him.\"<br>\r\n<br>\r\nTione and Tiona just knew they were getting magic stones and drop items for money.  But, this whole mention of him did peak their interest.  </span></div></div>",
            "created":1470978000,
            "id":2195144,
            "title":"She wants to supervise the dates"
        },
        "1111113123113312211122":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She asks Tiona to help make an outfit",
                "She decides to stick with her original plan",
                "She asks for Reveria's advice"
            ],
            "content":"<div class=\"\"><div> <span>\"Ehhh?\" said Tiona Hiryute, her voice betraying a sound of amusement. \"Did you say you're getting a gift for Argonaut-kin?\"<br>\r\n<br>\r\n\"Yes,\" said Aiz, not missing a beat. \"I am. I have a date with him.\"<br>\r\n<br>\r\n\"Congratulations, Aiz,\" said Tione, the elder of the Hiryute sisters. \"You like Bell a lot, don't you?\"<br>\r\n<br>\r\nAiz did not answer this. Her cheeks seemed to color the tiniest bit. For Aiz this was a world of reaction, and both Tiona and Tione noted this with interest. Reveria simply smiled. <br>\r\n<br>\r\n\"Clearly so, if she's going to this much effort.\"<br>\r\n<br>\r\nAiz cocked her head.<br>\r\n<br>\r\n\"This is the least I could do,\" she said. \"Anything less than my best would be dishonest.\"<br>\r\n<br>\r\nTiona grinned wolfishly. <br>\r\n<br>\r\n\"He won't be able to keep his hands off you,\" she said appraisingly. \"I could give you some fashion tips, Aiz. I know how to drive Orario men wild.\"<br>\r\n<br>\r\nAiz surveyed Tiona with a sidelong glance. She took in the amazon's revealing manner of dress, noting how the girl eyed the swatch of fur she'd harvested from the mammoth.<br>\r\n<br>\r\nTione interjected softly but firmly.<br>\r\n<br>\r\n\"I don't think amazon-style is what Aiz has in mind.\"<br>\r\n<br>\r\n\"She'd wear it real well, though!\" <br>\r\n<br>\r\nReveria sweat dropped. <br>\r\n<br>\r\nAiz cocked her head as if seriously considering.</span></div></div>",
            "created":1471064400,
            "id":2195388,
            "title":"Tione and Tiona the Amazon twins interupt"
        },
        "11111131231133122111222":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Eina explains to Bell after something embarrassing happens.",
                "Hestia walks in",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>She told Tiona after considering it, \"No, we're going to the 17th level to fight Minotaurs and have a reminiscence of our first meeting. It'll throw off my battle style, wearing such little armor.\"<br>\r\n<br>\r\nTiona blinked a few times as she said to her, \"Wait, you're serious about going to the dungeon on your date?  I thought you were kidding.\"<br>\r\n<br>\r\nTione nodded in agreement, \"I agree, the dungeon is no place for a date.\"<br>\r\n<br>\r\nAiz looked sullen not being able to recreate her and the little rookie's special meeting.  Reveria spoke soon after, \"While notmally that'd be the case.  In this case, he has Aiz.  And Aiz's best wooing strategies is to impress him with her skill and grace.  Aiz's social behavior is best in the dungeon and so is Bell's.  They will be a bit too busy trying to stay alive to make things awkward with each other.\"<br>\r\n<br>\r\nShrugging their shoulders the Amazons agreed.  This brought a small smile to Aiz's lips.<br>\r\n<br>\r\n----------The next morning at the Hestia Familia----------<br>\r\n<br>\r\nBell woke up from the kitchen table with a stir.  He had came in last night and didn't want to disturb Hestia with noise.  And the sofa was taken by somebody.  It had been too dark to tell who it was, so he just sat at the kitchen table to get some sleep.<br>\r\n</span></div></div>",
            "created":1471064400,
            "id":2195496,
            "title":"She decides to stick with her original plan"
        },
        "111111312311331221112221":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "He's a little disappointed ",
                "He doesn't mind",
                "More the merrier"
            ],
            "content":"<div class=\"\"><div> <span>Bell drifted quickly off to sleep, seated at the kitchen table. It was dark and quiet and he felt enormously exhausted. His head was hazy and he felt faint and leaden with weariness.<br>\r\n<br>\r\nHe dozed off. He slept. <br>\r\n<br>\r\nUntil suddenly he realized, bleary and stupid-feeling in the aftermath of waking, perceiving a sudden soft weight on his lap and a strong case of morning wood, that he had been woken up by someone sitting on his lap. <br>\r\n<br>\r\nIt was dark still, but in an early morning sort of way, and if he squinted he just make out the modestly curvy form of a certain familiar half elf frozen stiff in sudden understanding of where she had just sat and what that stiff thing poking her backside was.<br>\r\n<br>\r\n\"Eina?\" said Bell drowsily. \"Why are you sitting on my lap?\"<br>\r\n<br>\r\nEina was silent. Even through the gloom he could see the erubescent glow of her cheeks. Finally she answered.<br>\r\n<br>\r\n\"I didn't see you.\"<br>\r\n<br>\r\n\"Oh,\" said Bell weakly. There was a pause. \"Are you--?\"<br>\r\n<br>\r\nEmbarrassed Eina swiftly rose from Bell's lap.<br>\r\n<br>\r\n\"I hope you have fun on your dates.\" She blurted this out.<br>\r\n<br>\r\nBell stared, perplexed. This was an incongruous thing to say, he thought. Especially after she had just been sitting on his lap, a glass of juice spilled on the table in her initial shock at feeling a body and a rigid, throbbing rod underneath her.<br>\r\n<br>\r\n\"Um, thanks?\"<br>\r\n<br>\r\n\"It's not like Hestia has asked me to supervise your dates. I d-don't plan on interfering,\" she said in an emphatically, falsely cheerful voice.<br>\r\n<br>\r\nBell blinked. Eina was beet red and avoiding his eye. He got the impression now that this wasn't just because his pecker had been rising to greet the morning beneath her fully covered full moon.<br>\r\n<br>\r\nA beat.<br>\r\n<br>\r\n\"Okay,\" Bell said. That's... uh... nice of you.\"<br>\r\n<br>\r\nEina blushed harder.<br>\r\n<br>\r\n\"I'm sorry,\" she said. \"I told Hestia about your dates and now she's telling me to<i>chaperone</i> you. I've ruined your dates before they've even started, haven't I?\"<br>\r\n<br>\r\nBell thought for a moment before answering.<br>\r\n</span></div></div>",
            "created":1471064400,
            "id":2195529,
            "title":"Eina's Embarrassment "
        },
        "1111113123113312211122213":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Bell: Congrats",
                "Bell: huh!?",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell smiled at her as he said to her happy, \"Well, after what the Goddess has ordered I feel more relieved.  The more the merrier.\"<br>\r\n<br>\r\nEina perplexed by this went and sat in a third guest chair that the Hestia Familia had in case of Lilly visited.  She began to eat her waffles with steamed broccoli and side of boiled egg.  She listened to him choosing that maybe he just needed someone to listen.  Bell told her focusing on the table cloth's white floor pattern, \"When Aiz asked me out, I felt a grip in my chest.  I was nervous.  And it might help to have an acquaintance there to help make sure we are safe.  I'd hate for the attention I've attracted to be bothersome for her.  After what Mord did in Rivira I don't seem to trust most of the adventurers.\"<br>\r\n<br>\r\nBell looked up as he asked her confused, \"Wait, why are you here this early?  And why are you here at all?\"<br>\r\n<br>\r\nEina had to admit to herself that she was a bit sullen that she didn't get welcomed by Bell.  But, she supposed from his point of view, this was the home of him and the goddess.  No one else was allowed here unless if they joined the Familia.  And that thought brought a smile to her lips as she said deciding to hold back the info of watching him to herself, \"I'm a member of the Familia, Bell.  I'm your new healer!\"</span></div></div>",
            "created":1471064400,
            "id":2195552,
            "title":"More the merrier"
        },
        "11111131231133122111222132":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Bell: Of course, uh, I didn't know we were dressing up",
                "Eina pokes her head out from behind Bell",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell looked perplexed and then dropped his jaw asking with brows raised, “Huh?!  Why did you leave the Guild?”<br>\r\n<br>\r\nEina told Bell with a small smirk, “Well, I was worried about you in the Dungeon going on adventures all the time.  And if I remember correctly, I tell you all the time.  That Adventurers shouldn’t have adventures.  And you’ve been going on adventures ever since I can remember five months ago.  All and all, I’m joining to make sure you don’t have any adventures.”<br>\r\n<br>\r\nBell sweat dropped as he gave a nervous chuckle, “Yeah, it’s not like I did it on purpose.  I’m just trying to catch up to my idol.”<br>\r\n<br>\r\nEina asked with a smile, “So, who is this idol?”<br>\r\n<br>\r\nBell replied to her grabbing up several items of his equipment, “Well, let’s not pay attention to that for now.  If you’re going to be a member of the dungeon crawling party, then we’ll need to get you some equipment.  Welf did send a note saying he’s still outside of town.  So, it looks like we’ll be going with Lilly.”<br>\r\n<br>\r\nA soft knock was heard as Bell stood up and said to Eina, “Looks like she’s here.”<br>\r\n<br>\r\nBell opened the door to see Lilly standing there without her bag.  She had her Ciderella spell activated showing her having a pair of werewolf ears and a tail.  The brown hair and fur made her appear rather exotic.  She soon smiled at how Bell was looking at her green tank top with blue skirt, “Thank you, Mr. Bell for liking my outfit.”<br>\r\n<br>\r\n</span></div></div>",
            "created":1471150800,
            "id":2195702,
            "title":"Bell: huh!?"
        },
        "111111312311331221112221321":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "These will be fine",
                "She should change her clothes",
                "She asks if Eina shouldn't also change with her"
            ],
            "content":"<div class=\"\"><div> <span>\"Eh? Oh, uh, right,\" Bell said, blushing to realize that he had been staring. \"Um, Lilly just didn't know we were dressing up for this.\"<br>\r\n<br>\r\n\"For what?\" the prum queried. \"Lilly just came here to see you, Mr. Bell.\"<br>\r\n<br>\r\nBell frowned, bemused. <br>\r\n<br>\r\n\"Well, I'd just been telling Eina that we should go into the dungeon and get her some equipment...\" he said, shrugging vaguely.<br>\r\n<br>\r\n\"The guild desk clerk?\" said Lilly, perplexed.<br>\r\n<br>\r\n\"My advisor,\" Bell said. \"Formerly. But she's a member of Hestia Familia now. A healer, apparently.\"<br>\r\n<br>\r\nLilly cocked her head, the expression seeming most adorably canine with her disguise.<br>\r\n<br>\r\n\"Oh,\" she said. She peered around Bell's back and spied Eina standing a little uncertainly behind him. \"That's useful.\"<br>\r\n<br>\r\nHer eyes didn't seem to match the spoken sentiment. They held a glint of challenge and defiance.<br>\r\n<br>\r\nEina met Lilly's gaze evenly. <br>\r\n<br>\r\n\"I like your clothes,\" she said, ever the diplomat.<br>\r\n<br>\r\nLilly cocked her head.<br>\r\n<br>\r\n\"They aren't adventuring clothes,\" she said. \"Though Lilly don't wear armor anyways.\"<br>\r\n<br>\r\n\"Do you want to change your clothes before we go?\" Bell asked.<br>\r\n<br>\r\nLilly looked at him thoughtfully. She considered her skirt, and the sort of nimble, agility-based movements she used in combat, zigzagging and jumping and backflips. Then looked again at Bell and smiled.</span></div></div>",
            "created":1471150800,
            "id":2195785,
            "title":"Bell: Of course, uh, I didn't know we were ..."
        },
        "1111113123113312211122213211":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Lilly started to flirt pointedly with Bell",
                "They crossed paths with Aiz",
                "A surprisingly high level monster appeared "
            ],
            "content":"<div class=\"\"><div> <span>\"These will be fine,\" she said. \"Lilly don't need armor if Mr. Bell is there to protect Lilly.\"<br>\r\n<br>\r\n\"And we're going there so I can get equipment in the first place,\" Eina said. \"So I don't have anything to change into.\"<br>\r\n<br>\r\nBell looked from one girl to the other. He felt strangely as though a contest of will and cunning had just taken place. Then he nodded.<br>\r\n<br>\r\n\"Well, if we're all ready we might as well go now.\"<br>\r\n<br>\r\nBoth Eina and Lilly nodded.<br>\r\n<br>\r\n... ... ...<br>\r\n<br>\r\nThe first level of the dungeon was safest, with Eina's low status and almost zero equipment. A few rookies looked in awe at THE Rookie as he and Lilly easily dispatched the weak monsters inhabiting the level. <br>\r\n<br>\r\nIt was fairly uneventful for a while. Bell carved through giant rats while Lilly shot down cave bats. Once or twice they came across lone newbies who were in trouble. Bell saved them from the base level enemies without breaking a sweat, and Eina applied first aid where possible. <br>\r\n<br>\r\nThe young adventurers all looked at Bell with admiration and even awe. There were a couple girls whom he rescued in such a manner, but he hardly seemed to notice their blushingly spoken thanks. <br>\r\n<br>\r\nLilly collected magic cores and rudimentary mat drops from the monsters as they worked their way in a circuit through the dungeon. A few times Eina had to duck away from a sweeping bat or dodge a lunging rat. She acquired a couple slight scratches in this manner, but no monster that attacked her once got a chance to do so again. Bell made sure of that.<br>\r\n<br>\r\nEventually they were making their way for the exit when...</span></div></div>",
            "created":1471150800,
            "id":2195803,
            "title":"These will be fine"
        },
        "11111131231133122111222132113":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "No time for that now",
                "Bell dashes around to attack the monster",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Mia stood with Ottar and Allen Fromel behind a stone pillar.  Ottar had a large casket slung over his back by a chain.  His tusks moved with his snort as he put the casket down.  Mia nodded as she moved out of the way.  Allen took his spear to the latch as he said to the other two, \"I don't like how Lady Freya is paying so much attention to this newbie.  And just to test his new magic?\"<br>\r\n<br>\r\nThe casket opened as a tiger headed monster walked out.  Growling he monster let it's human hands wrap around a pair of wands.  The wands were given to it by Allen.  Mia told Allen with a smile, \"If he can defeat this Rakshasa from level 25th, then he'll gain a new magic.  And that magic might make him so powerful, that he'll rival Lyu or Ottar.\"<br>\r\n<br>\r\nOttar glared as he said to Mia, \"The mistress will test him against me when the Little Rookie gets to my level, level 9.\"<br>\r\n<br>\r\nThe Rakshasa growled as a piece of cloth was placed in front of it's nose.  It's eyes sharpened as it locked onto Bell's scent and glared at the white haired boy with red eyes.  <br>\r\n<br>\r\nSprinting forth the Rakshasa roared as it swung it's left arm aiming the wand.  From the wand came a stream of water and shot forth at Bell.  Lilly detected the attack and said to Bell, \"Mr. Bell duck!\"<br>\r\n<br>\r\nBell's eyes widen as he fell to the ground dodging the water shot.  Pulling his baselard out from his back waist known as Drahoine.  His right right hand shot forth as he shouted at the Rakshasa, \"Firebolt!\"<br>\r\n<br>\r\nElectric fire flowed from his hand and struck the tiger headed monster.  The fire dispersed with the wave of the right wand.  The wind made a funnel that soon gathered stones to chuck at the three.  Lilly used her bow rifle to fire at the Rakshasa.  The arrows flew at it's legs and stabbed into the ankles of the monster.<br>\r\n<br>\r\nEina was unarmed and just hid as best as she could.  Bell reached for his shorted minotan dagger, Ushiwakamaru.  Pulling out the crimson blade he said handing it to Eina, \"Here, for your protection Ms. Eina.\"<br>\r\n<br>\r\nEina nodded as she held it in front of her.  Bell switched his baselard to his right hand as he threw up his left hand.  A green light appeared as he said with a shout, \"Summon Sahara!\"<br>\r\n<br>\r\nAppearing above Bell in the air was the mummy summoning.  With a smile and a bounce of her breasts Sahara said throwing her left hand, \"Sand Tsunami!\"<br>\r\n<br>\r\nSand came out of the Dunegon floor.  It gathered in a wave and blanketed the field.  Several level one adventurers were swept up by the sand.  Bell shouted at Sahara in a voice of alert, \"Sahara, try not to sweep away the adventurers.  We need to get them to safety.\"<br>\r\n<br>\r\nSahara landed on sand as ice pillars shot up through the sand.  She looked at them as she said with a smile, \"Ice is just frozen water.  And for a girl that is always thirsty and hungry, I'll have my fill thank you.\"<br>\r\n<br>\r\nScarabs crawl from her bandages and go after the ice shards.  She then said as wind flew in explosions, \"Summon Piper, she'll be able get the by standers.\"<br>\r\n<br>\r\nBell threw his palm in front of him as he said summoning form his left hand a green light \"Summon Piper.\"<br>\r\n<br>\r\nFrom the green light appeared <a onclick=\"$('#dropNote1').toggle (200);\" style=\"cursor:pointer;color:#0000ff;\" title=\"\"><span style=\"text-decoration:underline;\">a Lamia with blue scales and blue hair</span> <span style=\"font-size:8pt;opacity:.75;text-decoration:none;\">▼</span></a><div id=\"dropNote1\" style=\"padding:0px;display:none;\"><a rel=\"nofollow\" href=\"https://66.media.tumblr.com/f51c4423d9448869b770b6e8d6bba18c/tumblr_oaeej4CLcc1u7d6ako7_250.jpg\" target=\"_blank\">https://66.media.tumblr.com/f51c4423d944...</a></div> .  Her gold eyes looked at all the adventures as she turned her head to Bell sighing, \"Do I have to fetch all these newbs?\"<br>\r\n<br>\r\nBell gave her a leveled look, \"Please, do this for me.\"<br>\r\n<br>\r\nBlushing and looking down Piper said to him with a sigh, \"Well, if you are going to say please.  Then I guess I can do it.  Geez, this is such a pain.\"<br>\r\n<br>\r\nHer pair of pony tails flew up and grew out wrapping around various adventurers's limbs.  The hair moved of it's own with not pulling of anything from Piper.  The hair pulled the adventurers up into the air above the sand.<br>\r\n<br>\r\nLilly looked perplexed as she asked pointing at the summons, \"Where did these girls come from?\"</span></div></div>",
            "created":1471150800,
            "id":2195997,
            "title":"A surprisingly high level monster appeared "
        },
        "111111312311331221112221321133":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lilly wants to know about the summonings",
                "Bell is relieved",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell ran along the sand as he leaped at the Rakhasa and went in for a stab with the baselard Drahoine.  A blast of wind came from one of the wands as the tiger headed monster roared.  Bell flew back with a flip as he said grabbing at his left forearm pulling out his Hestia Knife, \"Guh, got to slay this monster.\"<br>\r\n<br>\r\nEina went from behind her rock and walked around to the back of the monster.  She stayed hidden for now to try and give Bell some time.  The beasts roared as more goblins approached.  The goblins growled and the giant rats sneered as they went at the various adventurers.  Bell swung down and stabbed with his weapons at the monsters.  They all turned to ash as Bell was stabing their magic cores, only caring about defeating the Rakhasa with little to no bloodshed.  <br>\r\n<br>\r\nBell panted as he slayed another monster and threw his right hand in Eina's direction, \"Firebolt!\"<br>\r\n<br>\r\nThe fire engulfed the two of the goblin.  A giant rat stood between the Rakhasa and itself.  The fire burned the giant rat to cinders and licked at the Rakhasa's skin.  Water splashed the fire as Bell decided that he needed to change up tactics.  He threw his Hestia Knife with his left hand to slay a giant rat.  From his left hand came a green light, \"Summon Terra!\"<br>\r\n<br>\r\nFrom the green light came the small golem, Terra.  Her pyrite hair shook to the left as she turned on her right food.  Pulling her fist sent the very sand flying with the throw of a punch.  The punch was so strong that it sent the Rakhasa back and right on Eina's dagger.  Eina had snuckup to the monster hoping to slay it.  But the force of the punch made it's back land n the magic.  The crack of the magic stone could be heard from the Rakhasa.<br>\r\n<br>\r\nAsh fell from the body as the Rakhasa gasped and collapsed into earth and ash.  Enia just looked at the broken magic stone shards.  Freya's forces pulled out and left for their home.</span></div></div>",
            "created":1471150800,
            "id":2196017,
            "title":"Something else happens"
        },
        "1111113123113312211122213211331":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Let's buy Eina some armor and weapons now!",
                "Skip the buying armor scene and move onto Eina's new debut!",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Lilly gathered the last magic stone and said looking at Terra noticing that she looked like Aiz and Bell, \"Mr. Bell, what are these girls doing here?\"<br>\r\n<br>\r\nBell nervously scratched his cheek, \"Well, I learned a new magic known as Summon and I can now apparently summon ten allies.\"<br>\r\n<br>\r\nLilly glared as she said to him, \"Are they all girls?\"<br>\r\n<br>\r\nBell shrugged his shoulders not knowing the answer.  The image that flowed into Lilly's mind of Bell sitting on a throne with many bikini girls fanning him was interrupted by Terra.  Terra said to Lilly interrupting her thoughts, \"Pervert.\"<br>\r\n<br>\r\nHer tail whipped as she said with a growl, \"Hey, at least Lilly ain't jailbait.\"<br>\r\n<br>\r\n----------At the Hestia Familia Home---------<br>\r\n<br>\r\nHestia looked at the summonings as she said with a grumble looking at Terra, \"Why does he like her so much.\"<br>\r\n<br>\r\nHestia then said to Eina pointing at the bed, \"Alright, let's update your status.  We need to find out what magic you learned after slaying the Rakhasa.\"<br>\r\n<br>\r\nEina pulled off up her shirt as she went to the other room.  Bell blushed as he tried to avoid looking.  Lilly stood with him as she said to him tossing bags on the table, \"Let's sort out what we want to keep.\"<br>\r\n<br>\r\nEina was given a piece of paper soon after her status was updated.<br>\r\n<br>\r\n<br>\r\n<span class=\"clred\"><b>Level 1 Strength: I 24    Defense: I 2    Utility: I 5    Agility: I 12    Magic: I 3</b></span><br>\r\n<br>\r\n<span class=\"cred\"><b>Magic Trap Master Short Trap Long Duration Magic</b></span><br>\r\n<br>\r\n<span class=\"cmaroon\"><b>Skill Healers Desire, Hippocrates- Healing Touch when emotion is devotion</b></span><br>\r\n<br>\r\nEina looked at the paper as she had her shirt back on, \"I barely gained anything.  But, what is the magic spell?\"<br>\r\n<br>\r\nHestia looked at her as she said looking serious, \"That is a permanent trap production.  You can magically produce a trap for protection of yourself or your party.  They range from damage dealing to ensnaring the enemy.  When you feel the surge energy, the you are activating your magic.  Just let the incantation flow from your lips.\"<br>\r\n</span></div></div>",
            "created":1471150800,
            "id":2196051,
            "title":"Lilly wants to know about the summonings"
        },
        "11111131231133122111222132113312":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Aiz saw the battle. She walks up to arrange her date's time and place with Bell",
                "Bell and Eina go to meet with Syr for his date at the Hestia Familia home",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell walked with clanking metal boots and looked at the various monsters on the first floor.  Giant ferrets, goblins, raccoon folk, Kobolds and Dungeon Lizards giving the white haired adventurer their attention and killing intent.  Bell put his hands on his waist as he shook his head and side stepped.  Walking backwards he leaned his back on a rock pillar and said to the tall womanly figure covered by shadow, \"Ms. Eina, you are up.  I'll assist if I believe you need it.\"<br>\r\n<br>\r\nPushing up her glasses Eina walked foward wearing a blue hooded robe that went down to her waist.  A pair of daisy duke kakis were visible on her buttocks.  Covering her legs were a pair of long leg brown leather low heel stilettos.  Light plate mail was on her lower legs to protect from low ground attacks.  A silver belt was worn with blue magic strings connecting to small floating shields.  The belt was known as the Shieldabell, a moving shield that protected it's adventurer.  In her left hand was a onyx revolver with short barrel.  The chest sash she wore under her bosom around her robe held the revolver's bullets.<br>\r\n<br>\r\nEina pulled the hammer to the revolver back as she said taking aim of the monsters, \"Time to face your nightmare!\"<br>\r\n<br>\r\nLilly smirked as she stood back by Bell, \"Ms. Eina sure is fired up after having half a million valis spent on her gear.\"<br>\r\n<br>\r\nBell chuckled as he scratched his cheek nervously, \"Actually, it's a little more than that.  Basically, I had to pull a goddess moment and put in for a loan.  I'm currently 800,000 valis in debt in that gear.  I wanted to make sure Ms. Eina was well protected.\"<br>\r\n<br>\r\nLilly glared at him as she said to him, \"So, Ms. Eina gets new equipment and Lilly doesn't?\"<br>\r\n<br>\r\nBell laughed as he reached into his square pouch and said pulling out a green gem necklace, \"Actually, you do too.\"<br>\r\n<br>\r\nLilly's eyes sparkled at the magic enigma that Bell held out for her.  It was elegantly crafted as Bell said to her, \"Ms. Asfi did a favor for me to make this three powers necklace.  Once worn by it's owner, it will not work for anyone else.  It provides a weak shield to melee attacks allowing you more time to duck instead or make your counter attack be a few more seconds faster.  Its shield is made of energy that is made to absorb ranged attacks completely of any monster that is level three and below.  The third power is something called peerless sight.  She wouldn't tell me anything more than it allows the wearer to see what's most important no matter what.\"<br>\r\n<br>\r\nLilly took the necklace and pulled down her hood.  Pulling it over her head and placing it around her neck she fingered the green gems.  A blush graced her cheeks that was illuminated by the glowing green gem.  Her werewolf ears were laid back as her tail wagged back and forth kicking up dirt and stones from the dungeon floor.  She then leered at Bell as she said biting her lower lip, \"Mr. Bell, watch yourself.  Never know when this Werewolf prum will do more than fetch for you.\"<br>\r\n<br>\r\nBell guffawed confused, \"Huh?\"<br>\r\n<br>\r\nEina threw her arm out after shooting one of the monsters, \"<i>Craft yourself for your master a trap that will ensnare all!</i>\"<br>\r\n<br>\r\nThree seals of blue light appeared on the floor and exploded as soon as goblins and kobolds unknowingly stepped on them.  Dirt flew into the air as the monsters were burned into ash with their magic stones shattered.  Eina reloaded the bullets to her revolver with a speed loader.  Placing the chamber back into the gun she pulled the hammer and aimed at the approaching Dungeon Lizard.  She pulled on the trigger misplacing the lizard's left front leg and causing it to roar in pain.  Pulling the hammer a second time she shot the other front leg.  The monster groaned as it died letting out its last breath, just like all the other monsters.<br>\r\n<br>\r\nEina panted sweating as she said placing her small revolver into her robe's right bosom holster.  She wiped her brow with the back of her left forearm.  Swaying her head back she said after her eyes focused again, \"Whoa, a bit of mind down symptoms.  Well, Bell how was that?\"<br>\r\n<br>\r\nBell smiled as Lilly carved up the monsters digging their bodies for magic stones, \"Perfect.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1471410000,
            "id":2197021,
            "title":"Skip the buying armor scene and move onto Eina&..."
        },
        "111111312311331221112221321133122":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Bell reassures Syr that it will be fine",
                "Eina (falsely?) promises not to interfere",
                "Syr doesn't press the matter"
            ],
            "content":"<div class=\"\"><div> <span>Syr felt a little self-conscious as she fiddled with her skirt, looking at herself in a floor length mirror. She was dressed in clothes her friends had insisted were perfect for a date, but the shirt felt a little too close and the skirt a bit too short for her comfort. But then, Lyu and the others had promised that she would dazzle Bell with this get up.<br>\r\n<br>\r\n<i>\"He won't be able to keep his hands off mew~!\"</i> one had teased.<br>\r\n<br>\r\nShe could be believe that, looking at herself in the mirror. Strictly speaking it was hardly indecent or flashy, not at all very risque or suggestive. It was a slightly more revealing fashion than she was used to. Her legs felt practically naked.<br>\r\n<br>\r\nBut if it got Bell's attention, it would be worth a little embarrassment. Plenty of adventurers, both male and female, wore much less than this on a regular basis. If she wanted to get Bell to look at her specifically...<br>\r\n<br>\r\nSyr gulped. She heard a knock on her apartment door, and steeling her resolve she went to answer it. <br>\r\n<br>\r\n\"Hello, Bell--\" she started to say, before suddenly cutting off. She saw Bell there, it was true, and her heart skipped a beat at the sight of him. But she also saw Eina, the half-elf who had been Bell's guild adviser until very recently. She blinked, mildly bemused.<br>\r\n<br>\r\nEina blushed and did not look Syr in the eye.<br>\r\n<br>\r\n\"Don't mind me,\" the brunette said. \"I'm just here as a chaperone.\"<br>\r\n<br>\r\nSyr frowned minutely.<br>\r\n<br>\r\n<i>A... chaperone?</i> she thought.<br>\r\n<br>\r\n\"So you'll be following us on our date?\" she asked aloud.<br>\r\n<br>\r\nEina coughed sheepishly.</span></div></div>",
            "created":1471445940,
            "id":2197129,
            "title":"Picking up Syr"
        },
        "1111113123113312211122213211331221":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "They arrive at the Hestia Familia home",
                "Aiz spots them and decides to watch while in the shadows",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell smiled as he then gave a nervous laugh scratching his cheek, \"Well, you see.  The Goddess has requested this and I can not turn down the Goddess's wish.\"<br>\r\n<br>\r\nSighing Syr nods to this and then looks at Bell with a smile placing her hands on her hips.  Her body thrusts out a tad showing itself to him and an expectant look in her eyes.  Bell picks up the message as he says to her with a smile, \"Ah, Syr you sure do look great tonight.\"<br>\r\n<br>\r\nSyr smiled as she said relaxing and holding out her arm, \"Thank you.\"<br>\r\n<br>\r\nBell took Syr's hand a bit nervously as he began to walk with her down the road.  Syr scooted up to him taking his arm and pulling it around her back.  She rested his hand on her thigh as she went under his arm having the side of her bosom rub his chest.  She smiled as she said laying her head on his chest under his chin, \"This is the proper way to escort a lady.\"<br>\r\n<br>\r\nEina just starred red faced as she tried to remain dignified and calm.</span></div></div>",
            "created":1471471680,
            "id":2197285,
            "title":"Bell reassures Syr that it will be fine"
        },
        "11111131231133122111222132113312211":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Hestia worries about Bell on her bed",
                "Syr and Bell talk while they eat",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Bell and Syr arrived at the abandoned church with Eina in tow.  Syr looked quizzically at the church as she asked him, \"Uh, where and why are we here?\"<br>\r\n<br>\r\nBell used his free arm that wasn't wrapped around Syr's waist to scratched his cheek with a nervous laugh, \"Uh, this is where I live.\"<br>\r\n<br>\r\nSyr blinked in shock as she said abashed, \"Oh, sorry for asking like that.  So, we're having a home dinner?\"<br>\r\n<br>\r\nBell nodded as he told her with a small smile, \"Sorry, I don't have much money right now.\"<br>\r\n<br>\r\nSyr smiled as she turned her face to his cheek and rubbing his cheek with her nose, \"I'd rather have you here and not eating anything fancy, than to eat something fancy without you.  This is perfect.\"<br>\r\n<br>\r\nBell and Syr walked into the building via a secret door.  Eina followed them to the kitchen where Syr and Bell sat beside each other.  Syr looked at the bowl of salad in the middle of the wooden table.  A plate had potato puffs that were cheddar flavored.  A plate of bacon was the main dish for the pair’s date.<br>\r\n</span></div></div>",
            "created":1471673220,
            "id":2198491,
            "title":"They arrive at the Hestia Familia home"
        },
        "111111312311331221112221321133122112":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "\"Really?!\" Syr exclaims happily, Bell's going to get lucky for this",
                "\"No, I can't burden you with that, its too expensive.\"",
                "Some other answer"
            ],
            "content":"<div class=\"\"><div> <span>Syr smiled as she said to him, \"So, what kind of things do you like to do outside of the Dungeon?\"<br>\r\n<br>\r\nBell replied as he took a bite of salad, \"Well, I don't really do anything outside of the Dungeon.  I do look at the weapon shops, but I guess I do like to hang out with the Miach Familia.  Lord Miach and Naaza are very fun to hang out with.  They own a potion shop that is always nice to us.\"<br>\r\n<br>\r\nSyr leered as she thought that Naaza must be another rival not knowing that Naaza was in love with Lord Miach.  Syr bit into one of the potato puffs tasting the cheese and sour cream.  She hummed as she said biting the baked potato snack, \"This is delicious.\"<br>\r\n<br>\r\nBell nodded as he then asked her, \"So, what do you do on your off time?\"<br>\r\n<br>\r\nSyr smiled as she said to him, \"Well, I love to go to the plays.  Watching works such as the tales of Hercules or even watching the training of Achilles.  There's a new one coming out called the Day of Phthinoporon.  It's a play of a woman who is saved by a hero under an autumn tree.  And the leaves bath him in an amber light as he fends off a monster with an oak made axe.\"<br>\r\n<br>\r\nBell looked at her wonder filled eyes as he said to her, \"Want to go there for our next date?\"<br>\r\n<br>\r\nGasping Bell realized what he said without thinking, and waited for what Syr would say.</span></div></div>",
            "created":1471760580,
            "id":2198965,
            "title":"Syr and Bell talk while they eat"
        },
        "112":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Yes",
                "Plot Routes 1",
                "Plot Routes 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bell Cranell in an AU where Bell is an exterminator of pests/animals and downloads a mamano game based off MGE, MGQ and Okayado monster musume.  </span></div></span></div>",
            "created":1470718800,
            "id":2193802,
            "title":"Plot Routes 1"
        },
        "1121":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lich",
                "Enchinda",
                "Ignis"
            ],
            "content":"<div class=\"\"><div> <span>A white haired boy sat on his couch under a concrete bridge.  His white eyes looked at black phone with purple icons on the back of it.  The couch he sat on was on the ‘patio’ of his truck camper.  The truck that held the truck camper in its bed was a silver magic truck.<br>\r\n<br>\r\nHe opened the playstore on his phone that his room mate bought him.  He still looked at the icon at the top of the phone.  A hat with wings showing it was made by the Hermes Familia, specifically Asfi.  His room mate was the one who designed the new phone and got him, Bell, an early release.<br>\r\n<br>\r\nHis email popped open showing he had an email from Mia.  She was the brown haired short burly woman who ran the maid cafe down a few blocks from where Bell lived.  As the friendly, dungeon pest eliminating business owner of Little Rookie, he knew several of the local businesses.  The email suggested that he down load this new cell phone game called Mamano Go by Freya.<br>\r\n<br>\r\nThe playstore opened up as he typed in Mamano Go.  He downloaded the app as he heard his name be called.  He looked up and stood up from the couch.  He walked to the side to look up the window folded out.  <br>\r\n<br>\r\nA black haired short girl with blue eyes stood outside of the window.  She wore a white tank top that held her bosom nicely, “I’m getting ready, so don’t poke your head in.”<br>\r\n<br>\r\nBell nodded to his room mate as he said to her waving, “Not a problem.”<br>\r\n<br>\r\nBell opened the app to look at his phone.  The program showed three mamano that were out in front of him.  The three choices were the Lich, Enchinda and Ignis.  </span></div></div>",
            "created":1470718800,
            "id":2193808,
            "title":"Yes"
        },
        "1122":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Bell makes a poor decision",
                "Plot Routes 1",
                "Plot Routes 2"
            ],
            "content":"<div class=\"\"><div> <span>In the world of Danmachi spirits such as Salamanders, Undines, Luxes and Gnomes make items weaved with their magic in them.  And I've always wanted to make a few other spirits.  Like Genis make a geni item that will grant a single wish for the user.  Or like a shade's item which would allow better blending.  But, in this plot route, one of the girls is buying lingerie with a black collar made from a succubus.  A spirit of fertility and sex, unfortunately it's a bit tight on Bell.  And when he tries it on out of curiosity, he barely makes it fit.  But, the zipper is jammed and now, all the women in his life are trying to help me with his zipper.  Unfortunately, they're trying to help him with his pants zipper and not the black succubus fabric necklace zipper.  Poor Bell.</span></div></div>",
            "created":1470978000,
            "id":2195264,
            "title":"Oops Accident"
        },
        "11221":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "I will now make you into my boytoy",
                "I will make you feel good",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Tapping the bottom of papers in her hands Eina was finally done with her papers.  Misha ran up with her pink hair flapping and holding a coupon.  With a smile she said to Eina, \"Hey, thanks for all your help with that paper work about Rivira.  As thanks, I'm giving you this special coupon.  A buy one set of lingerie and get one Succubus Lace Item free.\"<br>\r\n<br>\r\nEina gasped as she said to Misha after looking everywhere, \"Why would you say that?  Even if the office is void of everyone but us.  You can't just offer someone a succubus lace coupon.\"<br>\r\n<br>\r\nSmiling Misha said to her with a confident smile, \"Listen, everyone knows that magic infused clothing will make the clothing emit an aura.  And Succubus aura will only make those that you desire to come after you.  Meaning that you'll finally get that man you've always wanted.  Whoever he may be.\"<br>\r\n<br>\r\nEina looked at the coupons a second time after thinking.  Closing her eyes and acting mature she said taking them, \"I'm only taking these because they are a means of compensation for my work.\"<br>\r\n<br>\r\n_____________The next day_______________<br>\r\n<br>\r\nEina rushed through the door to work with several pants.  Placing her hands on her knees she said bent over, \"Made it just in time.\"<br>\r\n<br>\r\nEina sat at her desk as she saw Bell walking up to window.  Panicked she reached into her purse to pull out the brown leather case.  Placing the case on her table she didn't notice that she dropped a black choker with a pink heart stitched in it.  The gold zipper glimmered in the shadows that casted over it.  <br>\r\n<br>\r\nEina counted the magic stones and placed a few valis into the tray.  Sliding the tray through the window Eina said with a smile, \"I hope you have a good day Bell.\"<br>\r\n<br>\r\nBell saw the valis and choker.  Thinking that perhaps it was a gift he gained a blush.  He accepted the gift as he said to her, \"Th-th-thank you.\"<br>\r\n<br>\r\nGasping Eina saw Bell lift the choker to his neck.  The zipper was a bit hard to fit, but Bell made it fit with just a bit more effort.  Pulling the zipper up he heard Eina told him with a hand on the window, \"No, Bell.  Don't zip it up.  Quickly, zip it off.\"<br>\r\n<br>\r\nBell attempted to do what he was told.  But, the zipper would not budge.  Eina looked as back as he could trying to pull on the zipper some more.<br>\r\n<br>\r\nWhat he didn't notice was Eina walking out from behind the window.  When he finally noticed her he said to her holding up his hands, \"I'm sorry Ms. Eina, I thought that this was a gift from you is all.  And I wanted to accept it like a man was all.  I'm trying my best to take it off, but I can't seem to.\"<br>\r\n<br>\r\nEina had a small smile on her lips as she said naughtily, \"At least I know you desire me, Bell.\"<br>\r\n<br>\r\nBell looked at her questioningly, \"Of course.\"<br>\r\n<br>\r\nEina smiled as she looked at him with a spark in her eye, \"You know, Succubus Lace only makes those that the wearer desires to desire them back. And now that I have a magnetic force pulling me to you.  Do you know what that means?\"<br>\r\n<br>\r\nBell shook his head as Eina said to him, \"It means...\"</span></div></div>",
            "created":1471064400,
            "id":2195372,
            "title":"Bell makes a poor decision"
        },
        "112212":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "He hesitates.long enough for Eina to start",
                "He gently pushes her away, saying they should figure out how to remove collar",
                "He accepts that Eina is sincere and trusts she's in her right mind"
            ],
            "content":"<div class=\"\"><div> <span>\"...that I want to make you feel <i>good</i>.\"<br>\r\n<br>\r\nBell gave her a somewhat bemused, faintly bewildered, and cautiously excited look.<br>\r\n<br>\r\n\"Feel good?\" he quizzically parroted.<br>\r\n<br>\r\nEina grabbed his hand and into a quiet, out-of-the-way alcove. When they were alone and unseen she leaned in close and whispered softly, sultrily.<br>\r\n<br>\r\n\"I like you, Bell. I liked you even before you put that succubus lace collar on. And now it's spell is on me. I feel it inside me, burning and throbbing and aching for your...\" She trailed off,smiling dreamily. \"It affects me, and that means you want me the way I want you. The spell proves it beyond my hopes.\"<br>\r\n<br>\r\nShe paused and slipped a hand down Bell's pants, fingers brushing his flaccid prick. Bell shivered.<br>\r\n<br>\r\n\"But this is just the magic talking, isn't it? I... I don't want to take advantage of you.\"<br>\r\n<br>\r\n\"What a <i>gentleman</i>,\".Eina purred. \"But don't tease me. I want this too much to hold back. I promise it's not just the magic. I want this for real. I love you, Bell.\"<br>\r\n<br>\r\nBell stared, frozen.</span></div></div>",
            "created":1471064400,
            "id":2195442,
            "title":"I will make you feel good"
        },
        "1122121":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lilly finds them, she too is drawn to Bell!",
                "Aiz stumbles onto the scene",
                "Eina draws sperm onto her clothing with a smile"
            ],
            "content":"<div class=\"\"><div> <span>Eina saw the hesitation that his face harbored with his flacid prick being fondled.  With a small smirk she licked her bottom lip as she let her eyes become half lidded making even more seductive.  Unzipping his zipper she licked his ear hiding his face from the public.  While they were in an alcove, the alcove still let some people view inside it from the right angle.  And Eina did not want to embarrass the poor rabbit.  Besides she was attending to his big rabbit's foot which was getting him lucky.<br>\r\n<br>\r\nEina mashed her breasts into his abs and did enjoy the fact that Bell had taken of his light weight plate mail before getting his money.  A moan emitted from his lips as Eina said licking his ear, \"Oh, it looks like I found a drop item.  I wonder if I should exchange it for valis or if I should I attempt to forge it?\"<br>\r\n<br>\r\nHearing a whimper Eina said sexily, \"Well, I'm not Hephaestus, but I'll forge something useful out of it.\"<br>\r\n<br>\r\nPrecum leaked out of his prick and slickened his shaft.  He may have been a bit on the small side.  Eina had seen bigger, but those who were bigger often just plastered their own pants.  At least Bell was holding out for her.  While she knew that she wasn't going to get some in her pussy right now, she was sure as heck going to make sure that Bell walked bow legged.<br>\r\n<br>\r\n </span></div></div>",
            "created":1471064400,
            "id":2195551,
            "title":"He hesitates.long enough for Eina to start"
        },
        "11221213":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lilly finds them, she too is drawn to Bell!",
                "Aiz stumbles onto the scene",
                "Hestia is wondering why Bell is late"
            ],
            "content":"<div class=\"\"><div> <span>Bell's face fell into her shoulder as she hugged him against the wall.  She held him up off the ground a bit and stroked him off.  He seemed so light in her grasp.  And the fact his red face was moving at the top of cleavage and moaning into it made Eina even more horny.  <br>\r\n<br>\r\nFeeling the moans on her breasts made Eina all the more happy.  She was being desired by her man and she was showing him the pleasures of the sexual world.  She had no clue why she wanted to wear that collar now.  She should have made him wear that collar from the beginning.  He was her pet rabbit and any girl she thought was good enough to have him.  After all, rabbits were known for their undying carnal exercises.<br>\r\n<br>\r\nBell quivered as he groaned and let his prick jet his white jizz.  The white hot liquid ran down Eina's pant leg.  Bell could feel Eina's saliva drip off his ear and down his neck like drool.  He was thoroughly ravaged and what surprised him was that he enjoyed it. </span></div></div>",
            "created":1471150800,
            "id":2196091,
            "title":"Eina draws sperm onto her clothing with a smile"
        },
        "112212131":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She slips down Bells trousers",
                "She undresses herself",
                "They find a more private place to do this"
            ],
            "content":"<div class=\"\"><div> <span>\"Bell-sama...?\" a soft voice drifted to Bell and Eina's ears. <br>\r\n<br>\r\nLillyruca Erde walked toward the alcove with wide eyes and a softly rosy face. She couldn't see the whole scene, but she could hardly miss the sight of Bell's face buried in Eina's chest. Moreover, she  felt a strange pull toward the scene.<br>\r\n<br>\r\nShe was drawn to them. She came quickly close and leaned in, a smell of something musky and appetizing filling her nose. She blushed, feeling deliciously faint.<br>\r\n<br>\r\nBell looked at Lilly, turning his face sideways in Eina's bosom. He smiled weakly at the girl, feeling tender between the legs. A shiver went down his spine. <br>\r\n<br>\r\n\"It's not what it looks like,\"  he said weakly.<br>\r\n<br>\r\n\"It looks like Eina's raping you,\" said Lilly, not sounding displeased. <br>\r\n<br>\r\nEina smiled. <br>\r\n<br>\r\n\"It's only rape if they don't want it.\"<br>\r\n<br>\r\nBell blushed.<br>\r\n<br>\r\nLilly smiled wider, and she came forward. A hand toyed with front of her shorts, slipping a zipper an inch down. She reached out to grab Bell's ass and squeezed, feeling firm buttocks through the fabric of his pants. He tensed and cutely whined.<br>\r\n<br>\r\n\"Is it rape if I do it to you, then, Bell-sama?\"<br>\r\n<br>\r\nShe reached around to touch the base of his dick. A pleased shudder went through Lilly's whole body. Bell too shuddered.<br>\r\n<br>\r\n\"Not if you want to,\" said Eina, her voice a chocolatey purr. \"If you want it, he wants it too.\"<br>\r\n<br>\r\nShe was skipping a few crucial steps in the reasoning process there, but Lilly seemed to find that reasonable.<br>\r\n<br>\r\n\"That's good,\" said Lilly. \"I want him bad.\"</span></div></div>",
            "created":1471237200,
            "id":2196275,
            "title":"Lilly finds them, she too is drawn to Bell!"
        },
        "1122121313":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "The two waitresses went to the love hotels!",
                "Syr and Lyu had to stay, so it's Eina and Lilly with Bell at the Love Hotels!",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Lilly moaned and blushed as she closed her eyes with heat.  Lilly stroked idlly the prick that was her favored Bell-sama.  With red cheeks and eyes that starred adoringly at the pink prick that had a dribble of semen leaking from it's slit, Lilly was memorized.  Eina smirked as she stroked her lovely Bell some more and heard him weakly cry as she then said hearing his need for more release, \"Let's get you to the love hotel district.\"<br>\r\n<br>\r\nBell whined pathetically, \"N-o-o.\"<br>\r\n<br>\r\nLilly smiled as she turned around and said tossing open her large bag which was empty currently with the exception of rope and bags of valis, \"Here, toss Bell-sama in here.  I'll carry him inside so we don't look suspicious.\"<br>\r\n<br>\r\nEina looked inside and said to the rope, \"Oh!  Well done Lilly.\"<br>\r\n<br>\r\nWrapping Bell up with the rope Eina hog tied the young adventurer and placed a emptied valies bag in his mouth.  Successfully gagging their hot delectable cargo until they arrived at their destination.  On their way to the love hotel district the pair passed by the Hostess of Fertility where Lyu and Syr spotted them.  The pair gained blushes for some reason and felt a large heat under their skirts.<br>\r\n<br>\r\n</span></div></div>",
            "created":1471410000,
            "id":2196996,
            "title":"They find a more private place to do this"
        },
        "11221213131":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "They buy a high end love hotel, Syr and Lyu join them",
                "They buy a cheap love hotel, Syr and Lyu are caught by Mia",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Using her Artel Assist Lilly carried her favorite adventurer on her back in her bag.  Her smile was rather giddy and Eina walked behind her hiding a smile with her hand.  Lyu and Syr saw the pair walk by them on their way to the Love Hotel district.  Syr blushed as she turned to Lyu, \"Uh, I have to go.\"<br>\r\n<br>\r\nLyu nodded as she said to her dropping her broom, \"I'll come with you.\"<br>\r\n<br>\r\nThe pair of waitresses snuck behind after the the guild member and supporter.  The four women arrived at the love hotel district.  Eina said to Lilly reaching into her bag, \"Let me get some money.\"<br>\r\n<br>\r\nEina looked inside as she saw Bell moan for her trying to plead with a bag in his mouth.  With a smile she said blowing a kiss to Bell as she stroked his hard prick with her other hand, \"Not now, Bell.\"<br>\r\n<br>\r\nShe grabbed a bag of valis and pulled out.  She closed the bag as she patted it and said after licking the semen smeared gloved hand, \"Got the money.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1471421280,
            "id":2197030,
            "title":"The two waitresses went to the love hotels!"
        },
        "112212131311":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Bell in bondage with Eina and Lilly ravishing him",
                "Lilly greedily fellating Bell while Eina ate her out",
                "Eina riding Bell while Lilly sucked her nipples"
            ],
            "content":"<div class=\"\"><div> <span>They moved quickly, not wasting time. Eina and Lilly entered a love hotel of some repute, and Syr and Lyu followed curiously, lustfully entranced behind them.<br>\r\n<br>\r\n\"I didn't know those two were so close,\" Syr remarked, blushing as Lyu led her past the desk clerk. \"That they'd be coming to a love hotel...\"<br>\r\n<br>\r\n\"We're with them,\" Lyu said to the clerk, gesturing in the direction Lilly and Eina had gone and tossing a noisily jingling bag of coins onto the desk. The clerk waved them on, handing Lyu a duplicate key and not asking any questions.<br>\r\n<br>\r\nTo Syr, Lyu then said. <br>\r\n<br>\r\n\"I don't know if it's just them. I sensed a... familiar presence among them. I think that's what's made us like this.\"<br>\r\n<br>\r\nShe rubbed a hand idly down the small of Syr's back, and the waitress shivered pleasurably.<br>\r\n<br>\r\n\"Nnn!\" Syr cutely gasped, her entire body tensing. \"A presence...?\"<br>\r\n<br>\r\n\"I recognize the feel of this,\" Lyu added, checking the number on the key as they headed for Lilly and Eina's room. \"I've felt it before. Mmm... does <i>succubus lace</i> mean anything to you?\"<br>\r\n<br>\r\nSyr shook her head, panting and blushing with one hand over her heart and another just below her navel.<br>\r\n<br>\r\n\"No? Well, that's fine,\" Lyu said, smirking minutely. \"All you need to know is that we're being drawn to someone who wants us. Sexually, that is.\"<br>\r\n<br>\r\nSyr blushed, and her eyes widened. The idea did not seem objectionable to her, though. It even seemed favorable. <br>\r\n<br>\r\nHer expression became a dreamy smile, and reaching the door the two waitresses unlocked it. Stepping inside, they saw...</span></div></div>",
            "created":1471447020,
            "id":2197138,
            "title":"At a high end love hotel"
        },
        "1122121313111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lilly, \"Why don't you join us?\"",
                "LIlly,\"Can we help you?\"",
                "Lilly, \"We're kinda busy here.\""
            ],
            "content":"<div class=\"\"><div> <span>Bell was on the bed with his prick standing up as he saw the naked bodies of Lilly and Eina.  He saw the pair grab a dildo each and opened the bottom of the dildo and inserted a small magic stone fragment inside. Closing the dildos the pair pressed a button on them having the dildos vibrate.  With smiles thy placed the dildos at each other's wet pussies as they kissed each other in front of Bell.  Bell starred as Eina pulled back her mouth lick Lilly's tongue before she dived back into her lips.  As the heated make out session got hotter the girls opened their eyes to give each other a nod.  The pair slipped the dildo in their hands into the pussy of the other girl.  With a squeal Lilly said feeling the vibrating from the magic stone powered dildo, \"Oh, Lilly feels so good.\"<br>\r\n<br>\r\nEina felt the dildo push her folds to the sides and nestle into her pussy.  She let the dildo sit in her pussy vibrating to pleasure her.  The pair looked to Bell's cock as they licked their lips.  Eina moved in with a shake her breasts as she weaved her head left and right.  Placing her breasts on both sides of his cock she smiled satisfactorily at Bell with a smile, \"Got me the perfect present didn't you?\"<br>\r\n<br>\r\nLilly crawled up beside Eina on her left and turned her body around.  She rested her dildo stuffed pussy on the chin of Bell.  Everytime Bell moved his head from breathing or swallowing the built up saliva, his chin tapped the dildo sticking outside of her pussy.  Lilly licked the purple prick between Eina's breasts with a smile.   That's when she saw Syr and Lyu standing there starring at the scene.</span></div></div>",
            "created":1471649100,
            "id":2198334,
            "title":"Bell in bondage with Eina and Lilly ravishing him"
        },
        "11221213131111":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "Bell comes in Lilly's mouth, on Eina's chest",
                "Bell begs them to let him fuck them",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Syr blushed liked her face had been lit on fire. She stared at the spectacle, the door closed firmly behind herself and Lyu, and idly wondered why she did not feel more surprised by what she saw. Lyu, for her part, was smiling.<br>\r\n<br>\r\n\"Hello,\" said Lilly, looking at the two waitresses as she bucked her hips into Bell's face and sucked his cock between Eina's tits. She slurped and smacked her lips on his rod, the noises sending shivers up Syr and Lyu's spines. \"Why don't you join us?\"<br>\r\n<br>\r\nSyr looked at Lyu. Lyu looked at Syr. Before either of them fully grasped what they were doing they had stripped of their clothes, and shortly after they went forward to the bed. Lyu wiggled her slim, pale hips, a tight and perky ass flexing as she crawled across the bed. Syr puffed out her chest and let her breasts sway bare, free of all restraint. <br>\r\n<br>\r\nLyu positioned her lips between Eina's legs, and she planted a brief kiss on the half-elf's clit. Eina shuddered pleasurably and squeezed her breasts convulsively together, making Bell gasp and buck his hips. Lilly squeaked, his cock pushing suddenly further into her mouth, but it was not an unpleasant experience. Indeed she blushed and moaned and pressed her mouth even farther down on Bell's manhood, panting. <br>\r\n<br>\r\nSyr whined and tried to find a place to fit. She nestled herself up next to Bell and, after a moment's thought, slipped a hand underneath him to grab his ass and squeeze it. She like how his buttocks felt in her hand, and she explored them further, gripping and groping without a care in the world. After a few minutes of this, she grew bolder and slipped a finger into his crack, up his anus. <br>\r\n<br>\r\nBell gasped.</span></div></div>",
            "created":1471709340,
            "id":2198658,
            "title":"Lilly, \"Why don't you join us?\""
        },
        "112212131311111":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Eina agrees and says that she'll pay her amount",
                "Lyu and Syr agree and give their weeks wages",
                "Bell manages to use his hero ability to escape the ropes and has sex"
            ],
            "content":"<div class=\"\"><div> <span>Bell's nose went up and bumped into Lilly's pussy pushing the magic dildo even further.  Lilly's eyes widen as Bell's cum splashed into her mouth giving her all sorts of flavor.  But, too much was blasting and some leaked out onto Eina's chest.  Pooling on Eina's bosom the half elf smiled at the white pool that showed her reflection.  Smiling she said with a hum to Lilly who gulped down the last mouthful of cum, \"I think we should trade out with Syr and Lyu.\"<br>\r\n<br>\r\nSyr moved forward after she pulled her finger out of Bell's bum.  Her breasts shook as she placed the cock into her breasts.  Lyu climbed up and began to lick Syr's nipples making the human blush and fidget.  She moved up to the prick that was sitting neatly between the breasts of her best friend and kissed it.  <br>\r\n<br>\r\nEina and moved until she laid Bell's head into her lap.  She looked down at him and smiled at his pleasure filled eyes.  She stroked the black lace collar with a pink heart and then moved her hands to his nipples under Syr's thighs.  Rubbing his nipples she took pride in seeing him try to fight the pleasure.<br>\r\n<br>\r\nLilly knew that as long as the collar was stuck that Bell would not have time to adventure into the Dungeon.  And yet, Bell and Hestia still had to pay off that massive debt from the Hestia Knife.  Plus, she'd have to make money too.  A smile came to her lips as she said to Eina getting dressed, \"Lilly is going to become Mr. Bell's pimp and get some paying girls like Ms. Aiz and Ms. Hestia to visit Mr. Bell.  And while Lilly is at it, she'll see if Lady Hephaestus will get rid of that debt that Mr. Bell is in for a bit of Mr. Bell's cock.\"</span></div></div>",
            "created":1471764420,
            "id":2198987,
            "title":"Bell comes in Lilly's mouth, on Eina's ..."
        },
        "12":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Lilly: Let's start the Game!",
                "Bell: huh?",
                "Eina: Yes, it should be a good game",
                "Aiz: The rules are simple",
                "Syr: After I make a plate for everyone, I am almost finished cooking"
            ],
            "content":"<div class=\"\"><div> <span><i>Mainly for the last chapter commission written by EvilFuzzy9 called <a onclick=\"$('#dropNote1').toggle (200);\" style=\"cursor:pointer;color:#0000ff;\" title=\"\"><span style=\"text-decoration:underline;\">Is it Wrong to have Five Girlfriends</span> <span style=\"font-size:8pt;opacity:.75;text-decoration:none;\">▼</span></a><div id=\"dropNote1\" style=\"padding:0px;display:none;\"><a rel=\"nofollow\" href=\"https://www.fanfiction.net/s/12066393/1/Is-It-Wrong-to-Have-Five-Girlfriends\" target=\"_blank\">https://www.fanfiction.net/s/12066393/1/...</a></div> ?</i><br>\r\n<br>\r\n-----------------------Main Story-----------------------<br>\r\n<br>\r\nBell was panting as he felt his prick being massaged by the half elf that sat beside him at the kitchen table.  He was currently in his new house with his five girlfriends: Eina, Aiz, Hestia, Syr and Lilly.  Hestia was busy changing into her usual outfit after her job at the Hephaestus weapons store.  And when Bell's eyes would not leave her body, Eina noticed his love muscle begin to stir.  Smiling at the loin cloth clad pecker the half elf decided to lavish it with attention.  Pop him once to prevent an all out orgy.  That was the plan at least, until he let out a moan.<br>\r\n<br>\r\nEveryone stopped what they were doing and turned to the half elf and boyfriend.  Syr at the stove looked with a lewd smile as she saw the shirtless boy aware of the fact that three days ago the girls had decided for the week that it would be kinky to forbid any clothing in the house on boys except for loin clothes.  Being out numbered made Bell's objections useless.<br>\r\n<br>\r\nLilly stopped counting her vals as she leered with a grin.  Seeing his slowly recuperating body finally catch it's breath from being stroked so mercilessly.   She loved seeing his halted from popping one off, almost as much as she loved seeing him recover from popping off one.<br>\r\n<br>\r\nAiz looked at Bell in her usual stotic passive face, only adding a slit smile.  She currently polished her sword and decided to tease Bell as his eyes finally landed on her.  She smiled a bit more and lowered her eye lids as she stroked the rapier in her hand with the white cloth rather suggestively.  <br>\r\n<br>\r\nHestia was the last one to look at Bell as she said with a lick of her lips as well as looking down on him from her short stature coming up with a devilish idea, \"Let's play a trendy new game with Bell.  I believe the mortals called it: Truth, Dare or Dirty Dare.\"</span></div></div>",
            "created":1473954840,
            "id":2210480,
            "title":"Plot Routes 2"
        },
        "121":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "\"Lick my pussy.\"",
                "\"Take off your clothes.\"",
                "\"Give Bell-kun a lap dance.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Ooh, let's start!\" Lilly said, her eyes lighting up in recognition. \"Lilly's heard about that.\"<br>\r\n<br>\r\nEina nodded in agreement with this sentiment, and Syr wrapped up her cooking with an eager smile. Hestia smirked at Aiz and the others, and all their eyes fell upon Bell, who flushed at their attentions and felt his manhood twitch. With the member fully engorged his loincloth was quite useless for concealment, and the girls leered appreciatively, doubtlessly congratulating themselves on their inspiration.<br>\r\n<br>\r\nBefore Bell knew what was happening, the six of them had sat down in a circle, and the rules had been briefly explained to him. It was pretty straightforward, all told, and honestly self-explanatory. He was a little anxious at the looks in the girls eyes, looks which suggested that for them <i>dirty dare</i> might as well have been the only option in this game. <br>\r\n<br>\r\nHe gulped and tried to pull the front of his loincloth the whole way down over his manhood. He might as well have been trying to cover a bull with a handkerchief, for all the effect this had. <br>\r\n<br>\r\n\"Since the game was my idea, I'll go first,\" Hestia said with a falsely humble air. <br>\r\n<br>\r\nNone of the other girls protested this, wanting simply to get the game started.<br>\r\n<br>\r\nIt was not long at all before Hestia's finger pointed out her target, or her eyes alighted on them. With a smile she looked at Lilliruca, who had been the first to express enthusiasm for the game. <br>\r\n<br>\r\n\"Well, Lilly?\" she asked, a slight touch of a sneer in her voice.<br>\r\n<br>\r\n\"Dirty dare,\" said the prum without missing a beat. <br>\r\n<br>\r\nNone of the others were surprised at her choice, or how quickly she made it. Hestia smiled.<br>\r\n<br>\r\n\"I see. Well, I dirty dare you to...\"</span></div></div>",
            "created":1473957000,
            "id":2210495,
            "title":"Lilly: Let's start the Game!"
        },
        "1213":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Hestia smiled as she leered dirtily at Bell, \"I see.  Well, I dirty dare you to give Bell-kun a lap dance until each of us has picked a dare or dirty dare.\"<br>\r\n<br>\r\nSquealing with a smile and closed eyes Lilly shook her hips side to side.  Prancing on over to Bell she swatted his hand from his prick as she said to Bell with an index finger pointing at him, \"No, Bell.  Lilly need to properly give you a lap dance as Hestia has dirty dared Lilly to do.\"<br>\r\n<br>\r\nLilly turned around and began to rub her booty on Bell's prick.  With a pleasured cry Bell snapped back his head as Lilly looked back at him wrapping her right arm back to drape around his neck.  Pulling him as forward as his spasming body could go to have her nose rub his neck sniffing it.  Whimpering more than Lilly did as a werewolf, Bell suffered through the pleasure of her precious posterior.  <br>\r\n<br>\r\nLilly smiled as she leered at Syr who ate some of her peppers and mild sausage mix, \"Syr:  Truth, Dare or Dirty Dare?\"<br>\r\n<br>\r\nSyr wanting to see Bell be danced on a little longer said with a smile, \"Truth.\"<br>\r\n<br>\r\nLilly seeing the truth widen her eyes and closed them half way again licking her lips, \"What is your favorite sex act to do to Bell?\"</span></div></div>",
            "created":1473958020,
            "id":2210499,
            "title":"\"Give Bell-kun a lap dance.\""
        },
        "12131":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Come back later",
                "Come back later",
                "Come back later"
            ],
            "content":"<div class=\"\"><div> <span>Syr acually blushed!  Averting her gaze suddenly acting all shy she said admitting, \"I like to give him a foot job sometimes.\"<br>\r\n<br>\r\nFlustered she said throwing her arms to her sides, \"But, only to pleasure him.  Not that I want to dominate him or anything!\"<br>\r\n<br>\r\n(To be editted later when I get back from work)</span></div></div>",
            "created":1474036800,
            "id":2210841,
            "title":"Reader's Choice"
        },
        "12132":{
            "author_id":"evilfuzzy9",
            "author_name":"EvilFuzzy9",
            "choices":[
                "She did a strip tease",
                "She took her clothes off normally",
                "She tossed Bell her underwear"
            ],
            "content":"<div class=\"\"><div> <span>\"Well... I guess I like it when he licks me down there,\" said Syr, blushing softly and putting a hand to her cheek. \"I like it even better when I can do that for him at the same time.\"<br>\r\n<br>\r\nAiz gently and briefly applauded this declaration, her lips twitching into a momentary smile. Lilly sniggered, continuing to grind her posterior in Bell's lap, teasing his erection with her buttocks. Eina nodded assent with Syr's sentiment, and Hestia whistled wolfishly.<br>\r\n<br>\r\nBell blushed immensely, squirming a little under their gazes, and also under Lilly's pert rump. <br>\r\n<br>\r\nSyr, still a touch pink, turned to Hestia. <br>\r\n<br>\r\n\"Truth, dare, or dirty dare?\" she asked.<br>\r\n<br>\r\n\"Dirty dare, of course,\" said Hestia, smiling at Bell and watching amusedly how he writhed and shivered from Lilly's eager lap dance. <br>\r\n<br>\r\nSyr clasped her hands and smiled innocently.<br>\r\n<br>\r\n\"Take off your clothes, then.\"<br>\r\n<br>\r\n\"What's so dirty about that?\" asked Hestia, smirking. \"But you can't give me a different one now. Oh well.\"<br>\r\n<br>\r\nSaying this...</span></div></div>",
            "created":1474149420,
            "id":2211276,
            "title":"69"
        },
        "121322":{
            "author_id":"m-2mousecyborg",
            "author_name":"FlashWally22",
            "choices":[
                "Bell sticks his boner in her pussy",
                "Bell sticks his boner in her mouth",
                "Bell begs for her to stroke his boner"
            ],
            "content":"<div class=\"\"><div> <span>Hestia pulled off all her clothes as if normally.  Hestia asked Eina with a evil smile, \"Eina, Truth, Dare or Dirty Dare?\"<br>\r\n<br>\r\nEina smiled as she said proud, \"Dare please.\"<br>\r\n<br>\r\nHestia grinned as she said to her rubbing her hands together, \"I dare you to always pick Bell.\"<br>\r\n<br>\r\nNodding Eina then looked to Bell's red face as he felt Lilly dance her supple bum on his prick.  She laid an arm on his shoulder as she gave him a side hug into her breasts.  With a smile she asked him seductively, \"Bell.  Truth, Dare or Dirty Dare?\"<br>\r\n<br>\r\nBell moaned as his prick came on Lilly's lower back.  The Pallum mewled as Bell told Eina, \"Truth.\"<br>\r\n<br>\r\nEina whispered into his ear with a smile, \"What form do you like best on Lilly?\"<br>\r\n<br>\r\nLilly froze as she too wanted to listen to Bell's turn ons.  Bell whimpered as he spoke, \"I kinda miss Lilly's dog ears and tail when she turned into a werewolf.\"<br>\r\n<br>\r\nBlushing Lilly went back to her task rubbing Bell's prick with her butt.  Bell moaned as he picked Syr, \"Syr.  Truth, Dare or Dirty Dare.\"<br>\r\n<br>\r\nSyr blushed as she said not wanting to reveal any more secrets, \"Dare.\"<br>\r\n<br>\r\nBell moaned as he replied to her feeling himself get hard again, \"I dare you to pick dirty dare when one of the girl's picks you.\"<br>\r\n<br>\r\nSyr blushed as she began to see Bell's lust take over.  She then looked to Aiz, \"Aiz.  Truth, Dare or Dirty Dare?\"<br>\r\n<br>\r\nAiz smiled as she told her, \"Dirty Dare.\"<br>\r\n<br>\r\nSyr leaned in now over her embarrassment from before, \"I dirty dare you to french kiss Bell whenever he cums.\"<br>\r\n<br>\r\nSmiling Aiz nodded as she saw Bell cum a second time with a moan.  Aiz walked over with a shake of her heads as she stroked his head with her hand.  She lowered down and kissed him.  Licking his lips for enterance she was granted so and took hold of his head.  Her tongue lathered his in pleasure as he mewled pathetically feeling like he was being dominated.<br>\r\n<br>\r\nPulling away Aiz then looked to Lilly who stopped lap dancing, \"Lilly.  Truth, Dare or Dirty Dare?\"<br>\r\n<br>\r\nLilly smiled as she said to the kenki, \"Dirty Dare.\"<br>\r\n<br>\r\nAiz replied to her with just the hint of a smile, \"I dirty dare you to transform into a werewolf and beg for some bone.\"<br>\r\n<br>\r\nLilly blushed as she used her cinderella magic to change into a werewolf.  Sprouting a bushy tail and ears that reacted to her horny emotions.  Pulling off her shorts she moved her mouth and said with lust, \"Lilly is begging for some bone.\"</span></div></div>",
            "created":1474838820,
            "id":2214588,
            "title":"She took her clothes off normally"
        }
    },
    "info":{
        "author_id":"m-2mousecyborg",
        "author_name":"FlashWally22",
        "brief_description":"Set after volume five when Bell with the help of Rivara's adventurers slayed the goliath.",
        "created":1470774900,
        "description":"<td align=\"left\" class=\"norm\">All routes must be set after Bell has slayed the black goliath on floor 18 at the end of volume 5 or the end of the anime.  Unless if it's on the free reign route, which will have basically free reign, unless if I the author deem it terrible and request you to copy and paste all your parts, so they are saved before I delete them.<br>\r\n<br>\r\nRules: The creator has the ultimate decision to delete any adds to the story.<br>\r\nDo not kill Bell Cranell outside of the free reign route<br>\r\nKeep all harem owning OCs in the free reign route<br>\r\n<br>\r\nThis is a fanfiction of Danmachi which is owned by Fujino Omori.  I do not own Danmachi and this is the disclaimer basically.</td>",
        "id":2092919,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1474838820,
        "modified":1474838820,
        "pretty_title":"Bell's After Volume 5 Adventures"
    }
}