{
    "chapters":{
        "1":{
            "author_id":"luigi626",
            "author_name":"AppleBottomJ",
            "choices":[
                "A clothes drawer",
                "A Laundry room",
                "A clothing store",
                "A Bathroom",
                "Somewhere Dark..."
            ],
            "content":"<div class=\"\"><div> <span>You are a high school student entering your senior year.  Everything has seemed completely normal in your life so far.  Like most high school boys, you find yourself often fantasizing about the girls in your classes.  You take any chance you can to see up one of their skirts, or to catch a glimpse of their panties sticking out of their jeans.  You would also take any chance possible to be close to their feet as they sit in class.  Any time you were over at a girl's house, you would look in the laundry room for everything from used socks, to sports bras, to panties and thongs.  If you really stop to think about you were quite the pervert.  You would look at not only the high school girls, but moms, teachers, and really any girl.<br>\r\n<br>\r\nOne day you are involved in a car accident and quickly die from it.  Death, however, is not at all what you expected.  It turns out that all the crazy things you have heard about reincarnation are true, or at least mostly true.  The only difference is that as a cruel punishment for how perverted you were in life, you are going to be reincarnated as an object to be used by the women you so often drooled over.<br>\r\n<br>\r\nWhere do you find yourself \"waking up\" after the reincarnation is complete?</span></div></div>",
            "created":1315026000,
            "id":1180105,
            "title":"From school to death"
        },
        "11":{
            "author_id":"luigi626",
            "author_name":"AppleBottomJ",
            "choices":[
                "Panties",
                "Socks",
                "Bras",
                "Thongs",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself suddenly alive, but unable to move. It appears that all of your senses are still working, you just have no control over movement.  At this point it is difficult to tell where your mouth, nose, or any senses are coming from exactly.  You start to look around to figure out where the heck you are.<br>\r\n<br>\r\nAfter a quick look around, it appears you are in someone's dresser drawer.  The drawer is cracked just slightly, from the looks of things you are surrounded by... (and thus must be)</span></div></div>",
            "created":1315026000,
            "id":1180107,
            "title":"A clothes drawer"
        },
        "111":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Your Crush",
                "Family Member",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly realise that you've become one of your favourite things! A pair of panties!<br>\r\n<br>\r\nYou try to look at yourself and from what you can make out, you're a stretchy purple pair.<br>\r\nSuddenly, the draw starts to open and you discover that your owner is...</span></div></div>",
            "created":1503982800,
            "id":2376812,
            "title":"Panties"
        },
        "1112":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Your Sister, Rebecca",
                "Your Mother, Pauline"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can tell it's someone from your family, but who?</span></div></span></div>",
            "created":1503982800,
            "id":2376821,
            "title":"Family Member"
        },
        "112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "18 year old girl",
                "16 year old girl",
                "17 year old girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are surrounded by socks, so you deduce that you must be, too. Of all the pieces of clothing, why socks!?<br>\r\n<br>\r\nThe drawer opened, and from the look of things, it's a...</span></div></span></div>",
            "created":1402894800,
            "id":1813105,
            "title":"Socks"
        },
        "1122":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Beatiful",
                "Gross",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The drawer opens and the grell light blocked your vision. A hand grabbed you and as you saw the face of the girl she was..</span></div></span></div>",
            "created":1568178000,
            "id":2716756,
            "title":"16 year old girl"
        },
        "11222":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Her converse sneaker",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>The first thing that you noticed was her horrible acne. She looked down at you as you saw her large glasses and her braces. She was not pretty in any way. Her hair was wavy but bound into a ponytail. The light got reflected by her oily hair. She sat down as you got lowered to her feet. She had long unpainted toenails and gigantic feet. She didn't hesitate to put her feet in you. The feeling was unpleasant to say the least. It felt like her entire feet entered your mouth. The sole made contact with your tongue as she continued putting you on. She pulls you up and you stayed in that uncomfortable situation.<br>\r\n<br>\r\nShe stood up putting the weight of her entire body on you. It didnt hurt as bad as you thought but it was still unnatural. She makes her way to her shoes as she decides to wear</span></div></div>",
            "created":1568350800,
            "id":2717695,
            "title":"Gross"
        },
        "113":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "BRA",
                "training bra",
                "plus size bra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of bra</span></div></span></div>",
            "created":1435640400,
            "id":2001058,
            "title":"Bras"
        },
        "1131":{
            "author_id":"erigs435",
            "author_name":"Erids",
            "choices":[
                "Your 13 year old cousin",
                "Your 50 year old aunt",
                "Your 16 year old friend Madi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are bras all around you.You look around and you feel yourself movi,g forward. the draw is opening.You panic as you see your naked girl.Who is it.</span></div></span></div>",
            "created":1447736400,
            "id":2063630,
            "title":"BRA"
        },
        "11311":{
            "author_id":"me.91",
            "author_name":"Redpandagamer",
            "choices":[
                "She grabs you",
                "she grabs a different bra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You seeYour 13 year old cousin naked in front of you and she reaches down in the drawer.</span></div></span></div>",
            "created":1603416300,
            "id":2927167,
            "title":"Your 13 year old cousin"
        },
        "113111":{
            "author_id":"me.91",
            "author_name":"Redpandagamer",
            "choices":[
                "Puts you on",
                "Drops you on the floor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She takes you out and puts you on. Then she</span></div></span></div>",
            "created":1603416420,
            "id":2927170,
            "title":"She grabs you"
        },
        "115":{
            "author_id":"greenicedragon",
            "author_name":"G-Dragon",
            "choices":[
                "Cloth Diaper",
                "Skirt",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what are you?</span></div></span></div>",
            "created":1411621200,
            "id":1861956,
            "title":"Other"
        },
        "1153":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Stockings",
                "A dildo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you </span></div></span></div>",
            "created":1491022800,
            "id":2298017,
            "title":"Other"
        },
        "11532":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "A family member ",
                "Someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You where a Dillon that a girl has hidden in her dresser  suddenly the dresser  pops open to reveal the face of  who<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1491022800,
            "id":2298022,
            "title":"A dildo"
        },
        "115321":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Francine ",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was it Francine  your 14 year old little sister <br>\r\nA chubby needy girl with freckles and braces </span></div></span></div>",
            "created":1491022800,
            "id":2298023,
            "title":"A family member "
        },
        "12":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "A shirt",
                "Pants",
                "Underwear",
                "Panties",
                "Sock"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Optioons...</span></div></span></div>",
            "created":1411362000,
            "id":1860472,
            "title":"A Laundry room"
        },
        "124":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Inside Front",
                "Inside Rear",
                "Outside Front"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a woman’s pair of panties, sitting at the bottom of her empty laundry hamper. Is your face on the inside front, the inside rear or the outside front of her panties?</span></div></span></div>",
            "created":1508821200,
            "id":2405833,
            "title":"Panties"
        },
        "1242":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "A Voluptuous Ass",
                "Bad Gas",
                "Swamp Ass"
            ],
            "content":"<div class=\"\"><div> <span>You are a pair of yellow panties with black polka dots. You lay in wait at the bottom of a woman’s laundry hamper but suddenly a load of the woman’s dirty clothes is dropped on you. All you can smell is musty old sweat and slightly dampened clothes covering you. They weighed tonnes compared to you, and another pair of her panties was laying right on top of you. It smelled like the woman’s anus and vagina. You just hoped that wasn’t what you’d be smelling like eventually. After an hour of being compressed under the woman’s mistreated undergarments, you are loaded into the washing machine with the rest of the clothes. In darkness you spin as you are washed clean and rinsed with water. Another hour later, you are hung up embarrassingly on a clothes line, for all the world to see. A woman’s pair of bright yellow panties with black polka dots, swinging in the wind as the woman’s neighbours check you out. The cool wind sends shivers down your drenched body. Three hours of watching the woman’s backyard later, and you’re taken off the clothes line, and tossed into her panty drawer. A few other pairs of panties are laid over you, sealing you in her panty prison, and diminishing all hope you had of getting worn soon. The next morning, the woman is getting dressed and she specifically reaches for you in her panty drawer. It is now that you realise this woman has...</span></div></div>",
            "created":1508821200,
            "id":2405845,
            "title":"Inside Rear"
        },
        "12422":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Decides to have Mexican for lunch",
                "Does squats as part of her morning exercise"
            ],
            "content":"<div class=\"\"><div> <span>You could smell her the thick and potent, eggy fart linger across the room as the woman stretches you out beneath her before stepping her feet through your leg-holes. Looking up you can see the woman’s ass and vagina. <br>\r\n<br>\r\nShe tugs you nonchalantly up towards her fat, bare ass until your face is resting comfortably outside of her buttcrack. <br>\r\n* PBRT*<br>\r\nA small fart is exhausted into your face from the depths of her buttcrack. It was like an appetiser, signifying more to come. <br>\r\nThe woman puts on a pair of jeans, bending over to pull them on tightly enough. This causes your face to be wedged deeply between her buttcheeks. You could nearly see her butthole now.<br>\r\n*PBBBRRT*<br>\r\nHer jeans acted like a blanket, encasing you in the humidity of her dense and smelly gas excretion. Being blasted in the face at point blank with the only choice being to sniff it all up is the most humiliating thing you’ve ever experienced.<br>\r\nThe woman then...</span></div></div>",
            "created":1509080400,
            "id":2407160,
            "title":"Bad Gas"
        },
        "124222":{
            "author_id":"varal",
            "author_name":"Varal",
            "choices":[
                "Goes to the kitchen",
                "Going for a walk"
            ],
            "content":"<div class=\"\"><div> <span>Having decided to exercise, the woman begins to squat.<br>\r\n You still have hope that it won't lead to a fart. <br>\r\nAfter three sit-UPS, you hear a rumbling in your stomach. <br>\r\nThe ass begins to unclench strangely in response to the rumbling. <br>\r\nYou are already prepared for suffering,but to your surprise, the woman's sphincter is very tightly compressed. <br>\r\nThe woman abruptly stopped on the fourth squatting<br>\r\n and ran.  <br>\r\n\"Damn, damn,\" - came the woman's voice. <br>\r\nTogether with the opening of the door, the woman's ass began to unclench. <br>\r\n You realized that this is a bathroom. <br>\r\nWith the opening of the anus, you suddenly realize that the woman took you off. You heard a splash of water It was close,you realize how dangerous the situation was.<br>\r\nAfter a while, the woman finished her business and began to dress you.</span></div></div>",
            "created":1593786240,
            "id":2860837,
            "title":"Does squats as part of her morning exercise"
        },
        "125":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "A mom came in to collect you",
                "A girl walked in searching for socks",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>You woke up hanging upside down. Your whole body felt wet and cold. You looked around seeing all sorts of clothes. On your left you saw a giant sock that was the same size as you. You tried to move with no avail. Next thing you do tried to scream but again nothing happened. After a while you finally figured out what you are. You were a sock! You couldn't believe it yourself at first but it just made sense.<br>\r\n<br>\r\nYou hang for hours. You already got dry. Suddenly the door swung open and..</span></div></div>",
            "created":1571288400,
            "id":2734417,
            "title":"Sock"
        },
        "1252":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "1.Danielle",
                "2.kelly",
                "3.other girl"
            ],
            "content":"<div class=\"\"><div> <span>A girl walked in and it was...<br>\r\n<br>\r\n1. Danielle 19. Blue hair, black hoodie, very skinny. Didn't seem to care much about things<br>\r\n<br>\r\n2. Kelly 17.  Brown hair, brown eyes, was a bit chubby, wears jogging pants and a sport bra.<br>\r\n<br>\r\n3. Another girl.</span></div></div>",
            "created":1571288400,
            "id":2734418,
            "title":"A girl walked in searching for socks"
        },
        "12522":{
            "author_id":"me.91",
            "author_name":"Redpandagamer",
            "choices":[
                "Rest break. She will start again soon.",
                "She's home."
            ],
            "content":"<div class=\"\"><div> <span>Kelly walked in and put you on then she put a pair of shoes on and went out foe a jog. After a while (you lost track of the time) her sock started to fill with her sweat and the smell was horrendous she kept running for a while longer while you were soaked in sweat and eventually stopped because...</span></div></div>",
            "created":1603417080,
            "id":2927175,
            "title":"2.kelly"
        },
        "12523":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Hannah",
                "Isabel",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hannah: 16 year old, short, glasses, average weight.<br>\r\n<br>\r\nIsabel: 17 year old, tall, glasses, skinny.</span></div></span></div>",
            "created":1571288400,
            "id":2734528,
            "title":"3.other girl"
        },
        "13":{
            "author_id":"luigi626",
            "author_name":"AppleBottomJ",
            "choices":[
                "Lingerie Store",
                "Shoe Store",
                "Sex Shop",
                "Pants store",
                "A large department store"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly wake up after your car accident.  You appear to have all of your senses still, but your body feels weird.  Not every sense seems to be coming from the same play it always did.  Upon further inspection, you find yourself completely unable to move. You begin to panic and look around to get familiar with your surroundings.<br>\r\n<br>\r\nIt seems that you are now in some sort of clothing store at your local mall.  There are several female shoppers around, but you still have no idea what kind of store you are in.  You realize that you must have need reincarnated at an item in the store.  Curious what sort of item you must be, you look to the front of the shop and read the name.<br>\r\n<br>\r\nYou discover to your horror that you are in a...</span></div></div>",
            "created":1315026000,
            "id":1180108,
            "title":"A clothing store"
        },
        "131":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Large Bra",
                "Plus Size Panties",
                "Thong"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You use your limited vision to look around the room and read in big pink letters on the wall 'Victoria's Secret' you groan as you examine the objects next to you and see that you are now a </span></div></span></div>",
            "created":1435554000,
            "id":2000906,
            "title":"Lingerie Store"
        },
        "132":{
            "author_id":"lilipoot",
            "author_name":"lilipoot",
            "choices":[
                "Extra long lasting running shoes",
                "Ballet style slippers, with built in odor eaters",
                "Super warm Ugg boots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize with horror that you are in the local women's shoe store! All the girls from school shop here, and unfortunately for you, you see you are part of the display of...</span></div></span></div>",
            "created":1316840400,
            "id":1193725,
            "title":"Shoe Store"
        },
        "1321":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "You smaller sister nadine",
                "Your school friend clair",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Extra long lasting running shoes<br>\r\n<br>\r\nYou were horrified to see this. You tried to move and scream but nothing happened. You didnt want to be someones running shoes.<br>\r\n<br>\r\nSuddenly a girl was standing infront of you. You couldn't believe your eyes because it was...</span></div></div>",
            "created":1566622800,
            "id":2706850,
            "title":"Extra long lasting running shoes"
        },
        "1322":{
            "author_id":"longcharles93",
            "author_name":"Charles Jacob Long",
            "choices":[
                "Your mother, Sandra and little brother, Ted."
            ],
            "content":"<div class=\"\"><div> <span>the ballet style slippers, with built in odor eaters.<br>\r\n<br>\r\nYou screamed, but no sound came out of you.<br>\r\n<br>\r\nNobody can even hear you scream if you could scream, but you can't.<br>\r\n<br>\r\nSuddenly, an attractive female walked towards the display you were in.<br>\r\n<br>\r\nShe was a black raven-haired woman with hazel eyes who had the natural looks of an attractive goddess.<br>\r\n<br>\r\nRight next to her was a small boy.<br>\r\n<br>\r\nYou were in shock because it was...</span></div></div>",
            "created":1492750800,
            "id":2308652,
            "title":"Ballet style slippers, with built in odor eaters"
        },
        "1323":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Long big black leather boots",
                "Warm uggs",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uggs or another kind of shoe.?</span></div></span></div>",
            "created":1566709200,
            "id":2707468,
            "title":"Super warm Ugg boots"
        },
        "135":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "An Insole",
                "cheap knockoff panties",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were in a large department store. You could hear the people talking and walking all around you. <br>\r\n<br>\r\nYou realized that you were</span></div></span></div>",
            "created":1566968400,
            "id":2709298,
            "title":"A large department store"
        },
        "1352":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Nilu 16, asian",
                "Michelle. 16. ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could see a sign above you \"panties\" was written on it. \"That must mean im a pair of panties...WHY\" you thought. Before you noticed there was already a girl standing infront of you</span></div></span></div>",
            "created":1566968400,
            "id":2709301,
            "title":"cheap knockoff panties"
        },
        "13521":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Went back to the changing room to wear you",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>The girl was gigantic in comparison to you. She was a bit chubby and had long black hair. She squats down and looked straight at you. \"Hmm i take this one. Its even 50% off\" she said as she grabbed you. \"But i need to try it on.\" She said as she grabbed you.<br>\r\n<br>\r\nYou screamed for attention but she proceeds to walk towards the next changing room. She stepped in and places you onto a chair. She took her jeans off revealing her bare ass. The panties were unable to see as they were swollowed by her big asscheeks. She took her panties off and then grabbed you.<br>\r\n<br>\r\nYou were panicing as she puts one foot already inside of you. You looked up seeing he privat part and ass. You knew that you didnt want to be up there but she already put her other foot in. She slides you up to your eventual doom. She fully puts you on and snapped you into place. Your\"face\" was right against her ass. The first thing you noticed was the sweat. Her ass was very very sweaty due to her jeans probably. The smell wasnt as bad as he thought but he was still scared.\"please dont take me. Please dont take me\" was the only thought you had and then she said \"it looks so perfect and fits wonderful i take it!\" She slides you down and then puts her old clothes back on<br>\r\n<br>\r\nShe went to the checkout and payed for you\"that would be 7.50$\" said the worker. \"Wow my life is 7.50$worth how cheap\" you tought. Nilu then..</span></div></div>",
            "created":1566968400,
            "id":2709305,
            "title":"Nilu 16, asian"
        },
        "1353":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "A pillow",
                "Nail polish",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You were...</span></div></span></div>",
            "created":1570165200,
            "id":2727936,
            "title":"Others"
        },
        "14":{
            "choices":[
                "a tube of lipstick",
                "a towel",
                "a toilet",
                "a roll of tissue paper",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In this Bathroom, you are...<br>\r\n</span></div></span></div>",
            "created":1338008400,
            "id":1345937,
            "title":"A Bathroom"
        },
        "143":{
            "author_id":"piney1",
            "author_name":"Pinetree",
            "choices":[
                "Your at someone’s house",
                "Your at a school",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You look around and try to figure out where you are as it does not look familiar. The flooring is a few grey stone tiles in a diagonal checkerboard design. The walls were very basic smooth paint in a very light blue shade. On the left was a porcelain claw foot bathtub with a curtain rod that was painted gold and matching feet and a pedestal sink to the right. As you are looking you notice something is missing but you don’t know what then it snaps you realize what is missing. After figuring it out you hear the door opening and closing afterwards. You look and to your surprise stood a beautiful girl like you have once seen in your dreams. She had auburn colored hair going down with part of the hair covering some of her one eye. She had mascara applied to her luscious mocha brown eyes and her lips were covered with rose red delicately applied lipstick. She had a average size for breasts save for her bottom. She was wearing a blue sweater vest with a argyle design. Under that she was wearing a black skirt with a pair of red high heels. You couldn’t believe what you were seeing but what you thought was a dream quickly turned into a nightmare. You saw her approaching you and down around. She began to lower her skirt and her undergarments and begin to sit on you. You felt the pressure of her bottom being pushed on you and then you felt a horribly salty taste enter your mouth as she was releasing her stream of urine into what would be your mouth. You see her grab some paper and begin to wipe herself dropping it in you. You felt your energy become dull as she hit the handle to flush you but you gained the energy back within a couple minutes. You see her leave and you wonder what place you are in. </span></div></div>",
            "created":1568350800,
            "id":2717721,
            "title":"a toilet"
        },
        "1433":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "Taco Bell toilet",
                "Mall toilet",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you </span></div></span></div>",
            "created":1594869600,
            "id":2869426,
            "title":"Other"
        },
        "144":{
            "author_id":"skullofmyfoe",
            "author_name":"Max",
            "choices":[
                "sit down on the toilet",
                "walk over to you, wanting to blow her nose",
                "Your Choice"
            ],
            "content":"<div class=\"\"><div> <span>As you slowly regain consciousness, you take a look around at your surroundings. It's clear your in a bathroom, but you certainly didn't recognize it. After getting your bearing's straight, you notice your position. You were suspended in the air, not that far from a large, white toilet. Everything seemed bigger, now that you think about it. You try to turn your head only to find out that something was holding your head fixated toward the huge toilet <br>\r\n<br>\r\nThat's when it all suddenly hit you. You were toilet paper! With that, you immediately tried to move as if your muscles still existed, but alas, you couldn't even more an inch and were stuck hanging from someone's wall which impaled you right through your cardboard holder.<br>\r\n<br>\r\nAfter what felt like an eternity, someone came in the room. To your surprise, it was kind of familiar. It was one of the girls from the track team. She was 18 and clearly puberty did wonders for her. She had long, flowing brown hair, large D-Cup breasts, and a pale, perfect ass tucked underneath her cheerleader uniform.<br>\r\n<br>\r\nThe sight of her was so amazing, you nearly failed to notice her as proceeds to close the door and...</span></div></div>",
            "created":1501477200,
            "id":2362220,
            "title":"a roll of tissue paper"
        },
        "1441":{
            "author_id":"gilrutherford",
            "author_name":"GillyRutherford",
            "choices":[
                "A Girl From Anatomy",
                "A Middle Aged Female Teacher"
            ],
            "content":"<div class=\"\"><div> <span>She sits on the toilet, as you stare into her breasts. You then hear loud farts, and watch as she begins to groan and push out her scat. You hear each plop of her shit as she then begins to release a stream of warm, yellow piss into the toilet bowl.<br>\r\n<br>\r\nYou then notice her hand approaching you and you feel great fear, as she starts to pull you off of your roll. You feel sharp pain as she pulls you off, and you gulp as you realize where she is going to put you.<br>\r\n<br>\r\nShe immediately, reaches to shove you inside her shitty ass. You were torn, on the one hand, you were going to be on a sexy cheerleader's ass, but on the other hand, you'll be covered in her shit. She shoves you completely into her shit, smearing it all over you, and dropping you into the toilet. It smells horrendous as you are blinded and gagged by her shit.<br>\r\nAs if not suffocating enough, she then plops another large log onto you, pulling more of your body into her ass. It feels awful having more of your body having to be dragged onto her ass.<br>\r\n<br>\r\nShe then flushes you down, and just before you drown, as if by a curse, your soul transfers back to the roll. She gets out of the stall, but then you realize, she won't be your only tormentor.<br>\r\n<br>\r\nThe door then opens again revealing....</span></div></div>",
            "created":1545022800,
            "id":2590263,
            "title":"sit down on the toilet"
        },
        "14411":{
            "author_id":"piney1",
            "author_name":"Pinetree",
            "choices":[
                "She notices",
                "She doesn’t notice"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes and look down to see a pair of mint colored converse sneakers as you look up more you see a pair of dark blue blue jeans with the legs rolled up at the very bottom. Around the waist is a studded belt with a butterfly buckle and just above that is a black hoodie with a rose design embroidered on it. You finally get to the face and can’t believe what you are seeing. It’s a girl you recognize from your anatomy class you once had a group project with her but didn’t really interact. She has a head of caramel brown hair reaching halfway down her back and a couple butterfly ribbons in her hair made out of pink and blue cloth. Her eyes were a light blue and her eyelashes were long as she must have put on some makeup today. Her lips were colored red as a apple and her as smooth as a polished marble countertop. The light hit her skin as if she was a statue being so pale. You see her bend over and grab a strip of you leaving you in agonizing pain as she repeated this 4 times turning you into a makeshift toilet seat cover. You felt her body pushing down on those 4 strips of yours as she went on with her business. The horrifying sound of the constant plopping and leaking coming from this girl left you petrified but not before she grabbed you and began to wipe herself all over with you. It was a living nightmare constantly being rubbed up and close against her. After what feels like a eternity you see her get up and leave which at first seems like a relief to you but you realize part of your body is stuck to her shoe. Does she realize or are you on for the ride?</span></div></div>",
            "created":1568437200,
            "id":2718336,
            "title":"A Girl From Anatomy"
        },
        "145":{
            "author_id":"greenicedragon",
            "author_name":"G-Dragon",
            "choices":[
                "Toothbrush ",
                "Cloth Diaper",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1411621200,
            "id":1861958,
            "title":"Other"
        },
        "1453":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "tampon",
                "maxi pad",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what are you</span></div></span></div>",
            "created":1435640400,
            "id":2001061,
            "title":"Other"
        },
        "15":{
            "author_id":"askmax108",
            "author_name":"askmax108",
            "choices":[
                "You are a tampon, stuffed in a woman's vagina",
                "Actually, you are the vagina!",
                "You are a woman's butt, inside her underwear",
                "From the way you jiggle, you deduce you're a boob!",
                "Come to think of it, you are something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are somewhere dark, and warm. It's hard to tell exactly what you are, though it's certainly not human. You start to realize what you are: you have been reincarnated as...</span></div></span></div>",
            "created":1405054800,
            "id":1826065,
            "title":"You are somewhere dark. But what are you?"
        },
        "153":{
            "author_id":"askmax108",
            "author_name":"askmax108",
            "choices":[
                "Let her know",
                "Remain silent",
                "Demand a different boon from Talia"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello, lost soul,\" speaks a woman's voice to you.<br>\r\n<br>\r\n\"What am I? I was in an accident, what happened? Who are you?\"<br>\r\n<br>\r\n\"I am Talia, an angel of reincarnation. You died in the accident, and have now been reincarnated.\"<br>\r\n<br>\r\n\"Crap, I can't be dead! But what am I? My whole body feels weird!\"<br>\r\n<br>\r\n\"It has been determined that, in life, you were a perv. You were obsessed with girls' butts, and tried to get a look at them with upskirt voyeur shots. As punishment for your sins, you have been remade, as the object of your desire.\"<br>\r\n<br>\r\nObject? Desire? What the hell was she talking about?<br>\r\n<br>\r\n\"In case you haven't guessed it, you are now a woman's butt. Your soul now inhabits her butt cheeks, as well as her anus.\"<br>\r\n<br>\r\n\"No! That can't be! I'm a man, not some chick's body part! Give me my body back!\"<br>\r\n<br>\r\nTalia laughs at you. \"Back? You died! I may one day see fit to restore you to a human form, but not until you have truly suffered retribution and achieved redemption. Before I go, I shall grant you a boon: if you desire, the woman whose as you now are can be informed of  your existence. She may treat you differently, either better or worse; that risk is yours to take, if you so wish. Ask now, if ever, or forever hold your peace.\"<br>\r\n<br>\r\nYou ponder for a moment. Do you want this random woman to know that her ass was once a man?</span></div></div>",
            "created":1406782800,
            "id":1835910,
            "title":"Reincarnated as a Butt"
        },
        "1531":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Someone you know",
                "Someone you don’t know",
                "A family member"
            ],
            "content":"<div class=\"\"><div> <span>“I suppose it would be better to let someone know, than to be forgotten. Maybe she can even help me out.” You tell Talia.<br>\r\n<br>\r\n“Very well, I will inform the woman that her butt is now inhabited by you...”<br>\r\n<br>\r\nAfter Talia tells the woman, she gasps in shock, but...<br>\r\nWho is this woman?</span></div></div>",
            "created":1519362000,
            "id":2456872,
            "title":"Let her know"
        },
        "15311":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Teacher",
                "Friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is this woman that you know?</span></div></span></div>",
            "created":1519362000,
            "id":2456878,
            "title":"Someone you know"
        },
        "15312":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Frankie,40 year old black MILF,her 2 daughters treat her like shit",
                "Nessa,16,Science Chick,loves freaky and kinky transformation movies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Talia:these two women seem nice...</span></div></span></div>",
            "created":1587859380,
            "id":2824636,
            "title":"Someone you don’t know"
        },
        "153121":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "She Wants You To Be Her daughters “Temporary Father”",
                "She Wants You To Help Her Be The Tweark Queen of the World "
            ],
            "content":"<div class=\"\"><div> <span>Hello There Said Frankie To You,Her new Talking Butt<br>\r\nHello you Said relived you could still talk,I’m sorry I had to be reincarnated as your ass you said annoyed <br>\r\nWhat’s  new Said Frankie,my husband left me,my daughters Diana and Frankie Jr Hate Me,and Now I have a Talking Butt<br>\r\nPerhaps we could make a deal you Said, if I help you with whatever problem you want me too,you can send me back to my body<br>\r\nFine Said Frankie annoyed as well<br>\r\nWhat do you want me to help you with you Said in a booming voice<br>\r\nWell I’ll have that Thalia lady turn you back into your old self if you help me....<br>\r\nWhat did Frankie want you to do in exchange for the chance to be human again?</span></div></div>",
            "created":1593549840,
            "id":2859284,
            "title":"Frankie,40 year old black MILF,her 2 daughters ..."
        },
        "15313":{
            "author_id":"notanonymous1",
            "author_name":"Thèo",
            "choices":[
                "Mother, Helen",
                "..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize you've become your ________’s butt.</span></div></span></div>",
            "created":1569387600,
            "id":2723248,
            "title":"A family member"
        },
        "153131":{
            "author_id":"notanonymous1",
            "author_name":"Thèo",
            "choices":[
                "“I'm so glad you're back.”",
                "“I can't believe you got reincarnated as my ass.”"
            ],
            "content":"<div class=\"\"><div> <span>From above, you hear muffled talking. It feels like some kind of magical barrier is stopping you from listening. Whatever is happening, your host is moving around quite a bit. Any movement from her, no matter how slight, translates to ripples across the entirety of her ass. Throughout her conversation with Talia, her hips would move slowly and smoothly from side to side. You feel her cheeks lightly slap into each other, her hips then moving back the other way again. It's a bit disorienting at first, but you soon adjust to her tempo. You aren't sure why, but the sway of her hips is really soothing. The way her cheeks move back and forth feels familiar, but the reason why seems right out of your grasp.<br>\r\n<br>\r\nThen, midswing, the movement suddenly stops, breaking you out of your daydream. You hear Talia cut into your thoughts, saying very matter-of-factly, “Alright, she knows you're her butt.” She pauses for a second before continuing, “It's a bit funny though...”<br>\r\n<br>\r\n“What is?” You ask, nervously.<br>\r\n<br>\r\nBy her voice, you can hear that she's trying to hold back a laugh, “Do you know whose <i>plump posterior</i> you've become?”<br>\r\n<br>\r\nYou feel like you don't want to hear the answer, “Whose?”<br>\r\n<br>\r\nShe pauses to chuckle to herself, “You're your mom's!”<br>\r\n<br>\r\nYou're metaphorical eyes widen in shock and horror. It could've been any of the other billions of women on Earth, maybe even animals or aliens, and you ended up as your own mother's ass. Granted, you can't deny that your mom is kinda hot. You remember the first time you did your homework at the kitchen table instead of in your room and having her ass distract you the entire time she was cooking. The metronomic sway of her hips hypnotizing you like a large, soft pocketwatch. That must be why the say of her hips had felt so familiar to you. Maybe being your mom's ass wouldn't be that bad.<br>\r\n<br>\r\nTalia then speaks, her voice and presence fading away, “I hope you enjoy your new home.”<br>\r\n<br>\r\n“Wait!”<br>\r\n<br>\r\nTalia returned, her voice back at full volume, “Yes?”<br>\r\n<br>\r\n“Was it just chance that I became my mom's ass, or did you orchestrate that?”<br>\r\n<br>\r\n“Oh, I can't give out secrets like that.”<br>\r\n<br>\r\n“Oh. Well, will other people know I'm my mom's ass?”<br>\r\n<br>\r\n“She can tell people, but they probably won't believe her,” she says dismissively, before continuing, “Actually, I might let some choice people in on it.”<br>\r\n<br>\r\nYou aren't sure if you like the sound of that, but it's something.<br>\r\n<br>\r\n“Anyways,” she says, fading again, “I must be off. There are more souls who need to <i>return to their mothers</i>.”<br>\r\n<br>\r\nBefore you can process what she's said, the swinging of you mom's hips continue, the world no longer as muffled. She stops her swaying, your body slowly and lightly coming to a stop. Suddenly, you feel her hands move up from her thighs onto you, her fingers making divots in your soft flesh. As they come to a stop, you realize you can see between her splayed fingers. There isn't much to see besides a white wooden door with a mirror on it.<br>\r\n<br>\r\nFor the first time, you see yourself for all you are: the soft, plush ass cheeks of a MILF. You see your moms hands lightly squeeze your body in disbelief, the black yoga pants she's wearing distorting as she digs into you. She quietly laughs and lightly rubs her cheeks together.<br>\r\n<br>\r\nYour eyes move up her back, seeing that she has nothing but her bra on. You can see her sidewinders being held in place by the straining bra. With your newfound knowledge of reincarnation, you wonder if becoming her bra would've been as much work as it looked like. Maybe someone's in there and she doesn't know. Maybe someone is in her breasts.<br>\r\n<br>\r\nYou push those thoughts out of your mind and look further up. You see your mom looking over her shoulder inti the mirror. You can't see above her nose, but she is smiling. She says to you...</span></div></div>",
            "created":1569733200,
            "id":2725321,
            "title":"Your Mother, Helen"
        },
        "153132":{
            "author_id":"notanonymous1",
            "author_name":"Thèo",
            "choices":[
                "Sister, Rachel",
                "..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize you've become your _______’s butt.</span></div></span></div>",
            "created":1569387600,
            "id":2723250,
            "title":"..."
        },
        "1531321":{
            "author_id":"notanonymous1",
            "author_name":"Thèo",
            "choices":[
                "Who knows how many ways...",
                "Who knows how many other ways..."
            ],
            "content":"<div class=\"\"><div> <span>           Rachel couldn't believe what she'd heard! ‘Her brother's soul was trapped in her ass as punishment for his sins’? She had to processes what the angel had said for a few seconds. Sure, she knew you'd perved on her, but she'd always just used that as blackmail without a second thought. Never had she thought you'd perv on other girls, especially with her bodacious figure that put many of the girls at school to shame. Of course, that blackmail had allowed you to get rather ‘acquainted’ with parts of her body, especially her ass now that she thought about it.<br>\r\n<br>\r\n           “With this knowledge,” added Talia, “I want you to realize that you are no longer <i>its</i> sister, but its handler. It is not a he, but an it, and it must be kept until it pays for its sins when it was a human.”<br>\r\n<br>\r\n           Rachel looks back at <span style=\"text-decoration:line-through\">you</span> her ass with a thoughtful frown on her face, “When will he be released?”<br>\r\n<br>\r\n           “I am not allowed to tell you that,” she states, “<i>but</i>, since you are the warden, you are allowed to make some rules about its existence, such as who knows about it, what it can do, et cetera.”<br>\r\n<br>\r\n           Rachel thought for a bit, staring at her <span style=\"text-decoration:line-through\">little brother</span> <i>big butt</i>. She thought about how she used to play pranks on <span style=\"text-decoration:line-through\">you</span> her <i>big, bubbly behind</i>. <span style=\"text-decoration:line-through\">You'd</span> Her <i>astounding ass</i> would sometimes tell her mom, and she'd sometimes be given a time out. She'd sit on her <i>soft, comfy seat cushion</i>, facing the wall while <span style=\"text-decoration:line-through\">you</span> her <i>rosy, red cheeks</i> laughed at her. She thought about the times when she came home after a hard day and plopped herself on the couch. <span style=\"text-decoration:line-through\">You’d</span> Her <i>supple derriere</i> would ask what was wrong and she'd spend the whole day blabbing about it, and <span style=\"text-decoration:line-through\">you'd</span> her <i>squishy tushie</i> listened to every complaint she had. She thought about every sin and virtue <span style=\"text-decoration:line-through\">you</span> her <i>massive, malleable mountains</i> had committed that she could remember. Were <span style=\"text-decoration:line-through\">you</span> her <i> comfortable cheeks</i> just a bit of extra padding for her seat, or were <i>you</i> her <i>brother</i>? Could she condemn you? She took a deep breath and hiked up her pajamas, “Well...~”<br>\r\n<br>\r\n— — —<br>\r\n<br>\r\n           You sit in silence and relative darkness inside the woman's form-fitting, fluffy, black pajama bottoms, the material brushing gently against her softer, squishy butt. Suddenly, the already kinda tight pants get even tighter as the hem is pulled up, her mighty ass being lifted by the thick material. It felt a bit like having a blanket pulled against your face, but instead of deforming against a face, it moulded to the shape of her buttocks. She lets go and her bountiful behind jiggles a bit as it settles back into place, the pajamas now even snugger around her shapely rump. You think you hear talking above you, but the feeling of your whole body suddenly jumping up and bouncing down was a bit too disorienting to tell.<br>\r\n<br>\r\n           As you're recuperating, Talia's voice appears to you once again, “Alright, she's been told,” her voice slowly fades as she continues, “Enjoy your stay, asshole~”<br>\r\n<br>\r\n           You feel muscles beneath her left cheek move forward, her skin and pajamas stretching to follow. You feel a light vibration move up her left cheek as her right cheek swells and get squished back by her thigh. The process then reverses, her left cheek moving backwards until it gets squished and her right cheek moving forward and stretching, muscles moving underneath it all. It's strange feeling your face morph like this; what would be your face being mushed asymmetrically, but it's not your face; it's a woman's sizeable rear end. Beyond the swishing of skin rubbing against fabric, the outside world was a bit hard to hear. You think you hear the sound of hardwood floors creaking underneath her feet, but it sounds miles away from to her ass. You then feel the muscles and skin stretch further than they had ever done before, her leg raising much higher up. Her other leg then follows, bringing you up as well as forwards. You think she's climbing stairs. It's weird and slightly uncomfortable when compared to just walking. Her cheeks also seem to bounce more as she goes up, further confusing your senses beyond the twisting of what would be your face. Eventually, she reaches the top and walks along a short hallway. You hear a click and a metallic creak, which might be a door opening. Her walking slows as she closes the door behind her with another click. She stands for a few seconds, completely still. The darkness of her pajamas provide a feeling of unease between the two of you, an ass and its owner, an ant and a giant. Out of the darkness, you feel a light touch from behind the pajamas against her right cheek, the feeling disappearing as quick as it came. It then returned, this time a bit more forceful, causing her ass to ripple out from it's contact. The spot grows, the plush pajamas are pressed against her plush posterior by what feels like a hand, mushing into her right cheek. A second hand then came down, pushing against the other cheek and lightly pressing the two together, driving the pajamas further between them. You can do nothing but feel the strange feeling of a girl's hands pressed against <span style=\"text-decoration:line-through\">you face</span> her own massive ass, the squishing of her own ass cheeks inside of her pajamas. You don't know why, but it brings a strange feeling to you. You aren't you anymore, you are <i>her ass</i>: <i>Her ass</i> to squish between her fingers, her fat only inhabited by you as she does so. <i>Her ass</i> to sit upon wherever, standing only when she sees fit. <i>Her ass</i> to wash as she pleases, suds flowing along her smooth skin as she pulls a loofa between her cheeks only inhabited by you. <i>Her ass</i> to burn off, muscle firming up her behind and inhabitant. <i>Her ass</i> to expel her waste from, not from your mouth, but her anus. <i>Her ass</i> to let others... into... You feel her ass cheeks blush at the thought, but you aren't sure whether it's from her or you.<br>\r\n<br>\r\n           Suddenly, her hands move up along her soft pajamas and ever softer behind, hooking her thumb in the hem of her pants. She slowly pulls them down, the hem indenting the flesh of her ass. You feel the hem moving along her skin, slowly scanning over the features of her ass. The smooth flesh provides little resistance or friction as her butt is exposed to the world. She lets go of the hem, it staying put around her thighs. You try to look out in front of you, but the darkness had blinded you. Blinking, you look out to see what you'd become. Staring into the mirror at you was one of the fattest asses you'd ever seen. It was beautiful, not an imperfection to be seen. It was the 8th wonder of the world. It was... your eyes look at the rest of the room around you. This place look familiar, but you can't put your cheeks on it. The bluish-purple walls, the light wooden dressers, the black and magenta-ish bed... was this...? No... For the first time, you are able to see who you belong to. Your eyes trace up along her back, the back of her cyan shirt reading, in big red text, “Please make all deliveries in rear,” with a red arrow pointing directly at her ass. You remember seeing that shirt somewhere, but where? Further up, you see caramel coloured hair draped over her ear and shoulder. She was looking back at you! You can even see part of her face! It was.. It was.. <b><i>Your sister?!</i></b><br>\r\n<br>\r\n           A cold pang of fear reverberates inside of <i>your sister's ass</i>. Of all the people in the world, you ended up on your sister. The person who played pranks on you nearly every day? The one who blackmailed you into being her seat? The one who made fun of you any chance she got? You've become the ultimate butt of her jokes, her own! This was meant to be a punishment for peeping on girls, and now you were the ass of your most recurrent victim. She has complete control over you, and you fear what might happen to you. You wince as you see a reflection of her smile. You never quite knew what she was thinking, and her devious smiles looked the same as her regular happy smiles. Who knows, maybe this will end well for you. Maybe she'll be lenient and treat you like a person trapped in her ass. But, something nags at you that she might just make your afterlife a jiggly, squishy, mushy living hell...</span></div></div>",
            "created":1574634720,
            "id":2751261,
            "title":"Sister, Rachel"
        },
        "15313211":{
            "author_id":"notanonymous1",
            "author_name":"Thèo",
            "choices":[
                "A friendly relationship?",
                "Or maybe..."
            ],
            "content":"<div class=\"\"><div> <span>           You and your sister stare at each other, you into her eyes and her into her own personal canyon. You feel a bead of sweat well up beneath your sister's skin before it rolls down along her ass; the trail left along her skin grows longer as it descends, the bead's speed increasing around her curves. Nervousness wells up inside her ass as well, every silent moment making the tension in the room feel that much more palpable. Your soul is now your sister's plaything, wrapped up, handed to her with a bow, and packed in an all too convenient package. Who knows, maybe she liked you more than you gave her credit for. Or maybe...</span></div></div>",
            "created":1575522480,
            "id":2755610,
            "title":"Who knows how many ways..."
        },
        "1532":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "A family member",
                "Someone you know",
                "Someone you've never seen before"
            ],
            "content":"<div class=\"\"><div> <span>\"Hell no! It's bad enough I've become an ass, let alone having somebody know about it!\" you yell, even though no sound comes out.<br>\r\n<br>\r\n\"Very well,\" says Talia. \"However, this chance will not come again. Are you sure that you want to make this choice?\"<br>\r\n<br>\r\n\"Yes, I'm sure,\" you say.<br>\r\n<br>\r\n\"Goodbye, then. Try to enjoy your new life,\" Talia says.<br>\r\n<br>\r\n\"Fat chance,\" you mutter silently.<br>\r\n<br>\r\nSuddenly, whoever's body you're attached to farts. You taste it, and it's awful. You can't even imagine what it would be like to shit.<br>\r\n<br>\r\nThe girl you're attached to starts walking. You feel your form jiggle with every step. Suddenly, the leggings and panties blocking your vision fall out of your way. The girl is taking a shower!<br>\r\n<br>\r\nBut who is this girl?</span></div></div>",
            "created":1417842000,
            "id":1898451,
            "title":"Remain silent"
        },
        "15321":{
            "author_id":"mrsqueejee",
            "author_name":"MrSqueejee",
            "choices":[
                "Your mother Helen",
                "Your sister Rachel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize you've become your _____'s butt.</span></div></span></div>",
            "created":1417842000,
            "id":1898452,
            "title":"A family member"
        },
        "153211":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Yoga",
                "Go to work"
            ],
            "content":"<div class=\"\"><div> <span>You'd always thought your mother had a plump ass, but you never thought you'd become it!<br>\r\n<br>\r\nAs she turns the shower on, she begins to sing to some 80's song you'd never heard of before. You feel water run all over her plump cheeks and down her crack,<i> your crack</i>. <br>\r\nYou're powerless to stop her from scrubbing you clean, even if she didn't know it was you. She rubs her ass, making it bounce. As she sings, she begins to dance, and shakes her hips from side to side, taking you with them. You wiggle and jiggle, unable to move or speak, but subject to being your mother's ass-fat and stinky asshole. <br>\r\n<br>\r\nBefore she goes to bed she pulls on a tight pair of stretchy pink panties and a matching bra. Your vision is now restricted to the inside of her panties.<br>\r\n<br>\r\nAs soon as she's asleep you feel a pressure building up inside of you. You try to hold it in but you are forced to open your anus and let out a smelly, eggy fart which is trapped against you by her panties. This continues throughout the night, as you are forced to release burst after burst of your mother's butt-gas right into your smelly prison. <br>\r\n<br>\r\nIn the morning your mother is deciding what she wants to do for the day. <br>\r\n</span></div></div>",
            "created":1503982800,
            "id":2376587,
            "title":"Your Mother, Helen"
        },
        "153212":{
            "author_id":"cheffort",
            "author_name":"Cheffort",
            "choices":[
                "Tight Yoga Pants",
                "Blue Bikini"
            ],
            "content":"<div class=\"\"><div> <span>If you weren't her brother, you would have called your sister hot before you became her ass. Despite this, you had always found her quite annoying, with her silly \"pranks\" she'd always pulled on you and her complete disregard for you as a person. Ironically, you've now become the most embarrassing and humiliating part of her, the literal butt of her joke, with her completely unaware of any discomfort you are put through.<br>\r\n<br>\r\nIn the shower, her voluptuous ass ,which you had now become, is washed until it glistens with cleanliness under the light. You can feel her tight asshole ,which is now more or less your mouth, expand, quickly dispersing a small fart before contracting its small sphincter again. The smell and taste is a disgusting combination of baked beans and rotten eggs, and you hope she isn't this gassy often.<br>\r\n<br>\r\nBefore getting dressed for bed, your sister takes something out of her drawer. Holding it in one hand, she moves it in front of you. Suddenly you realise what she intends to do. Spreading her fat cheeks apart with her other hand, she forcefully inserts the butt plug into her rectum, which feels like the equivalent of a gag in your mouth. This stimulates you, giving you the equivalent of a boner for an anus. You begin leaking glistening rectal fluid onto the buttplug. With great effort, she shoves the butt plug fully inside you, leaving the flared end of the butt plug where her anus once was and sending you into a near orgasmic state. Releasing her cheeks, they snap back together, covering any sign of the buttplug.<br>\r\n<br>\r\nGetting dressed for bed, your sister pulls up some white panties with red polka dots. She must be too tired to care that these panties are two sizes too small! As she forces them on, her cheeks are spread apart to accommodate for the new intrusion. She pulls them on very tightly, so tightly that you can feel the panties touching the end of the buttplug and moving it slightly, which stimulates you once again. Once she feels that the panties are tightly clad to her curvaceous ass, she releases the pressure she was applying and her cheeks reunite with a loud *slap*, wedging the humiliating panties tightly into her asscrack. You can feel how tightly the panties have been lodged between her bouncy buttcheeks. <br>\r\n<br>\r\nAfterwards, your sister puts on a matching bra and goes to bed,masturbating to the feeling of her butt plug before orgasming and going to sleep. The butt plug gives you an euphoric feeling for the rest of the night, and you end up sleeping happily shortly after.<br>\r\n<br>\r\nIn the morning your sister pulls down her panties and pulls out her butt plug, covered in her (or your) rectal juices. The sudden release of pressure urges a rancid fart to come out. Soon after, your sister is deciding what to get dressed into for the day.</span></div></div>",
            "created":1504069200,
            "id":2377143,
            "title":"Your Sister, Rachel"
        },
        "1533":{
            "author_id":"joebee",
            "author_name":"Boi",
            "choices":[
                "The girl you share a body with sits down",
                "You wait patiently for something to happen",
                "Your panties talk back"
            ],
            "content":"<div class=\"\"><div> <span>'Boon' is a funny word. You roll it around in your head for a while while Talia is talking. By the time you stop, you realize you just ruined your one chance to save yourself. You definitely don't want to ask her to repeat herself. By now she's saying \"forever hold your peace\". <b>Say</b>, you think, <b>isn't that from weddings?</b> And that gets you started.<br>\r\n<b>If this Talia chick looks anything like she sounds, I could really make lemonade out of her lemons. Melonade? Whatever.</b> So; putting aside all caution, and the fact that you are literally a woman's butt, you start to flirt with the angel.<br>\r\n\"Sorry, Talia, but I had another boon in mind.\" You almost add 'if you know what I mean', but you remember that bet you made with Sophie.<br>\r\n\"Very well, lost soul. I will give you the gift of knowledge.\"<br>\r\nThere is a pause as nothing seems to happen. Then, all at once, it hits you.<br>\r\n\"Wait, isn't the point of reincarnation that you don't know you reincarnated?\"<br>\r\n\"Yes, lost soul,\" Talia replies. \"My meeting you is my boon, and if you find redemption, I may be able to come back. Good luck.\" <br>\r\nAs the voice fades from your mind you think to yourself \"She's totally into me.\"<br>\r\n\"What the hell <i>now?</i></span></div></div>",
            "created":1529643600,
            "id":2510901,
            "title":"Always a third option"
        },
        "154":{
            "choices":[
                "Like it",
                "Dont",
                "Stay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You jiggle like man as the woman your attached to is unaware your her breasts</span></div></span></div>",
            "created":1510981200,
            "id":2416759,
            "title":"From the way you jiggle, you deduce you're ..."
        },
        "155":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Condom",
                "Hair band"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1411362000,
            "id":1860473,
            "title":"Come to think of it, you are something else."
        },
        "1551":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Condom",
                " dildo",
                "lollipop "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Condom,dildo, or a lolipop</span></div></span></div>",
            "created":1435640400,
            "id":2001063,
            "title":"Condom or"
        },
        "15511":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "Mom ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose condom are you</span></div></span></div>",
            "created":1553490000,
            "id":2634563,
            "title":"Condom"
        },
        "155111":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "Anal sex",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your mom pick you up you see that she was naked she hand you over to  a naked guy next to her he strap you to his massive dick  she asked him what kind of sex does he want he responded with<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1553490000,
            "id":2634570,
            "title":"Mom "
        },
        "1551111":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "They leave you inside",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>He respond how about I pounds that big ass of yours then take some lotions and rubbed it on her butthole and started to rubbing you on your own mother asshole  you could feel  your self going further inside when you were all inside he start to pound faster and faster inside you could hear the muffled moan of your mom and her lover who were enjoying their Passionate sex unaware the hell that they put you through you could feel everything and taste and smell everything you were ram you mom waste and its smelled like hell but the worst is the tastes you could taste her waste and his dick then you felt a big load inside your mouth  it was discusting <br>\r\n<br>\r\nWhat happen next</span></div></div>",
            "created":1595461260,
            "id":2873276,
            "title":"Anal sex"
        },
        "155112":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Your crush",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe.....</span></div></span></div>",
            "created":1571933640,
            "id":2737784,
            "title":"other"
        },
        "1551122":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Your best friend",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1572018900,
            "id":2738237,
            "title":"Other"
        },
        "15511222":{
            "author_id":"inanimate",
            "author_name":"Toriko123",
            "choices":[
                "Teacher",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose condom are you</span></div></span></div>",
            "created":1573930920,
            "id":2747508,
            "title":"Others"
        },
        "155112222":{
            "author_id":"fbob",
            "author_name":"Fbob ",
            "choices":[
                "Some random lady",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose condom are you</span></div></span></div>",
            "created":1594867800,
            "id":2869404,
            "title":"other"
        },
        "15513":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "lollipop",
                "a diaper",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it a lollipop you are reincarnated as?</span></div></span></div>",
            "created":1571288400,
            "id":2734477,
            "title":"lollipop "
        },
        "155133":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Yes!",
                "No!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a footstool?</span></div></span></div>",
            "created":1571893200,
            "id":2737779,
            "title":"something else"
        },
        "1551331":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "Your school bully came in",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You couldn't move nor talk. Your could only see a ceiling and didn't really know what you were. You noticed that your hands and feets were practically holding your head. You heard a door open as...</span></div></span></div>",
            "created":1571893200,
            "id":2737781,
            "title":"Yes!"
        },
        "15513311":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "She takes her socks off",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>\"Finally goddamn home..\" she said as your school bully came in. You knew that voice too well as it scared you everytime you hear it. She made her way to the couch as you saw her for a moment. Her blue hair and her face scared you even more. She sat down onto the couch as she unties her black leather boots.<br>\r\n<br>\r\nShe turned the TV on and placed her socked feet on you. It felt like her feet were right under your nose as you could smell the intense sweat odor comming from them. Her black stripped socks were wet and very warm.</span></div></div>",
            "created":1571933580,
            "id":2737783,
            "title":"Your school bully came in"
        },
        "1552":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "You wriggle around",
                "The lady goes about her day"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You would feel yourself bob happily as the lady wraps yourself around shiny black hair to form a neat ponytail as the woman in delight swishes her ponytail around</span></div></span></div>",
            "created":1491022800,
            "id":2298037,
            "title":"Hair band of a ponytail"
        }
    },
    "info":{
        "author_id":"luigi626",
        "author_name":"AppleBottomJ",
        "brief_description":"You die one day as are reincarnated as an inanimate object!!!",
        "created":1315042380,
        "description":"<td align=\"left\" class=\"norm\">You die one day as are reincarnated as an inanimate object!<br>\r\n<br>\r\nFocus: Ass, Feet<br>\r\n<br>\r\nPlease keep all characters who use you as an inanimate object female.<br>\r\n<br>\r\nAlso, please write in the second person, saying \"you do ___\" or \"___ happens to you\"</td>",
        "id":1807463,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603417080,
        "modified":1603417080,
        "pretty_title":"Reincarnated as an Object"
    }
}