{
    "chapters":{
        "1":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a science teacher at Barton College for Girls. The school has 450 pupils from the ages of 16 to 20<br>\r\nYou have been a science teacher for 3 years and really enjoy it.<br>\r\n<br>\r\nFirstly what gender are you?</span></div></span></div>",
            "created":1086411600,
            "id":201843,
            "title":"Are you a male or female science teacher"
        },
        "11":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "1 inch tall",
                "10cm tall",
                "3 inches",
                "5 inches",
                "2 millimetres"
            ],
            "content":"<div class=\"\"><div> <span>Your name is David Harris. You are 36  <br>\r\n6ft 3 with short brown hair and blue eyes. <br>\r\nYou live in Warburgh which is about 30 minutes drive from the school.<br>\r\nYou are married to Gemma who is 38, she has long blond hair with blue eyes and is beautiful. Gemma is a Geography teacher at the school.<br>\r\nYou have three daughters who are both at the school also. Leanne, Jessica and Hannah.<br>\r\n<br>\r\nLeanne is from your wife's previous marriage.<br>\r\nShe is 18 with shoulder length blond hair and blue eyes. Leanne wears braces and is a gorgeous girl. She loves wearing her jewellery and lipgloss. Leanne has a 19 yr old boyfriend called Timothy. They have been going out for two years.<br>\r\n<br>\r\nJessica, who is 16 with shoulder length blond hair and blue eyes. Jessica also wears braces and never goes out without make-up. Jessica had a boyfriend called Martin but has recently split up as the relationship wasn't going anywhere.<br>\r\n<br>\r\nHannah, who is also 17 whith blond hair which she ties back in a ponytail. Hannah also has braces and her teeth aren't that straight. Hannah loves riding horses and has her own pony which she keeps at the stables where she rides. A year ago Hannah had a riding accident and fell off a horse. This caused her to break one of her front teeth.<br>\r\n<br>\r\nIn school:<br>\r\nIt's the last lesson of the day.<br>\r\nYou have prepared everything for your lesson and your pupils are waiting paitently outside. You go out into the corridor.<br>\r\n\"Afternoon girls in you come and have a seat.\" you say to your pupils.<br>\r\nYour pupils file into the room and sit down at their desks. They all take out their pens and books and you start the lesson.<br>\r\n<br>\r\nEverything is going well until about 5 minutes before the end of the lesson. You have a load of chemicals on the bench. The lab assistant has just brought out some solutions and has put them on your desk. One is a greeny liquid.<br>\r\nWhile you are teaching you turn and spil it. It goes over you. You think nothing of it and wash it off immediately just incase.<br>\r\nThe bell sounds and the girls pack their books away.<br>\r\n\"Right thank you girls. See you on Thursday morning.\" you say<br>\r\nThe girls all vacate the room and head for their buses or cars to travel home.<br>\r\nOnce the room is empty you feel funny. Your hot and dizzy.<br>\r\nSuddenly without warning you collapse on the lab floor.<br>\r\nAfter a while you wake up and look around. Everything looks huge and you are puzzled.<br>\r\n\"My god I have shrunk.\" you say to yourself as you scan your surroundings. <br>\r\nWhat height have you shrunk to?<br>\r\n</span></div></div>",
            "created":1086475020,
            "id":507975,
            "title":"Shrunk in your lab"
        },
        "111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Go and get Hannah's attention",
                "Stay in Leanne's room. Your safe there for the moment"
            ],
            "content":"<div class=\"\"><div> <span>You estimate that you must be about 1 inch tall.<br>\r\nYou have never been scared of much but now everything scares you.<br>\r\nSo many things are running through your head:<br>\r\n&gt; How are you going to get home<br>\r\n&gt; What are you going to do when you get home<br>\r\nand many other things.<br>\r\n<br>\r\nAfter a few minutes of thinking you now that you have to find your daughters and somehow go home with them.<br>\r\nYou walk across the floor of your lab and squeeze under the door.<br>\r\nOnce in the corridor you see that everything is silent and no one is about.<br>\r\n\"Must get to the car-park and see if Leanne's car is in the car park.\" you say<br>\r\n<br>\r\nYou make your way very slowly as at your size the journey takes ages.<br>\r\nEventually you reach the car park and look around. Thankfully you see your daughters car in the car park. It is not hard to see as it stands out so much. (a purple KA is easy to spot)<br>\r\nYou make your way over to it and climb up the tyre and onto the bonnet.<br>\r\nThen you hear voices. You recognise the voice instantly as your daughter Leanne. She is coming across the car park towards her car. A loud bleep as she unlocks the car makes you jump.<br>\r\nThen you make your way onto the roof of the car.<br>\r\nLeanne, Hannah, Jessica and two of Leanne's friends are getting into the car. As Leanne opens the drivers door you jump towards her. You land in her blouse pocket.<br>\r\nLeanne gets into the drivers seat and closes the door.<br>\r\nShe starts the engine and heads home chatting with her sisters and friends on the way.<br>\r\n<br>\r\nShortly she pulls into the drive of the house and stops the car.<br>\r\nHer and her friends plus her two sisters get out and walk towards the house. They dump their bags inside the door and Leanne goes upstairs.<br>\r\n\"I'll just go and change and then we'll go down to the pictures.\" she said<br>\r\nYou are being bouced around in your eldest daughters pocket but at least your somewhere safe.<br>\r\nLeanne goes into her bedroom and strips off her blouse and trousers and puts on a blue hooded top and grey trousers and goes out of the room.<br>\r\nWhen your daughter took her blouse off she threw it on her bed. That's where you are now. You crawl out from under the blouse and stand up.<br>\r\nYou look around your eldest daughters room. You hear her voice from downstairs, then the front door closes and there is silence once more.<br>\r\nThen footsteps can be heard coming up the stairs. A humming sound can be heard. You recognise it as Hannah.<br>\r\n\"She'll be getting ready to go and sort out her horse.\" you say<br>\r\nHannah goes into her room and turns on her stereo and gets changed.<br>\r\n <br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1086411600,
            "id":201852,
            "title":"Back home"
        },
        "1111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "in the bread bin",
                "somewhere on the kitchen floor"
            ],
            "content":"<div class=\"\"><div> <span>You decide that you have to get someones attention and fast. You make your way off Leanne's bed and cross her bedroom floor to the door. You cross the hallway and go into Hannah's room.<br>\r\nShe is sat on her bed reading a magazine singing along to her music.<br>\r\nYou notice her slippers by the drawers and decide their your ride downstairs.<br>\r\n\"I'm hungry. I'll go and make myself some food.\" you hear your daughter say.<br>\r\nShe gets off the bed and walks towards the drawers to put on her slippers.<br>\r\nQuickly you climb onto her slipper and hold on tight.<br>\r\nHer huge feet slide into the slippers and she walks out of her room. She goes downstairs and into the kitchen.<br>\r\nThe journey downstairs made you feel quite sick.<br>\r\nHannah goes over to the fridge and takes out some tomatoes, lettuce and some cheese slices. She puts them on the worktop and then turns and pours a glass of lemonade. She then turned to return to the worktop. As she did she slipped on something. She fell and you were sent flying through the air and landed  </span></div></div>",
            "created":1086411600,
            "id":201857,
            "title":"A rid on your daughters slipper into the kitchen"
        },
        "11111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "She's picked out the slice you were on",
                "Your still in the bread bin"
            ],
            "content":"<div class=\"\"><div> <span>After flying through the air for a while you land in the bread bin. <br>\r\nHannah meanwhile was slicing up her tomatoes and opening the packet of cheese slices. She then went over to the bread bin where unkonwn to her you had landed.<br>\r\nHannah took out two slices of bread and lay them on the worktop. </span></div></div>",
            "created":1086411600,
            "id":201858,
            "title":"Landing in the bread bin"
        },
        "111111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "the half one your trapped in",
                "luckily it's the other half"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately for you Hannah has picked out the slice of bread you had landed on.<br>\r\nShe lays them both down on the worktop and then spreads the one your on with butter.<br>\r\nThe knife glides across the surface and before you can move your covered in butter.<br>\r\nWithin seconds you are covered with a lettuce leaf. You struggle to escape but you can't move the lettuce leaf.<br>\r\nHannah, unaware that her father was under the lettuce leaf place the slices of tomato on it and then laid two cheese slices ontop of the tomatoes. She then took the other piece of break and placed it on top of all of her fillings.<br>\r\nYou meanwhile are struggling to move under the fillings. If you don't escape then you will be eaten by your own daughter. That thought is too scary to contemplate.<br>\r\nHannah gets a knife from the drawer and sliced her sandwich in half.<br>\r\nThe knife misses you by millimetres and you then feel the half your in being lifted up.<br>\r\nHannah puts her sandwiches on a plate and takes them into the lounge.<br>\r\n\"I'll watch telly for a bit before I go and sort out George.\" she said switching on the telly.<br>\r\nShe sits down again and picks up one of her sandwiches. Which one?   </span></div></div>",
            "created":1086411600,
            "id":201862,
            "title":"Trapped in your daughters sandwich"
        },
        "1111111":{
            "author_id":"star_sage",
            "author_name":"Sage",
            "choices":[
                "I just can't let her die",
                "Try to eat me will you?"
            ],
            "content":"<div class=\"\"><div> <span>As you feel the ground fall away beneath you your gaze falls across the screen your daughter is watching, and you find that the timing of shows is most oddly appropriate. The program on at that moment just happened to be an old cartoon from the US, one of the old Bugs Bunny's and one you recognize. They'd just gotten to the scene where the rabbit is underwater, and the dog cashing him has him trapped in a rabbit sandwich. The dog is about to take what he thinks is a big bite from the bunny, though in reality Bugs had pulled himself out of harms way before the dog even got near the sandwich.<br>\r\n<br>\r\nYou look over to find that Hannah has timed her own bite quite perfectly and just as the dog takes a huge chomp out of his sandwich, she takes a bite out of her's. One that, unfortunately, includes you. You feel the pressure increase around you for a moment, before slacking off again, and looking out you can see nothing but darkness, with occasional flashes of light off the tendrils of saliva that are forming in response to your presence.<br>\r\n<br>\r\nIt hits you then that you're really inside your daughter's mouth, about to be part of her snack while watching the telly waiting for her friend. Such an end doesn't seem fitting of a man of your standing and you're determined to rally against it. Pulling the last of your strength you roll as the tongue pushes the sandwich between those white rocks, and fall right onto its slimy surface. The slippery saliva causes you to slip and slide for a moment, and then suddenly the tongue cups and you are swished from side to side.<br>\r\n<br>\r\n\"MMM,\" says your daughter in a voice that comes from all around you. You realize that she's tasting you, and apparently you taste good. You would much rather taste rancid or something, so that she spit you out. Instead you are apparently very much to her tastes as she slips you around her tongue, getting the fullest of your flavor. You can't believe your own daughter is going to kill you, by simply enjoying her meal.<br>\r\n<br>\r\nWith a last slide you find yourself uncomfortably situated on top of some sharp objects, with more of them descending to crush you. You don't have time to think or make any kind f conscious decision. Instead you act completely on instinct. With a sharp cry you kick out, catching you foot on one of Hannah's molars and pushing yourself off the teeth. Only when you take a moment to think do you realize that you just pushed yourself right into Hannah's throat.<br>\r\n<br>\r\nYou strike a soft wall that ripples under you a second later, and then feel a suction as you are pulled down with an audible GULP! Again there is no time to think, and you splay your arms and legs wide, hoping to catch something again, and with a cry of surprise you find you have, and suddenly your rapid descent comes to a hold. Hannah can't swallow you any farther as long as you hold yourself out like this.<br>\r\n<br>\r\nUnfortunately your muscular prison of flesh begins to vibrate rapidly now, and you can feel it undulate under your hands. With a sickening feeling in your own stomach you realize that Hannah is choking on you, and with no one around she might not get you up, and she would die, choking on her father. You were faced with a horrible decision now. Let go, and slid down into your daughter's stomach, or stay where you are and let her die.</span></div></div>",
            "created":1117947600,
            "id":254459,
            "title":"A horrible Choice"
        },
        "11111112":{
            "author_id":"flagcity",
            "author_name":"alexander",
            "choices":[
                "Her hand,she saw you!",
                "Onto to the counter,you need help!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you are stuck in her throat, she coughs flinging you out of her mouth and into...</span></div></span></div>",
            "created":1383397560,
            "id":1687611,
            "title":"Try to eat me will you?"
        },
        "11112":{
            "author_id":"dage",
            "author_name":"Dage",
            "choices":[
                "Try to find Hannah: she's probably upstairs",
                "Get Jess' attention"
            ],
            "content":"<div class=\"\"><div> <span>You manage to fall straight to the kitchen floor. At your tiny size, it doesn't kill you, but the impact stings a lot. You spend a few seconds recovering, then manage to peel yourself off the ground. Within the time you spent recovering, Hannah has exited the kitchen, and Jess has entered. You contemplate what your next move should be.</span></div></div>",
            "created":1388005320,
            "id":1713410,
            "title":"A Hard Landing"
        },
        "111122":{
            "author_id":"dage",
            "author_name":"Dage",
            "choices":[
                "I'm gonna be lazy",
                "I'm playing it safe"
            ],
            "content":"<div class=\"\"><div> <span><i>There's no reason to leave the kitchen,</i> you think to youtself, as you scout for some way to get to eye level with her. The only negotiable surface you can find is Jess herself, so you begin to scale her. It takes you several minutes to cross between her jeans and her shirt, and within that time, Jess carried you and her snack into her room. She lays down on the bed, and you begin to palm yourself in the face as you come to terms with all the energy you just wasted.<br>\r\n<br>\r\nStraightening yourself up, you resume your trek to Jess' face. As you pass her stomach, you hear a slow rumbling, followed by a light churning noise. Jess must be really hungry, and you can see from her plate up ahead that she has plenty of fod to sate that hunger. A plot formulates in your head. <i>The plate's only a fourth of the distance between me and her face,</i> you calculate, <i>if I got onto some of her food, she'd lift me to her face a lot faster than I could hope to walk.</i> You weigh the options in your head. What do you decide to do?</span></div></div>",
            "created":1388005980,
            "id":1713412,
            "title":"Get Jess' attention"
        },
        "1111221":{
            "author_id":"dage",
            "author_name":"Dage",
            "choices":[
                "Let's get on that sandwich",
                "I'd better go with the candy"
            ],
            "content":"<div class=\"\"><div> <span><i>Eh, why turn down a free ride?</i> you figure, as you make your way to Jess' plate. She has a sandwich, assorted unopened condiments, and a variety of candies on the plate. Your best bet is to climb onto the sandwich and hope that she sees you. On the other hand, if you go with the candy, she may pick you up individually and feel you move.<br>\r\n<br>\r\nWell, the entire affair is dangerous, so there's no <i>right</i> way to do this.</span></div></div>",
            "created":1388265300,
            "id":1716158,
            "title":"Hitchiking"
        },
        "112":{
            "choices":[
                "she scares you",
                "she stomps you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>your sister sudenly enters the room in her smelly stocking feet. she looks down at you and growls in anger.</span></div></span></div>",
            "created":1110949200,
            "id":240277,
            "title":"spotted"
        },
        "1121":{
            "choices":[
                "PUTS YOU IN HER MOUTH",
                "CHUCKLES EVILY"
            ],
            "content":"<div class=\"\"><div> <span>\"Well hello what do we have here.\" tala said. <br>\r\nas her 500ft foot(yes that is a bad pun) came crashing down on to you, you barly missed it.<br>\r\n\"Tala why r u trying to kill me?\" i asked her as she picked me up with her palm. \"i'm just trying to scare you thats all.\"she giggled as your where in front of her face.<br>\r\n<br>\r\nshe then tilt her head back and...</span></div></div>",
            "created":1139634000,
            "id":300770,
            "title":"HELLO little BROTHER"
        },
        "114":{
            "author_name":"peanut",
            "choices":[
                "fall asleep",
                "wait wide-awake"
            ],
            "content":"<div class=\"\"><div> <span>You look around with horror, but quickly move you attention to the door as someone walks into the room. You quikly reconize the boy to be Shawn Jackson, but without warning he walks over and bends down to you looking curiously-<br>\r\n\"Pro-professer?\" he asks in question.<br>\r\n\"Oh god Shawn-help! Go get my wife, please I don't kno what is wrong I-\"<br>\r\n\"Wow professer, I know what I'll do.\" he says. You scream and his hand suddenly grabs you and hoists you into the air. You suddenly find yourself in his pocket as he lets you go. Without warning, he stands back up and begins walking away, while you are trapped in his pocket. After a few moments though, you hear him talking to someone outside of the pocket.<br>\r\n\"Guess what Ange, I didn't forget about our annaversary....\" You gasp as your suddenly hosted out of the pocket quite brutely, and the next thing he knew, Shawn's grubby paw held him out to another giant, this one a woman. You open your mouth again but no sound comes out as she gasps loudly then suddenly grabs you from his hand. Your engulfed in her huge hand, and can see no more and hear no more of what is going on outside of the hand. You feel the girl walking, and you assume she is on her way to her next class. Suddenly the walking stops and the hand opens. You stare up scared into the face of your new captoress. She smiles evily at you, and you scream. But suddenly, she thrusts you head fisrt into her mouth. You try to kick your legs, but she is holding them. So you punch and scream as loud as you can, shouting out every curse word you can think of in your mindless-ranting. She suddenly bits down on you-hard. You quickly stop moveing and focus on trying not to crush under her teeth. Just as suddenly as she shoved you in, she pulls you out,<br>\r\n\"No more sounds, or the punishment will be worse than that.\" she wispers. You nod your head and she smiles. She suddenly lowers you to the ground, and useing a carabeaner on her backpack, she hooks you by your belt to it. Her torso dissapears as she sits back up. Immediately, you work feverishly to undo your belt so you can get away. But as you are undoing the buckle, something drops next to you, a ball of paper. Then another one falls, and you look to see where it came from. A student from one of your previous classes is stareing at you. You immediately reconize her as Jessie Thomas, a vrey good student and roll model for all students. She smiles as you make eye contact then it fades as she mouths something to you,<br>\r\n\"Professor?\" she mouths looking at you. You knod you head as looks on. <br>\r\n\"Are you okay?\" she mouths again. You give her an odd look, and she then immitates putting something ino her mouth and biting down. You understand and knod your head again as you work on your belt. It is quickly undone, and you grab it and easily slip it back on, slowly walking to Jessie's seat. Her heand immediately scoops down, and you climb up. She holds onto you gingerly, and you are thankful for that. She quickly but gently deposits you into her purse, which you are also thankful that it isn't full or crammed with dangerous objects. You sit and wait the class out, thankful that your in the hands of a responsibly, kind girl.</span></div></div>",
            "created":1093323600,
            "id":213723,
            "title":"jessie to the rescue"
        },
        "1141":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "You wake up still cradled in Jessie's arms",
                "You wake up to Jessie gently stroking your tiny face"
            ],
            "content":"<div class=\"\"><div> <span>When you finally wake up it's 4:00 and school is over. \"Where am I?\", you wonder and then suddenly remember. You blink twice and observe your surroundings. Suddenly the purse is filled with light as Jessie gently takes you out. \"Are you okay?! Professor what happened to you? How did you get so small?, asked a very concerned Jessie. \"I'm not okay!\", you shout in a high pitched little voice and then begin to cry. Jessie cradles you in her arms and strokes your face with her long soft fingers. \"Shhh, it's okay Professor everything will be okay don't cry! I'll make sure you get big again somehow\"She coos softly to you as she wipes away your little tears. Your very embarrassed to be sobbing like this in front of one of your pupils but you can't seem to stop. \"B-But I'm really small and can't do anything I used to! I-I can't grade papers or-or teach classes and I'm smaller than a Barbie doll I---\"Jessie cuts you off \"Professor everything will be okay,okay?\", she says softly while still cradling you in her arms. You sniff loudly and wipe your face while it grows very red. \"Sorry it's just that everything is so big and scary now\",you say and pause and then look down while your face continues to redden and murmur\" I'm glad your taking care of me though Jessie...I feel safe with you\" Jessie starts blinking her tears away. She is touched that Professor Harris would say something like that to her. And as she continues to cradle you in her soft arms you yawn softly and sleep like you haven't slept like in a long time.</span></div></div>",
            "created":1180242000,
            "id":411346,
            "title":"Jessie Takes Good Care of the Little Professor"
        },
        "11411":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "You stay in Jessie's Arms while she gives you a tour of  her house",
                "Jessie places you on her nightstand so you can get a better look around"
            ],
            "content":"<div class=\"\"><div> <span>\"Well good morning sleepy head\", Jessie softly coos while looking down at you in her arms. You smile and give a little nod \"morning\", you respond while snuggling deeper into Jessie welcoming arms. \"Your arms are soooo soft!\", you murmur raising your voice an octave higher. Embarrassed you put your hands over your mouth and clear your throat. Jessie lets out a little laugh. \"What? What's so funny\", you say(your face reddening). \"Your just so...so...cute!!\", Jessie giggles. Your more than a little annoyed at being called cute and it shows on your face. Jessie quickly covers her grinning mouth and changes the subject. \"So.....sleep well?\", she asks. \"Very well.\", you reply stiffly deepening your voice. Jessie tries very hard not to burst out laughing not wanting to upset her little professor. You suddenly feel bad about acting so angry toward Jessie after she's being very nice to you. \"Sorry Jess, I'm just not used to being so small\" you say smiling a little. \"Don't worry about it\", replies Jessie smiling back, very pleased about the little nickname Professor Harris used for her. \"um...do you want me to put you down somewhere so you can stretch your legs or something?\", asks Jessie. You suddenly don't what to leave her arms as you feel very safe there. \"um...maybe I could just stay here in your arms but I can go either way.\", you try to say as if you don't care (even though you do).<br>\r\n\"Well...Jessie says how about.......\"</span></div></div>",
            "created":1180242000,
            "id":411415,
            "title":"Cute Little Professor"
        },
        "114111":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "a bowl of cereal",
                "some celery sticks"
            ],
            "content":"<div class=\"\"><div> <span>As if reading your thoughts Jessie decides to keep you in her arms so you can get a better tour of her house that way. You can't help but sigh a little with relief and Jessie tries not to smile. \"Well this is my bedroom as you can see and over here is the bathroom.....\"Jessie continues and shows you around her entire home with you safely tuck away in her arms. You suddenly realize that you have to pee...really bad. \"um....uh....Jessie?\",you stammer. \"Yes Professor is something wrong? Am I holding you too tight\"?,asked Jessie concerned. \"No...no..at all...it just that...um...well\", you just can't say it and look to Jessie for help. \"You have to go to the bathroom don't you Professor?\",asks Jessie biting her tongue. \"um...yea....really bad\",you reply rather sheepishly. \"Well what to you want me to do to um...help?\",she asks(face reddening). \"Well, what if you just hold me and not look.\", you say but secretly wishing she would look. \"okay\",she replies as she carries you toward the bathroom. <br>\r\nAfter you take care of business Jessie carries you out of the bathroom you catch a quick glimpse of her bra.'Oh shoot', you think as you notice a bulge forming in your pants. You notice Jessie take a quick glance at your rather embarrassing erection and then look away. \"um...Professor I'm going to make something to eat, are you hungry?' she asks not looking at him trying not to giggle. You suddenly realize that you are very hungry. \"Now that you mention it I'm very hungry Jessie. Could I have something to eat?, you ask grateful for a subject change. \"What would you like to eat?\" asks an equally relieved Jessie.</span></div></div>",
            "created":1180328400,
            "id":411464,
            "title":"Nature Calls"
        },
        "11412":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "Bath Time continues"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to Jessie's fingers gently stroking your tiny face. \"Well good morning sleepy head! Did you sleep well?\" Jessie asks smiling down at you. You stretch and yawn. \"Very well, thank you.\", you respond rather happily. Jessie continues to smile and stops stroking your face, to your disappointment. \"You don't mind that I was stroking your face do you Professor?\",inquires Jessie nervously. You laugh. \"Not at all...I was actually enjoying it\",you reply grinning. Jessie smiles another soft smile. You think it looks very pretty on her and mention this to her. \"Thanks\", giggled Jessie, \"Your smile looks good on you too.\" As you both grin at each other for a moment you cringe in pain and Jessie gasps and notices the bruises on your body from those two students who hurt you. \"Oh! Professor\",she exclaims, \"look at these bruises all over your body! Why didn't you tell me earlier about them!\" She looks very worried and guilty as if it's her fault you had gotten so brutally hurt. You shrug silently. \"I don't know I guess with all of the excitement I forgot.\" \"Well I can run a bath for you in the sink if you want\",she offers,\"just use your pants as a swimsuit they shouldn't take too long to dry.\" Just the thought of warm water relived you from a little bit of your pain. You nob vicariously. \"Good idea\", you say I could use a bath. \"Do you want me to wash you since the wash cloth and soap are so big or do you want to do it yourself?, asks Jessie. You grin sheepishly. \"How about both?\",you say feeling a rather large bulge in your pants. \"Okay\", says an equally excited Jessie.<br>\r\nJessie gingerly picks you up and carries you off to the bathroom. As Jessie is filling up the sink you lean against a washcloth and remove your shirt. You have a very fit body and are proud to show it off. \"Wow!\", grins Jessie,\"You're no stranger to the gym, are you?\" \"Nope\", you reply returning the grin. Jessie gently lowers her hand to you and you climb onto it.</span></div></div>",
            "created":1180328400,
            "id":411478,
            "title":"Bath Time"
        },
        "114121":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "Jessie removes your underwhere",
                "Jessie stops at your boxers"
            ],
            "content":"<div class=\"\"><div> <span>As Jessie lowers her hand to the sink you climb carefully off of it. Being careful not to let you fall Jessie starts to fill up the sink. \"Do you want a bubble bath, David?\", asks Jessie. You look up in surprise and playfully raise your eyebrows. \"David? Did you just call me David?, you say teasingly. \"Oh! Oops! Sorry Pro--\" \"David is fine.\", you reassure her. \"After all you are seeing me without a shirt on!\"  Jessie laughs. \"Okay...David. Do you want a bubble bath or not?\", she says while playfully poking you in the stomach. You bend over and laugh. \"Wait I'm ticklish!\",you say happily. Jessie notices that you do not tell her to stop but doesn't say anything and only giggles with her hand over her mouth. \"Okay I'll take a bubble bath\", you finally say still laughing. Jessie grins and starts to pour the bubble bath mixture in. As you watch her you can't help but notice how thin and beautiful she is. 'She looks like a model', you think to yourself while still watching in awe of her. You especially like the fact that she is so gentle with you and you consider yourself lucky to have been found and taken care of by her. \"Ready\" she asks you. You blink and pull yourself together. \"You bet Jessie!\", you respond still smiling. And with a giant(to you) splash, your in the water looking up at Jessie's smiling face. \"This is nice!\",you say while washing yourself. \"um Pro-uh-David can I ask you something\",she asks her face reddening. \" \"Sure Jessie anything\", you say while lying on your back. \"Could I hold you for a minute\", she asks not looking at you. Surprised, you look up and raise you eyebrows. \"Jessie you've held me a million times. Of course you may\",you say smiling. \"No...well I know but....without any pants on...you\",she says looking away. \"um\", you ponder this for a moment. \"Wait\", Jessie says \"forget I even said it.\" \"No\" you say,\"You...can\" Not quite believing you agreeing to this. \"Really?\", Jessie asks.\"Are you sure?\" \"Yes\", you say out flatly. You've never been any surer in your life. \"Okay...if your absolutely sure....thanks\", she says. Tentatively she gently wraps her hand around you and gingerly hoists you out of the water. She looks at you a moment for your okay and then begins to unzip your tiny zipper. You push your butt up a little so she can get your pants off easier leaving you only in your red checkered boxers. \"Red checkers?\"Jessie giggles,\"It's weird to see you without a suit and tie.\" \"Yea a lot of people say that.\", you grin jokingly. <br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1180414800,
            "id":411888,
            "title":"Red Checkered Boxers"
        },
        "115":{
            "choices":[
                "You climb on Cathy's shoes",
                "Wait for help from another teacher."
            ],
            "content":"<div class=\"\"><div> <span>  It takes some time for you to realize how small you are. You wonder how you get get anywhere at this small size without being stepped on. Then you spot Cathy Wallace an eighteen year old senior standing outside your class room. It appears she is reading a posted notice.Cathy has long jet black hair a beautiful face and figure .She is generally considered the sexiest girl in the school. You decide to </span></div></div>",
            "created":1087189200,
            "id":203227,
            "title":"What does a Shrunken Teacher Do?"
        },
        "1151":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "in the receptionists handbag which is behind the desk",
                "on the carpet under the reception desk"
            ],
            "content":"<div class=\"\"><div> <span>You decide after a short thought to climb Cathy's shoes. Its risky but it would take you ages to walk anywhere.<br>\r\nIt takes you a while to climb her shoe but once you're on it you hold on to her laces as she walks down the corridor towards the lockers.<br>\r\nShe stops at the lockers and opens hers, inside she puts her bag and a folder. Cathy closes the door and then walks back along the corridor. She goes into the reception and stands next to the counter. Such a sudden stop makes you loose your grip on her shoelaces. You are thrown from her shoe and land<br>\r\n</span></div></div>",
            "created":1088658000,
            "id":205517,
            "title":"Riding Cathy's shoe"
        },
        "11511":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Next chapter (waking up from your sleep)"
            ],
            "content":"<div class=\"\"><div> <span>Being thrown from Cathy's shoe sends you through the air and after a few seconds of flight you land on something soft. You look around and see a tube of lipstick, a hairbrush and two boxes of chewing gum.<br>\r\nAfter a few minutes surveying your surroundings you work out you must be in someone's handbag.<br>\r\nYou try to climb towards the opening and keep falling back.<br>\r\nAfter enough attempts you are knackered and decide to stay where you are, at least your safe from being stepped on. Before you know it you are asleep, finding the soft contents of the handbag very comfortable.<br>\r\n</span></div></div>",
            "created":1088658000,
            "id":205518,
            "title":"Trapped in the receptionists handbag"
        },
        "115111":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Louise & Claire's mother",
                "One of the girls"
            ],
            "content":"<div class=\"\"><div> <span>When you wake up you see daylight but this time it seems that you are at the ladies house. From looking around the handbag has been placed on the kitchen worktop.<br>\r\nYou decide now is the time to get out of the handbag while you have a chance.<br>\r\nYou climb this time reaching the zip totally out of breath. <br>\r\nSliding down the side of the bag you land rather painfully on the worktop.<br>\r\nA short distance away is a few plates and other items of crockery.<br>\r\nThen you hear voices approaching and also the sound of feet.<br>\r\nInto the kitchen come two girls. One who looked about 10 or 11 and the other probably about 15. They both went towards the plates picked one each and went out of the kitchen.<br>\r\nA few minutes later they returned. The elder girl then took some tomatoes and other salad things and began to chop them up dumping them into a small dish.<br>\r\nThe younger girl then comes towards you. You jump behind the sugar bowl hoping she hasn't seen you. Thankfully she hasn't and she begins chopping some mushrooms and carrots.<br>\r\n\"Louise can you get some potatoes from the garage please.\" came a ladies voice from what seemed upstairs.<br>\r\n\"Will do mum,\" replied the older girl who went out of the kitchen.<br>\r\nYou venture slowly out from your hiding place to see what's happening. The younger girl was still chopping the carrots and mushrooms and put them in the dishes with the salad.<br>\r\nSuddenly a daddy-long-legs crawls out from behind the coffee jar and has obviously spotted you.<br>\r\nOut of the corner of your eye you spot it and run across the worktop away from the young girl.<br>\r\nYou look back and see the daddy-long-legs disappear down the side of the counter.<br>\r\nStill looking behind you trip on something on the counter and fly through the air.<br>\r\nYou see a white plastic bowl on the counter and you're on a direct path to it. After a few seconds you land in it. The bowl is half filled with a fine brown powder that on closer inspection is Chocolate Angel Delight.<br>\r\nLooking up you know you haven't got a chance of climbing out of the bowl. The sides are too high and too slippery.<br>\r\n\"What we got for pudding mum\" came the other girls voice as she came back with some potatoes and began chopping them.<br>\r\n\"Chocolate Angel Delight.\" her mother replied her voice sounding very close so she must of come into the kitchen.<br>\r\n\"Great I'm going to be pudding for one of them unless I can escape.\" you say to yourself.<br>\r\n\"Are all the carrots and mushrooms chopped now Louise,\" asked her mother<br>\r\n\"Yes all done.\" Louise replied<br>\r\n\"Right if you set the table Claire, then I'll do the cooking.\" replied her mother<br>\r\n<br>\r\nYou sat for what seemed hours in the bowl unable to do anything. Then Claire's voice came as she entered the kitchen.<br>\r\n\"I'll start making the pudding.\" she said<br>\r\n\"Oh no. Now I'm in big trouble.\" you say<br>\r\nClaire sticks the kettle on to boil and then gets a whisk. When the kettle boiled she began to pour it into the bowl of Angel Delight.<br>\r\nThe hot water hit you and you screamed, as it was very hot. Claire then began to whisk up the powder until it thickened. <br>\r\nAs she whisked it up you were mixed into the chocolate which was now very thick.<br>\r\nClaire took the whisk out and licked the chocolate off.<br>\r\nLooking up you saw that she was a cute girl. She had long brown hair and bright green eyes.<br>\r\nClaire got three bowls and poured out the pudding equally into them. She then took two bowls and put them down on the table. One in front of her mother, the other in front of Louise. She then returned to the kitchen and collected the final one and took it to the table. She put this one on the table and then sat down at her place.<br>\r\nWhich person's bowl are you in? <br>\r\n     </span></div></div>",
            "created":1088658000,
            "id":205537,
            "title":"You're served as pudding, but to whom?"
        },
        "1151111":{
            "content":"<div class=\"\"><div> <span>Choking on the viscous, yet delicious, substance surrounding your body, you reach out for the edge of the bowl. Your limbs want to move, but the skin still sears from the scalding received earlier. The incoherent bellowing of giants around you seems to mock your ill-fated predicament. <br>\r\n<br>\r\n“They don’t even know,” you think. “Here I am, a man, a professor of science! Yet, I’m drowning in a bowl of pudding in some receptionist’s household while she idly chatters on with her daughters. I am a man damn it. I am significant!”<br>\r\n<br>\r\nThe pudding has started to engulf your body, blocking out all coherent thought. Primal survival instincts kick in as you thrash wildly to escape your impending doom.<br>\r\n<br>\r\n“Ohcrapohcrapohcrapohcrapohcrap…” you think frantically. <br>\r\n<br>\r\nYour body cannot move. It is like trying to swim through quicksand. The harder your struggle, the faster you sink. All you can do is listen to the sickening, sucking sound of the pudding.<br>\r\n<br>\r\nA conversation…<br>\r\n<br>\r\n“Girls… I’ve got some news,” the mother booms.<br>\r\n“What?” Louise responds through a mouthful of food.<br>\r\nThough you cannot see it, you know she is blushing. “Well, I’m… I’m going on a date.”<br>\r\n“Wow! Really?” Claire responds through a mouthful of food. “Who is it?”<br>\r\n“Someone from the school,” she chuckles. “He’s a professor.”<br>\r\n<br>\r\nThat voice. You know that voice. It’s… No… The face is blurry. You keep seeing your wife instead.<br>\r\n<br>\r\nSuddenly, your body jolts upward. Your brain snaps back into reality. Something metal… and cold has supported your feet. High in the air above the bowl, you finally escaped drowning in the pudding. Fresh air never tasted so sweet.<br>\r\n<br>\r\nHer face is clear now. Green eyes, like clover. Strawberry hair. A plump round face. Early forties. Her name… It is… Cecilia, a receptionist at the college. The two of you are good friends, very good friends. You have known her ever since you started working as a professor. She told you she was going on a date today, and you were happy for her.<br>\r\n<br>\r\n“Cecilia,” you think. “All this time and I didn’t realize it.” <br>\r\n<br>\r\nHer mouth opens revealing the horror within. Strands of saliva connect the roof of her mouth to her delicate tongue. Masticated potatoes and carrots decorate the grooves of her slightly off-white teeth. A warm wave of breath smelling of previously eaten vegetables washes over you. The tongue undulates in anticipation as Cecilia’s uvula glistens. <br>\r\n<br>\r\n“Cecilia!” you scream. “Look here! It’s me, David! Don’t eat me!”<br>\r\n<br>\r\nThe spoon stops for a moment, and Cecilia pauses to reflect upon something. Has she seen you? Does she know you are there?<br>\r\n<br>\r\n“Girls, what do you think?” Cecilia booms.<br>\r\n“What’s his name?” Claire responds through a mouthful of food.<br>\r\n“Charles. Charles Bremen. David introduced me to him.”<br>\r\n<br>\r\nShe draws the spoon to her mouth. The light fades. You wade frantically through the pudding to escape, but it is far too late. Darkness and humidity sweep over your tiny body. A pungent mix of vegetables and bodily secretions causes you to gag. The spoon jerks backward, and her upper lip scraps you from the spoon, flinging you upon her tongue. The pudding rolls around her mouth as Cecilia’s tongue savors every moment. The tip of the tongue rises to the roof of her mouth. You have seen enough videos from the Anatomy and Physiology class your fellow colleagues teach to know what comes next. The rest of the tongue pushes squeezes you toward her awaiting throat. An indescribable squelching noise ensues. Cecilia swallows.<br>\r\n<br>\r\nYou have given up all hope. The slow dissension down her gullet gives you a few seconds to reflect upon your life. Your daughters and your wife. You want them to never forget you. What will they think of your disappearance? Will they assume you left them for another woman? Well, involuntarily you have. Cecilia has taken you away from them, gluttonously ingesting your miniscule figure without ever knowing it.</span></div></div>",
            "created":1101790800,
            "id":227449,
            "title":"A Vain Attempt at Survival..."
        },
        "1151112":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "Louise's",
                "Claire's"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're in the bowl that is in front of one of the girls.<br>\r\n<br>\r\nWhich of them are you to be pudding for?</span></div></span></div>",
            "created":1088658000,
            "id":205541,
            "title":"Who' pudding are you"
        },
        "11511121":{
            "author_id":"gamer",
            "author_name":"gamer",
            "choices":[
                "She notices you",
                "She doesn't notice you"
            ],
            "content":"<div class=\"\"><div> <span>You feel the bowl get set down with a bit of a thump.  When you look up, you shiver as you realize that you are staring up at the youthful, eager looking face of Louise.  She is sitting down just in front of you, and is staring down into her pudding with a look of strong, eager hunger in her young eyes.... You have little doubt of what's going to happen if you can't get out of this pudding!<br>\r\nSlowly, Louise leans down towards her bowl of pudding.  She takes a sniff of it, then looks up to her mother, and beams. \"It smells wonderful mom! I am still hungry, I can't wait to eat it all up!\" She grins, then looks down towards her pudding again, and leans in again, like she's going to take another sniff.  But, instead, you hear her voice say, very very quietly to you, so no one else can hear... \"You are very lucky, pudding.  I'm the one that's going to eat you, instead of the others.  I hope you enjoy my tummy.  I'd play more, but I can't out here...\" Then she leans back again, and beams down at 'you', looking sweet, innocent, playful, and, subtly hungry.  She licks her lips with a soft, pink tongue, as she picks up her spoon.  She reaches down with it, and scoops out the first spoonful of pudding.<br>\r\nYou yelp in terror, and dive to the side, trying to avoid that spoon, not wanting to get scooped up by this hungry young girl.  What she said just now put a real chill in your bones, gave you a true sense of dread for your fate.... You know you can't stay in here, that's certain doom.  And yet, if you are caught by her, somehow you get the sense that she wouldn't be all that gentle to you.  She seems to enjoy playing with her food quite a bit, so what would she do with something like you, if she had you all to herself?<br>\r\nYou scream again, as another spoonful of pudding gets spooned up.  You can feel the cold metal rub against you, coming within inches of scooping you up with it.  You shiver, and decide to take the risk, before you start waving your arms desperately, hoping to get this young girl's attention, before it's too late!</span></div></div>",
            "created":1179637200,
            "id":409585,
            "title":"In Louise's Pudding"
        },
        "115111211":{
            "choices":[
                "Nutrition is more important",
                "Her feet need attention and love"
            ],
            "content":"<div class=\"\"><div> <span>As she brought her spoon down for another bite, she sees your tiny body. She's surprised at first, then smiles. It scares you a little that she has full control over the situation now. Maybe this wasn't such a good idea. After all, if she wanted to, she could destroy you with the garbage disposal, or completely drown you in her food. Louise looks up at her mother.<br>\r\n<br>\r\n\"Is it alright if I finish this in my bedroom?\" Her mother nods, making her excited. As Louise travels upstairs, everything is shaking for you. At this point, you could only hope that she didn't hurt you. The two of you made it upstairs and onto her bed. She brought the spoon under you and lifted you up to her giant mouth. Her tongue licked the organic doorways. \"Well hello there little one. It's so nice for you to join me for a snack. You know, you are really cute, I could eat you up.\" She gave you a small lick, making you fall over. \"Maybe I will, but it has occurred to me that you could be useful to me. I could use a footslave, and I may never find one like you again.\" She makes you wait for her decision, trying to scare you. Finally, she decides . . .</span></div></div>",
            "created":1497390120,
            "id":2335292,
            "title":"Your life is on her spoon now"
        },
        "11511122":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "choices":[
                "the spoon scoops you up with a load of Delight.",
                "Claire has had enough of her pudding"
            ],
            "content":"<div class=\"\"><div> <span>You're in the bowl that is in front of Claire. Looking up you can see she has short blond hair and blue eyes. She has a perfect white smile and is wearing a retainer on her top teeth. She is wearing a pink v-necked t-shirt with some 'Protect your eyes, you only get one pair' written on in bold white text.<br>\r\nThen you see a huge sliver object descend towards you. The spoon lowered down into the chocolate Angel Delight, and you swim to avoid the marauding metal scoop. Claire picked up a spoonful and raised it up to her face. You watched as the spoon disappeared into her mouth.  \"Unless I can find a way out of this mess then I'll be eaten alive by a cute teenage girl! The thought terrified you and sent a shiver down your back.<br>\r\nAs the spoon descended again Claire it came very close to scooping you up as she picked up another spoonful.<br>\r\nClaire was unaware that a teacher was trapped in her pudding.<br>\r\nClaire lowered the spoon into her pudding. She once again came dangerously close to scooping you with the spoon, the spoon moving by inches from your current position.<br>\r\nYou were pulled under the surface of Claire's pudding in the current left in the spoon's wake. You knew that you couldn't last much longer. Just then... <br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1088658000,
            "id":205546,
            "title":"Cute Teen Girls Pudding"
        },
        "115111221":{
            "author_id":"hannah94",
            "author_name":"Hannahbell",
            "content":"<div class=\"\"><div> <span>Shortly you surface coughing and spluttering as the Angel Delight had got up your nose and prevented you from breathing.<br>\r\nYou look up at Claire and see that she is laughing and joking with Louise and her mother. Having caught some of the conversation you presume Louise is Claire's sister.<br>\r\nClaire looked down into her bowl of pudding;, she dipped the spoon into the pudding and scooped up a full spoonful near the middle of the bowl. She raised the spoon up to her face and stopped.<br>\r\nYou feel terror grip your heart as you notice the spoon was moving towards you!<br>\r\n\"Noooo\" you scream, but the spoon moved into the bowl several feet away to your right and now your worst fears were realized as the spoon glided through the Delight and scooped you up with ease.<br>\r\nClaire began to slowly move the spoon forward towards her lucious pink lips. She was totally oblivious to the tiny passenger on her spoonful of Angel Delight, a shrunken science teacher.<br>\r\n\"Please, don't eat me!\" you scream as Claire slowly parted her gigantic, glossy pink lips and opened her mouth, exposing her gargantuan pink tongue and huge sets of white teeth. In the back of her mouth was a gaping black hole that was the entrance to her throat. You continued to scream as the spoon moved closer and closer to the girls open mouth.<br>\r\nHe felt the girls warm breath wash over him as the spoon moved within inches of disappearing into her mouth.<br>\r\nThe light from the room lights her oral cavity quite well and you can see clearly the insides of this girl's mouth.<br>\r\nThen darkness begins to fall as Claire closes her mouth trapping you inside. Suddenly you are tossed backwards and crash into one of her huge molars. Then you feel powerful muscles pulling you downwards. Your pushed into a slick tube and then as Claire swallows her mouthful her throat muscles push you down. Next stop this girl's belly. <br>\r\nAfter a few seconds of free fall where you are unable to scream or make any sound as the walls of Claire's throat are pressed tightly against your body you land with a thud in her stomach on a pile of chewed up food. It's hot and sticky in her belly and the smell is horrid.<br>\r\nClaire meanwhile pours herself a drink and gulps it down, as she was quite thirsty.<br>\r\nA deluge of liquid descends on you and drenches you.<br>\r\nClaire gets up from the table and goes into the living room. She turned on the telly and watched some of the news. <br>\r\nIn Claire's belly her stomach acids were beginning to break you so you could be absorbed into her body.<br>\r\n\"What a way to die. Eaten alive by a cute teenage girl.\" you say as the acid starts to burn your body.<br>\r\n<br>\r\nAs Claire starts to read a magazine you've been absorbed into her body and your now part of her.  <br>\r\n<br>\r\n <br>\r\n<br>\r\n <br>\r\n  <br>\r\n<br>\r\n <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1088658000,
            "id":205552,
            "title":"Claire's eaten you with pudding"
        },
        "11512":{
            "choices":[
                "Roll to the right!",
                "Run toward the chair!"
            ],
            "content":"<div class=\"\"><div> <span>You collide with the carpeted floor, bouncing several times before coming to a halt. The world around you twists erratically as you attempt to stand up. Upon placing your left hand on the ground to steady yourself, pain shoots through the entire arm. Something clicks…<br>\r\n<br>\r\n“Ah! Damn it,” you scream, grasping your left arm.<br>\r\n<br>\r\nYou hold out your shaking arm to see exactly what happened to it. Feeling along the forearm slowly you check for breaks and muscle damage. Nothing. You continue up the arm. Still nothing. Finally, you reach the shoulder. Like someone had pelted your arm with a brick, you feel the pain course through your entire body. <br>\r\n<br>\r\n“It must be dislocated,” you say through clenched teeth.<br>\r\n<br>\r\nLuckily, you know what to do. Unfortunately, you do not have the time to do it. A receptionist’s pump slams down in front of you. You have landed underneath her desk.<br>\r\n<br>\r\nYour arm still courses with pain, but you know that would be nothing compared to being crushed underneath her mammoth foot. The receptionist rolls her chair back to grab something on the table behind her and allows you to get a look at her face. Clover green eyes, strawberry hair, plump face… It could only be…<br>\r\n<br>\r\n“Cecilia!” you scream aloud in surprise.<br>\r\n<br>\r\nCecilia, one of your good friends at the college, is right above you, and she does not even know it. She rolls her chair back forward and plants her feet firmly on the ground, nearly crushing you. Looking to your left, you see a gigantic black pump and to the right, the exact same thing. You look up and see her legs extend skyward to the edge of the chair.<br>\r\n<br>\r\nThe clamoring sound of a telephone can be heard. Cecilia picks up the phone and being talking in her booming voice. You realize you need to get away from her feet immediately as Cecilia decides to shift her pumps.<br>\r\n<br>\r\nHer right foot looms directly above you!</span></div></div>",
            "created":1101790800,
            "id":227456,
            "title":"A Dislocated Arm and a Giant Foot"
        },
        "115121":{
            "content":"<div class=\"\"><div> <span>A dive to the right into a roll turns out to be a mistake. Landing on your left shoulder, pain explodes through your arm; accordingly, your escape falters. You end up flat on your back staring at Cecilia’s descending pump. You scramble to get back up, but your arm refuses to cooperate with you. The house-sized shoe looms closer and closer as the musty smell of dirt and dust increases. Slowly, the pump pushes on your body squeezing the breath from your lungs. <br>\r\n<br>\r\n“Cecilia,” you choke. “St-top… P-p-plea—”<br>\r\n<br>\r\nThe crushing force of Cecilia’s foot dwarfs the pain in your shoulder. Quickly, the suffering intensifies as your ribs snap backward driving themselves into your heart and lungs. At the same time, your cranium gives way and your brain matter spills into the fibers of the carpet.<br>\r\n<br>\r\nCecilia continues chatting with a parent who needs information on her daughter’s grades, unaware she just snuffed out the life of one of her closest friends.</span></div></div>",
            "created":1101790800,
            "id":227459,
            "title":"Pain Upon Pain"
        },
        "115122":{
            "choices":[
                "she steps on you",
                "she traps you underfoot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you run towrads the chair to avoid her. then you yell up to her. upon hearing your voice she looks to the floor and laughs. slipping off her heels she approaches you.</span></div></span></div>",
            "created":1110949200,
            "id":240279,
            "title":"spotted"
        },
        "1151221":{
            "author_id":"dklo",
            "author_name":"plotist",
            "content":"<div class=\"\"><div> <span><br>\r\nYou see how Cecilia takes off her pumps, She was wearing a totally black pantyhose, from your perspective she was beautiful, but at this moment it seems to you the goddess of death, and the worst was her expression, she kept talking on the phone but her smile macabre gave you the chills.<br>\r\n<br>\r\nYou turn around and start running, but you feel great force throwing yourself to the ground, you turn and it was her fingers, she moved her leg and began to crawl towards her.<br>\r\n\"Cecilia, what have I done to you, please!\" You start to scream and try to escape, suddenly you are already next to her bombs, she twists you a little on the ground with her foot, leaving you with a lot of pain and unable to move , puts his thumb on your foot and crushes you a little more, leaving you totally invalid to run away.<br>\r\n<br>\r\nSo you see it, he starts putting his foot on his gigantic pumps again, and slowly puts his high heel on your legs, breaking them.<br>\r\n<br>\r\n\"Cecilia !!!!! BUT BECAUSE !!!!<br>\r\nYou see her face and she really enjoyed it, with her bomb on, she drags you to the front of her bomb, but at her desk exit, then you see her stand up, hanging up the call and saying \"AGG a bug\" You see her bomb fall quickly, twisting and flattening you completely, leaving a red stain on the ground.</span></div></div>",
            "created":1586558280,
            "id":2816872,
            "title":"she steps on you"
        },
        "1152":{
            "choices":[
                "No choice .Go to Sara for help",
                "Climb on her shoes without her knowledge."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> It seems like you wait is forever. Then you see Sara Wells a teacher. Sara is a pretty and young but the two of you have never gotten along. You consider her to be kind of wild. You know she does not like you either.</span></div></span></div>",
            "created":1100926800,
            "id":226301,
            "title":"A Teacher comes"
        },
        "11521":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "One of the brunettes",
                "One of the blondes"
            ],
            "content":"<div class=\"\"><div> <span>You're only two millimeters tall, so you're going to have to trust someone eventually. You approach Sara and try to yell so she can hear you, but she turns and walks away from you without hearing you. You see her turn a corner at the far end of the hallway, and she is gone. <br>\r\n<br>\r\nYou are alone in the hallway for a few moments, but then a group of teenage girls are coming your way down the hallway. There are four of them, all about sixteen years old. The two on your left are brunettes. One has green eyes, the other has hazel eyes. The two on your right are blondes, one with blue eyes, the other with gray eyes. You've made the decision to surrender to one of these girls. Who do you approach?</span></div></div>",
            "created":1205217060,
            "id":507596,
            "title":"Try go to Sara for help"
        },
        "115211":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "The brunette with green eyes",
                "The brunette with hazel eyes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you try to get the attention of the brunette with green eyes, or the brunette with hazel eyes?</span></div></span></div>",
            "created":1205288520,
            "id":507802,
            "title":"Which one of the brunettes?"
        },
        "115212":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "The blue-eyed blonde",
                "The gray-eyed blonde"
            ],
            "content":"<div class=\"\"><div> <span>You've decided to get the attention of one of the blondes, but you're not sure which blonde you will choose. The one on the left has blue eyes, and the other blonde has gray eyes. The gray-eyed blonde has blonde hairs scattered across her plump forearms, but the blue-eyed blonde has smooth skin. They both seem to have nice legs. Which blonde do you choose?</span></div></div>",
            "created":1205288760,
            "id":507805,
            "title":"Which one of the blondes?"
        },
        "1152121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "kill it?",
                "Inspect it?"
            ],
            "content":"<div class=\"\"><div> <span>\"Help me!\" you squeak up at the blue-eyed blond. She looked nicer than the other.<br>\r\n<br>\r\nHearing a peculiar noise, but not able to tell the point of origin, she looks around, curiosity eating away at her. Finally, she sees a \"bug\" on the floor. Does she?</span></div></div>",
            "created":1435275000,
            "id":1998885,
            "title":"The blue-eyed blonde"
        },
        "1152122":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "She wants to do something mean to you",
                "She wants to help you"
            ],
            "content":"<div class=\"\"><div> <span>You stand two millimeters tall, so if you don't get someone's attention, you're in a lot of trouble. You position yourself in the path of the two blondes, and run back and forth in front of the gray-eyed blonde as she approaches.<br>\r\n<br>\r\n\"Look!\" said the gray-eyed blonde, \"Something is moving on the floor!\"<br>\r\n<br>\r\n\"Stomp on it!\" said one of the brunettes.<br>\r\n<br>\r\n\"No, I don't think it's a bug,\" said the gray-eyed blonde. She knelt down and reached out for you. \"It's a little man!\"<br>\r\n<br>\r\nShe licked the index finger of her right hand, and pressed down on you until you were adhered to her finger, then she lifted you up and wiped you onto the surface of her left palm. You find yourself looking up into the beautiful face of Christine Logan, a student of yours.<br>\r\n<br>\r\n\"It's Mr. Harris! He's shrunk! Do you know what I want to do with him?\"</span></div></div>",
            "created":1205289600,
            "id":507809,
            "title":"Captured by the gray-eyed blonde"
        },
        "11521221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "eat you ",
                "squish you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see Christine's eyes narrow, and her mouth curl up into an evil grin. \"I think I want to...</span></div></span></div>",
            "created":1381974300,
            "id":1680221,
            "title":"She wants to do something mean to you"
        },
        "12":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Arriving at your place of work (college)"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Laura Powell, you are 37 and two years ago you graduated with the highest grade possible after doing Bsc Hons Science &amp; Technology<br>\r\n<br>\r\nYou are now Head of Science and a Chemistry teacher at Roeburgh College.<br>\r\n<br>\r\nYou are married to Neil who is 38. Neil is a Qualified Flying Instructor in the RAF and works at the RAF base near where you live. You have two sons (Jack &amp; Matthew) and a daughter (Lydia)<br>\r\n<br>\r\nMatthew, is 6 and has short brown hair and brown eyes.<br>\r\n<br>\r\nJack, is 8 and has short blond hair and blue eyes.<br>\r\n<br>\r\nLydia, is 16 and has long brown hair and brown eyes. She is a beautiful girl and loves to party with her friends.<br>\r\n--------------------------------------------------<br>\r\nAs the numbers click over to 7am your alarm sounds. After a few seconds you turn over and switch it off.<br>\r\nYou get up and have a shower and go downstairs into the kitchen.<br>\r\nGetting a bowl you pour yourself a bowl of cheerios and sit down at the table looking through the morning mail. You find a letter addressed to you and open it eagerly as it is from your friend who is on holiday in Spain. As you are reading your daughter comes into the kitchen.<br>\r\n\"Morning dear.\" you say between mouthfuls of cereal.<br>\r\n\"Morning mum.\" Lydia replies as she goes over to the fridge and pours herself a glass of orange juice. She then puts two slices of bread into the toaster and waits patiently for it to toast.<br>\r\n<br>\r\nYou finish your breakfast and put your dish into the dishwasher.<br>\r\n\"Right I'll see you this evening dear. you say to your daughter as you go down the hallway and put your shoes on.<br>\r\nYou pick up your briefcase and step out onto the drive.<br>\r\nUnlocking your car you put the briefcase onto the seat and close the car door.<br>\r\nYou start the engine and turn the car round and then drive down the long drive to the main road.<br>\r\n<br>\r\n</span></div></div>",
            "created":1086411600,
            "id":215734,
            "title":"A normal morning routine"
        },
        "121":{
            "choices":[
                "she steps on you",
                "she puts you in her shoe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you sudenly spill a chemical on you and you begin to shrink. thats when a cute red head approaches you and looks down at you and laughs.</span></div></span></div>",
            "created":1110949200,
            "id":240275,
            "title":"shrunk"
        },
        "1211":{
            "author_id":"reflux2000",
            "author_name":"reflux",
            "choices":[
                "Pauline walk with you under her shoe to boss, to announced that you are absent. ",
                "Pauline loose you during her walk to boss."
            ],
            "content":"<div class=\"\"><div> <span>It was your deputy, Pauline. She prepare the chemical and have hope, that will shrink you. <br>\r\nPauline want to be head of department and you ware an obstacle to achieving the objective.<br>\r\nShe knew she will be in charge if you will be absent and after some time everybody will forget about you and she will not be deputy but she will be a chef. <br>\r\n<br>\r\nYou saw her and you have been glad that somebody saw you and you will be saved. You didn't know what happened. <br>\r\nShe put her leg in the air and stomp at you hard.<br>\r\nThis chemical have others actions except shrinking. It also give you big flexibility. You see in horror sole of her shoe and later only blackness. <br>\r\n<br>\r\nOnly sound was \"splash\" as you have been squish under her sole and floor. Pauline put all her weight on this leg. It's hurt you a lot. You have been looking up, when she step on you so now you see nothing. <br>\r\nShe make step back to pick you up and hid but there was no sign after you. She rise her foot and saw you stick to her sole. She struggled arms and went to her desk. <br>\r\nEvery step make big paint to you, but you ware unable to do anything, even screen. She sat and put leg on leg, whit you pressed to the floor and her shoe and drink her coffee with smile on her face. </span></div></div>",
            "created":1429343400,
            "id":1965842,
            "title":"she steps on you"
        },
        "12112":{
            "author_id":"reflux2000",
            "author_name":"reflux",
            "choices":[
                "stuck to the bottom of her shoe",
                "stay on the ground, flatted "
            ],
            "content":"<div class=\"\"><div> <span>Pauline has been siting at desk with you under her sole and drinking coffee.<br>\r\nAfter she finished her coffee, Pauline took cigarettes and went for smoke. <br>\r\nPauline want outside  trample you with every step. You didn't know what was happening, hurt with every her step. You didn't know what was going, why she is tread you like this. Pauline never told or show to you that she doesn't like you. Now you ware pulp under her shoe. <br>\r\n<br>\r\nPauline reached place where she can smoke and start smoking and thinking how to say about yours absence and take your place. <br>\r\nshe stand and smoking cigarette crushing you into the ground. When she finished her cigarettes she put cigarette end on the ground and without thinking on in crush it with shoe where you ware stick and scrape. Then she went away. <br>\r\n<br>\r\nYou ware swollen and sore but you stay with hot cigarette but on the ground. Reformation started very slowly. You heard some voices approaching to you. You recognize some of your students. You know that they are smoking but never catch them. Now one of them stepped on you and they start smoking. You ware at pain, again flat.   <br>\r\n</span></div></div>",
            "created":1429396080,
            "id":1966122,
            "title":"Pauline loose you during her walk to boss."
        }
    },
    "info":{
        "author_id":"vat69",
        "author_name":"Taylor",
        "brief_description":"10 of the staff at an all girls school accidently get shrunk during a science lesson.",
        "created":1086472260,
        "description":"<td align=\"left\" class=\"norm\">During a science lesson with 28 pupils, you spill some of the chemical you are using over your hands. Towards the end of the lesson you begin to shrink slowly. Your pupils find this funny and tease you.<br>\r\nWhat happens next. Read on and find out.<br>\r\n<br>\r\nPlease rate this story and add chapters on. Feel free to bring in other charcters.<br>\r\nRules:<br>\r\n1. If the character is in the confines of the school it can be male or female. For example it could be a new teacher or one of the girls boyfriends but no male pupils must be added.<br>\r\n2. No teachers are to be put down pants or in the toilet or peed on.<br>\r\n3. Pupils are free to do the following to the teachers: crush/eat/swallow/tease/use as slaves. The story shall be written from the teachers point of view.<br>\r\n<br>\r\nEnjoy the story<br>\r\nVicki XX </td>",
        "id":855326,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586558280,
        "modified":1586558280,
        "pretty_title":"Shrunken Teachers"
    }
}