{
    "chapters":{
        "1":{
            "author_id":"rmstitanic",
            "author_name":"Rothschild",
            "choices":[
                "Someone dropped it on the ground",
                "A strange package",
                "A wierd little store in the mall",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Our story begins, how does Chris find the pen?</span></div></span></div>",
            "created":1380492900,
            "id":1671885,
            "title":"Finding the pen"
        },
        "11":{
            "author_id":"rmstitanic",
            "author_name":"Rothschild",
            "choices":[
                "I will gain twenty pounds of muscle",
                "I will grow six inches",
                "My cock with grow three inches",
                "His brother and his friends interupt them",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Dude it's gonna be so cool having you at my place for the next few weeks,\" Chris said to his best friend Greg as the two of them walked from school to Chris's house. The two had been best friends ever since Greg moved in next door 5 years ago. Almost right away they both found they were interested in practically the same things, writing, video games, and baseball. Greg was a good looking guy at 5' 8\" with a lean enough build and shoulder length strawberry blond hair that had an annoying habit of falling over his face. In comparison, Chris was a little more homely with short brown hair and brown eyes.<br>\r\n\"Damn straight man. Say, where's your car?\"<br>\r\n\"Mom backed into it this morning trying as she was leaving so she had me take it to the shop.\"<br>\r\n\"Typical\" Greg laughed. \"Your mom's always in such a hurry that she has tunnel vision.\"<br>\r\n\"You're telling me.” Chris laughed and ran smack into Greg who had come to a stop in the middle of the sidewalk. “What the hell dude, move!”<br>\r\n“Check it out Chris!” They were now standing in front of two massive iron gates that closed off a road that lead to a huge mansion. It was known locally as the Devlin Mansion. It was built over a hundred years ago by Augustus Devlin, one of the founders of the town, for his wife and five sons. Unfortunately, shortly after completion, Augustus and four of his sons died in a shipwreck that left his wife almost penniless with a large house and a two year old son named Cloyster to take care of. She shut the two of them inside the mansion and was not seen again till her death almost 80 years later. Her son was rumored to be into some weird voodoo like rituals meant to make her live forever but instead ended up poisoning her with one of his “tonics”. When he died a few years later the mansion was boarded up and had quickly fallen into a sorry state on neglect. Greg pointed to a large sign that now hung on the gates.<br>\r\n“Looks like they’re finally gonna tear this place down.” He said.<br>\r\n“Bought time” Chris replied as he tried to push Greg along. “Now come on man, I wanna get home.”<br>\r\nAs he pushed, Greg suddenly shifted his weight, causing Chris to collapse onto the ground, spilling his stuff everywhere.<br>\r\n“Dammit man! Look what you made me do!”<br>\r\n“What did I do?” Greg said, feigning innocence.<br>\r\n“You’re an asshole, you know that?”<br>\r\n“The one and only.” Greg gave a little bow and started walking off.<br>\r\n“Where are you going?” Chris yelled after him.<br>\r\n“I’m going to your place; I can’t wait for slow pokes like you.”<br>\r\n“Fuck you!” Chris scrambled to gather his stuff when a glint of light caught his eye. Picking it up he saw it was a pen. It looked old and expensive with sliver inlays in the shape of a dragon and several teardrop sapphires. But it was what was engraved on the side that made Chris do a double take. “Hey man wait up, take a look at this.” Chris called out as he hurried after his friend.<br>\r\n\tBy the time he caught up to him, Greg was already at Chris’s house.<br>\r\n“Took you long enough.” Greg chided, making a playful swat at Chris.<br>\r\n“Ha ha, so funny. Seriously though man look at what I found.” With a theatrical flourish, Chris displayed the pen. “And look at what it says on the side, ‘Property of Cloyster Devlin’.”<br>\r\n“No shit man? That’s so cool!” Greg said as Chris led the way inside and then upstairs to his bedroom. “Looks like it’s worth something.”<br>\r\n“Yeah, but I don’t think I’d sell it. It’s really cool.”<br>\r\n“You think it still works?”<br>\r\n“Only one way to find out.” Chris pulled a sheet of paper out of his binder. “What should I write?”<br>\r\n“The fuck should I know? Write whatever the hell you want.”<br>\r\n“Seriously man.”<br>\r\n“Fine write out a goal, your fondest wish.”<br>\r\nChris thought for a second then began to write.</span></div></div>",
            "created":1380495420,
            "id":1671921,
            "title":"Someone dropped it on the ground"
        }
    },
    "info":{
        "author_id":"rmstitanic",
        "author_name":"Rothschild",
        "brief_description":"What happens when you find a pen that makes everything you write come true?",
        "created":1380492000,
        "description":"<td align=\"left\" class=\"norm\">Chris: Age 17, the finder of the pen. Best friends with Greg and younger stepbrother of David. Average kid, not a jock but not a geek. <br>\r\n<br>\r\nGreg: Age 17, one of Chris's friends. Practically a carbon copy of Chris personality wise. An only child who is staying with Chris while his parents are at a couples counseling retreat.<br>\r\n<br>\r\nDavid: Age 19, Chris's stepbrother. An uber jock, eats, sleeps, and breaths fitness. He's fairly stupid and was left back in senior year but is one of the star football players. Enjoys smoking marijuana with his friends in his room and working out.<br>\r\n<br>\r\nCheryl: Age 49, Chris's workaholic mother. She runs a successful photography studio in town and there for is rarely home. She was at one point a great beauty and has retained much of that into middle age.<br>\r\n<br>\r\nRyan: Age 50, David's dad and Chris's stepdad. He prefers to spend his days with his buddy’s playing poker then being a father.<br>\r\n<br>\r\nFrank and Dean: Age 18 and 19, David's friends. Brothers who are equally stupid as David but Dean managed to at least graduate.<br>\r\n<br>\r\n-Gay stuff is ok<br>\r\n-No fatness<br>\r\n-No bestiality<br>\r\n-No death<br>\r\n-It's ok to add characters<br>\r\n-I reserve the right to remove chapters I do not like</td>",
        "id":1955235,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1380495420,
        "modified":1380495420,
        "pretty_title":"The Magic Pen"
    }
}