{
    "chapters":{
        "1":{
            "author_id":"ninjax2306",
            "author_name":"W1N5T0N",
            "choices":[
                "toilet",
                "bath"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you wake up floating somewhere</span></div></span></div>",
            "created":1357275600,
            "id":1501433,
            "title":"Wetness"
        },
        "11":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Jenny: age 19 6'0",
                "Vivian: age 12 4'6",
                "Louis: mom age 34 6'6",
                "Someone Visits",
                "A bathroom outside of home"
            ],
            "content":"<div class=\"\"><div> <span>You wake up floating in your family's toilet. You don't know how you got there but, you knew you didn't want to get flushed so you started to devise a plan to get out of there. As you start thinking you hear foot steps toward the door. Who was it?</span></div></div>",
            "created":1457931600,
            "id":2117444,
            "title":"Toilet"
        },
        "113":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Does someone come in",
                "Does the toilet clog",
                "Does he survive some otherway"
            ],
            "content":"<div class=\"\"><div> <span>I would like to encourage people to bring old stories back to life.<br>\r\n<br>\r\nIn comes your mom. She shuts the door without locking it as was her way. After your mom shut the door she said” I have to take a huge shit”. After hearing this you knew two things. One was that your mom entered the bathroom and two you always thought your mom was attractive but this was not a good way to see your mom’s lower half. But as you were thinking of this your mom approached the toilet. You waved your arms but that was useless. She started to unbutton and unzip her pants and with that she pulled her pants down to her ankles you were given the best view of your mom lower half you ever seen. She then sat down on the toilet blocking most of your light out she left a little light in the back you can see everything. Your mom begins to grunt and push first thing you is your mom anus open and what came out was a huge sbd almost like a pfffffffffffffffffffffffffffffffffffffffffffffft the smell was terrible words couldn’t describe how bad it smelt you hated to think what the shit will smell like. The next thing you see is a yellow stream coming from your mom’s pussy so you move out of the way of her stream you couldn’t believe you were swimming in your moms piss and soon to be shit. Her stream lasted for about 2 minutes then her stream started trickle down to nothing. She said to herself been holding that all day. She grunted and pushed again this time another big sbd followed by a crowning turd you couldn’t believe your eyes you swam out of the way but still got a good view of what was happening she pushed again more descending with each push till about a 8 in turd fell in the water. Then your mom started to grunt and push again and another turd started to come out and kept pushing till another 8 in turd came out. Your mom pushed turd after turd out without a thought of you. Your mom pushed about 24 in. in shit and you couldn’t believe how much your mom actually pushed out but after the third turd a knock came to the door and said “mom I just had Mexican I need to use the bathroom.” Your mom responded with “it’s going to be a few more minutes.” After your mom was finished she stood up and grabbed some toilet paper and started wiping herself dropping her brown paper on top of you. Your mom had to wipe a total of three time. What happens now?<br>\r\n<br>\r\nCould someone come in or the toilet clog<br>\r\n</span></div></div>",
            "created":1458104400,
            "id":2118260,
            "title":"Louis: mom age 34 6'6"
        },
        "114":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "A Relative",
                "A Friend",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hear a kind of familiar voice but you don't know who it is.</span></div></span></div>",
            "created":1458575220,
            "id":2120666,
            "title":"Someone Visits"
        },
        "1141":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Aunt",
                "Cousin",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You realize it is one of your relatives but who?</span></div></span></div>",
            "created":1458575700,
            "id":2120669,
            "title":"A Relative"
        },
        "1142":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "A friend of your mom",
                "A friend of Jenny "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hear a unfamiliar voice and you don't know who it is.</span></div></span></div>",
            "created":1458576000,
            "id":2120671,
            "title":"A Friend"
        },
        "11422":{
            "author_id":"ninjax2306",
            "author_name":"W1N5T0N",
            "choices":[
                "Skylar",
                "Another one?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The voice belongs to one of Jenny's friends, but which one?<br>\r\n<br>\r\nSkylar- 18, Blonde, lactose intolerant and also loves Mexican food.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1464835620,
            "id":2157492,
            "title":"A friend of Jenny"
        },
        "114222":{
            "author_id":"ninjax2306",
            "author_name":"W1N5T0N",
            "choices":[
                "Eliana",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Eliana- 16, Also blond, soccer fanatic, no one knows how she stays skinny, but you think you are about to find out</span></div></span></div>",
            "created":1528313280,
            "id":2503679,
            "title":"Another one?"
        },
        "1142222":{
            "author_id":"ninjax2306",
            "author_name":"W1N5T0N",
            "choices":[
                "Clarissa",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Clarissa- 19, hottest girl in school but she has a very dirty secret</span></div></span></div>",
            "created":1528313400,
            "id":2503682,
            "title":"Other"
        },
        "1143":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Ava your old babysitter (19)",
                "Cam your friends little sister (15)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As you watch on in horror the person walking into the bathroom is none other than....</span></div></span></div>",
            "created":1481855520,
            "id":2250572,
            "title":"Other"
        },
        "11433":{
            "author_id":"insanehatter",
            "author_name":"InsaneHatter ",
            "choices":[
                "Weird neighbor it is.",
                "Next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about your weird neighbor Lucy?<br>\r\nLucy is a 26 year old overweight virgin who only wants a man who can't leave her and can stand her \"stenches\"<br>\r\n<br>\r\nMaybe she can have a man who has no choice not to be with her?..</span></div></span></div>",
            "created":1536892500,
            "id":2547451,
            "title":"Weird Neighbor?"
        },
        "114332":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Sally",
                "Cassie"
            ],
            "content":"<div class=\"\"><div> <span>Sally: Your mom's business partner or boss. Usually serious about her work, making it hard to talk to her whenever. It also has an effect on her bowels, judging from the mini quakes that shake the office as she does the deed in her office bathroom.<br>\r\n<br>\r\nCassie: Your/Jenny's boss from work. Laidback and down to Earth, she's quite friendly with you guys, despite the age gap of five years. She especially thinks of herself as one of the guys  as she rips ass every five minutes without shame and has been known to clog toilets with ease.</span></div></div>",
            "created":1595769240,
            "id":2875485,
            "title":"Next."
        },
        "115":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "At a Celebrities' house",
                "In a girls bathroom At school",
                "In a Foreign toilet "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You notice the walls are not the same color as your bathroom at home. OH NO. This isn't your house someone walks in and you realise you're ...</span></div></span></div>",
            "created":1458018000,
            "id":2118148,
            "title":"A bathroom outside of home"
        },
        "1151":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Ariana Grande",
                "Emma Watson ",
                "Victoria Justice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To your surprise you go slack-jawed as _____ walks in</span></div></span></div>",
            "created":1458018000,
            "id":2118151,
            "title":"At a Celebrities' house"
        },
        "11511":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Use the toilet",
                "Masturbate"
            ],
            "content":"<div class=\"\"><div> <span>Ariana Grande walks into the bathroom and locks the door behind her, she walks to the toilet and peers into the bowl and sees you. But for some reason she doesn't seen more than mildly surprised.<br>\r\n\"Oh, hi there little man. Don't worry, I'll just be doing my business and then I'll be on my way.\" <br>\r\nShe starts unbuttoning her skirt and pulls down her panties to reveal a mostly shaven tight pussy with a small tuft of red hair at the top. Then you snap out of your amazement and realize the situation you're in you yell up at Ariana with as loud a voice as you can. \"What's going on here?! Why aren't you surprised that a tiny man is in the toilet?\" <br>\r\nAriana just stops, looks at you in surprise at first, and then smiles excitedly. She happily responds to your questions with one of her own. \"Wait a minute, this is your first time at this? OMG this is gonna be so fun! I guess I get to break you in!\" she turns her back to you and sits her nude ass on the toilet. <br>\r\nThe world goes dark around you as you continue wading in the cold water of the bowl save fora small light shining through her thighs giving you a clear view of her pussy and once again you hear her voice.\"don't worry little guy, I'll answer all your questions, but not until after I've had my fun!\" <br>\r\nThe young pop star then proceeds to...</span></div></div>",
            "created":1484596980,
            "id":2264612,
            "title":"Ariana Grande"
        },
        "115111":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Answers your questions and then leaves you in the toilet",
                "Puts you into her purse"
            ],
            "content":"<div class=\"\"><div> <span>As Ariana says this you see something moving in the darkness above but your curiosity is interrupted as a blast of liquid pushes you under the water. You surface away from the spraying liquid near the back of the bowland to your dismay you see that it was actually Ariana's piss filling the toilet and then to your utter horror you see the thing that was moving around in the darkness above. It was a log of shit, slowly creeping down into the bowl. <br>\r\nHer golden stream finally stops and you watch as the log finally touches the yellow water. But it doesn't break off, it just keeps going until finally breaking off halfway to the bottom of the bowl. You start watching it fall until realizing that it's falling in your direction. Quickly you dodge to the right as the turd fall's and curls up to the left and filling 1/3 of the bowl. Thinking that it was all over but then Ariana speaks up as she looks at you through her legs smiling sweetly. \"Hey little guy! I see that first log missed you but don't worry, I'm just  getting started!\"  <br>\r\nTo your dismay the pop star wasn't kidding as you see another log squeezing it's way towards the bowl, this time you barely avoid it as it falls and fills up another 1/3 of the bowl. And then a third turd falls in, your only safe area of the bowl is at the very front in a small pool of water. Ariana looks between her legs excitedly to see if you've been buried yet but to her irritation you haven't and instead you are directly below the hole between her legs but she quickly gets over her frustration and repositions her anus directly over you. <br>\r\n\"Well my little toy you tried but I'm not done yet. Somebody has to teach you your new role in life. I'm just glad I got to be the one to do it. So get ready because after this I'll answer all those questions you were asking earlier. Besides, any not your age would love to get up close and personal with my ass, so enjoy it. Here it comes!\" <br>\r\nAs she finishes speaking you look to her wrinkle-free anus in defeat as it opens revealing a turd and it was descending directly on top of you. You start to beg her not to do this, screaming til your voice was gone, this pleased Ariana And she started playing with herself aroused by the sounds of your screams. And then it touched your head it was warm, and soft, slowly enveloping you as it fell into the bowl, filling it completely.<br>\r\n\"AHHHHHHH~ that was so much fun! Thanks for that  screaming at the end little guy I love it when they beg.\" Buried in her scat you can barely even hear this and try desperately to tunnel out of your Brown prison. She speaks again \"well I guess o better flush now\" when you hear this you start screaming again frantically digging but then she pushes the lever and you're suddenly wading in the bowl again as of nothing ever happened. You look up as the pop star orgasms into the bowl, screaming in ecstaay as her femcum covers your upper body. She then gets up off the toilet, grabs you and...<br>\r\n</span></div></div>",
            "created":1484599620,
            "id":2264655,
            "title":"Use the toilet"
        },
        "1152":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "The sexy young Principle",
                "A little girl",
                "A popular girl in your class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wait a minute this is a stall! And the walls are pink! Oh shit... Is all you could say before the stall door opened and in walked _____</span></div></span></div>",
            "created":1458104400,
            "id":2118270,
            "title":"In a girls bathroom At school"
        },
        "11523":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Poop",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>In walks Maggie, the most popular girl in school. She might be short, but her long black hair and huge ass are breathtaking. You breakout of your shock as you realise she's taking off her pants!<br>\r\nShe then sits on the toilet, revealing her pale butt, and starts to...</span></div></div>",
            "created":1460678760,
            "id":2133043,
            "title":"A popular girl in your class"
        },
        "115232":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Pee",
                "Masturbate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She then starts to...</span></div></span></div>",
            "created":1460678820,
            "id":2133045,
            "title":"More"
        },
        "1153":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "India",
                "Mexico",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You try to figure out who's toilet you are in when you start to hear thunderous footsteps walk towards the bathroom. Once they stop in front of the door you also hear voices from behind the door but you can't understand what they are saying. You realize that's because it's in another language, meaning you are in a toilet in a foreign country. Once the voices stop the door opens and the person walks in and closes the door behind them. Once they get to the toilet you are able to see who the person was. You now know you are stuck in a toilet in....</span></div></div>",
            "created":1458018000,
            "id":2118227,
            "title":"In a Foreign toilet "
        },
        "11533":{
            "author_id":"bund",
            "author_name":"bundy",
            "choices":[
                "Russia",
                "Japan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There's no doubt, you're definitely in...</span></div></span></div>",
            "created":1458104400,
            "id":2118263,
            "title":"Somewhere else"
        },
        "12":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Jenny: age 19 6'0",
                "Vivian: age 12 4'6",
                "Louis: mom age 34 6'6",
                "A guest",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You wake up wet in your family's bathtub. Your not sure how you got there but you can only assume someone took a shower with you in it. You feel lucky to be alive but you have to figure out what to do next. Is it too late? Does someone come in to use the bathtub?</span></div></div>",
            "created":1458018000,
            "id":2117862,
            "title":"Bath"
        },
        "122":{
            "author_id":"queenietoy",
            "author_name":"Queenie's plaything",
            "choices":[
                "Continue yelling to try and get her attention",
                "Swim up to her and try to climb her body, she's sure to notice that",
                "Don't risk it, try to climb out of the bathtub while you still can"
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden, you hear someone come into the bathroom. You look up, and just past the rim of the bathtub you can make out your little sister, Vivian. Your jaw drops open when you realise she's already undressed, only carrying the bath towel she plans to dry herself off with...after a bath!<br>\r\nYou try yelling up to her, but she doesn't seem to hear you at all as she leans over you and starts to turn on the water which crashes down around you like a waterfall. The water sweeps you of your feet and sends you hurtling around the bathtub as you scream, begging for Vivian to notice you. She's humming to herself however, blissfully unaware of where you as she waits for her bath to get ready.<br>\r\n<br>\r\nAfter a few minutes, she turns off the water and the waves calm down slightly, leaving you to kick lightly as you take deep breaths, trying your hardest not to fall under the surface and start to drown. Vivian climbs into the bath, kicking up waves as she settles into the bathtub. When you're finally able to look her way, your startled to see her gigantic naked body, lying back in complete relaxation as she appears to be enjoying the water for now.<br>\r\n<br>\r\nShe won't stay like this for long though, it's only a matter of time until she starts getting washed and you'll end up who knows where!<br>\r\n<br>\r\nMaybe you could get her attention? You don't have that much energy left, but it's that or trying to get out of the bathtub before things get too crazy...</span></div></div>",
            "created":1458172500,
            "id":2118524,
            "title":"A bath with little sis?"
        },
        "124":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Friend",
                "Relative",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does maybe a friend or relative come to use the tub or someone else entirely?</span></div></span></div>",
            "created":1469564820,
            "id":2186429,
            "title":"A guest"
        }
    },
    "info":{
        "author_id":"ninjax2306",
        "author_name":"W1N5T0N",
        "brief_description":"Tim shrinks in his family's bathroom usual happenings insue",
        "created":1357277640,
        "description":"<td align=\"left\" class=\"norm\">You: Tim age 15 male 5'4<br>\r\n<br>\r\nJenny: age 19 6'0<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i.imgur.com/beU360F.png\" target=\"_blank\">http://i.imgur.com/beU360F.png</a> <br>\r\nLoves Mexican food and working out.<br>\r\nVivian: age 12 4'6<br>\r\nGets along with everyone. Loves to torture anything smaller than her<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.istockphoto.com/photo/cute-smiling-twelve-year-old-girl-with-glasses-gm184939506-19082654\" target=\"_blank\">http://www.istockphoto.com/photo/cute-smiling-twelve-year-old-girl-with-glasses-...</a><br>\r\nLouis: mom age 34 6'6<br>\r\nLoves her children, but grosses them out with her bathroom habits<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://modernefrizure.com/frizure-za-plavuse-leto-2017-katalog/srednje-duzine-frizure-za-plavuse-2015-2016-3-/2/\" target=\"_blank\">http://modernefrizure.com/frizure-za-plavuse-leto-2017-katalog/srednje-duzine-fr...</a><br>\r\nno 1 sentence paragraphs<br>\r\neverything else goes except leaving the bathroom<br>\r\nAlso don't kill Tim<br>\r\n<br>\r\nSpecial thanks to:<br>\r\nS124<br>\r\nBundy<br>\r\nBilboBaggins<br>\r\nQueenie's plaything<br>\r\n</td>",
        "id":1911655,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595769240,
        "modified":1595769240,
        "pretty_title":"Shrunk in a Bathroom"
    }
}