{
    "chapters":{
        "1":{
            "author_id":"lostkid",
            "author_name":"staubs30",
            "choices":[
                "Shrink",
                "Giantess"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will this be a shrinking or giantess story?</span></div></span></div>",
            "created":1327053180,
            "id":1262202,
            "title":"What will this be?"
        },
        "11":{
            "author_id":"lostkid",
            "author_name":"staubs30",
            "choices":[
                "You shrink right in front of Olivia as she smiles evily",
                "Olivia leaves, and then you shrink"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Mark you are 22 years old and have just gotten the lifetime opportunity to meet Olivia wilde in person! You reviewed one of olivia's latests movies on her twitter page and the contest rule was if Olivia liked that persons review, they'd be the lucky winner. The cabi drops you off at the front driveway of her house and says \"It was nice knowin' ya pal.\" before driving off. you scratched your head and thought he was a bit nutty. you then proceed to the doorstep and rang the doorbell. You dont know whether to be excited or nervous at this point. you're about to be face to face with one of the hottest actresses ever! just then the door opened and you saw olivia, in person, welcoming you with a warmish smile. you stutter, trying to find the right word to introduce yourself. \"dont be shy. come on in.\" she says and invites you inside. you step inside of her house as olivia pours you a glass of wine. \"you seemed like a very intelligent person judging by the review you wrote. very detailed indeed. that is why i wanted you here now.\" Olivia said and makes a toast with you. You take a drink of the wine and set your glass down. Just then, you started to feel a little ill. Olivia sets her glass down and,</span></div></div>",
            "created":1327054440,
            "id":1262207,
            "title":"Shrink"
        },
        "111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Cat and Mouse",
                "Escape the Giantess",
                "Pleasure the Goddess"
            ],
            "content":"<div class=\"\"><div> <span>All of the sudden everything around you stats getting bigger. You realize that you're shrinking. Olivia watches you shrink with an evil smile on her face until you're only an inch in hieght. Then she bends down o get a closer look at you.<br>\r\n<br>\r\n\"What's going on?\" you ask stareing up at her.<br>\r\n<br>\r\n\"I put a shrinking potion in your wine,\" Olivia said still smileig evily.<br>\r\n<br>\r\n\"But why?\" you ask afriad of what the answer might be.<br>\r\n<br>\r\n\"Why to play with you of course!\" she says withan evil laugh \"I always like to shrink my fans who visit me here at my house and play games with them.\"<br>\r\n<br>\r\nYou stare at her in total disbelieve. She had done this sort of thing before and you don't think you're going like how this will end for you. <br>\r\n<br>\r\n\"Now what game should we play?\" Olivia says pondering. \"I know how about... </span></div></div>",
            "created":1354235160,
            "id":1478400,
            "title":"You shrink right in front of Olivia as she smil..."
        },
        "1111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She catches you",
                "You take cover in a mouse hole"
            ],
            "content":"<div class=\"\"><div> <span>\"How do you play that?\" you ask with a sense of dread.<br>\r\n<br>\r\n\"It's smiple. I'll be the hungry cat and you'll be the tasty little mouse that I try to capture,\" Olivia says as she gets down on her hands and knees. \"If I fail to catch you, you win, but if I catch you, well let's just say I won't have to worry about what I'm going to have for lunch.\" She then licks her lips hungrlly.<br>\r\n<br>\r\n\"Wh-what if I don't want to play?\" you ask with gulp.<br>\r\n<br>\r\n\"Then we can skip the game, and I can eat you right here and now,\" she aswers.<br>\r\n<br>\r\n\"In that case let's begin the game,\" you say and quicky start running away from her.<br>\r\n<br>\r\nOlivia smirks and says, \"Moew.\" Then she starts to chase you on her hands and knees.</span></div></div>",
            "created":1354236300,
            "id":1478410,
            "title":"Cat and Mouse"
        },
        "11111":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "eats you any way",
                "she says \"well im not anything if not merciful\"."
            ],
            "content":"<div class=\"\"><div> <span>the game lasts all but 15 minutes. she finds you running for a moue hole and puts her foot down on you wedging you between her first and second toes on her right foot. she then grabs you and bring her up says \"well that was fun.\" you start to beg for your life in exchange for eternal servitude.</span></div></div>",
            "created":1408212060,
            "id":1842294,
            "title":"She catches you"
        },
        "111111":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "yes and you find your self sliding down the poop shoot in to your new pool",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you survive digestion? </span></div></span></div>",
            "created":1408212360,
            "id":1842295,
            "title":"eats you any way"
        },
        "1111112":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "content":"<div class=\"\"><div> <span>you land in her stomach with a big splash then the next thing you know you fell your skin burning then your bones then you were dead and since she is a goddess among mortals she absorbed your soul and uses your soul to finish he throne made of souls and you are right in the middle of her seat cushion </span></div></div>",
            "created":1408212600,
            "id":1842297,
            "title":"no"
        },
        "1113":{
            "author_id":"himynameis9",
            "author_name":"Himynameis",
            "choices":[
                "More tits",
                "She wants you to worship her ass",
                "Please her by goin in her pussy"
            ],
            "content":"<div class=\"\"><div> <span>She suddenly strips for you, even though you're in fear you can't help yourself but look and stare at her massive tits, her huge ass, and her perfect pussy. She then says \"wow, are you getting a little hard on for me?\" You're embarrassed, but before you can respond she grabs you and brings you to her tits. \"Open your mouth and please your goddess.\" You obey because you love her. She shoves Youn into her nipple, and massages you in it. You can't breathe, but she doesn't care and lets out a small moan. Then she says, \"what should I do with you next?</span></div></div>",
            "created":1487289660,
            "id":2278510,
            "title":"Pleasure the Goddess"
        }
    },
    "info":{
        "author_id":"lostkid",
        "author_name":"staubs30",
        "brief_description":"Olivia wilde grows in your city or you are shrunken before her. Survive!",
        "created":1327053120,
        "description":"<td align=\"left\" class=\"norm\">Anything can happen. Just remember olivia cannot die.</td>",
        "id":1841932,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1487289660,
        "modified":1487289660,
        "pretty_title":"GTS Olivia Wilde"
    }
}