{
    "chapters":{
        "1":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "A research lab.",
                "An office building.",
                "A hospital.",
                "A police officer on patrol.",
                "Other potential jobs."
            ],
            "content":"<div class=\"\"><div> <span>The shrill shriek of the alarm clock pierced the quiet of the bedroom, swiftly silenced by a rough slap from the bed's sole occupant. Lifting herself out of bed, Kim Nishikawa stretched heavily, ready to wake up and face the day. The shapely woman began going about her usual morning routine, brushing her teeth and hopping in the shower to clean up and wake up. Breakfast would be a simple affair, then she'd be out the door and hopping in her car to get to work.<br>\r\n<br>\r\nBut where does Kim work?</span></div></div>",
            "created":1411621200,
            "id":1861711,
            "title":"Morning Routine."
        },
        "11":{
            "author_id":"teraton_arm",
            "author_name":"Teraton",
            "choices":[
                "A psychological study on high stress situations.",
                "A powerful new medication.",
                "An energy weapon with unpredictable effects.",
                "A cloaking device.",
                "Other projects."
            ],
            "content":"<div class=\"\"><div> <span>Kim knew it was important, but <i>boy</i> did those security checks get tedious. There was the key card, had to make sure you had that when you left the house , or else you wouldn't e allowed past the front gate. Then there was the  handscannner at the front desk.  Then the retina scan. Then the leaches again.<br>\r\n<br>\r\nAll on all, Kim figured she should be happy they were taking the precautions. At the Enfield Corporation, they worked on a lot of sensitive, secretive things! As such, privacy became their policy, in a way, with a large amount of strange information and technology passing through the building.<br>\r\n<br>\r\nAs Kim passed the final door, stepping into the lab, she nodded to her associates. This little group of hers had been working on a particularly interesting project for some time. Specifically, they'd been working on...</span></div></div>",
            "created":1411794000,
            "id":1863039,
            "title":"A research lab."
        },
        "111":{
            "choices":[
                "\"...have you run an obstacle course.\"",
                "\"...be testing your reactions to various common phobias.\"",
                "\"...trying something new.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Morning Carver, Richards,\" Kim greeted her colleagues, receiving slightly distracted nods in return. The lack of reaction didn't bother her much, as today was an exciting day for the three of them. They had been working with lab rats for the past four weeks, putting the little vermin through hundreds of tests until they finally received the go ahead to move on to human testing. <br>\r\n<br>\r\nKim grinned as she hung her blazer in the lab's closet and pulled on a lab coat, walking over to her two associates, \"So, who's the poor fool we're testing today?\"<br>\r\n<br>\r\n\"Huh?\" Richards looked at her in confusion before looking back at his notes, \"Uh...you are.\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"You volunteered last Tuesday to be our first human subject,\" Carver reminded her with a small smirk, \"If I recall correctly, you're getting a little bonus for each successful test.\"<br>\r\n<br>\r\nKim frowned as she recalled the somewhat impetuous decision she'd made to sign up for testing. In her defense, she'd forgotten to get coffee that day and $700 per test seemed like a good deal at the time. <br>\r\n<br>\r\n\"Eh, fine with me,\" she shrugged at her colleagues, \"What's first on the list?\"<br>\r\n<br>\r\nCarver grinned as she looked over the schedule, \"Alright, so after you get suited up, we're going to...\"</span></div></div>",
            "created":1424581200,
            "id":1938732,
            "title":"A psychological study on high stress situations."
        },
        "1112":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "Go ahead and disrobe so we can test the fear of public nudity.",
                "Put on the dress. We'll be testing stage fright in front of large audiences.",
                "Put on the \"modified\" suit. The test will cover multiple phobias at once."
            ],
            "content":"<div class=\"\"><div> <span>\"Phobias are guaranteed to give good data on high stress with relatively little effort.\" Carver explained, leafing through her notes. \"You'll find an earpiece in the ready room to keep in contact with us. It comes equipped with a micro-sensor to monitor your brainwaves and heart rate.\"<br>\r\n<br>\r\n\"That's all well and good...\" Kim started. \"But I don't really have any of the common phobias. I'm not bothered by spiders, snakes, heights, or confined spaces.\"<br>\r\n<br>\r\n\"The higher-ups already took that into account.\" Richards chimed in. \"They've gone over your file and cross-referenced it with a list of common phobias. They found a few that you might not necessarily have, but don't explicitly lack.\"<br>\r\n<br>\r\nKim shrugged at that. She should have expected as much from the foundation. After all, with the ludicrous budget they were afforded, something as simple as a psychological evaluation being kept on file was to be expected. Realizing she wouldn't be needing her lab coat as a test subject, the scientist shrugged the coat back off, placing it back on the hook she'd grabbed it from.<br>\r\n<br>\r\nWith a thumbs-up to her colleagues, Kim strode across their research room and past the automatic door labeled \"Ready Room\" to begin her test. The Ready Room was a simple room barely bigger than a closet. As the door shut behind her, Kim felt a slight lurch as the room began to move, employing its secondary function as an elevator to deliver subjects to their designated testing area. It was impossible to tell just where the room was going until it reached its destination, and Kim knew that such specifics weren't her concern, as her colleagues controlled these variables of the test.<br>\r\n<br>\r\nThe earpiece Carver had mentioned was sitting conspicuously on a small bench sticking out from a wall of the Ready Room, sitting next to a small plastic bin. Kim picked up the earpiece, gently placing it in her left ear and hearing the light crackle of static as connection was established.<br>\r\n<br>\r\n\"-in, Kim. Repeat, please report in, Kim.\" came Carver's voice.<br>\r\n<br>\r\n\"Kim here. Communication seems to be working just fine.\" Kim said, noting the surprisingly high sound quality she received from the transmitter.<br>\r\n<br>\r\n\"Great! Last thing we needed was a technical failure before proper testing even started. Your vitals are showing up just fine, too. Looks like we've got everything we need to get our results. So, Kim, go ahead and open up the plastic bin in the room with you, that's for your uniform.\"<br>\r\n<br>\r\nWordlessly, Kim lifted the top of the plastic container, peering in to see its contents. As Kim surveyed what the bin offered, Carver spoke again.<br>\r\n<br>\r\n\"I'm assuming you've opened the bin, so please-\"</span></div></div>",
            "created":1424667600,
            "id":1938935,
            "title":"\"...be testing your reactions to various co..."
        },
        "11121":{
            "choices":[
                "Yes, undress willingly for the test.",
                "No, try to back out.",
                "Maybe see if they'll let her try it in her underwear?"
            ],
            "content":"<div class=\"\"><div> <span>\"E-Excuse me?\"<br>\r\n<br>\r\n\"Oh, increased heart rate already,\" Carver noted, \"Anyway, you'll need to be naked for these first few tests. Your psychological profile may not list you as a gymnophobic, but aversion to appearing nude in public places is common enough that the foundation felt it would work as a basic stress test.\"<br>\r\n<br>\r\nWell, that did kind of make sense. \"But I have to be completely naked for this?\"<br>\r\n<br>\r\n\"Yep. Granted, running around in your undergarments might get similar results, but going fully nude it far more likely to elicit the response we're looking for. So just relax and-\"<br>\r\n<br>\r\n\"Uh, actually-\" Richards voice cut in, \"Would you mind not relaxing? We'd like to get as accurate results as possible. Oh, and I'm required to inform you that if you don't undress willingly in the next...six minutes and thirty-two seconds, you're not getting paid for this test. So, uh, please remove all articles of clothing on your person and place them in the bin provided so we can get underway.\"<br>\r\n<br>\r\nKim gulped uneasily, reluctantly unbuttoning her shirt. Could she really go through with this?</span></div></div>",
            "created":1425272400,
            "id":1942217,
            "title":"Go ahead and disrobe so we can test the fear of..."
        },
        "111211":{
            "choices":[
                "An office.",
                "A locker room.",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>\"Ugh, the things I do for science,\" Kim complained as she took off her shirt and unclasped her bra, quickly removing her slacks and underwear. Dropping her clothes in the box, she nervously sat down on the Ready Room's bench, grimacing at the sensation of cold plastic against her bare bottom. <br>\r\n<br>\r\nTaking a breath to calm herself as she covered her exposed breasts, Kim adjusted the earpiece and spoke to her colleagues, \"Alright, I-I've disrobed. Now what?\"<br>\r\n<br>\r\n\"Great, now just wait a bit,\" Carver replied, sounding distracted, \"You're being transported to the testing area.\"<br>\r\n<br>\r\n\"Oh, which test room?\"<br>\r\n<br>\r\n\"Sorry, that's a secret. Fear of the unknown is a component of this test and it wouldn't do to ruin any surprises. You'll just wait and see.\"<br>\r\n<br>\r\nKim frowned as Carver disconnected, leaving her alone in the quiet room. Where could they be sending her? This question was soon answered as the doors opened as Kim saw she was in...</span></div></div>",
            "created":1425963600,
            "id":1946545,
            "title":"Yes, undress willingly for the test."
        },
        "1112112":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Inside was one of the identical OL outfits...",
                "She spotted a small card, and read it quickly, eager to move on.",
                "She slammed the door closed again. That outfit was shameful, worse than nudity!",
                "A swat to her exposed ass, and Carver's voice going 'Phase 2'...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Her determination not to fall at the first hurdle, was her excuse for this fool-hardy nudity. Blinking as she adjusted, Kim saw she was in a locker room. She watched the other women, as they changed. Frozen in place, like a rabbit hypnotised into immobility. Kim was jealous, they were never naked. Never dressed in less than their underwear. While she was completely nude. It was this that made her feel as if she stood out.<br>\r\n<br>\r\nThe other women were chatting away about finishing their shifts, or getting ready to start. But her heart raced, as Kim prayed for the experiment to end. As her knees started to quake, she slipped down to the floor. Terrified she was going to faint dead away.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/29/cb/b5/29cbb5357ea405f17753efc6e8011e21.jpg\" target=\"_blank\">https://i.pinimg.com/originals/29/cb/b5/...</a><br>\r\n<br>\r\nThese were OLs, Japanese <b>O</b>ffice <b>L</b>adies, and while she might not feel much in common with them, Kim knew that physically they all looked the same. Interchangeable office workers. Even she could be mistaken for one, if she were dressed the same.<br>\r\n<br>\r\n\"Are you alright?\" A woman startled her, with the question.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://66.media.tumblr.com/5fbc4efa97f536763a95bbd1bd2993d8/tumblr_o3kliqVBSQ1uwbfero1_540.jpg\" target=\"_blank\">https://66.media.tumblr.com/5fbc4efa97f5...</a><br>\r\n<br>\r\nLooking down, she sounded sympathetic.<br>\r\n<br>\r\nKim nodded mutely, not sure she trusted her voice, for volume or certainty.<br>\r\n<br>\r\nA voice crackled in her ear. Kim jumped not remembering putting it in.<br>\r\n<br>\r\n\"You can answer, you can interact.\" The voice told her.<br>\r\n<br>\r\nShe recognised Carver's voice, \"Oh, and you have a locker, unless you like hanging around here.\"<br>\r\n<br>\r\nKim's cheeks coloured at the suggestion, the look of concern on the other woman's face deepening, as Kim's took on a distant look, as she listened to the voice in her ear.<br>\r\n<br>\r\n\"Yeah... Yeah... I'm fine.\" she answered unconvincingly. But she rose to her feet, \"Low sugar... I guess.\" she offered as an explanation.<br>\r\n<br>\r\nSatisfied the other secretary gave her skirt a brush, to smooth out any wrinkles, real or imagined, and headed away.<br>\r\n<br>\r\nWith a sense of purpose Kim scanned the locker doors, looking for her own name. She was almost ready to ignore her nudity around these lingerie and underwear clad workers. As her breathing steadied, she realised this was an easy test. A slow start for what would surely get harder the further she went.<br>\r\n<br>\r\nRelief flooded through Kim's veins when she found 'her' locker. It wasn't locked, and a simple press caused it to open for her.</span></div></div>",
            "created":1580407320,
            "id":2780478,
            "title":"A locker room."
        },
        "111212":{
            "author_id":"okayterrific",
            "author_name":"okayterrific",
            "choices":[
                "You'll be fired for insubordination",
                "You'll be kicked off the project and given no credit for your work done so far"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nKim reluctantly began unbuttoning her shirt and once her lacy black bra was visible she stopped.  Why was she going through with this?  The test paid $700 but it’s not like that amount of money was going to make or break her.  She was a professional and made a good salary.  Surely they could find some intern or a college student who would be more than happy to do this for probably half that amount.<br>\r\n<br>\r\nEven if the money was a factor she was still sure she couldn’t go through with this.  Kim knew that the Ready Room had a camera in it and the thought of Carver and Richards, both of whom she worked with frequently, seeing her naked made anxious.  Who else would see her naked?  They did say this was a test of public nudity after all.  Kim was suddenly feeling very hot.<br>\r\n<br>\r\n“Carver, look at these readings,” She heard Richards say through her earpiece. “Elevated anxiety levels and body temperature and she hasn’t even disrobed yet.”<br>\r\n<br>\r\nKim knew it!  They could see her!  That cut it, she wasn’t going to go through with this experiment and she quickly buttoned up her blouse.<br>\r\n<br>\r\n“Is there a problem, Kim?” Carver asked.<br>\r\n<br>\r\n“I-I can’t do this,” she replied. “It’s too much and knowing that you both as well as others are going to see me is more than I can deal with.”<br>\r\n<br>\r\n“I see,” Richards said flatly. “Hold on.”<br>\r\n<br>\r\nLooking at Carver, Richards hit the button that disconnected Kim’s earpiece so that they could talk privately.<br>\r\n<br>\r\n“Well this sucks,” Carver said disappointedly.  “I guess we’ll have to find another test subject.”<br>\r\n<br>\r\n“Don’t you see what an opportunity this is?” Richards asked.  “We can introduce other elements!  Surely one of them will be enough of a trigger to get her to continue.  Just play along.”<br>\r\n<br>\r\nRichards then hit the button to reconnect with Kim. <br>\r\n<br>\r\n“Hello?  Are you guys still there?” Kim asked.<br>\r\n<br>\r\n“Yes, sorry Kim,” Richards replied.  “We had to contact the director to ask him how to proceed since you seem unwilling to participate further.  He has instructed me that if you don’t disrobe…”<br>\r\n</span></div></div>",
            "created":1426568400,
            "id":1949461,
            "title":"No, try to back out."
        },
        "1112122":{
            "choices":[
                "She continues the test and strips naked.",
                "She can't do it. Quit the test and face the consequences.",
                "Something interrupts her decision."
            ],
            "content":"<div class=\"\"><div> <span>\"What?! B-But I thought these tests were supposed to be voluntary!\" Kim protested. She'd spent weeks running stress tests on vermin, she couldn't be kicked off right as things were getting interesting!<br>\r\n<br>\r\n\"Apologies,\" Richards responded, making a quick note of her increase in heart rate, \"But refusal to comply requires immediate dismissal of the subject from the experiment. It's regulations.\"<br>\r\n<br>\r\n\"But I'm part of the research team!\"<br>\r\n<br>\r\n\"Not currently,\" Carver chimed in, \"Right now you're a volunteer test subject and under the recently updated Regulation 9, Sub-Clause E, 'all non-compliant test subjects are to be considered a liability to the experiment and should be removed from any and all lab procedures until either compliance is achieved or a compliant test subject is found as replacement. In the case of replacement, the original subject should be removed entirely to prevent possible skewing of test results'. Since you volunteered, you only count as a test subject, and can be kicked off of the project completely if you don't go along with it. Sorry Kim, it's the rules.\"<br>\r\n<br>\r\nKim couldn't help groaning at Carver's explanation. She really wished she'd known that rule before volunteering for the tests. She'd gotten too used to Richards reminding her about the important ones. Curse her apathy towards company memos! (Since she couldn't see into her colleagues' lab, she completely missed the bewildered look Richards gave Carver as he mouthed \"Regulation nine, sub-clause see?\", nor did she see the casual shrug given in response)<br>\r\n<br>\r\n\"...Fine. Fine, I-I'll just...\" She swallowed uneasily, fully unbuttoning her blouse and pulling the garment off. She stood still for a second before dropping the garment into bin, an odd sense of finality to the action. <br>\r\n<br>\r\nKim took a breath to steady herself, somewhat unnerved by her colleague's silence as she stood shirtless in the empty room, her lacy bra clearly exposed to them. She shakily lowered her hands to her slacks and unzipped them, quickly shoving her pants down, kicking off her shoes to make it easier, and slipped out of them, dropping the pants and shoes on top of her shirt.<br>\r\n<br>\r\nWearing only her socks and underwear, Kim nervously raised her hands to unclasp her bra. \"A-Are you sure I need to be <i>completely</i> naked for the test?\" she asked, torn between a desire to just get it over with and a fear of being seen naked. The fact that this anxiety was exactly the point of the test was currently lost on her.<br>\r\n<br>\r\n\"Huh? Oh, yes,\" Richards replied, tearing his eyes away from the fascinatingly increasing readings on the screen, \"Please continue disrobing so we can receive precise results. Oh, and thank you for your efforts. This recording will be quite helpful in determining future experiments.\"<br>\r\n<br>\r\n\"...Recording?\" Kim asked weakly. \"This is being recorded?\"<br>\r\n<br>\r\n\"...Ah, goddammit Greg,\" She heard Carver mutter.<br>\r\n<br>\r\n\"What? What did I do?\" The scientist could barely hear her coworker's confused response, the full implications of his casual admission still ringing in her ears. She was being recorded. They were recording her undressing. It did make sense for them to actually record the session rather than simply monitor her, but that didn't stop her increasing panic. How many people were going to be shown a video of her stripping? Oh god, people were going to see her standing around in her underwear like an idiot, hands frozen in the process of removing her bra.<br>\r\n<br>\r\nShe couldn't go through with this. She couldn't. But to be kicked off the project at this point, after all her hard work? And they already recorded her stripping down to her bra and panties. Would it really make such a huge difference if she went all the way? <br>\r\n<br>\r\nKim whimpered, torn by indecision...</span></div></div>",
            "created":1429419600,
            "id":1966313,
            "title":"You'll be kicked off the project and given ..."
        },
        "11121221":{
            "author_id":"skullking2",
            "author_name":"skullking2",
            "choices":[
                "hairy vagina",
                "well shave vagina "
            ],
            "content":"<div class=\"\"><div> <span>Kim stood there, hands still behind the back of her bra thinking once it came off,there is no going back because it would be recorded for all her coworkers to see for years to come. <br>\r\n<br>\r\n\"Guess what Kim I just notify the higher ups about the readings and guess what they said?\" Richard said in a mocking tune <br>\r\n<br>\r\nKim got very nervous because she could tell that the answer won't be good, also her Elevated anxiety levels and body temperature went up <br>\r\n<br>\r\n\"They said if you don't comply then you would be removed from our Corporation\"  Carver <br>\r\n<br>\r\nKim didn't want to be fire because Enfield Corporation that she love so much<br>\r\nSo Kim made her decision by unhooking her black lacy bra that drop to the ground showing her D cup breast <br>\r\n<br>\r\nKim was beet red and burning up knowing that everyone including her coworkers now seen her breast <br>\r\n<br>\r\n\"Wow Kim, that are some nice breasts you have, we thought your breast was small when your cloths are on\" says Carver with a smirk as he see her anxiety level rising because of his comment<br>\r\n<br>\r\nRichards hit the button that disconnected Kim’s earpiece<br>\r\n<br>\r\n\"We should tease her some more\"  says Richard laughing  because the look of embarrassment on Kim's face<br>\r\n<br>\r\n\"I know how we can humiliate her some more, and  we have our coworkers gather in a room that kim thinks would be empty\" says Carver<br>\r\n<br>\r\n\"Haha, that is a good plan we just lead her there by telling her that her clothes is in that room, but first we must get her cloths first\" Says Richard laughing<br>\r\n<br>\r\n\" she would be so  shock(because that room is always empty) I bet she would freeze for a second, but we should make one of our coworkers say Hey Kim you are naked\" Says Carver giggling<br>\r\n<br>\r\n\"When that coworker says that we should have cameras flashing  and the door should lock once she step inside the room \"says Richard still laughing<br>\r\n<br>\r\nRichard clicks the button to connect Kim's earpiece<br>\r\n<br>\r\n\"Kim now that we saw your nice tits, I take it's time for you to take your panties off and show us what's down there\" says Carver <br>\r\n<br>\r\nKims gets very nervous knowing too well that the black lacy panties got to go<br>\r\n<br>\r\nher hands are around her wist and fingers inside her panties wristband <br>\r\n<br>\r\nKim doesn't want anyone to see her........<br>\r\n<br>\r\n<br>\r\nSee her what?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1499835600,
            "id":2351909,
            "title":"She continues the test and strips naked."
        },
        "111212211":{
            "author_id":"skullking2",
            "author_name":"skullking2",
            "choices":[
                "Her nemesis called ",
                "lesbian female boss who hates her "
            ],
            "content":"<div class=\"\"><div> <span>You see Kim hadn't shave down there since she graduated high school because she was so focus with college, also she didn't think she would ever have to be strip butt naked in front of her coworkers and anyone who would see the recordings in the future.<br>\r\n<br>\r\n\"Wow, her Elevated anxiety levels and body temperature are rising rapidly \" says a laughing Carver who like all her coworkers wanted to humiliate Kim.<br>\r\n<br>\r\nSince Kim first started working there she had been arrogant and thought she was better then anyone, therefore  many of her coworkers wanted to knock her down a peg <br>\r\n<br>\r\n\"What are you waiting for Kim\" Says Richard with a smile on his face<br>\r\n<br>\r\nKim stood there with her hands on the wristband of her lacy black panties showing everyone a full view of her D cup breast <br>\r\n<br>\r\n\"I think you guys have enough data, so I don't see why my panties have to go\" says a very nervous Kim <br>\r\n<br>\r\n\"Yes  the panties have to go because the data is not enough and this is just the beginning\"<br>\r\n<br>\r\n\"Also if you stop now then you are out of a job and would have to a pay a fine\"  says a very happy Richard <br>\r\n<br>\r\nThe very beet red and sweaty  Kim knew the fine wasn't low, starts pulling down her black lacy panties trying to take them off very fast but Carver click a different button to let someone know it was her time to enter the room<br>\r\n<br>\r\nThe room door and \" Wow, Kim! It's hairy This looks like Osama Bin Laden's beard down there\" Kim hears a female voice and reorganize it right away and it is someone  that she didn't want to see her  like this in all her naked glory with her panties below her knees covering her brown bush for that person to see no more. <br>\r\n<br>\r\nthat person is Kim's <br>\r\n<br>\r\nKim's what<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1499835600,
            "id":2352123,
            "title":"hairy vagina"
        },
        "1112122111":{
            "author_id":"skullking2",
            "author_name":"skullking2",
            "choices":[
                " Jennifer leaves",
                "Jennifer stays "
            ],
            "content":"<div class=\"\"><div> <span>Jennifer, who went to the same high school and college with kim<br>\r\n<br>\r\nThey both have been enemies since the first day they met, and unlike Kim Jennifer knew to treat your coworkers with respect.<br>\r\nWhen Richard and Carver asked her if she wanted to help them humiliate Kim, she was on board with it. <br>\r\n<br>\r\n\" Oops wrong room, wait why are you naked\" Says a smiling Jennifer <br>\r\n<br>\r\n\"Isn't this the room that you guys are running test for your psychological study\" Says Jennifer <br>\r\n<br>\r\n\"I thought there would be a pool fool being tested on\" says Jennifer repeating what Kim said in Chapter 3 <br>\r\n<br>\r\n<br>\r\nKim who is covering her private with both hands but you could still see her brown  pubic hair  sticking out , think this must be a dream <br>\r\n<br>\r\n\"Kim, are you there?\" ask Jennifer smiling <br>\r\n<br>\r\nKim just stood there don't know what to say or do but does know now that her modest is gone forever. She also knows that Jennifer is definitely laughing inside <br>\r\n<br>\r\n \" Kim can you pick up your clothes and put them inside  the plastic bin\" says Richard laughing his butt off, he knows that Kim heard him laughing but what can she do now<br>\r\n<br>\r\n\"Can you please leave the room Jennifer\" says Kim with pleading eyes knowing that Jennifer would see the recording but she doesn't want her to see her now in this state. <br>\r\n<br>\r\nJennifer can see that Kim is very hopeless now<br>\r\n<br>\r\nDoes Jennifer stays or leave the Room?</span></div></div>",
            "created":1499835600,
            "id":2352128,
            "title":"Her nemesis called "
        },
        "114":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Live HD video feed to superiors",
                "Request another team observe",
                "Both video to superiors and another team"
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning, Richards, Carver.  Anything recorded over the weekend on Mortimer, Bianca, and Gadget?\" Kim asked as she put her things in her locker.<br>\r\n<br>\r\n\"Hi Kim.  You're looking well, by the way.  It seems to have remained effective throughout the duration.  Both Mortimer and Bianca were imperceptible between 400 and 700 nm wavelengths, a.k.a. not on the visible light spectra.  Both perceptible on infrared and ultraviolet rays.  Our control, Gadget, remained perceptible on IR, Visible, and UV light spectra,\" Richards reported.  He reran through the archive footage to confirm the report.<br>\r\n<br>\r\nKim allowed herself a smile.  She had finished washing her hands and was putting on a fresh lab coat.  \"Carver, any response noted on the mice themselves?\"<br>\r\n<br>\r\nCarver shook his head.  \"M, B, and G all maintained normal vitals and activity levels.  Importantly, G would sometimes bump into M or B, but M and B did not bump into G.  M and B, in addition to normal behavior, did not bump into each other, indicative of the Gyges device allows for other users to perceive them.\"<br>\r\n<br>\r\nKim brought a hand to her mouth to stifle an expletive.  \"Really!\"<br>\r\n<br>\r\nCarver nodded and was starting to be infected with a grin too.  \"I'll verify the video with the time signals, but almost certainly yes.  We might have lucked into the proper calibration!\"<br>\r\n<br>\r\nKim couldn't restrain a small hop from giddiness.  She blushed, though her colleagues could relate.  \"Of course we'll need to replicate in full scale trials, but we're so close to getting Tech and Innovation Awards showered on us!\"<br>\r\n<br>\r\nKim dashed to her console and scanned the data.  \"Yes.  Gyges functioned in full capacity for the... huh?\"  <br>\r\n<br>\r\nKim stared at a variable for awhile as Carver and Richards turned to her.  \"What is it Kim?\" Carver asked while Richards moved to see for himself.<br>\r\n<br>\r\n\"The penetration range reads as low.  Very low.  Maybe it was altered while miniaturizing the device for trials on living organisms?\" Kim rubbed her chin and looked at her teammates.  \"But video archive confirms their bodies were fully invisible, right?\"<br>\r\n<br>\r\nCarver nodded firmly and Richards led her to his monitor.  \"Yeah, no mouse skeleton or organs or even a shadow,\" Richards affirmed while playing the footage back.<br>\r\n<br>\r\nCarver moved over to the mice's sizable cage.  \"Still invisible now.  Really, it might be a plus.  If Gyges works with low penetration, it might mean longer term exposure has less side effects.\"<br>\r\n<br>\r\nKim nodded.  \"I'll note it, but let's get ready for the full scale human trials.\"<br>\r\n<br>\r\nRichards grimaced.  \"About that--the primary volunteer called in sick and the alternative hasn't responded.\"<br>\r\n<br>\r\nKim sighed.  \"Patience and boldness, gentlemen.  Technological progress requires both and we've already contributed the first part.  I'm going to be the first human subject for Gyges.\"<br>\r\n<br>\r\nCarver raised his eyebrows and Richards kept his frown.  After a moment of thought, Richards cleared his throat.  \"Kim, I understand your passion.  But isn't it unwise for the project lead to be a test subject?  How can you objectively report on yourself?\"<br>\r\n<br>\r\nKim shook her head.  \"There's a lot of cases of scientists experimenting on themselves: Salk, Hoffman, Newton.  Besides, you two will observe me.\"<br>\r\n<br>\r\nRichards looked to Carver who shrugged and looked at Kim.  \"I've yet to persuade you out of any course of action once your committed.  Still, Richards is right.  We'll need to temporarily replace you as an official observer.\"<br>\r\n<br>\r\nKim nodded in concession and thought a bit.  \"Okay, here's a solution.\"</span></div></div>",
            "created":1464152400,
            "id":2153556,
            "title":"A cloaking device."
        },
        "12":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "HR Manager whose about to have a dress code infraction",
                "Advertising Manager whose going to see herself go viral",
                "PR Manager whose going to fall victim to a cunning stunt",
                "Engineering Manager whose design will (wardrobe) malfunction on her",
                "Author's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The twenty-eight years old businesswoman checked herself in the mirror briefly before given an approving nod.  Kim felt she looked better than usual and that today was going to be memorable.  Unfortunately for her, she was right.<br>\r\n<br>\r\nKim had a smooth drive to job, got to her desk, and started the workday as a manager.  More specifically, a... </span></div></div>",
            "created":1452056400,
            "id":2085027,
            "title":"An office building."
        },
        "13":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Physician",
                "Nurse",
                "Administrator",
                "IT Manager",
                "Recruiter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is Kim Nishikawa's career in medical care? </span></div></span></div>",
            "created":1438405200,
            "id":2015006,
            "title":"A hospital."
        },
        "131":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Try to head for the lost and found",
                "Try to make it to her vehicle",
                "Wait for someone else to come it"
            ],
            "content":"<div class=\"\"><div> <span>\"Will you be joining us, Kim?\" Dr. Michael Freeman asked before Kim entered the locker room.  Dr. Kim Nishikawa considered a moment as another doctor moved passed.  She didn't feel too tired to hang out with some of her coworkers; it would probably be fun and relaxing start of her days off.<br>\r\n<br>\r\n\"Sure, Mike.  Maybe you can show me that trick shot I've heard about.\"  Besides being a driven, handsome young surgeon, Michael was rumored to have been a pool shark in college.<br>\r\n<br>\r\n\"No promises,\" he replied and waved bye as Kim went in.  Kim was anxious for the upcoming get together and quickly stripped out of her clothes.  She felt a little sweaty from her shift and decided to take a rinse off shower.<br>\r\n<br>\r\nLeaving her work clothes and regular clothes on a bench, Kim rushed into the shower.  The hot water was invigorating as it covered her.  The streams ran down her perky hills,  flat stomach, and curvy legs.  She closed her eyes and she turned around and the heat soothed her tense shoulders, smooth back, and taunt rear.<br>\r\n<br>\r\nIt was not usual for her to indulge so long in the shower, but it felt like a siren song made liquid.  After several more minutes, she sighed and turned it off.  She frowned as she started to walk out, hoping there would be fresh towels available at the end of the day.<br>\r\n<br>\r\nHer frown only deepened.  Both her work clothes and regular clothes were gone.<br>\r\n<br>\r\n\"Mother--\" Kim muttered and walked to the side of the shower.  She saw that all the towels were gone.  \"--fucker.\"  She realized it was the time and day all the left out work clothes and towels were taken to wash.  The custodial staff must have brought her regular clothes to lost and found, which was almost on the other side of the building.<br>\r\n<br>\r\nKim kicked an empty receptacle impotently.  She was breathing heavily and starting to pace as she thought.  Her boobs bounced and butt wiggled as she did.  Kim paused and then made her choice.</span></div></div>",
            "created":1464670800,
            "id":2156985,
            "title":"Physician"
        },
        "14":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "A robbery in progress.",
                "A noise complaint at a fraternity.",
                "A domestic disturbance.",
                "An indecent exposure call downtown.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Being a police officer wasn't the most glamorous job in the world, but Kim couldn't deny that she enjoyed it. She got to help her community be a safer place, she wasn't cooped up in a cubicle all day, and she got to enjoy a few perks afforded to police here and there. That didn't change the fact that being on patrol could be incredibly dull at times.<br>\r\n<br>\r\nKim didn't exactly want to have to deal with high pressure situations every day, but sometimes having at least <i>something</i> to do was a welcome change of pace. Otherwise she was simply driving her route for hours on end, keeping an eye out for whatever infractions caught her attention. Kim liked to consider herself one of the more lenient officers on the force, but she still had a quota to fill every month, after all.<br>\r\n<br>\r\nLittle did Kim know as her radio crackled to life that this next call was going to be far more intense than any she'd taken before. Her police training had prepared her for plenty of situations, but the one she was about to find herself in was not one of them, and wasn't something she could have anticipated. After all, the idea that she'd find herself stripped naked seemed ridiculous when answering a call for-</span></div></div>",
            "created":1412398800,
            "id":1866393,
            "title":"A police officer on patrol."
        },
        "141":{
            "author_id":"osepp",
            "author_name":"halofan6743",
            "choices":[
                "The bank in the middle of the day",
                "The museum in the middle of the night",
                "Doesn't matter she's already as good as stripped."
            ],
            "content":"<div class=\"\"><div> <span>There was a robbery going down. Dastardly crooks were trying to make off with valuables that obviously didn't belong to them. Naturally there'd be nothing that Kim wouldn't love more than to open a can of police justice on their asses, and haul them off to jail. Though she might have had a different attitude if she knew one of the valuables to be stolen today was her own modesty.<br>\r\n<br>\r\nSo where, and when does this crime she's trying to prevent go down?<br>\r\n<br>\r\n<b>The bank in the middle of the day:</b> It's a daring daylight raid. The crooks are emptying the vault, taking hostages, and making demands. Its pretty obvious to guess where it goes from there.<br>\r\n<br>\r\n<b>The museum in the middle of the night:</b> It's seemingly dark, empty, and boring when kim and backup arrive to investigate the security system going off. Its a faulty system at best, or a sneaky cat burglar who's taken care of the night guard already at worst.<br>\r\n<br>\r\n<b>Doesn't matter:</b> Skip straight to the good part she's the one being robbed right here right now.</span></div></div>",
            "created":1450242000,
            "id":2075342,
            "title":"A robbery in progress."
        },
        "1411":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Command center",
                "Another officers",
                "Sneak into the bank"
            ],
            "content":"<div class=\"\"><div> <span>Kim was heading to the first national bank, the silent alarm went off an hour ago. From the  first reports, a gang of five female robbers had storm the bank as soon as it opened.<br>\r\n<br>\r\nThey have taken four female tellers and their female manager hostage. They been emptying the vaults, when the bank was surround.<br>\r\n<br>\r\nNow it's a stand off, Kim grinned she was imagining herself single handling arrest the robbers. This could her chance to be on TV and make a name for herself.<br>\r\n<br>\r\nIn reality by the end of day, Kim would be on TV and make a name for herself, but not in the way she thinks.<br>\r\n<br>\r\nKim arrived at the bank,and got out of her car.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: She went to the command center.<br>\r\n<br>\r\nOption 2: She went to fine some other officers.<br>\r\n<br>\r\nOption 3: She look for a way to sneak into the bank.</span></div></div>",
            "created":1557359700,
            "id":2657178,
            "title":"The bank in the middle of the day"
        },
        "1412":{
            "choices":[
                "They spit up",
                "They stay together"
            ],
            "content":"<div class=\"\"><div> <span>Kim got to the museum with two other officers. First there was mirabelle she was Hispanic 5'10\" with a slender builed. She had brown eyes and short brown hair with C cups. The second officer was Fiona. She was white 5'11\" with an athlete builed. She had long red hair with green eyes with D cups. Kim was the senior officer took charge. The three enter the museum. </span></div></div>",
            "created":1457326800,
            "id":2114397,
            "title":"The museum in the middle of the night"
        },
        "14121":{
            "choices":[
                "Put on a security guard uniform",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The three officers entered the museum. All three pulled their guns and flashlights.<br>\r\n<br>\r\n<br>\r\n\" Listen Ladies we don't know you or what triggered the alarm. So be careful. Mirabella you search the second floor. Fiona you take the third floor.\" Said Kim.<br>\r\n<br>\r\n<br>\r\nBoth officers nodded. Then they split up. <br>\r\n<br>\r\n<br>\r\nUnknown to the three officers. They were being watched. The burglur was watching then throw the security cameras. <br>\r\n<br>\r\n<br>\r\n\" Well this complicate things.\" Said Gale.<br>\r\n<br>\r\n<br>\r\nShe was in the camera room. She has taken out the five male guards already. She was in the middle of stealing the priceless Chinese jewelry collection when she got sloping and trigged the alarm. She was thinking how to get rid of the cops. <br>\r\n<br>\r\n<br>\r\n<br>\r\nWhats her idea?<br>\r\n</span></div></div>",
            "created":1459141200,
            "id":2124162,
            "title":"They spit up"
        },
        "141211":{
            "choices":[
                "Fiona",
                "Another one"
            ],
            "content":"<div class=\"\"><div> <span>Gale was 5\" 11\" tall. She had an athletic build with D cup breast . She had blue eyes and brown short brown hair. <br>\r\n<br>\r\n<br>\r\nGale was thinking how to get rid of the officers. She was walking around when she enter the locker room. That was connected to the security camera room. Then she notes some female locker. This gave her an idea. She check the lockers and found what she hope for a female guard uniform. It was a navy blue shirt and pant combo. The shoes were simple black dress shoes and a black tie. Plus a gun belt. She strip and put on the uniforms. <br>\r\n<br>\r\n<br>\r\nShe did not care for the look but she had to trick the officers.  Before she left the camera room she add some of her tools to the belt. Then she left the camera room.<br>\r\n<br>\r\n<br>\r\nWhich officer did Gale go after first?</span></div></div>",
            "created":1459227600,
            "id":2124652,
            "title":"Put on a security guard uniform"
        },
        "1412111":{
            "choices":[
                "Mirabella",
                "Kim"
            ],
            "content":"<div class=\"\"><div> <span>Gale slowly made her way to the third floor. She carefully snuck behind the office. <br>\r\n<br>\r\n<br>\r\nGale raise her gun and jump out at the officer.<br>\r\n<br>\r\n\" Freeze !\" Said gale.<br>\r\n<br>\r\n<br>\r\nFiona was shocked. She slowly raise her hands and said.<br>\r\n<br>\r\n<br>\r\n\" My name is officer Fiona O'Brien. Me and two other officer respawned to the alarm.\" Said Fiona. <br>\r\n<br>\r\n<br>\r\nGale lower her gun and told Fiona to turn around. <br>\r\n<br>\r\n<br>\r\n\" Thank goodness you are here. I lost contact with the other guards. I do not know what's going on.\" Gale said in a worry tone.<br>\r\n<br>\r\n<br>\r\n\" It's going to be alright. Me and my friends are going to help and what's your name.\" Said Fiona.<br>\r\n<br>\r\n<br>\r\n<br>\r\nGale said it was Rose.<br>\r\n<br>\r\n<br>\r\n<br>\r\nFiona radio the other officers and told them about Rose. <br>\r\n<br>\r\n<br>\r\n\"Have you seen eneyone else.\" Said Fiona.<br>\r\n<br>\r\n<br>\r\n<br>\r\nGale shook her head.<br>\r\n<br>\r\n<br>\r\n\" Let's look together.\" Said Fiona as she turn her back. She then felt a spark and was out cold.<br>\r\n<br>\r\n<br>\r\nGale was standing over her with a taser. She was grinning.<br>\r\n<br>\r\n<br>\r\n\" What a stupid cop.\" Said Gale.<br>\r\n<br>\r\n<br>\r\n<br>\r\nGale thought about what she will do to the cop. She smirk with a wicked idea. She drag the officer into a clearing closet. She then started to strip Fiona. First she took off the gun belt. Then Fiona's shoes and socks. Then she took off Fiona's shirt and pants. This left Fiona in her green bra and panties. Then Gale took those off. Then Gale handcuff Fiona's hands behinded her. Then Gale tried rope around Fiona's ankles. The blindfolded and gag her.<br>\r\n<br>\r\n<br>\r\nGale took Fiona's clothes and lock her in the closet. Then Gale found a trash can and threw the clothes in. <br>\r\n<br>\r\n<br>\r\nWhat officer is next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1459314000,
            "id":2125268,
            "title":"Fiona"
        },
        "14121111":{
            "choices":[
                "Bring Mirabella some clothes",
                "Leave her naked"
            ],
            "content":"<div class=\"\"><div> <span>Gale went to the second floor to take care of the second officer. She slowly snuck around to find the other officer. She saw the officer. She was looking around. Gale was thinking how to take her down. Then she got an idea. <br>\r\n<br>\r\n<br>\r\n<br>\r\nShe pull the fire alarm. The sprinklers went on. <br>\r\n<br>\r\n<br>\r\nMirabella was shocked as she got soaked. She ran for cover. The sprinklers stop after a few minutes. <br>\r\n<br>\r\n<br>\r\nGale just smirk. The she pull off her phone. She had hacked it the museum systems. She turn on the air conditioning. <br>\r\n<br>\r\n<br>\r\n<br>\r\nMirabella just sighed. First the sprinklers and now the A.C.. It could not get worst. She thought.Then she saw someone coming near her.<br>\r\n<br>\r\n<br>\r\n\" Are you officer Rodriguez ?\" Said Gale.<br>\r\n<br>\r\n<br>\r\nMirabella nodded. <br>\r\n<br>\r\n<br>\r\n\"Who are you ?\" Mirabella ask.<br>\r\n<br>\r\n<br>\r\n<br>\r\n\" I'm a guard at the museum. My name is rose.\" Said Gale.<br>\r\n<br>\r\n<br>\r\n<br>\r\nMirabella nodded.<br>\r\n<br>\r\n<br>\r\n\" Officer O'Brien sent my to check up on you. \" Said Gale. <br>\r\n<br>\r\nShe check Mirabella out.<br>\r\n<br>\r\n<br>\r\n\" What happen to you?\" Ask Gale.<br>\r\n<br>\r\n<br>\r\nMirabella told her everything. <br>\r\n<br>\r\n<br>\r\n\" You have to get out of your clothes before you get sick.\" Said Gale.<br>\r\n<br>\r\n<br>\r\nThis made Mirabella blushed. <br>\r\n<br>\r\n\" I can't do that I will be naked.\" Said Mirabella.<br>\r\n<br>\r\n<br>\r\n\" I will bring you some of my clothes. So strip.\" Said Gale.<br>\r\n<br>\r\n<br>\r\n<br>\r\nMirabella blush and started to strip. She got naked. Gale quickly grab all of Mirabella things and ran off. Mirabella cover herself the best she could.<br>\r\n<br>\r\n<br>\r\nWhat dose Gale do?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1459486800,
            "id":2126184,
            "title":"Mirabella"
        },
        "14122":{
            "choices":[
                "Dress up as one of the guards ",
                "Activate the sprinkler system"
            ],
            "content":"<div class=\"\"><div> <span>The three officers entered the museum. <br>\r\n<br>\r\n\" Listen Mirabelle and Fiona , we will stay together. Standard search formation.\" Said Kim.<br>\r\n<br>\r\nMirabelle and Fiona just nodded. Kim took point. Mirabelle was in the middle and Fiona brought up the rear. They began to search the first floor.<br>\r\n<br>\r\n<br>\r\nNatalie was finishing tying up the last guard. It was easy to get in. First she pretend to break down outside of the museum. In her little black dress. Then one of the guard come up to her to help. He was to busy trying to fix her car and thinking he was going to get lucky. That he did not see her come up behind and she taser him. Then she tied him up and put him into the trunk of her car.<br>\r\n<br>\r\nShe use his keys. To entered the museum. She snuck around and disable two out of three guards with easy. The third turn around at just the right moment and saw her. It was a fight to knock him out but she did. Unfortunately he pull the alarm. Before she knock him out. She just sealing the guards in a closet in the security room. When she notice the three cops entering. She cursed. <br>\r\n<br>\r\nShe needed to think fast. She need a way to get rid of the cops but how she thought.<br>\r\n<br>\r\nThen she got an idea...</span></div></div>",
            "created":1472446800,
            "id":2203136,
            "title":"They stay together"
        },
        "141222":{
            "choices":[
                "Kim and her back up",
                "Natalie"
            ],
            "content":"<div class=\"\"><div> <span>Natalie was looking all over the security room. Try fine anything that could help her against the cops. After a few minute she the fire control system. She grinned wickedly as she got an idea. This might not get rid of the cops but it will make it easier to deal with.<br>\r\n<br>\r\n<br>\r\nNatalie turn on the fire sprinkler system with a smirk. Once that was done she headed into the security guards locker room. She hope there is at least one female security guard. It took a few minutes to fine and open a locker. She took out the uniform it. She strip off her little black dress and heels. <br>\r\nShe put on the uniform. It was just a white dress shirt with a logo on the seveels. It barely fit her. She had D cups who every this female guard was had a small bust. The buttons where barely holding. The next piece was a pair of black dress pants and she put on the black dress shoes. Lastly she put on the gun belt.<br>\r\n<br>\r\nOnce she was dress. Natalie walk back to the fire control system and turn it off. She looked at the monitors and saw the cops. They where totally soak she had a good laugh with that. Then she located them and headed off the \"help\" them. She left the security with a smirk.<br>\r\n<br>\r\nWhich character do you want to follow ?</span></div></div>",
            "created":1506920400,
            "id":2395437,
            "title":"Activate the sprinkler system"
        },
        "1412222":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Natalie walk slowly to where the three cops where. She smirk as she thought of all the ways she will have fun with them. She was nearing the location. She change her face to one of worry. She pull out her flashlight and turn it on. <br>\r\n<br>\r\nKim and the other where pissed. They where just starting to search then the sprinkler just trun on. They did not stop for about 10 minute. They could not fine any cover so they where totally soak. Then Kim heard foot steps. They pointed their guns. Then they show her. She was tall with blue eyes and long blonde hair. She was a security guard.<br>\r\n<br>\r\n\" Please don't shoot. \" Said Natalie. The three cop lower their guns. \" Do you work here?\" Ask Kim. The guard nodded. \" The computer systems have been acting up all night.\" Said Natalie.<br>\r\n<br>\r\n\" Well the alarm actived and we got the call. So are you alone.\" Said Kim. <br>\r\n<br>\r\n\" Yes the other man guards decided to leave early. So I'm alone.\" Said Natalie.<br>\r\n<br>\r\n\" Do you mind if we check around ?\" Ask Kim. Natalie said it was fine. \" By the way what's your name ?\" Ask Kim. Vicky reply Natalie. \" Since your girls are all wet. Why don't you come back to the locker room. We have a shower and I see if I can get you some dry clothed.\" Said Natalie.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: Kim said later. First they must search the museum.<br>\r\n<br>\r\nOption 2: Kim agreed and they headed to the locker room.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1507535040,
            "id":2398513,
            "title":"Natalie"
        },
        "1413":{
            "choices":[
                "Option 1",
                "Option 2",
                "Option 3"
            ],
            "content":"<div class=\"\"><div> <span>Kim was kicking herself right now. She thought this was going to an easy bust. She was wrong. Right now , she was at the mercy of this criminal. Kim was thinking back on how everything went wrong.<br>\r\n<br>\r\nIt was a quiet night. She was alone in her car. As she was on patrol. Her shift was almost over. Then she saw a jewelry store with a smash front window. Kim smiled. An easy bust. She decided not to call fro back up ( her first mistake). She got out of her car. She carefully entered the store by the smash window. <br>\r\n<br>\r\nShe thought the would be thief. Was just a teenager. Looking to steal and sell the jewelry for some pot. So she did not draw her gun ( her second mistake). She grab her flashlight and started to search the store. <br>\r\n<br>\r\n\" Listen little boy. If you just come out without trouble. All I will do is call your parents. OK.\" Said Kim. <br>\r\n<br>\r\nShe continue to search the store. She was not worry about her situation. So she let her guard down ( her last mistake). She felt her gun being quickly remove form her holdster and being jam in her back. Kim mentally curse.<br>\r\n<br>\r\nThat is how Kim got into her situation. She bit her lip. She was thinking on how to out of this situation. That is when the crook spoke.<br>\r\n\" Strip and don't try anything.\" Whispered the crook. <br>\r\n<br>\r\nKim blushed. The crook can not be serious. Kim was thing of what to do. Right now she wanted to turn around and deck the little creep but he/she have her gun. She did not want to strip but maybe if she take off a piece or two. She could distracted the creep and disarm him/her.<br>\r\n<br>\r\n<br>\r\nWhat dose Kim do ?<br>\r\n<br>\r\nOption 1: Strip a little and try to take down the creep.<br>\r\n<br>\r\nOption 2: Screw this creep and fight back.<br>\r\n<br>\r\nOption 3: Another police officer shows up.<br>\r\n  ( reader choice on the gender of the other officer.)</span></div></div>",
            "created":1506229200,
            "id":2390485,
            "title":"Doesn't matter she's already as good as..."
        },
        "14131":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim sigh she wanted to turn around and deck this creep but she knew better. She have no choice but to do as she was told.<br>\r\n\" I'm going to take off my belt.\" Said Kim the crook says nothing. <br>\r\n<br>\r\nKim move her arm to her belt buckle. She undid it and took off it. She raise her arms and held the belt in one hand. The crook took the belt and put over their shoulder. Kim gluped she started to unbuttoned her shirt and slid it down her shoulder. It fall to the floor. Kim was wearing a black lace bra.<br>\r\nKim bend down and untie her shoes. Then she slid them off and put them next to her. <br>\r\nKim was piss as she unbutton and zip her pants. She let them fall to the floor. Then she step out of them. This left her in her black lace panties and black socks. <br>\r\n<br>\r\nKim was foaming at the mouth right now. Hopefully the teenage boy was fantasizing about her right now. She was planning her next move. To take down this little creep.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: The crook jam the gun into Kim's back and order her to take off the rest of her clothes.<br>\r\n<br>\r\nOption 2: another officer shows up</span></div></div>",
            "created":1506834000,
            "id":2395079,
            "title":"Take off her uniform"
        },
        "141311":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim was planning to turn around and drop the little creep. That is when she felt it. Her jam into her back. \" Lose the lingerie.\" Order the crook. Kim's jaw droped she was expecting the crook to be distracted but they was not. Kim really did not want to strip further but she had no choice.<br>\r\n<br>\r\nShe growled as she unhook her bra and took it off. She let it fall to the floor. Then she took of her sock and put them next to her shoes. Kim was both angry and embarress. As she slid her panties off and step out of them. <br>\r\n<br>\r\nKim did not let herself cry. She was wondering what will happen to her and kicking herself for this situation she was in.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: another officer show up<br>\r\n<br>\r\nOption 2: the crook handcuff Kim</span></div></div>",
            "created":1506834000,
            "id":2395110,
            "title":"Lose the lingerie"
        },
        "1413111":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Once Kim was naked the crook order her to move away form her uniform. Kim did as she was order and step a few feet away from her uniform. Then she heard the crook walking over to it and putting all of her clothes into a bag. <br>\r\n<br>\r\nKim felt ashamed for letting her be strip of her uniform. This night could not get any worst she thought. Just as Kim was finishing that thought she heard another cop pull up. Kim wonder could this help or just get her humiliated more.<br>\r\n<br>\r\nKim heard an officer step out of the car. <br>\r\n\" Is every thing OK in their. Do you needed back up. \" Ask the officer. Kim notice the voice was female. At least that was not a male officer Kim thought. Then the crook grab Kim and whispered. \" I will shoot my way out. So get rid of the cop.\" Said the crook. <br>\r\n<br>\r\nKim thought able this. One she could call for help. The crook needed to be arrested. Kim thinks she can get snuff of a warning to the other officer. On the over hand Kim dose not want to the other officer live to be in danger. She would a hostage and if there only on cop. She could be taken hostage too.<br>\r\n<br>\r\nWhat dose Kim do ?<br>\r\n<br>\r\nOption 1: Yelle for help.<br>\r\n<br>\r\nOption 2: Try to get the other officer to leave.<br>\r\n<br>\r\n</span></div></div>",
            "created":1507189920,
            "id":2396650,
            "title":"Help or humiliation"
        },
        "14131112":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim took a deep breath. She needed to get the other officer to leave. She did not want to see the other hurt or worst. \" Yes , everything is fine. The robber got away just checking for clues.\" Said Kim. A few moments later.<br>\r\n<br>\r\n\" Do you needed help ?\" Ask the other officer. Kim sigh \" No there is not much to check and I'm all done.\" Said Kim hoping this was enough to get ride off the other officer.<br>\r\n<br>\r\n<br>\r\n\" OK , do you want me to call it in ?\" Ask the other officer. Kim just wanted to get rid of this officer.\" No I already called in.\" Said Kim. \" Good Night them.\" Said the other officer and Kim heard foot steps. <br>\r\n<br>\r\nKim breeze a sigh of relieve. She hope the crook will be satisfied. Kim felt the gun jam into her back. \" Good job officer. Now you are going to cuff yourself and if you behave yourself I might leave your uniform here when I leave.\" Said the crook.<br>\r\n<br>\r\nThen Kim felt her handcuff bring put in her hands. Kim then cuff herself. She curse under her breath as she did it. <br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: The crook finish what they where doing and leaves. ( Your choice if the crook leave Kim her uniform.)<br>\r\n<br>\r\nOption 2: That other officer come charging in.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1507533840,
            "id":2398507,
            "title":"Saving a cop"
        },
        "141311122":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim was wondering how this night could get any worse .... then she heard foots steps. The other officer charged in. Kim cursed , how can that officer be so stupid. The other officer stopped , and aim her gun at then. \"Frreeeeezzzeee , scum!!\" Stouted the other officer. Kim felt the crook's arm go around her neck , and the crook pointing her gun at the other officer. Both of them did nothing for a minute.<br>\r\n<br>\r\nKim felt totally humiliated , not only she is be held hostage. She was completely naked. Kim notice the other officer was blushing.<br>\r\n\" Drop your gun scum!\" Stouted the other officer. Kim notice she looked nervous , Kim feared she was a rookie. \" <br>\r\n<br>\r\n\" No , you drop hour's officer.\" Order the crook. The other officer do not compiled with the crook demand. Kim was <br>\r\nwondering , how this was going to play out. <br>\r\nShe did not try anything , for fear of making this situation worse for the other officer.<br>\r\n<br>\r\nAs Kim waited for this situation to be resolve. She got a good look at this officer. She was tall with a hourglass figure. She had long blonde hair and blue eyes. Then Kim notice her breast , they where huge. They could even be E cups. <br>\r\n<br>\r\n\" Now I will say this one more time , drop your gun.\" Order the crook. The other officer face's looked pissed ,  then she sigh and drop her gun. Kim was pissed herself , how can this officer be so stupid. Then the crook order her to slid the gun over and the officer did it. Next the crook order the officer to strip.<br>\r\n<br>\r\nAt first the officer just looked at crook , then he order again. Then the officer started to strip. First was her gun belt and then her shoes. Next she unbutton her shirt and took it off. She was wearing a red lace bra. Next she undid her pants and took them off. Now standing in only her lingerie. She try to cover herself. The crook order her to continue. She blushed as she took off her red bra and panties.<br>\r\n<br>\r\nOnce naked , the officer try to cover herself.<br>\r\n\" OK , Blondie now I want you to cuff yourself. \" Order the crook. The officer growled and did as she was told. Once the other officer was done. The crook order both Kim and this other officer , to stand facing the wall. Both Kim and this other officer did thing. They heard the crook , taking the other officer uniform. <br>\r\n<br>\r\nThen the crook , went back to stealing. After a few more minutes , the crook stopped. <br>\r\n<br>\r\nWhat does this crook do with are to officers ?<br>\r\n<br>\r\nOption 1: Leave them naked and cuffed at the store.<br>\r\n<br>\r\nOption 2: The crook , puts them in a car and drives off.<br>\r\n<br>\r\n</span></div></div>",
            "created":1508631060,
            "id":2404625,
            "title":"Someone to the rescue or not"
        },
        "1413111221":{
            "choices":[
                "Kim heard someone coming",
                "Kim found away to unlock the cuffs"
            ],
            "content":"<div class=\"\"><div> <span>\" OK ladies , I'm done with me fun , now be good little girls and stay facing the wall.\" Said the crook , Kim was anger , first she was stripped naked , one of her fellow officers failed at resucing her and letting herself be stripped naked too and now the crook is getting away , not only with the jewelry but their uniforms.<br>\r\n<br>\r\nThis was the worst day in Kim's life , she thought. Kim heard the crook walk out of the store and then she heard a car start up and drive away. Kim scream , she didn't know what else to do. She turn to the other officer and the other officer didn't look at her. <br>\r\n<br>\r\nKim wanted to chew her out but right now they had to something , anything to get free and catch that crook.<br>\r\n<br>\r\nWhat happen next ?</span></div></div>",
            "created":1523863740,
            "id":2480217,
            "title":"Option 1"
        },
        "142":{
            "choices":[
                "Door open they though she was one of the strippers",
                "They knew she was a cop"
            ],
            "content":"<div class=\"\"><div> <span>Kim pull up at the Alpha Alpha Alpha fraternity. It the most popular frat at the local collage. It was the jock frat too. She hated frats. In her opinion they were for nothing but drunk and arrogance boys who thought they were men. She walk up to the door and knock.</span></div></div>",
            "created":1457326800,
            "id":2114334,
            "title":"A noise complaint at a fraternity."
        },
        "1421":{
            "choices":[
                "The frat brother start to cheer to strip",
                "They mockly do as she ask"
            ],
            "content":"<div class=\"\"><div> <span>The head of the frat Mike answer the door. He look at the woman and like what he saw. \" About time you show up.\" \"You're an hour late Missy.\" Said Mike. Right there Kim wanted to slug him but knows that would get into trouble. \"Listen Boy I came here because of noise.\" Said Kim. \" O sheer officer I'm so sorry.\" Mike said mockly. \"Why don't you come in officer.\" Said Mike. Kim had a bad feeling about this but she need to do her job. So Kim went in. \"Listen sir all you have to do is turn down the music OK.\" Said Kim. \" Sheer officer why don't you follow me.\" Said Mike. Kim follow the boy into one of back rooms were the party is being held. Want had when is enter that room.</span></div></div>",
            "created":1457326800,
            "id":2114344,
            "title":"Door open they though she was one of the strippers"
        },
        "14211":{
            "choices":[
                "The real strippers show up",
                "One of the frat boy rip open her shirt"
            ],
            "content":"<div class=\"\"><div> <span>When Kim enters the room all of the frat stop what they were doing. They were very please at the woman they thought was a stripper. \" STRIP STRIP STRIP !!!\" They started to cheer. Kim was so angry right now. She march over the stereo and turn it off. \" Listen to me you little punks I'm not one of your harlots you hire for your pleasure.\" \" I'm an officer of the law and you are going to do what I say.\" Said Kim. The frat brothers started to Boo her. Want happens next.</span></div></div>",
            "created":1457326800,
            "id":2114354,
            "title":"The frat brother start to cheer to strip"
        },
        "142111":{
            "choices":[
                "Humiliated her some more",
                "Thought her outside"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly three woman came into the room. One was dress as a sluty cop. The costume was made up a zip up blue shirt , a blue short mini skirt ,fishnet stockings , black boots , a black cop hat , and a fake gun belt. She was white and 6 feet tall with a hourglass figure. She had long blonde hair , blue eyes and D cups. The other two where a black woman in a sluty pink one piece  nurse dress that zip in the front with a pink nurse hat, pink stockings and pink high heels. She was 6 feet tall with short black hair , brown hair with a slender build and D cups.  The last one was Hispanic with long black hair and brown eyes. She had a slender build with D cups. She was wearing a French maid  costume with white gloves and stockings. She was wearing black high heels. The sluty cop walk up to Kim and said \"You think you can steal this job from us bitch! \" Kim was piss. She wanted to her punch her. \" Listen here harlots I'm a real cop and was call here to make these punks turn down there music.\" Shouted Kim. Mandy the cop did not believe her. \" B.S. you little slut if you think you can steal from us you got another thing coming.\" Said Mandy. She then slug Kim. Kim all to the floor. Kim lost it. She got up and said \" That is assaulting a police officer you are under arrest.\" Kim was about to get her cuffs when Mandy tackle her the ground. The frat brothers started the cheer cat fight. Mandy was on top of Kim slapping her in the face. Kim got her legs around Mandy flip her and started to punch her. Then Sasha and crystal grab Kim by her arms and drag her of Mandy. Kim struggle to free her self but could not. Mandy got up walk to Kim. \" You bitch you are going to pay for that.\" Then Mandy rip open Kim shirt. Kim was shock and scream \" I'm not a stripper!\" . Mandy got a wicked idea. \" To night you are.\" Said Mandy mockly. Kim was scared and struggled even harder. \" Who would like to see her naked.\" Shouted Mandy. The crowd cheer and wolf whistle. Mandy the rip off Kim shirt and thought is to the crowd. Kim was wearing a plain white bra. \" Honey you need better lingerie if you are going to a stripper.\" Said Mandy sarcastically. Kim angry as ever. Mandy then took off Kim shoes and socks and thought them to the crowd. The frat brother cheer more. Mandy took off Kim gun belt and said \" This is mine now sweety.\" Then Sasha and crystal took Kim pants off and thought them to cword. Kim was left in her white bra and panty. Kim so angry and embarress right now. \" Stop this or all of you are going to jail.\" Stouted Kim. The women just laught at her. \"Where not done sweety.\" Said Many with a wicked grin. Mandy then rip off Kim bra and panty. Kimwas naked and felt so humiliated . She struggle was in vain. Mandy thought the underwear at the cword. They fought for them. Mandy then handcuff Kim arms behind her with Kim cuffs. \" What should we do now to this Bitch.\" Said Mandy.</span></div></div>",
            "created":1457499600,
            "id":2115161,
            "title":"The real strippers show up"
        },
        "1421111":{
            "choices":[
                "Mandy took Kim into another room",
                "Back up show up for Kim"
            ],
            "content":"<div class=\"\"><div> <span>Kim felt completely humiliated. She was an officer but got strip naked by three harlots. Mandy was thinking of what to do to Kim. After about a minute she got a wicked idea. She grab a chair and threw Kim on it. Kim had a feeling she is not going to like what the harlots have plan for her. \" Boys give something slow and sexy.\" Order Mandy with a grin. They gave her a song. Mandy slowly and sexy walk to Kim. She whisper into her ear \"We are going to have some fun\" in a seductive tone. Mandy then started to sway her hip and toss her hat to cword. The cword cheered and whistle. Kim tried to get up but Mandy push her back into the chair. \" I'm just getting started.\" Said Mandy. Kim hated what was happen to her. Being give a lap dance be this harlot was disgusting and angering her. Mandy trace her hands along her figure and slowly unzip her ship. Slowly took it off showing her sheer black strapless bra. Then she drop it to the floor. Then she took off her gun belt. Mandy then Sat on Kim lap and kiss her cheek. Kim was furious being use like prop. The cword wolf whistle. Mandy then got up turn around bend down. Shoving her ass in Kim face. Kim could see Mandy thong. Kim turn her face away. She feeling so humiliated right now but apart of her was begening to get turn on. Kim was disgusted with her for getting turn on. Mandy then took of her skirt and toss it to the cword. Now clad in  her black sheer lingerie. The cword cheer even louder. Mandy sat on Kim's lap and shove her face into her cleavage. The cword cheered at this. Kim struggle to get out. Mandy releave Kim. Kim was furious but was also turn on. Mandy then took her bra off. Putting it on Kim neck. Then Mandy put  her hands on Kim breasts and gave them a squeezes. Kim was shocked and glare at Mandy. Mandy then warp her arms around Kim neck and gave Kim a deep kiss. The cword cheered and whistle. Kim struggle to get but to no at veil. Kim was furious , disgusted but turn on. Mandy force her tongue into Kim's mouth. Kim tried to resist but gave in close her eyes and let Mandy continue kissing her. After making out with Kim. Mandy said \" Did you like that? \" in a seductive tone. Kim blushed and look down ashamed of feeling good about the kiss. Kim was confuse one part of her wanted to kill Mandy but another part wanted to continue. Mandy raise Kim head look into her eyes and said \" Do you want more?\". Kim was humiliated and furious but wanted more. Kim nodded. Mandy smile and said \" Good girl.\" And pated Kim head. Mandy then got up and took off her panty and toss them into the cword. What happens next?</span></div></div>",
            "created":1457845200,
            "id":2116901,
            "title":"Humiliated her some more"
        },
        "14211112":{
            "choices":[
                "Two female officers",
                "Two male officers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which  gender where the officers?</span></div></span></div>",
            "created":1457845200,
            "id":2116904,
            "title":"Back up show up for Kim"
        },
        "1422":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>The Door open up and a very drunk Frat brother answered. He smiled as he looked her over. Kim just frown she wanted to deck him but she hold back. \" Listen young man your neighbors have been complaining about your music. So could you please turn it down. That would be great.\" Said Kim with a fake smiled.<br>\r\n<br>\r\nThe frat brother just smiled.\" Sure Ms. Officer and why don't you came in. I bet your look great out of uniform.\" Said The Frat brother. Kim growl with anger she almost lost control and cold cock the jerk. Kim took a very short breath. Kim was about say something when the Frat brother slam the door close.<br>\r\n<br>\r\nKim was shock at the level of disrespect. Kim storm off to her car. She thought of a way to deal with these boys. After a few minutes she got an idea. <br>\r\n<br>\r\nWhat dose Kim do now ?<br>\r\n<br>\r\nOption 1: Try to sneak into the Fraternity.<br>\r\n<br>\r\nOption 2: Call some back up.<br>\r\n<br>\r\n</span></div></div>",
            "created":1507075620,
            "id":2395894,
            "title":"They knew she was a cop"
        },
        "14221":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Kim was not going to let some frat brothers from keeping her from doing her job. She started to look at the fraternity house. To see if there was another way in. After search for a few minutes. She saw a open widow on the third floor and luckily it was under some vines. Kim first check to see if the vines could hold her they could.<br>\r\n<br>\r\nThen she bag in to climb. After a few inches one of Kim's buttons got caught in the vines and when she try to get it loose it pop off. Kim curse and continue climbing but after another button pop off. Kim curse again but she will not be deter. As she continue to climb more and more of her buttons pop off.<br>\r\n<br>\r\nOnce she was at the widow seal. She pull herself into the house. The room she landed in was empty. That is when Kim notice all of her buttons from her shirt where gone. Kim blushed as her black lace bra was expose. Try to closes her shirt. Kim looked around for anything to wear.<br>\r\n<br>\r\nDid Kim fine something to wear ?</span></div></div>",
            "created":1507571700,
            "id":2398699,
            "title":"Option 1"
        },
        "142212":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim search the room twice but found nothing to wear. She cursed as she thought what to do next. She did not to go out of this room like this. She will not those frat boys see her lingerie. So Kim sigh as so untuck her shirt. <br>\r\n<br>\r\nThen she grab the ends of her shirt and tied them around her bust. Doing this might cover her bra but leaves her midsection exposes. Kim did not like this but want else could she do. She Kim sigh as she exit the room.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: Kim shirt gets caught in the door.<br>\r\n<br>\r\nOption 2: Kim meets some sorority sisters.</span></div></div>",
            "created":1508364960,
            "id":2403284,
            "title":"No"
        },
        "1422121":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim slowly opened the door , and looked out. She heard some loud music , and talking but no one was around. Kim slowly exit the room , she stay near the wall. She closed the door behind her , she started to move slowly. Then she felt it , her shirt was coming undone. She looked behind her , that is when she noticed. Her shirt was caught in the door , Kim cursed , and tried to pull it freed , but it refused to come loose.<br>\r\n<br>\r\nThat's when Kim heard them , foot steps , someone was coming up. Kim freaked out , she refused , to be seen like this. Kim spotted , a door on the other side of the hallways. Kim quickly walked over and opened the door. Kim entered the room , it was a bedroom. Kim quickly scanned the room , she found a closet door opened. She quickly entered the closet , leaving the door open a crack.<br>\r\n<br>\r\nKim heard , some people entered the room. By the sound of it , three people , one guy and two girls. They sound like , they where making out. Kim sighed , how come all collage girls , are so stupid. Kim continue to listen , that is when the three kids got on the bed , and started to go further. Kim sigh , in disgust but she had nothing else to do. She continue to listen.<br>\r\n<br>\r\nAs Kim continue to listen , what happened ?<br>\r\n<br>\r\nOption 1: She got turn on.<br>\r\n<br>\r\nOption 2: She got anger.</span></div></div>",
            "created":1508652060,
            "id":2404756,
            "title":"Option 1"
        },
        "144":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "A movie theater",
                "A playground",
                "A night club"
            ],
            "content":"<div class=\"\"><div> <span>It was late at night , as Kim was on patrol. She was by herself , it had been a very uneventful week. She was glad her days off where coming up , as she thought what she was going to do a call come over the radio.<br>\r\nShe got a indecent exposure call , Kim blushed and shook her head. Their where some strange and freaky people in this world and why does she had to deal with them , she sigh as she headed towards the call.<br>\r\n<br>\r\nKim arrived at....</span></div></div>",
            "created":1527956220,
            "id":2502045,
            "title":"An indecent exposure call downtown."
        },
        "145":{
            "author_id":"osepp",
            "author_name":"halofan6743",
            "choices":[
                "Playing bait in a sting to catch a gang of pickpockets",
                "Interrogating Amy a cat burglar who claims she can steal anything from anyone.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Theres more to police work than just responding to crime on the fly and chasing down trouble. Sometimes you gotta lay a trap for the crooks with a sting operation and let the trouble come to you. Other times you catch one of the crooks, and you gotta interrogate them for information about their friends, or what they did with the goods they have stolen, and it just so happens that today Kim was...</span></div></div>",
            "created":1425445200,
            "id":1943490,
            "title":"Other."
        },
        "1451":{
            "author_id":"sapphireninja",
            "author_name":"Secptor",
            "choices":[
                "Subway station ( she boarded a train)",
                "A mall",
                "A park"
            ],
            "content":"<div class=\"\"><div> <span>Kim was nervous as she adjusted her skirt, or what is suppose to be a <br>\r\n'skirt'. It barely went below her crotch. Kim sighed, her entire 'outfit' was a joke, if she was honest.<br>\r\n<br>\r\nShe sighed up to the police, to help people and catch criminals, not dress as a hooker. <br>\r\n<br>\r\nThe rest of her outfit wasn't that much better. First was the tight red halter top, it barley contain her breasts. At least she was give a black leather jacket. The skirt was barely a micro mini skirt, it was black.<br>\r\n<br>\r\nShe was even issue a strapless black lace bra and matching thong. A pair of fishnet stockings and finally a pair of black high heels.<br>\r\n<br>\r\n<br>\r\nYou might be wondering why Kim was dress like a hooker. Well for the past few months, a gang of pickpockets had been terrorizing the city.<br>\r\n<br>\r\nSo the police force had set up a special task force to deal with them. Now the gang only targeted women, so all the female officers had been assigned to the force.<br>\r\n<br>\r\nEach was issue clothing and a location to be bait for the gang. Kim wasn't alone, three additional officers where in hiding. They would monitor her and wait for the pickpockets to strike. Then they would jump and catch those thieves.<br>\r\n<br>\r\nKim wanted to catch them, but wearing this clothes where completely embarrassing.<br>\r\n<br>\r\nShe just wanted this assignment to end, so she could get back to her normal duties.<br>\r\n<br>\r\nKim was let out at her assigned location which was.....</span></div></div>",
            "created":1557359160,
            "id":2657174,
            "title":"Playing bait in a sting to catch a gang of pick..."
        },
        "1452":{
            "choices":[
                "Go after Kim like she said",
                "Go get something to start her plan"
            ],
            "content":"<div class=\"\"><div> <span>It was late at night at the local police station. Kim was to start the interrogation of the famous cat buglar Amy. As enter the room she look at Amy. She was blonde with blue eyes. Her hair was shoulder length. She was in mid 20's. With a hourglass figure and double D cup bust. She was wearing a black skin tight cat suit with boots. She was just smirking at Kim when she entered. Kim sat down a cross from Amy. \" So Amy the great cat bulgar we meet.\" Said Kim \"Listen I'm going say this ones I want the location of your safe house.\" \" You think you scare me officer.\" \" I'm not going to tell you nothing.\" Said Amy. \"You think you are going to escape from here.\" Said Kim. \" Yes .\" respawned Amy. \" I was just going to escape peacefully but now I going to steal your uniform when I do.\" Said Amy \"You think you can steal everything can't you.\" Said Kim. \" Yes I Can.\" Respawned Amy. Kim got mad at Amy arrogance. She went to Amy got right in her face and says. \" You are going to rot in jail.\" Said Kim. She the storm out of the room. Amy just smirk. Unknown to Kim. Amy got pickpocket to keys from Kim. Amy unlock the door. What dose she do first.</span></div></div>",
            "created":1457326800,
            "id":2114066,
            "title":"Interrogating Amy a cat burglar who claims she ..."
        },
        "14521":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Dress Kim in the catsuit with revealing holes and handcuff her",
                "Handcuff her to the upper freezer door",
                "Handcuff her behind her back and write mocking messages on her body"
            ],
            "content":"<div class=\"\"><div> <span>Amy was a professional, but she was also proud.  She was determined to keep her word to Officer Nishikawa.<br>\r\n<br>\r\nAmy quickly studied a layout of the building and glanced at the clock.  Given the briefness of the interrogation and it being the top of the hour, Kim had probably gone on a short break.  With the stealth and speed of a hungry panther, Amy dashed to the evidence room to recover her tools of the trade.  <br>\r\n<br>\r\n\"Here, birdie, birdie,\" Amy said as she then bounded for the breakroom.<br>\r\n<br>\r\nKim was still a little rattled from speaking with Amy and was trying to calm herself by reading the news bulletin.  There was going to be a retirement party for Captain Maria in the morning.  At noon there was sexual harassment training.  <br>\r\n<br>\r\n\"Like those ever do any good,\" Kim muttered cynically.  As a fit and comely twenty-something Asian-American woman, she had grown tired of some of her colleagues idea of acceptable remarks, jokes, and boundaries.  <i>Professional misconduct</i>, Kim mused. <br>\r\n<br>\r\nFinally, a big press conference about catching the cat burglar.  <i>Maybe when another officer comes in morning we could try good cop/bad cop.  Amy might be too clever for that, but she hasn't asked for a lawyer yet.  If she</i>--<br>\r\n<br>\r\nKim never finished that thought.  Kim reflexively started to turn to the sound of footsteps.  Amy, moving with the speed of Quicksilver, sprayed her homemade knockout gas in Kim's face.<br>\r\n<br>\r\n\"Fu--\" Kim began before she was out.  Amy, not being the violent type, caught the Amy's falling body and set it down.  <br>\r\n<br>\r\n\"Fun times ahead?  Yes, I agree Officer Kim,\" Amy quipped and in short order had Kim stripped down her her undergarments. <br>\r\n<br>\r\n\"You have lovely skin and a nice build, Officer Kim.  But it doesn't entirely match mine.\"  Amy aws fully naked and struggling with Kim's pants being too long in the leg and too tight in the seat.  The belt secured them enough and gave her an officer's tools in addition to her cat burgling bag.  The shirt was little better; Amy's round, sizable breasts fought against the fabric more than Kim's perky C cups ever had.<br>\r\n<br>\r\nEver image-conscious, Amy glanced in the mirror.  She loved the sex appeal her skin tight catsuit gave her, but in Kim's butt-hugging trousers and near button-bursting top she looked like she was going to be a stripper at some loser's bachelor party.  She half-frowned in response.  She would have given a full-frown had she been on her game enough to notice the small security cameras in the corner of the breakroom that fixed on movement and recorded her as a stripper for posterity.<br>\r\n<br>\r\nAmy looked at the unconscious Kim like she was the one who had pranked her.  \"Now,\" Amy said as she played with Kim's handcuffs, \"what else to do with you?\"  As she swung them around, her left boob popped out, revealing a small, pink nipple.<br>\r\n<br>\r\n\"Damn,\" she cursed as she adjusted it back into the top with allowance for great cleavage.  \"I'm glad no one saw that.\"  </span></div></div>",
            "created":1457326800,
            "id":2114095,
            "title":"Go after Kim like she said"
        },
        "145211":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Amy got a wicked idea. Since she is escaping in Kim's uniform. It's only fair that Kim wears her catsuit. Yes it will not fit perfectly but it would be so funny. <br>\r\n<br>\r\nShe strip Kim of her lingerie and then put the catsuit on her. Then she went over to the counter. She search for a minute. Then she saw what she was looking for a pair of scissor. She return to Kim and posed to cut hole in the chest area and the womanhood area. Once that was done she handcuff Kim with her own cuffs. She smirk as she left Kim helpless and humiliated.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: Kim wakes up<br>\r\n<br>\r\nOption 2: another fines Kim</span></div></div>",
            "created":1506834000,
            "id":2395139,
            "title":"Dress Kim in the catsuit with revealing holes a..."
        },
        "1452111":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim slowly woke up her eye sight was blurry and she had a headache. She try to move her arms but she could not. It took a minute for Kim to relies that her arms where behind her back and her hands where cuff. Kim let out a curse as she tried to get free.<br>\r\n<br>\r\nThat is when Kim relies that she was not in her uniform but Amy's catsuit. Then Kim almost die when she saw that the catsuit has been modified. Amy must have cut hole to humiliated her. With Kim's arms behind her and her hands cuff. She could cover her breasts and woman which was on full display.<br>\r\n<br>\r\nKim felt a sense of humiliation. She was angry as hell. She was going to fine Amy and make her regret doing this to her.<br>\r\nKim slowly look out of the break room. She breath a sigh of release as there was no body around. She took off to go get Amy.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: She fines Amy.<br>\r\n<br>\r\nOption 2: She runs into an officer.<br>\r\n<br>\r\n</span></div></div>",
            "created":1507572600,
            "id":2398710,
            "title":"Option 1"
        },
        "14521111":{
            "choices":[
                "Option 1",
                "Option 2"
            ],
            "content":"<div class=\"\"><div> <span>Kim had to hurry. It was almost dawn and the main shift of officers would be arriving soon. She did want to be caught in this outfit and have to tell the other officers. She some how let Amy get away. Kim first search the evidence room but Amy was not there. <br>\r\n<br>\r\nKim was running out of time. The next location Kim check was the female officer locker room. She thought maybe Amy would steal some street clothes. When Kim arrived at the locker room. It was empty Kim decided to check her locker. To she if her spare key for her cuff was in her locker. <br>\r\n<br>\r\nWhen she got to her locker Kim cursed out loud. Her locker was broken into and everything was got. Amy is going to get it when she fines he Kim thought. Kim decided to rush to the car port. Maybe Amy is looking for a ride out of here.<br>\r\n<br>\r\nOnce Kim arrived at the car port. She began to search for Amy. She found her on the hood of her partol car. In a pose out of a sleazy magazine. \" Well birdie you track me down and don't you look good in my clothes.\" Said Amy in a mocking tone. <br>\r\n<br>\r\nThat was it Kim was piss as hell. She charge at Amy. She to tackle Amy but Amy quickly jump over Kim. Kim hit the hood of her car hard. Amy rush over to Kim and pin her against the car. Kim try to get Amy off but she could not.<br>\r\n<br>\r\nWhat happen next ?<br>\r\n<br>\r\nOption 1: Amy strip and leave Kim in the car port.<br>\r\n<br>\r\nOption 2: Take Kim with her as she escapes.</span></div></div>",
            "created":1508364660,
            "id":2403281,
            "title":"Catching the Cat"
        },
        "145212":{
            "choices":[
                "Kim breaks the handle",
                "She calls for help"
            ],
            "content":"<div class=\"\"><div> <span>First thing Amy did was strip Kim of her undergarments. Then she drag Kim to refrigerator and handcuff her the freezer door handle. Then she left the break room. Amy decided to rob the evidence room. Kim woke up little pite later. She happed a headache. She felt cold. Then she realizes she is naked. She tried to move her arms but could not. She saw she was handcuffed to the freezer door. She was going to kill Amy when she free herself. Want happens next.</span></div></div>",
            "created":1457326800,
            "id":2114395,
            "title":"Handcuff her to the upper freezer door"
        },
        "1452121":{
            "choices":[
                "Go after Kim",
                "Go to her locker for clothes and the keys to the cuffs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim was furious. She was going to get Amy for this. She hit and pull on the handle with all of her strength. It a couple of minutes but the handle broke. Want dose so do know.</span></div></span></div>",
            "created":1457413200,
            "id":2114704,
            "title":"Kim breaks the handle"
        },
        "14521212":{
            "choices":[
                "Another officer",
                "Amy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim had to gets some clothes. So peek out of the break room. She saw the coast was clear. She slow made her way to the locker room. Nobody was in it. She made it to the her locker. When she her the door open. Who entered.</span></div></span></div>",
            "created":1457499600,
            "id":2114987,
            "title":"Go to her locker for clothes and the keys to th..."
        },
        "145212122":{
            "choices":[
                "Stay in the locker room",
                "Go after Amy"
            ],
            "content":"<div class=\"\"><div> <span>\" Well look who it is.\" \" The mighty office Kim but wait she out of uniform.\" \" That is very unprofessional.\" Said Amy. Kim was about to charge. When Amy drew Kim gun. \" I would not do that Kim.\" Said Amy. Kim slowly back away. \"Let my guess that's your locker right and you have a spare key.\" Said Amy. Kim just stand quietly. \" Open your locker and move away slowly.\" Said Amy. Kim did what Amy said. Amy went to the locker and stuff all of Kim things in her gym bag. Amy was about to leave. \"Amy please do not leave me here naked and cuff.\" Beg Kim. Amy stop and thought about what to do. \" Ok Kim here the deal I'm going to leave and come back with some clothes.\" \"So I want you to stay here.\" \" If you leave or call for help you will be sorry OK.\" Said Amy. \" Ok Amy you win.\" Said Kim. Then Amy left. What did Kim do.</span></div></div>",
            "created":1457499600,
            "id":2114993,
            "title":"Amy"
        },
        "1452121221":{
            "choices":[
                "To her safe house",
                "Kim's Apartment"
            ],
            "content":"<div class=\"\"><div> <span>Kim hated it but had no choice. She feared what Amy would do to her. Amy came back a little bit latter. Amy thought the keys to the cuff at Kim. Kim unlocked them. \" Put these on.\" Said Amy. It was a prisoner orange jump suit and shoes. \" You are going be a prisoner I'm transporting to another jail.\" Said Amy. Kim was furious. She was an officer but Amy had her gun. Kim put on the jumpsuit and shoes. \" If you try everything I will shoot you.\" Said Amy. Then Amy order Kim to recuff herself. Then they left the locker room and made to the garage. Amy put Kim in the back seat of Kim car. Amy got in drove off. Were is Amy heading.</span></div></div>",
            "created":1457499600,
            "id":2115164,
            "title":"Stay in the locker room"
        },
        "14521212211":{
            "choices":[
                "Help Amy",
                "Say no"
            ],
            "content":"<div class=\"\"><div> <span>They came to Amy's safe house a few hours later. Is was abandoned warehouse. They drove in. Amy exited the car and drew Kim' s gun. She open the back door and told Kim to exit. Amy escorted Kim to the area of the warehouse she been using. Amy toss Kim the keys to the cuffs and told her her to uncuff herself and strip. Kim was angry and humiliated because let Amy capture her. Once Kim was naked Amy told her to cuff herself to a support beam. Once Kim was cuff. Amy pick up the jumpsuit and shoes and took them over where Amy store her clothes. \" You are not going to get away with this.\" Stouted Kim. Amy just ignore Kim and strip out of Kim uniform. \" Listen sweety be a good girl why I dispose of these clothes and the car OK.\" Said Amy. Kim was furious that was her uniform and car. \" You can not do that.\" Stouted Kim. Just got dress in a pair of lacy black bra and panty , a black turtle neck , a pair of jeans and black socks and boots. She just left Kim and dispose of Kim things. Kim was angry and to invain to break the cuffs. Two hours late Amy return. \" Hey sweety do you want some thing to eat?\" Ask Amy. Kim did not say a word. \" Listen Kim this is not personal OK maybe a little but I'm not letting you go before I comeplete my job.\" Said Amy. Kim thought of an idea. \" What is your job?\" Ask Kim. Amy smirk her plan was working. \" I'm going to rob the Tsar jewelry collection at the museum.\" Said Amy. There must be millions in jewels at the exhibit Kim thought. \" You are going to stay here until I'm done.\" Amy said. Kim had to get free to stop Amy but how. Amy look at Kim and grin her plan was coming together. \" You know there a lot of jewels there if only I and someone to help me.\" Said Amy.  Kim thought of an idea if she could get Amy to let her help her maybe she could get the drop on Amy but how. \"Now do you want something to eat?\" Ask Amy. Kim agree to eat. Amy toss her the keys to the cuffs. Together they went to the dinner area. Amy made some soup and sandwiches. Once they were done Amy took Kim to bathroom. Once there Amy gave Kim some hygen products. Then told Kim to a shower. Amy watch Kim took her Shower. \" You have a nice body Kim not as nice as mine but steal nice.\" Said Amy. Kim blushed. Then Kim shook her head what was Kim thinking. Once Kim was cuff back to the support beam. Amy left to clear herself up. Kim waited teal Amy returned. \" You know Kim why don't you help me rob the museum.\" Said Amy with a grin. Kim thought about it. \"Maybe you could get the drop on me Kim.\" Said Amy. What dose Kim do? </span></div></div>",
            "created":1457672400,
            "id":2116154,
            "title":"To her safe house"
        },
        "1452121222":{
            "choices":[
                "Take her to the interrogation room for some fun",
                "Take her and Kim's car and dump her some where"
            ],
            "content":"<div class=\"\"><div> <span>Amy left the locker room. Kim waited for a minute. She was furious. Amy stolded first her uniform and now her clothes. Kim will let this stand. Kim open the door a little. She saw no one. It was almost time for the morning shift to started. Kim have to get Amy before they get here. Kim slowly made her way through the hallways. Kim wonder where Amy could have gone. Kim then realises that there spare keys and uniform in the supplies room. Kim made her way there. Kim saw that the door was open. She peeked inside and saw Amy going through the room. Kim flash with angry. Kim charged at Amy. Amy was look for something for Kim to wear and that would be humiliating too. Amy the heard a noise behind her. She turn and saw Kim charging at her. Amy roll out of the way. Kim almost tip trieing to stop. Amy glare at Kim. \" You are going to get it know Kim.\" Stouted Amy. Kim look at Amy with searing hate. \" I'm going to destroy you Amy.\" Stouted Kim. Kim charged again. This time Amy was ready and grab Kim toss her to the floor. Then Amy got on top of her. Kim Struggle but she was pined.\" I was going  to being you some clothes but know is pay back time.\" Said Amy in angry. She then put Kim in a head lock. Kim struggle with all the angry and might she had but to no a veil. She felt angry and humiliation for letting this happened to her. Kim slowly losing concisrness and black out. Amy got up.\" I'm going to humiliate you Kim.\" Said Amy. What dose Amy do to Kim ?             <br>\r\n</span></div></div>",
            "created":1457845200,
            "id":2116948,
            "title":"Go after Amy"
        },
        "14521212222":{
            "choices":[
                "Middle of an ally",
                "In an empty lot"
            ],
            "content":"<div class=\"\"><div> <span>Kim woke up with a headache. Where ever Kim was it was dark. Kim tried to move arms and legs but could not. Her arms were cuff behind her and her legs were tied together to. She tried to speak but she has a gag in her mouth. So realeyes she was in a trunk of a car. Kim guess Amy tried her and put in a trunk of a car. The stop about an hour later. The lid of the trunk open Kim was blinded by the light. Amy grab Kim the hair and pull her out of the trunk. Where were they?</span></div></div>",
            "created":1458018000,
            "id":2118104,
            "title":"Take her and Kim's car and dump her some where"
        },
        "145212122221":{
            "choices":[
                "We have deal",
                "Go to hell"
            ],
            "content":"<div class=\"\"><div> <span>Kim was toss onto the ground. It took Kim a minute for her eyes to adjust to the light. She was in an alley. Then Kim saw her car. Amy stole her car. This made Kim furious. She tried to struggle but it was no use. <br>\r\n<br>\r\n<br>\r\n\" I told you to stay in the locker room Kim but you wanted to be a hero well look at you now.\" Said Amy with a smirk.<br>\r\n<br>\r\n<br>\r\nThis made Kim even angrier. Kim saw Amy was steel wearing her uniform. She glared at her with searing hate.<br>\r\n<br>\r\n<br>\r\nAmy just look back at her.\" Let me explain your situation your naked. No one knows you gone. In the middle of an alley.  And  I have all your clothes and car too. Now what to do.\" Said Amy.<br>\r\n<br>\r\nKim was totally helpless. She wanted to cry but would not give Amy the pleasure. Amy just stand there for a few minutes.<br>\r\n<br>\r\n<br>\r\n\" OK Kim hear the deal you are going to help me finish the robbery I was in the middle of before I got cot or I'm going to leave you here like this.\" Said Amy. Then she remove Kim's gag.<br>\r\n<br>\r\nWhat did Kim saw?</span></div></div>",
            "created":1458622800,
            "id":2121455,
            "title":"Middle of an ally"
        },
        "1453":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "A rough biker gang.",
                "A tightly run Yakuza operation.",
                "A smuggling ring."
            ],
            "content":"<div class=\"\"><div> <span>Kim had been training for this job for months now, doing research, practicing her speech, and immersing herself in the necessary culture. One of the most complicated jobs for many police officers was going undercover, taking on the persona of a criminal in order to infiltrate groups that were otherwise almost impossible to touch. One group in particular had been a nuisance to the department lately, and Kim was the best current candidate for the job of spying on them.<br>\r\n<br>\r\nThe job was high-risk, and the department wasn't going to take any chances that Kim could be traced back to them should her cover be blown. Simply put, mistakes were not an option, and Kim had a reputation for getting things done right.<br>\r\n<br>\r\nThis didn't mean the woman wasn't nervous, of course. Quite the opposite in fact, as she found herself settling the butterflies in her stomach even now. When she enrolled in the academy, Kim would have never imagined she'd be going undercover to infiltrate-</span></div></div>",
            "created":1430802000,
            "id":1974118,
            "title":"Other"
        },
        "15":{
            "author_id":"worlddominator",
            "author_name":"worlddominator",
            "choices":[
                "Managing a store",
                "A Producer",
                "Train conductor",
                "Professional hitman",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are her other possible jobs?</span></div></span></div>",
            "created":1412658000,
            "id":1868544,
            "title":"Other potential jobs."
        },
        "154":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "A major public speaking event Veronica was hosting.",
                "Veronica's private yacht as she hosted a party.",
                "Where Veronica least expects it: her own home."
            ],
            "content":"<div class=\"\"><div> <span>Kim set down her breakfast on the kitchen counter as she pulled up a stool and sat down, opening up the laptop waiting for her. The laptop was a nondescript affair, plain black and unassuming, but it was an integral part of Kim's job. Unlike the computer Kim had for her own personal use, this laptop was for work purposes only. Bought with cash in another state and accessing the internet through a server that would give her location as somewhere in Eastern Europe, Kim's activities were effectively untraceable. Such drastic measures were necessary when one was a professional hitman.<br>\r\n<br>\r\nKim idly began eating her breakfast as her free hand nimbly navigated to her email, pulling up her newest message and the contract details hidden within. Kim knew the code and its cipher by heart, so she had no trouble reading between the lines of what would normally be considered spam. What the woman read was... unusual, to say the least.<br>\r\n<br>\r\nWhen it became apparent that she wasn't being hired to kill anybody, Kim was ready to close the message then and there. Her job was clearly defined, after all. Then she saw the extra two zeros pinned onto her normal rate. That was more than enough to keep her attention.<br>\r\n<br>\r\nThe target was a woman by the name of Veronica Sinclaire, some kind of mega-rich woman with political connections. Whoever was hiring Kim didn't want Veronica dead, but rather wanted her reputation and dignity in tatters. In addition to the huge increase in pay, the employer was offering a substantial bonus if Kim could fulfill her objectives in \"creative\" ways.<br>\r\n<br>\r\nThankfully, Kim prided herself on being inventive. Sure, she wasn't exactly inventive when it came to what her client wanted, but she could certainly improvise. Now, she just had to get close to her target, and Kim already knew just where to strike...</span></div></div>",
            "created":1418446800,
            "id":1902099,
            "title":"Professional hitman"
        },
        "1542":{
            "choices":[
                "Get an invite.",
                "Disguise herself as an employee.",
                "Try to sneak aboard as is."
            ],
            "content":"<div class=\"\"><div> <span>Kim sighed in annoyance as she scoped out the party through a pair of high-powered binoculars. Had this been a normal assignment she could've brought her rifle up to the warehouse roof she was on and simply picked off the target at her leisure. <br>\r\n<br>\r\nAs it was, she needed to find some way onto the large yacht at the end of the marina without being detected by security. Easier said than done for a private party hosted by a wealthy and influential woman for other wealthy and influential people in the middle of a bright sunny afternoon. She knew the routes in, but getting aboard would be a hassle. Luckily for Kim, there were certainly options in place.<br>\r\n<br>\r\nThe party hadn't fully started yet and there were still more guests arriving. While it was an \"invitation only\" affair, it shouldn't be too difficult to find a wayward guest and...persuade them to give up theirs. She would need a fancier outfit to complete the look though.<br>\r\n<br>\r\nAnother way in could be swimming aboard and stealing the uniform of one of Sinclaire's employees, so she could pose as a caterer or even one of her bodyguards. Of course, there was the usual risk of one of the employees realizing they had no idea who the \"new girl\" was.<br>\r\n<br>\r\nOtherwise, she could certainly pretend to be a photographer if she needed an excuse to be in the area. Her more casual outfit consisting of a jacket, t-shirt and jeans did give her that \"poor paparazzi\" look, and she did have a camera in her car trunk. It wouldn't get her in by any means, but it wouldn't raise too many questions if a paparazzo was found trying to sneak aboard and did open up the opportunity to bribe someone to get in.<br>\r\n<br>\r\nWorse comes to worse, at least she still had the tranq-gun with a silencer in her back pocket. Bit less lethal than she was used to, but should help if needed. Now, how shall Kim get aboard?</span></div></div>",
            "created":1423371600,
            "id":1929411,
            "title":"Veronica's private yacht as she hosted a pa..."
        },
        "15421":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "The security search is more thorough than she'd expected.",
                "The woman she'd robbed runs out of the bathroom, screaming about the thief.",
                "There's something wrong with her invitation."
            ],
            "content":"<div class=\"\"><div> <span>Kim skirted the edges of the marina, keeping an eye on the incoming guests while staying out of sight. If she was going to get her hands on an invitation, she'd need to lure her victim away undetected. Doing that meant finding a guest that seemed gullible enough to help a stranger in need.<br>\r\n<br>\r\nIt didn't take long for Kim to find a suitable candidate, thankfully. A shapely young woman in a black dress clearly tailored to her form. Her auburn hair and pretty green eyes gave off a pleasant, helpful aura. She was clearly the kind of person that everybody could get along with, and exactly the kind of person Kim needed for her plan to work.<br>\r\n<br>\r\n\"Pssst. Miss.. Hey, miss!\" Kim loudly whispered from the bathroom she'd used as her observation post.<br>\r\n<br>\r\nKim's target stopped in her tracks, turning her head in Kim's direction with a confused look on her face. \"Me?\" she asked, pointing to herself.<br>\r\n<br>\r\n\"Yes, you! Miss, please, I need some help!\" Kim pleaded. \"I, uh... I need a hand with something.\"<br>\r\n<br>\r\nThe woman stepped forward, perhaps a bit hesitantly, while Kim kept most of her body hidden behind the bathroom wall. The young woman was still out of arms reach when she stopped short, earning a silent curse from Kim.<br>\r\n<br>\r\n\"What's wrong?\" the woman asked. \"Is there no toilet paper or something?\"<br>\r\n<br>\r\n\"No... not exactly.\" Kim said, putting on her best embarrassed face. She'd need to come up with a strong lie, and one that would elicit this woman's sympathy. Thankfully, the assassin had something planned. \"My boyfriend, well, soon-to-be-ex-boyfriend, lured me in here so we could... well, you know.\" Kim started, noting the light blush that quickly came to the woman's features. \"But, once I was ready to go, he took all my stuff and ran off! Bastard didn't even leave me a phone to call for help! Could I borrow yours? I just need to call a friend to bring me something to wear.\"<br>\r\n<br>\r\n\"Oh, you poor thing!\" the woman cried, reaching into her handbag as she stepped closer to the bathroom entrance. \"What kind of monster would leave a poor woman naked and defenseless in a place like this?! Why, it's- ah!\"<br>\r\n<br>\r\nThe woman was cut off as Kim quickly reached out and grabbed her and pulled her into the bathroom. Spinning the woman around, Kim quickly pressed a chloroform-soaked rag over the woman's mouth and nose. It wasn't long at all before the woman's struggling ceased and she went still, completely unconscious. Kim might have been a contract killer, but she didn't kill people other than her targets without good reason.<br>\r\n<br>\r\nDragging the woman into a stall, Kim quickly sat her victim down on the toilet before searching her bag for the invitation she needed. Thankfully it was an easy find. Now there was just the matter of appropriate attire.<br>\r\n<br>\r\n\"Nothing personal, hun. You understand.\" Kim whispered to the unconscious woman as she began gently pulling the dress off her body.<br>\r\n<br>\r\nA few minutes later, Kim stepped out of the bathroom the picture of sophistication. The woman's black dress flattered her own form quite well, and the high heeled shoes she had worn were even the same size. Proud of her discerning eye, Kim nonchalantly dumped her original outfit in a garbage can a few dozen meters away from the bathroom, quickly making her way down the marina to the ship. The assassin felt a small pang of guilt in leaving the poor girl in the same situation she herself had made up, but she quickly wrote it off as part of the job.<br>\r\n<br>\r\nSpeaking of the job, it was time to get closer to her target. Kim walked up to the ship with all the confidence in the world, sure that getting past security would be no problem now.<br>\r\n<br>\r\nThere was just one little hiccup in this plan...</span></div></div>",
            "created":1424667600,
            "id":1938967,
            "title":"Get an invite."
        },
        "154213":{
            "author_id":"teraton_arm",
            "author_name":"Teraton",
            "choices":[
                "Calling over a coworker. \"Please wait here, ma'am.\"",
                "Handing it back. \"Sorry for the delay, looking forward to your performance.\"",
                "Letting her pass, though he seems suspicious of her."
            ],
            "content":"<div class=\"\"><div> <span>As she approached one of the security members checking invitations, Kim was smiling warmly, though making sure to avoid looking anyone in the eyes for too long, taking precautions to make sure as few people as possible could remember her face. She approached the officer, and extended her hand to present him with the invitation. She continued to walk forward, with her hand poised to have the invitation returned, like she had watched happen with everyone before her, but instead she was halted, the security officer moving into her path. She started feeling a twinge of anxiety as he continued to scan it intently.<br>\r\n<br>\r\n\"...Is everything in order?\" She spoke up after a moment, and quickly remembered to give a warm though growing colder smile.<br>\r\n<br>\r\nThe guard glanced up from the invitation for a moment, looking her up and down as intently as he had been looking at the paper. \"Ms... Prima?\"<br>\r\n<br>\r\n\"Yes?\" <br>\r\n<br>\r\nThe security man have her one more glance over before folding up her invitation and...</span></div></div>",
            "created":1425013200,
            "id":1940981,
            "title":"There's something wrong with her invitation."
        },
        "1542132":{
            "choices":[
                "\"Ms. Sinclaire wants to see you before the show starts.\"",
                "\"I'm supposed to show you to your dressing room.\"",
                "\"I'm going to be showing you around the stage.\""
            ],
            "content":"<div class=\"\"><div> <span>Kim smiled at the security guard as he handed back the invite, though inwardly she was panicking. <i>Who the hell was Ms. Prima?!</i><br>\r\n<br>\r\nShe began walking up the gangplank, her face betraying none of the panicked thoughts running through her mind. Obviously an event like this would have some kind of entertainment, but what was she expected to do? Clearly this \"Prima\" woman wasn't immediately recognizable, else the guard would've detained her, yet she had no idea what kind of performance she was supposed to put on. <br>\r\n<br>\r\nA brief grimace crossed Kim's face as she thought of the possibilities; she might be able to fake her way through as a dancer or musician, but she was a terrible singer and would give herself away immediately. She paled as the possibility that Prima was a stripper entered her mind. Hopefully the party was a little too fancy for that kind of thing.<br>\r\n<br>\r\nAlthough, this did have potential. A famous performer could probably get quite close to Ms. Sinclaire without arousing too much suspicion.<br>\r\n<br>\r\nThe disguised hitman brought up a smile as she walked onto the deck of the ship, only to immediately be approached by a young blonde woman in a royal blue bikini, a little name-tag on the right breast of the suit identifying her as an employee. <br>\r\n<br>\r\n\"Excuse me,\" she spoke up, looking at the clipboard in her hands, \"Are you Ms. Adeline Prima?\"<br>\r\n<br>\r\n\"Well, that's the name on my invitation,\" Kim responded, grinning at the little inside-joke and getting a giggle from the girl.<br>\r\n<br>\r\n\"Ha-hah! Oh, um, right, could you come with me please?...\"</span></div></div>",
            "created":1425358800,
            "id":1943001,
            "title":"Handing it back. \"Sorry for the delay, look..."
        },
        "15421321":{
            "author_id":"teraton_arm",
            "author_name":"Teraton",
            "choices":[
                "Stayed the course, and let herself get brought to her target.",
                "Waited until they were in a crowded hallway, and tried to slip away.",
                "Waited until they were alone, and tried to subdue her... but she fought back?!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh.\"<br>\r\n<br>\r\nOh.<br>\r\n<br>\r\n\"Of course, that sounds perfect.\"<br>\r\n<br>\r\nThis wasn't good.<br>\r\n<br>\r\nOn one hand, she did want to get close to Sinclaire, and that's exactly what was happening. A chance to talk to the woman, try and find something out straight from her target; that could be valuable. On the other hand.... Sinclaire was likely to be well guarded, maybe not expecting her performer to be a snake, but chances are her security would be tightest around the woman herself. If she didn't recognize Kim as an imposter- which she might, since Ms. Prima was apparently important enough to warrant a face-to-face introduction with the cruise's host- then the chance of a bodyguard or security head recognizer her was way higher than Kim might be comfortable with.<br>\r\n<br>\r\nThe employee in front of her didn't seem to notice Kim's trepidation though, especially since Kim was trained enough to keep that sort of thing from showing at a glance. With her back turned, only glancing over every so often, it'd be easy to subdue her, or slink away... but both of those would be suspicious enough in their own right. She might be walking straight into the lion's den if she kept on the way she was going, but the risk could pay off... but in her line of work, Kim wasn't so keen on taking risks.<br>\r\n<br>\r\nAs labyrinthine as the ship could be, Kim knew she was running out of time to decide. In the end, the assassin...</span></div></div>",
            "created":1428555600,
            "id":1961282,
            "title":"\"Ms. Sinclaire wants to see you before the ..."
        },
        "154213213":{
            "choices":[
                "\"I'm one of Sinclaire's bodyguards. And I'm guessing you're not Ms. Prima.\"",
                "\"Just your average hired killer. Wanna guess who I'm here for?\"",
                "\"I'm...\" (Other Choice)"
            ],
            "content":"<div class=\"\"><div> <span>It didn't take long for her to come to a decision. She couldn't risk exposure this soon, so the girl needed to be out of the picture. Kim casually scanned the hall as they walked through the yacht, keeping her eyes open for an unoccupied room. The assassin kept a smile plastered on her face, waiting for the right moment.<br>\r\n<br>\r\nSaid moment came soon enough as they approached a door marked \"Guest Room 7\". The hall was clear, the door had been left open, and she could easily see no one was inside. In the split second she was right next to the doorway, Kim lunged forward, wrapping one arm around the surprised employee's throat and clamping her other hand over the girl's nose and mouth. She quickly pulled the bikini-clad blonde into the room, turning around and shoving the door closed with her back.<br>\r\n<br>\r\nHer mind quickly noted the sparse arrangements--<i>a single bed and closet, ceiling lamp, nothing that could be used as a weapon</i>--before turning her attention back to the girl in her arms, who was curiously limp. Did she really go unconscious already? She could feel shallow breath on her palm, so she hadn't inadvertently killed the blonde.<br>\r\n<br>\r\nCarefully, Kim began to lower the unconscious(?) girl to the floor, only to gasp in shock and pain as an elbow was shoved into her stomach. She immediately tried to clamp down on the pain and keep ahold of the woman, but she twisted out of Kim's grip.<br>\r\n<br>\r\nThe blonde grinned and reached behind herself, pulling a collapsable baton on the increasingly bewildered assassin.<br>\r\n<br>\r\n\"What the hell?\" Kim stared in confusion at the smirking blonde. \"You're not a normal employee. Who are you?\"<br>\r\n<br>\r\nThe blonde chuckled darkly before responding...</span></div></div>",
            "created":1429419600,
            "id":1966361,
            "title":"Waited until they were alone, and tried to subd..."
        },
        "1542132132":{
            "choices":[
                "\"Yeah, right. Either strip willingly or I force you.\" (She doesn't believe her)",
                "\"Wait, seriously? You're not Prima?\" (She believes her)",
                "Something else interrupts."
            ],
            "content":"<div class=\"\"><div> <span>Oh. Well this was unexpected. \"Seriously? You're a hitman?\"<br>\r\n<br>\r\n\"Personally prefer assassin, but yeah, I'm a hitman,\" the woman responded, still smirking playfully, \"Feel free to call me Sierra. And you still haven't guessed yet.\"<br>\r\n<br>\r\n\"I'd think it's obvious. I'm your target.\" While she was quite aware of the various dangers prominent in the profession of hitman for hire, Kim honestly hadn't expected to be attacked on a job by another assassin. This job just kept getting weirder. Not as bad as the Chinatown job, but still.<br>\r\n<br>\r\n\"You got it. Heh, y'know, most people tend to freak out at this point, but you're pretty calm. Then again, you did attack me first. You usually assault the staff, or was I just that obvious?\"<br>\r\n<br>\r\n\"No, you were doing a good job,\" Kim replied, trying to find a way out of the situation. The only thing in the room that could be used as a weapon, the baton, was currently held by the very person trying to kill her. Kim wasn't about to try attacking a hired killer without a plan, no matter laid-back the girl seemed to be. \"I just really didn't want to see Sinclaire without a plan.\"<br>\r\n<br>\r\n\"Heh, I can understand that. Guess even performers get stage fright.\" Hold on, what? \"Not to worry though. I hear letting the audience see you naked builds confidence. Or was that imagining the audience naked? I dunno, I can never keep track.\"<br>\r\n<br>\r\n\"Excuse me?\"<br>\r\n<br>\r\n\"Ah, right. Don't worry your pretty head Prima Donna,\" Sierra said jokingly, \"I'm not here to kill you. My contractor only wants you humiliated. I <i>was</i> planning on leading you further down into the ship, knocking you out and bringing you in a box to the freezer. You would've woken up in tray with quite the headache, tied down and naked aside from a few strategically placed bits of whipped cream, some syrups, and maybe a bit of ice cream. Oh well. You being conscious just opens up some more opportunities.\" <br>\r\n<br>\r\nShe grinned again at Kim, who had gradually stopped listening to the other assassin as the full implications of her speech sunk in. Sierra still thought she was Prima. Huh. That was an odd sort of relief, as it meant no one was actually trying to kill her. <br>\r\n<br>\r\nOn the other hand, Sierra thought Kim was her target. Specifically, a target she was supposed to humiliate. Though it was weird that a completely different assassin would be hired to do a similar contract to her in the exact same location. She briefly wondered if their employers were the same person before Sierra interrupted her train of thought.<br>\r\n<br>\r\n\"Hey, are you listening?\" the blonde asked. \"Because now I'm giving you a choice. Either you walk out that door with me, but without a stitch of clothing on you, or I knock you out and go back to plan A. So which is it?\"<br>\r\n<br>\r\n\"Neither. I'm not your target.\" \"...eh?\"<br>\r\n<br>\r\n\"I'm not Adeline Prima. I'm also a hitman hired to humiliate someone. My target is Sinclaire. I stole the outfit and invitation from Prima in order to sneak in. I have no idea who she is, and I honestly didn't expect anyone to have a contract on her, but I'm pretty sure she's either still in the bathroom I left her knocked out in, or she's walking around naked, trying to find cover. Either way, you and I have nothing to with each other.\"<br>\r\n<br>\r\nKim waited for the other assassin's response. Sierra frowned before responding...</span></div></div>",
            "created":1429419600,
            "id":1966369,
            "title":"\"Just your average hired killer. Wanna gues..."
        },
        "15421321322":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "Sierra agrees to Kim's offer.",
                "Sierra declines. She wants Kim humiliated for costing her the job.",
                "Kim sees an opening and tackles Sierra."
            ],
            "content":"<div class=\"\"><div> <span>\"Dead serious. The woman you're looking for is white.\" Kim responded. \"Also naked, back on land, and in for a very bad day. You know, in a way, I did your job for you.\"<br>\r\n<br>\r\n\"I guess you did, huh?\" Sierra mused. \"Of course, my contract was to humiliate her at this little party, which I can't exactly do now. I'm probably not getting paid now.\"<br>\r\n<br>\r\nThat put a twinge of worry back in Kim's stomach. There wasn't much more a person could do to earn an assassin's ire than screwing them out of their fee. Kim had dealt with more than a few unwanted interlopers in her time, and there was little doubt Sierra had as well. Kim needed to think of a way to diffuse the situation before Sierra decided to get vengeful.<br>\r\n<br>\r\n\"Okay, well, listen...\" Kim began. \"Sorry about messing up your contract, but hear me out. I'm getting paid above my normal fee for this Sinclaire thing. How about you help me out and I'll give you half the take? It's good money.\"<br>\r\n<br>\r\nSierra tapped her chin in thought, and Kim watched her carefully. Sierra was still armed, and if things looked like they were going to go south, Kim would need an opening to have a chance at subduing her. Hopefully Sierra would agree to the offer and things would be solved easily, but the possibility was still far from guaranteed.</span></div></div>",
            "created":1430802000,
            "id":1974091,
            "title":"\"Wait, seriously? You're not Prima?\"..."
        },
        "154213213221":{
            "author_id":"teraton_arm",
            "author_name":"Teraton",
            "choices":[
                "\"...waiting in her private suite.\"",
                "\"...over-seeing preparations for your performance in the ballroom.\"",
                "\"...entertaining a few guests in the currently closed-off swimming area.\""
            ],
            "content":"<div class=\"\"><div> <span>Kim watched nervously as Sierra seemed to mull the offer over. Eventually, the competing assassin sighed, collapsing her baton.<br>\r\n<br>\r\n\"Alright,\" she said, still eyeing Kim cautiously, \"I can't say I'm happy being screwed out of a simple job, but that doesn't mean I don't still need the money.\"<br>\r\n<br>\r\nInwardly, Kim sighed as well. It wasn't a steady alliance, nor did she entirely trust the other woman, but at least she could count on the promise of a paycheck to keep her safe for a little while longer, at least. She watched Sierra tuck the baton back behind her, keeping note of where her reluctant ally was keeping a weapon, while trying to keep herself from wondering how exactly it was tucked away well enough to hide in the woman's bikini.<br>\r\n<br>\r\n\"So,\" Sierra said, breaking the silence, \"you're here after Sinclaire?\"<br>\r\n<br>\r\nKim nodded. \"I'm here to do to her pretty much exactly what you were going to do to me.\"<br>\r\n<br>\r\n\"Really? Down to the ice cream and everything?\"<br>\r\n<br>\r\nKim shook her head, before tilting it in thought. \"No, just the general humiliation part. But, that <i>was</i> a good plan you had going...\" Kim pressed a fist into the palm of her hand. \"The way I see it, we already have an easy way to get around the ship.\"<br>\r\n<br>\r\nSierra nodded her head. \"The invited guest performer Ms. Prima being escorted around the ship by a fully authorized employee.\"<br>\r\n<br>\r\n\"Right! I figure that, like this, the two of us should be able to get just about anywhere we need to go. Now, anyone who knows Prima might be able to tell that I'm not her...\"<br>\r\n<br>\r\n\"...But if I couldn't tell before hand, than maybe only whoever directly hired you would spot the difference. Maybe even only Sinclaire herself! And if we're close enough for her to call us on it...\"<br>\r\n<br>\r\n\"Then we're close enough to pull the job off anyway.\" Kim looked Sierra in the eyes as she finished the mutual train of thought. Complete trust wasn't something they were going to get from each other, but at least from Kim's side, she felt like she could depend on the other woman's skills to get the job done and get them both a pretty penny. She extended a hand. \"Are we good?\"<br>\r\n<br>\r\nThere was a distinct moment of hesitation before Sierra returned the gesture with a nod and a smirk. \"Alright,\" she said, \"let's do this.\"<br>\r\n<br>\r\nThe two of them crept back over to the door. Sierra took a glance out into the empty corridor, and motioned for Kim to follow her out. And so they continued on, the bikini-clad, baton-wielding blonde leading the way with a cheery smile spread across her face, and Kim following behind in her slinky green dress, primly striding along behind Sierra as befitting an entertainer.<br>\r\n<br>\r\n\"So,\" 'Prima' began, \"so said Ms. Sinclaire wanted to see me, right?\" It might have been redundant, but it was good to stay in character now that they might be overheard. \"Where exactly is she waiting for me?\"<br>\r\n<br>\r\nSierra looked over her shoulder, her false smile still plastered to her face, but now with a new, dark look in her eyes that Kim hadn't noticed before. \"Ms. Sinclair is...\"</span></div></div>",
            "created":1439787600,
            "id":2022147,
            "title":"Sierra agrees to Kim's offer."
        },
        "154213213222":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "In the Hallway",
                "By the Stage",
                "In the Restroom"
            ],
            "content":"<div class=\"\"><div> <span>Sierra focused on Kim.  \"If this we're a regular contract, I might take the apology and money... maybe a toe or pinkie too for the trouble.  But since this was a humiliation job, I'll take a different tactic.\"<br>\r\n<br>\r\nKim moved quickly to jump Sierra before she could carry out whatever that tactic was.  Sierra was ready and deftly dodged.  Kim stumbled forward, almost landing on the bed as Sierra spun around to press her advantage.<br>\r\n<br>\r\nKim stabilized herself in time to avoid Sierra's swing of the baton,  Kim then rolled over the bed to put it between her and her bikini-clad blonde attacker as she tried to think.  No weapons to be improvised and only one exit, covered by Sierra.<br>\r\n<br>\r\nSierra throw the top blanket at Kim swiftly.  Kim pushed it down, but Sierra used the brief obstruction as the necessary opening.  Kim arms moved to block the swing, but she knew it was too late.  She heard a dull clang and then nothing.<br>\r\n<br>\r\nSierra eagerly undressed her fellow assassin after setting her on the bed.  \"Wow.  I should be stripping you naked on this bed for different reasons.  You're fortunate I'm only a semi-pervert.\"<br>\r\n<br>\r\nSierra tossed Kim's clothes in the closet and turned her attention back to the beautiful, naked Asian-American lady on the bed.  She took off the pillowcases and made makeshift handcuffs and shackles.<br>\r\n<br>\r\nSierra lightly ran her hands over Kim's body as she mused about her next move.  While tracing her small, dark nipples, Sierra thought about simply leaving her in the hallway.  When they graced over her tight rear, Sierra considered bringing her close to the stage where Ms. Prima would soon be expected.  As Sierra's fingers danced down her curvy legs to her dainty feet, Sierra imagined trying to bring her to the same restroom where Kim had stripped the one woman.  <br>\r\n<br>\r\nShe smirked with wickedness as she decided where to leave Kim. </span></div></div>",
            "created":1463288400,
            "id":2148273,
            "title":"Sierra declines. She wants Kim humiliated for c..."
        },
        "15422":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "The waitress's bikini.",
                "The maid's outfit.",
                "The kitchen staff uniform."
            ],
            "content":"<div class=\"\"><div> <span>Kim swam through the water, gliding under the gentle waves of the marina. The security didn't seem to be keeping too close of an eye on the water, instead focusing on the arriving guests, meaning the swim wasn't particularly dangerous or difficult. Luckily for Kim, the yacht's anchor line was on the opposite side of the ship from the shore, allowing her to climb up the chain without risk of being seen.<br>\r\n<br>\r\nWere Kim a more paranoid woman, she'd have thought things were going too easily, especially after she found an open window just large enough for her to squeeze through. Since it was more stealthy than climbing all the way up to the deck, Kim saw no reason not to take advantage. It was a tight fit, and Kim was quietly grateful she'd chosen to wear a one-piece suit for her aquatic approach, since such a narrow entrance would have certainly snagged on something like a bikini.<br>\r\n<br>\r\nKim quickly looked around, taking in her surroundings. The assassin's luck just seemed to get better and better! The room Kim had just snuck into seemed to be a locker room for the employees. Judging by the steam that hung heavy in the room, Kim was able to deduce why the window had been opened in the first place. Surely whatever employees were showering wouldn't mind if Kim... \"borrowed\" a uniform.<br>\r\n<br>\r\nLooking around, Kim found three different types of outfit. It seemed Ms. Sinclaire had different uniforms for different jobs on her ship. Kim recognized the bikini as the uniform of the wait staff from her observation of the ship's deck. That could be useful if she wanted to get up close to Veronica without eliciting suspicion.<br>\r\n<br>\r\nThe next option was a, frankly scandalous, French maid outfit. Posing as a member of the cleaning staff would give Kim free reign to explore otherwise restricted areas of the ship without anyone questioning her. It might not be a bad idea to rifle through Veronica's personal quarters and see if there was any particularly embarrassing material to use there...<br>\r\n<br>\r\nLastly, there was what Kim could only assume was the uniform for kitchen staff. Consisting of an apron, a black skirt, and a white top, the outfit was the least outrageous of the three, though it would largely restrict Kim's movements to the kitchen area. Perhaps she could slip something into Veronica's food or drink to cause a scene? It might be difficult with other kitchen staff nearby, so Kim would have to get clever if she chose this option.<br>\r\n<br>\r\nMaking her choice, Kim slipped out of her swimsuit and into-</span></div></div>",
            "created":1424926800,
            "id":1940803,
            "title":"Disguise herself as an employee."
        },
        "155":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Teacher/Professor",
                "Principal",
                "More jobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some school-related jobs for miss Nishikawa?</span></div></span></div>",
            "created":1413522000,
            "id":1873411,
            "title":"Others"
        },
        "1551":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "High School",
                "College (professor)",
                "Misc (for sports and other extracurriculars)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What school level is she teaching?</span></div></span></div>",
            "created":1413522000,
            "id":1873413,
            "title":"Teacher/Professor"
        },
        "15511":{
            "choices":[
                "Kim offered to take off clothes for right answers and good behavior",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Kim wasn't sure why, but she had always assumed that going back to school would be different if she were a teacher instead of a student.  And in some ways it was.  She had, for example, no friends.<br>\r\n<br>\r\nOkay, that wasn't exactly fair.  People were sometimes forced to obey her, although grudgingly, and most of the boys in her classes (and many of the girls) paid rapt attention to her when she spoke, but sometimes it felt like they focused less on what she said and more on how her lips moved.<br>\r\n<br>\r\nStill, it was a job, and like any job the days blurred together, one nearly indistinguishable from another.  Until today.<br>\r\n<br>\r\nWhat happened today?</span></div></div>",
            "created":1481086800,
            "id":2246890,
            "title":"High School"
        },
        "15512":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "Pants had split in the back, revealing a hot pink thong...",
                "Pants were see through, and she wasn't wearing any underwear..."
            ],
            "content":"<div class=\"\"><div> <span>Kim was wearing one of her favorite outfits today; a one-piece white pantsuit that hugged her figure enticingly but still managed to make her look professional. She smiled and then glared at her students behind her glasses. Her eyesight was actually 20/20 but she only wore them because it made her feel more professional and older than her young age. Most of these students were seniors and juniors, and the age gap between them wasn't exactly a lot. The other professors at the college sometimes treated her almost like she was still a student, despite her womanly looks and pedigree. So, she wore glasses and always was strict with her classes. She felt like she had to or they might take advantage. <br>\r\n\"All right class, pop quiz,\" Kim said with a smirk.<br>\r\n\"It's the second day of class!\" someone in the back scoffed.<br>\r\n\"Well, let's hope you all manage to get off to a good start this semester then,\" she said sarcastically as she started passing out the quiz. As she made her way back to her desk she heard several snickers. Kim had no idea what they found so funny, and she spun around to face the class angrily. \"Keep quiet! If I hear another peep you all will get an F!\"<br>\r\n\"She doesn't know,\" a student whispered.<br>\r\nKim heard the whisper and felt her heart drop. \"Doesn't know what,\" she thought. The room did feel a bit drafty, little did she know that her... <br>\r\n</span></div></div>",
            "created":1432875600,
            "id":1984970,
            "title":"College (professor)"
        },
        "155122":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "Willie meets her after class...",
                "Kim is asked to sub for another class immediately after hers..."
            ],
            "content":"<div class=\"\"><div> <span>Kim didn't yet realize, but that morning she had been in a rush and forgot to wear any panties. After putting her lacy white bra on, she had gotten a call from a friend and had completely forgotten the bottom half. Now she was paying the price. While her white pantsuit wasn't transparent, the curvature of her butt and the crack were somewhat noticeable. <br>\r\n<br>\r\nNoticeable enough that everyone in the class was now staring, but now at her front. She had been standing behind the desk before, but now out in the open the class was treated to a magnificent view of quite the camel toe. Poor Kim still hadn't realized just how exposed she was until Willie, the classic stoner and class clown decided to point out the obvious.<br>\r\n<br>\r\n\"Ms. N, we can see like... a lot.\" Willie started cracking up and the rest of the class burst out even louder with laughter.<br>\r\n<br>\r\nKim was about to put her students in place when she glanced down. To say she blushed would be an understatement, this was her nightmare. She threw both hands over her pussy and backed behind her desk, nearly falling over in the process.<br>\r\n<br>\r\n\"Just... just take your quiz!\" she stuttered. Any air of confidence and power had evaporated; this was going to be a long semester.</span></div></div>",
            "created":1432875600,
            "id":1985001,
            "title":"Pants were see through, and she wasn't wear..."
        },
        "1551222":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "Todd tries to dry her off, tearing her pantsuit in the process...",
                "Kim is offered a change of poor fitting clothes from one of the girls..."
            ],
            "content":"<div class=\"\"><div> <span>The rest of the class went by painfully slow, and Kim didn't get up from her desk until every last one of her snickering students walked out the door. She didn't know how she was supposed to be in control when they had practically seen her ass and pussy. How could she be such a ditz! She nearly jumped out of her seat when her phone vibrated. She needed to calm down, it was still only morning.<br>\r\n<br>\r\nChecking her phone she sighed. She had almost forgotten that she had promised to cover for one of her co-workers, who also happened to be head of the running club. She was supposed to be over at the park meeting them in just 10 minutes. Quickly getting up, Kim tried to ignore her exposed lower half and focus on retaining whatever dignity remained. She wished she had time to change but she'd have to make due.<br>\r\n<br>\r\nArriving a few minutes later into the university's park, Kim waved at a group of about 10 students all dressed in running shorts and sportswear. She looked like a fool in this expensive pantsuit, but what could she do? She just hoped they wouldn't notice her pantie-less state; hopefully if she kept her hands covering the area as casually as possible they wouldn't say anything.<br>\r\n<br>\r\n\"Hello, you must be Kim,\" a strapping young man said with his arm outstretched. \"I'm Todd.\"<br>\r\n<br>\r\nKim shook his hand weekly while keeping her other hand pressed in front of her groin. She noticed that all the students were looking at her odd, but they hadn't noticed her lack of panties yet... at least that's what it looked like.<br>\r\n<br>\r\n\"Nice outfit. I guess you wont be running with us?\" Todd said.<br>\r\n<br>\r\n\"No, sorry. I'm just supervising.\" <br>\r\n<br>\r\nTodd smiled at her warmly before walking away to a large cooler of water. \"Would you like some water?\"<br>\r\n<br>\r\n\"Sure, why not?\" Kim was feeling a bit parched, and it didn't hurt that this Todd fellow was so good looking. She hoped he was a grad student. Kim slowly made her way over to the cooler, aware that half the runners could see her crack now. She tried to ignore the thought. Unfortunately for Kim, she was still wearing her heels from class, and well... heels and grass don't exactly go together well.<br>\r\n<br>\r\nKim fell headfirst into the cooler and water poured out all over her, covering her from head to toe. If her outfit hadn't been transparent enough before, now it might as well not be there. Her pantsuit clung to her like it wasn't even there, her pussy lips and ass revealed tantalizingly. Even her nipples made an appearance through her white soaked bra, hard and prominent. <br>\r\n<br>\r\nKim screamed and tried to cover up as everyone pointed and laughed, just like her first class all over again. How could this get any worse?  </span></div></div>",
            "created":1432962000,
            "id":1985074,
            "title":"Kim is asked to sub for another class immediate..."
        },
        "15512222":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "The students expect her to run with them now, since she's dressed for it.",
                "The club meeting passes without incident, leaving Kim's guard down...",
                "Kim is summoned to a faculty meeting."
            ],
            "content":"<div class=\"\"><div> <span>While plenty of people were laughing, one girl jogged up to the soaking professor with a look of concern on her face.<br>\r\n<br>\r\n\"Oh my god, professor, I'm so sorry for you!\" the girl exclaimed, \"Hold on, I've got a spare set of running clothes you can change into. Just hide in those bushes over there and I'll be right back!\"<br>\r\n<br>\r\nThe girl ran off without waiting for a response, leaving Kim with little else to do than follow her advice. There was a small cluster of bushes not far from where she was standing, and they'd offer a level of concealment if she crouched down within them. With her cheeks burning with shame, Kim hurried into the bushes and knelt down, mentally scolding herself for being so forgetful. If she'd remembered to at least wear underwear this wouldn't have been so embarrassing!<br>\r\n<br>\r\nThe girl came back a few minutes later, passing Kim a small bundle of clothes. Inspecting them, Kim found herself holding a pair of loose shorts and a small tank top. It wasn't much, but it would be dry and, more importantly, opaque. Carefully, making sure not to stand up too much or lose her balance, Kim undressed within the bushes, heart racing as she considered what she was doing.<br>\r\n<br>\r\nHere she was, a member of the university faculty, taking her clothes off in the middle of campus. Such behavior should have been unthinkable, and certainly reflected poorly on Kim's reputation. Thankfully there were plenty of people who could testify to the fact that she wasn't doing so willingly. If she was lucky, this would just wind up being a rumor that would die in a few weeks. Finally dressed, Kim stepped out from the bushes, her soaked suit and bra dangling from one hand while the other kept a firm grip on the loose waistband of her borrowed shorts.<br>\r\n<br>\r\n\"I'll get those dried for you!\" the helpful girl declared, snatching the clothing from Kim's hand before dashing off once again, but not before giving a knowing wink to another one of the runners.<br>\r\n<br>\r\nNow dressed (somewhat) properly, Kim tried to refocus on supervising the runners.</span></div></div>",
            "created":1433221200,
            "id":1986818,
            "title":"Kim is offered a change of poor fitting clothes..."
        },
        "15513":{
            "author_id":"okayterrific",
            "author_name":"okayterrific",
            "choices":[
                "she saw that her clothes and towel were gone",
                "the team was waiting and blocking her from her clothed and towel"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nKim was putting the girls’ basketball team through another rough practice as she wiped her brow.  The gym was unbelievably hot due to the fact that the air conditioning had broken down in the middle of the day and hadn’t been repaired yet.  She thought about calling off the practice but after the team’s latest loss she wanted to prove a point.<br>\r\n<br>\r\nShe had been coaching for East Netwon-Fairbanks for the last several seasons.  The school had a long and storied tradition of excellence in girls’ basketball going back to the 1970’s.  Kim herself had played at the school and was part of four state championship teams.  She inherited a talented team that had won a championship the year prior to her replacing the legendary Coach Gina, but six seasons into her tenure she was still looking for her first championship as a coach. <br>\r\n<br>\r\nHer current team was an absolute mess and having never dealt with defeat or failure her response was to work the girls even harder.  The practices became more demanding and longer and the players began to resent Kim for it.  Little did Kim know that today was the breaking point for them.<br>\r\n<br>\r\nAs she watched the latest round of practice and ran her hands through her long black hair and readjusted her high ponytail.  After another botched play she buried her face in her hands and then blew her whistle.<br>\r\n<br>\r\n“I’ve seen enough,” she said with exasperation.  “Get out of here and hit the showers.”<br>\r\n<br>\r\nKim following the girls into the locker room and she went into her office which was adjoining and shut the door behind her.<br>\r\n<br>\r\n“These girls are going to drive me to drink,” she muttered to herself after sitting down behind her desk. <br>\r\n<br>\r\nShe put her feet up on her desk and closed her eyes to rest while listening to the girls filter out after their showers.  Once she felt like the coast was clear she left her office and entered the locker room.<br>\r\n<br>\r\n“Hello?” she asked aloud.<br>\r\n<br>\r\nWhen no response came she was satisfied that she was alone and she began to undress.  Despite being a knockout Kim was very shy about her body and the thought of being naked in front of someone made her blush.  Despite playing basketball at the school for four years she always went home after a game to shower and had never once showered with the team. <br>\r\n<br>\r\nAfter stripping down she left her clothes and a towel on the bench where she had just undressed.  Even though she was alone she reflexively crossed her arms over her breasts while walking into the showers.  She often showered at the school after the girls had left because she hated driving home sweaty.  She didn’t realize that the team knew about this after one of the girls forgot something in the locker and saw Kim showering.  After telling the team about what she saw the team immediately knew how they were going to get Coach Kim for killing them in practices.<br>\r\n<br>\r\nNow finishing her shower Kim turned off the water and walked back into the locker room where….<br>\r\n</span></div></div>",
            "created":1418101200,
            "id":1900007,
            "title":"Misc (for sports and other extracurriculars)"
        },
        "155131":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "Kim gets too close to an exit door, and is pushed out by an unseen assailant.",
                "Kim finds a locker ajar, with a \"gift\" for her.",
                "Kim finds a note taped to her locked office door."
            ],
            "content":"<div class=\"\"><div> <span>Kim's heart skipped a beat when she saw the bench where she'd left her clothes and towel empty. She knew right where she'd left her things, and she could see from where she was standing that they hadn't simply slid off the smooth wood of the bench. Unless her things had grown legs and wandered off while she showered, somebody had stolen Kim's clothes and towel!<br>\r\n<br>\r\n\"Who would do this? Nobody even knows I-\" Kim began, trailing off as she realized the only possible culprits. \"Oh... if those girls thought practice was bad before, they've got another thing coming after this!\"<br>\r\n<br>\r\nThat was assuming Kim didn't kick the girls responsible off the team. Doing something so disrespectful and juvenile to their own coach was inexcusable! Sure, Kim had been pushing them hard in practice, but it was because she wanted them to succeed! It wasn't her fault if those ungrateful kids couldn't see that.<br>\r\n<br>\r\n\"Okay, girls. Very funny. Now come out and give me my stuff.\" Kim said loudly to the empty locker room. Several moments passed in silence, the only sound being the steady drip of shower water falling from Kim's naked body. The distressed woman had hoped the girls responsible would step forward now that their little prank was over, but that didn't seem to be the case.<br>\r\n<br>\r\n<i>They probably hid them somewhere. Wanna get a laugh of me looking around naked.</i> Kim thought to herself. Unfortunately, she couldn't see any other option than to play their little game for now.<br>\r\n<br>\r\nCarefully, with more than a little hesitation, Kim tiptoed to the end of the row of lockers, looking left and right while hiding as much of herself as possible. When she was sure the coast was clear, Kim stepped out and into the main walkway of the locker room. With one arm across her breasts and the other angled down so her hand could cover her crotch, Kim slowly progressed down the aisles of lockers, checking each one for any sign of her lost belongings.<br>\r\n<br>\r\nUnfortunately for the coach, this was precisely what the girls wanted her to do. Without knowing, Kim was setting herself up for phase two of their payback plan...</span></div></div>",
            "created":1418187600,
            "id":1900553,
            "title":"she saw that her clothes and towel were gone"
        },
        "1551311":{
            "author_id":"okayterrific",
            "author_name":"okayterrific",
            "choices":[
                "Bang on the door and demand to be let back in",
                "Try to find someplace to hide"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nKim had made her way up and down all but one of the rows of lockers and she was now getting very nervous.  She had yet to find her clothes or even a towel.  She stood in a classic ENF pose at the beginning of the last row of lockers and let out a deep sigh.<br>\r\n<br>\r\n“They better be in one of these lockers,” she said aloud trying to reassure herself that she would find at least the  towel inside one of them.<br>\r\n<br>\r\nShe then began the same process that she had with the other rows of lockers: checking each locker and alternating sides as she made her way towards the end of the row.  She absolutely hated having to move just one of her hands to open a locker because it meant giving up what little she could do to cover herself even though it was only for a few seconds.  Despite being alone the fact that she was naked greatly embarrassed her especially knowing that her current predicament was caused by someone else.<br>\r\n<br>\r\nKim was now at the end of the row next to the exit door and had only two more lockers left to check.  She checked the locker on her left….nothing.  She then turned her attention to the locker to her right.<br>\r\n<br>\r\n<i>They have to be in here</i>, she thought to herself.<br>\r\n<br>\r\nJust as she was about to open the locker she heard footsteps running up from behind her and before she even realized what was going on she found herself being pushed out of the exit door.  Partially because she was caught by surprise and partially because of how forcefully she was pushed out, Kim landed hard on her bare ass in the parking lot.  She stood up to wipe the tiny pieces of gravel and rock off of her thighs and ass when it suddenly hit her, she was naked outside!<br>\r\n<br>\r\nShe immediately clasped an arm over her breasts and put her other hand between her legs to cover her pussy.  She couldn’t believe that the girls would do this to her!  Did they somehow know about her fear of public nudity or was this just a coincidence?  What was she going to do!?!<br>\r\n</span></div></div>",
            "created":1418878800,
            "id":1904379,
            "title":"Kim gets too close to an exit door, and is push..."
        },
        "15513111":{
            "author_id":"phantompen",
            "author_name":"Phantom Pen",
            "choices":[
                "The door opens a crack, and an \"outfit\" is tossed out.",
                "The door opens and a camera flashes before Kim can react.",
                "Kim's pounding and shouting attracted attention from outside."
            ],
            "content":"<div class=\"\"><div> <span>Kim quickly closed the distance between her and the exit door. The door had no handle on the outside of the building for obvious security reasons, meaning Kim was going to need someone on the other side to open it up and let her in. Looking around to make sure she was alone, the naked coach reluctantly moved the arm covering her breasts and used it to frantically pound on the metal door.<br>\r\n<br>\r\n\"Girls! Let me back in this instant!\" Kim demanded, mustering up as much authority as her nerves would allow. \"You've had your little laugh, now open this door! Just... let me in and we can forget this ever happened.\"<br>\r\n<br>\r\nKim's heart was racing, and her resolve was fading fast. Desperate to get back inside and safe from potential prying eyes, the alluring woman was already willing to bargain with her players for entry. It wasn't right to let her professional facade crack like this, but fear and desperation were powerful forces at play.<br>\r\n<br>\r\nKim was beginning to contemplate making some kind of offer when-</span></div></div>",
            "created":1419138000,
            "id":1905639,
            "title":"Bang on the door and demand to be let back in"
        },
        "155131113":{
            "author_id":"okayterrific",
            "author_name":"okayterrific",
            "choices":[
                "It's the girls that locked her out",
                "It's a faculty member or another student"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nKim had never felt so desperate in her life.  Her greatest fear, public nudity, had now come true at the hands of at least a few of the girls that she coached on the basketball team.  Kim stood in front of the door to the locker room with nothing but her arms and hands to cover herself with praying that the girls had gotten their fun in, and that they would soon open the door for her. <br>\r\n<br>\r\nShe shifted her weight nervously on each foot as each second she spent waiting for the door to open was agonizing.  It didn’t take long for her to start banging on the door again.<br>\r\n<br>\r\n“Let me in right now!” Kim shouted while still trying to maintain her authority.<br>\r\n<br>\r\nAs she was once again greeted by silence her authoritative facade began to crack as she began to get more desperate, “Please, I’m begging you, before someone sees me!  No more practice for a week!”<br>\r\n<br>\r\nShe stood in front of the door in a classic ENF pose hoping that they would let her in.  It had been only a few minutes that she had been outside naked, but her fear and desperation made it feel like time had been grinded down to a halt.  The few minutes had already seemed like so much more to her. <br>\r\n<br>\r\nAs her heart and mind both raced she nearly jumped out of her skin when she heard a familiar voice ask, “What are you doing out here naked?”<br>\r\n</span></div></div>",
            "created":1420779600,
            "id":1915633,
            "title":"Kim's pounding and shouting attracted atten..."
        },
        "1552":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Middle School/Junior High",
                "High School",
                "Private School (if you want an all-girls/all-boys school)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What school level is she in charge of? Keep in mind, she can run afoul of parents and staff alike, but she may also incur the wrath of students.</span></div></span></div>",
            "created":1413522000,
            "id":1873414,
            "title":"Principal"
        },
        "1553":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "Prima Ballerina",
                "Popular actress/comedian",
                "More jobs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps she's more of an entertainer?</span></div></span></div>",
            "created":1413522000,
            "id":1873412,
            "title":"More jobs"
        },
        "15532":{
            "choices":[
                "Actress",
                "Comedian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one ?</span></div></span></div>",
            "created":1466312400,
            "id":2166747,
            "title":"Popular actress/comedian"
        },
        "155321":{
            "choices":[
                "Sci fi",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What movir genre is Kim starring in ?</span></div></span></div>",
            "created":1466312400,
            "id":2166750,
            "title":"Actress"
        },
        "1553211":{
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim is playing a heroic space pirate.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1466312400,
            "id":2166759,
            "title":"Sci fi"
        },
        "15532112":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim is playing a captain of a space battle ship.</span></div></span></div>",
            "created":1466312400,
            "id":2166760,
            "title":"No"
        },
        "1553212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a western ?</span></div></span></div>",
            "created":1466312400,
            "id":2166752,
            "title":"Other"
        },
        "15532121":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim is playing a bounty hunter ?</span></div></span></div>",
            "created":1466312400,
            "id":2166761,
            "title":"Yes"
        },
        "15532122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Horror film ?</span></div></span></div>",
            "created":1466312400,
            "id":2166753,
            "title":"No"
        },
        "155321221":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim playing a sorority pledge. Who part of the Hazing must spend the night in a haunted building with five other pledges.</span></div></span></div>",
            "created":1466312400,
            "id":2166765,
            "title":"Yes"
        },
        "1553212212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>About a post apocalyptic zombie film ?</span></div></span></div>",
            "created":1466312400,
            "id":2166769,
            "title":"No"
        },
        "15532122122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim is playing a vampire hunter. She is tracking the vampire that slaughter her family.</span></div></span></div>",
            "created":1466312400,
            "id":2166771,
            "title":"No"
        },
        "155321222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a spy thriller ?</span></div></span></div>",
            "created":1466312400,
            "id":2166754,
            "title":"No"
        },
        "1553212222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Jidaigeki film ?</span></div></span></div>",
            "created":1466312400,
            "id":2166756,
            "title":"No"
        },
        "15532122221":{
            "choices":[
                "Samurai",
                "Ninja"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Kim play a samurai or a ninja ?</span></div></span></div>",
            "created":1466312400,
            "id":2166772,
            "title":"Yes"
        },
        "15532122222":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How a action/adventure film ?</span></div></span></div>",
            "created":1466312400,
            "id":2166758,
            "title":"No"
        },
        "155321222221":{
            "choices":[
                "An archaeologist",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of character will Kim play.</span></div></span></div>",
            "created":1466312400,
            "id":2166773,
            "title":"Yes"
        },
        "1553212222212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a military special forces ?</span></div></span></div>",
            "created":1466312400,
            "id":2166775,
            "title":"No"
        },
        "15532122222122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a sword and sorcery type film ?</span></div></span></div>",
            "created":1466312400,
            "id":2166776,
            "title":"No"
        },
        "15533":{
            "author_id":"imphic",
            "author_name":"imphic",
            "choices":[
                "Pilot",
                "Translator",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kim could be on the rise as a flight attendant who's just become a pilot. <br>\r\n<br>\r\nOr as a skilled freelance translator about to do work for two hostile organizations.</span></div></span></div>",
            "created":1433307600,
            "id":1987129,
            "title":"Globe trotitng"
        }
    },
    "info":{
        "author_id":"phantompen",
        "author_name":"Phantom Pen",
        "brief_description":"Kim, a normally refined professional, has a nightmare of a workday she won't soon forget.",
        "created":1411660680,
        "description":"<td align=\"left\" class=\"norm\">This story follows Kim Nishikawa, a 28-year old woman about to experience the most embarrassing day of her life. Unfortunately for her, said embarrassment befalls her whilst at work. Be it by accident, foul play, or some other events, Kim finds herself stripped completely bare and desperate to keep herself hidden, to retain both her modesty and professional dignity.<br>\r\n<br>\r\nA little description of our heroine:<br>\r\n<br>\r\nAs her last name suggests, Kim is a woman of Asian descent raised in the US. She has blemish-free fair skin, large chocolate colored eyes, a button nose, and slightly smiling lips. Her straight black hair is kept in a short bob cut that frames her face.<br>\r\n<br>\r\nKim's body is healthy enough, with a flat tummy and shapely legs and arms. Her chest is a healthy C-cup, while her backside is a firm, lightly curved little thing. Despite hiding her charms under her sharp professional attire, Kim takes care of herself and keeps herself well groomed and cleaned.</td>",
        "id":2011383,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1580407320,
        "modified":1580407320,
        "pretty_title":"Professional (Mis)Conduct"
    }
}