{
    "chapters":{
        "1":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Ancient Knowledge, slope of Madness...",
                "Ancient Knowledge, enter the Scientist...",
                "Ancient Knowledge,  enter the tech-mage...",
                "Ancient Tome, enter the caster...",
                "Ancient Tome, rise of the renegade..."
            ],
            "content":"<div class=\"\"><div> <span>The child lay alone in their bed, unaware of their future. Tears filled their eyes upon the loss of their grandparent. With a knock, the parents enter. A book in hand. The grandparent's will, had specified the child to be the inheritor of this lone item. It would be some time until the child understood the truth of this inheritance...</span></div></div>",
            "created":1315713480,
            "id":1185026,
            "title":"Unto all things an end, and a begining..."
        },
        "11":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Behold, I am Vero...",
                "Cunning Fox, Anabelle...",
                "Someone Else...",
                "Someone Else...",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><div> <span>Some time had passed since the child's great loss. Their time in school had relegated them to the status of out-caste. Taking solace in their inheritance, the child delves into the meaning of the ancient book and comes to new insight. With a smile, a plan formulates within their mind. Time would surely pass, but they would rise to surpass their peers...</span></div></div>",
            "created":1315713900,
            "id":1185030,
            "title":"Ancient Knowledge, slope of Madness..."
        },
        "111":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Vero, the second stage...",
                "The Assistant's Experiment...",
                "Conscience, Assistant gets help..."
            ],
            "content":"<div class=\"\"><div> <span>The woman lay alone upon the old medical bed. Her eyes looked upward towards the old ceiling tiles. \"How long?\" She asked herself. \"Has it been since I came here.\"<br>\r\n<br>\r\nA knock on her door disturbed her concentration. She looked up to see a slender man draped in a dark cloth wearing a disfigured mask one would expect to see on Halloween. \"It's time.\" Stated the young man as he lifted up his mask to reveal a handsome face. \"Vero will see you now.\"<br>\r\n<br>\r\n\"It's about time.\" Stated the woman. Garbed in a medical robe. \"A week of testing and preparation in this abandoned Hospital isn't my idea of fun.\"<br>\r\n<br>\r\n\"I've checked the contract, have you read it over?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"Are you aware of what Vero wants?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\nThe lone man replaced his mask, his eyes gave a look of uncertainty before leading the woman to the upper floor laboratory. After a few minutes time they arrived in a room with the ceiling having been replaced by a mechanical cover, open to the weather outside.<br>\r\n<br>\r\nVarious machines lay strewn across the room while a lone man stood in a long white science coat, wearing long rubber gloves and playing with his over-sized Tesla coils. The excess static electricity had caused his hairs to stand on end.<br>\r\n<br>\r\n\"Laugh with me.\" He commanded. His aide did so. The lone man secured his toys before turning around and jumping off his platform upon the old tile floor.<br>\r\n<br>\r\n\"Igor.\" The man commanded. \"Is everything in order?\"<br>\r\n<br>\r\n\"Yes master.\"<br>\r\n<br>\r\n\"Fair lady. Are you sure, you wish to proceed? It's a thousand dollars if you back out now.\"<br>\r\n<br>\r\n\"With a million at stake?\" Answered the woman. \"Oh, I'm more then ready.\"<br>\r\n<br>\r\n\"Igor, has she been given the shot?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\n\"Is her blood work done?\"<br>\r\n<br>\r\n\"Yes Vero.\"<br>\r\n<br>\r\n\"Stay in character Jeff.\" Vero took a moment to clear his throat. \"Now fair lady. How are your allergies?\"<br>\r\n<br>\r\n\"Surprisingly clear.\" Answered the woman, only now realizing it.<br>\r\n<br>\r\n\"I see the curious mind at work. Allow me to introduce myself. I am Vero. It's actually an acronym, but I like it. I was just generating an anti histamine field to help clear you of your allergies for this experiment. It's a modified take on frequencies to help increase...\"<br>\r\n<br>\r\nJeff gave a deliberate cough. Vero took a moment to realize he was loosing his test subject's attention.<br>\r\n<br>\r\n\"Please strip, and lay upon this table.\" Instructed Vero. Pointing out the metallic operating table.<br>\r\n<br>\r\nThe woman took a moment to comply before lying down. In moments, Vero and his assistant were strapping the woman down. Finishing quickly, Vero stood over the woman's head to gaze into her eyes.<br>\r\n<br>\r\n\"I would like to personally thank you for advancing science today. The shot, administered earlier in the week, would of flushed all foreign contaminates from your blood lines. My Tesla experiment just flushed any lingering allergens. I'm ready with the equipment. Are you?\"<br>\r\n<br>\r\n\"For the thousandth time. Yes.\" Answered the woman.<br>\r\n<br>\r\n\"Igor. Throw switches two, three, and six.\" Commanded Vero, positioning himself on the master switch.<br>\r\n<br>\r\nThe assistant took a moment to comply.<br>\r\n<br>\r\nVero activated his audio log before continuing. \"Today is a monumental day in science. For today I shall prove to the world that the use of quantum mechanics in relation to a given quantum environment, can be used to generate excess space within a limited volume. To illustrate this. I'm using the natural quantum processor of my subject, her brain, and through use of advanced quantum mechanics, transforming those quantum properties into equivalent space.\"<br>\r\n<br>\r\nThe woman gave a look of shock. \"This isn't what I signed up for!\"<br>\r\n<br>\r\n\"Did you read your contract?\" Asked Vero.<br>\r\n<br>\r\n\"I skimmed it.\"<br>\r\n<br>\r\n\"Did you sign all required lines?\"<br>\r\n<br>\r\n\"Of course I did!\"<br>\r\n<br>\r\n\"Then let the experiment commence.\" With those words, Vero threw the master switch.<br>\r\n<br>\r\nAll the equipment in the room seemed to die. The assistant was about to unleash the woman when Vero told him to stop. Power again began to surge and two separate emitters positioned themselves to either side of the woman. Vero instructed the assistant to cross over the yellow line. Realizing his mistake the Assistant complied. The emitters, shot out visible energy into the air. Creating a distorted sphere around the woman. More and more energy continued to accumulate before the woman's body was completely enveloped. In moments, a condensed beige mist appeared within the eye of the energies focus. Vero threw a couple more switches. Waited for an led light to come on before turning off the master switch. The assistant responded by turning off the switches on his end.<br>\r\n<br>\r\n\"Oh my god, you killed her!\" Screamed the assistant.<br>\r\n<br>\r\n\"I'm not dead.\" Came the woman's reply, her body, a human colored sphere atop the examining table.<br>\r\n<br>\r\n\"But how?\" Asked the Assistant.<br>\r\n<br>\r\nVero took a step forward, grabbing a long pole in hand. He reached out, gently feeling the skin of the sphere, before finding the woman's mouth. \"I do apologize my dear.\" But before the woman could ask, Vero inserted the long pole into her mouth. He kept feeding it until very little remained. \"Success.\" Stated Vero. \"Expanded space within a bound medium. Take my instructions and do a thorough investigation Igor. I need exact data to prepare our subject for phase two of my experiment.\"<br>\r\n<br>\r\n\"Whats your goal Vero?\" Asked the Assistant.<br>\r\n<br>\r\n\"Other then keeping my subject alive for the next ten years...\" Vero paused briefly when the woman attempted to protest with a pole in her mouth. \"I'm simply taking a shortcut to generate space within a given space. Imagine the possibilities. Simplifying mass transport in special units which observe only their given weight. If my calculations are correct. We could fit an entire city in a single medium and never have it weigh more then the mediums origin.\"<br>\r\n<br>\r\n\"How?\"<br>\r\n<br>\r\nVero gave a look of surprise. \"How? How?! I'm abit surprised you haven't realized. Faux-space observes the effects of reality only within itself. I will need to generate a suitable door, which is the reason for stage two. But right now, our volunteer has a separate mini universe inside of her. Which we can use. Just imagine the future possibilities. Population, bio-hazard, or nuclear waste. All safely stored within a quantum medium. We could send everything to support a successful colony to the moon, or create the ultimate prison control system. The applications are limitless.\"<br>\r\n<br>\r\n\"What happens if the sphere breaks?\"<br>\r\n<br>\r\n\"What do you mean break?\" Vero stood for a second to assess what was just asked of him. \"Do you mean a break down of the quantum forces which allow for the existence of this medium..? Then I pray you can run quickly, because the power released would be equal to the space and energy displacement within the medium.\"<br>\r\n<br>\r\nThe assistant stood for a moment in contemplation.<br>\r\n<br>\r\n\"Now follow the instructions outlined on my memo over there and I'll be back to check up on the two of you later.\"<br>\r\n<br>\r\n\"Yes Vero.\" Came the Assistants reply.<br>\r\n<br>\r\nVero walked off to his office. Knowing he would need to ensure his preparations were truly ready...</span></div></div>",
            "created":1315719000,
            "id":1185078,
            "title":"Behold, I am Vero..."
        },
        "13":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Young Adult Ryland...",
                "Charming Victoria...",
                "Someone Else...",
                "Someone Else...",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><div> <span>The child did not have want for wealth or status. The child did not understand the differences between science and sorcery. Blessed with the understanding of both, the child wasn't a specialist of either. As time moved forward and the child aged, only their decisions could shape there destiny. The child did not have want. But all children have needs...</span></div></div>",
            "created":1315872540,
            "id":1186109,
            "title":"Ancient Knowledge,  enter the tech-mage..."
        },
        "15":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Awaken, Alan Grieves...",
                "Plot weaver Tesara...",
                "Someone Else...",
                "Someone Else...",
                "Someone Else..."
            ],
            "content":"<div class=\"\"><div> <span>The arcane officer stood behind the alter, clothed in a fine robe. \"Approach.\" He commanded. A child walked up the aisle, flanked either side by fellow arcane practitioners, their identities concealed under their robes. Reaching the alter basin. The officer instructed the child to place their hands into the basins water and be judged. The child did so. \"The strength is not present.\" Declared the officer. The child was then escorted out. It would be some time before the child understood, that none would take them as apprentice...</span></div></div>",
            "created":1315772580,
            "id":1185445,
            "title":"Ancient Tome, rise of the renegade..."
        },
        "151":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "The conversion of Agatha...",
                "The Apprentice...",
                "The next prospect..."
            ],
            "content":"<div class=\"\"><div> <span>The lone woman awaited within the house. Her slender frame and aesthetic looks identified her as above standard stock. With a knock on the front door. She lurched forward to greet her lover.<br>\r\n<br>\r\nAlan welcomed her. The tall man of average build and favorable looks smiled and gazed upon the woman's face. \"I have made the arrangements my love.\"<br>\r\n<br>\r\n\"Then lets began.\"<br>\r\n<br>\r\nAlan placed his hand lovingly on the woman's cheek. \"Please, Cheryl my love, I wish you would rethink this.\"<br>\r\n<br>\r\n\"We both failed our examination, without the power of the arcane, I cannot stave off my cancer. Even now my health falters.\"<br>\r\n<br>\r\n\"Is it not better to live with a loved one for years as yourself, then bound as an item to be used?\"<br>\r\n<br>\r\n\"Your power is strong enough to sustain you. Since we've met, you haven't aged a day. My power cannot handle my condition. This will freeze the cancers advance my love. Plus I'll be held by you.\"<br>\r\n<br>\r\n\"I promise, once I'm strong enough, I'll cure and restore you.\" Alan grabbed Cheryl in a loving embrace. \"I just wish...\"<br>\r\n<br>\r\n\"Linger no longer my love, my affairs are in order. I await only my final step.\"<br>\r\n<br>\r\nAlan resigned himself. He pulled out a sheet from his backpack. The old style paper once placed upon the table, was large and covered in arcane glyphs and designs. Alan and Cheryl sat on opposite sides. \"Once we start...\"<br>\r\n<br>\r\n\"We cannot stop.\" Cheryl completed. \"I'm aware of the risks.\"<br>\r\n<br>\r\n\"If its power you seek, then let me become your amulet.\"<br>\r\n<br>\r\nCheryl smiled, gave a slight sigh before continuing. \"It isn't power I seek my love. Neither do you. We both seek advancement, and it's only you who has the ambition and commitment to ensure this works. That said, our dreams rest with you.\"<br>\r\n<br>\r\nAlan gave a sigh. Before placing his hands upon the paper. The arcane ink began dancing in response to his presence. \"This machine is only good for one use and will require sometime to sap the energy necessary to trigger the transformation.\"<br>\r\n<br>\r\n\"Silence you fool.' Stated Cheryl with a loving face. \"Let this, our final moments we spend together, be our most memorable and cherished ones.\" Cheryl placed her hands upon her side of the arcane diagram. \"Remember my love, no matter what, I will always love you and trust you to do what's right...\"<br>\r\n<br>\r\nAlan and Cheryl would spend several hours facing each other, reflecting upon the whole of their shared history. Their conversation stopped when the changing ink visibly started glowing with a powerful light.<br>\r\n<br>\r\n\"It is at last ready.\" Stated Cheryl.<br>\r\n<br>\r\n\"Keep you hands still.\" Stated Allan. \"I'll activate the final sequence.\"<br>\r\n<br>\r\nAlan's hands danced across the diagram. In moments, the arcane ink detached itself from the paper and raced forward onto Cheryl's skin. Rings of arcane light soon possessed her form. Before her face was concealed, she spoke one last time. \"I love you.\"<br>\r\n<br>\r\nAlan broke into tears. \"I love you too.\"<br>\r\n<br>\r\nCheryl's body vanished in a pillar of light. The old paper atop the table crumbled into dust. Alan wept for a few minutes before standing up and inspecting Cheryl. He rummaged through her cloths. He began to panic when he didn't find anything. Finally lifting the clothes up to inspect their entirety. A lone, decorative bracelet fell to the floor. Alan looked at this odd piece of Jewelry. He placed Cheryl's belongings down before reaching out.<br>\r\n<br>\r\n\"I was wondering when you would come to wear me.\" Stated Cheryl in a blissful tone. \"Whatever may come, I am yours now and forever my love.\"<br>\r\n<br>\r\nAlan wiped away the last of his tears. Smiled in thanks. Before affixing Cheryl, his power band, upon his wrist. \"Whatever may come my love, I shall not forget...\"<br>\r\n<br>\r\n<br>\r\n<br>\r\nAlan awoke, his mind still remembering that day. He lay in bed next to a vibrant and naked young woman. Who like Cheryl and himself, had failed her examination.<br>\r\n<br>\r\n\"Whats wrong?\" She groggily asked. Siting up and stretching in greeting.<br>\r\n<br>\r\n\"Nothing Alex.\" Stated Alan. \"I really would wish you would reconsider.\"<br>\r\n<br>\r\n\"Unlike Cheryl here.\" Stated Alex, holding up the bracelet on her arm. \"This isn't about love, but political alliances. I mean, don't get me wrong, our time spent together has been great. But your a guy who is going somewhere and I'm a girl who wants to help you along. So, I'll be your little trinket, and when you make it big, you make me an enchanted gauntlet. The power boost I'll gain is well worth a few years in your service, or even a few decades.\"<br>\r\n<br>\r\n\"I'm old enough to know there is comfort in company.\"<br>\r\n<br>\r\n\"I'm old enough to know, its all about position. I have what you need. I want what you seek. So?\"<br>\r\n<br>\r\nAlan gave a quick smile. \"I understand what your talking about, just low enough to qualify for lab rat detail, too high to age gracefully.\"<br>\r\n<br>\r\n\"We don't age.\"<br>\r\n<br>\r\n\"My point exactly. Time wears on us differently.\"<br>\r\n<br>\r\nAlex got up and walked around the coffee table, she unfurled the arcane paper. Its sight, a reminder to Alan of his first love and her sacrifice. \"I know what I want. I know we're not immortals. The magic that imbues our veins sustains us indefinitely. That magic, my magic, I wish to yield to you. That you might advance and help me to change my station.\"<br>\r\n<br>\r\n\"The system isn't fair.\"<br>\r\n<br>\r\n\"Then raise in ranks and change it. It's not absolute. Its only a tool, a means to maintain order. Nothing more, nothing less.\"<br>\r\n<br>\r\n\"And if I fail?\" Asked Alan, walking up to the opposite side of Alex.<br>\r\n<br>\r\nAlex reached over and touched Alan softly on his cheek. \"My sacrifice, your gain, your failure, my loss. I trust you Alan, as did Cheryl.\" Alex took the arcane band off her wrist and handed over to Alan. \"I've enjoyed her use to much. Now at least, I will repay her kindness by offering her and you my company, my service.\" Alex touched the arcane diagram, starting the process.<br>\r\n<br>\r\nAlan steadied his resolve, with the power of Cheryl at his disposal. The process went considerably faster this time. Like before, the confined energies climaxed. Like before, the ink lurched forward, enveloping Alex. Alan accepted Alex's sacrifice as a pillar of light consumed her form. Where once had been a woman. Now remained a decorative neck piece. Retrieving a string to mount it. Alan wore the transformed Alex with pride. It was sometime later that he would add a golden chain...<br>\r\n<br>\r\n<br>\r\n<br>\r\nAlan's eyes shot open at the sound of a passing siren. His body reacted sluggishly following this sudden disturbance. His surroundings were moderate at best. He just finished using the rest room when he heard knocking on his apartments front door. With a stretch, and a yawn. He attempted to compose himself for presentation. Answering the door. A woman stood, dressed up. \"How many times are we going to have this conversation.\" Stated Alan in greeting.<br>\r\n<br>\r\n\"Don't be daft boy. It isn't for me.\" The woman stepped to the side. To reveal a teen girl. \"I heard about your little indiscretion to gain status within the society. I know you wont sell me your trinkets, so I'm asking you to make me one from my daughter.\"<br>\r\n<br>\r\n\"I cannot.\" Rebuked Alan.<br>\r\n<br>\r\n\"How come? She has failed the examination. Her life is one which will be relegated to the service of the higher practitioners, and that's only if she is lucky.\"<br>\r\n<br>\r\n\"An average life isn't that bad Mrs. Wellington. Plenty of people who fail the examination, live long and happy lives.\"<br>\r\n<br>\r\n\"That will not do. My daughter deserves only the best, and with her power, the best is what I'll give her. So tell me now, who is your contact.\"<br>\r\n<br>\r\n\"I am.\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\nAlan looked to the side for a bit in contemplation as to how he would explain the process. \"I know how to convert a human into an enchanted trinket, the process requires a pact, it requires trust, it requires understanding.\"<br>\r\n<br>\r\n\"She's blood, I know what's best for her.\"<br>\r\n<br>\r\n\"Lacking any of these things triggers a degradation of the matrix that would bind her. This translates into damage against her personality.\"<br>\r\n<br>\r\n\"I want this.\" Stated the teen. \"I've given it a lot of thought. I've...\"<br>\r\n<br>\r\n\"Your not listening. What will you become? Do you understand the duration of your confinement? Do you understand and accept the forfeiture of your abilities to another? The questions and complications are plentiful child. This isn't a game.\"<br>\r\n<br>\r\nThe teen stepped forward. \"I've decided that this is what I want.\"<br>\r\n<br>\r\nAlan reached out his hand, thankful that he could call upon Cheryl's powers to help augment his own and make them powerful enough to assess this bold young woman. \"I'll admit you are a suitable candidate.\"<br>\r\n<br>\r\n\"Then convert me.\"<br>\r\n<br>\r\n\"Patience child.\" Stated Alan in contemplation. \"But first, negotiations...\"</span></div></div>",
            "created":1315801020,
            "id":1185705,
            "title":"Awaken, Alan Grieves..."
        },
        "152":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "They always wake up...",
                "Sudden disturbance, enter the investigator...",
                "Pre-emptive defense or is it revenge..?"
            ],
            "content":"<div class=\"\"><div> <span>Tesara awoke as she usually did with a yawn. Reaching out her foot to kick the underside of the bunk above her, she commanded. \"Awake Katherine.\" It took Tesara a moment to register her friend wasn't there.<br>\r\nTesara took a moment to lean back against her soft bunk. \"How long has it been?\" She asked herself. Her mind wandered back to the practitioner she was working for. The job offered food, bed, and training. It was on one such job she had met with Katherine. A low rank male within the society. Good natured, honest, sincere. She would of loved to still work for him aside from him not being very good at managing his own finances. She recalled that was about seven employers back. \"To return to then.\" She muttered absent mindedly.<br>\r\n<br>\r\nTesara knew she would have to get up soon. The Lady of the manor insisted everyday be a work day. The pay was decent. But she never relented on her endless experiments. Tesara wasn't sure what to think anymore. It was close to a month that Katherine had been converted for the purposes of aiding their employer. A month bound as the Lady's magic staff. Tesara had already voiced her concern to the Lady. She knew instinctively that her ranking placed her as being low enough that the only security she could get was in numbers, and Katherine being bound wasn't helping her feel at ease.<br>\r\n<br>\r\n\"Ring.\" Came the familiar chime of the telephone.<br>\r\n<br>\r\nTesara kicked herself out of bed, raced over and attempted to answer the phone.<br>\r\n<br>\r\n\"Answer the phone!\" Commanded the Lady.<br>\r\n<br>\r\n\"On it.\" Replied Tesara. She bit her lip in agitation. The Lady of the Manor, Miss Jensine Talonthorp was a ne'er do well aristocrat. Born to a priveledged family with access to the very best of what her rank offered her. As far as personality was concerned. The Lady was sorely lacking in that department. Like a commanding brat that had been spoiled all her life.<br>\r\n<br>\r\n\"Hello, Talonthorp residence. Her humble servant Tesara speaking.\" Tesara answered pleasantly. She knew the drill, though to a degree she loathed it.<br>\r\n<br>\r\n\"Hello. Yes, this is Kanavyn, humble servant for the Order of the Interior. May I speak with Katherine?\"<br>\r\n<br>\r\n\"She is currently indisposed sir. In service to our fare lady.\"<br>\r\n<br>\r\n\"Is that so?\"<br>\r\n<br>\r\n\"Yes sir.\"<br>\r\n<br>\r\n\"Thank you. Please have her call me when she is released of her duties.\"<br>\r\n<br>\r\n\"As you wish sir.\"<br>\r\n<br>\r\nTrue to a science, as Tesara hung up the phone, Jensine walked in. \"So servant, who was that?\"<br>\r\n<br>\r\n\"Somebody from the Order of the Interior. Wanted to talk with Katherine.\"<br>\r\n<br>\r\n\"Very well.\" Was all Jensine said as she walked out. She paused briefly on the way towards her room. \"Tend to your duties, I'll be leaving shortly. While I'm gone I expect everything to be thoroughly cleaned before I return. Is that clear?\"<br>\r\n<br>\r\n\"Yes my lady.\"<br>\r\n<br>\r\nJensine smiled before departing. Tesara wasn't happy. Duties typically called for maintenance, cleaning, and cooking. To add insult to injury, Jensine insisted she be called by my lady. She certainly had the trappings of nobility, but she was hardly noble in her actions. Tesara sighed, readied herself, and set to work...<br>\r\n<br>\r\n<br>\r\n<br>\r\nIt was sometime later in the day. Tesara was busying herself on her house chores. She was in the process of cleaning shelves in the library when she pulled a book, attached to a lever. A book case opened up to reveal a hidden room. Tesara had to smile, the mistress neither told her it was there, or that exploring such things was forbidden. Taking a step forward. She calmed her nerves and prepared herself for the slight deviation of duties...<br>\r\n<br>\r\n<br>\r\n<br>\r\nTesara welcomed Jensine back, before inquiring as to her and Katherine's training.<br>\r\n<br>\r\n\"I'm currently busy at the moment. But will be certain to train the two of you once I've restored Katherine.\"<br>\r\n<br>\r\n\"And when will that be my lady?\"<br>\r\n<br>\r\n\"Don't question me servant. For that, Katherine here will serve me for another week. Is that understood?\"<br>\r\n<br>\r\n\"Yes my lady.\"<br>\r\n<br>\r\nTesara was fuming. But the conversation, however brief, told her all the things she needed to know. She served dinner to Jensine, dutifully standing by the side like a waiter. Cleaned the kitchen. Then proceeded to bed, as was her custom. Only she didn't go to sleep. Tesara, by habit, studied every place she ever worked at to ensure she understood it's strengths, weaknesses, and exit strategies. She learned this from serving one to many masters who were lacking in quality. This isn't to state she intended to steal, only that she wanted to know how to leave when she felt it prudent to. Plus a mob at the front door with torches is an excellent incentive given a master with certain indiscretions. Tesara sighed, readied herself, before making the short distance to the master bedroom. Her plan was risky, but she saw very few options, aside from leaving and attempting to report Jensine Talonthorp to be in violation of critical Society law's. Of course, Tesara reflected with what she had already seen, she couldn't trust her so called benevelent leadership to step in and fix the situation.<br>\r\n<br>\r\nTesara had to smile. Tonights little plan was originally hatched with Jensine had offended her greatly, and to calm her nerves she decided to see if was possible to sneak up and attack her mistress. In case she ever got the sudden urge to. Of course the plan was only made in fun with Katherine. Strange now, how something motivated by partial malicious intent was now the only hope for her salvation. For extra insurance. She mailed off an envelope detailing her discovery, addressed to a second cousin who was in higher standing within the Society. For that certain hope when all else fails. Tesara moved patiently towards her mark. She knew the creak of every floor board. The position of every obsticle. With what seemed like practiced ease, she approached unheard.<br>\r\n<br>\r\nTesara couldn't help but take one last step to the great oak door, barring her way. She paused, reflected in a moment of final hesitation before steping forward and attempting to open the door. With a soft creak, the solid wood door swung open. There, asleep in her bed lay Jensine. Tesara walked stealthily towards the place were Katherine was kept. The gold holder propped the wooden staff up like a trophy. The long, solid, wooden shaft, appeared like a finely decorated walking staff some hiker might use. But Tesara knew better. She spent a few weeks herself on this golden pedistal. She would of quit after the first time if it weren't for Katherine's encouragement. Tesara had tolerated being used like a lab rat, transformed into various items, even endured the task of servetude, solely on the encouragement of Katherine. Tesara was bright and capable, but she realized after the bind-ment of her best friend how crucial she needed her. Taking a step forward. It was now all or nothing.<br>\r\n<br>\r\n\"I'm sorry my friend.\" Whispered Tesara to the living magical staff. \"To right this wrong, I need to borrow your strength.\" She knew Katherine couldn't answer. But maybe, just maybe, she would soon be restored if everything went to plan. Tesara reached out her arm and grabbed the staff. She then attempted to remove it for her personal usage...</span></div></div>",
            "created":1316513040,
            "id":1190931,
            "title":"Plot weaver Tesara..."
        }
    },
    "info":{
        "author_id":"authrox",
        "author_name":"Authrox",
        "brief_description":"Follow the Mage or Scientist, Sane or Mad. Changing reality to meet their needs...",
        "created":1315712640,
        "description":"<td align=\"left\" class=\"norm\">Transformation story sequince... Seldom are there less then two roads. Behold the path of Science, or the path of the Arcane. Enter the champion, good or bad, noble or villianous. Their actions shall be their banner. The unwitting, their jury, their victims...</td>",
        "id":1809412,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1316513040,
        "modified":1316513040,
        "pretty_title":"The Chronicles of an Altered-verse"
    }
}