{
    "chapters":{
        "1":{
            "author_id":"b.m.fruen",
            "author_name":"story lover",
            "choices":[
                "Look closely beside you to see what's making the noise",
                "Ignore it and Continue ahead"
            ],
            "content":"<div class=\"\"><div> <span>Your heartbeat is drumming desperately against your chest. You swear you only walked a few feet into the forest. But now, turning back, you see an endless jungle. Before you can debate anything, a rustle in the bushes heightens your senses. You listen out and another rustle comes. And it's right beside you. What do you do...?</span></div></div>",
            "created":1281383400,
            "id":933086,
            "title":"Trapped"
        },
        "11":{
            "choices":[
                "It's a rabbit being chased by a gray fox.",
                "It's a two foot tall hermit of the forest.",
                "a bad fairy",
                "A big robotic spider.",
                "6 inch firefighters!"
            ],
            "content":"<div class=\"\"><div> <span>At first you jump, thinking that a panther or wolf is about to leap out at you with hopes of having you for lunch. But you sat there on your butt looking at the activity of the bushes. You find a large stick and through it into the bushes. A human voice goans followed by a growl.<br>\r\n \"Hello?\" Your reaction, \" I think i'm lost can you just point me back to Brimesburg?\"<br>\r\n The activity stops and there was no answer. Bitting your lip, you leen over and pull back the branches.<br>\r\n  \"Hmmm?\"</span></div></div>",
            "created":1281386460,
            "id":933121,
            "title":"Look closely beside you to see what's makin..."
        },
        "12":{
            "choices":[
                "You yell up the tree. A princess falls out!",
                "You run away along the path, to a brick tunnel.",
                "A shaded monster falles out off the tree (intentions unknown)"
            ],
            "content":"<div class=\"\"><div> <span>Fearfully (and quickly), you walk away. You could tell how fast your fleeing from that area, or how far you've gone but eventually your pace slows down and you to pant heavily with exhaustion. You could not hear a single sound to indicate life other then the bare black trees all around you. At your feet is a rat carcass borrowed into by a whole colony of red ants. you flinch in utter discust of the smell a dead rodent being opened up. you notice that along with the  dead trees having blue and green mold on them, the grass is an aged yellow. This doesn't look any thing like the forest near the park.<br>\r\n  \"how long have I been walking?\" You ask yourself. An owl produces a lonly hoo within one of the dead trees. <br>\r\n  Moving along the the birds have left you and smell of rotting flesh returns. You stop and wonder if there there is another carcass nearby but you decide to keep going till you found some thing green.<br>\r\n <br>\r\nHours go on by and your bravery is running thin with the distant between the sun and horizon. <br>\r\n  After running into thick spider's web and trip trying to pick the strands off you, you find yourself in aggreement with your feet and lie motionless. a lonely owl breaks the silence minutes later.   \"I wish I brought a cell phone.\" You complain As you lie there in the dirt. A closer look informs you that your not alone. You lying on a dirt path, maybe of an animal. Then a shrill scream of a girl launches itself through the bare trees causing you to jump right out of your skin. Your eyes dart the area, tree to tree. As your gaze looks out further. Shadows scurry within the the corner of you eye. <br>\r\n  \"Is somebody out there?\" you shout before a loud crase in the tree above.</span></div></div>",
            "created":1281397680,
            "id":933219,
            "title":"Strange Things Are Happening Here"
        },
        "122":{
            "author_id":"b.m.fruen",
            "author_name":"story lover",
            "choices":[
                "Investigate the noise",
                "Run into the tunnel"
            ],
            "content":"<div class=\"\"><div> <span>You speed toward the tunnel. Your vision plummets to the ground as you trip again. You scramble desperately to your feet as you hear a rustle of leaves and a loud thudding on the ground just behind you. When you get to the tunnel, you see the darkness that accompanies it. You want to look over your shoulder to see what's behind you, but you have no choice but to get into the dark tunnel quickly. <br>\r\nWhen you get a couple of feet in there, Your feet slip on something that sounds like mud and you slide down the tunnel. You reach your arms out helplessly and try to slow yourself down using your short nails, but it is no use. The entrance becomes a tiny pinpoint of light as you slide rapidly down the chute. Your clothes are all wet and muddy.<br>\r\nWhen you think you'll be sliding down here forever, your feet hit something solid. There is nothing but darkness. You plop your hands in the thick mud and push yourself upright. You slowly walk forward. Too bad you didn't hear the quiet rushing of water.<br>\r\nBecause you are plummeting. A loud splash. A river carries you away. You are treading water. In a minute, you are carried underneath a light. You hit a wooden object. You climb on top of it. It is wide enough to walk on. There is a concrete platform which you step onto. This place looks like an abandoned sewer. The metal cage around the dim yellow light is rusted and the walls are covered with algae and scratches. Behind you, there is a small tunnel that is just tall and wide enough for you to fit through. The light in this chamber reaches not even one metre in there. Another dim light is attached to the ceiling about ten meters into the tunnel. On the other side of the chamber, there is another tunnel that water is flowing through.<br>\r\nYou hear something moving through the water from that direction. What do you do?</span></div></div>",
            "created":1281568920,
            "id":934497,
            "title":"The brick tunnel"
        }
    },
    "info":{
        "author_id":"b.m.fruen",
        "author_name":"story lover",
        "brief_description":"You only walked a few metres into the forest and you were surrounded...",
        "created":1281382440,
        "description":"<td align=\"left\" class=\"norm\">You decide to go into a forest on your own. You only walk a few metres into it and you find yourself surrounded by the forest, not by the car park which was just behind you a minute ago...</td>",
        "id":1697706,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1281568920,
        "modified":1281568920,
        "pretty_title":"The forest"
    }
}