{
    "chapters":{
        "1":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "Animu",
                "Fantasy",
                "Sci-Fi",
                "d",
                "e"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Seeing as interactives have been walled off behind a paywall, I've decided to repurpose an old interactive so I can dump and work on whatever stories tickle my fancy that can no longer go into their own interactives.</span></div></span></div>",
            "created":1364946420,
            "id":1563397,
            "title":"Story dump!"
        },
        "11":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "Ranma 1/2",
                "B",
                "C",
                "D",
                "E"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fetishy Fanfiction.</span></div></span></div>",
            "created":1433125980,
            "id":1986125,
            "title":"Animu"
        },
        "111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "Weight Gain",
                "Something",
                "Something Something"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I have a weakness for this series.</span></div></span></div>",
            "created":1433128140,
            "id":1986133,
            "title":"Ranma 1/2"
        },
        "1111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "The Rings",
                "B",
                "C"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Space for other stories, just in case.</span></div></span></div>",
            "created":1433128440,
            "id":1986135,
            "title":"Weight Gain: Obligatory Split"
        },
        "11111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "It takes her a while...",
                "She notices"
            ],
            "content":"<div class=\"\"><div> <span>\"Pleeeeease Mister? Just a few more?\" Ranma pleaded, bouncing on her heels to give her chest a little extra jiggle. She knew that would catch his eye. The Candy vendor sighed reluctantly and dropped a few more sweets into Ranma's bag. He knew better, but whenever this peppy little red-head came around, he just couldn't help himself. <br>\r\n<br>\r\nRanma celebrated internally as she watched those delicious treats tumble into the bag. She paid for a handful of cheap candies and managed to score nearly 5 times that with a few bubbly giggles and cutesy bounces. It wasn't to be cruel to the poor guy.. She just didn't have a ton of money and she wanted candy, and there just wasn't any better way to get it. If she was going to be cursed, she may as well reap the benefits of having such a smoking hot body.<br>\r\n<br>\r\nWhile Ranma was reveling in her victory, she failed to notice the woman who had lined up behind her, waiting for her chance to purchase some sweets for herself. She realized this too late when she turned around and bumped right into the woman. Ranma bounced backwards of the enormous woman's belly and stumbled to the ground, spilling her bag of candy in the process. She looked up, not used to being caught off guard and stared in awe at the large figure looming over her, blocking out the sun, from her perspective.<br>\r\n<br>\r\nShe was dressed in a rather elegant purple kimono, tied around her expansive waist with a pink obi which clung tightly around her rotund figure. She had curly blond hair that spilled down over her shoulders and features which clearly weren't Japanese. Ranma figured she must be a foreigner, what with her hair and weight. <br>\r\n<br>\r\nFrom Ranma's view, absolutely every inch of the woman was plump and overstuffed, with thick, heavy legs, a broad dome of a belly, the largest breasts she'd ever seen, like fleshy beach balls stuffed into her kimono, and a round, pudgy face with puffy squirrel cheeks and a thick double chin. At her size, she could probably be a sumo wrestler.. or a beached whale.<br>\r\n<br>\r\nThe woman carefully leaned down and began gathering up the candy Ranma had dropped. \"So sorry, darling!\" she cooed in a sweet voice, with no hint of an accent. She dropped the sweets back into Ranma's bag and helped her up while dusting her off with a kind smile. Ranma noticed the elegant make-up artfully applied to her pudgy face as she stared dumbfounded. She'd never seen anyone so big in her life...<br>\r\n<br>\r\nShe placed the bag of candy back in Ranma's hands, briefly brushing her hand against Ranma's, and gently urged Ranma along so she could get to the cart and buy some sweets for herself. \"There you go, sweety.\" Ranma slowly began to walk away, peeking into her bag to make sure all her snacks her accounted for before taking one last glance over her shoulder at the colossal woman, this time getting a look at her mountainous backside. \"Jeeze.. How could anyone let themselves go like that? Can she even fit through doors with a butt that huge?\" Ranma whispered to herself as she walked back home.<br>\r\n<br>\r\nIn the confusion of bumping into the strange woman, Ranma failed to notice the sleight of hand that took place. While she was giving Ranma her bag of candy, the woman briefly brushed hands with her. In that moment, she'd slipped an ornate ring onto Ranma's right ring finger. One that matched the ring worn by the woman on her left ring finger. while Ranma was whispering to herself, the woman was doing the same. \"That ought to teach that skinny little tart a lesson..\" she hissed under her breath, gently running a fingertip along the inlaid gems of her ring.<br>\r\n<br>\r\nDoes Ranma notice the ring right away?</span></div></div>",
            "created":1433129640,
            "id":1986144,
            "title":"Cursed Ring"
        },
        "111111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "Her Slothful nature",
                "Her Gluttonous appetite"
            ],
            "content":"<div class=\"\"><div> <span>Instead of looking down at her hand to notice the ring, Ranma looked down into her bag of candy and plucked out several treats. She peeled away the wrappers and popped a few pieces of chocolate into her mouth with a satisfied \"Mmmm~!\"<br>\r\n<br>\r\nIt would have been impossible for her to tell just by looking at it, but in the few moments she'd been wearing the ring, it had already begun to work its strange magic. Little by little it was beginning to siphon the tremendous amount of excess weight from the unusual woman into Ranma's unsuspecting body. It would be a slow process, but the longer it went on, the harder it is to undo or stop...<br>\r\n<br>\r\nBy the time Ranma had arrived back at the Tendo household, she'd already gained a few extra ounces of undetectable fat. She said her hellos on the way in. It was Friday afternoon, school was done with, and no immediately pressing chaos to attend to, Ranma had a relaxing afternoon ahead of her. She'd planned on taking it easy, then starting her evening work-out. At some point she'd need to take a bath and turn back to her male self, seeing as she'd already finished using her feminine charms to secure extra treats. However, that didn't seem like a huge concern to her at the moment, though. <br>\r\n<br>\r\nUp in her room, Ranma picked up a manga she'd been paging through and settled on the floor with her bag of candy. By that point, she'd already gained a few pounds, but remained oblivious to the gain. Her focus was on the comics in front of her and the sweets in her mouth. That, and her usual red, long-sleeved Chinese top was as baggy as ever on her female body, fully covering and hiding her figure from view.<br>\r\n<br>\r\nThe day passed by quicker than expected. Kasumi brought dinner up to Ranma's room, explaining that Genma and her Father had left for the night to take care of something, Nabiki was off doing who knows what, and Akane was tied up working on some homework. So, Kasumi decided that smaller private meals for the three of them would be nicer. Ranma probably should have been doing her homework as well, but she thanked her and told kasumi that she'd be starting on it as soon as she was done reading, which wasn't meant to be a lie, but it was. Instead, Ranma continued to laze about her room, flipping through manga, accidentally skipping her work-out in the process, since the Old Man wasn't around to train with her.<br>\r\n<br>\r\nNight snuck up on Ranma and soon after that, it was time for bed. She hadn't intended to waste the rest of the day, but she did. With nothing else to do for the day, she flipped the lights off and began to disrobe, tossing her shirt and pants to the side, deciding to sleep in her tank-top undershirt and boxers. She briefly stopped to tug on her boxers to keep them from riding up her butt. If she'd stopped to really check, she would have realized it was because her butt was actually bigger, but some bizarre quirk of the ring's magic kept her from dwelling on it.<br>\r\n<br>\r\nRanma really should have known better, by this point, but she was relishing the sweet, tranquil feeling of being able to unwind for once. In her life, nothing goes this smoothly for this long without something happening. She flopped onto her futon, landing on her back and easily drifted to sleep, telling herself she'd make up for the missed training tomorrow.<br>\r\n<br>\r\nWith only one evening of wearing the cursed ring Ranma had already put on at least 10 pounds. One her smaller frame, it was already beginning to show. Her thighs had grown a little thicker, her butt a little bigger, her breasts somewhat more full and for the first time in her life, Ranma had the makings of a small belly. Even though she slept, the ring's magic continued its work, fattening her up little by little.<br>\r\n<br>\r\nElsewhere, the strange woman who had given the ring to her was celebrating with a glass of wine as she stood on the scale, admiring her only slightly thinner body in an array of mirrors. She giggled and snickered to herself, eagerly awaiting the shedding of each additional pound while lavishing in the thought of Ranma's suffering. In her head, Ranma was some carefree bimbo who'd likely abused her good looks and thin figure all her life to get what she wanted. She'd use the magic of the rings to teach her a lesson she'd never forget.<br>\r\n<br>\r\nShe whispered the incantations she'd been taught into the ring she wore, urging on the transfer, and advancing her plans. Weight was not the only thing she'd unload onto Ranma. Along with speeding up the process, she'd also transfer and trade her undesirable traits.<br>\r\n<br>\r\n<i>What else does Ranma receive from this strange woman?</i></span></div></div>",
            "created":1433129760,
            "id":1986145,
            "title":"Ranma starts to fill out"
        },
        "1111111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "Akane checks on Ranma",
                "Nabiki goes in her place"
            ],
            "content":"<div class=\"\"><div> <span>The weekend passed Ranma by in a blur. Without Genma around to berate and force her into more sparring matches, she found herself lacking a reason to go train, so she didn't. Instead of jumping out of bed and springing into a rigorous routine, she slept in until noon, and slowly rolled out of bed, continuing where she left off with some chocolates and a manga to page through. She tells herself that she can make up for the training later. She's trained every single day of her life. A few days of taking it easy and letting her body rest can't be that bad.. \"I'll make up for it tomorrow,\" she says out loud to reassure no one in particular, lying yet again.<br>\r\n<br>\r\nKasumi, assuming Ranma was feeling ill from studying too hard the night before, had begun to leave meals at Ranma's door. This was something which Ranma found incredibly convenient, as it meant she didn't have to trudge up and down the stairs just to get her food.<br>\r\n<br>\r\nRanma went through Saturday and most of Sunday in a sort of haze. She only left her room for the bathroom, and even then, didn't make any an effort to take a look in the mirror, otherwise she would have noticed right away how much fuller and rounder her face was becoming, or the way her breasts were ballooning up in cup-size and filling her normally loose and airy tank-top to capacity. She'd officially passed the stage where the extra weight was just padding out her already pleasant curves and was starting to become quite chubby. A soft layer of pudge covered her more or less from head to toe, obscuring the athletic, honed physique that Ranma had trained her whole life to get. Her arms looked soft and plump, her middle was now sporting a soft little mound of a belly with puffy lovehandles adorning her sides. Just a look at her and you'd think she'd never worked out a day in her life. Hers was the body of a lazy, over-indulgent, pampered girl, no longer that of a dedicated martial artist and heir to a whole martial arts school..<br>\r\n<br>\r\nShe should have noticed by this point, but the ring always kept her focus elsewhere, ignoring the way her butt jiggled a little with each heavy step, or the way her boxers were practically painted on around her hips and thicker thighs, fabric creaking and groaning as she continued to grow little by little.<br>\r\n<br>\r\nWith each additional pound, Ranma's typical active and energetic attitude was being chipped away. Not that Ranma wasn't prone to some laziness before, but now it was becoming far more pronounced. Working up the urge to get up and do things was getting harder, not just because she had to lug around her heavier body, but because she was finding the notion of motivating herself to do anything else less appealing. She could just procrastinate for a little longer. It was the weekend, after all. This is what she was supposed to do with her free time. Soon, Pops would burst through that door, shout something about getting off her butt, and she'd be at her training again, just like that... So, until then, she'd just enjoy her peace and quiet and finish the last of these chocolates.<br>\r\n<br>\r\nElsewhere in the Tendo House, Akane was dutifully putting the finishing touches on a pile of homework. Her teachers may mostly be psychopaths, but that doesn't mean the grades they give out don't matter. With all of her work done, Akane began to realize what that nagging feeling she'd been having for the past couple days meant. There'd been no crashes. No fights. No shouting. No Ranma hanging outside her window with something dumb to say. No distractions at all, really.<br>\r\n<br>\r\nAkane headed downstairs to find out what was wrong, fearing someone had kidnapped her family while she was busy. She found Kasumi and Nabiki enjoying some tea and appreciating the fine sunday weather. Nabiki has finished extorting Kuno and Kasumi had done all her housework, from the looks of it.<br>\r\n<br>\r\n\"How are you, Akane?\" Kasumi asked in her usual sweet, cheerful tone. Akane nodded politely, \"I'm doing well, Kasumi, but.. Where is everyone?It's been really quiet. Is everything okay?\"<br>\r\n<br>\r\nKasumi thought for a moment and recalled that their Father and Mister Saotome had left on business, from the sounds of it, and Ranma hasn't been feeling well, so he's been resting in her room. <br>\r\n<br>\r\nKasumi's expression lit up and she quickly gathered up a tray with a cup of tea and some crackers, \"If you're going to check on him, could you bring him some tea?\"<br>\r\n<br>\r\n<i>Does Akane go or allow Nabiki to take her place?</i></span></div></div>",
            "created":1433129820,
            "id":1986147,
            "title":"Lazy Sunday"
        },
        "11111111":{
            "author_id":"kyrex",
            "author_name":"kyrex",
            "choices":[
                "It's stuck",
                "It slips right off"
            ],
            "content":"<div class=\"\"><div> <span>Akane didn't like doing Ranma any favors, but she didn't mind helping Kasumi. Besides, she thought, Ranma had avoided causing her any trouble for the past few days, as far as she knew. A little slack wouldn't hurt.<br>\r\n<br>\r\nShe headed to Ranma's room and gently knocked on the door before opening it, \"Ranma? Kasumi sent me to check on you and offer you some...\" Akane trailed off and just stared. Her first thought was that someone else was in Ranma's room when she saw a chubby girl laying on the floor, but that unmistakable crop of red hair with the signature pigtail made it clear that wasn't the case. That was definitely Ranma, in her girl form, and at least 100 pounds heavier. <br>\r\n<br>\r\nRanma had her back turned, laying on her side while she languidly flipped the page on her comic. On a short, compact girl like Ranma, 100 pounds made a world of difference. Her large butt was prominently on display from where Akane stood in the doorway, along with her thick, thunder-thighs. A roll of fat wrapped around her sides, leading into a plump dome of a belly that made Akane fear for a moment that Ranma might be pregnant, as well.<br>\r\n<br>\r\n\"Ranma..! You're.. You're.. Fat!\" Akane blurted out. Ranma looked over her shoulder, giving Akane a good look at her pudgier face. She looked indignant as she finished chewing a piece of candy, \"That's a new one, tomboy! Are ya really so jealous that you'd resort to that?\" she barked right back and sat up. <br>\r\n<br>\r\nAkane stood there for a short while, taking a good look at the rest of Ranma's fattened body. Most notably, her breasts, which were double their original size and thensome. Ranma had always been a little bustier than she was and she never let Akane forget it, but now, the difference in their breast sizes was ridiculous. She shouldn't even care, but it made her feel the smallest bit envious.<br>\r\n<br>\r\nAkane growled and stepped closer, \"No, you dumb idiot! I mean you are really fat!\" she emphasized the word 'fat' by jabbing a single finger against Ranma's pudgy belly which was overflowing the waistband of her boxers, \"What the heck happened to you?!\" She had trouble believing it, but couldn't understand how Ranma could be so oblivious.<br>\r\n<br>\r\nAnd just like that, the haze started to lift from Ranma's mind. The ring's magic wasn't undone, but the Ranma was no longer blind to the things happening to her.<br>\r\n<br>\r\nIt dawned on her that she'd spent her whole weekend just laying around and eating. She put off all her training for days now! She'd never done that before. Worst of all was the sudden realization of what had happened to her body. It wasn't that her usual male-sized clothes didn't fit right around her female curves, like she told herself before. It was that she'd literally outgrown them to the point of stretching them tight around herself. In a panic, she tried to pull her shirt down to cover her new belly, but couldn't even stretch it enough to reach her navel, not with her hefty breasts taking up so much of its fabric.<br>\r\n<br>\r\nRanma had all kinds of different nightmares about her female body in the past, but this was an entirely new insecurity she'd never experienced before. She stared in disbelief and horror, feeling her swollen middle, hefting her enlarged breasts and noticing the way her fingers sunk in a lot as they weighed against her hands. While looking down at herself, she could also feel the hints of a double chin, obscuring her normally thin and graceful neck.<br>\r\n<br>\r\nRanma scrunched her eyes closed and reached up to pinch her plump cheek, hoping to wake from this terrible dream. Though she was normally male and proud of it, she was also kind of proud of her female form, in a weird sort of way. At least, she used to be proud of it... When she opened her eyes again, she found that she was still just as big. A tiny bit bigger, actually, not that she could tell.<br>\r\n<br>\r\n\"Snap out of it Ranma!\" Akane shouted, still standing right in front of Ranma. She was just about to start questioning Ranma again when something peculiar caught her eye. Unlike Ranma, she wasn't being compelled or distracted by any magic from ring, so she spotted the out-of-place piece of jewelry almost immediately. \"What is that..?\" Akane kneeled down and grabbed Ranma's hand. Even her wrists were a bit pudgy, Akane noticed, as she held took a closer look to be sure \"You're wearing jewelry, too? You're acting way too weird.. What happened? Did you get attacked by someone? Is this another pressure point thing? Did Shampoo feed you something weird again?\"<br>\r\n<br>\r\n\"I.. I don't know..\" Ranma tried to shake off the haze, \"I got home on Friday and I just kinda stayed in and read manga...\" she pulled her hand away from Akane and took a look at the ring, having only just realized she was wearing it. She had to lift her hands up higher than she was used to, just so she could see over the impressive swell of her breasts. It was a beautiful piece of jewelry, clearly very expensive, but she didn't recognize it from anywhere. It made her feel uncomfortable to wear something so extravagant, especially when she didn't know whose ring it was or where it came from. She thought if she could get a better look, she might be able to tell. Maybe there was an engraving on the inside of the band?<br>\r\n<br>\r\nRanma starts to tug at the ring and...</span></div></div>",
            "created":1433132640,
            "id":1986159,
            "title":"Big Surprises"
        }
    },
    "info":{
        "author_id":"kyrex",
        "author_name":"kyrex",
        "brief_description":"Doing a thing. Will edit for clarity later.",
        "created":1364945220,
        "description":"<td align=\"left\" class=\"norm\">Making a place to just drop random story ideas and the like.</td>",
        "id":1927030,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1433295480,
        "modified":1433295480,
        "pretty_title":"The Story Place"
    }
}