{
    "chapters":{
        "1":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "More about Katya"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 1: Enraged<br>\r\nA hill of closely-cropped, well-manicured grass Mimi stormed up. Each brisk footfall carried her further away from her village at a hurried pace. Her brow drew together angrily over her brilliant green eyes, and the corners of her full lips turned downward in a scowl that would have prompted foolhardy male suitors to attempt “you're beautiful when you're angry” placations. That is, if there in fact were any men around her village. There were not, because Mimi was a wood nymph, and every soul in her whole village was a lovely, nubile female, just as she was.<br>\r\n<br>\r\nMimi's splendidly large breasts to bounced heavily with each aggressive step her long legs took until she finally folded her slender arms over them to bring them under a little more control. Crossed arms suited her mood anyway. She was fuming mad. She was hurt, too, and at least one tear had escaped her watery eyes and slid down her amber cheek. Her friends were so cruel to her. Their words played back in her mind over and over again as her slender figure marched off into the forest beyond.<br>\r\n<br>\r\nIt was late in the evening, and the forest was rapidly becoming dark. A thick fog has set in several days before, obscuring the forest all around her village and making it difficult to see very far. Normally, the wood nymphs loved the fog, because fog meant mushrooms would grow, and food would be abundant. But the fog also made the night forest even darker and more frightening than normal. Through the dense mists far, far behind her, Mimi heard a voice calling her name. It was Cassia, but Mimi knew that Cassia and the others could not have seen which way she had gone off in the thickening gloom. Defiantly she pressed on. Cassia could go to hell.<br>\r\n<br>\r\nCassia was not the primary focus of Mimi's ire, though. It was Katya. Whenever the fog came and the harvests began, Katya was always so cruel to her. She taunted Mimi mercilessly, and entreated her friends to join in with her. Mimi was the object of Katya's ridicule because she had a serious problem—an impairment of a sort. Rightly, the issue should have earned her compassion rather than ridicule, but unfortunate ugliness in the world often causes things to play out differently, and those who do not quite fit in are too often receive so much taunting where sympathy is needed. Mimi's problem was indeed serious: she was always full.<br>\r\n<br>\r\nPerhaps it sounds like an odd thing to call a problem. Maybe it seems unworthy of being called a “problem” at all. But, for Mimi's kind, being full was quite a serious issue indeed. Wood nymphs lived a mostly carefree lifestyle. There was little to worry about in their happy little village of colorfully-capped toadstool houses and grassy lanes. The fairy lanterns that lined the lanes cast a greenish-yellow light that warded off the night's predators. By day, the glow of sunshine on their grassy clearing let them frolic and gambol about with little to care or worry about. They could talk, and play games, and explore the forest, and do anything else that wood nymphs liked to do. It was all at their leisure from their merry little village. There were just two things that the wood nymphs always had to remember. The first was never ever to leave the village at night. The other was that when the fog rolled in, and the mushrooms came up, they had to eat as much of this single, short-term food supply as possible.<br>\r\n<br>\r\nIndeed, mushrooms could not be stored for very long. Even though there were at least a dozen different kinds that regularly grew in the forest, every one of them would wilt and decay in just a day or two. And because the fog would sometimes take weeks to return, the only way the wood nymphs could live comfortably between harvests was to stuff themselves with as much of the delicious, soft fungi as possible. So when the harvest came, Mimi and all the other villagers had a duty to eat as much of the mushroom bounty as possible. As a matter of survival, it was simply wrong to waste them.<br>\r\n<br>\r\nBut unlike the other nymphs, Mimi would hardly eat a few bites before feeling that she could eat no more. While all the others were gorging themselves as was normal during a harvest time like this, she could only look on and wonder why she couldn't bring herself to do the same.<br>\r\n<br>\r\nNo matter how she tried, no matter how much she forced herself, she just did not have the appetite that her lovely friends all shared. Mimi couldn't help it. Each harvest that came around, the whole village would celebrate by gorging themselves until their bellies bulged to the point that they could barely move. Everyone except Mimi. She could only peck a little at her expected intake, despondently watching the others as they reveled in their gluttonous orgy.<br>\r\n<br>\r\nTo make matters worse, they all took their hunger for granted. As her best friends stuffed themselves, and their bellies bulged ominously from their svelte frames, they chided Mimi as she slowly fidgeted with her food, trying to muster the will to swallow just one more bite. She weathered their abuse, watching enviously as their bellies swelled out below their rib cages to become beautiful, rounded domes.<br>\r\n<br>\r\nThe type of toadstool that wood nymphs make their houses from has unusually fat stems. By hollowing out those stems, careful not to waste any of the delicious material from within, they made a single room. If the room had a name, it would be called “the living room,” because its the place where you sleep, and eat, and cook, and entertain friends when they visit. But they didn't actually call it “the living room,” because when you only have one room, there's no need for a name. It's just “inside.”<br>\r\n<br>\r\nThe room traditionally has only a couple tiny windows to let in some daylight. Curiously, there is also no furniture inside. Wood nymphs don't use any furniture except numerous fluffy pillows of various colors that they cast about the floor, and lounge around on as they socialize and eat. One corner—or what would be a corner if the hollowed-out toadstool cap was not round inside—always has a small counter for preparing food. Wood nymphs don't really cook, but they do wash everything they gather from the forest before they eat it.<br>\r\n<br>\r\nAs they sat in whichever cottage she and her friends had repaired to, Mimi considered her basketful of morel mushrooms wistfully. Again she was already full. Her belly sported maybe the tiniest bulge. Mimi surveyed her friends' swollen bellies, distending so gravidly that each one pushed its owner's shapely legs apart as it thrust out onto the floor before her. Among such wholesome waistlines, Mimi looked disgustingly thin. Even in the best of harvests, her bulging breasts, curved hips, and rounded posterior contrasted with her absurdly thin waist. In a time that called for bumble-bees, Mimi looked more like a wasp.<br>\r\n<br>\r\nThe definitive leader of her gang of friends was the ever-popular Katya. Katya had lustrous brown hair and an evenly tanned complexion that made her purplish eyes sparkle like amethysts. Of the four friends, Katya was tallest, and she had a style of dress that was distinctively her own. She decorated her tall, lean figure with various dangly earrings, amulets, bracelets, toe-rings, and anklets, all of them fashioned from bronze that had long since tarnished to a dull brown. On her legs, she typically wore colorful, loosely flowing pants, that looked like they were meant for a genie. Her feet would be shod with the same black satin slippers that all wood nymphs wore, but she would sew on tiny purple beads that matched the peculiar color of her eyes.<br>\r\n<br>\r\nAlthough Katya was heart-stoppingly beautiful, it should be noted that all wood nymphs are uncannily lovely, with luscious and delicately symmetrical features. Aside from being unusually tall and gracile, what stood out most about Katya were her extremely large breasts. They strained at the loosely woven fabric of her blouse, and between harvests, when she and her comrades' bellies subsided back to svelte waistlines, they made her graceful figure look charmingly off balance. Of course, there were a few wood nymphs sported a bigger rack than Katya's—Sylvie for instance—but they were only a few, and none had quite the exquisite roundness that Katya's did. The big orbs on her chest were almost spherical, slowly coming to an slightly upturned, soft point just at the nipple, giving them a perkiness that was seemingly impossible for breasts so large. Consequently, Katya's breasts were the secret envy of all the other wood nymphs. On sunny days, when various meadow games were afoot, everyone wanted to play with charming and bouncy Katya.<br>\r\n</span></div></div>",
            "created":1352264400,
            "id":1463184,
            "title":"Chapter 1"
        },
        "11":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Mimi ventures into a forest, pondering on why she couldn't eat",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nOf Mimi's friends, Katya was also by far the cruelest and was always the instigator of Mimi's torment. She would kick it off casually, almost as if she had no premeditated ill intent. As Mimi winsomely poked at her food, Katya would toss the first barbed comment at Mimi in an offhand manner, almost dispassionately observational manner, while talking through a huge bite stuffed in her mouth<br>\r\n<br>\r\n“Theef are foe delishuff! [chomp] I jufft luff morelth...[gulp]...they're so sweet, you know? [chomp] They're—awww, what'f wrong over there, Mimi? Did you get a bad batch? Mine are theriuffly tathty! [gulp] I could eat them all day. In fact, I have been eating them all day!” she said, rubbing her swollen midriff where it's smooth, rounded surface was exposed between the well extended waistband of her pants and the bottom of her tightly stretched shirt. Slowly moving her hands outward to the sides of her gigantic tummy, she leaned back a little as she continued rubbing it, emphasizing it's girth for Mimi's inspection<br>\r\n<br>\r\nWhen she finally leaned up back to normal, she leaned forward, reached out an arm, and grabbed another generous handful from the huge harvest basket. Very deliberately she shoved the whole handful into her mouth at once, throwing her head back and pushing the last of it down into her mouth vertically. A couple of them fell out and down to the floor. When she brought her head back upright, her cheeks bulged out hugely on both sides. She chewed slowly as she scooped up the two spongy fungi she had dropped, pushing them into her already-overfilled mouth without swallowing to make any more room<br>\r\n<br>\r\nKatya chewed for a moment staring at Mimi with big, mockingly sympathetic purlpley-blue eyes. After swallowing some of the mass that filled her cheeks, she continued, “Look if you need shum help with thoshe, Mimi, jufft let me know. It'f getting cloaf to bedtime, and I luff to go to fleep wiff a big round belly underneaf me. [guuuulp] You know what I mean?” Katya looked down at Mimi's almost perfectly flat belly. “Oh...I guess you don't. Well, it's just heavenly. I absolutely love the feeling of laying on a huge belly when I go to bed. Especially when I have stuffed it so much that I have to stay use my knees for support. You know, because my tummy is so full that it raises the rest of my body too far off the floor? I stack up a bunch of pillows up to support my head, and lay there so contentedly.” Katya took another handful, no quite so big as the last, and stuffed it into her mouth, continuing, “Looksh like tonight iff one of thoshe nightf, I'll thay,” concluded Katya, patting her immensely rotund belly with exaggerated self-satisfaction. “I'm thelling you, Mimi, there'sh nothing like it! [gulp]”<br>\r\n<br>\r\n“I soooo know what you mean, Kat!” Cassia agreed, rolling her big, liquid blue eyes so that they flashed turquoise in the fairy lanterns' light. Now Mimi's big green eyes painfully drifted to look at Cassia, dreading what was to come next. The inevitable double-team gang up. Fortunately for Mimi, Sylvie was still too busy eating to follow the conversation. But Cassia was certain to help Katya's fledgling campaign along<br>\r\n<br>\r\nAnother stunning example of wood nymph femininity, Cassia had a beautiful mane of long, flowing, sandy hair that hung to her ankles. She always wore dark brown tights, and the tights hugged Cassia's shapely legs exquisitely. At the moment, they were also straining to hold in Cassia's seriously overstuffed belly that rose like a big dome. She wore a loose shirt that had slid down the slope of her belly and now played softly on the forms of Cassia's exuberant breasts. Cassia's breasts were not nearly as huge as Katya's—for that matter, not even as big as Mimi's—but, like all wood nymphs', they were still a force to be reckoned with. Cassia's had an exceptionally intriguing face, with dark blue, doe eyes and a cute little button nose set neatly above her devious smirk. Her pale, even cappuccino complexion was almost too pleasant, too perfect<br>\r\n<br>\r\nAnd Cassia was always a quick accomplice to Katya's mischief, especially when it involved doling grief out to Mimi. “If only I could push these dusty amanitas in faster. I can't get enough of them. Seems like my belly should have almost maxed out a while ago, but somehow I keep adding more in. I think I'm sleeping on more belly than I have ever had before,” Cassia further concur. She swallowed, and then wrapped her arms around her huge belly, just barely managing to grasp her hands together under its bulk. “I'm totally going to see how much bigger can make it before sleeping on top of it.” Cassia looked at her belly with an overstated look of consideration. “You know, I may not even be able to walk it home tonight. Anyway, it's  true, Mimi. You really don't know what you're missing.”<br>\r\n<br>\r\nCassia and Katya both cast their eyes over to Sylvie, as if to solicit her contribution to the fun. Sylvie was still singularly focused on stuffing clumps of yellow fairy rings into her smiling mouth. Her two hands alternated the job of reaching down, then hauling another clump up to her mouth. She was making fast use of another whole harvest basket; Sylvie really didn't need to say anything, anyway. She didn't have to be an active part of Katya's game at all. Her very presence, and her total focus on cramming food down her throat was contribution enough on its own. Because Sylvie always managed to cram a third more food into her belly than the other girls, her gigantic, bulbous belly quite literally spoke mountains toward Katya's cause. It spread her legs apart in a wide V, and covered a broad patch of the floor before it began to curve upward. In the first evening of harvest, Sylvie had managed to pack in a truly amazing variety and amount of the freshly harvest fungi. With more full baskets all around the room, Mimi wondered when Sylvie would stop<br>\r\n<br>\r\nEven when not stuffed to the gills, Sylvie was consistently more rubenesque than most wood nymphs. Her plump breasts looked as if they were overfilled, perching like two basketballs attached her frame. Her full hips flared widely from her waist. And yet, her legs were shapely and rather thin, and when not so full of food, Sylvie's fuller curves came to a dramatic narrowing above her hips and below her rib cage. However, what her wide hips did give her was a tremendous, round posterior. All in all, she looked almost like a female caricature<br>\r\n<br>\r\nLike Katya's breasts, Sylvie's ass was the envy of all the other girls of the village. The whole town watched it with open admiration when she walked by, and she relished the attention it drew to her. Sylvie's persistent smile caused her eyes to become twinkling crescents as her plump cheeks tightened to allow room for her big grin. As far as brains went, though, even for a nymph, Sylvie was kind of daft. But her happy nature compensated for her lack of wit, giving her a naiveté that was irresistibly cute<br>\r\n<br>\r\nMimi regarded at Sylvie's spherical tummy forlornly. It was so big that that she could probably fit inside of it, Mimi mused to herself. How would that be for a way out? Crawl down Sylvie's throat into her belly, never to have to endure Katya's torture again<br>\r\n<br>\r\nAs Mimi dejectedly stared at Sylvie's huge belly, Katya made her way on all fours over to Mimi, plowing aside pillows as her belly dragged the floor beneath her. As Katya closed in, Mimi looked up at her with watery eyes<br>\r\n<br>\r\n“Oh, what's wrong, Mimi? Not hungry again? That's too bad,” Katya mocked, as she raised herself up from the crawl and put a falsely consoling hand on Mimi's back. Katya pushed out her lower lip as if pouting, her face just inches from Mimi's. Her belly pressed against Mimi heavily, making its invasive presence impossible for Mimi to ignore. “Well, I finished my basket, and I'm almost full now, Mimi. All three of us are almost done,” Katya continued to tease, the sound of Sylvie's unceasing munching notwithstanding<br>\r\n<br>\r\n“I think I need just a little more...in....here,” Katya said with a syrupy smile, abruptly pushing her belly even harder against Mimi to indicate where she meant. If there was any doubt before whether she had been using her belly as part of the taunting before, there was no doubt now that she was indeed pressing her belly against Mimi deliberately. She was using it to emphasize a point. Katya was on a roll. Although she had been cruel to Mimi many times before, she never had gotten physical. It wasn't like she was really threatening Mimi, but this new technique...this...'belly aggression'...it upped the psychological effect to a new level<br>\r\n<br>\r\nMimi watched Katya's other hand now reach toward Mimi's basket, still full of morels. She  slowly leaned further onto Mimi as she reached. Then, she dug her hand into the basket, and asked with a devilish inflection, “Mind if I have some of yours?” Then she drew a brimming handful up to her mouth and started munching on it while right up in Mimi's face<br>\r\n<br>\r\nSomething snapped inside of Mimi. “ENOUGH!” she shouted, as she jumped up, pushing aside Katya's belly. Her slender body stamped forward a couple steps and then reeled about to face Katya and the other two<br>\r\n<br>\r\n“You do this to me all the time, and I'm sick of it! I'm sorry, but I can't eat!” Mimi glared at the three stunned faces looking at her. “I just can't, okay? And you guys do nothing but make fun of me. I'm sick of it!”</span></div></div>",
            "created":1352264400,
            "id":1463188,
            "title":"More about Katya"
        },
        "111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Mimi finds a place to hide",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 2: Danger in the Forest<br>\r\n[The management regrets that this scene involves no stuffing. Zero. We will be taking necessary steps to correct this situation in scene 3.]<br>\r\n<br>\r\nWhy, oh, why couldn't she just eat? Why couldn't she just eat like they could? What was wrong with her? And why did her friends have to be so cruel about this wretched condition of hers? Questions blazed through her mind, briskly swirling around each other in roiling ire as her slippers silently carried her off into the darkness and ever further away from her home.<br>\r\n<br>\r\nWhere she was heading she didn't know. Sometimes when you are singularly set on getting away from somewhere, where you are going doesn't really matter. The dangers of the night forest were the last thing on her mind. When she had marched off into the fog, she vaguely realized that she was doing something unheard of, but her all-encompassing anger diminished the terrible danger to which she was now subjecting herself. Stuck in a body that made her unable to hold up the second requirement of being a wood nymph, Mimi was now actively defying the first.<br>\r\n<br>\r\nSome distance later, Mimi's head started to cool off. She walked underneath the canopy of tall trees far above, where gnarled root systems spread out across the forest floor in twisting and tangled sinews. Fog was condensing to dampen the mossy ground, and her feet were getting cold. The first feelings of uncertainty began to seep into the outer edges of her conscious thoughts.<br>\r\n<br>\r\nShortly, Mimi stopped to rest, sitting on a thick root just before the point where it dove underground once and for all. Her anger had dulled into sullen contemplation. Her sternly frowning lips had softened into something of an noncommittal pouting. The chill of the night was making her shiver, and she started to feel very sorry for herself. As she looked up toward the tree tops hiding in the mist and darkness, a tear slid slowly down her cold cheek, feeling warm at first, but leaving a cold trail of moisture behind it.<br>\r\n<br>\r\nWhy, oh why, couldn't she eat?<br>\r\n<br>\r\nAn owl hooted, the sudden sound igniting her sadness into a cold lattice of fear that ran up and out from her spine. She turned her head, wide-eyed, trying to see into the woods around her. With all the fog and no fairy lanterns to light the night, she couldn't see anything, least of all a path home. Nor could she make our from which direction she might have had come. Her shivering was starting to amplify with accumulating fear.<br>\r\n<br>\r\nMimi looked around, realizing that she was utterly lost, and-worse-lost in what was by any account a very frightening forest. The owl hooted again, now sounding closer. She knew that it had probably already heard her. If it caught sight of her, it would be her end. She tried to shrink down into her seat-the root she was sitting on made her feel uncomfortably over exposed.<br>\r\n<br>\r\nThen came the sound of something moving in the darkness. Not from above her as she had expected, the sound came from ground level, just beyond one of the larger roots radiating out of the same tree that bore the root on which she was sitting. Panic burst inside her like an unexpected blare of trumpets. With no time to consider what had made the sound, nor think through a best reaction, she sprung up and into flight, dashing away from whatever had made noise. She hurdled over a few clumps of grass, sprinted fast over a short distance, and then vaulted herself over the root of another tree. She bore left and dashed away from this tree's roots for fear of getting trapped in them. Across a clearing she ran, bounding over clumps of grass. Heavy footfalls behind her let her know that she was being pursued.<br>\r\n<br>\r\nIt was something big-a predator of some kind-not far behind, and gaining. She had mere moments to find some place to hide.</span></div></div>",
            "created":1352264400,
            "id":1463193,
            "title":"Mimi ventures into a forest, pondering on why s..."
        },
        "1111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "What are these eyes?"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nOn the other side of the clearing, Mimi tore deeper into the forest as fast as she could run, all the while diverting under small bushes trying to shake off whatever was pursuing her. A voice in her head told her that her only hope would be to run back to her village. But the voice's urgency panicked her, and she could not clearly guess which way would lead her there. She did not have enough time. Cold perspiration further chilled her in the wind. She could hear the horrid beast now bearing down on her. Unable to see well enough in the fog and darkness, she felt each fleeing footfall unsteadily  unfold beneath her. To trip and fall would surely mean a horrible death.<br>\r\n<br>\r\nThen she saw that she had come to another tree root as it swelled up on her left side. She was running almost parallel to it. She had to be heading toward the tree it came from, as it quickly became too thick for her to jump over.<br>\r\n<br>\r\nA moment later, her ultimate misfortune materialized before her as the root suddenly curved upward rapidly into the mist. Her path was closed off at the base of a tree where a similar root came in from, the right, and Mimi was stopped cold. The two roots drew together, forming a big 'V' as they met the tree trunk. Completely cornered, Mimi stopped and reeled around, to face the oncoming charge. In her last moment, she saw an awesome and terrible feline bearing down on her at top speed.<br>\r\n<br>\r\nBut the cat had not anticipated the sudden appearance of the tree trunk, and was still bounding at top speed. Instinctively, Mimi rolled back onto her backside and twisted her body to roll off to one side. With the cat clumsily trying to stop, her maneuver prevented the cat from crashing directly into her. Instead of crushing her, a stray hind leg knocked her solidly toward the deepest corner the two roots, the very point of the V they formed.<br>\r\n<br>\r\nWith a heavy thud, the sturdy tree abruptly halted the feline's momentum. Off-balance but unphased, the cat bounced off with a small, twisting aerial that allowed it quickly to recover its balance as well as bring its feet back into control. As it came down, it brought its two front paws, claws extended, down with the deadly and graceful accuracy of a seasoned predator. It landed right on the place where Mimi had just landed.<br>\r\n<br>\r\nBut, even though it should have been dead on target, it landed on nothing but uneven soil.<br>\r\n<br>\r\nThe cat immediately felt the mouth of a small hole under its two front claws. The hole at first dropped almost straight down but quickly curved to go under the base of the tree. With almost no delay, the cat jammed a paw deep into the hole, sweeping extended claws like gruesome daggers.<br>\r\n<br>\r\nInside the hole, Mimi had only a moment to recover from her lucky fall before a the backside of the cat's claw knocked her deeper into the hole. The claw swiped back at the spot where she had just been, and then thrust deeper into the hole, coming right at her. She jumped back as it came at her, and now found her back against the dirt at the hole's deepest end. The claw swished horrifyingly closer to her as she squeezed herself against the wall, clutching at exposed roots that poked out of it. To no avail, she tried somehow to pull herself even closer to the back wall and perhaps out of range of her deadly assailant.<br>\r\n<br>\r\nA couple sturdy roots hung from the ceiling, allowing Mimi to hoist her torso up toward the ceiling as she walked her feet up the back wall she had pressed up against a moment before. The angle of her position had briefly given her some safety, as the cat's claw swiped just below her now. Already she felt her muscles burning. She had only a short time before her arms would give out. Somehow she had to outlast the interest of the determined cat outside.<br>\r\n<br>\r\nHer eyes had adjusted a little to the increased darkness in the hole. She could now see that the hole widened a little bit more than she had noticed. She quickly scanned for corner that might allow her to duck still deeper to better avoid the cat's terrifying and determined claw. Then, to her utter surprise, right below her, she made out the form of a confused little mouse, frozen in terror. How had it managed to avoid the cat's claw this far? The mouse gaped at the claw as it again swiped back and forth, and then the shaking creature looked up at Mimi suspended above him, unsure of anything that was happening in his little hole.<br>\r\n<br>\r\nAs the mouse's eyes locked on Mimi's, the cat's paw thrust a little deeper. A single claw hooked the mouse by the skin of its belly and yanked back abruptly. The mouse dug in to resist, and for a brief moment, his loose, furry skin was pulled so as to stretch away from one side of the his body as it became tighter around the other. Then the mouse lost grip and was flicked an inch or two forward. The cat was an expert, and quickly used the split-second advantage to sink two more claws into the flesh beneath the mouse's fur. With the better grip, the cat dragged the mouse out of the hole as Mimi watched in terror. The mouse squealed, tearing vainly at the cave walls as the claw dragged him backward. Then, he disappeared up the hole.<br>\r\n<br>\r\nAlthough panic and adrenalin inundated her mind, Mimi still sighed with hesitant relief. She realized that she might have just survived entirely because that mouse had just gone to its death.<br>\r\n<br>\r\nThen, a scuffle outside the hole. The mouse, torn and bloody, came scrambling desperately back down into the hole. Mimi gasped in suddenly re-newed horror as, the cat's paw plunged so fast after the mouse that it knocked the mouse forward and against the wall just below where Mimi's feet were starting to lose their hold. The impact's resonance was just enough to tip the scale. Mimi fell, but when she landed, it was not on the mouse, but on the backside of the cat's paw. The cat had buried a few claws back into the mouse, and now it pulled the mouse out so forcefully, that it went directly under her, spinning Mimi around a to land with her back to the floor.<br>\r\n<br>\r\nThe cat must have felt her. There was no way it couldn't have.<br>\r\n<br>\r\nBut instead of the claw returning to pull her out too, she heard a crunch that suddenly stopped the mouse's shrill cries, followed by another blood curdling sound of a vertebrae-cracking death-bite. The sound caused a terror in her as though the floor had just given away beneath her. The absolute panic was ringing in her ear as her heart raced unstoppably. Had she heard the cat's footsteps as it trotted away. Had she?<br>\r\n<br>\r\nDeep in the hole, Mimi cowered, shaking uncontrollably with fright. Her mind raced as fast as her pounding heart. Her thoughts went over it again and again. She had defied the rule that said never to leave the fairy-lit safety of the village after nightfall. What other terrors would befall her in this terrifying place? With hours to go before dawn would come, each moment passed with agonizing resistance.<br>\r\n<br>\r\nAfter a long while, when she had finally caught her breath, she peeled her terrified eyes away from the mouth of the hole. She slowly scanned the darkness all around her. And then she looked upwards, and her eyes widened with horror renewed. A chill sucked any remaining warmth from her body.<br>\r\n<br>\r\nAbove her, in the darkness, dozens of glowing eyes of various sizes gazed down at her. </span></div></div>",
            "created":1352264400,
            "id":1463195,
            "title":"Mimi finds a place to hide"
        },
        "11111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "She eats it",
                "She leaves the mushrooms be"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 3: Fire in the Hole<br>\r\n[The management is pleased to report that our corrective actions are underway, and there is now at least one creature stuffing its belly in this scene.]<br>\r\n<br>\r\nAs the scattered flock of Mimi's senses one by one came back to roost, her fear subsided. She looked at the glowing yellow eyes more carefully, and felt growing doubt about what she had originally thought them to be. Perhaps tonight's endless bouts of fear had her on edge, and were now playing on her mind. Whatever the strange, dim lights were, they were much too near to her to be eyes. They were...something else.<br>\r\n<br>\r\nShe bent forward a little to move her face a little closer, peering into the darkness to try to see exactly what they were. They seemed to bobble and swirl until she focused on one of them. Then, that one didn't move at all—yet all the others around it seemed to swirl like a swarm of tiny fireflies. The overall effect caused Mimi's perception to discombobulate as her eyes completely lost perspective in the twinkling churn.<br>\r\n<br>\r\nShe closed her eyes and shook her head, bringing the rest of her surroundings back into focus. Mimi drew further in to inspect in close detail. They had a dark outline, a faint, brownish silhouette around them. As she perceived it, it started to take shape, protruding from the wall of the cave. There was familiar structure supporting the tiny yellow lights. Dropping from the ceiling were thick stems, with dome-like caps on them. They were...<br>\r\n<br>\r\n“Mushrooms?” wondered Mimi aloud. Hearing her own voice so suddenly startled her a little, but it also soothed her nerves a little. It sounded calmly quizzical.<br>\r\n<br>\r\nNow that her senses had assembled the shapes into something recognizable, she could see that indeed they were mushrooms. But they were no kind of mushroom that Mimi had ever seen. Brown with spongy, blue caps? No problem. Thread-like stems with a bright red, round cap that floats away skyward when detached? Everyday occurrence. (In fact they tied them to the handles of their harvest baskets to ease their  loads.) Large enough to hollow out and make into a sizable home? Absolutely. Iridescent and making a humming sound? Even that wasn't so peculiar. But a mushroom that grows upside-down on the roof of a cave, and has glowing yellow spots? Unheard of. Preposterous. Unthinkable!<br>\r\n<br>\r\nBut...there they were, hanging from the ceiling in a small cluster of only a few dozen. Upside down, the fat, round caps looked all wrong to Mimi. Their sturdy stems bent away from each other as if each cap was jostling for elbow room. They were an odd dusky color that made them barely visible in the poor light. And upon them, faintly glowing spots of various sizes seemed to dance about. They were like nothing ever before seen.<br>\r\n<br>\r\nMimi continued to study the peculiar toadstools, gazing into them dreamily with wildly dilated eyes. Why did they hang upside down so? Was it normal for this type of mushroom? And how did they cling from the ceiling like that?<br>\r\n<br>\r\nShe lifted a hand to brush away some dirt from one of the caps. As she did, a slimy outer film tore away and peeled back. Where it had been now glowed a soft, golden light.<br>\r\n<br>\r\nMimi peeled away some more of the outer layer. Soon the whole cap glowed warmly. Warmly? Yes, it even felt to be radiating a small amount of heat. Was it?<br>\r\n<br>\r\nOne by one, Mimi peeled away the same dark filmy material from the other mushrooms. It sloughed off readily, and gooey globs fell from Mimi's hands to splat on the floor wetly. With each new cap that Mimi exposed, the dim light illuminated the little mouse hole just a little more until it was as though a lantern hung from the hole's ceiling. The glow warmed the place nicely, and soon Mimi's heavy shivering had completely stopped.<br>\r\n<br>\r\nWith the chill leaving her bones, so went any residual fear leftover from the horrible incident with the cat. It still shocked her, but she felt relief that it had apparently gone away. Now she had what seemed a warm, relatively safe place to hunker down until the morning came. Her gaze settled back on the dreamily glowing mushrooms as she basked in their warmth. Perhaps the fog would clear, and she could find her way back home.<br>\r\n<br>\r\nSoon, Mimi became a touch hungry. At first, she didn't recognize the faint feeling. But as the sensation increased and she realized what it was, she grew skeptical about the feeling's authenticity. Mimi knew that physical exertion sometimes caused her to hunger. When it did she relished the feeling. To feel the deep craving of wanting to eat—to feel it as urgently as any of her friends and other villagers ever did—made her feel like she was...normal. But on these instances, the intense urgency evaporated when she took her first few bites of food. Time and again, all it would turn out to be was just a temporary sensation, a fleeting moment. Still, it was a powerful feeling while it lasted.<br>\r\n<br>\r\n“Wow! Am I ever hungry?” she mused to herself. Even if not convinced of its sincerity, She  still loved the feeling.<br>\r\n<br>\r\nHer eyes re-focused, landing on the glowing mushrooms with a speculative air about them. Her brow furrowed and she mulled her options to herself aloud.<br>\r\n<br>\r\n“I really should not eat those. They're keeping it warm in here.” she reasoned to herself. “I have to resist the temptation. It's just hunger, after all. It's not like it takes much to make it go away.”<br>\r\n<br>\r\nShe thought on it some more.<br>\r\n<br>\r\n“But then, if it only takes a little for me to fill myself, then surely I won't eat all of them.”<br>\r\n<br>\r\nThinking it further, she rationalized even more.<br>\r\n<br>\r\n“I couldn't eat that many mushrooms, even if I wanted to. It would be no problem for someone like Katya, but I could never.”<br>\r\n<br>\r\nSummoning this thought of Katya, brief though it was, caused Mimi's mind to spiral downward like a plane shot out of the sky. She was back to stewing about how harshly Katya had treated her that evening. Katya had even had the nerve to take mushrooms directly from Mimi's basket and munch them right there in Mimi's face! But that whole business of pushing her huge belly onto Mimi while taunting her about how it was so huge, well on that one Katya had gone way over the line. Mimi felt her emotions heating rapidly.<br>\r\n<br>\r\nIn fact, Katya's actions that evening weren't just playfully teasing anymore. She had been just plain cruel.<br>\r\n<br>\r\n“Ooh! When I get back, I'm really going to let her have it,” Mimi said to herself in a harsh whisper.<br>\r\n<br>\r\nBut, then, what exactly would she do to Katya? She knew she would never really do anything. They were friends. And besides, right now, Mimi mostly just wanted to go home. To see Katya would mean that she had survived her perilous night in the woods. The thought cause her now to long to see Katya's face, despite all the harsh castigations she had expended on Mimi. Still, while Mimi knew that she loved her friend Katya, there was a place in her mind where she still mused about various ways she might serve Katya her just desserts.<br>\r\n<br>\r\nAs Mimi forlornly stewed about her treatment at the hands of Katya, she absently reached a finger up the the clump of mushrooms and plucked a glowing piece from one. It broke off into her hand with the least of effort. Turning it around for inspection, she absently considered it. It felt almost weightless, yet it seemed solid. It's steady glow also suggested that the material would be seem much more substantial.<br>\r\n<br>\r\nMimi gave it a sniff and paused to consider. She looked to one side, but her expression remained preoccupied with her olfactory evaluation of the queer chunk of mushroom.</span></div></div>",
            "created":1352327700,
            "id":1463199,
            "title":"What are these eyes?"
        },
        "111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Eat more?",
                "Let's get out of here!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\nAfter sniffing it a second time, she delicately nibbled an extremely tiny bit from one small corner.<br>\r\n<br>\r\nInstantly, her mouth flooded with a sweet, nutty flavor—just from the one tiny nibble she had taken.<br>\r\n<br>\r\nChomp! Mimi bit into the piece still in her hand, taking at least half of it in this single bite. The delicious taste coated her whole mouth, seeming to permeate its roof, flowing through her teeth, parading triumphantly over her tongue. So intense was the flavor that it felt like it was melding into her. She felt herself become the intense flavor. And as the rush of savory joy slowly abated, she found that her mouth craved more. A lot more.<br>\r\n<br>\r\nPut shortly, it was the single most delicious mushroom she had ever tasted.<br>\r\n<br>\r\nSwallow. Chomp. Swallow again. The second half of the little piece was gone.<br>\r\n<br>\r\nWithout the slightest further thought, she grabbed the remainder of the mushroom and steadily munched it down over the next couple minutes, all the while regarding it's potent flavor in deep consideration. No food had ever tasted so good to Mimi ever before. So intense was the taste of this mushroom that she realized that nothing she had ever eaten before had actually ever had any flavor to it at all. Could it be that all this time she had simply been unable to taste any of the food she had eaten? Had she now finally found something that she could taste, something she could eat?<br>\r\n<br>\r\nMimi thought it through as she plucked down another of the scrumptious mushrooms from the ceiling. This time it was a big one, with a thick stem and a broad cap. She wasted little time in gobbling it up.<br>\r\n<br>\r\nReaching to get another one, she realized that there was a problem with her newly formed 'uniquely flavorful' hypothesis. It didn't really make sense. How could it be just these mushrooms that she could taste. She had never seen them anywhere before, so their kind must be extremely rare. And since she had no practical idea of where she was at the moment, how would she ever re-find them again? It was not practical that these were the only mushrooms she could eat. The hypothesis just wouldn't do.<br>\r\n<br>\r\nShe plucked down another fat toadstool and continued thinking as she rapidly munched it down. She realized that she needed to take into account that after eating one of these big toadstools, she was still hungry. That seemed to need to be factored into her thinking. In fact, after eating two—what was this, her third?—she hardly felt sated at all.<br>\r\n<br>\r\nShe looked at the half-eaten, third mushroom in her hand. Maybe these mushrooms had somehow cured her? She scarfed the mushroom down in big chunks, greedily gulping down each huge bite.<br>\r\n<br>\r\nWith one hand she assessed her belly and was thrilled with what she found. Her eyes fell upon her midriff where they found a belly bulging outward pleasantly. The three big mushrooms had swelled her tummy into a nice round curve. Nothing for a normal nymph to write home about, but at least its something, she thought as she pushed an entire fourth mushroom firmly into her mouth. With cheeks bulging she firmly closed her mouth, forcing the overstuffed contents back into her throat in a huge, squishy ball, which is how it slid—bizarrely—down her throat.<br>\r\n<br>\r\nDeep satisfaction inundated her, and washed away slowly. A moment later, Mimi started to understand what had just happened. Taken aback by had just transpired, Had she really just swallowed that entire fourth mushroom? Bewildered, Mimi raised her hands to her mouth in frightened amazement.<br>\r\n<br>\r\nHer hands were faintly glowing.<br>\r\nShe raised them up from her belly and held them before her face. They had a powdery substance all over them, causing them to glow like the mushrooms. They were particularly bright at the fingertips, where the dust was thickest. Her focus shifted to one hand while the other hand reached up to pluck down yet another mushroom and bring it to her lips. This one she munched in steady bites as she stared into her palm's ghostly glow.<br>\r\n<br>\r\nShe watched her empty palm absently as it reached up for yet another. She watched her her grip fumble, and watched it fall from her hand, tracing its course to the floor like a sunward-bound comet. When the falling mushroom hit the floor, it bounced up in a somersault, spraying a small cloud of glowing spores through the air along it's arching path. Mimi stooped and caught it off the bounce gracefully, despite resistance from her newfound waistline, The trail of spores stirred into a cloud of sparkling, golden chaos. Dazzled by the spectacle, Mimi devoured the mushroom in huge bites, while the twinkling spores slowly settled all around the lower walls and floor of the little hole.<br>\r\n<br>\r\nMimi looked down at her belly again. She had eaten a couple more mushrooms and the effect on her midsection was noticeable. She inhaled with a big smile of delight. “I have a belly!” she said to herself in disbelief, patting the sides of its upper slopes.<br>\r\n<br>\r\nHer hands settled on it, palms tracing over the bulging dome's girth, assessing the wonderful contour that protruded out from just below her ribcage, stretched around the mass of glowing mushrooms she had eaten. Her newly-discovered waistline bulged outward, round and proud, as if she had gulped down a big, round ball. It felt wonderful in her hands. Soon, enough powdery spores had rubbed off of her hands onto her belly until it shone with a faint glow of its own.<br>\r\n<br>\r\nOne hand continued attending to her swelling midsection as she plucked yet another mushroom from the ceiling and ate of it blissfully. As she finished one mushroom, her hands traded places, one reaching up in pursuit of the next mushroom, while the other continued to rub her growing belly.<br>\r\n<br>\r\nPulling down a particularly large one, Mimi thought about the powerful gulp she had used to vanquish the fourth she had eaten. This one now being her tenth, she wondered about trying it again. She crammed the huge thing into her mouth, squishing its spongy body until at last she could start to close her lips around the whole thing. It begrudgingly pushed backward into her throat. Mimi could feel her throat open up for the huge mass, almost as if she had complete control of its steady progress into her esophagus. As it pushed downward into her throat, she gulped powerfully to force it down into her belly. She felt the huge mass stretch her body unnaturally the whole way down. But the swallowing action came so naturally to her that she almost under-appreciated its potential power. The massive gulp now subsided from her throat into her belly, allowing Mimi now to look down and see the last of it now distending her belly outward. To see her belly, already larger than it had ever been, grow even larger right before her eyes caused Mimi to grin ecstatically.<br>\r\n<br>\r\nShe took a somewhat smaller one and gulped it down the same way. And so, one by one, the mushrooms decreased in number. Within a short period Mimi had made quick work of the entire clump. She gazed at the place on the ceiling from where the mushrooms had once emerged. They were all gone now, and in the faint glow she could not even see the point at which they had been anchored to the ceiling.<br>\r\n<br>\r\nBoth her hands caressed her belly, assessing the huge curve it now formed. Big as it now was, it was nothing close to the size that Katya's or Cassia's bellies had been. She knew that they would still chide her about it. If only there were more of these delicious mushrooms to eat, she thought.<br>\r\n<br>\r\nWatching the faint light on the ceiling shift as her hands moved she realized that something was amiss. If she had eaten all the mushrooms, why was there still this much light? She looked down to where her huge abdomen bulged out from below her shirt to see that her belly was now glowing much brighter than her hands, now casting warm light through her tautly stretched flesh.<br>\r\n<br>\r\nThen she noticed that all around her, where earlier she had clumsily scattered scintillating spores about when she had dropped a mushroom, there were mushrooms growing. Wherever the spores had settled, small, dusky colored mushrooms were quickly growing larger. A few already had the glowing spots that she had first thought to be eyes. </span></div></div>",
            "created":1352327820,
            "id":1463202,
            "title":"She eats it"
        },
        "1111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Continue eating",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 4: A Light Meal<br>\r\n<br>\r\nMimi's hands stopped rubbing her delightfully rounded belly and stared down at the new crop of mushrooms beneath her. The grove spread all around her and the glowing pinpricks pulsed and swam in hypnotic Brownian motion. The bizarre effect quickly caused her to feel dizzy, and she dropped to her knees and paused for a moment. Her head rolled and she could not take her eyes from the wild light show going on around her. Even in the new position she still felt dizzy, so she bent her knees back and lowered herself until she was sitting on her feet and her firmly-packed tummy pressed slightly against the uppermost part of her well-toned thighs.<br>\r\n<br>\r\nFor a few moments, Mimi continued watching the dazzling display with an unfocused stare. Then her focus came back, both visually and mentally. She realized that she could see the mushrooms actually maturing to full size right before her. They were visibly growing! All around, what had been so many small clumps were popping open their round caps in enlarging bunches, each one jostling the others for space. \"Such strange mushrooms these were,\" she thought to herself vaguely, \"growing so quickly.\"<br>\r\n<br>\r\nShe reached a hand out and touched one, sloughing off it's filmy outer layer and exposing its bright, warm light. It was such a pleasing revelation that then, almost without thinking about it, her hand gently swept over others, moving as if in slow motion to delicately shed the skin off each one. Soon, her belly was dimmed by comparison, and the hole was completely bathed in their bright glow. There were must have been several dozen of them in the various clumps, and each was now its plump, full size.<br>\r\n<br>\r\nFor the first time in almost a week, a beautiful smile graced the lines of Mimi's darling face. Dimples formed in her cheeks and her eyes became down-turned crescents of joy. Her nicely rounded belly full of mushrooms warmed her pleasantly, but her appetite had in no way abated. She reveled with the thought that these clumps of newly-grown, beautiful mushrooms that were all around her feet were hers to enjoy all alone. They were going to go to a very good cause.<br>\r\n<br>\r\nMimi beamed back at her luminous little bulge. With the mass of mushrooms solidly packed inside it, it swelled Mimi's waistline further out than it ever had ever been. True, it was still nowhere even close to the huge tummy Katya had so aggressively pressed against Mimi just a few hours before...but Mimi finally felt the wonderful sensation that her friends were always going on about. A well rounded belly really did feel good! She even felt the rush of pride that her girlfriends seem to always get over having their bellies crammed so full, and this made her smile even more.<br>\r\n<br>\r\nBut the smile started weakened as she thought again about how much bigger Katya's belly really had been. Mimi knew that her belly was really not that large...not at all. Her envious thoughts quickly turned to disparage herself for taking pride in what was really such a minuscule tummy bulge. If Katya were there, she would laugh at it, and maybe even start to devour Mimi's hard-won trove of mysterious fungi. She would eat every last one of these mushrooms, stuffing herself to twice Mimi's current size in no time. The thought played so vividly in Mimi's mind that she could almost hear Katya's voice mocking her.<br>\r\n<br>\r\n\"You call that a full belly? As if! That's more like a just-had-a-couple-appetizers-before-dinner belly, if you asked me. Now this!\" And Mimi envisioned Katya patting her enormously stuffed abdomen with overbearing pride. \"This...is a belly! See how it pushes outward from directly below my ribcage?\" Katya cupped her hands over her huge breasts, squashing them a little as she lifted, and then tapped the top of her belly twice with an extended left pinky, calling attention to how it came out of her torso almost perpendicularly, forming a huge, curved shelf. \"See how wide it swells out on either side?\" And her hands flew to the sides of her belly, allowing her breasts to settle heavily back into position. She squeezed her huge tummy as she swayed it from side to side so Mimi could fully appreciate its broad proportions. \"And I couldn't even think about having my knees together while sitting on my feet like that, Mimi. Let's face it, you're just no good at stuffing. You could never stuff yourself like this!\"<br>\r\n<br>\r\nThis time for emphasis, Katya pushed her monstrous tummy way out, and Mimi saw that Katya's belly was so large that its huge mass was forcing her her spine to arch backward slightly. Katya had eaten so much that it was contorting the very mechanics of her body. She must have had devoured several pounds of Mimi's special mushrooms to get this way. Indeed, Katya's enormous belly was glowing brightly. Her hands were dusted heavily with their bright spores, and all around her sexy, full lips, Katya's face was covered in the luminescent dust.<br>\r\n<br>\r\nMimi clenched her jaw defiantly. \"No!\"<br>\r\n<br>\r\nThe vision of Katya evaporated in an instant and Mimi was back in the mushroom-filled hole. Determination cleared her fogged mind. The only way ever to get Katya to back down would be to match her pound for pound, inch for inch. Mimi knew that she would somehow have to do it. She surveyed the crowded floor again. All around her were the clumps of fat, glowing mushrooms. Could she eat many more of them? Could she eat all of them? It was time to find out.<br>\r\n<br>\r\nShe bent over, spreading her knees to apart as she did to allow her little belly to push between her long slender legs. Then she quickly snatched one, then another. Her right hand raced the first toward her face, pushing the first deep into her mouth where her throat could swallow it down with the same powerful gulp as before. The second followed immediately after.<br>\r\n<br>\r\nBecoming frantic, she gobbled down the other six in the cluster, gulping them down in rapid succession. Feeling desperate to eat them in case Katya really arrived, she quickly started on the next clump, sometimes slowing into just taking huge bites so that she could briefly gasp for breath between the humongous swallowing feats that she was performing. As each one pushed its way into her belly, the girth of her bulbous middle pushed her legs a little further apart.<br>\r\n<br>\r\nFinishing one, she moved to the next clump and started working it in twos. Each pair disappeared in quick succession, as Mimi quickly power-swallowed them all down. Her belly increased in time with each gulp, growing quickly enough that she soon felt it pressing against the floor as she crawled on hands and wide-spread knees over to the next big bunch of her delicious prey.<br>\r\n<br>\r\nShe ate so ravenously that she could not keep track of how many mushrooms she had gulped down in this clump. One. Two. Three, four. Five-six-seven. Then she realized that she had packed two of them into her mouth at once. Her cheeks bulged as she tried to chew them at least a little before gulping them down.<br>\r\n<br>\r\nHer predicament made her pause uncertainly only for a moment. She sat up again, knees pushed apart now by a much, much larger mass of tummy. Then, she mustered her strength, pulled in her cheeks and swallowed as hard as she could. The huge mass felt as though it would rip her open as she strained to force the whole wad of it all down her throat at once. It pained her as her neck thickened bizarrely with its mass. The tight pressure of passing through her throat caused the mass to elongated as the mass progressed through her esophagus. It pushed into her belly just as the other end passed through her tonsils into her distended throat. As soon as she could move her chin, she looked down to her brightly glowing belly as the new mass increased its already huge diameter.<br>\r\n<br>\r\n\"Uuuuhhhhh,\" Mimi sighed deeply, panting and trying to get her breath for several seconds. When the pain of the act subsided, she looked down at the huge belly and a thrill came over her. No one from the village would ever believe it was her. She had never eaten like this before. Never had she gotten her belly to such respectable dimensions. It felt...amazing.<br>\r\n<br>\r\nEven with her knees this wide apart, holding as best she could the same position in which she had sat when feeling dizzy, her belly now dominated her lap so completely that she could not see her thighs under it. It swelled out from below her over-sized breasts magnificently, like a big, glowing balloon. It swelled a little more as she absentmindedly finished swallowing another mushroom that she had casually picked up from the same clump she had last been working on. Was that nine or ten, then?<br>\r\n<br>\r\nMimi ran a hand down the perimeter of her belly, this time assessing it with purpose. It was still not as big as Katya's. Close...but in this game, close meant nothing. Mimi eyed the remaining clumps of mushrooms deviously. While perhaps some concern over her newfound appetite was warranted, she knew that if these were the only kind of mushroom she could eat, then this might be the one and only chance to ever match Katya.</span></div></div>",
            "created":1352327880,
            "id":1463204,
            "title":"Eat more?"
        },
        "11111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "She wakes up"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nAiming toward the next clump, Mimi leaned forward, dropping back onto her hands and knees. Her belly pressed heavily into the ground beneath her, pressing her huge bosom up toward her glowing chin. She straightened her arms, relieving the pressure, but found that her her arms and knees were almost not long enough any more, and her belly rubbed on the floor awkwardly as she did. Mimi brought her pretty face down toward the next somewhat smaller clump, causing her mane of chestnut hair to drape around it. Up close to the mushrooms' glow, her green eyes glowed with fiery zeal. She eased her weight from one arm, allowing her belly to support her. Now that her hand was free, it began hauling lovely mushrooms into her voracious mouth. In moments the whole clump was no more.<br>\r\n<br>\r\nThe next clump was somewhat larger than the last-maybe eleven or twelve healthy specimens-but it was no match for a wood nymph on a mushroom binge. Moments later Mimi turned to the final clump. It was back behind her, and her belly now resisted her efforts at locomotion. To move at all, she had to extend her knees slightly and push off with her feet a little while holding her arms straight, scooting her giant gut in little frog-like hops. But Mimi relished the extra effort, remembering how Katya sometimes would fill herself until she could not even move for a day or two.<br>\r\n<br>\r\nThe final clump was quickly gone, too, with its mass now contributing to Mimi's tremendous girth. Exhausted, Mimi tried to roll onto her back to rest, but found that when she tried, she was stopped short by the walls of the hole. The obstruction's abrupt halt left her laying on her side, with her thin brow line furrowed in momentary frustration.<br>\r\n<br>\r\nHer frustration turned quickly into curiosity when she noticed that this position allowed her to look up the passage by which she had fallen into the hole, it's dark channel leading up and out into the fearsome night. She could see that it narrowed a bit as it curved upward. No light came in from outside yet, though, so she still could not leave her safe little haven. Studying the path by which she would have to make her eventual exit, she noticed the familiar swirling pinpricks of light. There, lining part of the passage out, she had somehow missed five or six bulging clumps of large, succulent mushrooms.<br>\r\n<br>\r\nShe wondered how she could have missed them. Perhaps their faint glow had been overwhelmed by the brightness of so many exposed clumps below. Or, maybe by her belly, which was only now beginning to dim. She shimmied herself toward them, squirming into a position that sat her so that she was slightly reclined from upright, her back against the inclined dirt wall and her head pushed into the narrowing tunnel. The top of her belly lightly brushed against the sides of the hole below her. Somewhere down there, she felt its girth spreading her bent knees far apart, pushing them against the soft soil on either side.<br>\r\n<br>\r\nNow closer to her most recently discovered mushrooms, Mimi's heavy-lidded green eyes watched the tiny lights madly spinning around. She fell into a warm, sated, deep trance. Her thoughts slowed and became ethereal. Her mind was soaked in a singular thought: \"beauty...\" Absently, she reached out her hand and slowly peeled away their slick outer skin.<br>\r\n<br>\r\nThe swirling lights now gone, bright caps glowed before her. She still felt hungry, but also felt deep exhaustion. Mimi began munching down these last four big bunches much more slowly, almost drifting into sleep as she ate them, taking actual bites for once, and struggling a bit to swallow. As she progressed through them, she could feel the irregularly shaped dirt walls of the hole below her press against her belly more snugly. Still she continued drowsily munching away.<br>\r\n<br>\r\nBy the time she finished the last of the last, sleep was upon her. The tight walls hugging her belly now held her fast in place. She wedged a hand under one of her breasts-which seemed now even larger, and rounder-and caressed her the top of her bulbous tummy from where it pushed out from her torso to the point where it met snugly with the wall of the hole. It was now very, very large. Maybe as large as Katya's? Maybe, or maybe not...but it sure felt good<br>\r\n<br>\r\n\"Mmmmmm....I'm still pretty hungry,\" Mimi mused aloud in a dreamy-sounding whisper. \"What do you think of that, Katya?\" Shortly thereafter, Mimi drifted off into sleep. </span></div></div>",
            "created":1352327940,
            "id":1463206,
            "title":"Continue eating"
        },
        "111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "She meets another wood nymph",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 5: A Meal on the Way Home<br>\r\n<br>\r\nWhen Mimi awoke, she could see pale light at the mouth of the hole. Despite having stuffed herself like never before, she was pleased to find that she still felt hungry. Extremely hungry, in fact. Grabbing a protruding root, she tried to pull herself toward the hole's mouth and daylight. She wriggled with effort, towing herself forward and feeling the cave walls snugly squeeze the girth of her belly as she pulled.<br>\r\n<br>\r\nMimi's mane of chestnut hair finally poked up out of the hole, and she saw the giant tree's  buttressing roots radiating outward from the trunk as they became shorter and shorter until finally they submerged into the humus of the forest floor. The air was still somewhat chilly, but the fog was much thinner and the day felt as if the sun would burn through at any moment. Seeing this brightening world warmed Mimi and she smiled broadly. It felt so much safer than the night before, and inside her bloomed a confidence that she would find her way back home.<br>\r\n<br>\r\nShe wriggled forward, pulling up with her arms until her shoulders appeared. Then she adjusted and squared her elbows in order to she pushed against the ground, bringing her ample busom into view. Then her belly began to emerge from the constraining tunnel. It to bulged outward from the mouth of the hole, rounding as more and more of it came out. It had stopped glowing, but it was far larger than when Mimi had last seen it.<br>\r\n<br>\r\nWhen she got about half way out, her girth would not allow her arms any more leverage, which momentarily stopped her progress. Somewhere in the hole below her, Mimi's strong legs scrambled to find a purchase. Pushing off of the walls rhythmically, she rocked first left, then right, and eventually shimmied the rest of her hulking abdomen out from its confines. When she popped free, she collapsed backward, feeling overexerted. Her legs were bent at the knees, still dangling into the hole. Her huge belly, swollen like she was some kind of comical balloon, pushed down the waistband of her forest green trousers and rose up from her hips to form a great dome. Up to its apex at her navel it rose, and then sloped steeply back down to meet the base of her ribcage. Her moss-colored half-shirt seemed to stretch more tightly over her perfectly rounded bosom, heaving with exhaustion. As she slowly caught her breath, her belly moved with the rhythm of her panting.<br>\r\n<br>\r\n“Ugh...so tired,” Mimi moaned, feeling the weight of her belly shift pleasantly with her sigh.<br>\r\n<br>\r\n“So...hungry, too,” Mimi marveled to herself. She looked down at her huge abdomen, surveying its swell with newfound delight. “Oh, Katya, you aren't going to believe this!” Mimi beamed her brilliant smile, white teeth gleaming in the morning light. She felt eager to get back home and show off her huge belly, perhaps fill it even further just to prove that she was at long last okay.<br>\r\n<br>\r\n“I'm still hungry!” she cheered happily, as she swung her feet out of the hole, rolled onto her belly and planted her feet on the firm ground. Bent over her massive belly, she used her arms to push her shoulders away from the ground. She spread her legs around her belly as it shifted beneath her and she leaned back into a squat. Finally she heaved herself up over her feet and stood. She did it all in a quick, fluid motion. For some reason, it came to her perfectly naturally, even though she had only seen it done by her happily gorged friends.<br>\r\n<br>\r\nNow standing with a slight backward tilt to counterbalance the cantilevered bulge before her, she mused that her belly might just be as rotund as any wood nymph's had ever been. This thought filled her heart with joy and a deep satisfaction. The fullness of it—its bulge completely eclipsing her legs below—caused Mimi no end of pleasure as she took her first step and felt its weight shift with her.<br>\r\n<br>\r\nAt first, walking while like this felt very foreign to her—a strangely disconnected experience. She could see the ground a little way before her, but she had no hope of seeing her feet. Each step required some faith that the ground she was stepping over was the same as she had seen a moment before. Soon she was moving along with a sprightly step, making her way back into the forest, an adventurous and well-stuffed wood nymph heading for home.<br>\r\n<br>\r\nHer path took her beneath gigantic, gnarled trees that imposed ominous, dark shade in the  morning light. Mimi pressed on, seemingly unconcerned about their imposing gloom. Her mind was on other things, her hawkish eyes scanning for a small grove of mushrooms, or whatever else could slake the growing hunger in her belly.<br>\r\n<br>\r\n“I'm going to need more than just a couple mushrooms,” she said to herself as her belly growled audibly. “Morels would be delicious,” she thought. Shitakes...now that was an absolutely scrumptious proposition. “I just want to eat and eat,” Mimi thought to herself as she lumbered along. “Katya, you're really never going to believe how much I can eat. I'll just have to show you.”<br>\r\n<br>\r\nOff Mimi wandered, uncertain of which way to go or what time it was. She simply continued going downhill, remembering that when she stormed off from her village, she had kept going up. So down it was, through intermittent forest and glade. Over the course of a few hours, Mimi's belly compacted and tightened as she walked along, making the going progressively easier. This was, of course, a natural and necessary adaptation that all wood nymphs shared. Because they had to consume so much, their full bellies would naturally contract, increasing the density of their contents so that still more could be packed in. Soon Mimi's belly had contracted to a much more manageable size, causing Mimi to worry that it now appeared somewhat smaller than the size of Katya's the night before.<br>\r\n<br>\r\nIn a short while, the trees thinned and eventually nearly disappeared completely as sparse grass began to take over. Then the grass thickened and the trail became faint, eventually disappearing altogether into a broad grassy meadow opening up into a broad valley. Almost as if on cue, the last wisps of fog burned away and the sun shone brightly on the grass, glistening with dew.<br>\r\n<br>\r\nThe valley seemed vaguely familiar, and soon Mimi recognized where she was. It was one of the more distant spots where she and her friends occasionally went when harvesting closer to their village proved unfruitful. As the familiarity became certain, Mimi felt a thrill run through her. Although she was still a long way from home, at last she knew quite well where she was. “Home!” Mimi thought as her excitement grew. Soon she would see her friends, and might even find something to eat along the way. Setting course for home, her pace quickened and down the valley she went.<br>\r\n<br>\r\nA thought struck her, and she slowed abruptly. Remnants of last night's anger overtook her mind, as she remembered the grudge she bore. “On second thought, I absolutely have to find more to eat before I get back home. There's no way I can go home like this,” she said looking at her now-much-smaller belly with mild disgust. “This tummy has to be bigger than Katya's when I get back. I'll show her who can stuff herself!” Her tummy agreed with a sudden rumble. She continued at a slower pace down the valley, now scanning for a grove of mushrooms to devour before her homecoming.</span></div></div>",
            "created":1352328120,
            "id":1463208,
            "title":"She wakes up"
        },
        "1111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Sure!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\nFinally, off in the distance and much lower in the valley, just where a lone pair of evergreens reached their great bows skyward, Mimi saw something moving. It was another wood nymph, and she was harvesting mushrooms under the trees. And even though Mimi could not tell who it was yet, but she could see that whoever it was had something she wanted: some very full baskets of mushrooms.<br>\r\n<br>\r\nMimi bounded ahead, mouth watering with anticipation as her belly and breasts bounced heavily with her long strides. Who it was harvesting way out here mattered little to Mimi. She was going to eat every last morsel in those baskets.<br>\r\n<br>\r\nAs Mimi drew near, the busy nymph heard her approach and stood up from her stooped position. She turned to face Mimi, still holding a big, spongy clump of morels in one hand. The nymph was a quite small, with a slender frame. From an orange sun hat, straight, sandy-blond hair hung down to her shoulders, and watery-blue eyes opened wide with happy surprise as they recognized Mimi. Mimi recognized her, too. It was Missy, a diminutive little nymph that Mimi knew fairly well, although they were from different circles of friends. Missy was always very friendly, outgoing and cheerful, even if she was a little naïve (even for a nymph).<br>\r\n<br>\r\n“There you are, Mimi! Everyone's been looking for you. Thank goodness you're okay!” Missy then realized that having a hugely bulging tummy was a first for Mimi. “And look at you! You're finally eating!” Missy said cheerfully.<br>\r\n<br>\r\nMimi felt like that last part about “finally eating” was unnecessary, but she held her tongue out of interest in the mushrooms Missy had collected.<br>\r\n<br>\r\n“And, wow! That belly looks pretty full!” she said with a sing-song lilt as she stuck her own well-rounded belly outward and patted it to punctuate her statement. Tiny little Missy was so small that the orb her belly formed was but maybe a quarter the size of Mimi's.<br>\r\n<br>\r\nMimi drew up right before Missy, nearly bumping her with her big, protruding gut. Mimi stood a whole head taller than Missy, but Missy did not look up to Mimi's face. She was too busy gawking at Mimi's impressive belly. It wasn't that Missy had never seen one so large, it was just she had never seen Mimi with one at all. It heaved with Mimi's heavy breaths as Mimi cocked her head and leaned to one side to get a fuller view.<br>\r\n<br>\r\n“But not quite full enough, Missy,” Mimi replied, proudly rubbing her hands over her big belly to emphasize it's size. “I finally found my appetite...” she explained.<br>\r\n<br>\r\n“Well, I guess you did,” Missy agreed. “We were all so worried about you. Let's get you back to the village so others will stop looking.”<br>\r\n<br>\r\n“Okay, but can we first eat something, Missy. I'm so hungry!” Mimi said urgently, snatching the morels from Missy's hand and chomping off half the clump with a voracious bite.<br>\r\n<br>\r\n“Okay!” Missy said with playful enthusiasm. “I have about four baskets of morels here. I need to get most of them back to—” Missy was cut short by Mimi diving into the first of them with both hands, grabbing up big clumps and hauling them up to her mouth as she fell to her knees. With her belly pressed to the ground, Mimi proceeded to devour the mushrooms, barely chewing before gulping them down.<br>\r\n<br>\r\n“Mmmmfff...so hungry...” Mimi explained.<br>\r\n<br>\r\n“I can tell!” Missy said, stepping over to the same basket.<br>\r\n<br>\r\nMimi was ecstatic. Sure enough, the morels were every bit as delicious as she had always wanted them to be. Their taste compelled her onward. She craved them with a ferocity that she had never even dreamed of having for food. Down they went in such rapid gulps that it seemed that just one basket might not be enough.<br>\r\n<br>\r\nMissy reached in and pulled out a morel for herself. She ate it slowly as she watched Mimi devour the basket at an alarming rate. “I hope it's okay if I take it easy,” Missy said. “I just ate a little while ago,” she explained as she absently stroked her much smaller belly. Soon, the basket was empty, all of it stuffed into Mimi's big gut save for the clump of morels that Missy still nibbled gingerly.<br>\r\n<br>\r\n“Wow, Mimi, you really did find your appetite! That was amazing!” Missy told her as she stepped to another basket a few feet away. “Let me get you some more.”<br>\r\n<br>\r\nMissy used two hands to lift the heavy basket by its handles, and then waddled with her burden over to Mimi. Still on her knees, Mimi dove in before Missy could set it down, using one hand to rake mushrooms from the top of the basket into her mouth, then swallowing them down as fast as they came at her. Mimi's other hand pushed the underside of the basket so that it tilted toward and kept Missy from being able to setting it down. Missy held the basket there as Mimi greedily gulped down huge mouthfuls, hardly even chewing the delicious morels.<br>\r\n<br>\r\nAs the basket lightened in her arms, Missy tilted it further and watched in amazement as Mimi continued to pull more and more toward herself. Instead of slowing as her belly became more full, Mimi seemed to eat faster and faster, working her mouth around the bigger clumps and gulping them down whole. When the basket was almost half empty, Mimi leaned back on her bent knees, pulling the basket it toward her as her growing belly pushed outward beneath it. Now sitting sitting on her feet, Mimi leaned back and allowed her belly to support the basket which was now listing nearly to horizontal. Missy could now balance the basket with one hand, so she used the other to help supply more morels from the bottom of the basket to Mimi's endlessly hungry mouth.<br>\r\n<br>\r\nMimi gave up and allowed Missy to feed her altogether. She leaned further back so that the the basket tilted more and more, until she had to put her arms on the ground behind her to support herself. In this relaxed position and with Missy at her service, she could concentrate on her feeding technique. She gulped the delicious morels as fast as Missy could get them to her.<br>\r\n<br>\r\nWhen it came down the last big clump of morels, Missy picked it up and held it before Mimi for a moment. The empty basket fell to the ground while Missy turned her pretty face slightly sideways and gave Mimi a playfully stern look.<br>\r\n<br>\r\n“Okay, Mimi, that's it. I want to bring at least two baskets home.” Then Missy took the last morel clump and delicately pushed it into Mimi's waiting mouth. Mimi's lips closed around it more quickly than Missy had expected. The tips of two of her fingers hit Mimi's tonge and were momentarily closed in. Missy snapped her hand back quickly, pulling from Mimi's mouth just as Mimi gulped the big clump down.<br>\r\n<br>\r\n“Whoa, Mimi! Don't eat my fingers, too!” Missy said with a smile.<br>\r\n<br>\r\nMimi's eyes flashed with realization. As delicious as the morels were, that other flavor she had just tasted was nothing short of heavenly. That was Missy's fingers? Her belly rumbled again, but it wasn't morels it wanted. “Finally eating, indeed,” thought Mimi. A wicked inspiration struck her.<br>\r\n<br>\r\n“Can't I have just one more basket, Missy? Please? I'll help you collect another.”<br>\r\n<br>\r\n“You're still hungry, Mimi? Seriously!?” Missy was looking at the huge belly bulging before her. It pushed Mimi's knees apart at a right angle to each other and pressed upon the ground heavily. Missy wondered whether Mimi would even be able to walk. “You're positively huge. Can't you wait until we get back to the village?”<br>\r\n<br>\r\n“No,” said Mimi, forlornly looking at the ground beside her. “I'm finally hungry. What if it goes away and I don't ever get hungry again?”<br>\r\n<br>\r\n“Well, I don't know if that's really going to be a problem for you, Mimi,” Missy said, leaning forward and chiding Mimi by giving her massive belly a light pat. Mimi's mouth watered at Missy's touch. It was all she could do to keep herself from pouncing on and devouring slender little Missy and her bulbous tummy, but she knew that she had to play this one right.<br>\r\n<br>\r\n“Come on, Missy. I'm sooo hungry,” Mimi whined. As if on cue, her belly tremored with a loud growl.<br>\r\n<br>\r\n“Wow! You really are hungry. Who ever knew that you would get so good at stuffing yourself?” Missy said. “Anyway, why not? But you have to help me re-fill two baskets, Mimi. Okay?”<br>\r\n<br>\r\n“Of course,” Mimi lied.<br>\r\n<br>\r\nMissy pranced over to the third basket, then hauled it slowly back over to Mimi. Together, they hoisted it up onto Mimi's belly, and then Missy once again began stuffing morels from it into Mimi's gleeful mouth.<br>\r\n<br>\r\nMissy she mused aloud to Mimi: “I'm so glad you're alright, Mimi. Where were you anyway?”<br>\r\n<br>\r\n“Mmmmffff...more please...” Mimi said without answering.<br>\r\n<br>\r\n“Oh, yeah, sorry. I won't make you talk while you're eating,” Missy said. She started stuffing Mimi's mouth with greater quantity of morels.<br>\r\n<br>\r\n&gt;chomp&lt; &gt;gulp&lt;<br>\r\n<br>\r\n“I can see why you got so upset. I've never seen Katya so full before. She must have really overdone it, huh? But you can't blame her for being hungry just because you're not, you know?” Missy giggled a little, feeding Mimi yet another big clump. Two thirds of the basket's contents were gone already. “But you sure are hungry now, huh?”<br>\r\n<br>\r\n&gt;chomp&lt; &gt;chomp&lt; &gt;gulp&lt;<br>\r\n<br>\r\n“How do you swallow so much at once, anyway?” Missy asked as she stuffed Mimi's mouth full again.<br>\r\n<br>\r\n&gt;gulp&lt;<br>\r\n<br>\r\nMimi drew a breath.<br>\r\n<br>\r\n“I'm not sure,” said Mimi. “Let's see how much I can gulp at once, okay?”</span></div></div>",
            "created":1352328180,
            "id":1463211,
            "title":"She meets another wood nymph"
        },
        "11111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Perambelliation"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n“Sure, you tell me when,” Missy replied.<br>\r\n<br>\r\nWith a quarter of the basket left to go, Missy started packing Mimi's mouth with morels. Soon Mimi's cheeks were bulging out and she could not quite close her lips.<br>\r\n<br>\r\n“How's that? Enough?” Missy asked.<br>\r\n<br>\r\nMimi shook her head slightly, and Missy started to pack some more in causing Mimi's cheeks to bulge out freakishly. They continued to stretch as Missy stuffed still more in.<br>\r\n<br>\r\n“I don't think I can fit any more” she reported.<br>\r\n<br>\r\nMimi shook her head again, then lifted a hand from the ground and sharply pointed a finger inside the basket twice. Then she pointed at her mouth and gave the same indicating double-point. Her meaning was clear: she wanted all of it.<br>\r\n<br>\r\nMissy set to work, pushing another clump into Mimi's over-stuffed mouth. She pressed down hard, but there was simply no more room to pack it into. Then suddenly something happened to yield now plenty of space. Somehow, Mimi's jaw had come unhinged and dropped wide open, allowing Missy to pack in a whole lot more. Once again she pushed in huge handfuls until Mimi's mouth seemed full. As Missy crammed in more and more, Mimi's mouth still did not become full. Finally, Missy managed to stuff the very last clump from the basket into Mimi's massively overstuffed mouth and then leaned back to examine her work.<br>\r\n<br>\r\nIt was only then that Missy noticed that the mass of mushrooms had sunk down past the back of Mimi's mouth and into her throat. There, it caused her neck to bulge ominously. Between her unhinged jaw, tightly packed cheeks, and swollen neck, Mimi's head was strangely distorted. The mass of morels were constrained, roughly, to the shape of an upside-down pear, and it pushed the top of her head back so that her mouth pointed skyward.<br>\r\n<br>\r\nMimi slowly worked the mass in her mouth so that she could close her lips as the astonished Missy ran her fingers lightly around the mass in Mimi's neck in disbelief. Her fingers traced upward until she reached Mimi's face, and then cupped her hands with widespread fingers around Mimi's cheeks, assessing the incredible perimeter of their contents.<br>\r\n<br>\r\n“You really can swallow all that?” Missy asked in a whisper. Mimi thought about it uncertainly. They would soon know.<br>\r\n<br>\r\nMimi took Missy's wrists in her hands and held Missy's hands in place on her cheeks. Then, Mimi gulped suddenly. The massive load was sucked down from her cheeks, stretching its way through her throat until it entered her belly and swelled it outward measurably. Still holding Missy's wrists, Mimi's face was back to its normal, cherubic loveliness. Missy's delicate, pale fingers still pressed against her olive-colored cheeks.<br>\r\n<br>\r\nMimi replied, “Yep,” as if it had been no effort at all.<br>\r\n<br>\r\nMissy was dumbstruck by the seemingly impossible feat that she had just witnessed. Her mouth hung open and her baby-blue eyes were like saucers. Mimi took the opportunity to put some of the fingertips of Missy's left hand into her mouth. They tasted even more wonderful than before. Missy stared at her fingers as they passed through Mimi's lips and into her incredible mouth. She inserted her other hand to explore its wonders, as Mimi's tongue circled round the fingers of the first. Missy tasted so...so...so Missy. Wanting more, Mimi pressed Missy's fingers deeper and the flavor intensified.<br>\r\n<br>\r\n“How much more could you have swallowed?” Missy asked, her voice distant with wonder.<br>\r\n<br>\r\nMimi pulled Missy's hands out momentarily. “You taste so good!” Then she pushed Missy's whole hands into her mouth.<br>\r\n<br>\r\n“Mimi, what are you doing?” Missy asked with a slow realization that her hands might not be in so safe a place.<br>\r\n<br>\r\nMimi's teeth clamped down on Missy's hands firmly, and she grinned at Missy wickedly.<br>\r\n<br>\r\n“Mimi! Stop it!” Missy exclaimed, suddenly becoming worried. “Let go of me!”<br>\r\n<br>\r\nWith her mouth full of Missy's hands, it was hard but Missy understood the response: “I can't. You taste so good.”<br>\r\n<br>\r\n“Mimi! Cut it out!” cried Missy, trying to pull hands free.<br>\r\n<br>\r\nSuddenly, Mimi shoved Missy's hand deep into the back of her mouth, pressing them down into her throat. Feeling her wrists suddenly bound together by Mimi's throat, Missy inhaled in horror. Just as she started to struggle in panic, she felt Mimi's throat contract and a powerful suction wrenched her arms downward into Mimi's mouth. When she looked again, Mimi's lips were stretched around her elbows<br>\r\n<br>\r\nMissy gasped with pain, feeling her arms wrenched uncomfortably together. Blood-shot terror filled her blue eyes, and tears began to stream down her cheek. She wanted to use her legs to leverage herself free, but Mimi was hauling her up over that huge belly. It was all happening so quickly—she could only kick her legs as they trailed behind her. Her struggles only caused her sun hat to fall off of her head.<br>\r\n<br>\r\nNow Mimi's hands grabbed her shoulders and pulled her forward, as her throat contracted yet again. Suction pulled her arms down, and she felt her hands press into the soft and spongy mushrooms in Mimi's giant belly. Mimi's lips were sliding mercilessly toward her shoulders. Next Missy felt Mimi's hands on the back of her head and press her face down between her upper arms. Her legs kicked wildly as she felt the next gulp tow her hopelessly inward. Something wet and fleshy probed up from between her arms, licking her face. Then it was teasing over her neck and down her chest as she plunged down into Mimi's huge belly.<br>\r\n<br>\r\nSliding through the tight clutch of Mimi's throat, Missy wondered whether Mimi could really swallow her whole. Could Mimi actually swallow the bulge of her fully stuffed tummy? And how big would Mimi be when she was done?<br>\r\n<br>\r\nWith Missy now entering her belly, Mimi rolled herself forward and continued to power-swallow Missy into her belly in lurching gulps, her tongue lapping every delicious inch of Missy that passed over it. She could feel Missy's shoulders reaching her belly now, and the stretching from the added mass felt fantastic. But she faced something of a problem: Mimi's lips had reached Missy's bulging belly, and she was uncertain about whether she could handle the huge girth.<br>\r\n<br>\r\nGULP!<br>\r\n<br>\r\nNothing. Missy's progress had stopped. Her panicked legs still flailed a bit, but the strength of her kicks had faded considerably.<br>\r\n<br>\r\nGUULP!!!<br>\r\n<br>\r\nStill nothing. Mimi's reached forward and grabbed the waistband of Missy's trousers. The blue satin was hard to grip at first, but soon she managed to wrap it around her hands.  This time she pulled with all her might and swallowed as hard as she could.<br>\r\n<br>\r\nGUUUUULPP!!!<br>\r\n<br>\r\nMimi's arms bent at the elbows as she pulled Missy into her mouth. Missy's big abdomen squeezed through Mimi's lips and into er mouth, stretching it so wide that it hurt. But forward Missy did go, her belly elongating as it pressed its way through Mimi's throat. Finally, when the upper part of Missy's belly squeezed through the compressed narrow passage into Mimi's belly, the difference in pressure suddenly caused the contents of Missy's lower belly to flow forward, rapidly towing the lower half of her belly into Mimi's. Missy's legs, which had mostly stopped kicking, followed effortlessly.<br>\r\n<br>\r\nAlready enormous from having Missy's arms, head, shoulders and chest enter it, Mimi's belly  swelled outward with the addition of Mimi's legs and plump sphere of a belly. The feeling of becoming so enormous washed Mimi in waves of delight. Stretching out before her in a huge sphere, her belly was way far beyond any size she had achieved before. Missy had been every bit as delicious as Mimi had imagined.<br>\r\n<br>\r\nCatching her breath, Mimi dropped to her side to lay on the grass. Her huge, round belly sprawled before her, rocking and undulating as Missy vainly struggled inside. It felt wonderful. Mimi knew only one wood nymph to have ever consumed so much. Once, after one of her biggest binges, Sylvie had achieved a belly bigger than Mimi's was now, but Sylvie was much bigger than Mimi all around.<br>\r\n<br>\r\nMimi noticed something else novel about her belly's immensity: her torso must have stretched longer in order to accommodate her belly's absurd breadth. Somewhere inside her, Missy squirmed again.<br>\r\n<br>\r\n“Mmmm! Missy,” sighed Mimi, “You were much tastier than any of those mushrooms you had picked.” She gave her belly a friendly pat, and said, “Here's to 'finally eating,' Missy.”<br>\r\n<br>\r\nMimi basked there in the mid-day sunshine, periodically snacking on the final basket of morels as she stroked her hugely overstretched abdomen and enjoyed the occasional squirms and shudders deep inside of it.</span></div></div>",
            "created":1352328360,
            "id":1463213,
            "title":"Sure!"
        },
        "111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Let's actually go home now!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 6: Perambelliation<br>\r\nSome minutes later, the commotion in Mimi's gigantic belly finally calmed. Mimi stretched lazily where she lay, extending her arms up above her head and pointing her delicate toes so that the toned contours of her legs expressed themselves appealingly. The arching of her back elongated her belly, too, extending her length a bit. As she relaxed out of the stretch, Mimi could sense the distance her belly had added between her head and toes.<br>\r\n<br>\r\nWhen she sat up, Mimi found it was an almost effortless action despite that her belly looked like it would be an immobilizing burden. Its mass splayed her straightened legs apart in a wide angle asserting its huge bulk between them. Mimi looked around herself for a moment and considered the effects of such a huge belly. Sitting like this, her head was nearly at the same level as her pre-belly height when standing up. She felt the olive-toned globe of belly cinching tighter around on its contents, pressing them inward to compact them even more densely. As it did so, it became firmer, and it tightened slightly more at its midsection, which further added to Mimi's newfound height.<br>\r\n<br>\r\nEnjoying the sensation of her belly's dynamic changes, she went on to discover that she even had some control over its contractions. She started to sense that she might have muscles that she could somehow control voluntarily. She tried to flex with a contraction and found that her belly tightened more in the middle, raising the altitude of her head a bit. Then as she relaxed, her belly bulged back out in the middle, bringing her height back down slightly.<br>\r\n<br>\r\nThis was something fun and new. Belly muscles?! She squeezed again—harder this time—and managed to increase the effect. Now she was intrigued. She squeezed again, and released suddenly. As the the huge mass insider her belly dropped heavily back down, she flexed a different way, forcing the mass of all those mushrooms and Missy downward. Her belly bulged outward all around her as it squished down and flattened slightly. When the surface tension of her belly began pulling her belly back to a sphere shape, Mimi flexed yet again, squeezing her belly's middle as hard as she could so that it became longer and taller than the last time. She released yet again, bearing down with the opposite muscles, and causing her heavy belly to flatten enough that it covered her knees and pressed to the ground on the outside of both of her outstretched thighs before snapping back to round again.<br>\r\n<br>\r\nMimi was amazed: she could control her belly! It must have been why it had been so easy for her to sit up. Her belly was beginning to respond to her as naturally as her arms or legs did. Even though its mass was so ponderous, she no longer needed to concern herself with it making her immobile. With this newfound ability, she could shift her weight weight with ease, allowing her to manipulate her hugely gravid body as she needed.<br>\r\n<br>\r\nShe squeezed and released several times in succession, now. She found the right rhythm for her contractions, and soon she had the whole mass of her belly sloshing up and down. It was still firmly on the ground, but soon she was able to move its mass so well that it became as natural as bouncing a ball.<br>\r\n<br>\r\nWith her belly rising and falling like this, Mimi decided she would try to stand up. As her belly rose, she bent her knees and planted her feet firmly on the ground. But the weight of her descending belly flattened her legs back to the ground heavily.<br>\r\n<br>\r\nMimi stopped heaving her belly for a moment, and as it sloshed to a firm stop, she thought briefly. Then, a knowing smirk crossed her pretty face and she set her jaw. A look of cool resolve settled into her smoldering green eyes. Wrinkling her nose with the effort, she squeezed her belly tall again, then squeezed it squat again, and quickly got the rhythm back.<br>\r\n<br>\r\nThis time, just as she started to heave upward again, she leaned forward, quickly positioning toned legs so that they bent tightly at the knees with her feet planted squarely under her center of gravity. Not allowing her belly to come back down again, she straightened her legs and raised her huge mass until she stood upright. Unsure why all that weight was so easy for her little legs to lift, she now stood, although hardly upright.<br>\r\n<br>\r\nThe bulk of her belly forced her to lean back awkwardly in order to keep her balance. The leaning made it so that her belly's weight felt unsteady, as if it would suddenly fall to one side or the other. She tried to steady her massive abdomen by placing a hand on either curved outer wall of her monstrous tummy, but the added support did little to help her stabilize. There was no way she could walk home like this.<br>\r\n<br>\r\nMimi looked around her a bit. She spied Missy's collection baskets, all empty and cast about the grass careless. Missy had brought four baskets out harvesting with her, and didn't even think to take a push cart for getting them home again, Mimi thought. That silly, delicious little girl! Still, a tiny cart likely would not have helped Mimi's predicament much. Her arms would not be long enough to lift the handles of a cart loaded with this behemoth belly in it.<br>\r\n<br>\r\nMimi's mind wandered into considering her situation a little more completely. She was still hours away from home, and the midday sun was steadily progressing across the sky, escorting noontime along and bringing with it the mid-afternoon. Shadows had begun to come out from under the trees, creeping ever so slightly eastward. The warmth of the afternoon had set cicadas to buzzing loudly in the treetops, and not even the smallest of birds was to be seen or heard. Mimi knew well that she needed to get back to her village before nightfall. She was in no condition to face down another cat out hunting in the cover of night.<br>\r\n<br>\r\nThe fact of the matter was that Mimi wanted to get there sooner than nightfall—before her belly had a chance to compact much. That way she could proudly march into town and everyone would still be outdoors to see her. Then she would show Katya what a really full belly looks like, she thought proudly. Feeling this pride made her stand more upright, and she filled her lungs with air and held her chest forward. She really loved having such a huge belly! Patting its broad sides and feeling enormously self-fulfilled, she marveled about it out loud to herself, “Look at this huge belly! Boy, do I have a surprise for you, Katya!”<br>\r\n<br>\r\nAs she drank in the size of her giant tummy, Mimi rolled her a shoulder forward, first the left, and then rolled it back and brought her right forward. The motion caused her belly to sway back and forth as her spine twisted. “You've never had your belly get like mine, Katya,” she said seductively. Her long eyelashes flashed upward as looked around briefly, then they dropped again as her eyes resumed adoringly surveying her bulging body. “Not even close!”<br>\r\n<br>\r\nHands still rubbing the sides of the great expanse of belly below her, Mimi started to lean forward a bit so that her hands could wander to different places, to...wherever they could reach. Caressing herself all over her sloping sides, Mimi's balance issue completely left her mind, replaced by the enthrall and self-admiration for her gigantic belly. It was beautiful. She felt content in its company.<br>\r\n<br>\r\nSavoring the blissful feeling, lost in fleeting, wispy thoughts that washed through her brain pleasurably, Mimi came to realize that the bigger her belly became, the happier she to felt. Each time she had eaten, she had experienced a comparable increase of this feeling of complete euphoria. How much more intense could it get? Could this wonderful feeling that she was now experiencing possibly get even better?<br>\r\n<br>\r\nWith this thought, Mimi suddenly felt very, very hungry.<br>\r\n<br>\r\nShe just had to eat more. She had to stuff more into her belly and make it even bigger. She wanted to see if this intensely satisfying feeling would grow right along with it. How had she never experienced this feeling before? It was wonderful. Is this what she had been missing out on among all her friends back at the village?<br>\r\n<br>\r\nWell, things were different now. Now she could eat more than any of them. Even Sylvie. The thought of this filled her heart with further happiness as she thought about how her fellow villagers would be so enamored with her. Everyone would admire her belly so, and they would forget all about Katya with her huge, round breasts and that belly of hers that swelled so big each harvest season.<br>\r\n<br>\r\n“I'll show Katya who can eat!” she declared, pounding her left fist onto her right palm for emphasis. “I'll show them all!”<br>\r\n<br>\r\nAs Mimi squared her elbows and planted her hands on her sides (as though upon her hips, which were somewhere unreachable), Mimi suddenly realized that somehow she was now standing comfortably. Gone was her uncomfortable lean. Ended was the struggling to support herself. At some point, she had shifted her belly beneath her, and now stood comfortably. Centered below her head and shoulders, her huge belly was now shaped like a rugby ball standing on end. It bulged out from all around her torso just below her delicate little ribcage, sloping downward in a slow arc. Beyond its horizon, it curved back in to finally meet Mimi's legs, which seemed to have spread a bit farther apart to support her better, and maybe they were a little thicker and longer, too.<br>\r\n<br>\r\n“Well that works!” Mimi exclaimed happily, and started walking with confidence briskly toward her village. She bounced a bit with each stride. </span></div></div>",
            "created":1352328360,
            "id":1463214,
            "title":"Perambelliation"
        },
        "1111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Time for revenge!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nScene 7: Homecoming<br>\r\nSeveral hours later, the evening was waxing into night and a half moon had long since risen high into the navy blue sky's twinkling canopy. Where the sky met the ground off in the distance, Mimi could see the lights of her village glowing warmly. The afternoon air had cooled only a little, and the evening had remained quite a comfortable temperature. The trail before her wandered through a meadow that was braided with a network of little streams whose flows somehow crossed each other without intermixing.<br>\r\n<br>\r\nAlthough Mimi's belly had finished compacting, it still was indeed a sight to behold. More important, it was still much larger than Katya's had ever been. Mimi smiled contentedly, feeling her mass as it swayed with each step.<br>\r\n<br>\r\nAs she crossed one small brook, she plucked a couple long, green reeds, and continued walking as she began to weave them into something. Their dangling ends twisted and bounced and brushed her belly as she worked. In a moment or two, she had woven a tiny, round basket with a loophole on one end—the basis of one of many wood nymph tricks. She stopped to put on the finishing touches, and then held the basket near her face. Then she put her lips next to the basket's small opening, where two pieces of thinly twisted reed dangled. Quietly, Mimi made a light and very high pitched buzzing with her lips, almost too quiet to hear.<br>\r\n<br>\r\nShe waited a moment, and made the sound again. Then, she waited again.<br>\r\n<br>\r\nThis time when she made the buzzing sound, eight tiny lights streaked through the air drawing out their wildly changing trajectories in a trail of twinkling dust that faded away moments later. The lines finally all converged just in front of Mimi's full, pink lips where eight sparklebugs abruptly stopped to a hover. In an instant, Mimi scooped them up with the basket and pulled the two dangling reeds, quickly drawing the basket shut. She tied them firmly as the sparklebugs bounced about inside their tiny cage.<br>\r\n<br>\r\nWith an arc of scintillating dust falling from the little basket, Mimi brought it back to her face and peered into it with her big green eyes. They twinkled lovingly with joy at its frightened contents. Then Mimi placed her two palms on opposite side of the basket, gripped her fingers around it, and gave it a violent shake. She rattled it above her head, bouncing the eight hapless sparklebugs against their little cage until their glowing dust had made the entire basket all shimmery and bright. When she stopped, the eight  sparklebugs crawled dizzily about the inside, drunkenly falling over each other, as they flopped together at the bottom of what was now a glowing lantern.<br>\r\n<br>\r\nMimi located a stick to use, and from one of its ends she hung the basket by its teeny loop. Holding the stick's other end, Mimi lofted it into the sparkelebug lantern into the air, looked up at it, and smiled contentedly. She marched on, holding her little light out before her.<br>\r\n<br>\r\nA short while later, Mimi trudged up a short slope to the edge of her village. From the dark outskirts, Mimi surveyed a welcome sight. Firefly lanterns hanging on gnarled poles cast  warm light outside the front door of each toadstool house. The streets were lined with them, too, and closer to the center of town big, domesticated luminary moths wafted about the air as they lazily flapped their broad wings and circled about the town commons. Here and there,  several of the moths had lit atop the tall stalks of glowing white moonflowers, which the villagers regularly tended in order to provide food for them.<br>\r\n<br>\r\nOn the far end of town, Mimi could just make out the forms of two heavily swollen nymphs holding hands as they strolled together. The only nymphs that were still out and about, they could not see Mimi. As one would expect, the tan, dirt streets were otherwise barren—it was dinnertime.<br>\r\n<br>\r\nMimi turned left down the first cross street, and made her way directly to the last house. Less than a minute later, she stood at the far end of the pathway that gently curved through Katya's flower garden until it came to her front door. Rather than taking the path immediately, Mimi  stayed at Katya's front gate, her huge form obscured by the late evening dim.<br>\r\n<br>\r\nBright yellow light shone out of Katya's windowpane, and through it Mimi watched as Katya busily placed a big harvest basket of shitakes onto the floor beside another similarly loaded basket. Mimi's mouth watered at the sight of them. A temblor rumbled through her vast tummy, as if demanding Mimi to take notice of it. Mimi's left hand reached around one of her huge breasts that still strained at her moss-colored shirt, and lovingly gave the upper reach of her quavering belly a reassuring pat.<br>\r\n<br>\r\nMimi saw Katya's hand gently snatch a big shitake mushroom, and Katya rose back upright from  where she had set the basket down. Mimi admired Katya's bulbous abdomen as she stood, and it made her mouth water even more. Katya, preoccupied with readying yet another big dinner, absently raised the mushroom to her slowly parting, luscious lips and took a big bite from it.<br>\r\n<br>\r\nSomewhere deep insider her, Mimi felt jealousy start to boil. Those mushrooms...Mimi needed them more than Katya. The dinner that Katya was preparing rightfully belonged to Mimi. Her brow scrunched as her eyes focused determinedly on Katya's belly. Those baskets were not the only place where Katya kept mushrooms. Mimi's hungry belly rumbled urgently with enthusiastic approval.</span></div></div>",
            "created":1352328420,
            "id":1463216,
            "title":"Let's actually go home now!"
        },
        "11111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "I can Power Swallow!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com.\" target=\"_blank\">http://e-v-p.deviantart.com.</a><br>\r\n<br>\r\nNote to Artists: I would love to see more fan art. Drop me a note if you make any, and please consider providing a preview image for this story, or any of my stories. Thanks for everyone's encouraging comments, too.<br>\r\n<br>\r\nScene 8: Revenge Served Large<br>\r\nThe domicile of any given wood nymph is invariably similar to that of any other. Each is made from a large toadstool, the thick stem of which has been carefully hollowed out to make one large room which serves as a kitchen, bedroom and living room all in one. With only some shelves and pantries for storage, these living rooms have no furniture except for tens of colorful pillows strewn about on the floor. Wood nymphs have very few needs. But generally, the homes are warm and inviting places, perfect hang-out environments for comfortably entertaining friends, and binging on copious food in belly-stretching quantities during harvest time.<br>\r\n<br>\r\nIn these big living rooms, wood nymphs thicken the air with an intoxicatingly pleasant sandlewood incense. Amid the piles of pillows there would often stand a glass hookah, from which many stems dangled like an octopus's arms. From it they smoked dried floral clusters harvested by climbing high into the foliage of a tall, pungent plant that grew abundantly in the woods around their village. The pleasant smoke intoxicated them, increasing their appetites, and allowed them to continue eating long after they first started to feel full.<br>\r\n<br>\r\nOn this evening, the air inside Katya's abode was beginning to swirl visibly as it became increasingly laden with incense in as Katya arranged two harvest baskets as if for dinner guests. Viewed through the front window, Katya's preparations suggested that they were soon to arrive. Outside in the dark, an immense silhouette turned from the window to look warily up the lane for the approaching guests.<br>\r\n<br>\r\nSeeing no one coming yet, Mimi walked up the path to the front door. As she raised her hand to knock, Mimi saw that she still held her small lantern in that hand. Seeing no place to set it down easily, she settled on stuffing it into her mouth and swallowing it, sparklebugs and all. Traces of pale golden glitter glowed on her dark, full lips.<br>\r\n<br>\r\nNow she positioned herself carefully, centering herself in front of Katya's door. Its sturdy frame was a little wider than the belly pressing against it, but as Mimi relaxed and leaned back, allowing her gut to slump out before her, the huge sphere in front of her got wider and pressed firmly against either side of Katya's broad doorway. Seeing how well this posture emphasized the enormity of her huge tummy, she pressed herself even more heavily against the door, spreading her girth still wider. With a gracefully balled little fist, she daintily rapped the exposed upper part of the big door.<br>\r\n<br>\r\n“Just a second!” she heard Katya call from inside. Mimi's eyes narrowed when she heard footfalls approach with tinkling bells on the other side of the door.<br>\r\n<br>\r\nThe doorknob jiggled as Katya began to say, “Who is it?” but she stopped in mid-sentence with a grunt.<br>\r\n<br>\r\n“Oh!” Katya's voice grunted in frustration. “Hang on. The door's stuck!” The handle jigged a couple times, but Katya couldn't turn the knob.<br>\r\n<br>\r\nMimi let up the pressure for just long enough to allow the knob to turn, and the door burst inward suddenly. Katya stepped back in a confused surprise. There before her stood Mimi with the most immense belly Katya could have ever imagined...especially on her. A moment went by as Katya's struggled to make sense of what she saw before her.<br>\r\n<br>\r\n“Mimi?” she cried incredulously. Relief momentarily won out over disbelief, and a big smile warmed Katya's face at the joyous sight of her missing friend before her.<br>\r\n<br>\r\n“Hiya, Katya. What's for dinner?” Mimi exclaimed with a beaming smile as she squeezed her belly through the tight doorway. The front of her massively distended abdomen gently pushed Katya backward into the living room as she entered.<br>\r\n<br>\r\nKatya's lovely round cheeks still caused her exotic eyes to crinkle into little crescents. “You're back! You're okay!” Katya exclaimed with a couple excited little hops that made her magnificent bustline bounce and her great tummy slosh heavily. Then she took Mimi's hands, her big belly lightly pressing into Mimi's even larger belly. “And look at you! You've been eating!” Katya emphasized her statement by rolling her shoulders in opposite directions and pulling on Mimi's hands so that their bellies rubbed in mirrored unison as they pressed snugly against each other.<br>\r\n<br>\r\n“I sure have, Kat,” said Mimi with equal enthusiasm. “What's for dinner?”<br>\r\n<br>\r\n“Dinner? Oh, that can wait, Mimi! We have to go tell the others that you're back. Everyone has been so worried about you. That was crazy, running off like that!”<br>\r\n<br>\r\nKatya started to slip her satin shoes on, ready to head out. As she did, she further assessed Mimi's enormous belly, noticing how it forced Mimi to lean way back in order to counterbalance its gigantic mass. However did she get herself so round and immense? In fact, it was so big that Katya thought it made Mimi look taller. Much taller, in fact.<br>\r\n<br>\r\nKatya's eyes narrowed with competitive envy. “Perhaps maybe you overdid it a little, Mimi,” she said, softly patting the exposed sphere of flesh bulging from Mimi's abdomen. Mimi was all too familiar with the slight mocking tone in Katya's voice. She knew where this was headed. “I mean, it's an overstep in the right direction, Mimi, but...you know...it is your first time,” Katya needled with a slightly impish look.<br>\r\n<br>\r\nEven now that Mimi was finally able to eat in quantities more appropriate for a healthy wood nymph, Katya could find a way to torment her. Mimi had had enough. The thousand wounds of Katya Wood Nymph she had born as best should could, but when Katya stooped to unwarranted insults, Mimi disposed herself to re-negotiate the terms of their relationship.<br>\r\n<br>\r\n“Oh, Katya, can't we have something to eat before we go tell everyone I'm back?” she asked with a whine as she pressed past her friend. Standing before the front window, Mimi casually drew Katya's curtains together.<br>\r\n<br>\r\nKatya paused, and her face screwed up as she considered Mimi's huge abdomen. “Really?” she asked.<br>\r\n<br>\r\n“Yeah, you wouldn't believe how hungry I am.”<br>\r\n<br>\r\n“No, I guess I wouldn't,” Katya said with genuine doubt.<br>\r\n<br>\r\n“I think my body must be making up for lost meals. Oh, come on, Katya! Pleeeeeze?” Mimi asked with pouting eyes and lips.<br>\r\n<br>\r\nKatya thought for a second. “Okay, let's split one of those baskets of shitakes. Alright?”<br>\r\n<br>\r\n“Okay!” Mimi agreed eagerly, dropping to her knees by the baskets. She sat back with her legs spread widely so that her belly rested on the floor. She looked at their full loads with eager eyes and asked, “Which one do I get to split?”<br>\r\n<br>\r\nKatya gazed at Mimi with absolute non-comprehension for a moment, then said, “I meant that we would share one basket between us, Mimi. Then we have to go let everyone know that you're back home safely.” Katya's voice sounded impatient and scolding.<br>\r\n<br>\r\nMimi hardly noticed, biting into one of the succulent shitakes. It tasted splendid, and she knew right then that half a basket would be nowhere near enough. Still she paced herself, as she and Katya traded turns at feeding one other.<br>\r\n<br>\r\nAs they neared the bottom of the shared basket, Katya's belly was as full as it had been the night before, when Mimi had stormed out so abruptly. She leaned back, then laid down, feeling nearly immobile. She huffed heavily, “Ohhhh....that's it for me.”<br>\r\n<br>\r\n“Okay, I'll eat the rest, then. Okay, Kat? Thank you!” Mimi said with delight. “Hey, watch what I can do.”</span></div></div>",
            "created":1352328540,
            "id":1463217,
            "title":"Time for revenge!"
        },
        "111111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "What else is there to eat?",
                "Let's go eat somewhere else."
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nKatya watched as Mimi stuffed the last several remaining shitakes into her mouth. Mimi gazed right into Katya's widening eyes, as she held up her index finger and paused for effect. Then, Mimi's hand dropped and Katya watched Mimi suck the big lump of shitakes right down her throat. Their huge bulk stretched her neck grotesquely it as it passed down and through her ribcage, finally disappearing into her overgrown abdomen<br>\r\n<br>\r\nStill feeling immobile, Katya sat up slightly, stunned in disbelief. “How...how did you do that?”<br>\r\n<br>\r\n“I call it power swallowing.”<br>\r\n<br>\r\n“Do it again!” demanded Katya, fascinated<br>\r\n<br>\r\n“Okay, but there's no more in our shared basket,” Mimi stated bluntly as she dove two hands into the second basket and grabbed up a huge mass of mushrooms. She leaned her head back as her arms craned them to her upturned mouth. Then she pressed the mass into her mouth, filling her cheeks with much more than one would think possible. Then she grabbed up another sizable amount and shoved it into her mouth, too. The combined mass was twice what she had swallowed before. Katya sat up now, her own tender pink mouth agape. She watched Mimi's face stretch bizarrely, closing her mouth around the big mass. Her cheeks bulged way out at the sides, and her whole jaw appeared to have stretched wide and thin. Mimi's eyebrows raised twice in rapid succession as if to say, “Now watch this!”<br>\r\n<br>\r\nSuddenly, Mimi gulped and the huge wad of mushrooms squeezed down into her throat. The beauty of Mimi's face returned to normal as the mass of shitakes caused Mimi's huge belly to surge a bit larger still. If you had blinked, you'd have missed it<br>\r\n<br>\r\nFinished, she let the empty basket fall to the floor, and leveled her gaze on Katya. Katya's mouth hung agape, and her twinkling purple eyes still twinged with disbelief as they met Mimi's emerald greens. Mimi smiled cheerily and asked, “So, what else ya got, Kat?” Her gaze looked a bit lascivious<br>\r\n<br>\r\n“Well—“ Katya began, but Mimi had already bounced herself up to her feet, no longer pushing her belly out before her, her posture now kept her upper torso centered over her rotund abdomen, its immense mass well-centered on her little legs. Her long walk home had taught her well how to control her newfound mass, and it had become so natural to her that even now with the additional bulk of a basket and a half of mushrooms in her, she moved with easy fluidity. It hardly made a difference to her. Katya simply stared on in disbelief<br>\r\n<br>\r\nMimi turned to face Katya's shelves. On the bottom shelf were three huge burlap sacks. They were stuffed with mushrooms, each easily holding enough to have filled the dinner baskets three and a half times over. One was filled with big, wavy-capped oyster mushrooms. Another with spongy-looking morels. The third with big portobellos bearing broad caps of bronze. As Mimi laid eyes on them, her belly growled thunderously. Its roar sent a chill down Katya's spine as she realized that Mimi wasn't anytime about to stop. How far would this go?<br>\r\n<br>\r\nMimi towed the sack of portobellos across the floor, leaving a wake of pillows around a pillow-free path. Then she set into eating them, gobbling them down with machine-like tenacity. Huge whole mushrooms disappeared one after the other. As quickly as she could bring them to her mouth, they were gone. It was no longer hunger that drove her fantastic binge. It was something else...a deep need to cram everything and anything edible around her down her throat and into her ever-increasing body. She couldn't eat them fast enough. Half way through the bag, the nonstop increase in the girth of her belly started to interfere, making her reach further and further to get the next clump of mushrooms<br>\r\n<br>\r\nHuffing with the effort, she finally hooked a finger in the burlap sack's loose opening and hauled it up to her belly. From there, she leaned back and began eagerly to gulp down mushrooms as rapidly as before. When all but a quarter of the sack's contents were gone, Mimi took the bag, wadded it up around its remaining contents, and pushed the whole thing into her mouth and down her throat<br>\r\n<br>\r\nAfter a moment, Mimi started to bounce her belly. After two or three times, she quickly bounce up to her feet. What Katya saw before her was unlike any wood nymph she had ever seen. The most stuffed of nymphs—even a fourth of Mimi's size—could barely move. Yet here Mimi stood. Her muscular legs were so much thicker now. From her hips swelled out the sphere of her midsection, a belly four times bigger than the most immense belly any wood nymph's had ever gotten. High atop it were Mimi's chest, arms, shoulders, cream-colored neck, and sweetly smiling face under shining, dark hair. Overall, Mimi was at least fifty percent taller than she had been just the day before, and now her gaze fell back to Katya's shelves. She turned and stepped toward the two remaining burlap sacks<br>\r\n<br>\r\n“Mimi?” Katya asked quietly as her lips quivered slightly. “What has happened to you?” Katya asked as she used the wall to help her balance. “How are you able to eat so much?” Katya's free arm, the one not against the wall, slowly raised. With slack fingers, her hand pointed to Mimi's awesomely stuffed belly. “That's not even possible.”<br>\r\n<br>\r\nMimi grabbed the roughly woven cloth of each sack's mouth, one in each hand, and hauled them back over to Katya. She parked the bags next to Katya, then turned around and with her freed hands drew Katya's draperies closed. Backing up a step, she eased her belly to the floor, and slowly rolled herself forward onto her incredible tummy. As she did this, it brought her face a short distance to Katya's, the two huge sacks full of food between them<br>\r\n<br>\r\nYou should try some of these morels, Mimi said, tossing a big fat one to Katya, whose arm failed to react to the gentle toss. It bonked Katya squarely in the face. Suddenly Katya's eyes look alert and in control again. Not without great effort, Katya picked up the fat mushroom from where she was sitting, and then attempted to push it into her mouth all at once. When it became clear that it just wouldn't fit, she bit it in half and attempted to gulp down the huge chunk. It took some force, but she managed it<br>\r\n<br>\r\nShe looked at the morel's other half woozily, and then looked up at Mimi, who had already downed half the contents of one of the bags. As Katya crammed the other half of her single mushroom into her mouth, and started to attempt a swallow, Mimi lifted the remaining half bag and used the loose material to wrap up its contents tightly. Katya watched on as Mimi then worked the whole thing first into her mouth, and then with two hands pushed its entire bulk down her own throat.  Katya watched in disbelief as the distance between Mimi and the floor increased as the additional mass pressed Mimi's belly even larger still<br>\r\n<br>\r\nDumbfounded by the spectacle before her, Katya tried to get up, but the last big bite of morel impeded her. Her arms and legs struggled to move her oppressively full belly, and every painstaking move seemed to go in slow motion<br>\r\n<br>\r\nSeeing Katya trying to mobilize herself, Mimi accelerated her progress by sucking down the remaining sack, now only two thirds full, all at once. Finally Katya had managed to get to her feet, but now stood unsteadily as she tried to center herself. Still leaning forward on her bodacious tummy, Mimi arched herself backward, rearing upright as she rolled backward on her belly. The motion brought her nearly to upright, at which point she wrapped her legs widely around her preponderant belly and planted a foot on either side of it. With a single bounce of its great mass, she was up on steady feet almost effortlessly. Breathing heavily, Katya looked up at Mimi with uneasy amazement. The once diminutive little Mimi now towered over Katya, most of her newfound height located between her hips and chest by an unfathomably enormous abdomen<br>\r\n<br>\r\n“I'm still hungry,” Mimi declared. “I need some more.” The bright lilt in her voice was starting to sound a bit darker<br>\r\n<br>\r\nKatya looked over to her kitchen area and scanned its emptied shelves<br>\r\n<br>\r\n“That's it, Mimi,” she said, turning her face back to look at Mimi's gigantic belly. Katya shook her head slightly. A smirk played on the corner of her mouth. “You know, Mimi...you're almost as big as the biggest Sylvie has ever been!” Katya's long lashes lifted and her violet eyes gazed up to Mimi as she lightly laughed with thoughtful amusement. “Who would have ever thought that you would someday eat almost as much as Sylvie could?”<br>\r\n<br>\r\nMimi stared down at Katya in disbelief. After such an astounding display of belly stuffing, Katya could still find a way to mock her? “Sylvie has never been this big!” Mimi declared defiantly<br>\r\n<br>\r\n“Oh, she's that big right now,” Katya replied dismissively. “After you ran off to pout last night, Sylvie got really worried, and she wouldn't stop eating. Gorged herself silly worrying about you. She hasn't been able to get out of the door all day today. In fact, I'd say she's quite a bit bigger than you. Unlike you, that girl can really do some stuffing.”<br>\r\n<br>\r\nMimi locked her eyes onto Katya's. “Oh, yeah?” she whispered villainously as she took a step toward Katya. “You want to see some stuffing? I'll show you some stuffing!” Mimi glanced back at the empty shelves. “Got any more food?”<br>\r\n<br>\r\nKatya shrugged and her eyes dropped to her own overstuffed belly. With an appreciative pat, Katya smiled and said, “It looks like I ate everything that you didn't.” There was a momentary pause, after which Katya gave Mimi the wry smirk that she always had after winning a battle of wits</span></div></div>",
            "created":1352328900,
            "id":1463226,
            "title":"I can Power Swallow!"
        },
        "1111111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "Vore time!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nMimi's brows drew in, and her gaze fell to the floor. “These floor pillows look pretty good,” she said devilishly. Any trace of the cheery politeness was now gone from her voice.<br>\r\n<br>\r\nKatya's eyes screwed up for a moment. “Are you serious?” said Katya.<br>\r\n<br>\r\n“Totally serious,” said Mimi. She dropped back to her knees, causing them to disappeared under her huge belly, then nimbly scooped up a pillow, stuffed it into her mouth and gulped it down.<br>\r\n<br>\r\n“Hey! Don't eat my pillows!” Katya cried out in disbelief. Had Mimi really just eaten a pillow?<br>\r\n<br>\r\n“Actually, they taste pretty good!” exclaimed Mimi. With her green eyes blazing a stare into Katya's widening purples, she scooped up a couple more and gulped them down.<br>\r\n<br>\r\n“Don't you think you that maybe you're taking this eating thing a little far, Mimi? Come on, knock it off. You're eating my pillows.”<br>\r\n<br>\r\nStill fixed on the exasperated Katya, Mimi defiantly gulped down another one.<br>\r\n<br>\r\nKatya snapped. “Oh, what?!” she demanded, her voice now thick with the all-too-familiar scornful tone that she wielded so many times against Mimi. Mimi reached for another pillow. “Did we tease you too hard and now you're overcompensating to prove that you really can eat enough? Well, don't do it with my pillows!” Katya tore a pillow from of Mimi's hand and threw it across the room to safety.<br>\r\n<br>\r\nBut tossing it had put Katya slightly off her balance, and in a flash Mimi seized the opportunity. With a push on Katya's shoulder, down Katya went, landing back on her big, perfectly-toned posterior.<br>\r\n<br>\r\n“Hey,” Katya complained. She looked up to see Mimi pouncing upon her outstretch legs. She felt the broad front of Mimi's belly press down upon them, pinning them heavily against the floor. Katya was completely immobilized as Mimi leaned forward and rolled more and more of her mass toward Katya. As her beautiful face drew closer to Katya's, Mimi's belly forced Katya to lean backward. Seeing her belly disappearing under Mimi's, Katya planted her elbows on the floor behind her to keep from being pressed flat onto her back. Mimi's belly pressed upon her so heavily that Katya could only gasping for air. Mimi was now nose to nose with her.<br>\r\n<br>\r\nAs Mimi spoke, her mouth smacked wetly, “Well, what should I eat then?”<br>\r\n<br>\r\n“Mimi! You're...like...freaking me out. Get off me!” The usual confidence in Katya's voice was starting to falter.<br>\r\n<br>\r\nMimi replied softly to Katya, “What? You don't like the way it feels to have me do to you what you have constantly done to me?”<br>\r\n<br>\r\nThe purple of Katya's eyes became a bit watery as her mind started to gnaw with panic. Her voice tremored as she pleaded, “Seriously, Mimi...stop it. You're...you're really scaring me.”<br>\r\n<br>\r\n“Is it uncomfortable, Katya? You don't like being intimidated? Well, you can imagine how I have felt all those time that you lead the charge at getting all of our friends to ridicule me. Do you have any idea how it feels to have your best friends constantly telling you that you're no got at the very act of living?”<br>\r\n<br>\r\n“Mimi, I'm sorry,” Katya whimpered to her, cautiously trying to wrest her legs out from under Mimi's impending tummy. “I didn't mean it like that.”<br>\r\n<br>\r\n“I know exactly what you 'didn't mean,' Kat. It's just like how I don't mean to be keeping you pinned down like this.”<br>\r\n<br>\r\nShe paused, allowing Katya's panic-addled brain to process what she had just said.<br>\r\n<br>\r\nThen she clarified: “Or rather, I certainly mean to keep you pinned down like this. But much like your intentions, mine are not what you probably think they are. You see, I don't want an apology from you. What I want from you is for you to help me fill my belly.” Mimi's face now pressed even closer to Katya. “Full, Katya. Totally Full.”<br>\r\n<br>\r\nA tear rolled out from the purple of Katya's left eye. She turned her head slightly, as if to protect it from Mimi.<br>\r\n<br>\r\nMimi leaned in further, and continued. “Now that I can fill it, I want it way full! I need fill it a lot more. I want it to be so big that...anywhere I look...there it is: my big, full belly.”<br>\r\n<br>\r\nArms aching, Katya finally allowed herself to be pressed to the floor. The tanned flesh of her body was now eclipsed almost completely by Mimi's enormity.<br>\r\n<br>\r\nContinuing, Mimi mused wishfully, “The only problem is that there aren't any more mushrooms for me to eat.” Mimi looked away thoughtfully, as if pausing to think. As Katya stuggled for each shallow breathe, Mimi said absently, “Except...”<br>\r\n<br>\r\nUnable to withstand the suspense, Katya managed to gasp, “Except...what?”<br>\r\n<br>\r\n“Well,” said Mimi, her gaze coming right back to stare into Katya's, “There are a whole bunch of mushrooms inside of you.”<br>\r\n<br>\r\n“What?” Katya gasped.<br>\r\n<br>\r\n“Well, you see, if I want to put all the food I can into this big belly of mine,” Mimi explained, “And the only other food that is not already inside of me happens to be inside of you...then you have what I want, Katya.”<br>\r\n<br>\r\nWith eyes as big as saucers, Katya could not believe what she was hearing.<br>\r\n<br>\r\n“Surely, you want me to stretch my belly as much as I possibly can, don't you? You've told me all about it over and over again. All those times as I sat there unable to eat, watching you stuff yourself for hour after hour? And how you bragged to me endlessly about how great it feels to see how full you can get your belly. Remember?  Well, guess what? I'm finally hungry. But with no more mushrooms here to fill me up, you know what I'm going to swallow next, don't you?”<br>\r\n<br>\r\nKatya shook her head ever so slightly and said “no.” Her voice wavered pitifully, making three syllables out of the single word.<br>\r\n<br>\r\n“You.”<br>\r\n<br>\r\n“No!”</span></div></div>",
            "created":1352329020,
            "id":1463229,
            "title":"What else is there to eat?"
        },
        "11111111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "It's Cassia.",
                "It's Sylvie."
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\n“Sorry, Katya, but I'm going to have to eat you,” Mimi explained with a lascivious grin. Her sinister eyes peered down on Katya with menace. “I'm not sure how, but I am going to swallow you, Katya. I need more mushrooms in my belly, and you, my dear...why, you're just one big, sumptuous package of them. Know what I mean?”<br>\r\n<br>\r\nMimi shifted her weight slightly, exposing some of Katya's big tummy so that her delicate hands could stroke its swollen dome. Mimi assessed it's bulging girth lustfully as the petrified Katya searched Mimi's face for the faintest sign of sanity<br>\r\n<br>\r\n“You always could pack a lot in you, couldn't you, Kat? I mean, you're stuffed to the gills right now, aren't you?” Mimi's hands squeezed the sides of Katya's belly appreciatively. “Wow, but you have really outdone yourself this time.”<br>\r\n<br>\r\nSalivating eagerly, Mimi licked her lips as she chuckled slightly with amusement at herself. “I guess we both have, Kat. Maybe me a little more than you,” she continued, rolling forward onto Katya just a little bit more to emphasize her point. Katya's every breath once again became urgent. “But the difference is, I'm not done yet, Kat. Nope. Not at all. I'm still very hungry. And I think it's going to feel pretty good to have you in my belly. It's going to feel really good.”<br>\r\n<br>\r\nA sudden adrenaline spiked caused Katya to squirm madly for her life, but with Mimi's belly pressing down on her, she could not get free<br>\r\n<br>\r\n“Oh, I do like when you struggle like that, Katya. It's just adorable. It makes eating you so much better. I don't know why, I just like to know that my food was lively, I guess. But, please, do save some strength for when you're inside me. I want to feel you struggling to get out for a little while. I loved feeling little Missy squirming in there. You remember Missy, right? She was delicious, but only an appetizer compared to you, Kat.”<br>\r\n<br>\r\nExhausting of energy and depleted of oxygen, Katya stopped resisting as she panted for air. She looked into Mimi's eyes, once again desperately trying to find a sign of mercy, hoping that the joke would come to an end<br>\r\n<br>\r\n“Ahhh, that's it, Kat. Save your strength,” Mimi advised sagely. “As I said, it's going to feel really good.”<br>\r\n<br>\r\nThen Mimi opened her mouth very wide, and she leaned further forward on Katya, who had her face turned to the side with her head pressed against the floor. Mimi brought her mouth almost to Katya's forehead, then stopped herself short and snapped her mouth closed. A flame of hope danced across Katya's eyes. Had the horrible joke finally played itself out? Her dismay faded for a brief moment, replaced by uncertain relief.<br>\r\n<br>\r\n“For me, I mean,” Mimi clarified, “It's going to feel good for me. You, on the other hand...you're going to do a lot of kicking and struggling inside of me, and I'm guessing it won't be much fun for you at all.” Mimi concluded with a bemused sigh, “But I'm going to love it!”<br>\r\n<br>\r\nMimi's mouth opened again, rapidly snapping back to Katya's forehead as her jaws spread apart. In an instant, Katya's lovely head disappeared into Mimi's stretched, full lips. A short cry was swiftly muffled as Katya's face plunged into the back of Mimi's throat. Her head was immediately constricted snugly as it plunged down into Mimi's esophogus.<br>\r\n<br>\r\nWith Katya's head now held firmly in Mimi's throat by a solidly-progressing power-swallow, she no longer needed to constrain Katya. She rolled onto her side, allowing Katya to struggle. On either side of Katya's bulbous tummy, long legs flailed and kicked. The commotion quickly aligned Katya for easier swallowing, and each moment she drew steadily further into Mimi's wide-stretched mouth.<br>\r\n<br>\r\nKatya's perfect shoulders started to fill Mimi's cheeks, stretching her jaw and throat further still. Katya's upper arms became pinned to her sides as Mimi's unstoppable mouth began to constrain their movement. Katya's wild, scrambling kicks became weaker as her consciousness began to dim.<br>\r\n<br>\r\nThe rapid progress slowed as Mimi arrived at the considerable swell of Katya's bustline. At the point where Katya's blouse suddenly ballooned outward, Mimi encountered a circumference much, much  larger than even the burlap sacks she had just forced down. And even though Katya's body was still steadily being sucked into Mimi's mouth and down her throat, the bulk of Katya's huge breasts would not enter. They bulged outside Mimi's mouth as it progressed onward. Down Katya's torso they pressed, resisting the advancing constraints of of Mimi's  mouth. Soon their mass pressed against Katya's bulging belly, and the their flesh pulled increasingly tighter as the pressure intensified relentlessly. Fantastically stretched already, Mimi's mouth and throat pressed onward.<br>\r\n<br>\r\nHaving reached the point at which she would have to begin swallowing something as much as four times bigger around than anything she had ever swallowed before, it occurred to Mimi what she could try next. No sooner than the thought had occurred to her did she put it into action, flexing her abdominal muscles as if to make her belly expand outward. By dilating the diameter of her belly, she discovered an altogether new and much more powerful source of suction. Bolstering Mimi's power swallow technique, the resistance of Katya's big breasts instantly shifted, and Katya's huge mammaries snapped one-two into Mimi's mouth. Now they bulged against the inside of Mimi's lower jaw, and together, they were rapidly compelled toward Mimi's belly, now pumping with prolonged flexes. Katya's bosom pressed outward in Mimi's still widening throat, nipples pressing visibly outward from the two huge swells<br>\r\n<br>\r\nWith each heave, Mimi's huge belly surged a bit larger, now drawing Katya even deeper into it. Taking to her hands and knees, Mimi's undulating belly dragged the floor. As it convulsed to haul in Katya's huge mass, it lengthened and its volume expanded more and more. When Katya's breasts at last pushed into it belly, it swelled still faster.<br>\r\n<br>\r\nBy now, Mimi's mouth had reached its maximum circumference, but the massive suction her belly was applying to her prey caused Katya's full belly to elongate as passed through Mimi's mouth and throat. Katya had always been able to pack a lot in, but Mimi had pressured her to go far beyond anything limits she had previously reached, making Katya even more difficult to manage. The gigantic tummy slowed Mimi's efforts almost to a stall, as she continued to work Katya deeper at the creepingly slow pace of a python swallowing a pot-bellied pig. She strained and heaved, and progress was achingly slow until she felt the widest point of Katya's overly gorged belly enter her mouth.<br>\r\n<br>\r\nWith increasing speed, Katya was now passing into Mimi's belly, and Mimi felt a new sensation. The swell of her belly was causing her back to arch, and the tension that had already stretched her spine increased as the volume of her belly started to pushed her ribcage and hips apart. It felt as her belly could fit no more, Mimi worried that she might have finally reached a physical limitation. But she was not done with Katya yet...it couldn't be the end.<br>\r\n<br>\r\nFeeling that she was past the point of no return, she was compelled to press on. Then, from deep inside here, there was a sudden POP! as two of her vertebrae separated. But instead of pain, there was a kind of relief, albeit very small. She wriggled her gravidly burdened torso a couple times to test whether everything was still all right. It seemed so, so she resumed swallowing. Katya began flowing into her a bit more easily now.<br>\r\n<br>\r\nPOP!<br>\r\n<br>\r\nAgain, this time a little lower on her back<br>\r\n<br>\r\nShe tried to straighten her spine, and as she did several pops followed one after the other as lumbars separated in rapid succession. The interval between them decreased as the pops accelerated down her spine. POP!.........POP!......POP!...POP...! POP-POP-POP-POP!<br>\r\n<br>\r\nWith each pop, she felt her spine extend, and when her final, lowest lumbar went off with a deeper-toned and much louder pop than any of the rest, she felt her torso much longer than before. Her back felt more supple and yielding, and her belly was now unconstrained by her tiny frame. Mimi was struck by how odd this was. And how fortunate. She twisted her torso a bit to feel whether she was okay. No pain, really. Everything seemed to be intact.<br>\r\n<br>\r\nThen, she easily sucked the last of Katya's belly into her own. As she did, she rose up onto her knees, and tilted back her head, sucking down Katya's incredibly long, shapely legs. As they disappeared down Mimi's throat, the immensely bellied nymph fell backward, sprawling on her back so that she could enjoy as completely as possible what would come next.<br>\r\n<br>\r\nMimi lay there on her back smiling, with the gigantic dome of her belly rising from the floor half way to the ceiling. Deep inside its hulking mass, Mimi could feed Katya squirming heroically. She watched as various bulges from Katya's abundant curves pressed outward, then disappeared. It became a small game for her to identify which parts of Katya's anatomy each bulge might be before it disappeared again<br>\r\n<br>\r\nMaybe that's her head, thought Mimi. No, it's much too big...maybe one of her boobs?<br>\r\n<br>\r\nThen she would swallow another of of Katya's floor pillows in order to keep the action going. But the fun soon subsided, the pillows were soon gone, and Katya soon became still as Mimi's belly composed itself back to a smooth, symmetrical roundness. She patted it with satisfaction.<br>\r\n<br>\r\n“Now that's some stuffing, eh, Katya?” Mimi said to herself.<br>\r\n<br>\r\nNot a moment later, a loud &gt; knock! knock! &lt; rapped on Katya's door. </span></div></div>",
            "created":1352329200,
            "id":1463234,
            "title":"Vore time!"
        },
        "111111111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "She's too big to get out!"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nScene 9: The Next Course<br>\r\nMimi pulled the curtain slightly and peeked out at the front porch. It was Cassia. She stood there expectantly, propping a huge harvest basket full of mushrooms upon her protruding belly. Seeing Cassia's rotund belly bulging before her made Mimi's heart leap with anticipation. Cassia knocked again.<br>\r\n<br>\r\n“Hey, Katya, it's me, Cassia. Let me in. I managed to sneak off with a basket of morels. With Sylvie still eating nonstop, these are getting pretty scarce.”<br>\r\n<br>\r\nMimi leaned back, propping herself against the wall and called back merrily, “Come on inside, Cassia! I'm starving!”<br>\r\n<br>\r\nA sudden thud, and then door swung open as Cassia backed in. Once she had stepped backward into the room, it was clear why she had entered so. There, partly balanced on her hugely swollen belly was an enormous basket overflowing with nice, fat morels.<br>\r\n<br>\r\n“You should see her, Katya. She's twice as big around as she's ever been, and now everyone's lining up to feed her. They want to see how far she can go,” Cassia grunted as she set the basket down on the floor. She then finally turned to face the room and see her friend.<br>\r\n<br>\r\nCassia's jaw dropped with a sharp gasp.<br>\r\n<br>\r\nWhat Cassia saw leaning against the wall dumbfounded her. Two thin, shapely legs were bent at the knees, with feet flat on the floor, on either side of the most immensely stuffed belly Cassia had ever seen. It wasn't just slightly bigger than a normal wood nymph's belly stuffed to capacity. It out-sized one by five or six fold. Staring in wide-eyed shock, Cassia tried to comprehend it as her eyes continued to scale its immense curve. Atop its great mass, Mimi's shoulders rested casually against the wall, her shirt straining to contain the huge bosom within. Above her lithe little shoulders, Mimi's delicate neck lead to her face. There was no mistaking Mimi's glowing smile or her mane of chestnut hair.<br>\r\n<br>\r\n“Mimi?” Cassia asked cautiously. Jaw still slack, she leaned in as she stepped forward, mesmerized at the sight before her. “What happened to you? You're gigantic!”<br>\r\n<br>\r\nMimi looked down at the giant belly below her and smiled pleasantly. Her hands slowly caressed its surface as if even Mimi did not quite believe it.<br>\r\n<br>\r\n“Oh, last night was quite an adventure...so I guess Sylvie found the glowing mushrooms?” Mimi asked as though there were little more worthy of explanation.<br>\r\n<br>\r\n“But...how did you get so—” Cassia searched for the right word.<br>\r\n<br>\r\n“Big?” Mimi offered. “It's a long story that we should talk about over dinner.”<br>\r\n<br>\r\nCassia replied uncertainly, “Uh, okay,” then turned back to get the basket, then walked back over to Mimi, and looked for a place to sit. Katya's numerous floor pillows were strangely absent.<br>\r\n<br>\r\n“Where did all the pillows go?” she asked.<br>\r\n<br>\r\n“Good question,” Mimi shrugged as she patted her belly smugly. “Katya normally has so many.”<br>\r\n<br>\r\nSetting the basket between she and Mimi Cassia looked up at Mimi and asked, “And where's Katya?”<br>\r\n<br>\r\nStill patting her belly, Mimi looked about the room. “That's weird. I could swear that she's in here somewhere.”<br>\r\n<br>\r\nThen Mimi's belly rumbled with a burst of motion as Katya unexpectedly wriggled again. The sudden motion startled Cassia, and she slowly raised her forearm. An index finger extended at its end, pointing at the commotion stirring within Mimi. Her other hand covered her mouth as it slowly dawned on her what was going on.<br>\r\n<br>\r\n“What was that?” whispered Cassia with a shaking voice. “Did you...Did you eat Katya?” She took a step back, and in a low voice she stated it as her eyes went wide again, this time with terror, “You ate Katya...you ate her...”<br>\r\n<br>\r\nMimi burst into action, springing forward at Cassia. Her huge mass was in motion in such a lightning-quick instant that the stunned Cassia had no chance to react before Mimi's massive tummy was shoving her backward. She stumbled backward until her body hit the door with a thud. Left slightly ajar, the door slammed shut, and against it Cassia was now pinned.<br>\r\n<br>\r\nMimi stepped forward, increasing the pressure of her immense belly against Cassia.<br>\r\n<br>\r\n“Cassia! How could you think such a thing of me?” Mimi asked with a broad smile. Pressing against Cassia even more as she leaned in, Mimi explained, “I finally get an appetite, and your going to criticize me now for eating too much?”<br>\r\n<br>\r\nTrapped by an increasing amount of Mimi's surface area squishing against her, Cassia felt Katya squirm again. She looked up at Mimi in terror. Tears welled in her eyes.<br>\r\n<br>\r\n“Mimi, what's happened to you?”<br>\r\n<br>\r\n“I'll show you,” she told Cassia. Mimi lifted an arm to show that she had somehow nabbed the big harvest basket during the commotion. With a wicked grin, Mimi said, “Let's eat.”<br>\r\n<br>\r\nMimi propped the basket on her belly, leaning it slightly inward, and held it with one hand while the other hand scooped up a large handful of the spongy mushrooms. “I can swallow all of this in one gulp,” she boasted. Then she demonstrated just that.<br>\r\n<br>\r\nCaught somewhere between horror and awe, Cassia could only watch Mimi's surreal performance. “That's the same thing Sylvie has been doing...” she managed to whisper.<br>\r\n<br>\r\nMimi scooped up another handful, not quite as large, and said, “Now you try.” She pressed the mound into Cassias mouth, forcing her jaw open and filling her cheeks. Tears ran down Cassia's cheeks as she tried to swallow and failed.<br>\r\n<br>\r\n“No, no, Cass,” said Mimi rolling her big, green eyes impatiently. “Like this.” Mimi lowered her lids, narrowing in on the mass of food in Cassia's mouth, framed by her luscious, widely-parted lips. She pressed against Cassia even more, bringing her lips to Cassia's. Her belly had enveloped Cassia's entire body now, allowing just the head and feet to protruded. Then Cassia felt Mimi suck the mass of mushrooms right out of her mouth and swallow them down. Mimi's left her moist lips intimately pressed to Cassia's for a moment before pulling back slightly.<br>\r\n<br>\r\nTerrified tears were now streaming down from Cassia's deep blue eyes<br>\r\n<br>\r\n“That's nothing, Cass. Watch this,” Mimi sighed wistfully. Then Mimi lifted the basket to her mouth and pressed the rest of the mushrooms—the whole basketful, minus the previous two handfuls—into her mouth and swallowed them in a single, enormous gulp. As the huge mass of mushrooms passed into Mimi's belly, Cassia felt its mass add to the already massive girth pressed against her.<br>\r\n<br>\r\nWith her own tummy so full and heavy, Cassia found that the relentless pressure was making it hard to breathe, but she managed to gasp out a plea, “But, Mimi, how can you eat your friends?”<br>\r\n<br>\r\n“I'm not sure, Cass. Last night, I just started getting hungry. I started eating more and more mushrooms, and just couldn't get enough. On the way home, I came across Missy, and she had several baskets full. We started eating them, but I didn't want to share. So, when we ran out, the only mushrooms left for me to eat were inside of Missy. So I ate her. Oh, she was delicious, Cassia. You have no idea!” Mimi paused with a sigh as she remembered it. “Anyway, when I got back, I could hardly wait to eat Katya.  You should have seen her, Cass. She was so huge. I wasn't sure I could do it, but there you go.” Mimi thrust her belly into Cassia to emphasize her point.<br>\r\n<br>\r\n“And now, on to the next course,” Mimi grinned<br>\r\n<br>\r\nMimi then opened her wet lips widely around Cassia's face and engulfed Cassia's whole head. Backing from the door to free Cassia for easier swallowing, Mimi quickly slurped Cassia down past her shoulders, then over her huge breasts, and then somewhat more slowly around the swell of Cassia's distended belly. She then power-swallowed Cassia right down into her. It was over in an instant.<br>\r\n<br>\r\nCassia squirmed and writhed inside of her in a most satisfying way. But for some reason, Mimi was uncomfortable. She stood slightly stooped, and her legs bent a little at the knees in order to fit under Katya's bright yellow ceiling.<br>\r\n<br>\r\nMimi laid upon her back to rest and enjoy all of Cassia's antics within her. Her belly bulged upward in a huge dome, undulating with her latest meal.<br>\r\n<br>\r\n“Well,” Mimi sighed to herself as she reveled in feeling coming from with her glorious belly, I think it's almost time to find out for real just how big Sylvie got herself. I'll certainly show her some stuffing.” </span></div></div>",
            "created":1352329320,
            "id":1463236,
            "title":"It's Cassia."
        },
        "1111111111111111111":{
            "author_id":"sqrt1",
            "author_name":"SquarerootOfNegative1",
            "choices":[
                "On the way to Sylvie's",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nScene 10: Comfort Food<br>\r\nMimi's hands groped the upper slopes of her belly. With Missy, Katya, and now Cassia all packed tightly inside her, still intermittently squirming, Mimi felt a new sensation. It started in her chest, and like a fire she felt it course through every part of her chest, head and arms. It then spread throughout her whole belly, overtaking Mimi entirely until it finally spread down her legs. The feeling was raw, unbridled lust. She needed more. She had to get more in her. She looked down where her belly's girth shuddered with another bout of internal struggle.<br>\r\n<br>\r\n\"Mmmm! You feel it, too, don't you, ladies? You can feel it! But you can't do anything about it because you're inside of me,\" Mimi tittered gaily. She patted the area that had been the movement's epicenter. \"I'll show you, Kat. I'll show you some stuffing. I'm still plenty hungry!\" declared Mimi. She stepped toward Katya's kitchen door, somewhat crouched because of Katya's oppressively low ceiling.<br>\r\n<br>\r\nMimi opened it and pushed her upper torso through. The girth of her belly met the doorframe, filling it completely. She started to squirm to pull herself through, but the narrow doorway resisted stubbornly. Getting a bit more of her belly through, she paused and gasped for breath. \"What am I doing?\" she thought. \"This is keeping me from dinner!\"<br>\r\n<br>\r\nSuddenly Mimi flexed her belly outward, and the door's perimeter expanded as cracks radiated outward across the toadstool from the doorframe's curving outer edges. Through the widened aperture, Mimi then caused the bulk of her belly to flow forward until her legs came out. They seemed so tiny, scurrying to urge the massive abdomen along, pressing up under her until she was back upright again.<br>\r\n<br>\r\nStanding in Katya's front yard and out in the open again, Mimi could better appreciate her full size. Her head was higher than the bottom of Katya's mushroom-cap roofline, which made her just a little more than an extra third taller than most of her fellow villagers. And since all of Mimi's newfound height was in her gargantuanly round belly, Mimi thought that she might look a bit suspicious, so she doused Katya's yard lantern (Gulp!), and then looked up the lane. Where might she find Sylvie, she wondered. But the lantern's surprisingly pleasant flavor distracted her, and soon she was considering Katya's toadstool house curiously.<br>\r\n<br>\r\nOn a hunch, Mimi touched her tongue to the lower edge of Katya's roof. After all, she thought, it's just a really big mushroom.<br>\r\n<br>\r\nIt was delicious!<br>\r\n<br>\r\nMimi took a huge bite out of the overhanging edge. She had intended to chew it cautiously, but when the flavor hit her tongue her instinct kicked in. With a sudden convulsion of her gigantic belly, Mimi power-swallowed it so fast that it made a muffled thud as the chunk impacted the mass contained within.<br>\r\n<br>\r\nMimi shook her head with surprise, and was then immediately at it again. This time she took a much bigger bite, and this time her belly performed the same power assist, completely subconsciously. It wanted more.<br>\r\n<br>\r\nThe recoil from the implosive belly swallow caused Mimi's neck to whip her head forward for another huge bite into the roofline. With this next gulp, she used the rebound of her belly to propel herself forward, allowing the momentum to stretch her mouth around a larger part of the roofline. Clamping her teeth down without biting through, she retracted again and this time tore off a chunk so large that it left a hole that let moonlight into Katya's living room.<br>\r\n<br>\r\nFor only a split second, Mimi considered the huge piece of toadstool protruding from her lips. Then with a huge surge of her gigantic belly, she sucked it down in a single gulp, feeling its spongy mass compress as it passed through her throat and then expand again as it entered her belly. The sensation exhilarated Mimi. She wanted more of it.<br>\r\n<br>\r\nMimi stood tall enough now that the she could almost reach the rounded peak of the toadstool's broad cap, the highest point of Katya's cottage. She made herself as tall as her belly would allow, leaned on the sumptuous roof, and standing on tiptoes, she got her lips as close to the top as she could. This time she took no bite. Instead she commanded her belly to lung forward, causing the whole house to lean away from her slightly as her mouth took in as much as she could stand. At exactly that point, she forced the hardest swallow she could muster. The house shuddered and rocked back toward Mimi as her belly suddenly shifted the direction of force. Mimi felt the roof begin sliding through her lips and mouth, down into her throat. Could she do this?<br>\r\n<br>\r\nThe broad cap of the toadstool began compressing, gills folding together flat as its circumference shrank. Katya had been big, but Mimi's mouth was now stretched wider than it had ever been. The roof cap separated from its stem as Mimi continued the gigantic gulp. She felt it crumple in on itself like an umbrella as it moved glacier-like through her mouth and throat. Each centimeter deeper, the roof's mass got thicker and thicker, but Mimi pressed upward into its weight.<br>\r\n<br>\r\nWhen the gigantic cap started uncompressing inside of her, Mimi's belly expanded outward exponentially. The end was in sight and soon Mimi's hands were able to push the last of the giant mass past her tongue and down her throat.<br>\r\n<br>\r\nMimi then looked down with amazement at her belly expanding in all directions as the spongy mass within her slowly regained more of its original volume. She sensed he ground becoming more distant, and her girth widened before her own eyes. It felt wonderful.<br>\r\n<br>\r\nIn another moment, Mimi started on the stem walls, swallowing its hollowed circumference clockwise and with only a little less difficulty. Laying down in the large hole left in the ground, Mimi once again relished the sensation of the spongy toadstool expanding within her. Her monstrous tum rose like dough in fast frame motion. When it was over, Mimi's enormity filled the entire space once occupied by Katya's little home.<br>\r\n<br>\r\nLooking up at the overstuffed dome belly, Mimi smirked as her tiny hand patted a small area of her great curvature.<br>\r\n<br>\r\n\"You catch all that, Katya?\" she asked her belly. \"Tonight, you're gonna see some stuffing!\"<br>\r\n<br>\r\nSomewhere far off on the other side of her, two little legs wriggled with giddy pleasure. <br>\r\n<br>\r\n(BTW, this is the end of the original author's story)</span></div></div>",
            "created":1352329380,
            "id":1463240,
            "title":"She's too big to get out!"
        }
    },
    "info":{
        "author_id":"sqrt1",
        "author_name":"SquarerootOfNegative1",
        "brief_description":"A continuation of E-V-P's Intakes a Village\r\nhttp://e-v-p.deviantart.com",
        "created":1352326980,
        "description":"<td align=\"left\" class=\"norm\">A continuation of E-V-P's Intakes a Village<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://e-v-p.deviantart.com\" target=\"_blank\">http://e-v-p.deviantart.com</a><br>\r\nPlease add long chapters only.</td>",
        "id":1902413,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1352329380,
        "modified":1352329380,
        "pretty_title":"Intakes a Village orignally by E-V-P"
    }
}