{
    "chapters":{
        "1":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Felicia",
                "Morrigan",
                "Hsien-Ko",
                "Lilith",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>First, as you would in the game, Choose Your Character.<br>\r\n<br>\r\n* Felicia the Catgirl. A fan favourite, known worldwide, with many friends, alot of talent, and a BIG appetite.<br>\r\n<br>\r\n* Morrigan Aensland the Succubus. The princess of the Makai, she's actually one of the series' protagonists. Another favourite with the guys, and it's easy to figure out why!<br>\r\n<br>\r\n* Hsien-Ko the Kuang-shi. A ghostly Dark Hunter from China, with her sister Mei-Ling, both trying to rid the world of Darkstalkers and free their mother's soul from the darkness.<br>\r\n<br>\r\n* Lilith Aensland the Succubus. A piece of Morrigan's soul removed at birth, she's especially popular with lolicon fans due to her appearance.<br>\r\n<br>\r\n* Someone else entirely.</span></div></div>",
            "created":1216011600,
            "id":567654,
            "title":"So many choices..."
        },
        "11":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Breast expansion",
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>So, you chose the biggest fan favourite of all? Excellent choice! Now, to decide what to do with her.<br>\r\n<br>\r\n* Fatten her up<br>\r\n<br>\r\n* Inflate her<br>\r\n<br>\r\n* Give her bigger boobs<br>\r\n<br>\r\n* Give her a bigger butt<br>\r\n<br>\r\n* Something else</span></div></div>",
            "created":1216011600,
            "id":555759,
            "title":"Felicia"
        },
        "111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Gaining weight willingly",
                "Forcefeeding",
                "Vore"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will she gain willingly with normal food, be forcefed, or go around voring other characters?</span></div></span></div>",
            "created":1216011600,
            "id":555969,
            "title":"Big Fat Kitty"
        },
        "1111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Felicia and Jon have settled down and she suggests they let their figures go.",
                "Felicia finds donuts... AND THEY MUST BE EATEN!!!",
                "Something else instead?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Felicia wants to let herself go big time! The questions is though, why does she wants to pack on the pounds?</span></div></span></div>",
            "created":1308891600,
            "id":1133838,
            "title":"Gaining weight willingly"
        },
        "11111":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "\"...you should gain weight, put on a true motherly figure!\"",
                "\"...we should gain weight, leave fighting behind for certain!\""
            ],
            "content":"<div class=\"\"><div> <span>Two years have passed since the Majigen disappeared. During Jedah's little survival game, Felicia and Jon had met up and become close through teamwork. This partnership quickly became a friendship, and before too long, Felicia confessed to having a crush on Jon. After their return from the Majigen, they began dating, and engagement eventually followed. Now the catgirl and werewolf are married, living together in Felicia's luxurious suite above her hotel/casino in Las Vegas.<br>\r\n<br>\r\nWhile cuddled up on the couch for a movie one night, Jon couldn't help but realize... Felicia has always been incredibly well-endowed, but her body was also very hard. She was packed with muscle everywhere but her breasts, rump and face. He wondered if perhaps she could be made softer. But then, she might want the same from him...<br>\r\n<br>\r\n\"Felicia\", he spoke up after a moment, \"May I suggest something?\" The kitty looks up at him, smiling as always. \"What is it, Jonny?\", she asks sweetly. Jon chuckles and strokes his wife's cheek. \"If it's alright with you... I think...\"</span></div></div>",
            "created":1308891600,
            "id":1133985,
            "title":"Settling Down and Letting Go"
        },
        "111111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "\"*sigh* Yes, it's true; I want to....you know, fatten you up.\"",
                "\"Huh? Where did you get that crazy idea, Felicia?\"",
                "Actually, Jon said something else in reaction."
            ],
            "content":"<div class=\"\"><div> <span>\"....Have you ever, you know, thought about having kids?\" Jon asked, obviously suggesting an idea to his feline lover, causing Felicia to give the werewolf a puzzled look on her face and answered, \"Well, um....I always did wonder about having kittens or pups of our own from time to time. Why?\"<br>\r\n<br>\r\n\"Well, I was thinking that, um....you gain some weight. You know, pack on the pounds to gain yourself a true motherly figure.\" Jon replied, just as he placed a thick large fluffy pillow on top of Felicia's abdomen, simulating the appearance of a fat belly. However, just as she slowly traced her mock belly with a furry right hand, Felicia began to have a second opinion about what her lupine boyfriend might be thinking and asked, \"So tell me; Do you really want us to have kids, or are you just finding a way to fatten me up?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1427173200,
            "id":1953102,
            "title":"\"...you should gain weight, put on a true m..."
        },
        "1111111":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "\"Oh simple, really; I plan on stuffing you with cake. Think you can handle it?\"",
                "\"*Giggle* Let's just say that it's a surprise, my little kitten.\"",
                "Actually, Jon said something else instead."
            ],
            "content":"<div class=\"\"><div> <span>Upon reaction to the catgirl's question, Jon began to blush a little, which was something of a rare occurrence to near witness. \"W-What are you trying to t-tell me, love?\" Jon said, his cool calm demeanor showing signs of cracking. Obviously becoming aware of the werewolf's hesitation, Felicia began to reassure him a little and replied, \"Look, I'm truly sorry about putting you in this position, Jon-Jon. It's just that....I know about your attraction to fatter girls, I noticed this when you accidentally left one of your magazines out. It had pictures of really fat women. So please, be honest with me here....\"<br>\r\n<br>\r\nTurning her body to face her lover, Felicia looked at Jon and asked, \".....Are you...more into fat girls than....t-than your favorite kitty girl?\" Seeing the tears welling up in her eyes, Jon obviously became aware that Felicia was in an upset mood at the moment, thinking that he was going to leave the catgirl for someone with a larger waistline. <br>\r\n<br>\r\nHowever, ever since he began to have feelings for Felicia, Jon has been the happiest he has ever been in a long time. But from seeing the mood that the catgirl was currently displaying in front of him, Jon felt like he was breaking her heart, which made him feel very guilty inside, especially for not confessing to Felicia about his fetish.<br>\r\n<br>\r\nSo, in his best attempt to reassure Felicia that he still had feelings for her, Jon wrapped his arms around the catgirl, hugging her as tight as he could without harming her, and answered, \"Felicia, I.....I still love you very much, you've helped me in realizing that it is possible for humans and Darkstalkers to co-exist. It's just that....the reason why I preferred fat girls is, um....is because of how soft their body feels to the touch, as if they're like a giant living pillow or stuffed animal.\"<br>\r\n<br>\r\n\"....So, if I.....if I l-let you fatten me up, then....then you'll still love me?\" Felicia said, stuttering a bit from feeling a little upset, as she looked up at her werewolf lover, wanting to keep the relationship together in one piece. \"Exactly, but....even if you're just a little chubby,I'll still love you no matter what, Felicia.\" Jon replied, delivering a kiss upon Felicia's lips, uplifting her self-esteem back to it's normal parameters. <br>\r\n<br>\r\nIn return, Felicia quickly wrapped her feline arms around Jon with excessive glee, just as the two lovers separated their loving embrace. But suddenly, they both heard the sound of Felicia's stomach growling, making the catgirl blush from the embarrassment then said, \"Well, I guess this would be a good time to make me one fat kitty then. *Giggle* So, what do you plan on feeding me with, exactly?\"</span></div></div>",
            "created":1427202600,
            "id":1953123,
            "title":"Jon Talbain's Fetish"
        },
        "111112":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Take it slow.",
                "Start pigging out!"
            ],
            "content":"<div class=\"\"><div> <span>\"...We should let ourselves go, forget about fighting!\" Jon suggested to his lover.<br>\r\n<br>\r\n\"Aren't we doing that already?\" Felicia responded with a puzzled face. \"We stopped fighting so we can settle.\"<br>\r\n<br>\r\n\"No, what I meant is splurge for the rest of our lives,\" said Jon. Felicia was still puzzled. \"What I'm saying is maybe we should just start packing on the vanity pounds.\" Jon said as he motions his hands around his waist to look as though he was holding a big beer gut. Felicia's ears perked and a got a little surprised by Jon's request. She motioned over to the wolf, grabbed a pillow and said.<br>\r\n<br>\r\n\"You know, I figured you would look damn good with a nice big belly,\" said Felicia as she places the pillow on Jon's waste emphasizing that she agrees with his suggestion.<br>\r\n<br>\r\n\"Like wise. So should we take it slow or just pig out like there's no tomorrow?\"<br>\r\n<br>\r\n\"Ooh, I like where this is going...\"</span></div></div>",
            "created":1308891600,
            "id":1134012,
            "title":"Like Husband, Like Wife"
        },
        "1111122":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "They continue to eat like this for a couple of weeks",
                "They continue to eat like this for a couple of months."
            ],
            "content":"<div class=\"\"><div> <span>Felicia walked over to the phone and called for room service. \"This is Felicia, I would like ten boxes of super sized meat lover style pizza pronto!\" It was the start of new trend for the couple of gorging themselves senseless. The bus boy brought in the pizza, the boxes are open, and the couple begin scarfing down all of the pizza. Felicia munched her way through each slice while her husband topped his slices with hot sauce and rolling them up like burritos and then eating them like that.<br>\r\n<br>\r\nSeveral hours and 30 more boxes of pizza later, the couple's stomachs have gotten tight and bloated. It was a start, but they still have a long way to go. \"Aw, man. I haven't ate like that since our wedding night,\" said Jon as he patted his belly. <br>\r\n<br>\r\n\"No kidding, let's rest first and then go for desert like ice cream,\" Felicia said as she holds her tummy. \"Besides, from all of that hot sauce you've been eating, you're tongue is almost burnt out.\"<br>\r\n<br>\r\n\"Hey now, my tongue can still take the heat!\" Jon jokingly. \"Anyways, since you would like to see me with a big belly, how should I look when we're all done with our new diet?\"<br>\r\n<br>\r\nFelicia eyes her husband, \"Well, for starters you should definitely stay topless. I would like to see that giant belly in all of its glory.\" Jon nods in agreement. \"Now how about me, sweetie?\"<br>\r\n<br>\r\nJon looks at his wife's body and begins to think, \"I would definitely like to see some heavier hips that's for sure and also a little more on top.\"<br>\r\n<br>\r\n\"Ooh, I would like to be bigger on top as well, but there's one thing you should do though.\" <br>\r\n<br>\r\n\"And?\"<br>\r\n<br>\r\n\"Don't have bigger boobs than me!\" The two of them laughed hysterically but then Felicia quickly displays a serious face. \"I'm serious.\" Jon rolled his eyes. <br>\r\n<br>\r\nAs soon the couple got rested, they've ordered ice cream and start to pig out the same way like they did with the pizza. Jon even put hot sauce on his ice cream! </span></div></div>",
            "created":1308978000,
            "id":1134098,
            "title":"Start pigging out!"
        },
        "11111222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Felicia is an immobile, greasy mound of fat but Jon can still barely move",
                "Both Felicia and Jon are both immobile and must be fed with a giant tube"
            ],
            "content":"<div class=\"\"><div> <span>Two months and the couple was showing progress. Jon was sporting a giant belly that stuck out by three feet and enough fat to encompass around Jon's back where it makes a long fold between the love handles and the butt. Felicia on the other hand is more ambitious than her husband to where she was at around two tons! Her once lean tail is now looks more like a giant slug stuck between two giant orbs of ass cheeks. Felicia's belly was something to be marveled, being the biggest part of her body that spreads out like a soft mound only to complimented by her huge and strangely firm pair of breasts. As for Felicia's head, it's surrounded by enough neck fat that looks as though the head was stuffed into an inner tube.<br>\r\n<br>\r\n\"You know, Honey,\" said Felicia while eating a slice of pizza with her flabby, slug-like arm. \"Maybe, we should have a new diet.\"<br>\r\n<br>\r\nJon was caught by surprise while he attempted to eat a mix between a slice of pizza and ice cream covered in hot sauce. \"You mean like losing weight?\"<br>\r\n<br>\r\n\"Hell no!\" replied Felicia. \"I mean I'm getting of eating pizza and ice cream. I want something else! Something very crispy!\"<br>\r\n<br>\r\n\"I know, How about fried chicken and fries?\" Jon answered.<br>\r\n<br>\r\n\"Oh, I like your thinking! Send me several tons of that stuff, I want to be huge!\"<br>\r\n<br>\r\nWith that, fried chicken and fries came in by by the bucket loads. The couple slowly but surely grew in size they never thought possible...</span></div></div>",
            "created":1309669200,
            "id":1139322,
            "title":"Immobilization is almost complete!"
        },
        "111112222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Felicia wants herself and her husband to turn into part of the nature land",
                "Felicia wants periodic bathing times to keep herself and Jon clean."
            ],
            "content":"<div class=\"\"><div> <span>Because of the couples constant feeding, the two of them had to be relocated somewhere outside of Vegas due to their now colossal size. Proposed by the Felicia's council that help run the casino, Felicia and Jon would be placed somewhere in the desert so that it can accommodate their massive sizes and keep the smell of sweaty animals outside the Las Vegas area. Still insist on being feed, Felicia ordered the council that there should be two pipelines going to the mouths of Felicia and Jon so that they can still fatten themselves senseless. It was at that point the couple are no longer capable of moving because of their own fat turning their limbs into mounds of blubber and the weight of their own bodies are impossible to lift, even with cranes! <br>\r\n<br>\r\nDespite of the couple's blubbery sizes, the two have found ways to pleasure each other such as somehow collide their fat against each other which creates sensations they never thought they had. Time continues to pass as the couple ate the stuffing that's being practically pumped into them, their sweat began to to form streams across their bodies and started to collect dirt. The dirt began piling up against the couple's bodies like waves to a beach. It starting to make Jon concerned.<br>\r\n<br>\r\n\"Hey, Felicia?\" asked Jon. \"What should we do with the dirt that's coming around us?\"<br>\r\n<br>\r\nFelicia thought to herself and decided to...</span></div></div>",
            "created":1311829200,
            "id":1156269,
            "title":"We're going need something bigger for these two..."
        },
        "11112":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Take them home and come back for more.",
                "EAT THEM NOW!!!"
            ],
            "content":"<div class=\"\"><div> <span>Somewhere out in an open field in the middle of the day the ferocious feline fighter, Felicia, wanders almost aimlessly while looking at an old map, \"Where's that treasure cave!\" Felicia frustratingly out loud. \"That stupid cave should be here like the map says! I knew that old geezer tricked me in that bet I've made with him. \"Please take this map, it's the only thing I have left.\" Yeah, right! It's not as if he could easily make copies of this worthless thing.\" <br>\r\n<br>\r\nAs she was fuming red, she discovered an old well along with a growling stomach. \"Nya, I'm so hungry, I could go for a nice, big cheeseburger.\" Felicia got to the rim of the well as she clutched the map in her hand. \"You know what, I wish for doughnuts! No an endless amount of doughnuts that taste good and stay good no matter what!\"<br>\r\n<br>\r\nFelicia threw the map down the well in a fit of anger. That's when it happened. As it it turns out that the old well is in fact the treasure cave that map was referring to and by throwing into it will grant any wish that the thrower desired. With a powerful burst of light shooting up from the well into the sky. A pink cloud begins to form overhead and starts to rain...<br>\r\n<br>\r\n\"DOUGHNUTS!!!\" Felicia jumped for joy as the confectionery treats fall from the sky with a seemingly endless amount. \"Oh, what am I going to do with these? Should I take them home and come back for more or do I just eat them right here?\"</span></div></div>",
            "created":1308891600,
            "id":1133876,
            "title":"Doughnuts are a cat's best friend"
        },
        "111122":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "The hourglass effect is a one time deal.",
                "Felicia makes her tubby hourglass even tubbier!"
            ],
            "content":"<div class=\"\"><div> <span>Felicia's stomach have made decision. \"I'm too hungry to think, I need to eat now!\" the cat girl dove right into the mound of doughnuts and begin her eating frenzy. With the 'oms' and 'noms', Felicia gorged on the doughnuts, each of which still haven't lost their taste just like what she wished for. But just like Felicia wished, the doughnuts continue to appear. <br>\r\n<br>\r\nSurprisingly enough, Felicia never felt full and continued to eat her treats until the end of the day. Tired from the effort of stuffing herself senseless, Felicia laid back and begin to marvel her bulging belly that stuck out around two feet. \"Nya, I've never felt better sense ever. Good thing there's still more doughnuts. But now, I need a nap.\" The feline starts to sleep away the night with her engorged belly resting on top of her body. Little did she know, the doughnuts she have been eating have a mystical effect on her body. The fat from her belly slowly transferred into Felicia's breasts, making the already large breasts bigger than before. It was the only place the fat went into, the fat began to sink into her wide hips. By the time the sun finally came up, Felicia's body turn into a tubby hourglass figure.<br>\r\n<br>\r\n\"Dayum, look at the size of these things!\" Felicia said as her first reaction to her new fattened breasts. \"I think those doughnuts I've eaten made these bigger. Hmm...\" Wanting to experiment, Felicia began another feeding frenzy to see if the effects are the same.</span></div></div>",
            "created":1308891600,
            "id":1134047,
            "title":"EAT THEM NOW!!!"
        },
        "1111222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Felicia continued to eat for the rest of the day.",
                "Felicia continued to eat for the next week."
            ],
            "content":"<div class=\"\"><div> <span>\"I just love this new figure, I'll see if I can make it bigger!\" Felicia said to herself as she continues to stuff herself with the endless amount of doughnuts. In the process though, the doughnuts are going straight to her belly. The feeding took several hours until somewhere in the afternoon and the only reason why Felicia stopped wasn't at all because she was full but because she is held down by her giant belly that has gotten so big that Felicia's body is stuck on top of it. \"You know, maybe I shouldn't have ate those donuts at once.\" Felicia thought to herself as she then begins to flail around to get herself to move. \"Dammit, I need to move! Just... need... one... more... doughnut...!\"<br>\r\n<br>\r\nTry as she might, Felicia is trapped by her own fat. Soon enough, Felicia grew tired and fell asleep from her flailing. During her cat nap, Felicia's body then began to change again. This time, most of the fat went straight into Felicia's hips and butt and not just the breasts. The belly however, is still incredibly large but it no longer a hindrance. When Felicia finally woke up, she then marveled her new shape.<br>\r\n<br>\r\n\"Finally, I can move better now!\" Felicia said as she then turned towards the doughnuts. \"Lunch time!\"</span></div></div>",
            "created":1308978000,
            "id":1134115,
            "title":"Felicia makes her tubby hourglass even tubbier!"
        },
        "11112222":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "The wolf is regularly lean.",
                "The wolf has been packing on the pounds!"
            ],
            "content":"<div class=\"\"><div> <span>Day by day, Felicia continued to scarf down the doughnuts and getting fatter by the day. Though there's a hourglass shape to her body, ludicrously huge that is, Felicia ever bulging belly stretches out like a fleshy blob absorbing everything it touches. It was until she over a few tons did she stop eating, but it was only because Felicia thought it would be better to relocate her giant, flabby body. Strangely enough, there are always a set of nearby doughnuts for the taking.<br>\r\n<br>\r\n\"Hmm, I wonder what Jon would think of me if I show myself to him like this?\" Felicia thought to herself. \"Maybe I can surprise him!\" Felicia motioned herself towards Jon's residence to get a surprise out of her boyfriend. She figured out a while ago that Jon had some sort of thing for heavier women. By the time Felicia got to the door, she stuck her hand out in the attempt to knock. But before her hand was close enough to touch the door, it started to open.<br>\r\n<br>\r\nJon was about to come out and...</span></div></div>",
            "created":1309150800,
            "id":1135458,
            "title":"Felicia continued to eat for the next week."
        },
        "11113":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Between games, Felicia gets very comfy with her new pampered lifestyle...",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How's this for an option?</span></div></span></div>",
            "created":1308891600,
            "id":1133852,
            "title":"Something else instead?"
        },
        "111132":{
            "choices":[
                "felicia gets a inflation curse on her",
                "somthing else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok how bout this</span></div></span></div>",
            "created":1340341200,
            "id":1364998,
            "title":"Something else"
        },
        "112":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Air",
                "Water",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will she use to inflate?</span></div></span></div>",
            "created":1216011600,
            "id":557121,
            "title":"Felicia the Balloon"
        },
        "1121":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Felicia's tail get stuck in the hose",
                "One of the women shows up."
            ],
            "content":"<div class=\"\"><div> <span>Felicia was busy for the past hour, using an air tank to fill up balloons for a party she and the other Darkstalkers women were having. She had just finished with the last balloon in the pack and had hung it up. She looked over the set up and was glad to be done as a yawn came over her, thinking she'd take a quick nap, she curled up on the sofa, her tail twiching slightly near the air tank and its hose. Suddenly...</span></div></div>",
            "created":1267333200,
            "id":843749,
            "title":"Cought Napping"
        },
        "11211":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Her started to inflate into a round balloon",
                "Her figure started to inflate"
            ],
            "content":"<div class=\"\"><div> <span>Felicia's tail kept twiching near the hose and found itself being stuck inside the air hose, which didn't wake the catgirl at all. Soon there was a shadow coming near the tank and a hand reached out to turn the air tank on. The air hose came to life and started to pump air into Felicia's tail, making it inflate like a long white balloon, soon...</span></div></div>",
            "created":1267506000,
            "id":844781,
            "title":"Felicia's tail get stuck in the hose"
        },
        "112112":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Woke her up",
                "Add another hose"
            ],
            "content":"<div class=\"\"><div> <span>The air started to enter other parts of Felicia's body besides her now huge long tail. Her breasts inflated like two party balloons, quickly reaching double f size within moments. Hey hips and rear soon cought up with her ballooning breasts, even her belly swelled up as an afterthought.  Even with all this going on, Felicia was still asleep, though she shifted as she slept. As her body kept inflating the female shadow walked up to her and...</span></div></div>",
            "created":1267592400,
            "id":845257,
            "title":"Her figure started to inflate"
        },
        "1121122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Morrigan, wanting some sexy fun",
                "Bulleta, wanting to use her as a wolf lure..."
            ],
            "content":"<div class=\"\"><div> <span>The stranger added another hose, this time to Felicia's mouth. The sleeping kitty blew up twice as fast now, her figure starting to round out, bellybutton popping out in amusing unison with her nipples, which poke out from her fur and bloat up as separate balloons..<br>\r\n<br>\r\nBy now, Felicia finally wakes up, screaming as she sees herself. She looks to see who did this, and discovers that her inflator is...</span></div></div>",
            "created":1267938000,
            "id":847235,
            "title":"Add another hose"
        },
        "11211221":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Starts to blow into her mouth",
                "Uses a spell that turns all the air inside Felicia into helium"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan knelt down next to Felicia and stroked her inflating breasts softly. \"Hmmm...you are inflating nicely my kitten. Just as I hoped you would.\" Seeing that she was getting big enough, Morrigan removed the hose from Felicia's lips and took her now balloon like head in her hands. \"Morrigan? Why...\" Before Felicia could finish her question, Morrigan brought her closer and kisses her right on the lips. The kiss stunned Felicia as she wasn't expecting it, but what Morrigan did next only stunned her more as she...</span></div></div>",
            "created":1267938000,
            "id":847260,
            "title":"Morrigan's new balloon kitten"
        },
        "112112211":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Felicia isn't floating...yet",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan started to blow into Felicia's mouth, making the catwoman's breasts and belly inflate even more. Her tail got so big that the air hose popped off, leaving a huge beachball like balloon. Morrigan kept blowing more and more into the already hugely inflated Felicia, her head swelling up to match her tail and her breasts pressing greatly against Morrigan as she started to be pushed away from Felicia. Soon she finally broke the kiss and stroked Felicia's inflating body. \"You'll make the perfect balloon for me...but...you are missing one thing...\"</span></div></div>",
            "created":1270011600,
            "id":859868,
            "title":"Morrigan's Air Kiss"
        },
        "1121122111":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "into a giant parade balloon",
                "into a giant, perfectly round balloon"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan grins evilly and takes the hose from the tank and sticks it back onto Felicia's tail, turning it on full \"You aren't floating yet, my little balloon~\" she murrs, watching the helpless catgirl inflating rapidly again, she would grow even bigger and she soon inflates...</span></div></div>",
            "created":1368248400,
            "id":1587979,
            "title":"Felicia isn't floating...yet"
        },
        "1123":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Helium",
                "Magic",
                "Sange Passare"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She could always use helium, or perhaps be the victim of a magic spell gone wrong... Or perhaps you'd like to choose a darker option, like Jedah's famous blood pump technique...</span></div></span></div>",
            "created":1216357200,
            "id":557136,
            "title":"Other inflation options"
        },
        "113":{
            "choices":[
                "Air",
                "Water",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, now what method will she choose to get bigger up front? *wink wink*</span></div></span></div>",
            "created":1316322000,
            "id":1189545,
            "title":"Breast expansion"
        },
        "1132":{
            "author_id":"derp2425",
            "author_name":"nyan",
            "choices":[
                "FF",
                "Big as the room"
            ],
            "content":"<div class=\"\"><div> <span>Felicia was prowling around the city and was ambushed by someone. She woke up in a dark room, tied to a chair.<br>\r\n\"Hey where am I?!\"<br>\r\nSuddenly a hose came from the ceiling and attached to her chest and started pumping water into them.<br>\r\n<br>\r\nHow big do they get?</span></div></div>",
            "created":1381035600,
            "id":1675211,
            "title":"Water"
        },
        "11321":{
            "author_id":"byakko",
            "author_name":"Shirokage",
            "choices":[
                "someone enters room",
                "she plays with them more"
            ],
            "content":"<div class=\"\"><div> <span>the water starts to rush into Felicia's breasts and they swell up. Felicia panics at first, but after noticing her breast grow, she calms down; liking the size of them. they now look like swollen watermelons. <br>\r\n<br>\r\nshe sits up to look at them and feel them; those plump breasts jiggling in her hands.</span></div></div>",
            "created":1572059160,
            "id":2738461,
            "title":"FF"
        },
        "11322":{
            "author_id":"byakko",
            "author_name":"Shirokage",
            "choices":[
                "they break the room"
            ],
            "content":"<div class=\"\"><div> <span>they start filling Felicia's breasts up quickly; making her feel a sudden pain in her chests for a bit. she feels her breasts get heavier and heavier, and feels them cover her stomach and feet quickly, and then feel them on her face. they finally stop after a few seconds; now touching the walls of the room.</span></div></div>",
            "created":1572059520,
            "id":2738463,
            "title":"Big as the room"
        },
        "1133":{
            "choices":[
                "Magic.",
                "Science.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Felicia get bigger boobs?</span></div></span></div>",
            "created":1327640400,
            "id":1266481,
            "title":"More methods."
        },
        "114":{
            "choices":[
                "Air",
                "Water",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good choice, now choose your method.</span></div></span></div>",
            "created":1316322000,
            "id":1189548,
            "title":"Butt expansion"
        },
        "1142":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Make her butt bigger",
                "Wait for something to happen",
                "Jon Talbain walks in"
            ],
            "content":"<div class=\"\"><div> <span>Felicia found herself in a laboratory all by herself. She was on a hospital bed restrained by metal bars. Two tubes were leading from a machine to her round butt cheeks.<br>\r\n<br>\r\n\"Where am I?!\" She shouted<br>\r\n<br>\r\nThe machine started up and pumped water through the tubes. The water entered Felicia causing her butt to grow larger.<br>\r\n<br>\r\n\"What are you doing to me?! Stop it!\"<br>\r\n<br>\r\nHer ass grew until it was fifty inches wide and jiggling. The tubes popped out and the restraints released her. She hopped out of bed making her now large butt jiggle. The was a mirror in the corner of the room, she rushed to see what they did to her. She looked at her butt in the mirror, running her hands down her hips and squeezing a cheek.<br>\r\n<br>\r\n\"Why did the make my booty big?\"<br>\r\n<br>\r\nFelicia looked around the room, confused. There was a door but it was locked.<br>\r\n<br>\r\nWhat does Felicia do?</span></div></div>",
            "created":1345352400,
            "id":1407922,
            "title":"Water"
        },
        "11421":{
            "author_id":"derp2524",
            "author_name":"derp",
            "choices":[
                "The door unlocks, putting another person in the room",
                "Even Bigger"
            ],
            "content":"<div class=\"\"><div> <span>She got a sly grin on her face.<br>\r\n\"Hmmm...\"<br>\r\nShe caresses her bottom, making it jiggle slightly.<br>\r\n\"Heh, heh, Well, I don't think it's big enough!\"<br>\r\nShe rushes back to the bed, hooks the hoses back up to her butt, and they automatically start pumping water into her cheeks.<br>\r\nAfter a while, she'd had enough and went back to the mirror to see the size. She was surprised to see that they had doubled and grown immensely. They were roughly 100 inches around.<br>\r\n\"Oooo... I like this...\"<br>\r\nShe starts wiggling her butt around watching them jiggle.</span></div></div>",
            "created":1400907600,
            "id":1801658,
            "title":"Not big enough"
        },
        "11423":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "No Distractions",
                "Intruder"
            ],
            "content":"<div class=\"\"><div> <span>The door swung open revealing Jon Talbain.<br>\r\n<br>\r\n\"Johnny!\" Felicia said<br>\r\n<br>\r\nShe ran up and hugged the blue wolf, Jon returned the hug.<br>\r\n<br>\r\n\"Are you alright? What are you doing here?\"<br>\r\n<br>\r\n\"I just woke up here and they did something to me.\"<br>\r\n<br>\r\n\"Same thing happened to me but......uh, Felicia.....your....\"<br>\r\n<br>\r\nIt obvious what he noticed.<br>\r\n<br>\r\n\"These weird tubes made my butt bigger and....Jon? Johnny!!\"<br>\r\n<br>\r\n\"What?!\"<br>\r\n<br>\r\n\"Your hands are on my ass.\"<br>\r\n<br>\r\nJon's hands had moved down to Felicia's large ass without him knowing. His hands squeezed her rump.<br>\r\n<br>\r\n\"I'm sorry I just......wow, you look so sexy.\"<br>\r\n<br>\r\nFelicia blushed but soon she smiled.<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\nHis hands started rubbing her butt cheeks. <br>\r\n<br>\r\n\"And I thought you were hot before but now......damn, girl look at this big booty!!\" He slapped her big ass<br>\r\n<br>\r\n\"Oh, Johnny.\" She said as they started to make out<br>\r\n<br>\r\nJon's long canine tongue wrestled with Felicia's. She tugged at the waistband of his pants and slipped them off. Jon's long doggy cock flopped out. Jon picked her up bridal style and set her down on the bed. Felicia positioned herself on her hands and knees. Jon slapped her ass.<br>\r\n<br>\r\n\"Good kitty.\" He said climbing on the bed \"Shake that ass for me.\"<br>\r\n<br>\r\nFelicia's water filled ass jiggled around like jello. Jon took her ass in both hands and let out a groan.<br>\r\n<br>\r\n\"Goddamn it's big. So nice and thick!\"<br>\r\n<br>\r\nJon grabbed his dick and rubbed it between her cheeks. His tip pressed against her anus.<br>\r\n<br>\r\n\"We've never done that before.\" She sounded nervous<br>\r\n<br>\r\n\"You've never had a big cushion like this. Don't worry I'll be gentle, babe.\"<br>\r\n<br>\r\nJon slowly entered her ass and Felicia put a pillow to her mouth to muffle her groans. Jon grabbed her breasts for support and gently humped her big behind.<br>\r\n<br>\r\n\"Let me know if I go too fast.\"<br>\r\n<br>\r\nHis pace got a little faster but nothing too painful.<br>\r\n<br>\r\n\"It hurts.\" <br>\r\n<br>\r\n\"Shh, it's okay.\" He kissed the back of her neck<br>\r\n<br>\r\nSoon she adapted to his side and their anal fucking started to feel good.<br>\r\n<br>\r\n\"Go faster.\"<br>\r\n<br>\r\n\"Okay baby.\"<br>\r\n<br>\r\nJon put his hands on er hips and fucked her ass faster. Her butt smacked against his crotch making a loud noise.<br>\r\n<br>\r\n\"Keep going!\"<br>\r\n<br>\r\n\"You got it!\" He said slapping her ass, getting a happy squeal out of his sexy kitty<br>\r\n<br>\r\nDo these two continue their sex uninterrupted or does someone walk in?</span></div></div>",
            "created":1345352400,
            "id":1407937,
            "title":"Jon Talbain walks in"
        },
        "114232":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Morrigan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The two's passionate moaning was interrupted by the door opening.<br>\r\n<br>\r\nWho walks in?</span></div></span></div>",
            "created":1345352400,
            "id":1408521,
            "title":"Intruder"
        },
        "1142321":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Butt expansion ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I see you two are enjoying yourselves.\" Morrigan said <br>\r\n<br>\r\nJon got off of Felicia out of surprise. He got a good look at Morrigan. Her body had been altered as well.<br>\r\n<br>\r\nWhat has been changed?</span></div></span></div>",
            "created":1348117200,
            "id":1432006,
            "title":"Morrigan"
        },
        "11423211":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Oral",
                "More anal"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan's hips and ass were swelled to an unbelievable size.  She was even bigger than Felicia.<br>\r\n<br>\r\n\"I hate to spoil your good time here,\" She put her hands on those beautiful hips \"but I think we should find who did this to us.\"<br>\r\n<br>\r\nJon got off the bed, not even bothering to put on his clothes. He walked over to Morrigan with a sly grin on his face.<br>\r\n<br>\r\n\"Oh I don't know, I think this is a good look for you.\" He walked past her and gave her rump a slap. <br>\r\n<br>\r\nHe wrapped his arms around her waist from behind and pressed his hard cock against her huge butt.<br>\r\n<br>\r\n\"Definitely turns me on.\"<br>\r\n<br>\r\n\"You like it, huh?\" She backed herself into his crotch \"Well if you help me I'll owe you. Then before I change back you and I can do a little something.\"<br>\r\n<br>\r\nShe started gyrating herself on him.<br>\r\n<br>\r\n\"How about right now?\" He asked as he started to lightly hump her<br>\r\n<br>\r\n\"That's fine. The only other question is, what do you want to do?\"<br>\r\n<br>\r\n\"I want to fuck your big ass.\"<br>\r\n<br>\r\nShe released herself from his grip and unzipped her suit. It fell to the floor and she bent over the bed. Her two big buttcheeks in full view.<br>\r\n<br>\r\n\"Let's get to it then.\"<br>\r\n<br>\r\nJon pounced on her and howled as her trust his throbbing dick up her ass. She let out a yell.<br>\r\n<br>\r\n\"Don't be afraid of getting rough with me, you're only getting it once.\"<br>\r\n<br>\r\n\"I doubt that.\" He said slapping her ass<br>\r\n<br>\r\nMMM, yeah, spank my ass.\" she moaned<br>\r\n<br>\r\nJon took his time slowly pulling out and going back in. He grabbed a handful of her ass and squeezed as he gave her a hard thrust. <br>\r\n<br>\r\n\"AH! Oh, god!\"<br>\r\n<br>\r\nFelicia got tired of waiting and wrapped her arms around Jon's neck The two kissed as Jon fucked Morrigan. He reached behind to grab Felicia's butt and used his free hand to spank Morrigan. Jon hadn't missed a beat and was still pummeling her big behind.<br>\r\n<br>\r\n\"AH! AH! AH! Give it to me harder!!\"<br>\r\n<br>\r\nMorrigan was making an awful amount of noise. Should Jon put her mouth to better use or forget about it?<br>\r\n<br>\r\n </span></div></div>",
            "created":1352264400,
            "id":1463479,
            "title":"Butt expansion "
        },
        "114232112":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Threeway",
                "Get the fuck out"
            ],
            "content":"<div class=\"\"><div> <span>Her yelling makes Jon's fur stand on end. He let's out a satisfied groan into Felicia's mouth and he french kisses her. He sucks her tongue and delivers a swat to the side of Morrigan's ass. Her breaks off the kiss and nips Felicia's neck.<br>\r\n<br>\r\n\"Bend over, pretty kitty~\" He whispers in her ear and smacks her butt.<br>\r\n<br>\r\nFelicia eagerly bends over beside Morrigan. Their two fat asses looked great side by side. The sight of these two full moons made Jon's blood boil. Her pulled out of Morrigan's ass and plunged himself into Felicia's rump, making her grunt. He slammed his crotch into her making her ass bounce around. He shuddered in pleasure seeing her body lurch forward with his powerful slamming. <br>\r\n<br>\r\nMorrigan looked at her in envy as Felecia got fucked by big wolf cock. The wolf cock that SHE had only seconds ago. Jon knew how to fuck. No one had made her feel that good, that full, that....wild. She and Jon lock eyes as he fucks Felecia. He smiles devilishly at her and winks. He then mouths the words \"You're next\". She smiles at him. She was so hot for that wolf.<br>\r\n<br>\r\nFelecia began to make high pitch squealing noises. She clawed around desperately.<br>\r\n<br>\r\n\"Johnny~ I'm gonna cum!\" She moaned out<br>\r\n<br>\r\n\"So soon?\" He said \"Well, let's help you get yours then~\"<br>\r\n<br>\r\nHe pounded his feline lover extra harder. Each time his crotch hit her butt she yelped out in ecstasy. Jon began growling excitedly as he felt her ass tighten around him. She came and she  screamed loudly. She scratched the bed ripping the sheets.<br>\r\n<br>\r\n\"Oh yes, that's my wild kitty!\" He yelled out <br>\r\n<br>\r\nJon pulls himself out of her, not even close to his orgasm. Felicia looks back at him looking pleased. She giggled and said \"I think Morrigan is ready for you now~\"<br>\r\n<br>\r\nJon turned to face Morrigan and was met with the succubus wrapping her arms around his neck and yanking him into a kiss. He growled into her kiss and laughed as he grabbed her big meaty ass. The two made out furiously as they groped each other. He moaned and spanked her. Her broke the kiss to say \"You have such a fat ass~\"<br>\r\n<br>\r\nHe picked her up and tossed her on the bed. She turned on her stomach trying to get up but Jon hopped on the bed with her. Her grabbed her deliciously wide hips and Positioned her how hew wanted, with her on all fours with that ass up in the air. He let out an aroused growl as he leaned down and licked her fat rump.<br>\r\n<br>\r\n\"Oh bring me that big booty~ Mmm, bring me that big booty~\" HE groaned as he rubbed cock and mashed his face into Morrigan's rear end.  Her began to dry hump her from behind. His hands digging into her big cheeks. <br>\r\n<br>\r\n\"Ooh~ Is your big booty ready to party with the big bad wolf?\" He said slapping both her thick cheeks.<br>\r\n<br>\r\n\"Oh my god, yeah~ Let's pick up where we left off, wolf!\"<br>\r\n<br>\r\nHe gripped her ass and with a single stern thrust his big member went right up her butt again. Her had a dumb toothy grin on his face feeling the tightness constrict him. He let out a loud ear piercing howl and his ears shot up. <br>\r\n<br>\r\n\"Fuck yeah!\" Her shouted as her began pumping in her. Her shook his head and growled. \"Ohh~ Wolfy needs to howl at the moon, baby!\" He howl again as he plunged his long rod deeper into her tight warm ass. Morrigan gripped the partially sheets while gritting her teeth and let out a pained but excited noise. She strained to be quiet which frustrated Jon.<br>\r\n<br>\r\n\"No, no, no, baby, you gotta let it out. Scream loud and proud!\" He pulled his hips back and thrust forward while pulling that fat ass into him. He quickly fucked her big ass like there was no tomorrow. He slapped her firm ass hard and said \"Howl with me!\" HE pulled his cock out until only the tip remained. He rammed it back it and the two passionate lovers howled. HE leaned over her and humped her backside like a mutt.<br>\r\n<br>\r\n\"Yeah~ Uh-huh~ That's it! Pound that big fucking booty!\" Morrigan yelled out, driven crazy by the wolf dick up her butt.<br>\r\n<br>\r\nJon was having the time of his life. He was getting fuck not one but two big ass beauties in one day. He pounded away at her thick ghetto booty occasionally howling. Her leaned down  and grabbed her heavy tits. His thumbs circled her nipples. Her kisses the back of her neck and nips her ear all while giving her a good hard animalistic butt fucking. The two of them screamed and howled together.<br>\r\n<br>\r\n\"Oh yeah~ Hit that, baby! Hit it!!\" She yelled at him.<br>\r\n<br>\r\nHer smacked her ass again and again until the spot turned red. <br>\r\n<br>\r\n\"FUCK YEAH!!\" She shouted back at her \"Oh, you fucking like that big wolf dick up your booty, don't you?\"<br>\r\n<br>\r\n\"YES!\"<br>\r\n<br>\r\n\"OH~ Am I still only gonna get it once?\"<br>\r\n<br>\r\n\"Yes can get it any time you want it! AH!!\"<br>\r\n<br>\r\n\"You're gonna keep this big booty for me?\"<br>\r\n<br>\r\n\"OH my god, yes!\"<br>\r\n<br>\r\nHe howled louder than ever before and pummeled her giant ass again. Morrigan's orgasm was approaching. She yelled, cursed and moaned loudly as she was pushed to orgasm. Jon's eyes shot wide open as his own orgasm suddenly reared it's head. He pushed Morrigan flat onto the bed and with one final grunt shoved his cock as far as it could go up her rear. His load fired up her but and he yelled out in ecstasy. Morrigan came as well and yelled with her canine lover. <br>\r\n<br>\r\n\"Yes....\" He sighed as his ropes of cum went inside her.<br>\r\n<br>\r\nThe two stayed there panting for a few minutes until Jon rolled off.<br>\r\n<br>\r\n<br>\r\nThat was pretty crazy. Does Jon get into a threeway with his ladies or do they decide to leave the room and figure out what's going on?</span></div></div>",
            "created":1427086800,
            "id":1952471,
            "title":"More anal"
        },
        "115":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Giantess",
                "Fruitification - Cherry",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you'd prefer one of these choices...?</span></div></span></div>",
            "created":1216011600,
            "id":559813,
            "title":"More options"
        },
        "1153":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle growth",
                "Hourglass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe some muscle or hourglass expansion?</span></div></span></div>",
            "created":1216011600,
            "id":555965,
            "title":"Final options"
        },
        "11531":{
            "choices":[
                "She wished for it.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she gain more muscle?</span></div></span></div>",
            "created":1315630800,
            "id":1184543,
            "title":"Tough kitty!"
        },
        "115312":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Steroids",
                "Working out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Felicia decides to give some powerful new steroids a try and they work better on her supernatural body than she'd expected? Or maybe she's been doing loads of intense workouts lately?</span></div></span></div>",
            "created":1316062800,
            "id":1187724,
            "title":"Something else."
        },
        "11532":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Seeking for it.",
                "Happens on accident."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it something she wants or it happens to her?</span></div></span></div>",
            "created":1315630800,
            "id":1185024,
            "title":"Hourglass"
        },
        "12":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Breast expansion",
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Your choice is Morrigan? You, friend, have good taste. Now then, what will you choose as her expansion?<br>\r\n<br>\r\n* Fattening up<br>\r\n<br>\r\n* Inflating into a balloon<br>\r\n<br>\r\n* Breast growth<br>\r\n<br>\r\n* Butt growth<br>\r\n<br>\r\n* Something else entirely</span></div></div>",
            "created":1216184400,
            "id":556390,
            "title":"Morrigan"
        },
        "121":{
            "author_id":"iheartpepsi",
            "author_name":"iheartpepsi",
            "choices":[
                "Forcefed",
                "Magic ",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it, happen?</span></div></span></div>",
            "created":1489803660,
            "id":2291163,
            "title":"Weight gain"
        },
        "1212":{
            "author_id":"iheartpepsi",
            "author_name":"iheartpepsi",
            "choices":[
                "Spell",
                "Potion",
                "Curse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one ?</span></div></span></div>",
            "created":1489804620,
            "id":2291165,
            "title":"Magic "
        },
        "122":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Water Expansion",
                "More Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Inflation for Morrigan?</span></div></span></div>",
            "created":1309150800,
            "id":1135538,
            "title":"Inflation"
        },
        "123":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Pulls out a magic potion",
                "Finds several tanks of unused air "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Morrigan retracts her wings and lands beside a store leading into an alley; she turns the corner into the alley and...</span></div></span></div>",
            "created":1260939600,
            "id":806425,
            "title":"Breast expansion"
        },
        "1231":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "She continues inflatting her breasts",
                "She focuses on an hourglass"
            ],
            "content":"<div class=\"\"><div> <span>     Taking several steps more into the alley, Morrigan finally pulls a flask bottle of warm glowing red liquid from between her already plump breasts and alongside a note of instructions alongside the bottle. She quickly scans the paper and then throws it away, \"So the user can determine what part to grow simply by focusing her thoughts on it?\". Swigging down a portion of the potion, Morrigan immediately thinks about her breasts and then licks the rest of what's around her mouth.<br>\r\n      Immediately Morrigan could feel a warm sensation in her breasts, immediately she looks down on them and discovers that they were already beginning to expand. Her boobs were the size of melons now, quickly grabbing them, Morrigan saw that they did not feel heavy and she pushed them together making them burst forth like two full balloons. Her breasts continued to grow, and already she grew concerned of if they were ever going to stop; at about a rough size of two large watermelons, they finally ceased growing. Morrigan, afraid that her cleavage would cursh the flask, digs between the firm melons and plucks out the flask as they gave a small bounce that was almost sensational to her. Shall I continue, or should I expand something else?</span></div></div>",
            "created":1260939600,
            "id":806428,
            "title":"Pulls out a magic potion"
        },
        "12311":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "she flys on the roof",
                "she gets trapped"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan puts her hands beneath her watermelon size boobs and lifts them, they're not quite big enough, heck I should focus all the contents of the potion into expanding my bust; With a large gulp from the bottle, Morrigan finishes the potion and then drops the flask immediately breaking onto the floor. Once again she could feel her breasts beginning to expand again. With a rumble that shook her breasts Morrigan looked down with narrowed eyes and grinned as her breasts soon began to grow into the size of beach balls. \"If I stay here, my boobs will trap me between this alley\", Morrigan quickly flew up as her breasts continued to grow now into a size of 14 feet.</span></div></div>",
            "created":1260939600,
            "id":806432,
            "title":"She continues inflatting her breasts"
        },
        "123112":{
            "author_id":"libagmanbe",
            "author_name":"Libagman",
            "choices":[
                "She decides to shrink a little bit",
                "She decides to get bigger boobs"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly she couldn't fly up anymore because of her now 17 feet boobs get trapped between the alley.<br>\r\nMorrigan tried to get out without any succed then she turned her sight to the left and she saw a bottle with a blue brilliant liquid inside of it</span></div></div>",
            "created":1551598620,
            "id":2625706,
            "title":"she gets trapped"
        },
        "12312":{
            "author_id":"libagmanbe",
            "author_name":"Libagman",
            "choices":[
                "She decides to grow her breast and butt",
                "She decides to get some muscle"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan decided to drink a litlle bit more of that magic posion as she imagined her butt three times bigger and when she looked down to her butt she saw it growing slowly but pleasantly<br>\r\nAfter a few seconds her now enormous butt has stopped it growing <br>\r\nThen she touched her butt and felt how soft it was</span></div></div>",
            "created":1551597960,
            "id":2625699,
            "title":"She focuses on an hourglass"
        },
        "1232":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Lure one of the other darkstalker girls into the alley and use the spell on them",
                "Use the spell on herself"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Morrigan found a few tanks of differant gasses, mostly air and helium. She suddenly remebered a spell she had that could turn anyone into a living balloon which she could fully control and it gave her an idea...</span></div></span></div>",
            "created":1267506000,
            "id":844790,
            "title":"Air tanks"
        },
        "12322":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "An air tank",
                "A helium tank"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan smiled softly as she used the spell on herself and very quickly felt her whole body become much lighter as if she was full of air and hollow inside, even her wings had become rubbery and part of her now balloon body. She rubbed herself down, hearing the squeaks her new body gave her and it gave her shivers of pleasure. Morrigan walked over to the tanks and found there were some air and helium tanks, after awhile she took the hose from...</span></div></div>",
            "created":1270011600,
            "id":859872,
            "title":"Rubbery Morrigan"
        },
        "123222":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "her breasts started to inflate",
                "her whole body started to inflate"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan took the hose from the helium tank and put it into her mouth, her now rubbery body tensed up as she reached out for the valve and turned it slowly, she heard a hissing sound followed by the gas flowing into her mouth. Soon she felt her body tighten up as...</span></div></div>",
            "created":1303275600,
            "id":1091343,
            "title":"A helium tank"
        },
        "1232221":{
            "author_id":"throne642",
            "author_name":"shinn",
            "choices":[
                "Goes to the nearby open field by herself.",
                "To go and blow up someone else for fun."
            ],
            "content":"<div class=\"\"><div> <span>Morrigan begins to watch as her own breasts start inflating with helium. Morrigan's boobs inflate bigger and bigger and Morrigan is enjoying it as her boobs just continue getting bigger and lighter. Morrigan, who usually has natural basketball boobs has now inflated herself into a pair of beach ball boobs and from there she get to the point where her boobs are half her own height. Morrigan just rubs her jugs while they inflate not minding the fact the her boobs are now too big for the alley she's in and are packed in so tight that she can't get out. At this point, Morrigan turns her helium tank off and stops her \"bigger then herself\" boobs from inflating to popping size. <br>\r\n<br>\r\nMorrigan squeezes her jugs with her hands and says, \"Oh my, maybe i should have selected a better location for my inflatable breasts to fill up.\" Morrigan tries to squeeze her boobs tightly enough so she can get out but she's just too big to do so. Morrigan gives up on squeezing them and decide to just deflate herself down to a more, reasonable and mobile size. Morrigan stretches her rubber arms across her breasts and pinches them to deflates them. Morrigan lets out enough helium from her breasts that now she's able to move about and get out of the alley and her breasts are back down to their \"half her height\" size. Morrigan strokes her breasts and says, \"This feels great, i should go somewhere and just go all out on my chest.\" Morrigan then recalls that her spell can make anyone into a balloon and says, \"Then again, maybe going all out on someone else's body could be even more fun.<br>\r\n<br>\r\nMorrigan weighs her super inflatable options and goes with...</span></div></div>",
            "created":1367730000,
            "id":1585017,
            "title":"her breasts started to inflate"
        },
        "12322211":{
            "author_id":"byakko",
            "author_name":"Shirokage",
            "choices":[
                "travels the world",
                "someone discovers her"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan finds a field that's perfect for her to inflate her huge breasts. she starts inflating them; making them grow so large, they touch the grass on the ground. they also seem to cover the sun from Morrigan's eyes. the more and more they grow, the bigger an lighter they get until Morrigan's floating around the world with her large jugs.</span></div></div>",
            "created":1572060600,
            "id":2738469,
            "title":"Goes to the nearby open field by herself."
        },
        "124":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Lilith",
                "B.B. Hood? That psycho was doing something that didn't involve killing?",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan was in one of her human world outs. it was the one where she wore a white shirt and orange pants.<br>\r\n<br>\r\nCurrently, she was sitting in a night club, drinking a bit. She had taken to the hobby of breaking up couples. Sure, it was cruel, but Morrigan was bored enough to try it.<br>\r\n<br>\r\nBut however, one of the couples she had broken up was one that a fellow darkstalker had. <br>\r\n<br>\r\nThe darkstalker had wanted to try their hand at a normal relationship and had disguised themselves as a human. They even managed to hide their power, so they could be in peace for a bit.<br>\r\n<br>\r\nWhen Morrigan had broken up the relationship, Morrigan merely laughed and told them it was their fault.<br>\r\n<br>\r\n<i>'Your last drink held a butt expansion potion in it. Unluckily for you, it was one of the faulty brews that will make your rear more sensitive as it grows. I'm going to have fun watching you get enslaved to your own butt, you green-haired hussy!'</i> The darkstalker thought, with an evil grin. They were in the night club as well, but under a disguise.<br>\r\n<br>\r\nWho was the Dakstalker that was getting revenge?</span></div></div>",
            "created":1335934800,
            "id":1327825,
            "title":"Revenge by Butt Expansion"
        },
        "1242":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Morrigan then got up to dance.",
                "Morrigan then left the Night Club",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>B.B. Hood smiled as she drank.She thought about what lead up to this situation.<br>\r\n<br>\r\nNormally, anything she did involved a lot of gunfire, blood, and death. But one day, she wanted to see what it was like to live peacefully. She had no jobs or bounties lined up and she had plenty of cash. <br>\r\n<br>\r\nShe managed to find an apartment and moved in, under the name Bernice. One day, she struck up a relationship with a neighbor. He was kinda cute in her eyes and he somehow managed to make her feel the slight pangs of love. She realized deep down that she would have to end the relationship and never reveal what she did for a living to him. She wanted to keep this period of time special in her heart.<br>\r\n<br>\r\nThen Morrigan showed up while B.B. Hood was out on a date with her neighbor. The Neighbor actually refused to break things off with B.B. Hood, no matter what Morrigan promised. Then Morrigan used her Succubus hypnotizing eye on him. The Neighbor then broke up with B.B. Hood and followed Morrigan like a puppy.  B.B. Hood yelled at Morrigan to undo it. Morrigan laughed and said it was not her fault, it was Bernice's for having an flat body.<br>\r\n<br>\r\nBecause it was not his choice, B.B. Hood did not kill her neighbor. She merely settled for breaking one of his arms and then paying for his hospital bill. Hey, she may be a psycho, but she did enjoy her brief time with him.<br>\r\n<br>\r\nB.B. Hood then shook herself out of memory lane and watched Morrigan move about in her seat, as if her behind was itchy. <br>\r\n<br>\r\nB.B. Hood smiled. That was one of the first signs that the potion was working.</span></div></div>",
            "created":1336107600,
            "id":1329756,
            "title":"B.B. Hood secretly slipped Morrigan the potion"
        },
        "12421":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "The guy came to the night club with his girlfriend",
                "The guy came to the night club with his friends."
            ],
            "content":"<div class=\"\"><div> <span>B.B. watched as Morrigan got up and headed out to the dance floor. <br>\r\n<br>\r\n<i>'Ah good. Now I don't have to worry about any losers walking up to me like I'm a silver metal to Morrigan's gold metal. They'll all be on the dance floor.'</i> B.B. Hood thought.<br>\r\n<br>\r\nAs Morrigan bumped, rubbed and grinded her body against the guys in the crowd, Morrigan began to get the feeling something was a bit off.<br>\r\n<br>\r\n<i>'Normally, I'm not this horny this fast. Could I have gotten drunk from my drinks? Or could a potential mate be nearby?</i> Morrigan thought.<br>\r\n<br>\r\nShe gasped when she grinded her bottom against one guy because this particular grind was more pleasing then the earlier ones that night. She turned around a bit and saw that he kinda looked a bit like a nerd.<br>\r\n<br>\r\n<i>'Doesn't seem like the type to go to a club, but perhaps Fate has brought me a potential mate?</i> Morrigan thought. Unknown to Morrigan, it was more of the potion's effects than the guy's touch.<br>\r\n<br>\r\n\"What brings you here?\" Morrigan asked.</span></div></div>",
            "created":1336366800,
            "id":1331305,
            "title":"Morrigan then got up to dance."
        },
        "124212":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Your choice",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>\"My... uh...My friends made me come. Now I'm glad they did.\" the guy said.<br>\r\n<br>\r\n\"So where are they?\" Morrigan asked.<br>\r\n<br>\r\n\"Over there, getting drunk and hitting on whatever girls come by.\" the guy said, as he pointed out a few people by the bartender. They were a bit boisterous and seemed well on their way on getting thrown out.<br>\r\n<br>\r\n\"How loyal are you to them?\" Morrigan asked, a bit curious. The nerdy guy and his so-called friends didn't seem likely to be friends in her eyes.<br>\r\n<br>\r\n\"Um... I dunno. We hang out together and go to bars.... I guess were more associates and acquaintances then friends....\" The guy said.<br>\r\n<br>\r\n\"Tell you what, how about we head over to my apartment and have some real fun?\" Morrigan asked, with excitement showing in her eyes and a devious smile on her face.<br>\r\n<br>\r\n\"Su-Sure!\" the guy said, with a slight stammer.<br>\r\n<br>\r\n\"Oh my, I forgot my manners. My name is Morrigan, what is yours?\" Morrigan said.<br>\r\n<br>\r\n\"My name is Dan.\" the guy said.<br>\r\n<br>\r\nThe two then left the nightclub, Though, Morrigan kept putting Dan's hand on her rear because she liked the pleasure it somehow brought.<br>\r\n<br>\r\nB.B.Hood fumed a bit, but kept silent as she followed them</span></div></div>",
            "created":1336453200,
            "id":1332872,
            "title":"The guy came to the night club with his friends."
        },
        "1242121":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Your choice",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>As the couple walked though the streets, they chatted.<br>\r\n<br>\r\n\"My apartment is around the corner.  You don't mind if I order takeout when we get there?\" Morrigan asked.<br>\r\n<br>\r\n\"I-I don't mind.\" Dan muttered.<br>\r\n<br>\r\n\"Or should we skip dinner and..?\" Morrigan asked, with a smile.<br>\r\n<br>\r\n\"W-Whatever you want to do..\" Dan quickly said.<br>\r\n<br>\r\n\"I guarantee that you will remember this night as the best night of your life...\" Morrigan replied.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nB.B. Hood followed them to an apartment building near a multistory car-park. After using some energy-tracking device to follow Morrigan's energy signature to the third story of the apartment building, B.B. Hood went to the third level of the Car park. Fortunately for B.B. hood, Morrigan's apartment windows were facing the car park.<br>\r\n<br>\r\nFrom her vantage point B.B. Hood watched and hoped that Morrigan would become enslaved to both her butt and also to the nerdy guy.<br>\r\n<br>\r\n\"Be a fitting punishment for the Green-haired hussy...\" B.B. Hood muttered.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nThe apartment was pretty clean and had a lot of expensive thing lying around.<br>\r\n<br>\r\nDan thought Morrigan was naturally tidy.<br>\r\n<br>\r\nunknown to Dan, Morrigan used imps to clean the place before she and Dan arrived.<br>\r\n<br>\r\n\"Let me get into something more... relaxing...\" Morrigan said, before leaving Dan alone in the living room.</span></div></div>",
            "created":1338526800,
            "id":1349919,
            "title":"In her apartment"
        },
        "12421211":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "\"You, my mistress.\"",
                "\"My behind.\""
            ],
            "content":"<div class=\"\"><div> <span>B.B. sighed as she waited for Morrigan to appear.<br>\r\n<br>\r\n\"Waiting for someone?\" Morrigan's voice asked from behind B.B. hood<br>\r\n<br>\r\nB.B. Hood quickly turned around, but Morrigan grabbed her. With a quick kiss, Morrigan's lips had a taste that shocked B.B. Hood. It was the alcoholic drink. The one tainted with the bigger bottom potion.<br>\r\n<br>\r\n<i>'Oh no! She'll make my bottom bigger! I can't believe I'm going to be a slave to the bat hussy and my bottom'</i> B.B. Hodd thought.<br>\r\n<br>\r\nMorrigan then used her batwings to massage B.B hood's behind. B.B. hood whimpered as she lost herself to the pleasure.<br>\r\n<br>\r\nWhen she stopped the kiss, Morrigan asked, \"Who is your master?\"<br>\r\n<br>\r\nB.B. Hood then responded...</span></div></div>",
            "created":1345611600,
            "id":1410909,
            "title":"A kiss in the dark"
        },
        "124212112":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "the living room, right in front of Dan",
                "In the bedroom, where they then walked out to the living room."
            ],
            "content":"<div class=\"\"><div> <span>\"M-m-m-m-my bottom....\" B.B. Hood cutely moaned as she closed her eyes.<br>\r\n<br>\r\nMorrigan smirked in a sultry way.<br>\r\n<br>\r\n\"I never saw you as someone who had that kind of thing... But perhaps we'll have some fun...\" Morrigan said, giving B.B. Hood's rear a firm squeeze.<br>\r\n<br>\r\n\"Oooooh!\" B.B. Hood moaned, as she began blushing.<br>\r\n<br>\r\nMorrigan then began alternating her squeezing of B.B. Hood's rear. Right, Left, Right, Left, Right, Left.<br>\r\n<br>\r\n\"Ooooh! Ooooh! Ooooh!\" B.B. Hood let out as her hands made their way to Morrigan's hips.<br>\r\n<br>\r\n\"Let's go back to my place....\" Morrigan said as she teleported B.B. Hood and herself to....<br>\r\n<br>\r\n</span></div></div>",
            "created":1352437200,
            "id":1464243,
            "title":"\"My behind.\""
        },
        "1242121121":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Morrigan's behind",
                "B.B.Hood's behind"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan liked having fun. Having fun sometimes meant surprising others. So she decided to give Dan a surprise.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nDan was patiently waiting when Morrigan appeared right in front of him. She was wearing a black and purple outfit that had a bat motif. She was currently groping  some blonde haired woman. The blonde's skirt was flipped up to reveal her bloomers. Dan was unsure, but it seemed like the blonde's behind was... slowly growing?<br>\r\n<br>\r\nWhen Morrigan saw that Dan was slack-jawed, she smiled.<br>\r\n<br>\r\n\"Well, Dan, we seem to have a spy, but I'm dealing with her right now.... Care to help?\" Morrigan asked, as she continued to grope B.B.Hood. B.B.Hood could only cutely moan.<br>\r\n<br>\r\n\"Who.... Are you, Morrigan....?\" Dan asked.<br>\r\n<br>\r\n\"Oh, nobody in particular.... just a being that could bring you pleasures beyond your wildest dreams...\" Morrigan replied. \"Now help me...\"<br>\r\n<br>\r\nAfter thinking about it Dan decided to grope...</span></div></div>",
            "created":1364533200,
            "id":1560382,
            "title":"Starting to reveal somethings"
        },
        "12421211211":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "B.B. Hood",
                "Dan."
            ],
            "content":"<div class=\"\"><div> <span>With a smile, Dan walked up to the two darkstalkers. He walked behind B.B. Hood and leaned in to press his erection in the crack of her growing bottom, while he also was reaching around to grab Morrigan's behind.<br>\r\n<br>\r\nB.B. Hood moaned as the new contact added to the bliss that was enveloping her mind.<br>\r\n<br>\r\n\"Greedy little thing, aren't you?\" Morrigan said with a chuckle as enjoyed Dan's hand on her rear.<br>\r\n<br>\r\n\"Who? Me for going for both of you or blondie here for enjoying both of us?\" Dan asked, as he enjoyed the soft, yet muscular succubus bottom.<br>\r\n<br>\r\n\"Both.\" Morrigan replied, before leaning in to kiss...</span></div></div>",
            "created":1368334800,
            "id":1588495,
            "title":"A lust sandwich"
        },
        "124212112111":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "\"Oh, I know.... Care to rub your face in mine or hers?\"",
                "\"Oh... So that explains B.B. Hood's actions....\""
            ],
            "content":"<div class=\"\"><div> <span>Morrigan let go of one of B.B. Hood' asscheeks and grabbed B.B. Hood's chin. She then gently raised B.B. Hood's head and kissed her on the lips.<br>\r\n<br>\r\n<i>'No! I wanted to get revenge on the bat bitch! Not become her sextoy!'</i> B.B. Hood thought as her resolve to resist was continuing to fade like an icecube in an inferno.<br>\r\n<br>\r\nDan was currently rubbing his dick between B.B. Hood's asscheeks, like a hotdog in a hotdog bun, when he noticed that B.B. Hood's derriere was slowly swelling when the small wrinkles in her bloomers were disappearing and her rear was becoming softer as it grew. As he pondered this, he realized that Morrigan's behind was also increasing as well. While he enjoyed the idea of these lovely ladies having increased rears, he also worried that they might not know about it.<br>\r\n<br>\r\n\"Morrigan? I think your ass and Blondie's ass are increasing in size...\" Dan said.<br>\r\n<br>\r\nMorrigan said...<br>\r\n<br>\r\n</span></div></div>",
            "created":1374296400,
            "id":1631420,
            "title":"A kiss and some realization"
        },
        "1242121121111":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Dan rubbed his face in Morrigan's butt",
                "Dan rubbed his face in B.B.Hood's butt"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan ceased kissing B. B. Hood and gave Dan an evil grin.The succubus's smile sent a shiver a fear down Dan's spine. It spoke of her having complete control over the situation.<br>\r\n<br>\r\n All B. B. Hood could do was moan a little bit, as she fell more and more to the pleasures that her growing bottom was bringing her. A shrinking part of her mind was screaming in horror when her body was desiring the dick that she was giving a buttjob to, more than she was desiring money.<br>\r\n<br>\r\n\"Oh, I know, I learned that when I first kissed her... This murderous little imp thought she could enslave me to my posterior. My kissing her bound her to the same fate, but I can feed on sexual pleasure. She on the other hand, is like any other human. Show enough pleasure, and they'll fall eventually,\" Morrigan answered.  \"Care to rub your face in mine or hers?\"</span></div></div>",
            "created":1376024400,
            "id":1643403,
            "title":"\"Oh, I know.... Care to rub your face in mi..."
        },
        "12421211211112":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Lilith appears and wants in!",
                "something else happens!"
            ],
            "content":"<div class=\"\"><div> <span>Dan said nothing. He got on his knees and gave B.B. Hood's magically-enhanced rear a few squeezes before putting his face against her butt.<br>\r\n<br>\r\n\"Ah, I'm a bit jealous of you, B.B. Hood. You get to be the first one to have a man rub his face in your rear tonight,\" Morrigan said as Dan began to slightly rub his face in B.B. Hood's butt. Morrigan then let go of B.B. Hood's chin and then went back to squeezing the blonde woman's butt with both hands. \"Maybe Baby Bonnie hood isn't quite an accurate name for you anymore. Perhaps we should call you 'Big Butt hood'?\"<br>\r\n<br>\r\n\"Awwuuooo...\" B.B. Hood moaned as she started to drool a little bit. She vaguely watched Morrigan's wings form into hands. The wing hands then gently  grabbed the sides of B.B. Hood's head, just before Morrigan went back to kissing her again. This time, B.B. Hood felt Morrigan's tongue invade her mouth.<br>\r\n<br>\r\nDan enjoyed B.B. Hood's big, warm, and soft bottom. Her silky bloomers did little to take away the experience. If anything, they added to it positively somehow. enough so that he was starting to grow drunk from the pleasure of B.B. Hood's slowly growing behind. That made him vaguely aware that Morrigan was squeezing B.B. Hood's butt against his face.<br>\r\n<br>\r\n<i>'so am I getting an odd version of facesitting or am I getting a buttjob to the face?'</i> Dan thought with a smile.<br>\r\n<br>\r\n---<br>\r\nThe shrinking part of B.B. Hood that was unaffected by all the pleasure saw a chance to regain control of herself and the situation.<br>\r\n<br>\r\nDominate both Morrigan and her boytoy with her butt.<br>\r\n<br>\r\nIt was a risky choice, the part reasoned, but it was better than being their slave.</span></div></div>",
            "created":1383627600,
            "id":1689717,
            "title":"a small chance to turn the tables?"
        },
        "12423":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "A man approaches her",
                "your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Morrigan goes back to the bar for a drink. After a few shots she took notice of her huge ass and hips. She briefly considered leaving but then....</span></div></span></div>",
            "created":1359262800,
            "id":1517982,
            "title":"Hit the Bar"
        },
        "124231":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Jon Talbain",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who sits next to her?</span></div></span></div>",
            "created":1374901200,
            "id":1635254,
            "title":"A man approaches her"
        },
        "1242311":{
            "author_id":"kzf2011",
            "author_name":"kzf",
            "choices":[
                "Morrigan's Home",
                "Alley"
            ],
            "content":"<div class=\"\"><div> <span>Jon Talbain stumbled over. Given his clumsy walk he had obviously been drinking. He sat next to Morrigan and put his arm around her hips.<br>\r\n<br>\r\n\"Hey Morrigan,I couldn't help but notice something.....different about you.\"<br>\r\n<br>\r\n\"You noticed all by yourself? How perceptive.\" She said sarcastically<br>\r\n<br>\r\nJon ignored her remark, he was too captivated by her enormous ass. He got up from his stool and got behind her, wrapping his arms around her waist and resting his chin on her shoulder.<br>\r\n<br>\r\n\"You've got a lot of junk in the trunk, baby. I bet you know how to shake it, want to dance with me?\" He whispered in her ear<br>\r\n<br>\r\nMorrigan briefly considered doing that. Jon's sexy wolf body was more than enough to get her hot and him being this close and touching her didn't help. However, she didn't want to be some drunken lay.<br>\r\n<br>\r\n\"Maybe next time, hun.\"<br>\r\n<br>\r\n\"Damn,\" He said letting go \"I'm gonna be here a while. If you need a dance partner come see me. I really want to see that big ass in action.\"<br>\r\n<br>\r\nJon then grabbed Morrigan's ass and that's when things went down hill. An intense sense of pleasure shot through her body. Her heart raced and was short of breath. a few seconds ago she wanted nothing to do with Jon and now she fantasized about him bending her over the bar and taking her from behind. She wanted more of that feeling.<br>\r\n<br>\r\n\"Hold on!\" She said grabbing his arm \"Looks like its your lucky day.\"<br>\r\n<br>\r\nShe pulled him onto the dance floor and faced him. She placed his hands on her hips started to gyrate. A big lustful grin formed on Jon's face.She put her hands on his shoulders and rubbed them. She gave him many kisses up his neck. He was shocked at her sudden change of heart but he didn't object. She lifted her leg up and wrapped it around him. He grabbed her thigh to support her and began to lick her neck. They stopped focusing on their necks and went for each other. They shared a deep open mouth kiss, their tongues exploring the others mouth. Morrigan sucked her lover's tongue as the two of them started grinding against each other.<br>\r\n<br>\r\nHer soft voluptuous figure rubbed against his muscled but slender body. Jon's free hand grabbed her butt. He gave it a squeeze and Morrigan moaned in his mouth. Every time he grabbed it or gave it a playful slap that same intense pleasure shot through her. She felt overwhelmed so she broke the kiss. They stared at each other breathing heavily.<br>\r\n<br>\r\n\"Holy shit.\" Jon said \"If this is what you do with guys you dance with I can't wait to see what you do in bed.\"<br>\r\n<br>\r\n\"You'll find out soon but we're not done here yet.\" She said scratching underneath his chin<br>\r\n<br>\r\n\"Good, because I'm not done with you either, bottom-heavy.\"<br>\r\n<br>\r\nJon did a twirling motion with his fingers, she knew what he wanted and she was eager to give it to him. She swayed her hips as she slowly turned around. Her big rump was now facing Jon and she continued to dance.<br>\r\n<br>\r\n\"Is this what you want, baby?\" She said seductively <br>\r\n<br>\r\nJon took Morrigan by surprise by grabbing on to her hips. He pulled her back and slammed his crotch against her ass. He did it again and again groaning, wanting sexual release. She could feel his cock as he continued to slam himself against her. She was loving it but she still wanted to tease him. She wanted to be pushed to his limits before they fucked.<br>\r\n<br>\r\n\"AH! I see someone's AH! getting impatient.\" She yelped<br>\r\n<br>\r\n\"I've wanted your big ass all night! Now shake it for daddy!\" <br>\r\n<br>\r\nAs Morrigan move her ass in a circular motion she bent her knees dropping her rump down. She went down again and made sure her butt rubbed against his crotch. She dropped it again going even lower and looked back at Jon. He jaw had dropped and he was completely under her control. <br>\r\n<br>\r\n\"You like it, daddy?\" She asked coyly <br>\r\n<br>\r\n\"Keep going. Oh, please, keep going.\"<br>\r\n<br>\r\nShe dropped down as low as she could, touching the floor with her ass. This earned a howl from Jon. As she came back up she lifted her arms up and hooked them around his neck. She back her ass right up into him and began to grind.<br>\r\n<br>\r\n\"Oooh yeeeaah.\" He moaned<br>\r\n<br>\r\nShe place one hand on the floor and shook her ass. Her big butt was jiggling and bounce right on his hard, throbbing dick. Jon reached up and brought his hand down on her massive ass. She let out a loud moan as that intense pleasure shot through her more powerful than ever. She stood up and french kissed Jon.<br>\r\n<br>\r\n\"Fuck me!\" She said<br>\r\n<br>\r\n\"I thought you'd never ask.\"<br>\r\n<br>\r\nMorrigan was insanely horny, she needed him now! Do they go to her place or do they to the alley behind the club?</span></div></div>",
            "created":1383541200,
            "id":1689462,
            "title":"Jon Talbain"
        },
        "125":{
            "choices":[
                "Hourglass.",
                "Transformation.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still searching, I see...<br>\r\n<br>\r\nPerhaps these options may be to your liking.</span></div></span></div>",
            "created":1333688400,
            "id":1310196,
            "title":"More options."
        },
        "1251":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Eating something..",
                "A spell..",
                "More options.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she gain her hourglass?</span></div></span></div>",
            "created":1454504520,
            "id":2098696,
            "title":"Hourglass."
        },
        "12512":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Herself",
                "Someone else.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who casts this voluptuous spell on the succubus?</span></div></span></div>",
            "created":1454504880,
            "id":2098697,
            "title":"A spell.."
        },
        "125122":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "A witch..",
                "Another character.."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who hexes Morrigan?</span></div></span></div>",
            "created":1454505300,
            "id":2098699,
            "title":"Someone else.."
        },
        "1251221":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Scenario 1",
                "Scenario 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose a scenario..</span></div></span></div>",
            "created":1454505780,
            "id":2098702,
            "title":"A witch.."
        },
        "12512211":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "She expands immediately",
                "The spell does not work... yet."
            ],
            "content":"<div class=\"\"><div> <span>You fall down butt first in a patch of grass and dirt; one moment you were in your bed, the next awake and standing in front of a witch and her cauldron.<br>\r\n Grunting in pain and in a panic, you ask the demonic witch if you're still dreaming.<br>\r\n<br>\r\n\"Afraid not my dear, I happen to be celebrating a special occasion and have decided to summon a human to try for my next meal... you just happen to be my most fortunate candidate..\"<br>\r\n<br>\r\nAs you stand upright in an attempt to escape, a bolt strikes you and paralyzes you in place.<br>\r\n<br>\r\n\"You're very thin now that I've taken a good look at you, no matter! I'll just pack some meat into those bones and you'll be big enough to feed me and my sisters for a whole year!<br>\r\n<br>\r\nThe witch channels a powerful spell, a purple colored stream is gathered into her index finger and is shifted toward you. The stream is lit up and is launched like a missile. In the moment as you were terrified of the thought of being a big, over-bloated human, a pair of female arms seize you in an attempt to also avoid the missile; the bolt strikes her. <br>\r\n<br>\r\n</span></div></div>",
            "created":1454508420,
            "id":2098713,
            "title":"Scenario 1"
        },
        "1253":{
            "author_id":"bubbaz85",
            "author_name":"BubbaZ85",
            "choices":[
                "Muscle growth",
                "Combination of MG and GTS",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these?</span></div></span></div>",
            "created":1380344400,
            "id":1671344,
            "title":"Buff Morrigan"
        },
        "12531":{
            "author_id":"bubbaz85",
            "author_name":"BubbaZ85",
            "choices":[
                "Potion",
                "Spell"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she get buff?</span></div></span></div>",
            "created":1380344400,
            "id":1671346,
            "title":"Strong Succubus"
        },
        "12533":{
            "author_id":"hon3y",
            "author_name":"HoneyKat",
            "choices":[
                "Giantess Growth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last but not least~</span></div></span></div>",
            "created":1449426600,
            "id":2071048,
            "title":"Other"
        },
        "13":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Breast expansion",
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your choice is the lovely ghost girl Hsien-Ko? Awesome choice! Now then, what will happen to her?<br>\r\n<br>\r\n* Gaining weight<br>\r\n<br>\r\n* Inflating<br>\r\n<br>\r\n* Bigger boobs<br>\r\n<br>\r\n* Bigger ass<br>\r\n<br>\r\n* Something else</span></div></span></div>",
            "created":1216789200,
            "id":559709,
            "title":"Hsien-Ko"
        },
        "131":{
            "author_id":"ragnair",
            "author_name":"Iruiel",
            "choices":[
                "Willingly",
                "Forcefed",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she gain?</span></div></span></div>",
            "created":1267851600,
            "id":846602,
            "title":"Weight gain"
        },
        "1311":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Hsien Ko just willingly eats on her own will",
                "Hsien Ko willingly eats, but it's due to an outside force or power.",
                "Huh? You've got another way?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of willingness are you referring to?</span></div></span></div>",
            "created":1368248400,
            "id":1588080,
            "title":"Willingly"
        },
        "13112":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "A building! What is it?",
                "Another person! Is it a Darkstalker?"
            ],
            "content":"<div class=\"\"><div> <span>In a large barren plain, seemingly in the middle of nowhere, a lone figure could be seen walking along. Amongst the multitude of broken rocks, dead trees and dusty paths, it was the only sign of movement for miles. The darkened sky and grey surroundings made a large contrast to the colourful attire that the figure wore. What such a person would be doing in such a place was not clear, only beknowst to the person herself and her closest sibling.<br>\r\n<br>\r\n\"My feet are swollen.....we haven't seen anything for miles!\" The person groaned. This blue skinned beauty was Hsien Ko, a young girl with plenty of magic and ability at her disposal. Despite her initial form as a Jiang Shi, she was actually a Darkhunter, a role which specialised in taking out Darkstalkers.<br>\r\n<br>\r\n\"Your feet can swell? I didn't know that still happened when you're dead!\" Another voice chirped up, which came from the girl's sister Meiling. Taking her role as the ofuda on Hsien Ko's head, she provided a great deal of help with controlling the powers she held.<br>\r\n<br>\r\n\"Oooh...not again Sis!\" Hsien Ko hung her head back in annoyance, then swung it back around with a pop from her neck. \"You know I don't like you talking about my....condition. Just call me a Jiang Shi at least!\"<br>\r\n<br>\r\nMeiling merely wafted in front of her sister's face. \"Why get so hot and bothered about it? Even If I called you different it wouldn't change the fact that you're dead. Besides, it's easier to say that anyway.\"<br>\r\n<br>\r\nHsien Ko moaned a little more, pulling her arm out from one of her massive sleeves, snaking past her ofuda sister and rubbing her face. \"Don't wind me up Mei.....I'm really tired and I just want to find some answers as much as you do!\" She took a look behind her, back at the vast road of emptiness. \"We've been travelling for hours and we've gotten no answers on how to get us back home. The only lead we have is the Darkstalkers, supposedly some of them know about things like this....\"<br>\r\n<br>\r\n\"Yeah, you're right Sis. All we can do is keep on going and just hope something will come across us soon....\"<br>\r\n<br>\r\nHowever, the hope wasn't needed as the two sisters suddenly came across.....</span></div></div>",
            "created":1368853200,
            "id":1592467,
            "title":"Outside force or power"
        },
        "131122":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "The sisters keep on walking!",
                "Wait, they've found something?"
            ],
            "content":"<div class=\"\"><div> <span>Right in the middle of their path, a figure swooped down at a lightning past speed and landed hard onto the floor. Dust flew all across the path, causing Hsien Ko to shield her eyes.<br>\r\n<br>\r\n\"Woah! What in blazes was that?\" Meiling exclaimed, trying to see past all the dust so she could find out what lay before them. Being an ofuda paper, she had no need to protect herself from the dust.<br>\r\n<br>\r\nEventually, everything settled and a tall figure stood before the two sisters. This person was a male figure who wore a long purplish coat and wore a helmet or sorts similar to a samurai's one. This person featured a pair of massive sharp wings situated at the back and in a very morbid twist, seemed to occasionally leak blood from various areas. They stood and merely stared at Hsien Ko.<br>\r\n<br>\r\nWhile she was a bit intimidated by the person's appearance, she knew it was never good to show weakness. She cleared her throat and shouted defiantly \"Hey! Who're you? Are you a Darkstalker?\"<br>\r\n<br>\r\nThe figure nodded. \"I suppose it would be polite to introduce myself. I am Jedah Dohma, S-class Darkstalker. I assume you'd want to meet someone like me, being a Darkhunter yourself, no?\"<br>\r\n<br>\r\n\"Huh? How did you know that?\" Hsien Ko didn't allow her voice to falter or break, though she was close to doing it.<br>\r\n<br>\r\nJedah simply smiled. \"Ah, I know a lot about you young girl. I know of the powers that dwell deep within you, they are quite remarkable, I do say so!\"<br>\r\n<br>\r\nSuddenly, Meiling burst into the conversation, her paper form fluttering around as if stuck in an updraft. \"Cut the filler and get to the point! Why do you know so much about her?\"<br>\r\n<br>\r\n\"As you wish....It was vital information that I needed to decide whether you were fit for the task at hand.\"<br>\r\n<br>\r\nBoth sisters grew angry. \"Wait a second.....you're the one responsible for bringing us here!?\"<br>\r\n<br>\r\n\"Initially I thought it was a good choice to bring both of you here....but now a problem has arisen. Only one of you has a physical body, even with both of your souls I need physical bodies too if I wish to have the best results....\"<br>\r\n<br>\r\n\"What's that supposed to mean?\" Hsien Ko began showing her agitation here.<br>\r\n<br>\r\n\"I think you may need some resizing if you are to truly be worthy enough for my plan...\" Jedah chuckled a little.<br>\r\n<br>\r\nMeiling exploded at this point. \"We've heard enough of your garbage! Go on Sis, let's cut him to ribbons!\" <br>\r\n<br>\r\nAs Hsien Ko brandished her claws ready for attack, it was only mere moments before Jedah made his first attack on her. With lightning fast speed, he shot his arm outwards towards Hsien Ko, ramming his lengthy arm right into her mouth.<br>\r\n<br>\r\nHer neck was sent flying back as Jedah's arm entered her mouth with considerable force. A flow of liquid began to pour from his arm down Hsien Ko's throat, which could be identified as blood. The thick fluid tasted sickening and almost set off her gag reflexes. However, it wasn't long before Hsien Ko kicked back into gear and swiped at the arm. With one swing, her metallic claws tore Jedah's arm off. She spat out the severed arm from her mouth bent over to send a fountain of blood expelling from her body. Despite this, she had already forcibly swallowed a fair amount of the disgusting stuff.<br>\r\n<br>\r\n\"That should be just about enough....\" Jedah mused to himself as he tended to his stump. \"I just wish she hadn't tore my good arm off, it'll take a while to form back...\"<br>\r\n<br>\r\nHsien Ko soon flowed up her assault, sending a plethora of sharp metal projectiles at Jedah as he flew off into the distance. Only a few scraped him, with most of them missing completely.<br>\r\n<br>\r\n\"I shall see you in the future young girl, I will be awaiting the results!\" He jeered as he flew off out of view.<br>\r\n<br>\r\nHsien Ko held her tongue out of her mouth, which had been stained red from the blood. \"What is his problem....even for a Darkstalker he's a real freak!\"<br>\r\n<br>\r\n\"What the hell did he do that for anyway?\" Meiling asked, still fuming. \"Is he just trying to creep you out or something, cause if he was it worked on me!\"<br>\r\n<br>\r\n\"I don't know Mei, but now we know who actually brought us here,which is great.\" Hsien Ko began to walk down the path again. stepping past the pool of blood Jedah left in his wake. \"Let's keep heading onwards to find some more places or people. If we mention that guy maybe some people will know where he lives.\"<br>\r\n<br>\r\n\"Or we'll just find ourselves some more trouble. Either way it's all we can do right now, so let's keep going Sis!\" Meiling cheered her sister on as they made their way down the path once more, though the reason behind Jedah's bizzare attack remained unknown...<br>\r\n<br>\r\n</span></div></div>",
            "created":1369544400,
            "id":1597351,
            "title":"Another person! Is it a Darkstalker?"
        },
        "1311222":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "A table filled with cooked foods!",
                "A large reinforced vault!"
            ],
            "content":"<div class=\"\"><div> <span>Though they had walked for some time now, the two sisters had finally came across a form of civilization, being in the form of a lone village. It was a bit of a weird sight, having an entire community set out in the middle of nowhere, but it was at least somewhere to explore and get some answers. Heading down the slope carefully to avoid losing her footing, Hsien Ko followed the pathway to the village gates.<br>\r\n<br>\r\nMuch to her and Meiling's dismay, the village was completely abandoned. The setting in front of the entrance showed broken carriages and dead bodies all over. The air was thick with the stench of rotting flesh. Houses were broken into, large patches of scorched earth were fires once raged and the distinct sound of pure silence due to no life remaining whatsoever.<br>\r\n<br>\r\nHsien Ko stepped over the rubble of a destroyed shack, inspecting the entire village. \"Damn....we finally find somewhere to search and it's completely wrecked. I'm starting to think we'll never find a way back home now...\"<br>\r\n<br>\r\n\"Hey, chin up sis!\" Meiling perked up. \"Just because there's no one here doesn't mean we won't be able to find something useful! Maybe there's some kind of main building or a village hall we can find. They usually have some super valuable stuff that we might be able to use!\"<br>\r\n<br>\r\n\"Well, if you say so. If this village got attacked, I'd guess that all the valuable stuff got stolen by now. It's still worth a shot I guess.\" With a clear idea on what to look for, the blue skinned girl searched around the village for any sign of a hall. Traversing the ruined buildings proved to be difficult, as her long sleeves continuously became caught on the rubble that occupied the floor.<br>\r\n<br>\r\nThankfully, luck shined on the two sisters. Before them was a very large, grand building with very little damage to it. A few windows were smashed, but aside from that it was mostly intact. The front double doors were still standing, showing some wear which would suggest the village attackers did try to break in. This was even more evident with the broken battering ram near the doors.<br>\r\n<br>\r\n\"Looks like you were right Mei, there actually is a village hall here! The doors aren't broken into at all, so there's gotta be something inside!\"<br>\r\n<br>\r\nThe ofuda charm fluttered around happily. \"Right on Sis! Use one of your bombs to bust the door open and we'll take a look inside!\"<br>\r\n<br>\r\nListening to her sister's instruction, Hsien Ko flicked an oversized sleeve up into the air, throwing out a rounded object which fit the description of a bomb. It was cartoony in it's style, being black and fully rounded. It had a comical fuse on top which strangely wasn't lit, but the ticking the bomb made along with the visual number timer on the front still showed it's imminent detonation. The jiang shi threw the bomb towards the double doors, landing it right on the front porch.<br>\r\n<br>\r\nAs the timer of the bomb counted down, a face appeared on the bomb. Looking sleepy at first, it took a single look at the countdown timer and it's eyes widened. It's pupils darted around scared along with it's mouth frozen in a \"O\" position. As the timer reached one, the bomb shut it's eyes and mouth bracing for impact. With a not so earth shattering kaboom, the bomb was no more, having taken the door with it.<br>\r\n<br>\r\n\"I do feel sorry for those bombs sometimes.\" Hsien Ko added. \"You think they can feel pain?\"<br>\r\n<br>\r\n\"Meh, how should I know?\" Meiling replied. \"Let's check out this hall already!\" Having not gotten her answer, Hsien Ko just shrugged and approached the now clear entrance to the village hall. When there, she saw that the main hallway did indeed have something inside.</span></div></div>",
            "created":1374728400,
            "id":1634013,
            "title":"Wait, they've found something?"
        },
        "13112222":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "Let's go to Abaraya!",
                "Let's go to the Human World!"
            ],
            "content":"<div class=\"\"><div> <span>Inside of the deserted hall, one thing stood out beyond all else. While the aged wood bore nothing of interest, most likely taken by the previous owners due to the lack of break ins, a sole glimmering metallic object shone before Hsien Ko's eyes. embedded into the wall and kept in good condition, was a large safe. A traditional twisting knob for opening the safe was present on the front, but she doubted she would be able to open it through normal means.<br>\r\n<br>\r\n\"Jackpot!\" Meiling exclaimed. \"I knew we'd find something neat in here! Come on Sis, let's crack this safe!\"<br>\r\n<br>\r\n\"Do we need to specifically crack the safe?\" Hsien Ko asked, walking towards the wall. \"I'm sure if we look around the place we'll find the code for the safe.\"<br>\r\n<br>\r\n\"Nah, it'd take too long if it was around here anyway. Just fish out some spiked balls in your sleeves and bust the safe open!\"<br>\r\n<br>\r\n\"Well, if you insist...\" Obeying her Sister, the Jiang Shi faced the safe and put her hands into her sleeves. Getting her aim correct, she fished out the aforementioned spiked balls and with surprising strength, threw them out of the sleeves, off the claws and right into the safe. One by one, they slammed into the protective casing, creating huge dents due to the weight and force of the balls. When the final ball struck the safe, the door was unable to take anymore punishment, snapping it's hinges right off and sending the door crashing to the wooden floor, revealing the contents inside.<br>\r\n<br>\r\nTheir efforts to break into the village hall and bust open the safe were certainly worth it, as inside the armoured vault was the glittering sheen of gold. Meiling's ofuda form danced all around Hsien Ko's face as she laid eyes on the gleaming coins and shimmering jewellery inside. It stacked up on top of each other and filled up the entire safe, with the sheen from rubies and emeralds shining out from their nests inside the piles of gold. Even just a fraction of the valuables would be enough to give someone an experience in the lap of luxury.<br>\r\n<br>\r\n\"AH HA!\" Meiling yelled, hurting her sister's ears. \"I told you we'd find something good here! Grab it all, stuff it into those sleeves!\"<br>\r\n<br>\r\nListening to her and taking the many piles into her sleeves, Hsien Ko questioned. \"While money is nice to have, why do we need it right now? We're supposed to look for answers and information.\"<br>\r\n<br>\r\n\"One word sis; Bribery. With this much loot, we can easily pay people to tell us what we wanna know without roughing them up like we usually do. I know you don't like fighting too much, so this should make things much easier!\"<br>\r\n<br>\r\n\"Hmmm...that is a good reason.\" Hsien Ko thought. \"Well, I've got everything out of the safe.\" She jingled her sleeves to show this. \"Where should we look next for some information? I don't think we'll find much more in these wastelands.\"<br>\r\n<br>\r\nMeiling thought carefully about this.</span></div></div>",
            "created":1376370000,
            "id":1645442,
            "title":"A large reinforced vault!"
        },
        "131122221":{
            "author_id":"tintrue",
            "author_name":"tintrue",
            "choices":[
                "She is approached by someone!",
                "She starts feeling something..."
            ],
            "content":"<div class=\"\"><div> <span>Donning a long brown robe, complete with hood to cover her head, Hsien Ko and Meiling traversed the lands to make their way to Abaraya, a place they'd been before after having a run in with a certain bloodthirsty Samurai. It had taken a long while, but the two sisters had finally reached their destination, a very dilapidated area made up of a fully functioning shanty town community.<br>\r\n<br>\r\n\"Are you sure we'll find someone that'll help us get some info?\" Hsien Ko asked her sister as she looked about at the numerous different houses. \"This place doesn't look like the place you'd find some insider sources...\"<br>\r\n<br>\r\n\"Oh, you're just scared we'll run into that Samurai again! I know he gave you a pretty tough fight last time we saw him!\" Meiling assured with a positive voice. \"Trust me, we'll find someone here. They probably won't look the type, but once we've showed him some of the gold we've plundered they'll spill all their secrets.\"<br>\r\n<br>\r\nHowever, as the duo continued their search through the near endless amount of run down houses and shops, their search was beginning to seem fruitless. The majority of people around them were mere hobos and drunkards, all of them either too sick or too drunk to talk coherently.<br>\r\n<br>\r\n\"Still think we'll find someone here sis?\" Hsien Ko sat down on a rotted wooden bench and hunched over, jingling her claws under the robes.<br>\r\n<br>\r\n\"Hey...don't be unoptimistic!\" Meiling replied, her voice faltering. \"Tell you what, I'll go find someone in these houses myself, and you just sit back in an alleyway or somewhere! Come on, we'll find you a place to hang out!\"<br>\r\n<br>\r\nSighing deeply, Hsien Ko obeyed her sister and got up from the bench, finding a narrow passage between two sizeable houses. Hiding out in the darkened area, she waited as her Ofuda began to glow, before bursting in a small flash. Now before her stood the true form of Meiling, decked out in her normal yellow and orange clothing along with her short brown hair.<br>\r\n<br>\r\n\"Alright sis, just keep yourself under control like we practice and as soon as I find someone, I'll get back to ofuda form, okay?\" Giving two thumbs up, Meiling walked out from the passage and walked over to the nearest shop she could find, disappearing inside.<br>\r\n<br>\r\nHsien Ko now waited, leaning against the wall as she did. She was slightly concerned about herself now she had no ofuda, but she was confident she'd be able to control herself. However, her time in hiding did not last long.</span></div></div>",
            "created":1384578000,
            "id":1694911,
            "title":"Let's go to Abaraya!"
        },
        "1312":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "someone ties her up and forcefeeds her",
                "someone steals her hat and sister, making her mindless and hungry for anything",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>here are some creative methods for her to be force fed by</span></div></span></div>",
            "created":1343106000,
            "id":1388512,
            "title":"Forcefed"
        },
        "1313":{
            "author_id":"ragnair",
            "author_name":"Iruiel",
            "choices":[
                "Curse?",
                "Vore?",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other weight gain choices...</span></div></span></div>",
            "created":1267851600,
            "id":846603,
            "title":"Something else?"
        },
        "13132":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "someone steals her hat, making her a mindless and hungry zombie",
                "she willingly decides to eat people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>well she is a zombie, so it makes sense. so how about a method</span></div></span></div>",
            "created":1343106000,
            "id":1388513,
            "title":"Vore?"
        },
        "132":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Air Expansion",
                "Blueberry Expansion",
                "More Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Inflation for the lovely ghost girl Hsien-Ko?</span></div></span></div>",
            "created":1309150800,
            "id":1135539,
            "title":"Inflation"
        },
        "1323":{
            "author_id":"garymega77",
            "author_name":"Gary Mega",
            "choices":[
                "Water Inflation",
                "Slime Inflation",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You want more choices?</span></div></span></div>",
            "created":1452900420,
            "id":2089739,
            "title":"More Inflation"
        },
        "133":{
            "choices":[
                "Magic.",
                "Science.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Hsien-Ko grow?</span></div></span></div>",
            "created":1322542800,
            "id":1231893,
            "title":"Bigger up front."
        },
        "1331":{
            "author_id":"derp2524",
            "author_name":"derp",
            "choices":[
                "She grows more",
                "Morrigan shows up",
                "Morrigan accidently drops the spellbook next to Hsien-Ko"
            ],
            "content":"<div class=\"\"><div> <span>Morrigan, the succubus, spies upon Hsien-Ko, up to mischief, and quickly pulls out a spellbook and chants some magic word, after which she said<br>\r\n\"This should be fun... Hehehehe...\"<br>\r\nHsien-Ko wasin the forest when suddenly she felt he chest get warm, she looks down at them to see them start jumping!<br>\r\n\"What the!?\"<br>\r\nThey start growing as they jump, tightening her dress as they do so, when her dress gets to its bursting point, they stop, and when she looks down again, they're bulging out of the cut of dress.<br>\r\n\"Hmmm....\"<br>\r\nShe starts doing some poses.</span></div></div>",
            "created":1395550800,
            "id":1766168,
            "title":"Magic"
        },
        "1332":{
            "author_id":"derp2524",
            "author_name":"derp",
            "choices":[
                "Drinks it on the spot, having an immediate effect",
                "Goes to a place to stay then drinks it, effects happen over night",
                "She meets somebody, another Darkstalker, and shares it with them."
            ],
            "content":"<div class=\"\"><div> <span>Hsien-Ko was just walking through the streets when she came across a vender selling some sort of chemicals, saying<br>\r\n\"Come over, here and look at these fabulous chemicals, make your self look beautiful.\"<br>\r\nHe sees Hsien-Ko and quickly yells<br>\r\n\"And more Human!\"<br>\r\nHsien-Kos was intrigued by this and bought some of the potion.</span></div></div>",
            "created":1395550800,
            "id":1766157,
            "title":"Science"
        },
        "135":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Hourglass expansion",
                "Muscle expansion",
                "Other still"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more options...<br>\r\n<br>\r\n*Growing boobs and butt<br>\r\n<br>\r\n*Growing muscles<br>\r\n<br>\r\n*Other</span></div></span></div>",
            "created":1304398800,
            "id":1099566,
            "title":"More options"
        },
        "1351":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "You",
                "Air",
                "Other choices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she expand?</span></div></span></div>",
            "created":1304658000,
            "id":1100810,
            "title":"Hourglass expansion"
        },
        "13511":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Buy a beauty potion from a strange market...",
                "Get something else..."
            ],
            "content":"<div class=\"\"><div> <span>You meet Hsien-Ko under strange and yet extraordinary circumstances. What others feared from her you didn't and her status of being undead was not even considered a distinguishable characteristic that bothered you. In the long time spent within a week you quickly become close friends with Hsien-Ko and despite her reserved self she is quite fond and outgoing. You're charmed by her beauty and generous proportions and she even joked about her plump breasts.<br>\r\n<br>\r\nYou head out obligated to get a gift for Hsien-Ko... </span></div></div>",
            "created":1304658000,
            "id":1100830,
            "title":"You"
        },
        "135111":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Give her the vial",
                "Make it secret..."
            ],
            "content":"<div class=\"\"><div> <span>Inside the strange market, you run into a strange but refined beauty chemist that catches your eye. Asking for what you are looking for, you tell him that you would like something that would surprise a girl and would greatly \"compliment\" her beauty - her physique. The chemist replies to your request with a playful smile that exhilarates your confidence in this chemist. Returning, the chemist produces a vial that recommending that the receiver consume the whole drink for full efficiency. The next time you encounter Hsien-Ko you...   </span></div></div>",
            "created":1304658000,
            "id":1100838,
            "title":"Buy a beauty potion from a strange market..."
        },
        "1351112":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Hsien-Ko expands the next day...",
                "She witnesses her transformation at home..."
            ],
            "content":"<div class=\"\"><div> <span>You want to surprise Hsien-Ko and tell her when she finds out about her change that you took part in it; Hsien-Ko would look more alive than dead. You and Hsien-Ko go out for drinks and during the delivery to the table you stir the contents into the drink. After another discussion, you and her depart ways until next tomorrow morning. </span></div></div>",
            "created":1304658000,
            "id":1100843,
            "title":"Make it secret..."
        },
        "13511121":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "You wait the very next day...",
                "She invites you to her house tonight..."
            ],
            "content":"<div class=\"\"><div> <span>The very next morning you run into Hsien-Ko, you're sure that the potion wouldn't have any immediate effect on her until when she gets close enough to talk to you, your eyes cant help but to look down to her chest. \"Did it always stick out this much?\" she continues talking, she's busy looking afar. \"They probably just seem big today... no way, I'm sure they've seem to have gotten bigger, they look a lot more... plump.\" You tell yourself to take note of this the next day you meet.<br>\r\n<br>\r\nYou meet the very next day, only next time she seems to be adjusting her clothes, particularly around her chest, her breasts were beginning to bulge particularly around her cutout cleavage. \"Has she gained weight?\" you look down to her waist and see that it's still thin. \"Has she not noticed yet?\"Then, you quickly find out that the vial that the chemist gave you had different results then you expected, at least they were not disappointing results.. Walking behind her, you quickly become aroused, her butt's become more emphasized and with each step she took her blown up ass rose and fell in rocking motion. Her expansion both worries about her suspicion yet exhilarates you from the future changes the potion has in store. </span></div></div>",
            "created":1304658000,
            "id":1100850,
            "title":"Hsien-Ko expands the next day..."
        },
        "135111212":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "The following morning...",
                "The expansion continues..."
            ],
            "content":"<div class=\"\"><div> <span>To your excitement, Hsien-Ko invites you and her alone to spend the night at her house, she no longer requires sleep, however she still finds it a pleasant humane pleasure; She enables you to sleep with her in the same room. Upon coming in, she is wearing sleeping wear that shows her hourglass shape, her breasts were nearly bulging in her top and her hips were bigger than you thought in her Chinese clothes.<br>\r\n<br>\r\nAbout an hour into the night Hsien-Ko is completely knocked out, you suspect that it might be the effect of the potion, but then again what can the potion not do! You stare at her inflated boobs, the shape and cleavage is so perfect but then again the anticipation of them suddenly growing before your eyes is what's truly killing you. Finally, you decide to sneak a touch.<br>\r\n<br>\r\nBefore your hands can feel her nearly bouyant breasts, she immediately heaves her chest - and then lowers it. Your heart races, eyes focused on her face, she still looks asleep, \"What..? Is this it?!\" Suddenly a noise occurs in her body, almost a noise like something was filling her up followed by a slow pumping noise, her boobs were getting bigger! She continued the same lifting and falling motion, her facial cheeks were puffed up, \"Hmmph...hmp...hmmmmmp\" she moaned deeply, she continued with the same movement as her breasts and hips continued to get bigger and bigger, you've never seen them grow like this before! You go around and stare down at her ballooned cleavage, the movement and the expansion is driving you mad. Your hands reach and grab the top of her big, full, inflated, bulging breasts, it is the most satisfying thing you have ever done...and they were very warm.</span></div></div>",
            "created":1304658000,
            "id":1100861,
            "title":"She invites you to her house tonight..."
        },
        "14":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Breast expansion",
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Ah, so your choice is Lilith? Nice one! Now then, you can choose one of several things to have done to her...<br>\r\n<br>\r\n* Fatten her up<br>\r\n<br>\r\n* Turn her into a nice big balloon<br>\r\n<br>\r\n* Expand her breasts {or at least give her some}<br>\r\n<br>\r\n* Expand her butt<br>\r\n<br>\r\n* Choose something else</span></div></div>",
            "created":1216184400,
            "id":556387,
            "title":"Lilith"
        },
        "141":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic",
                "Force Feed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of weight gain to make lilith become fatter?</span></div></span></div>",
            "created":1267506000,
            "id":844774,
            "title":"Weight gain"
        },
        "1412":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Potion",
                "Spell",
                "Curse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of magic that will make Lilith fatter?</span></div></span></div>",
            "created":1309150800,
            "id":1135584,
            "title":"Magic"
        },
        "142":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Liquid Expansion",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Inflation for Lilith?</span></div></span></div>",
            "created":1309150800,
            "id":1135577,
            "title":"Inflation"
        },
        "143":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "A spell that will make someone's breasts grow",
                "A spell that'll steal someone's breasts and give them to the caster"
            ],
            "content":"<div class=\"\"><div> <span>Lilith has always hated Morrigan due to her large breasts when she was stuck with a flat chest. Wanting to finally hey her own set of breasts she snuck into Morrigan's room one night and stole her spellbook. Once in her room she started to look through it, she figured Morrigan had something that would give someone bigger breasts and after sometime of searching she found...</span></div></div>",
            "created":1267851600,
            "id":846707,
            "title":"Breast expansion"
        },
        "1431":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "Her breasts begin to inflate",
                "A Darkstalker character walks in",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>Lilith's finger runs along the words of the spell trying to read aloud the incantation. As Lilith reaches the climax of her spell, a glowing green light trailed along with her finger and then sparked a small explosion as the girl uttered the final words. The spell book produced a gust of wind that blew toward Lilith making her hair fly widely for a moment; an eerie moment of silence. Nothing. With a crooked frown and on the verge of tears, Lilith walked over to her mirror in defeat, with a thought that fate had doomed her to remain in her place; flat and always smaller than Morrigan. Lilith shifted to a pair of pink, buttoned pajamas and decided to go into a deep slumber of despair in her large, grim but finely comfortable bed. As Lilith begins to lie down on her bed...</span></div></div>",
            "created":1270011600,
            "id":859764,
            "title":"A spell that will make someone's breasts grow"
        },
        "14311":{
            "author_id":"chrisx166",
            "author_name":"chrisx166",
            "choices":[
                "They continue to get bigger...",
                "Another part in Inflated"
            ],
            "content":"<div class=\"\"><div> <span>     Lilith begins to close her eyes, immediately she begins to feel friction against her bosom. With an unsure expression she quickly shakes it off as a fluke, but suddenly her urge to look overcomes her and she quickly opens her eyes and moves her head down. Lilith then sees two, half round shaped bumps that weren't there before, slowly beginning to expand. Her boobs were inflating. By then Lilith had normal shaped breast, but slowly they continued to grow. He chest begun to rise, an expression of shock and joy filled Lilith's face, her shirt begun to show tension as her boobs begun to overtake the size of two large melons. *plunk* The top of her button flies off. Then another. And another.<br>\r\n      With each pop revealed the true size of her breast, slowly expanding into healthy shaped spheres, producing a quick bounce time. Lilith kept her hands around her breasts, her hands and fingers slowly being swallowed up by the soft but plump feel of her large breasts. Quickly, Lilith transforms into her normal attire, she gives her large, balloon sized breast a squeeze exploding outward like plush, giant water balloons; her boobs each produce a healthy shine that reflect off the light of her room. \"Bigger...\", moaning a whisper under her breath, \"bigger...\" Overjoyed she begins to giggle and produces a grin.  </span></div></div>",
            "created":1270011600,
            "id":859783,
            "title":"Her breasts begin to inflate"
        },
        "14312":{
            "author_id":"throne642",
            "author_name":"shinn",
            "choices":[
                "Big round volley ball boobs.",
                "her inflatable body. "
            ],
            "content":"<div class=\"\"><div> <span>As Lilith lied asleep in her bed, a familiar sexy figure sneaks into Lilith room through the unlock window in her room. The figure walks into the moonlight and reveals herself as Morrigan. Morrigan has come with the full intent of getting back at Lilith for stealing from her. Morrigan walks over to Lilith side with a spellbook in hand ready to do something weird to Lilith as revenge. However just before she casts the spell, Morrigan detects that Lilith had already used a spell before she got there. <br>\r\n<br>\r\nMorrigan picks up the spellbook that Lilith stole and says, \"Hmm what kind of spell did this girl use? It stink of magic in here.\" Morrigan flips through the book until she finds the very spell Lilith used. Upon finding the spell and looking over it, Morrigan smiles and turns her gaze to Lilith who remains asleep. <br>\r\n<br>\r\nMorrigan: \"Oh this is going to be fun.\" Morrigan gives up on taking revenge on Lilith and instead decides to mess with her a little. Morrigan casts another spell on Lilith that appears to do nothing to her. Morrigan then leaves Lilith's room, smiling, holding back the urge to laugh uncontrollable. <br>\r\n<br>\r\nThe next Morning Lilith yawns and sits up in bed. Lilith is a bit out of it still and hasn't noticed her....</span></div></div>",
            "created":1368162000,
            "id":1587645,
            "title":"You shouldn't steal...from Morrigan of all people."
        },
        "143121":{
            "author_id":"throne642",
            "author_name":"shinn",
            "choices":[
                "Hellium tank.",
                "An air pump. "
            ],
            "content":"<div class=\"\"><div> <span>Lilith hadn't noticed yet but overnight, her breasts became larger and about the size of fully inflated volley balls. Her new bust has pushed Lilith pajamas to their limit and popped a few buttons off of it which is now showing of Lilith now visible and bouncy cleavage. Lilith gets out off bed easily and makes her way into the bathroom where she begins the usually morning routine, naked in the shower. While in the shower, her boobs start to float since, they're no longer packed in and Lilith still doesn't notice them due to how light they are. <br>\r\n<br>\r\nLilith goes down to clean her chest off and says, \"I can't believe i took that book from Morrigan for nothing. This sucks.\" Lilith puts her hand where her normally flat chest would be however Lilith encounters her new mountains when she tries to clean her breasts. <br>\r\n<br>\r\nLilith: \"Huh? What the....\" Lilith finally takes notice of her new breasts and is to amazed to do anything but exit the shower and looks in the mirror to even make sure if they're real. Upon looking in the mirror and groping them a little more. Lilith realizes that she really has gigantic, unmeasurable by cup size, boobies.<br>\r\n<br>\r\nLilith: \"Oh holy... They're real. I finally have breasts and big ones too.\" Lilith checks her breasts out a little more and realizes something else not so wonderful. Her breasts are unnaturally light. She figured that at they're current size they would be much heavier but no, they were incredible light. Almost as if they were loaded with air. Lilith now wanted to make sure if what she was thinking was a fact. Lilith goes back into her room wearing a towel with doesn't even begin to cover her mountains. She walks back into her room and looks for anything she could use to test her lightweight theory. <br>\r\n<br>\r\nLilith quickly discovers her...</span></div></div>",
            "created":1368248400,
            "id":1587906,
            "title":"Big round volley ball boobs."
        },
        "1431211":{
            "author_id":"throne642",
            "author_name":"shinn",
            "choices":[
                "To get bigger.",
                "Show off a little. "
            ],
            "content":"<div class=\"\"><div> <span>In Lilith's room there was a helium tank that she had gotten a while back. She intended to use it during her birthday but never got the chance, so it's still loaded to the brim with helium. Lilith wants to believe that her breasts are %100 real but she just needs to find out about her bouncy boobies. Lilith drags the tank to the center of her room and gets dressed into her usually outfit which is stretchy enough to take on her new massive chest. Lilith picks up the hose from the helium tank and easily attaches it to her chest. Lilith hoping otherwise, turns on the helium tank and the helium begins to rush towards her chest. The helium goes into her chest and her breasts start inflating. Lilith watching as her boobs starts getting bigger and is amazed, not only because she had big boobs now but also because she enjoyed inflating up like a balloon. <br>\r\n<br>\r\nLilith turns off the helium tank and finds her boobs are now fully loaded beach balls. Lilith rubs her boobs and says, \"This is amazing. I never knew it ve so much fun to inflate. I can't believe that, that spell actually worked.\" Lilith considers getting bigger for fun but also wants to go show off to Morrigan, who she now beats in the bust department. <br>\r\n<br>\r\nLilith decides.....</span></div></div>",
            "created":1368334800,
            "id":1588380,
            "title":"Hellium tank."
        },
        "145":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Fruitification",
                "Giantess",
                "More Expansion for Lilith"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Fruitification, Giantess, or more for Lilith?</span></div></span></div>",
            "created":1309150800,
            "id":1135579,
            "title":"Other"
        },
        "1453":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Hourglass Expansion",
                "Muscle Growth",
                "Mix Blueberry and Weight gain."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Hourglass Expansion, Muscle Growth, or Mix Blueberry and Weight Gain for Lilith?</span></div></span></div>",
            "created":1309150800,
            "id":1135583,
            "title":"More Expansion for Lilith"
        },
        "14531":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Magic!",
                "Science! "
            ],
            "content":"<div class=\"\"><div> <span>Lilith was tired of looking like a young girl. Morrigan had found a way to keep Lilith alive and separate because Morrigan wanted a younger sister. But Morrigan kept teasing Lilith about Lilith's appearance as a young teenager and lack of curves.<br>\r\n<br>\r\nDue to her unique circumstances, Lilith might look this way forever. She began to research a way to either artificially age herself or to give herself a bigger bust and behind.<br>\r\n<br>\r\nAfter all her searching Lilith had found two ways. One of Magic and One of Science.<br>\r\n<br>\r\nThe magic expansion warned that it might make the affected areas might become more sensitive and a simple touch might bring addicting pleasure. Lilith giggled at that. <br>\r\n<br>\r\n\"A succubus, addicted to pleasure? Sounds like fun.\" Lilith said, as she looked the spellbook over.<br>\r\n<br>\r\nThe science expansion would need a target for her to drain the age from.<br>\r\n<br>\r\n\"It might be fun to make Morrigan the shrimp for a bit.\" Lilith said to herself as she looked at the warning label of the age switcher<br>\r\n<br>\r\n\"Now which one should I go with?\" Lilith asked herself.</span></div></div>",
            "created":1335934800,
            "id":1327811,
            "title":"Hourglass Expansion"
        },
        "145312":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Lilith then began to use her succubus magic to start lactating.",
                "Lilith began to fondle Morrigan"
            ],
            "content":"<div class=\"\"><div> <span>As Morrigan was waking up, She felt something was off. A glance at a mirror had her screaming. Her famously sexy figure was now reduced to Lilith's. A quick magic scan let Morrigan know that she was now younger.<br>\r\n<br>\r\n\"Oh my, the shrimp wakes with a cry.\" a voice from off to the side said. Morrigan turned to face the person and was shocked to see Lilith, smiling eviliy and enjoying the age that she took from Morrigan<br>\r\n<br>\r\n\"You had something to do with this, didn't you?!\" Morrigan declared as she pointed at Lilith. <br>\r\n<br>\r\n\"Perhaps. I wanted a sexy figure and yours was the closest around. Fell free to live as flat as I once was. But don't worry, you get to grow up to be as sexy as me...\" Lilith said with a smirk.<br>\r\n<br>\r\n\"Undo this right now or-\" Morrigan said, before Lilith rushed over and grabbed her. Lilith then put Morrigan in a bear hug and made sure that Morrigan's head was stuck in Lilith's bosom.<br>\r\n<br>\r\n\"Awwww... It seems my little sister is upset that I took away her sexy figure...\" Lilith mockingly said, as she held the back of Morrigan's head to keep it in place. Morrigan yelled something, but it was muffled by Lilith's boobs. \"Guess I gotta cheer you up, baby sis...\"</span></div></div>",
            "created":1336971600,
            "id":1337448,
            "title":"Lilith steals Morrigan's figure with science!"
        },
        "1453122":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Lilith gave Morrigan a spanking.",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>Lilith's wings formed into a pair of of hands and grabbed Morrigan's wrists. Lilith then released Morrigan's head and began to fondle Morrigan's bottom.<br>\r\n<br>\r\n\"Stop this right now!\" Morrigan said, still furious that Lilith made her younger and then Lilith had made herself older. <br>\r\n<br>\r\n\"Nope!\" Lilith said. \"As you once told me, be proud of your assets. You do have quite the sexy ass.\"<br>\r\n<br>\r\n\"When I figure out a way to undo this, we will have an intense sparring session. And I will not stop until you are thoroughly punished.\" Morrigan declared, trying not to let Lilith know that her groping was starting to please Morrigan.<br>\r\n<br>\r\nLiltih took one hand off of Morrigan's Bottom and placed it on Morrigan's chest. Lilith began to rub Morrigan's chest.<br>\r\n<br>\r\n\"Maybe if I fondle your breast enough, they'll grow faster?\" Lilith asked, seemingly ignoring Morrigan's words.<br>\r\n<br>\r\n\"Listen to me, you jealous idiot!\" Morrigan yelled, trying to break free of Lilith's batwing-hands.<br>\r\n<br>\r\n\"Oh my! Such awful words from a young lady!\" Lilith said, in mock shock. \"I need to punish you!\"</span></div></div>",
            "created":1337317200,
            "id":1339767,
            "title":"Lilith began to fondle Morrigan"
        },
        "14531221":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "\"increase your booty.\"",
                "\"increase your bust.\""
            ],
            "content":"<div class=\"\"><div> <span>Lilith made her batwing hands lift up Morrigan and then walked over to the bed. Lilith then managed to get both of Morrigan's hands in one batwing hand and and then grabbed Morrigan's ankles with the free batwing hand.<br>\r\n<br>\r\nWith a smirk Lilith sat on the edge of the bed and forced Morrigan to lay across Lilith's lap.<br>\r\n<br>\r\n\"Little girls like yourself shouldn't insult beautiful women like myself.\" Lilith said, putting a glove on one of her hands.<br>\r\n<br>\r\n\"You stole my figure and gave it to yourself!\" Morrigan ranted as she tried to break free. She then noticed the glove had rune symbols on it. \"What are you planning to do with that glove?\"<br>\r\n<br>\r\n\"Simple...\" Lilith said, preparing to start spanking Morrigan's rear. \"For every spank that I give you, this glove will...\"</span></div></div>",
            "created":1337576400,
            "id":1341647,
            "title":"punishment time"
        },
        "145312211":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Your choice",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>\"For every spank that I give you, this glove will increase your booty.\" Lilith said, giving Morrigan a smack on the rear.<br>\r\n<br>\r\n\"AH! What kind of punishment is that?\" Morrigan yelled, feeling the tell-tale itchiness of magical growth with her rear.<br>\r\n<br>\r\n\"The usual punishments wouldn't be that effective with you.\" Lilith replied, giving Morrigan another spank.<br>\r\n<br>\r\n\"AH! Cease this at once!\" Morrigan yelled. <i>'If the magical growth goes on for too long, I might get addicted to it.</i><br>\r\n<br>\r\n\"I'm the adult and you're the child. I say when it stops.\" Lilith said, smacking Morrigan once again.<br>\r\n</span></div></div>",
            "created":1339131600,
            "id":1356068,
            "title":"\"increase your booty.\""
        },
        "15":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Q-Bee",
                "Bulleta",
                "Talbain",
                "Rikuo",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>So, you didn't like any of those choices? ...Are you crazy? Ah well. Here are some more for you!<br>\r\n<br>\r\n* Q-Bee the Soul Bee. Deceptive leader of a massive colony, and hungry 24/7.<br>\r\n<br>\r\n* Bulleta the Human. The most dangerous and bloodthirsty Dark Hunter around, she wants to kill Jon Talbain, mistakenly thinking he killed her grandma. Incredibly psychotic with an appetite for death and destruction.<br>\r\n<br>\r\n* Jon Talbain the Werewolf. Okay, so he's not a female, but he's awesome, incredibly popular, and ready to expand anyway. ;3<br>\r\n<br>\r\n* Rikuo the Fishman. Another male option for those who are into it. King of a Brazilian underwater kingdom, and curiously attractive for a fishman.<br>\r\n<br>\r\n* If you really insist on doing so, you can choose one of the other male characters, but there's a catch...</span></div></div>",
            "created":1216011600,
            "id":558640,
            "title":"Other choices"
        },
        "151":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Q-Bee, eh? Excellent choice. How will she expand? Will she perhaps gain weight with her constant eating, or maybe somehow get turned into a big bee balloon?</span></div></span></div>",
            "created":1216184400,
            "id":556395,
            "title":"Q-Bee"
        },
        "1512":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "A now active helium tank",
                "A huge inflated balloon",
                "Something Esle"
            ],
            "content":"<div class=\"\"><div> <span>Q-Bee has always been inertrested in balloons, she never knew why, but she loved to watch the giant balloons being walked down the street. She found a place where they were being kept and snuck inside at night. She walked around looking at the differant deflated balloons when she tripped on something which caused one of the balloons to start inflating rapidly infront of her, surprised, she stepped back when she felt her stinger jam into something behind her. Turning to look she saw...</span></div></div>",
            "created":1267506000,
            "id":844799,
            "title":"Surprised Bee"
        },
        "15121":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "She was able to remove the stinger",
                "She could not and is stuck"
            ],
            "content":"<div class=\"\"><div> <span>Q-bee's eyes went wide as she saw and felt her tail start to rapidly inflate due to the helium. It very quickly became the size of a beachball and she tried to remove the stinger from the valve but could not move it. She started to feel weaker due to the growing pressure from her tail which had stopped inflating and the helium was starting to enter her rear. With one final push...</span></div></div>",
            "created":1267592400,
            "id":845255,
            "title":"Bubble tail/butt?"
        },
        "151212":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Her belly is larger than her legs and keeps growing",
                "Her legs are larger than her belly and keep growing"
            ],
            "content":"<div class=\"\"><div> <span>Q-Bee whimpered as she realized she was completely stuck. \"Oh no!\", she cried, \"Someone help!\" But no one was around to hear her...<br>\r\n<br>\r\nShe moaned and squirmed as her ass inflated larger and larger, soon twice the size of her stinger. It then moved into her legs and belly, bloating them up nicely as well. She can't help but notice the air seems to like one more than the other...</span></div></div>",
            "created":1267938000,
            "id":847234,
            "title":"She could not and is stuck"
        },
        "1512121":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "one of the other female darkstalkers",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Q-Bee felt that her belly, which had grown to the size of a huge beachball, had grown more than her legs. Now really feeling the presure move up to her breasts which now reached double d cup and rapidly passing it, she feared that she was going to pop. She couldn't help but moan slightly from not just the pressure of the helium inside her but also the pleasure her ballooning body was giving her. Just as she though she was going to burst she looked up to see...</span></div></div>",
            "created":1267938000,
            "id":847249,
            "title":"Airy Belly"
        },
        "15121211":{
            "author_id":"slashkamei",
            "author_name":"slashkamei",
            "choices":[
                "Felicia",
                "Morrigan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who should show up?</span></div></span></div>",
            "created":1267938000,
            "id":847261,
            "title":"one of the other female darkstalkers"
        },
        "1513":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Breast expansion",
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe some breast or ass expansion? {Ass can include her stinger}</span></div></span></div>",
            "created":1216789200,
            "id":559725,
            "title":"Other choices for Q-Bee"
        },
        "15133":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Fruitification - Lemon",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe you'd like to turn her into a big lemon?</span></div></span></div>",
            "created":1216789200,
            "id":559815,
            "title":"Another choice for Q-Bee"
        },
        "151332":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle growth",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you think she could use some extra muscle?</span></div></span></div>",
            "created":1218258000,
            "id":567668,
            "title":"Other"
        },
        "152":{
            "choices":[
                "Weight gain.",
                "Inflation.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Of course, the psycho granddaughter of Red Riding Hood. All right, how do you want here to expand?</span></div></span></div>",
            "created":1271998800,
            "id":872179,
            "title":"Bulleta"
        },
        "1523":{
            "choices":[
                "Breast expansion.",
                "Butt expansion.",
                "More options."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, nothing with the first two options, huh? Eh, no biggie: plenty to still choose from.</span></div></span></div>",
            "created":1271998800,
            "id":872204,
            "title":"Choices selection 2."
        },
        "153":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, your choice is the handsome wolf, eh? A good choice indeed! So, will he be gaining weight, or maybe becoming a big wolfie balloon? Or perhaps something else?</span></div></span></div>",
            "created":1216011600,
            "id":555767,
            "title":"Talbain"
        },
        "1531":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want Talbain to get Midnight Blissed, or are you OK with him remaining a guy?</span></div></span></div>",
            "created":1252731600,
            "id":759220,
            "title":"Weight gain"
        },
        "15311":{
            "choices":[
                "Willingly",
                "Forced"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why does he gain weight?</span></div></span></div>",
            "created":1305435600,
            "id":1106717,
            "title":"Male"
        },
        "153111":{
            "author_id":"foxclox",
            "author_name":"Foxclox",
            "choices":[
                "Felicia loves her some tubby wolfy!",
                "Something else instead."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Jon be willing to get fat?</span></div></span></div>",
            "created":1348290000,
            "id":1433192,
            "title":"Willingly"
        },
        "1533":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Muscle growth",
                "Fruitification - Blueberry",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you'd like him to have bigger muscles? Or maybe you want him to become a nice big piece of fruit...?</span></div></span></div>",
            "created":1216184400,
            "id":559816,
            "title":"More choices for the wolfie"
        },
        "15332":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Keep him male",
                "Midnight Bliss!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you like him to stay male for this one, or would you prefer to Midnight Bliss him?</span></div></span></div>",
            "created":1219726800,
            "id":574824,
            "title":"Fruitification - Blueberry"
        },
        "15333":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Breast expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, you could Midnight Bliss him and give him a nice breast expansion...</span></div></span></div>",
            "created":1216789200,
            "id":559743,
            "title":"\"Come on, baby...\""
        },
        "153332":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Butt expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can give our favourite wolfie a bigger ass if you like too!</span></div></span></div>",
            "created":1218258000,
            "id":567669,
            "title":"Big Butt Wolf"
        },
        "1533321":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For this one, would you prefer he be male or female?</span></div></span></div>",
            "created":1218258000,
            "id":567671,
            "title":"Butt expansion"
        },
        "155":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Jedah",
                "Raptor",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>So, you decided to go for another male character? Well then, here's the catch...<br>\r\n<br>\r\nWhoever you choose has to be Midnight Bliss'd!<br>\r\n<br>\r\nAlong with each character's description, I will include a link to a picture of their Midnight Bliss form, in case some of you may have forgotten or don't know what they look like.<br>\r\n<br>\r\nSo, who's it gonna be? Your first options are...<br>\r\n<br>\r\n* Jedah Dohma, a 1,000-year-old Antichrist trying to destroy the world and rebuild it, simply because he is disgusted by humanity.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Jedah_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a><br>\r\n<br>\r\n* Lord Raptor the Zombie. A long-dead Australian rock star who committed large-scale murder-suicide at his final concert and now hungers for souls.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Lord_Raptor_transfo-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></div>",
            "created":1216616400,
            "id":753979,
            "title":"Other male choices... With a catch..."
        },
        "1551":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you've chosen the fearsome and--as of the Midnight Bliss-age--sexy Dark Messiah? Excellent choice! Will you be having her gain lots of weight, or perhaps turning her own inflation fascination back on her? ;3</span></div></span></div>",
            "created":1218258000,
            "id":567662,
            "title":"Jedah"
        },
        "15513":{
            "author_id":"former182",
            "author_name":"Former182",
            "choices":[
                "Hourglass expansion",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hourglass expansion or something else?</span></div></span></div>",
            "created":1339995600,
            "id":1362107,
            "title":"Something else"
        },
        "1552":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your choice is the amazing Lord Raptor, eh? Or should we now say, Lady Raptor? Well then, what'll be happening to her? Will the cadaverous cutie let herself go BIG-TIME, or perhaps end up as a beautiful balloon?</span></div></span></div>",
            "created":1218258000,
            "id":567665,
            "title":"Raptor"
        },
        "15523":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Fruitification - Peach",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe some fruitification is what you'd like?</span></div></span></div>",
            "created":1218258000,
            "id":567673,
            "title":"Dead fruit"
        },
        "1553":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Bishamon",
                "Victor",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Maybe one of these? And don't forget, you have to Midnight Bliss them.<br>\r\n<br>\r\n* Oboro Bishamon the Cursed Samurai. Long ago, he found the demon armor Hannya and the bloodthirsty sword Kien. Now he lives eternally... As long as he feeds the armor and sword with the blood of his victims every night...<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Bishamon_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a><br>\r\n<br>\r\n* Victor von Gerdenheim the Flesh Golem. A huge hulking monster made of random dead people's body parts and brought to life by lightning, similar to another famous monster we all know and love. However, under the massive muscles and scary appareance, he's got a heart of gold.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Victor_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></div>",
            "created":1216616400,
            "id":558628,
            "title":"More choices"
        },
        "15533":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Sasquatch",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still not satisfied? Okay then...<br>\r\n<br>\r\n* Sasquatch. Self-explanitory. He's a big lovable simple-minded beast from the Canadian Rockies, who loves bananas and cold weather.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Sasquatch_transform-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></span></div>",
            "created":1216616400,
            "id":558629,
            "title":"Still more choices"
        },
        "155331":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Male",
                "Blissed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you've decided to go with good ol' Sasquatch? Nice choice!<br>\r\n<br>\r\nAs a special treat, our dear mountain-dweller can be selected as male or Blissed! Which will you choose?</span></div></span></div>",
            "created":1218258000,
            "id":567676,
            "title":"Sasquatch"
        },
        "155332":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Donovan",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Next choice:<br>\r\n<br>\r\n* Donovan Baine the Dhampir. A mopey half-vampire Dark Hunter who wants more than anything to defeat the darkness inside him. He is followed around by an emotionless little girl with psychic abilities named Anita, and Donovan feels it is his duty to protect her and help her have emotions again.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Donovan_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></div>",
            "created":1216616400,
            "id":558630,
            "title":"Yet another choice"
        },
        "1553322":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Anakaris",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>* Anakaris the Mummy. King of an ancient Egyptian kingdom, he has risen from his tomb to try and cleanse the world of darkness and rule a new and far larger \"perfect kingdom\".<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Anakaris_transforms.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></span></div>",
            "created":1216616400,
            "id":558632,
            "title":"We're running out of characters!"
        },
        "15533221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, as we all know, scary skinny is no way for a queen's figure to look. How about helping our Queen of the Nile pack on some weight?</span></div></span></div>",
            "created":1218258000,
            "id":567677,
            "title":"Anakaris"
        },
        "15533222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Demitri",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Perhaps you'd prefer...<br>\r\n<br>\r\n* Demitri Maximov the Vampire. One of the main villains of the series, he was sealed away in a coffin for over a century, and now tries to grow strong enough to take over the Makai. He's also the user of the Midnight Bliss technique.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Demitri_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></div>",
            "created":1216616400,
            "id":567658,
            "title":"Not many choices left"
        },
        "155332222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Pyron",
                "Anyone left?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>* Pyron the Alien. A cruel alien entity who grew too powerful for his own home planet to handle. He destroyed it and now searches for other planets to absorb.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Pyron_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></span></div>",
            "created":1216616400,
            "id":558635,
            "title":"Final male option"
        },
        "1553322222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Huitzil"
            ],
            "content":"<div class=\"\"><div> <span>Actually, there is one more, but if you want this one, you apparently wanted neither male nor female.<br>\r\n<br>\r\n* Huitzil the Robot. A horde of these were sent to Earth 65,000,000 years ago by Pyron. After exterminating the dinosaurs, they went to sleep under what later became the Mayan kingdoms. They were woken by the Mayans to work for them, then slept for many centuries. Now they awaken again...<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i252.photobucket.com/albums/hh18/TheSwedishElf/Darkstalkers_Huitzil_transforms-1.jpg\" target=\"_blank\">http://i252.photobucket.com/albums/hh18/...</a></span></div></div>",
            "created":1216616400,
            "id":558636,
            "title":"Anyone left?"
        },
        "15533222221":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Weight gain",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Huitzil-girl be gaining weight?</span></div></span></div>",
            "created":1218258000,
            "id":567655,
            "title":"Huitzil"
        },
        "155332222212":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Definitely!",
                "Nah, something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you prefer her inflated perhaps?</span></div></span></div>",
            "created":1218258000,
            "id":567666,
            "title":"Robolloon"
        },
        "1553322222122":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Let's bulk her up!",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well then, maybe what she needs is more muscle...?</span></div></span></div>",
            "created":1218776400,
            "id":570230,
            "title":"Musclebot"
        },
        "15533222221222":{
            "author_id":"theswedishelf",
            "author_name":"TheSwedishElf",
            "choices":[
                "Fruitification - Pumpkin",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about turning her into a big fat pumpkin?</span></div></span></div>",
            "created":1218776400,
            "id":570236,
            "title":"A \"sweeter\" choice..."
        }
    },
    "info":{
        "author_id":"theswedishelf",
        "author_name":"TheSwedishElf",
        "brief_description":"An interactive story where various stars of the Darkstalkers series are yours to expand!",
        "created":1216020600,
        "description":"<td align=\"left\" class=\"norm\">First off, here's what the stories will focus on:<br>\r\n<br>\r\n* Weight Gain<br>\r\n* Inflation<br>\r\n* Breast Expansion<br>\r\n* Butt Expansion<br>\r\n* Giantess<br>\r\n* Fruitification {Blueberry-style Inflation}<br>\r\n* Muscle Growth<br>\r\n* Hourglass {Breast+Butt Expansion}<br>\r\n<br>\r\nHere are some rules for this story.<br>\r\n<br>\r\n1. Feel free to mix expansion types within one storyline, but please try to keep the focus on the type that was originally chosen.<br>\r\n<br>\r\n2. Sexual content is fine, but like everything else, don't half-ass it.<br>\r\n<br>\r\n3. No insanely fast massive expansion or growth.<br>\r\n<br>\r\n4. USE PROPER SPELLING AND GRAMMAR SKILLS. I cannot stress this rule enough!<br>\r\n<br>\r\n5. Like it or not, the majority of the male characters must be Midnight Blissed if you want to expand them.</td>",
        "id":1450505,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1572060600,
        "modified":1572060600,
        "pretty_title":"Darkstalkers Expansion"
    }
}