{
    "chapters":{
        "1":{
            "author_id":"dannyboy05",
            "author_name":"masterhand",
            "choices":[
                "tied up, wrapped up, gagged and try escape",
                "drink all the menstural fluids from any girl who is having a period",
                "be eaten by a snake and will survive by eating everything the snake eats",
                "Be taped to five girls for a day each for 48 hours each girl",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You wake up like any other day then you leap out of bed remembering today was Saturday which meant no school. You then went downstairs and got some breakfast. You ate you brekfast and went upstairs. On the way up you bumped into your sister Rachel who said \"meet me at the park at ten o'clock.\" She then left and went off to her own room you the went on to yours and got changed. After that it was  ten to ten so you decided to go to the park to see what she wanted you for. It took you about ten minutes to get to the park and you saw your sister and a very large crowd of girls you knew from school but for some reason no boys. Your sister then brought you into the centre of the girls and said to you \" I have a challenge for you. if you complete it you will have great powers but if you lose everyone who says you can't complete it will own you for three days.\" You think about it and then you say \"what is the challenge\". Your sister then says with a grin...</span></div></div>",
            "created":1290283800,
            "id":997504,
            "title":"The beginning"
        },
        "11":{
            "author_id":"dannyboy05",
            "author_name":"masterhand",
            "choices":[
                "continue",
                "after one day",
                "you escape but are accused of cheating",
                "some fun distraction",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"You will be tied up in a pair of pantyhos from top to bottom with a gag so we don't have to hear you struggle then you must try and escape from them however we can distract you in many ways to try and stop you.\" From what you heard it seemed very easy and you couldn't think of any distractions that would seriously stop you so you agreed to it. Your sister then produced two pairs of the pinkest pantyhos you had ever seen probably to distract you more.The first thing she did surprised you quite a bit as she wiggled her pantys down her leg from under her skirt and lifted them up in her hand. It was discusting as they had skid marks and what looked like a spot of blood. She then brought her panties to your mouth,forced it open and shoved them in, you felt sick. She then held in her other hand a menstural pad a used one and put the sticky side to your mouth and put it on. Her  friends then grabbed your arms then she began with tying up. She firstly put your head into the leg of one and brought it to the foot section and brought it as far down as she could get it. She then did the same with your legs. She then ordered you to put your hands behing your back so you did. Then Your younger sister Sarah showed up and produced duct tape she then began to wrap it round your pantyhos encased body very tightly until you could barely move. The tape was then applyed to your mouth which already had your sisters panties in it and a used menstural pad and tightened them to your mouth, even through the panties you could still taste the menstural fluids and it made you want to gag. You were completely tyed up. (almost like this only a dude and some pantyos around your body <a rel=\"nofollow\" href=\"http://www.deviantart.com/download/159658277/A_girl_tied_up_and_gagged_2_by_Momoyoy.png\" target=\"_blank\">http://www.deviantart.com/download/15965...</a>) Rachel then said out loud \"he has all day to try and escape now come with me to make your bets. They all left then with only Sarah and some other girls to keep an eye on you and laugh...</span></div></div>",
            "created":1290287160,
            "id":997547,
            "title":"tied up, wrapped up, gagged and try escape"
        },
        "114":{
            "author_id":"dannyboy05",
            "author_name":"masterhand",
            "choices":[
                "She tortures you (transform)",
                "She makes you do awful jobs for her (normal)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>After Rachel and the other girls left you began to try and wiggle about however you found it quite difficult due to the amount of tape around your pantyhos encased body.<br>\r\n<br>\r\nAfter about an hour of struggling Sarah and her friends lifted you up and began to carry you away from were you had been. They then got a ladder and went to a tree and brought you up to one of the branches and then they tied you to the branch and climbed down leaving you to dangle there trying to escape but even though you weren't that far off the ground you still found it harder to move than on the ground but you had to keep trying to escape even with your face near the bround. However most of your movements only came from the wind blowing you and then to torture you more Rachel then came back with a dog and brought it over to your tree right in front of you. The dog then lifted its leg up to your face (it wasn't that far off the ground) and peed all over you it then took a poo on the ground in front of your nose and then Rachel allowed it to go away.<br>\r\n<br>\r\nFor hours you tried to escape but you found it impossible and you hadn't even got rid of any of the tape yet but you still had about twelve hours to try so you kept going.However at about midnight you drifted asleep without wanting. When you woke up you sisters and their huge crowd of girls were standing around you then Sarah said to you \"your time is up you failed the challenge and now each girl who bet against you will own you for three days each and they will be given special powers over you.\" With that she took you down from the tree and handed you to a hot looking blond girl who was quite fit and you were told to do everything she said or else and that you would have a chance to get free after ten girls had owned you but for now you couldn't do anything as you were still taped up in your pantyhos prison and the fit blond girl carried you away.</span></div></div>",
            "created":1290355260,
            "id":998212,
            "title":"Tree time"
        },
        "1141":{
            "author_id":"tkmaster",
            "author_name":"Teus",
            "choices":[
                "3 days later......",
                "She decids to torture you in a different way a day later"
            ],
            "content":"<div class=\"\"><div> <span> Rachel carried you back to her room followed by the other girls. She then places you on her bed and started to untie you while she has the others hold you in place to make sure you don't try to escape..  <br>\r\n<br>\r\n  \"Oh, Darn my pantyhose ripped and that was my last pair...\" Rachel says, then she looked at you with a evil looking grin..  \"Oh well i guess i know how you will serve me for the next 3 days. With that your vision became dark...  When you awoke you were looking at the ceiling, unable to move. Then you feel someone grab you and lift you up. Then when facing a mirror you notice it is Rachel holding a pair of pink pantyhose.  Rachel said\" Well you sure do make a nice pair of panyhose, if i do say so myself\" rachel giggles as she started to lower the pantyhose down to her feet.  As the other girls watched Rachel started to put on the pair slowly to make sure you feel everything.  After she finished putting you on she then walked to the mirror for a close up and said  \"Well I think this is a perfect way to start his torture, only fitting really seeing it was pantyhose that did him in.\"  The rest of the girls laughed and said \"We can't wait till our turn, We sure have some ideas on how we can torture him\"  Rachel replied \"I'm sure you gals do but for now hes mine\"  Rachel then procedded to put on her tight Jeans which blocked your view from the outside world, you can now only feel what it would be like to be in between your sisters leg and jeans, with the fabric rubbing against you as she moves..  <br>\r\n<br>\r\n</span></div></div>",
            "created":1299438060,
            "id":1065804,
            "title":"She tortures you (transform)"
        },
        "13":{
            "author_id":"dannyboy05",
            "author_name":"masterhand",
            "choices":[
                "get pooped out early",
                "give up",
                "try to survive",
                "try to get out another way",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You will be eaten by hissy my secret pet snake and you will live inside her for one week and the only food you will get will be what hissy eats and yes you will feel things but you won't die.\" To you it didn't sound too nice but then you knew your sister and she would make your life a nightmare if you didn't do it so you said to your sister that you would do it also you knew she wasn't joking as one time she tied you up in her room with used menstural towels and used you as her own personal chair, bed and clothes model for two weeks while your parents were away so you knew she would do it. You then agreed to do it as if you didn't she would make your life even worse and your parents were going away in two weeks time. She smiled then Sarah walked out and a bug snake followed her. You were then tied up and covered in snake food to attract hissy to eat you everyone then stepped back as hissy came towards you with her mouth opened wide and swallowed you in one go you then went down into her stomach it stank and you could barely move and you were pushed up against hissys stomach linig which was all sllimy and the acids were burning you but as you had been told you were still alright.<br>\r\n<br>\r\ndo you...</span></div></div>",
            "created":1290457620,
            "id":998972,
            "title":"be eaten by a snake and will survive by eating ..."
        },
        "14":{
            "author_id":"dannyboy05",
            "author_name":"masterhand",
            "choices":[
                "go out clubbing",
                "go to get some mexican food",
                "just want to torture you with the heat and smell",
                "take you out ,un tape you and say you cheated",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You will be taped to five girls for 48 hours each but what way they want to tape you to them is up to them. But if you don't do it then I will tell everyone your dark little secret and you wouldn't want that would you at least give it a go.\" As it seemed you had no choice you decide to go for it so you agreed Your sister then brought out a tall blond girl who was quite fit. She then told your sister that she wanted you taped to her back upside down so your mouth would be at her butt it wasn't looking good for you. You were then lifted by Rachel and Sarah and tipped upside down and brought to the girls backside, you are pushed up hard against it and your mouth is right at her crack so was your nose. You then feel yourself being tightened to the girl and you feel duct tape all over your body. You then hear you sisters laugh and the blond girl pulls up a miniskirt and walks away with you. As she walked you noticed that your feet were stuck into her bra straps at her shoulder and the straps were cutting into your feet but with your mouth at this blond girls butt there wasn't much you could do about it. Then you had a horrifying realisation that at least every 24 hours you should go poo and that meant it would come out into your mouth twice probably the thought sickened you. Just as you finish thinking of these things you feel the girl stop moving you then feel a force pushing onto you she must be sitting down and on top of you it was very painful you then hear a rumbling next to you and a wave of stinking gas came out at you the girl just giggled and walked for and other minute and then sat down. It was what you feared as you could see below you was the toilet she probably just wanted to make sure she didn't get any over herself what didn't go over you or into your mouth anyway. Then it started giant logs came and splattered over your face you knew to survive you would have to eat it.<br>\r\n<br>\r\nAfter about ten minutes logs stopped coming and you licked her butt clean and you could breath sotr of cleanly again. The girl then took her mini skirt off and put on a thong which pushed your face even more against her crack then pair of pantyhos right over your face you were defenitely not getting away now and it was getting hot<br>\r\n<br>\r\ndoes she...</span></div></div>",
            "created":1290371820,
            "id":998412,
            "title":"Be taped to five girls for a day each for 48 ho..."
        },
        "144":{
            "author_id":"aleksb",
            "author_name":"aleksb",
            "choices":[
                "accused of cheating "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she brings me back to sisters and tell what<br>\r\nhappend. you say it was a lie but no one <br>\r\nbelieves that. </span></div></span></div>",
            "created":1589151120,
            "id":2833545,
            "title":"take you out ,un tape you and say you cheated"
        },
        "145":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "\"taping you to the bottom of my shoe\"",
                "\"Having yuu lick my foot\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She rips off the tape and takes you out. She takes off her shoe revealing her bare foot.<br>\r\n<br>\r\n\"What are you doing?\" You ask.</span></div></span></div>",
            "created":1417629360,
            "id":1897195,
            "title":"readers choice"
        },
        "15":{
            "choices":[
                "Agree to the challenge and head off as you are now",
                "Agree to the challenge, but the girls dress you in drag first",
                "Agree to the challenge and your sister makes you into a sexy girl first",
                "Agree to the challenge but your sister makes you into an ugly girl first",
                "Don't agree to the challenge and sister starts to punish you for it"
            ],
            "content":"<div class=\"\"><div> <span>\"The challenge is this.  One of us girls will be with you for the next 24 hours, every minute.  She has to watch you give oral sex to another boy, and swallow, then thank him for it.  So the question is, are you man enough to act like a slutty woman for a day?\"  The girls all look on and giggle at you, wondering if you'll do it.  </span></div></div>",
            "created":1304925780,
            "id":1102909,
            "title":"Give another boy a 'happy'"
        },
        "152":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                " a maid outfit",
                "a school girl outfit",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"fine\"you say<br>\r\n<br>\r\n\"not so fast\" Sarah says<br>\r\nDanie then hands you<br>\r\n</span></div></span></div>",
            "created":1413785340,
            "id":1874497,
            "title":"Agree to the challenge, but the girls dress you..."
        },
        "1523":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "a witch costume",
                "a prom dress ",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she hands you</span></div></span></div>",
            "created":1423631040,
            "id":1931598,
            "title":"other"
        }
    },
    "info":{
        "author_id":"dannyboy05",
        "author_name":"masterhand",
        "brief_description":"you are challenged to a challenge and fail now those who went against you own you now",
        "created":1290196980,
        "description":"<td align=\"left\" class=\"norm\">You are challenged to a challenge but you fail now you are under anyone who said you wouldn't do it for one week each and lots of people went against you and the people in charge of you all have been given the power to transform you in any way.<br>\r\n<br>\r\ncharacters<br>\r\n<br>\r\nDaniel: 16 short brown hair, averaged size and likes wearing tracksuits and playing games consoles<br>\r\nRachel: 18 long blond straight hair, always wearing tight clothes and high heels. She goes against Daniel in everything he does (Daniels older sister sister)<br>\r\nSarah: 14 long brown hair in a ponytail, always dresses in loose clothing and is always doing various sports<br>\r\nMore characters will be in the story but won't be mentioned here<br>\r\n<br>\r\nRules<br>\r\n1. the only people who can own daniel more than once are his sisters as it was their idea<br>\r\n2. no swearing<br>\r\n3. Anyone who went with Daniel and said he would complete the challenge or people who didn't know about it carry on as usual<br>\r\n4. mostly transformation uses but I like a few other punishments such as bondage and possibly vore(remember the owners have special powers over him)<br>\r\n5. He must be passed onto the next person who will own him after 3 days<br>\r\n6. No deaths<br>\r\n7. No endings (there are plently of people who can own him so keep it going)<br>\r\n8. Only women owners but other males can be mentioned eg sex but they can't tell them about Daniel or transform anyone else other than Daniel<br>\r\n9. His parents aren't to wonder about him (powers) and rule 3<br>\r\n10. Sex is allowed<br>\r\n11. No one liners only I may do that at a later stage but not often<br>\r\n<br>\r\nother than that have fun and make an addition GP is available for good additions</td>",
        "id":1725754,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589151120,
        "modified":1589151120,
        "pretty_title":"transformation slave"
    }
}