{
    "chapters":{
        "1":{
            "author_id":"ninajason",
            "author_name":"Nina",
            "choices":[
                "A pair of shoes",
                "A pair of panties!",
                "A bra",
                "She waits till shes in her room",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"Dont forget the present you bought for your sister today! See you later\" said your mother before she went outside. You jumped out of the bed in panic \"Oh F*** sara birthday is today! I completely forgot about it!\" You looked around as you couldnt see something to give to a 16 year old. \"It must be something special and one of a kind....dammit i have nothing. I have still some time left till we celebrate it...goddammit i also wanted to go to my friend today FUUUUU-\" then suddenly you got a genius idea \"wait didnt i bought this potion to prank someone...maybe it can help me.\" You quickly went to the shelf and saw the bottle with the label transformation doll juice on it. \"Yes! Perfect. I think what the man said was that you can turn back at will as soon as your not in use anymore..fuck it lets go!\" With that you swollowed the whole liquid that was inside of the bottle and quickly made a present box. You felt yourself getting smaller and smaller as you wrote a little card and put it inside of it. Your movement became heavier and heavier and you decide to jump into the box and put the lid down. A couple of minutes later you pass out.<br>\r\n<br>\r\n<br>\r\n\"HAPPY BIRTHDAY TO YOU, HAPPY BIRTHDAY TO YOU,HAPPY BIRTHDAY DEAR SARA HAPPY BIRTHDAY TO YOUU\" sang your mom and at the same time woke you up.<br>\r\n<br>\r\n<b>SARA'S POV</b><br>\r\n<br>\r\nSara opens the box were you was in first. She looked at you with a bit of dissapointment. \"A doll? What am i, 9?\" She takes the card out first and reads it. \"What? This thing can be anything i want? Awesome!\" She takes you out and examins you. \"Hmm what should i wish for?...\"</span></div></div>",
            "created":1588654800,
            "id":2830428,
            "title":"Was it today?"
        }
    },
    "info":{
        "author_id":"ninajason",
        "author_name":"Nina",
        "brief_description":"You forgot the 16th birthday of your sis and now you turned yourself into the present",
        "created":1588678020,
        "description":"<td align=\"left\" class=\"norm\">You forgot the 16th birthday of your sister sara, in an act of desperation you decide to turn yourself into a transformation doll with the plan to turn back at night. Unfortunately it didnt go like planned.</td>",
        "id":2221156,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1588678980,
        "pretty_title":"Your sisters birthday present"
    }
}