{
    "chapters":{
        "1":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "humans",
                "digimons",
                "humans and digimons",
                "other",
                "your own characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so how will the story begin...</span></div></span></div>",
            "created":1312952400,
            "id":1165811,
            "title":"let's get started"
        },
        "11":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "Takato Matsuki",
                "Henry Wong",
                "Rika Nonaka",
                "Jeri Katou",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>remember only the humans can gain weight!</span></div></span></div>",
            "created":1312952400,
            "id":1165814,
            "title":"humans"
        },
        "111":{
            "author_id":"michael10",
            "author_name":"storyman",
            "choices":[
                "Takato",
                "Rika",
                "Henry"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day at the Matsuki bakery. Takato was relaxing in a chair munching on a donut from the shop. He loved his mom's sweets. They were the tastiest creamiest pastries in the entire town. When it came to his Mom she made sure that her food was so delicious and sweet that she disregards health issues to make it better and tastier. She put as much fat and sugar as possible into her meals and her sweets.She believed that taste was what was important in food, not health facts. She loved to see her food fill people by them constantly eating it, getting fatter and chubbier with double chins, jiggling bellies and fat butts. She hated when skinny people would go by her store and be active and fit. She wanted them to eat, because thats what she believed everyone should be doing more of and was completely against all those weight loss commercials and diets that would show on TV. Her personal belief is that skinny people are underfed and malnourished and need to be fattened up, without endangering their health, for her food was specially designed not to affect the heart and bypass arteries so they wouldn't be clogged. She believed that a chubby, round faced and plump person was a person with a healthy appetite and appreciation for food. Of course she couldn't force her opinion on people, except her son and husband.She especially enforced this on her son Takato, who loved playing the digimon card game, but despite how fattening and unhealthy her delicious sweets were they didn’t seem to affect her skinny son’s weight. His metabolism was just too high for him to gain any weight.<br>\r\n<br>\r\nIt had been her concern that Takato wasn’t in the state of health that she wanted him to be in. She wanted him to be thick and chubby, with plump cheeks soft enough to squeeze and pinch and a large jigging belly that would constantly poke out of his shirt, along with a fat rump that she would just adore and bouncing boy breasts. She wanted his mind focusing less on running around and hanging out with his friends and more on being at home, constantly eating her delicious sweet pastries, which would make her happy. And if it was possible, maybe do the same thing to his friends Rika and Henry as well. She thought they needed to be taught a lesson being as skinny as they were and needed to become nice and plump, and eating her food was going to do that.<br>\r\nShe had decided to make sure that those three start eating as much as possible, but who was she going to start with?</span></div></div>",
            "created":1329627600,
            "id":1280308,
            "title":"A mother's strict beliefs"
        },
        "1111":{
            "author_id":"michael10",
            "author_name":"storyman",
            "choices":[
                "She forces Takato to go on a strict dessert and bread diet",
                "She forbids him from going outside and makes sure he keeps eating",
                "reader's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, how does she do it?</span></div></span></div>",
            "created":1329714000,
            "id":1280473,
            "title":"Takato"
        },
        "11111":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "a tray of hamburgers and hotdogs",
                "pies and watermelons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She first tells takato to go to his room and when he gets there...</span></div></span></div>",
            "created":1339822800,
            "id":1360695,
            "title":"She forces Takato to go on a strict dessert and..."
        },
        "111111":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "meatballs",
                "pizza"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he finds a full tray of hamburgers and hotdogs. she the comes in picks up one of the foods and stuffs it in his mouth. after a while of stuffing she brings in...</span></div></span></div>",
            "created":1339822800,
            "id":1360699,
            "title":"a tray of hamburgers and hotdogs"
        },
        "11112":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "fatten takato up and one of his friends",
                "cook more food and gets one of his friends to get him to eat"
            ],
            "content":"<div class=\"\"><div> <span>For about a week now takato's mom has been keeping him inside and cooking and stuffing him. Takato still hadn't grown that much though. Takato hasn't even been outside at the park and still no gain.<br>\r\n   His mom talks to Mr.matsuki about it. \"Why is he fattening up?\" She asked. \" I don't dear. Why should you force him into being fat?\" He responded then lid to sleep. \"I know maybe I could...</span></div></div>",
            "created":1379221200,
            "id":1663746,
            "title":"takato skinny days ends here"
        },
        "111121":{
            "author_id":"0000w",
            "author_name":"0000w",
            "choices":[
                "A week had passed and the boys are getting fat",
                "The next day, Kazu join them"
            ],
            "content":"<div class=\"\"><div> <span>His mom wondered how she could convince Takato to keep eating and gain weight. She decided to sleep on it. At lunch, his mom called Takato to eat. He walked to the table, and was surprised that Henry was sitting at the table.<br>\r\n\"Henry? What are you doing here?\" asked Takato<br>\r\n\"My apartment is getting fumigated so my family had to move out for a month, or longer depending how fast they can finish\" answered Henry. \"My parents are at a hotel that would be too expensive if Suzie and I were with them, so Suzie's with Rika, and your mom said I could be here.\" Takato was thinking that Terriermon would have to stay with Guilmon for the time being. They then ate their lunch. Takato's mom noticed that not only did Takato ate a lot more then he usually did, but Henry ate the exact same amount. When they left the house (To see their Digimon) she saw that Takato's shirt was stretched a bit. Henry's was too, but less then Takato.<br>\r\n\"This might be the answer!\" she thought. Having both Takato and Henry gain weight. Then...<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668549,
            "title":"fatten takato up and one of his friends"
        },
        "11113":{
            "author_id":"michael10",
            "author_name":"storyman",
            "choices":[
                "Reader's choice",
                "Drugs & chemicals"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about she orders some ultra-strong weight gain formulas from online &amp; starts drugging Takato's food with a laziness sedative &amp; a high calorie diet.</span></div></span></div>",
            "created":1329714000,
            "id":1280479,
            "title":"reader's choice"
        },
        "111131":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "other options",
                "Other options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about some more choices?</span></div></span></div>",
            "created":1331355600,
            "id":1292474,
            "title":"Reader's choice"
        },
        "1111312":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "That sounds good.",
                "No. One at a time(well you're a mean one, Mr. Grinch :P)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe she'll just fatten Takato, Rika, and Henry at once rather than one at a time?</span></div></span></div>",
            "created":1336626000,
            "id":1334150,
            "title":"Other options"
        },
        "11113121":{
            "author_id":"tkdigiboy",
            "author_name":"tkdigiboy",
            "choices":[
                "burgers and hotdogs",
                "stuffed turkey and cornbread"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mrs.matsuki calls all the kids, but wonders what to feed them</span></div></span></div>",
            "created":1378098000,
            "id":1656066,
            "title":"That sounds good."
        },
        "1112":{
            "choices":[
                "Let's invite her over and stuff her silly",
                "There's gotta be a way to hinder her exercise",
                "Let's hook her to chocolate (or your choice)"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Matsuki decided to start with Takato's little redhead friend, Rika. She knew Takato had a bit of a crush on the girl, and fattening her up might open the door to do the same with Takato. She would probably be the easiest one to fatten too, since girls gained weight more easily than guys.<br>\r\n<br>\r\nRika was a very active girl, but she had a very healthy appetite. She kept fit because of all the exercise she did, but Mrs. Matsuki knew that this kind of people, once they stopped exercising, gained weight quickly. She could use this in her strategy. On another hand, making her stop exercising could be a bit difficult. Maybe she should just use every opportunity she got to stuff Rika like a turkey; she would start gaining weight and the exercise would take care of itself. <br>\r\n<br>\r\nMrs.Matsuki smiled. Her plan was starting to take shape. She lived in a bakery; that would facilitate all the process. And if everything else failed, she could use her secret weapon: Chocolate. There is no girl in the world who could resist that wonderful sweet temptation, and in Rika's case, Mrs.Matsuki had seen with her own eyes; the girl looooved the sweet, she was clearly a repressed closet chocoholic, and she was going to take advantage of that. Now where to start...?</span></div></div>",
            "created":1330750800,
            "id":1288132,
            "title":"Rika"
        },
        "11121":{
            "author_id":"biganime18",
            "author_name":"monster child",
            "choices":[
                "normal food.",
                "sweets."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>basic choice should she stuff her with normal foods or lots of sweets.</span></div></span></div>",
            "created":1349413200,
            "id":1441191,
            "title":"Let's invite her over and stuff her silly"
        },
        "11123":{
            "author_id":"biganime18",
            "author_name":"monster child",
            "choices":[
                "agree's. let eating i mean tasting commence.",
                "she dicline's. force feed her."
            ],
            "content":"<div class=\"\"><div> <span>Mrs Matsuki had the idea of having Rika as the bakery's unofficial food taster then hopefully Rika would get her fill of sweets nearly every day. she picked up the phone and called Rika and asked her to come to the shop when Rika hung up she started hatching her plan.<br>\r\n<br>\r\n10 minutes later arrived and Mrs Matsuki asked if she would be the bakery's taster.<br>\r\n<br>\r\nRika.......</span></div></div>",
            "created":1341291600,
            "id":1370948,
            "title":"Let's hook her to chocolate (or your choice)"
        },
        "111231":{
            "choices":[
                "After the feast...",
                "One week later..."
            ],
            "content":"<div class=\"\"><div> <span>\"Taste testing?\" <br>\r\n<br>\r\n\"Yes. I've been experimenting with some recipes lately, and I need someone to test them.\" Mrs. Matsuki answered.<br>\r\n<br>\r\n\"But why can't you or Takato do it?\" Rika asked.<br>\r\n<br>\r\n\"We are both busy, and I need someone impartial who can give me an objective opinion.\" Rika seemed to be thinking over it. \"of course you'll get paid accordingly.\"<br>\r\n<br>\r\n\"Really?\" The redhead's face lit up.<br>\r\n<br>\r\n\"Of course; this is a job one way or another, and you'll get paid for it.\" The woman assured her with a smile.<br>\r\n<br>\r\n\"Ok then, you've got yourself a deal.\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------<br>\r\n<br>\r\n\"All of this?\" The Rika asked, staring at dozens of different pastries covering the kitchen table<br>\r\n<br>\r\n\"For now.\" Mrs.Matsuki replied,\"I might have some more later.\"<br>\r\n<br>\r\n\"So I have to try a bit of each one and tell you how good they are, right?\"<br>\r\n<br>\r\n\"No, you have to eat all of them.\" <br>\r\n<br>\r\n\"A-All of them? Why!?\" The tomboy exclaimed.<br>\r\n<br>\r\n\"It's the only way to get a complete taste; just a little bit won't get you all the characteristics of the pastry.\"<br>\r\n<br>\r\nRika swallowed,\"Ok then, a job is a job.\" Tentatively, the redheaded girl picked up the first pastry, but after one bit, her eyes widened.<br>\r\n<br>\r\n\"This is so good! The chocolate in this eclair is the best I've ever had!\" With renewed vigor, Rika consumed the rest of the pastry, and quickly continued with the others, giving a small comment on each before devouring the next.<br>\r\n<br>\r\nMrs. Matsuki smiled, satisfied with Rika's look of hunger and gluttony. She knew the girl had a sweet tooth, and it was only a matter of time before her body showed the effects.</span></div></div>",
            "created":1348203600,
            "id":1432295,
            "title":"agree's. let eating i mean tasting commence."
        },
        "1112311":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Let's follow Mrs. Matsuki",
                "Let's follow Rika"
            ],
            "content":"<div class=\"\"><div> <span>Several tens of minutes later, there was no pastry on the table.<br>\r\n<br>\r\n\"Uhh... I can't believe I just ate so much!\"<br>\r\n<br>\r\nRika leaned back in the chair and rubbed her strikingly distended belly. It looked like she swallowed a whole big watermelon. She attempted to get up, but eventually she had no choice but to get Mrs. Matsuki's helping hand.<br>\r\n<br>\r\n“Thank you for all the pastries. Those were too tasty to stop eating…” <br>\r\n<br>\r\nMrs. Matsuki gave a pleased smile. “You can come and see me whenever it's convenient for you. If you wish, you can come here every day.\"<br>\r\n<br>\r\nAfter she paid Rika for taste testing, Mrs. Matsuki once left the room and soon came back with a small box. \"I made these cakes myself. This is a little gift for you.\"<br>\r\n<br>\r\nRika was dumbfounded. <i>Is she thinking that I have room for dessert in this state?</i> But, before thinking, she already received the box. \"T-thanks.\"<br>\r\n<br>\r\n------<br>\r\n<br>\r\nAfter saying goodbye to each other...<br>\r\n</span></div></div>",
            "created":1348376400,
            "id":1433336,
            "title":"After the feast..."
        },
        "11123111":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "She begins to lay out the plan to stop Rika's exercise.",
                "No need to worry. That's a small matter."
            ],
            "content":"<div class=\"\"><div> <span>After saying goodbye to each other, Mrs. Matsuki was lost in thought.<br>\r\n<br>\r\nAt present, Rika is only stuffed to the gills, not fat yet. It is important to continue this feeding; by doing so, her stomach will expand and weight will gain. <br>\r\n<br>\r\nAnd there is still another consideration...<br>\r\n<br>\r\n\"Should I make Rika stop exercising?\" She murmured. \"Or will she voluntarily stop it?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1348376400,
            "id":1433338,
            "title":"Pondering baker "
        },
        "111231111":{
            "choices":[
                "Let's invite her over and spoil her rotten",
                "Spike her food a bit so she relaxes."
            ],
            "content":"<div class=\"\"><div> <span>\"She sure has an appetite and a sweet tooth, but Rika is a very sporty girl, I wouldn't be that surprised if she could actually burn all those calories.\" Mrs. Matsuki thought, \"As long as she keeps eating like this on a regular basis she will gain weight, but if she notices what effect the food will have she will probably exercise more, and I can't let that happen... I have to make sure she doesn't exercise.\"<br>\r\n<br>\r\nThe woman thought about Rika's living conditions.<br>\r\n<br>\r\n\"Rika takes care of herself almost completely, so she isn't lazy even though she's got quite a bit of money.\" A thought occurred to her, \"I need to spoil her, to make sure she doesn't have to work or move more than it's necessary. I wonder if there's some way to have her stay at home for some weeks; that way I could take care of her and make sure she becomes lazy.\"<br>\r\n<br>\r\nThe plan seemed effective, but it wouldn't be easy to put into work without suspicion. Then again, there were other options...<br>\r\n<br>\r\n\"I could also spike her food a little bit; make it so it would make her sleepy and drained. A tired and sleepy girl with a full stomach won't be doing any exercise.\" This plan seemed a bit dangerous and not very moral, but it should work fast and easy.<br>\r\n<br>\r\nWhat will Mrs. Matsuki decide?</span></div></div>",
            "created":1348376400,
            "id":1433547,
            "title":"She begins to lay out the plan to stop Rika'..."
        },
        "1112311112":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Not long after, Rika becomes sleepy and sluggish.",
                "The additives takes effect after stuffed Rika left the bakery."
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Matsuki had thought for hours and hours, and decided to spike the food. She would be lying if she said she felt no guilty about it. <br>\r\n<br>\r\n\"It can't be helped.\" She convinced herself. \"The plan to spoil Rika isn't realistic. I can't come up with any specific idea to carry it out. Even If I do that, sooner or later she will begin thinking something is suspicious.\"<br>\r\n<br>\r\n\"So sorry, Rika.\" She said aloud. \"But it’s for your sake.\"<br>\r\n<br>\r\n---------------------------------------------------------------------------- ------------------------------<br>\r\n<br>\r\nRika came to the bakery again a few days later. She's not the addict to those sweets --- at least, for now.<br>\r\n<br>\r\nMrs. Matsuki arranged the dishes of doped pastries on the table as if nothing had happened. Each 'additive' of pastries was negligible amount, but many a little makes a mickle.<br>\r\n<br>\r\nJudging from her usual flat belly, there was no doubt but that redheaded girl spent a lot of time to exercise after the previous tasting. <i>It's hardly to expect she will stop exercise voluntarily</i>, Mrs. Matsuki thought anew.<br>\r\n<br>\r\n\"Okay, everything is ready.\" Mrs. Matsuki called to Rika. \"You can taste at any time if it's OK with you.\"<br>\r\n<br>\r\nWith her eyes shining, Rika straightaway started to pick up those, take a bite, and comment on each. <br>\r\n<br>\r\n\"Hmm...I think this cheesecake tastes too sweet, but still good! Oh, and this waffle is...\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1349067600,
            "id":1438321,
            "title":"Spike her food a bit so she relaxes."
        },
        "11123111121":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Takato comes in and finds Rika.",
                "After a while, Rika wakes up."
            ],
            "content":"<div class=\"\"><div> <span>After about 10 minutes passed, Rika began to feel sleepy abruptly. <br>\r\n<br>\r\n\"Mmm……I'd better keep awoooke...\" She tried to suppress a yawn.<br>\r\n<br>\r\n\"You should take it easy, girl.\" said Mrs. Matsuki sweetly. \"Maybe you're a little tired.\"<br>\r\n<br>\r\n“No way,” She murmured. “I was only eating those sweets. Why am I so much worn out?”<br>\r\n<br>\r\nRika stretched, rubbed her eyes, and made various efforts to drive away the drowsiness. She didn’t eat even half of pastries on the table yet! She doesn’t want to leave her work unfinished.<br>\r\n<br>\r\nBut finally, the drowsiness overcame her. Leaned back in her chair, Rika fell asleep.<br>\r\n<br>\r\nMrs. Matsuki scratched her cheek. \"I might have to reduce the additive. It's too strong for her...\" Then wall clock caught her eye. \"Oh,my! I quite forgot my appointment with friends!\"<br>\r\n<br>\r\nA few minutes later Mrs. Matsuki finished preparations hurriedly and went out. She left a note for Rika.  <br>\r\n<br>\r\n'<i> I'm out for meet my friends after a long absence. If you continue taste-testing when you wake up, please write your comments on this memo pad.</i>'<br>\r\n<br>\r\n</span></div></div>",
            "created":1349154000,
            "id":1439069,
            "title":"Not long after, Rika becomes sleepy and sluggish."
        },
        "111231111212":{
            "choices":[
                "Eat the other pastries",
                "Go back home"
            ],
            "content":"<div class=\"\"><div> <span>The overstuffed girl had been sleeping for over two hours before she woke up. <br>\r\n<br>\r\n*Yawn*...'Huh? Where am I?' Rika looked around the bakery as she stretched a little. 'Oh yeah, I was taste testing at Takato's, and then I fell asleep. How come I fell asleep just like that, it seems weird.' Rika yawned once more. 'Also, even thought I must have taken a pretty big nap, I still feel tired...'<br>\r\n<br>\r\nAt that moment, Rika saw the not Mrs. Matsuki had left her, and realized she still had a lot of pastries to taste, in fact, there seemed to be more than there were before she fell asleep.<br>\r\n<br>\r\n*Growl* Rika was surprised when she heard her stomach growling. 'How am I still hungry?' She touched her midsection with her hand, and realized it was no longer taut and stuffed. \"Hmmm, I must have digested everything while I was asleep. Still, should I really be eating all of this now, it doesn't seem very healthy...\" Rika looked down to the myriad of pastries Mrs. Matsuki had left for her. 'Then again, a job is a job, and I don't want to disappoint Mrs. Matsuki... Also, they are sooooooo good.'<br>\r\n<br>\r\nWith this in mind, and the strange tiredness of her body, Rika decided to...</span></div></div>",
            "created":1349413200,
            "id":1441178,
            "title":"After a while, Rika wakes up."
        },
        "1112311112121":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Rika restrains herself (or tries to it).",
                "1 hour later. Rika, overstuffed to the brim, suffers from indigestion."
            ],
            "content":"<div class=\"\"><div> <span>*<i>Grooowwwll</i>* Rika’s stomach rumbled loudly again. “Gee, I can't help it. How can I waste such a good pastries?”  <br>\r\n<br>\r\nRika tried to act like being reluctant, but her mouth watered at the very sight of the pastries. Despite already got cold, these still looked very delicious. She couldn't resist the temptation. <br>\r\n<br>\r\nShe grabbed an apple pie nearest to her hand, took a bite of it, and chewed with a rapt expression. \"Mmmm...\" Because of she had slept until just a few minutes ago, the drowsiness didn't came back. In a trance, she continued her tasting energetically, ignoring her fatigue. <br>\r\n<br>\r\nShe ate... \"So goooood...Mrs.Matsuki is really excellent baker!\"<br>\r\n<br>\r\nAnd ate... “I never get weary of tasting these!”<br>\r\n<br>\r\nAnd ate... \"I feel a little full, but it doesn't matter much, I can eat more.\" <br>\r\n<br>\r\nAnd ate... \"…It couldn't hurt to taste few more?\" and…<br>\r\n</span></div></div>",
            "created":1350622800,
            "id":1449824,
            "title":"Eat the other pastries"
        },
        "11123111121212":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Mrs.Matsuki or/and Takato arrives home.",
                "Skip to after a week. Mrs.Matsuki is pleased with Rika's weight gain."
            ],
            "content":"<div class=\"\"><div> <span>\"I c-can't eat another bite!!\" Exhausted, Rika whined.<br>\r\n <br>\r\nAbout 1 hour had passed since she restarted taste-testing. There was nothing on the table, and Rika was groggily leaned back in the chair. Her pants was unbuttoned, her belt was unfastened, and her shirt was rolled up on her belly. For these reasons, her overstuffed, distended, swollen, rounded belly had exposed completely.<br>\r\n<br>\r\n<i>'Why did I thought that eat-them-all is good idea!? I'm nearly twice as bloated as than last time!!'</i> Rika couldn't believe she ate so much. She was attacked repeatedly by a dull bellyache from eating too much. To make matters worse, she can't even rise from the chair now. She had to wait for Mrs.Matsuki, who will help her to stand up.<br>\r\n<br>\r\n\"I'm...*hic*...gonna...ugh...burst...\" Continuing to rub her churning belly, Rika let out a series of unladylike belches. If this redhead were usual her, her face might become red as a beet from embarrassment. But now the digimon queen's mind was too clouded to think about her current appearance and the case that someone finds her. <br>\r\n<br>\r\n</span></div></div>",
            "created":1350622800,
            "id":1449898,
            "title":"1 hour later. Rika, overstuffed to the brim, su..."
        },
        "111231111212122":{
            "choices":[
                "10-15 pounds",
                "25 pounds"
            ],
            "content":"<div class=\"\"><div> <span>\"Good afternoon Mrs. Matsuki.\" Rika greeted her boss as she entered the bakery. \"How's business?\"<br>\r\n<br>\r\nThe baker smiled at her favorite taste-tester,\"Good Rika, it's been a nice day. Your suggestions have really been working out.\" She replied. \"I've cooked up a few things for you to try, go to the kitchen table and you can get started.\"<br>\r\n<br>\r\nThe redhead licked her lips in anticipation, \"Thanks Mrs. Matsuki, I will.\" Rika walked to the kitchenn, ready for another day of \"hard work\".<br>\r\n<br>\r\nMrs. Matsuki watched as Rika left, observing the results of her plan, and she gave herself a metaphorical pat on her back. Rika had certainly embraced her job as a taste-tester, and her sweet tooth and growing appetite were making things go smoothly, this combined with Mrs. Matsuki's \"special ingredient\", which made sure Rika was too tired to burn the calories, had certainly started to make effect on the redheaded tomboy's body. It had only been a week since Mrs. Matsuki had initiated her plan to fatten up the girl, but it already showed. Rika's previously flat-as-a-board midsection had gained a noticiable layer of fat, nothing too extreme, but a great beginning; her jeans were pressed tightly against her bigger rear and thicher legs, and dug into her belly a bit. Rika's jawline had lost some definition, and she looked altogether rounder and softer. <br>\r\n<br>\r\nYeas, Rika was packing on the pounds, but how many pounds exactly?</span></div></div>",
            "created":1352264400,
            "id":1463169,
            "title":"Skip to after a week. Mrs.Matsuki is pleased wi..."
        },
        "1112311112121221":{
            "author_id":"biganime18",
            "author_name":"monster child",
            "choices":[
                "she finishes the cream",
                "she doesnt and passes out"
            ],
            "content":"<div class=\"\"><div> <span>Rika leaned back in her chair rubbing her distended belly. She reached down and undid her belt and jeans giving her belly several more inches of room. She went back to rubbing her belly and groaning from fullness. A few minutes later Mrs Matsuki walked in. \"thank goodness your still here I need a favor.\" she said moving across the kitchen. \"What do you need?\" Rika asked. \"Well you see we have a cream delivery each month and we haven't managed to use all of last months order so quit simply i need you to eat it.\" When she finished Rika's jaw hit the floor she didnt know what to do on the one hand the cream tasted really nice and she'd like to eat lots of it but on the other hand she was just so full but the longer she thought about the cream the more she wanted more of it. \" sure i can finish it.\" Rika said. Smiling Mrs Matsuki wheeled over a tank the same height as her. \"Well if you just spray the nozzle in your mouth I'll wash it later tonight.\" she said handing Rika the plastic nozzle. Rika nodded and started to eat the cream while rubbing her belly to maked room.</span></div></div>",
            "created":1352437200,
            "id":1464661,
            "title":"cream filling"
        },
        "11123111121212211":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Mrs.Matsuki asks Takato to escort Rika to her home",
                "Rika attempts to return to home on her own."
            ],
            "content":"<div class=\"\"><div> <span>'No, wait, <i>wait</i>.' Rika thought while moving the nozzle to her mouth. 'That tank is bigger than I thought; no way I can do it!! Why am I trying such stupid thing!? I still have time to refuse it politely!! Don't be silly!!' <br>\r\n<br>\r\nThen the first gob of high-fat whipped cream landed on her tongue. Like a flash, Rika's mind was dropped into the trance. She held the nozzle in the mouth and devoured the sugary cream blissfully. Even though she was completely full by taste-testing, the cream steadily flowed into the gaps between the pastries in her stomach. <br>\r\n<br>\r\nWhile massaging her strained belly Rika single-mindedly continued to gulp down...<br>\r\n<br>\r\n<br>\r\n-------------------------------------<br>\r\n<br>\r\n<br>\r\n<i>Gulp, Gulp, Gulp, Gulp, Gulp, Gulp, Gulp...</i><br>\r\n<br>\r\n<br>\r\n-------------------------------------<br>\r\n<br>\r\n<br>\r\n\"Aw...I can't *Hic*...believe... *Hic*...I ate *<b><i>Buuurrrp</i></b>* all... ahh...\"<br>\r\n<br>\r\nStaring vacantly into space, the redhead girl lay on her back on the kitchen floor. <br>\r\n<br>\r\nIt seems that the contents of the cream tank wasn't quite full, and yet her stomach that had now reached its full capacity, was about to explode. It had rumbling constantly and completely exposed.<br>\r\n<br>\r\nMrs.Matsuki, wearing an anxious expression on her face, had stood beside the redhead girl. She looked like be regret what she asked. \"Sorry Rika... I can't apologize enough for this unreasonable request.\" She said and started to massage Rika's middle-sized-yoga-ball-like swollen belly. Rika attempted to say something, but instead she let out a few huge burps and moaned weakly.<br>\r\n<br>\r\n\"Oohhh...*<i><b><font class=\"size4\" style=\"\">BURP!!</font></b></i>* E-excu *<i><b>Uuurrrp</b></i>* 'scuse me...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1353992400,
            "id":1476545,
            "title":"she finishes the cream"
        },
        "111231111212122111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika wakes up hungry",
                "Takato confronts his mother"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Matsuki sighed. \"Well I can't send you home on your own in this condition. \"Takato!\", she called.<br>\r\n<br>\r\nMoments later Takato appeared and froze on the spot when he saw Rika sprawled on the foor.<br>\r\n<br>\r\n\"Mom you didn't actually get her too-\"<br>\r\n<br>\r\n\"Never mind\", his mother berrated! \"Escort her home, she can't make it on her own.\"<br>\r\n<br>\r\n\"Wouldn't it be better to leave her here to rest?\"<br>\r\n<br>\r\n\"With our rush time approaching? She'd never be able to relax, now do it.\"<br>\r\n<br>\r\nTakato sighed. \"Okay I\"ll get the wheel barrow.\"<br>\r\n<br>\r\nHis mother scowled but knew it was probably the only practical way for him to bring Rika home in her present condition.<br>\r\n<br>\r\nShe gently took Rika's hand. \"I promise I'll make this up to you Rika. You just go home and rest for now.\"<br>\r\n<br>\r\nRika managed a pained smile. \"ThaAAAAAAAAPPPPPP-\" Rika's burp cut her off and she slowly managed to get up with Mrs. Matsuki's help. The jostling of moving elicited more burps and they continued until they reached the side door where Takato waited with the wheel barrow.<br>\r\n<br>\r\nSlowly and carefully she sat down and layed back in the wheel barrow, and her belly made an audible sloshing sound in response.<br>\r\n<br>\r\n\"Be gentle Takato\", his mother warned.<br>\r\n<br>\r\n\"I will.\"<br>\r\n<br>\r\nWith a gentle but firm push Takato wheeled Rika away.<br>\r\n<br>\r\nTaking the back lanes Takato was able to save Rika the embarassment of being seen with her bloated gut exposed and her constant burping. He wheeled her up to her door and working with her, he tilted the barrow forward, getting her onto her feet.<br>\r\n<br>\r\n\"Thanks goggles\".<br>\r\n<br>\r\n\"After what mom made you do, it's the least I can do.\"<br>\r\n<br>\r\n\"She says she'll repay me. Anyway I'll see you *URP* later.\"<br>\r\n<br>\r\n\"Uh bye\"<br>\r\n<br>\r\nRika entered her house and closed the door behind her. Groggily she walked to her room, her belly sloshing back and forth, and she could feel the pressure building inside it from the gasses.<br>\r\n<br>\r\nShe got to her room and lay down on her Futon. Then suddenly an ominous rumble came from her belly and Rika felt the pressure rapidly rising until it went critical and she let out one more almighty belch.<br>\r\n<br>\r\n<font class=\"size5\" style=\"\">BBBBBBUUUUUUUUUUUUUUURRRRRRRRRRRRRRRRRRRRPPPPPPPPPPPPPP</font><br>\r\n<br>\r\nWith the pressure finally released she felt much better, and settle down for a good nap. With the covers over herself her belly looked like a hill. Sighing she massaged her tortured tummy until she slowly drifted off to sleep.<br>\r\n<br>\r\n</span></div></div>",
            "created":1366174800,
            "id":1573400,
            "title":"Takato to escorts Rika home"
        },
        "1112311112121221111":{
            "author_id":"biganime18",
            "author_name":"monster child",
            "choices":[
                "Mrs Matsuki stuffs Rika silly.",
                "Mrs Matsuki decides to give Rika a rest."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rika waddled in to the bakery where mrs matsuki was making some pastry's.<br>\r\n<br>\r\n\"Morning Mrs matsuki.\" Rika says<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1366606800,
            "id":1576839,
            "title":"next day at the bakery"
        },
        "11123111121212211111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika finds a big breakfast waiting for her.",
                "No one in the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>Rika groaned and sat up in her futon, wiping the sleep from her eyes and yawning. *Burp* \"Uhhhhgghhh, did yesterday really happen?\" <br>\r\n<br>\r\nShe felt an unfamiliar sensation on her thighs and looked down to see the pale white dome of her belly resting on them. It had been reduced to a quarter the size it had been when she got home, but it was still huge. It no longer sloshed about, but instead was soft and malleable like a marshmallow. Soft to the touch, and it rippled when she tapped its surface, but oddly didn't jiggle.<br>\r\n<br>\r\nLooking at the time she realized she would probably get called for breakfast soon. She stood up shakily, unused to the extra weight of her paunch. She was surprised to discover that her belly didn't hang, and instead stayed in place firmly as if she were pregnant. How did that work. Ignoring it for now she reached down to her jeans and tried to button them up, unfortunately her belly was taking up more real estate than it used to. Grunting and sucking in her gut as much as she could, she finally managed to fasten the button and zip it up, making her belly seem even bigger.<br>\r\n<br>\r\nShe relaxed and placed an idle hand on her belly. \"Guess I'm one of those girls who gets a pot belly. Well, at least I don't have to worry about cellulite then.\"<br>\r\n<br>\r\nWith surprising ease she walked to the bathroom. Her belly shifted a bit, but it didn't jiggle. Rika found this odd, but she guessed that it had something to do with how firm her belly was and what kept it from sagging and keeping a round shape.<br>\r\n<br>\r\nShe got to the bathroom and reached for her toothbrush then paused mid-reach as she felt the cool counter top on the underside of her belly. Taking her tooth brush and standing strait she found her belly resting on the counter top, it's own weight deforming it's shape slightly. She saw her reflection in the mirror for the first time since yesterday morning and saw basically the same girl, the only difference was a large white dome sticking out of her midsection and a deep belly button. It actually looked kind of cute.<br>\r\n<br>\r\nSighing she pushed those thoughts aside and brushed her teeth then flossed them. With all the eating she did there had to be a lot of bacteria in there.<br>\r\n<br>\r\nFinished with her oral hygiene she grunted as her jeans continued to press into her belly uncomfortably. Then a low rumbling and gurgling reverberated through the bathroom and Rika looked down at the large dome of her belly.<br>\r\n<br>\r\n\"Well I guess it's time for breakfast.\"<br>\r\n<br>\r\nShe left the bathroom and headed for the kitchen.</span></div></div>",
            "created":1390971600,
            "id":1734703,
            "title":"Rika wakes up Hungry"
        },
        "111231111212122111111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Her grandmother is working with Mrs. Matsuki to fatten her up",
                "She just wants to spoil her granddaughter."
            ],
            "content":"<div class=\"\"><div> <span>When Rika got to the kitchen she was suddenly overwhelmed by an aroma of that recalled memories of breakfast buffets she had been to with her family, and when she looked on the table it looked like it as well.<br>\r\n<br>\r\n\"Oh, good morning Rika. Hungry for breakfast I hope.\"<br>\r\n<br>\r\nSeeing her grandmother Rika suddenly felt very self-conscious about her belly sticking out of her shirt which was forced halfway to her chest. What would she say about it. Would she be shocked, ashamed, revolted?<br>\r\n<br>\r\n\"Mo-morning Grandma\" Rika greeted shyly.<br>\r\n<br>\r\nHer grandmother laughed. \"Well don't just stand there Rika. Your breakfast will get cold if you don't hurry.\"<br>\r\n<br>\r\nRika sat down at the table and examined the spread before her. There was several plates of eggs: scrambled, omelets, sunny-side up, deviled. Sausages and Bacon sat in pools of their own fat in large plates, 2 stacks of pancakes, each a foot high, and just as many waffles. Spread sporadically among the abundant food items were small bowls of porridge, rice, and fruit. There was an entire loaf of bread ready to be turned into toast, and an entire brick of butter ready to be spread onto it.<br>\r\n<br>\r\n\"Is, is all this for me?\" Rika asked flabbergasted. There was as much food on the tale as there usually was at the bakery.<br>\r\n<br>\r\n\"Of course dear. You've been looking so malnourished lately that I thought you deserved a decent meal.\"<br>\r\n<br>\r\nRika had a hard time believing that the banquet in front of her could be anything less. What's more her Grandmother would be very disappointed if she didn't eat all of it, but could she?<br>\r\n<br>\r\nRika's belly growled loudly as if showing its own support for the endeavor. Hoping that the bigger gut would give her greater capacity than ever before, she picked up her fork and dug in.<br>\r\n<br>\r\nShe started on the eggs, casually scooping them into her mouth, but before she had finished them her belly growled loudly, as if telling her to eat with more gusto, and it gnawed at her insides demanding she eat faster. Rika obeyed it, somewhat reluctantly, still feeling self-conscious with her Grandmother watching.<br>\r\n<br>\r\nShe shoveled down the scrambled eggs, and began sucking up strips of bacon, trying to satisfied her belly's impatience for sustenance. Unfortunately she was not, and her belly made she she was aware by growling like an angry lion and rumbling like a logging truck. Rika's became suddenly ravenous and began sucking up the omelettes, barely chewing them before sending them to the pit of her belly. She actually managed to swallow the sausages whole, her face stained by their grease fat, already quite messy from eating the bacon.<br>\r\n<br>\r\nAll this time, in the back of her head she was aware that her Grandmother was looking at her, watching her as she made a complete pig of herself, but yet another part of her mind didn't care, it only wanted feed, feed, FEED! <br>\r\n<br>\r\nRika poured a bowl of rice down her gullet and then started on the pancakes, wolfing them down with tremendous enthusiasm, and no manners whatsoever. The whole time her belly screamed at her \"EAT EAT EAT!!!!!!\" What was wrong with her?<br>\r\n<br>\r\nHer face was drenched is syrup and it dripped down, staining her shirt and started dripping off her belly. She could feel her pants getting tighter and tighter as her belly swelled, her food pushed it outwards, filling it. Making it bigger and bigger. Her pants dug sharply into her body as it expanded, making it laborious to continue.<br>\r\n<br>\r\nShe was now on her feet, her belly resting on top of the table as she reached to grab more food. She started alternating between plopping deviled eggs down her gullet and dumping bowels of rice or steaming porridge down her throat. Her belly started screaming at her again, but it was a more pleasant encouraging message: 'Yes, Yes, YES. MORE MORE MORE!!!<br>\r\n<br>\r\nRika by now had abandoned her utensils and just started using her hands to shove every thing within reach into her hungry maw. The sunny-side up eggs went next quickly followed by the bowels of fruit. She was now on top of the table as she reached for every last bowel of fruit and bringing herself into arms reach of the waffles.<br>\r\n<br>\r\nHer belly felt so full and bloated but she couldn't stop, she needed to finish.<br>\r\n<br>\r\nShe grabbed the first stack of waffles and bit into it, eating her way through the stack all the way down to the plate where she lapped up all the syrup before doing the same on the other stack.<br>\r\n<br>\r\n*<b>BBuuuuuuuurrrrrpppppp</b>*<br>\r\n<br>\r\nThe belch felt good and helped make enough room in her belly for the toast. She reached for it and found that they had already been slathered thick in butter. She could have sworn they had been plain before. Well that made it easier. Using both hands she slid slice after slice into her mouth and gobbled down the stack in record time, even sliding what was left of the butter down her throat.<br>\r\n<br>\r\n*<b>POP</b>*<br>\r\n<br>\r\nThe button on her jeans popped off and ricocheted off the fridge before resting on the floor. Rika's belly surged forward and rested on her lap, and she sighed in relief, rubbing her belly which gurgled and churned as it worked the vast meal in her she had ingested.<br>\r\n<br>\r\n\"Here Rika\" her grandmother held out a pitcher of orange juice, and almost without thinking Rika grabbed the whole thing and guzzled down it's contents.<br>\r\n<br>\r\n*<b>Buuuuuuuurrrrrrrrrrrrrrrrrrrrrrrpppppppp</b><br>\r\n<br>\r\nShe wiped her mouth and then with a groan flopped down on her back, her belly filling out her sides, and spreading her legs apart, sticking up about a foot in the air.<br>\r\n<br>\r\nHer belly felt so full and so packed that it was almost as bad as yesterday when she left. She still had to go to work today too.<br>\r\n<br>\r\nAs she lay there on the table she realized that her grandmother must have buttered the toast while she gorged herself.<br>\r\n<br>\r\nShe looked at her grandmother who smiled as she gathered the devastated plates on the table around her.<br>\r\n<br>\r\n\"Grandma\" she asked. \"Why did you make so much food all of a sudden?\"</span></div></div>",
            "created":1391317200,
            "id":1737097,
            "title":"Soooo much breakfast!"
        },
        "1112311112121221111111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika tries to find something to wear",
                "Rika goes to \"work\""
            ],
            "content":"<div class=\"\"><div> <span>Well Mrs. Matsuki told me she was worried about you Rika. Said that you were always so exhausted after you were working. I thought that it was because you weren't getting enough to eat at home.\"<br>\r\n<br>\r\nIt wasn't a lie, but in truth Mrs. Matsuki had phoned her and told her her plan to fatten up Rika whom she felt was too skinny to be healthy. Seiko was inclined to agree with her, but until now fattening Rika up would have seen to obvious. Now that Rika was working at the bakery, any weight she was going to gain eater her meals would seem less obvious. It also meant that Rika could be watched at home to make sure she was not being too active and making sure she got nice and plump.<br>\r\n<br>\r\nHana put a hand on the top of Rika's belly, feeling it's soft surface and firm contents which were densely packed within. Rika seemed to be putting all the weight she was gaining in her belly, with just enough elsewhere to keep from making her look odd, but it seemed like the fatter she got, the less fat went elsewhere. Perhaps that would actually make things easier in the future, they could just convince Rika that she was bloated instead of fat. For a while anyway.<br>\r\n<br>\r\nRika sighed. \"Well I guess I have been a bit tired lately, but isn't this a bit excessive?\"<br>\r\n<br>\r\nSeiko smiled and gave her granddaughter's belly a hug. \"Well that depends. How does it feel? Does it feel good?\"<br>\r\n<br>\r\nRika blushed and looked at the large dome of flesh obscuring her view. \"Y-yeah\" she admitted. \"It does feel good.\"<br>\r\n<br>\r\n\"Good\", Seiko replied. \"Though for breakfast there will usually be less variety than today. Maybe pancakes tomorrow?\"<br>\r\n<br>\r\nRika grunted as she sat up, not an easy task with her huge gut. \"I just hope I'll be able to do my job at the bakery after eating like this everyday.\"<br>\r\n<br>\r\nSeiko laughed. \"Don't worry sweaty, I'm sure you'll be fine.\" Although Seiko didn't do so herself, she was aware about Mrs. Matsuki's use of appetite enhancers, so she knew that Rika would have no trouble eating more.<br>\r\n<br>\r\nWith some assistance Rika managed to get off the table and onto her feet, having to plant them wide to compensate for her big gut.<br>\r\n<br>\r\n\"Ugh, I'm going to see if I can find something to wear that fits. I'll see you later Grandma, thanks for breakfast.\"<br>\r\n<br>\r\n\"You're very welcome Rika. I'll make sure you enjoy dinner just as much.\"<br>\r\n<br>\r\nRika grimaced a bit and then half walked half waddled to her room, something that Seiko found quite adorable, and started to plan dinner.</span></div></div>",
            "created":1391403600,
            "id":1737816,
            "title":"In cahoots with Mrs. Matsuki"
        },
        "111231111212122111112":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Takato turns the tables and force feeds Rika",
                "Takato escapes"
            ],
            "content":"<div class=\"\"><div> <span>There was no one in the kitchen, and no breakfast already made, so that meant that it was up to her to feed herself.<br>\r\n<br>\r\nSighing she slipped on an apron, which actually managed to cover her belly and started cooking.<br>\r\n<br>\r\n--------------------------<br>\r\n<br>\r\nTakato sighed as he marched up the steps to Rika's house. His mother had sent him over to escort her to work. After what happened yesterday she was feeling quite guilty about what she put Rika through.<br>\r\n<br>\r\n\"Then she should be the one here\" Takato muttered as he rang the door bell.<br>\r\n<br>\r\n\"It's open\", he heard Rika's voice from within.<br>\r\n<br>\r\nTakato got inside and his nostrils were suddenly flooded with smells from within. Someone was cooking.<br>\r\n<br>\r\nHe found Rika in the kitchen wearing an apron which was draped over her belly.<br>\r\n<br>\r\n\"Wow Rika, I didn't know you could cook!\"<br>\r\n<br>\r\nRika turned to face him, crumbs around her mouth. Apparently she'd been doing some rigorous sampling tests.<br>\r\n<br>\r\n\"What are you doing here goggles?\"<br>\r\n<br>\r\n\"Ummm, I just came to escort you to work. Mom said you needed it after what happened yesterday.\"<br>\r\n<br>\r\nTakato looked over and saw that the table in the kitchen was full of food. A very mixed assortment, so he suspected that Rika was just cooking whatever she knew how.<br>\r\n<br>\r\n\"So why did your Mom think I needed to be escorted?\" Rika asked.<br>\r\n<br>\r\n\"Well I guess it's cause you got so big after yesterday, maybe she thought you needed the wheelbarrow again.\"<br>\r\n<br>\r\nOne could have heard a pin drop in the room at that moment. Rika turned her head away from him.<br>\r\n<br>\r\n\"Where are my manners\" she said. \"Sit down Takato, it's rude for me to make you stand.\"<br>\r\n<br>\r\nTakato shrugged but went to sit down at the table, the only place that had chairs in the room.<br>\r\n<br>\r\nRika then walked over with her newest culinary creation. \"Have something to eat. I bet you're hungry.\"<br>\r\n<br>\r\nTakato waved his hand. \"No thanks, I already ate.\"<br>\r\n<br>\r\nSuddenly Rika shoved her hand into his mouth full of her cooked food. \"Oh but I insist, in fact, have some more.\" She shoved yet more food into his mouth. He tried to get off the chair to resist, but she sat on his lap, pressing her belly against his abdomen pinning him in place. From her position on his lap she was able to reach onto the table and grab more food to shove into his mouth which just refused to resist opening.<br>\r\n<br>\r\nAfter ten minutes of continued force feeding Takato's stomach was aching quite badly, and he could feel it pressing harder and harder against Rika's.<br>\r\n<br>\r\n\"Ha ha, looks like you're getting to be the one who's big 'goggle guts'!\" Rika cackled.<br>\r\n<br>\r\nSuddenly Takato felt a terrible rumbling in him midsection and a loud, angry growl, but it wasn't his body making those noises.<br>\r\n<br>\r\nRika had a pained expression on her face and she grasped her belly with her hands, groaning. The action set her off balance on his legs. could this be his chance?</span></div></div>",
            "created":1391490000,
            "id":1739123,
            "title":"No one in the kitchen"
        },
        "1112311112121222":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "After returning home, Rika tries to take exercise and ends up the pitiful result",
                "Next day, the bakery takes an extra holiday. But Rika's stomach isn't convinced"
            ],
            "content":"<div class=\"\"><div> <span>(Note : I supposed Rika's initial setting weight weighs 95 pounds.)<br>\r\n<br>\r\n--------------------------------------------------<br>\r\n<br>\r\nRika had noticed that there was something wrong with her. She had just thought about it on the way to the bakery.<br>\r\n<br>\r\n<i>120lbs. One-Hundred-Twenty. What happened to me?</i> <br>\r\n<br>\r\nRubbing her potbelly, Rika frowned. In this morning, She paused in wide-eyed when she saw stand on the scales. She couldn't believe she was packed on 25lbs <i> on just a week!!</i> <br>\r\n<br>\r\nShe rubbed her butt, and confirmed again that her pants were tightly stretched. It's futile trying to convince herself that her pants shrank in the wash. She was well aware of her laziness on this past week. Her girls' school recently broke up for the summer holidays, so she had plenty of freetime. On the other hand, her mother has been very busy recently as a model. She didn't have enough time to talk with Rika about her body shape.<br>\r\n<br>\r\nThis week, Rika's lifestyle looked like this;<br>\r\n<br>\r\n---------------<br>\r\n<br>\r\n1. Wakes up around 10 am (if things go well). However she can't get out of bed a while due to strange tired feeling that left over from the day before.<br>\r\n<br>\r\n2. Feels hungry and heads to the bakery around 1:30 pm. She has to work as a taste-tester, so she doesn’t have lunch.<br>\r\n<br>\r\n3. Sits in front of the kitchen table around 2:00 pm. She tries to restrain herself to not eat too much.<br>\r\n<br>\r\n4. Returns to her house with overstuffed belly while growling, rumbling, churning and sloshing. Sometimes she falls into the food coma at work, so the time she comes home became irregular. Around 3:30 pm in earlier case, and around 7:30 pm in later case.<br>\r\n<br>\r\n5. Stays her room. She knows she should take some exercise to burn the calories, but her drowsiness and bloated belly prevent it. <br>\r\n<br>\r\n---------------<br>\r\n<br>\r\n\"Mm...these jelly donut were so good! and all done!!\"<br>\r\n<br>\r\n\"Ahh, sorry Rika...I'll just bring additional pastries...do you want stop by now?\"<br>\r\n<br>\r\n\"<font class=\"size2\" style=\"\"><font class=\"size25\" style=\"\">What the</font></font>....We-well, I can eat some more! <i><b>BUURRP!</b></i> ...Excuse me.\"<br>\r\n<br>\r\n\"Rika, are you all right?\"<br>\r\n<br>\r\n\"Never mind! Please bring it here!\"<br>\r\n<br>\r\nOf course Rika had understood that such lifestyle change her into a mass of fat. However, she can't set aside Mrs Matsuki's kindness, and can't resist the temptation of the sweet pastry. When she sniffs these flavor, her mind always become foggy except \"I want more!!\". She barely has kept her reason to comment as a tester; this is the best she can do.<br>\r\n<br>\r\nShe didn't meet her friends include Takato since her summer vacation started. Considering if someone of them found her when she bloated, Rika felt hot with shame. 'Something must be done about it...' she thought but soon forgot with tasty cream puff.<br>\r\n<br>\r\n</span></div></div>",
            "created":1352523600,
            "id":1464777,
            "title":"25 pounds"
        },
        "11123111121212221":{
            "choices":[
                "Starting a work out schedule, exercise will do.",
                "Starting a diet, although she isn't sure about what to do with Mrs. Matsuki"
            ],
            "content":"<div class=\"\"><div> <span>\"Ughhhh\" Rika placed here hand in her taut belly, experiencing a feeling of total fullness that she was becoming all-too-familiar with. 'Darn, I overdid it again.' She thought as she saw her bloated midsection.<br>\r\n<br>\r\nMrs. Matsuki came back to the kitchen holding a small basket. \"You're done Rika? Good job! Thank you for your help.\" She said smiling.<br>\r\n<br>\r\n\"Eh, no problem Mrs. Matsuki, you are a great baker.\" Rika replied. She got up from the table slowly; a week ago she probably would have been unable to move after eating so much, but after all this time of pigging out, her stomach had stretched to the point that being bloated only partially limited Rika's movement. \"I think I'll be going home now.\"<br>\r\n<br>\r\nMrs. Matsuki nodded, \"Ok dear, but I have something for you first.\" She handed Rika the basket. \"These are some extra pastries we had from today, I really don't want to throw them away, so could you please take them?\" Rika nodded reluctantly and took the basket. \"I also put in the basket your pay for the week; you've been really helpful.\"<br>\r\n<br>\r\n\"Thank you very much Mrs. Matsuki.\" Rika waved good-bye as she reached for the door. \"Have a nice evening.\"<br>\r\n<br>\r\n\"You too dear.\" Mrs. Matsuki replied, 'She really is coming along nicely, it's just lovely. I hope Takato is affected by her eating habits soon. She's such a nice girl too, if a little rough around the edges, she would be perfect for him.<br>\r\n<br>\r\n----------------------------------------------------------------------<br>\r\n<br>\r\nRika arrived home a while later, and just as she had expected, nobody was home, her mother being too busy, and her grandmother out running errands, so she just went to her room and laid down for a while, as she usually did. She could see her sloshing belly going up and down with her own breathing.<br>\r\n<br>\r\n\"Ughhh, I really need to do something about this, or I'm gonna end up getting fat.\" Rika said to herself. \"25 pounds in one week is absolutely insane, I have to do start losing weight now.\" Rika gathered all of her willpower, set on...</span></div></div>",
            "created":1354942800,
            "id":1484214,
            "title":"After returning home, Rika tries to take exerci..."
        },
        "111231111212122211":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Rika gets up early for jogging (and maybe finds some problem).",
                "Rika has overslept, as usual."
            ],
            "content":"<div class=\"\"><div> <span>\"I must be starting the diet. Any minute now!\" Rika declared and attempted to stand up. But then she staggered under the weight of her swollen belly and sat down again.<br>\r\n<br>\r\n\"Gee...under such circumstances, I can't any decent exercise.\" As if in response to the tomboy's sigh, her belly gurgled for digestion. \"But at the very least, I should work out future schedule.\" Resting her soft chin in her hand, Rika started thinking…<br>\r\n <br>\r\n'First of all, the jogging is considerable important. Perhaps I need to get up *<b>munch</b>* early for it. And *<b>munch</b>* push-ups… I doubt I can do it  with this belly, but I'll just try it. *<b>munch</b>* The squat will be good, too...*<b>munch</b>* I wish I had more time to exerc...wait! I assume that I go to the bakery in the afternoon, but why? *<b>munch munch</b>* She did say I can visit her whenever, but It doesn't mean I <i> have to </i> do. Even if *<b>munch</b>* I take time off from taste-testing work, Mrs.Matsuki wouldn't be so discouraged...maybe? *<b>munch munch</b>* and *<b>munch munch</b>* if I ask, Renamon may support my *<b>munch</b>* slimming diet, *<b>munch munch</b>* but I'll reconsider about that a little later.'<br>\r\n<br>\r\n\"Oookay, I'll start it from tomorrow!!\" Rika yawned, and then realized what she did; there was an empty basket in front of her! <br>\r\n<br>\r\n\"It can't be...\" the redheaded girl patted her belly that was taut to the limit again, and saw her right hand -- she had the last pastry -- her favorite éclair...<br>\r\n<br>\r\n\"Diet starts tomorrow.\" She murmured an excuse and bit it. \"Delicious.\"   <br>\r\n------------------<br>\r\n<br>\r\nThe next morning...<br>\r\n<br>\r\n</span></div></div>",
            "created":1355029200,
            "id":1484498,
            "title":"Starting a work out schedule, exercise will do."
        },
        "11123111121212222":{
            "choices":[
                "\"Get down here and take me somewhere to eat, it's your fault anyway\"",
                "\"Never mind, i'll find something, cya\""
            ],
            "content":"<div class=\"\"><div> <span>*Growwwwl* Rika patted her rumbling belly as she walked toward the bakery. \"Don't worry, I'll feed you soon. I hope Mrs. Matsuki made donuts today, I feel like having some donuts. With chocolate filling. And Chocolate frosting. And sprinkles, chocolate sprinkles. Maybe some chocolate eclairs too. I could do with a couple of cream puffs too, those are good, but they might be even better with chocolate... I'd really like some chocolate cake now that I think about it...\"<br>\r\n<br>\r\nOh yeah, Rika sure liked chocolate. Mrs. Matsuki's plan seemed to have come to full fruition, and although Rika had realized she was gaining weight, her worries always melted away with some chocolate. <br>\r\n<br>\r\nThe chunky redhead arrived at the bakery, her mouth watering and her stomach ready to be filled with sugary goodness, but then...<br>\r\n<br>\r\n<div align=\"center\"><b>CLOSED FOR VACATION</b></div><br>\r\n<br>\r\nRika stared at the sign for several seconds, before exclaiming \"What! Closed?\"<br>\r\n<br>\r\nSome people on the street turned at her outburst, and she blushed a little. 'Ooops, my bad. But how can it be closed? It's a Friday!' Rika rubbed her belly, 'Then again, this might be a good chance to try to lose some weight...'<br>\r\n<br>\r\n*Growwwwl!* He tummy rumbled. 'Darn it, but I'm so hungry! I can't go on without eating anything. Why is it even closed?' Rika though about it for a second, and then and idea came to her. 'I know, I'll call Takato, he must know why it's closed.'<br>\r\n<br>\r\nRika pulled out her cellphone and called her friends.<br>\r\n<br>\r\n\"Hello?\" Came Takato's voice over the phone.<br>\r\n<br>\r\n\"Takato? This is Rika, would you mind telling me why your bakery is closed today?\"<br>\r\n<br>\r\n\"Oh, that. It's Mom and Dad's anniversary, so they closed the shop and went out on some romantic escapade. Why do you ask?\"<br>\r\n<br>\r\n\"Because I'm here in front of the bakery staring at a 'closed' sign, and nobody told me about it.\"<br>\r\n<br>\r\n\"Oh, right, you have that taste tester job. Sorry, Mom must have forgotten to tell you.\"<br>\r\n<br>\r\n\"Well 'sorry' isn't good enough, I'm starving here!\" Rika was getting a bit worked up.<br>\r\n<br>\r\n\"I'm sorry Rika, but what do you want me to do about it?\"<br>\r\n<br>\r\n\"Well...</span></div></div>",
            "created":1356325200,
            "id":1494102,
            "title":"CLOSED"
        },
        "111231111212122221":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "They go to the neighboring buffet.",
                "Takato invites Rika in bakery and makes some pastries."
            ],
            "content":"<div class=\"\"><div> <span>“Get down here and take me somewhere to eat,” Rika said with some impatience by sense of hunger. “it's your fault anyway.”<br>\r\n<br>\r\nAfter a little while, he replied. \"Okay, hold on a moment! I'll be there soon.\"<br>\r\n<br>\r\n------------<br>\r\n<br>\r\nSeveral minutes later, Takato appeared from the back entrance of the bakery.<br>\r\n<br>\r\n“Sorry I kept you wai-” <br>\r\n<br>\r\nTakato stopped talking suddenly. He had looked hard at Rika with astonishment. He was told that she started taste-testing only a week ago; but what happened to her? She visibly had much...<i>grown</i> since he last saw her.<br>\r\n<br>\r\nHe moved his glance from her top to the bottom. A little puffy face, flabby arms, small breast without great change, potbelly which peeped out from her trademark T-shirt, wide buttocks which stretch out jeans from the inside…<br>\r\n<br>\r\n“<i>What are you staring?</i>” Rika asked calmly but threateningly.<br>\r\n<br>\r\n“Nothing!” Takato made an excuse hurriedly. “I was just thinking about…uhh…about where we would go to from now on.”<br>\r\n<br>\r\n“Hm…” Rika had still looked at him doubtfully, but blushed vividly when her belly groaned again. Takato averted his eyes awkwardly.<br>\r\n<br>\r\nRika pulled herself together and said. “Well, now what shall we do?”<br>\r\n</span></div></div>",
            "created":1356843600,
            "id":1498030,
            "title":"\"Get down here and take me somewhere to eat..."
        },
        "1112311112121222211":{
            "choices":[
                "Rika pigs out, as usual",
                "Rika rubs off Takato, and they both eat a lot."
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\" Takato thought over it a little bit. He could invite Rika to the bakery and make her something, but he didn't have his parents permission for that, and he didn't want to use the bakery's ingredients without asking them, especially since it wouldn't bring profit. He would have to invite Rika out of his own pocket. 'Then again,' he thought,'Rika seems very hungry, and she's always had a big appetite... Even bigger now from her looks,' he glanced at the chunky girl,'I'll take her to the buffet, that way she can eat all she wants, and I won't have to spend too much money.'<br>\r\n<br>\r\n\"We could go to the buffet a couple blocks away from here, it's pretty good.\" Takato finally replied.<br>\r\n<br>\r\n\"Took you a while. Ok then, lead the way Goggles.\" Rika ordered.<br>\r\n<br>\r\n--------------------------------<br>\r\n<br>\r\n\"Ok, here we are.\" Takato announced.<br>\r\n<br>\r\nThe buffet was an average -looking place, not too big, not too small, it really wasn't very noticeable. Once they got in, they saw most of the tables were empty, although the smell was pretty good.<br>\r\n<br>\r\n\"Are you sure the food is good? I don't see many people around here.\" Rika pointed out.<br>\r\n<br>\r\n\"Yeah, but it's kind of early for lunch, isn't it? It's normal that there aren't many people. Also, it's relatively new, so it isn't very famous.\" He replied.<br>\r\n<br>\r\nRika seemed satisfied by his answer, and soon they were led to a small table with two chairs by a smiling waitress. After they got their drinks, the tamers got up to fill their plate with food. Takato got a moderate amount of food, although he planned on having seconds (it was a buffet after all), while Rika filled her plate to the brim and wasted no time as she devoured it.<br>\r\n<br>\r\n\"Wow, you know you can repeat, right? You don't have to put so much food on your plate.\" Takato pointed out.<br>\r\n<br>\r\n\"Shut Goggledhead,\" Rika replied between bites,\"I'll put whatever I want in my plate.\"<br>\r\n<br>\r\nOk, now what?</span></div></div>",
            "created":1357102800,
            "id":1500498,
            "title":"They go to the neighboring buffet."
        },
        "11123111121212222111":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "“You’re right, Goggles. I overate... may I take a rest in your house?”",
                "“But maybe few more chocolate éclairs won’t hurt…*BURP!!*…E-excuse me.”"
            ],
            "content":"<div class=\"\"><div> <span><i>*Nom Nom Nom*…*Gulp*…*Chew*…*Munch munch*…</i><br>\r\n<br>\r\nTakato was struck dumb at the sight. What’s wrong with Rika?<br>\r\n<br>\r\nFor three quarters of an hour, the chubby redheaded girl had kept eating and drinking like there was no manana. Sandwiches, burgers, burritos, sodas, éclairs, donuts, chocolate cakes, and more!! She looked like that she was trying to eat all-she-can-eat literally. Takato had begun to worry about her health seriously.<br>\r\n<br>\r\n“Thank you Gogglehead.” Rika said with smile, and took a big bite of a fried chicken. “The food of this buffet is very delicious. If you didn't take me to here, I would never come here.”<br>\r\n<br>\r\n“Uh…not at all.” Sweating a bit, Takato replied.<br>\r\n<br>\r\nIn fact, Rika herself was perplexed by her excessive appetite, too. She frequently went to the food table with an empty tray, and came back with trayful foods. She did not remember the exact number of times; 6 or 7…maybe.<br>\r\n<br>\r\nCome to think of it, what Rika ate lately was only Matsuki bakery's taste-testing pastry. Her taste bud was greatly enjoying a great variety of food. She knew she should maintain a dignity due to the digimon queen's status in front of Takato, but couldn't help but gobble down such good meals with enthusiasm. Rika's hungry stomach had been almost completely seizing control of her body.<br>\r\n<br>\r\nHer shirt rose up her soft skin due to her exposed bulging belly that made it hard for her to move. Fortunately or unfortunately, Rika was too tired and full to notice that her skintight pants’ button already popped off. Takato really didn't know where to rest his eyes.<br>\r\n<br>\r\n“Um, R-Rika? I think you should stop eating...”<br>\r\n<br>\r\n“Me too…” Rubbing her belly tenderly, Rika stood up as she groaned in a weary manner…<br>\r\n</span></div></div>",
            "created":1358917200,
            "id":1514816,
            "title":"Rika pigs out, as usual"
        },
        "111231111212122221111":{
            "choices":[
                "Rika is awoken by a delicious scent...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I think you might have a point...\" Said Rika as he got up, using the chair to balance herself. \"I might have overdone it a bit.\"<br>\r\n<br>\r\n'That's overdoing it \"a bit\"?' Takato thought as he observed Rika's bloated midsection,'How much does she usually eat?'<br>\r\n<br>\r\n\"Ugh, my home is still a walk away from here, could I rest a little at your house?\" Rika asked politely.<br>\r\n<br>\r\n\"Ehrm, sure, no problem.\" Takato replied, a bit surprised at Rika's politeness. 'When she is tired and stuffed she can be kind of nice.'<br>\r\n<br>\r\n\"Thanks.\"<br>\r\n<br>\r\n------------------------------------------------<br>\r\n<br>\r\nThe two tamers arrived at Takato's without any major issue, although Takato was quite flustered. Rika had been so stuffed that she had had a hard time walking the short distance between the buffet and Takato's home, and Takato had to help her get there. Rika's bloated belly was impossible for her shirt to cover, and her jeans's button had already pooped, so quite a bit of her tummy was visible while they walked home. Rika was so tired and full that she didn't seem to care, not even when she had to lean onto Takato most of the way, but Takato was quite embarrassed, as well as unused to Rika's apparent fragility.<br>\r\n<br>\r\nTakato had left Rika into his room to take a nap, and she had no problems with laying down on his bed to digest, her belly forming a noticeable bulge through the sheets. Takato had been honestly shocked by Rika's gluttony, and no he saw how it had been possible for her to gain so much weight in so little time, no wonder she had gotten chubby pigging out like she did. Takato had to admit though, that it was nice not to have her yelling at him for once, and he had eaten quite a bit too, he noted, rubbing his full, but not nearly as bloated as Rika's, belly.<br>\r\n<br>\r\nTakato wondered how long Rika would stay in his bed...</span></div></div>",
            "created":1360904400,
            "id":1532690,
            "title":"You’re right, Goggles"
        },
        "1112311112121222211112":{
            "choices":[
                "Rika has a strange dream",
                "Rika wakes up completely embarrassed at her gluttony"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A couple more options</span></div></span></div>",
            "created":1360904400,
            "id":1532691,
            "title":"Something else"
        },
        "11123111121212222111121":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "In the dream, Rika gets some trouble. ",
                "While Rika is sleeping, Takato begins to feed her."
            ],
            "content":"<div class=\"\"><div> <span>While napping, Rika had a strange dream.<br>\r\n<br>\r\nIn her dream, she was swimming in the pool…it was filled up with the melted chocolate. Some trays which put the whole chocolate cakes were floating on the water surface. Thinking about the situation just a moment will be enough to notice that it's wildly unrealistic, but Rika didn't care at all. She had been enclosed by her favorite chocolate!!<br>\r\n<br>\r\n“Mmmm,” Treading water, Rika grabbed and crammed the cake down. “Sooo gooood…”<br>\r\n<br>\r\n</span></div></div>",
            "created":1374987600,
            "id":1635935,
            "title":"Rika has a strange dream"
        },
        "111231111212122221111211":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika wakes up",
                "What else could happen?"
            ],
            "content":"<div class=\"\"><div> <span>As Rika devoured the cakes floating on the surface she started to sink lower and lower in the liquid chocolate that filled the pool. After devouring one more cake she suddenly found herself slipping beneath the waves as her belly dragged her down.<br>\r\n<br>\r\nShe struggled  to try and get back to the surface but her belly was just too heavy and it hit the bottom with a dull thud and it rolled until her rear plopped onto the bottom of the pool. As she struggled for air she could only think of one way to save herself. If she could not get the to the surface, she would bring the surface to her. She opened her mouth as wide as she could and opened her throat, letting the liquid chocolate drain down her gullet and into her belly which swelled at the faster rate yet. Occasionally a cake that had been floating on the surface would get dragged down and swallowed, providing a quick boost to the size of her girth.<br>\r\n<br>\r\nShe drank and drank and drank, woozy from the lack of oxygen until finally she felt the cool air of the surface on her face and she stopped gulping to take a huge breath of air. It was even more refreshing than the chocolate in her belly. Ironically it has been that thing that almost killed her.<br>\r\n<br>\r\nWith her life safe for the moment she looked at her belly which now towered over her, a huge pale ball full of liquid chocolate. speaking of which, there was still a lot of liquid chocolate left in the pool, and Rika had no intention of letting it evaporate in the sun. She leaned her head back so that it was beneath the surface and drank until the level came down again. Finally she decided to just lay on her back and let it all drain into her belly.<br>\r\n<br>\r\nShe could feel her belly swell and expand, pushing against the side of the pool at the other end like a water balloon that was being filled to its maximum.<br>\r\n<br>\r\nFinally Rika drained the pool of all the chocolate and she licked her lips in satisfaction. She lay on her back and surveyed herself.<br>\r\n<br>\r\nOther than a little bit of extra flesh on her body she looked like any normal girl; however her big globular belly occupied half the pool and pressed against its sides and it went up over the lip at least another eight feet. Rika felt a huge sense of accomplishment and as the sun warmed her body and belly she lay back and drifted into blissful unconsciousness. </span></div></div>",
            "created":1390971600,
            "id":1734714,
            "title":"Rika gets in some trouble. "
        },
        "111231111212122221112":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Takato investigates",
                "Rika arrives home felling fat"
            ],
            "content":"<div class=\"\"><div> <span>“But maybe few more chocolate éclairs won’t hurt…*BURP!!*…E-excuse me.”<br>\r\n<br>\r\nTakato's eyes widened in shock. Was she serious? Even after all that, after her clothes were starting to come apart, did she still wan't more?<br>\r\n<br>\r\nBefore he could utter a word, Rika stood up shakily and hauled herself up and headed back to fill up her tray yet again. When she came back there were the few éclairs that she said she was going to get, but the rest of it was full of pizza slices.<br>\r\n<br>\r\n\"I thought you were only getting a few more éclairs?\" Takato protested.<br>\r\n<br>\r\nRika shrugged. \"Well I was going to but then they brought out the Pizza's and I figured I might as well sample them.\"<br>\r\n<br>\r\nTakato felt that she had enough slices to take more than a sample, it was enough for a whole Pizza on her tray.<br>\r\n<br>\r\nRika started with the éclairs, shoving them all the way into her mouth lengthwise into her mouth before chewing briefly and then swallowing. Then she started on the pizza, chomping each slice down to the crust before shoving the entire crust into her mouth. It took Rika less than ten minutes to clear her tray.<br>\r\n<br>\r\nShe shoved swallowed the last of her food and then patted her swollen belly, with a blissful look on her face.<br>\r\n<br>\r\n\"Now that was a great meal. <span style=\"font-family:impact, fantasy\"><i><b>Buuuuuurrrrpppp</b></i></span>.<br>\r\n<br>\r\nTakato was relieved that she had finally stopped. Any longer and he would have been forced to pay for another hour.<br>\r\n<br>\r\n\"So then, I guess we should go\",<br>\r\n<br>\r\nRika nodded and managed to haul herself up again giving Takato a clear view of her current state.<br>\r\n<br>\r\nAs she wiped her mouth with a napkin Takato noticed that her face was stained from her enthusiastic indulgence, and her shirt had risen up until it just barely covered her bellybutton, the outline of which could be seen against the large, tight fitting shirt. Her pants were unbuttoned after it had broke off during her binge, but her belly hung low enough to obscure her panties from view and it was still tight enough that it didn't fall around her ankles.<br>\r\n<br>\r\nTakato followed the read head outside where she stretched and yawned.<br>\r\n<br>\r\n\"Thanks for the food goggles. I'll see you after your parents get back.\"<br>\r\n<br>\r\n\"uh, yeah\", Takato said nervously. \"Bye\".<br>\r\n<br>\r\nAs he watched her go he saw her plump rear shake slightly as she walked away, and he blushed as he realized where he was staring. He wondered, just what had happened to Rika?<br>\r\n</span></div></div>",
            "created":1370149200,
            "id":1601941,
            "title":"“But maybe few more chocolate éclairs won’t hur..."
        },
        "1112311112121222211122":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "She tries to diet",
                "Her Grandmother is in league with Mrs. Matsuki"
            ],
            "content":"<div class=\"\"><div> <span>Home at last, Rika shut the door and let out a loud belch. The jostling of her stomach contents from her walking had stirred up all the remaining gas.<br>\r\n<br>\r\nShe kicked off her shoes and walked groggily to her room. She shut her door and then nervously stared down at her belly.<br>\r\n<br>\r\nShe couldn't believe what she saw. Her belly was straining against her shirt, which was somehow creating enough resistance to prevent her belly from sticking out and causing her shirt to ride all the way up. Even so she could feel the air on the naked skin just below her belly button as it bulged out from under the shirt.<br>\r\n<br>\r\nWith trepidation she reached under her belly to undo the buttons of her jeans, only for her fingers to brush against the soft fabric of her panties. Rika's face flushed as she suddenly realized that she had gone out in public with her pants completely undone, and she hadn't even noticed.<br>\r\n<br>\r\nShe quickly dropped her jeans and bent over to look at them, causing her shirt to strangle her belly very uncomfortably.<br>\r\n<br>\r\nShe examined her pants and discovered to her horror that the button had snapped off. \"It must've happened at the buffet\" she realized. Had Takato noticed? She suddenly felt really embarrassed.<br>\r\n<br>\r\nNot able to deal with the discomfort any longer she finally grabbed the hem of her shirt and pulled it up, and her belly surged forward with its new found freedom. Rika sighed in blissful relief and her hands unconsciously went to her belly, rubbing it to soothe the aching from being confined.<br>\r\n<br>\r\nHer belly was very soft, with a hard firmness beneath the fat.<br>\r\n<br>\r\nRika looked in her full length mirror at herself and now fully realized what she had become. Her thicker, softer legs, wider hips, plumped up rear, plumped up arms, and most obviously, her prominent, round belly.<br>\r\n<br>\r\nIt stuck out nearly 10 inches from her frame, round and pregnant with food. She had to admit that the feeling of her hands stroking and rubbing its soft flesh felt good, but it also made her feel fat; very fat.<br>\r\n<br>\r\nShe looked down and was distressed that she couldn't see her feet, she tried to squeeze her belly to make room but suddenly collapsed to her knees and moaned. She suddenly realized that her belly was still quite packed, and its firm core had put a great deal of pressure on her 'pleasure organs' when she pushed it in. She decided it would be best to try and avoid that for now, and besides, it was so firm that she would never see her feet that way.<br>\r\n<br>\r\nShe looked at herself again. A fat girl in her underwear.<br>\r\n<br>\r\nShe sighed, I can't keep this up if I want to keep my job. Ms. Matsuki might think I'm moonlighting or something. Maybe I should go on a diet when I'm not working at the bakery.</span></div></div>",
            "created":1379221200,
            "id":1663583,
            "title":"Rika arrives home feeling fat"
        },
        "11123111121212222111221":{
            "author_id":"furulu",
            "author_name":"furulu",
            "choices":[
                "Rika is able to exercise, although it is tiring",
                "Something happens before she can go jogging, and stops her"
            ],
            "content":"<div class=\"\"><div> <span>Rika thought about her situation: Clearly her job at the bakery was the cause of her gain and increased appetite, but she really didn't want to quit. It was good money after all, and everything was just soooo good. Quitting was out of the table, but now that Rika thought about it, she hadn't been exercising since starting her new job, and she still ate the same when not at work, occasionally more. Really, it was no wonder she was getting fat. Not only was she eating many more calories, but she was consuming less too.<br>\r\n<br>\r\n\"That's it,\" Rika told herself,\"Starting tomorrow, I will exercise every day, and I will eat less at home, I don't really need dinner, having the bakery, and I can eat a bit less at lunch and breakfast.\" <br>\r\n<br>\r\nRika now knew what she had to do, but her plan would start tomorrow, right now, all she wanted to do was get some sleep. Coming home after such a hefty dinner had exhausted her completely.<br>\r\nThe red-haired tamer lied down on her futon, wearing only her underwear, and dozed off while rubbing her bloated belly.<br>\r\n<br>\r\n--------------------------------------------<br>\r\n<br>\r\nWhen she woke up the next morning, Rika still felt sluggish, but after seeing the plump girl in the mirror (whose belly was not bloated anymore, but was somewhat chubbier than yesterday), she felt determined to start her diet plan. First order of business was getting dressed, but this already presented a problem.<br>\r\n<br>\r\n\"C'mon, fiiiiit!\" Rika's struggles were in vain, as her jeans (a different pair from yesterday) had a hard time going up her soon to be thunder thighs, and were completely unable to go up her derriere. As she looked at herself in the mirror, a fat girl who couldn't put on her pants, she blushed, taking note of the fact that her lower body had gained even more than her belly, forming a jiggling bubble butt and wide hips. <br>\r\nResigned, Rika chose to switch the jeans for a pair of sweats (more appropriate, really), which were meant for a girls at least 20 pounds lighter, and hugged her thighs and bottom tightly, showcasing every jiggle and bounce.<br>\r\nIn a similar way, she also found trouble with her shirt, as none could completely cover her doughy midsection. Finally she settled for a slightly bigger pink version of her whole heart shirt, which her mother had bought in hopes she would wear some day. Despite being a bit bigger, the shirt still allowed a small sliver of bellyfat to be seen, but it was the best she could find.<br>\r\n<br>\r\nRika was all set, now she would get a light breakfast, and start her new routine...</span></div></div>",
            "created":1379221200,
            "id":1663679,
            "title":"She tries to diet"
        },
        "111231111212122221112212":{
            "author_id":"furulu",
            "author_name":"furulu",
            "choices":[
                "She doesn't have that much self-control...",
                "No time for a decision, somebody is at the door."
            ],
            "content":"<div class=\"\"><div> <span>Rika sat on the kitchen table, a single, tiny bowl of rice as her breakfast. She would go hungry, this wasn't enough to satisfy her, not at all, but that was kind of the point. As she ate, she felt a presence appear behind her.<br>\r\n<br>\r\n\"Rika.\"<br>\r\n<br>\r\nOther people might have been surprised by the sudden arrival and unexpected voice, but Rika knew fully well this was as close to saying \"Hi\" as Renamon was capable. They had been partners for a few years, and Rika was used to her sudden appearances and disappearances.<br>\r\n<br>\r\n\"Hello Renamon. I haven't seen you around lately.\"<br>\r\n<br>\r\n\"I've been here. Observing.\" Rika knew this was true. Renamon may disappear for days or even weeks, but Rika only had to call her name and she would appear. Renamon never really left, she just disappeared in shadows, watching over Rika in silence.<br>\r\n<br>\r\n\"I don't doubt it.\" Rika said as she ate her rice. This was good, Renamon's presence made her feel more like herself. She had been a bit off her game lately. \"So, what is it?\"<br>\r\n<br>\r\n\"Your morning meal, it's scarce, less than usual and much less than lately.\" Renamon pointed out, \"Why?\"<br>\r\n<br>\r\nOf course she would bring that up. \"It's enough Renamon, I don't need more food.\" She thought of her love handles and potbelly. No she didn't need more food.<br>\r\n<br>\r\nRenamon moved to the opposite side of the table, looking at Rika with inquisitive eyes. \"But... Food is energy. I know humans work differently than us, but you need energy to live, just like us. I don't think that will be enough energy for you.\"<br>\r\n<br>\r\nRika put down her bowl. \"I'm not going to die from eating a bit less. Besides, that's the whole point, I need to \"lose energy\" so to say.\" One hand rested on her chubby midsection.<br>\r\n<br>\r\nRenamon seemed perplexed, \"I don't understand. You have been growing lately. Digimon do not grow, but isn't it much like digivolving? You will need more energy now.\"<br>\r\n<br>\r\nRika felt a strange mix of embarrassment and amusement. Of course Renamon had noticed her gain, Rika just thought she was being polite, but no, Renamon just didn't understand. As a Digimon, there was no thing such as weight gain, or even physical growth besides digievolution. She thought Rika's weight gain was just more \"growing\".<br>\r\n<br>\r\n\"Yes Renamon, I have been \"growing\" as you say, but that's the problem. You could say this isn't the kind of growth I want. So I have to lose energy to go back to my previous form.\" She tried to explain to the vulpine Digimon.<br>\r\n<br>\r\n\"I see. So it is like a wrong digievolution, like Guilmon's Megidramon?\" Renamon asked.<br>\r\n<br>\r\n\"I guess, it's not really the same, but close enough. And since I want to go back, I have to spend my energy, like Gargomon used to do.\"<br>\r\n<br>\r\n\"I understand.\" Renamon nodded, \"But it doesn't seem like a wrong digievolution. Wrong digievolutions change you, like Megidramon, he wasn't Guilmon anymore. You are still you, much like I am still myself when I become Kyuubimon. Maybe this is actually a good digievolution?\"<br>\r\n<br>\r\nRika paused her thoughts for a second. 'I'm still me, huh?'  She thought as she patted her belly, which just then decided to growl in hunger pains. 'I'd rather be a slimmer me.' The growling intensified; it seemed like the rice had only made her empty stomach more obvious. 'I am hungry though... The bakery will open soon... I really shouldn't...' <br>\r\n<br>\r\nWhat is Rika's decision?</span></div></div>",
            "created":1434171600,
            "id":1991874,
            "title":"Bet you wondered about Renamon"
        },
        "1112311112121222212":{
            "choices":[
                "Rika eats everything, as usual.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, you could come in and have something from the bakery. My parents aren't home, but I could get something ready for you in a minute.\" Takato offered.<br>\r\n<br>\r\nRika's cherubic face lit up at hearing this, and Takato noticed dimples now formed in her face when she smiled. \"Then what are you waiting for Goggles? Open up.\"<br>\r\n<br>\r\nTakato hurried to get out the keys from his pocket, and he opened the back door to the bakery. He then proceeded to turn on the lights and put on an apron. Rika followed him, and her stomach rumbled with expectation. \"Hurry up Gogglehead, I'm getting hungry here.\"<br>\r\n<br>\r\nTakato smiled sheepishly,\"Calm down Rika, I'm going as fast as I can, but you can't really hurry these things; you are gonna have to wait. By the way, what would you like me to make?\"<br>\r\n<br>\r\nRika thought about it for a second,\"Hmm, usually I just have whatever our mother gives me, but since you are asking, I would really like some cake, chocolate cake.\"<br>\r\n<br>\r\nTakato frowned thoughtfully before replying,\"But Rika, we haven't made anything today, so there is no cake to take a piece from, and making one just for one person... Most of it is going to be wasted. Wouldn't you prefer some donuts? There are some made, Y only need to bake them for a couple minutes and put the frosting.\"<br>\r\n<br>\r\nRika scowled at him,\"Goggles, what did I ask for?\" She said cool and menacingly.<br>\r\n<br>\r\n\"Ehrm, that you wanted some cake?\" Takato answered unsure.<br>\r\n<br>\r\n\"Exactly. Did I say anything about a \"piece\" of cake? Don't answer that. No, I didn't. You asked me what I wanted, and I said I wanted a cake, so make me a cake!\" She said, gradually raising her voice.<br>\r\n<br>\r\n\"A-are you sure? A whole cake?\"<br>\r\n<br>\r\n\"Yes I'm sure, get going! And bring me those donuts you were talking about too, make sure they are chocolate.\"<br>\r\n<br>\r\n\"Yes Rika.\" Takato sighed in defeat. He pulled out the donuts, and a few minutes later, he brought a dozen of them to Rika, all of them covered in chocolate. The chubby girl wasted no time, and she tarted devouring the donuts one by one, using both hands.<br>\r\n<br>\r\nTakato looked stared at her, somewhat impressed by her voraciousness, as he got the cake ready for the oven. Seeing how much she ate and how fast, it was no wonder she had gained so much weight.<br>\r\n<br>\r\n\"Goggles! I'm out of donuts, is the cake ready?\" She called.<br>\r\n<br>\r\n\"What? Already? The cake won't be ready for a while, you are going to have to wait.\"<br>\r\n<br>\r\n\"Alright but hurry up, and bring me some more donuts at least.\" She replied,\"And by the way, you are good, but your mother's cooking is still better, you are lacking something.\" She added.<br>\r\n<br>\r\n\"Well, she's been doing this for far longer than me, so she's more experience, but I assure you, the recipe is the same.\" Takato replied while getting ready another batch of donuts, unaware that her mother did use an \"special ingredient\" that he didn't know about.<br>\r\n<br>\r\n\"Maybe some day you'll be as good as her, but for now, this will do, it's really good too.\" Rika said, patting her fleshy midsection. \"Keep the donuts coming until the cake is ready.\"<br>\r\n<br>\r\nTakato sighed, but complied, and kept baking.</span></div></div>",
            "created":1357016400,
            "id":1499797,
            "title":"Takato invites Rika in bakery and makes some pa..."
        },
        "11123111121212222121":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Takato checks on Rika",
                "Takato's parents come home"
            ],
            "content":"<div class=\"\"><div> <span>The cycle continued, Takato would bring donuts, Rika would then quickly eat the donuts and then ask if the cake was ready. Takato would reply in the negative and then have to go get Rika more donuts. By now they had long since run out of chocolate donuts and he was now bringing her whatever he could scrape together from the remaining pastries. She was upset of course that her favorite chocolate delights had run out but she was not unreasonable about it.<br>\r\n<br>\r\nTakato was relieved when the cake was finally done.<br>\r\n<br>\r\n\"Is the cake done yet?\" Rika asked for the umteenth time.<br>\r\n<br>\r\n\"Not yet\" Takato responded. \"It has to cool before I can put on the icing.\"<br>\r\n<br>\r\n\"Forget the icing, I'm hungry\" Rika yelled!<br>\r\n<br>\r\nTakato was starting to fear for his life at this point and quickly brought her the bare cake.<br>\r\n<br>\r\nRika looked much different now than when she first walked in. Her face was covered in frosting and the sprinkles that had stuck to it, and her belly was noticably larger than before. She had neglected to unfasten her belt and jeans so it looked more bloated than it would normally look, causing her shirt to ride up and fully expose her belly and her deepening belly button.<br>\r\n<br>\r\nShe had just finished scarfing down the last of the donuts when she eyed the cake with hungry eyes.<br>\r\n<br>\r\nNo sooner had Takato set the cake down then Rika dug her hands into it and began rapidly shoveling it into her mouth.<br>\r\n<br>\r\nTakato was in awe of her gluttony. The red headed girl was shoving the chunks of cake into her mouth with the manners of a Hutt.<br>\r\n<br>\r\nAt the rate she went Rika finished the cake in just a few minutes. She licked the plate clean then leaned back and rubbed her belly with a content look on her face.<br>\r\n<br>\r\nTakato decided to use this opportunity to clean up, and leave the girl in peace.<br>\r\n<br>\r\n<br>\r\nRika sighed, her belly was at last satisfied, and despite the added pressure from her still fastened jeans and belt, she felt much better than when she first arrived. Lazily opening her eyes she saw Takato cleaning up the mess from her binge. She really had eaten a lot, perhaps more than ever before, and a small amount of guilt hit her when she realized just what she had put Takato through.<br>\r\n<br>\r\n\"Hey Takato can I have some water?\"<br>\r\n<br>\r\nTakato looked at her briefly then replied.<br>\r\n<br>\r\n\"Sure, just a sec.\"<br>\r\n<br>\r\nHe left with the empty trays and then came back a few moments later with a full pitcher of water, much to Rika's delight.<br>\r\n<br>\r\nThe bloated redhead wasted no time in taking the pitcher, tilting back her head and draning its contents into her mouth and down her throat.<br>\r\n<br>\r\nThe cool refreshing liquid was much appreciated by her parched throat and mouth, and she could feel it fall into her belly and get absorbed by the horde of pastries she had devoured.<br>\r\n<br>\r\nSatisfied she handed the empty pitche back to Takato and slowly got off the chair and onto her feet.<br>\r\n<br>\r\n\"I'm going to go lie down for a bit.\"<br>\r\n<br>\r\nTakato's only response was a slightly bewildered nod. He hadn't seemed to fully come to terms with what he had just witnessed.<br>\r\n<br>\r\nRika did feel rather embarassed after showing him such a gluttonous display, what had made her so ravenous that she would be like that? She lay down on the couch and tried to think about it, but soon the effort of digestion overcame her and she drifted off to sleep.</span></div></div>",
            "created":1366174800,
            "id":1573350,
            "title":"Rika eats everything, as usual."
        },
        "111231111212122221211":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Make Rika's belly grow",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Takato had finished cleaning up after Rika had done her own cleaning up.<br>\r\n<br>\r\nThe bakery was almost barren of pastries now after Rika's bingeing, though it wasn't really a financial hit since they would have gone stale anyway, so if anything Rika did them a favor.<br>\r\n<br>\r\nWith the cleaning done he went to the living room to check on the the red headed girl.<br>\r\n<br>\r\nHe spotted her laying on the couch and was amazed at what he saw.<br>\r\n<br>\r\nRika lay on her back, along the length of the couch, sleeping soundly, her chest rising and falling gently with each breath. Looking at her face she looked very cute.<br>\r\n<br>\r\nThen his gaze traveled down her body and centered on the massive pale mound of flesh. Takato was staggered by just how big it was. It stuck up nearly two feet away from her torso, but it was fighting gravity now so some of it's potential height was lost as the flesh fell and folded over Rika's sides like a big water balloon. It was devoid of any stretchmarks or cellulite, it was just a big smooth mound of youthful flesh. He wanted to touch it.<br>\r\n<br>\r\nTakato knew he shouldn't and with Rika he knew the consequences would be great, but he couldn't stop himself for feeling the urge.<br>\r\n<br>\r\nTentatively he approached her, wary of even the slightest reaction from her sleeping form.<br>\r\n<br>\r\nHe knelt down next to her and reached out with his hands, his eyes watching Rika's sleeping face. His hands brushed the soft skin on the mound and then with one last look for a reaction he placed his hands fully on her belly.<br>\r\n<br>\r\nHe was amazed about what his hands told him through his touch. The flesh seemed to have a layer of soft flesh before it became firm from the packed pastries within it's walls. It was amazing.<br>\r\n<br>\r\nLooking at her again, he realized just how alluring her belly was, there was just something about such a disproportionately large belly, and for a reason he couldn't explain, he wanted to see it bigger.</span></div></div>",
            "created":1378098000,
            "id":1656056,
            "title":"Takato checks on Rika"
        },
        "1112311112121222212111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Create the formula for all belly fat",
                "Feed Rika in her sleep"
            ],
            "content":"<div class=\"\"><div> <span>Takato knew he wanted to see Rika's big belly get even bigger, but how would he do that? Well it was going to happen regardless the way Rika seemed to be going, she had been getting larger every time he saw her, so really he wasn't thinking of doing anything that wasn't already happening.<br>\r\n<br>\r\nHe knew his mom had some kind of book that showed how to control eating habits or fat dispersion through various kinds of therapy or some. It was supposed to be used for dieting and curing various eating disorders, so maybe if he could use that, and create some kind of chemical concoction that would make all or Rika's extra fat deposit in her belly, making it even more disproportionately huge.<br>\r\n<br>\r\nAlternatively he could just make her eat more, but he doubted she needed any more encouragement, perhaps though, she did need more food. That presented risk though, she might catch on that he was trying to fatten her up, and if his mom found out..... he dared not think about it. Still, if he fed Rika only the pastries that were going to go old or stale, it would actually be beneficial and he might be able to hide it as one of her taste tester jobs.<br>\r\n<br>\r\nPerhaps he could do both, but Rika would wake up soon so for now he had to choose just one to start.</span></div></div>",
            "created":1378098000,
            "id":1656059,
            "title":"Make Rika's belly grow"
        },
        "11123111121212222121111":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Feed it to her now",
                "Feed her next time she binges"
            ],
            "content":"<div class=\"\"><div> <span>Takato sifted through the cupboards where the recipe books were kept. He knew that this was where his mom kept that book of formulas. He didn't understand the science behind it, but if it worked then it didn't matter to him.<br>\r\n<br>\r\nFinally her found it, tucked deep behind all the others, as if she were trying to hide it.<br>\r\n<br>\r\nLooking through the book her found the section where it talked about localizing fat. He found the formula he needed but there was a notation that said it had to be ingested right before, during, or shortly after a large binge.<br>\r\n<br>\r\nThat meant that if this formula was going to work properly he needed to feed it to Rika either now, or if he managed to get Rika too binge eat later, perhaps the next time she came to work.<br>\r\n<br>\r\nLooking at it further, it needed to be ingested by putting it in the food the person ate. So he needed to feed her more if he was going to get it into Rika.<br>\r\n<br>\r\nWhat should he do?</span></div></div>",
            "created":1391317200,
            "id":1737515,
            "title":"Create the formula for all belly fat"
        },
        "111231111212122221211112":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "His parents returned",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Takato decided that it was safer to prepare the formula now and then just feed it to her at the next opportunity.<br>\r\n<br>\r\nHe had to dig through the pantry quite deep to get some of the ingredients he needed, and one ingredient was something he'd never heard of before. He needed to find where his mother had hidden it and as he suspected, he found it in her sock drawer. If she had hidden it in her underwear drawer then his father would have found it.<br>\r\n<br>\r\nHe mixed everything together as exact as he could and then replaced everything, and left it as he found it.<br>\r\n<br>\r\nHe took the formula he had prepared and hid it in his room where his mom would never find it.<br>\r\n<br>\r\nAs soon as he got down stairs.....</span></div></div>",
            "created":1391317200,
            "id":1737558,
            "title":"Feed her next time she binges"
        },
        "1112311112121222212111122":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika is to embarrassed to ask for new clothes",
                "Rika asks Takato for some new clothes"
            ],
            "content":"<div class=\"\"><div> <span>Takato headed for the kitchen and put on an apron. Rika had only been having baked goods all day and she was probably going to get sick of them soon if she didn't get some variety; although judging from the way she had gorged herself he doubted it would be anytime soon. Still, after seeing how she had pigged out on sweets, how would she handle a properly cooked meal? Would it make her fatter faster?<br>\r\n<br>\r\nHe decided to make a huge meal for Rika, one fit to feed all the tamers and their digimon at once. The thought of his old friend Guilmon brought some reminiscence to him, perhaps that was why he was suddenly so enthralled by Rika's gluttony, it reminded her of him. Well Guilmon would be satisfied with just bread but Rika wouldn't be, so he started cooking, a skill he had picked up in recent months due to his mother's insistence and began making the biggest meal he'd ever made.<br>\r\n<br>\r\n<br>\r\nA lovely delectable smell woke Rika from her slumber and she groaned as she struggled to sit up, her huge gut weighing her down. With effort she managed to sit upright and then lean back to catch her breath. Her hands rested on the huge pale orb of her belly. It had gone down quite a bit after her stomach had time to grind up and digest the sweets. How much time exactly? She looked at the clock hanging over the television and her eyes widened in shock. It was almost 6 O'clock, she'd gotten there at 8, probably ate for an hour or so and fell asleep. She'd been asleep so long? How? Rika's eyes went back down to her big fleshy middle, now much softer than it had been earlier even if not as big, but it still looked like she had swallowed a basketball, and she could feel the high amount of pressure caused by her still fastened belt and jeans.<br>\r\n<br>\r\nShe considered trying to unfasten them but she suddenly remembered that she wasn't in her own home and her cheeks reddened at the thought. Were it not for the sturdy belt Rika was certain that the button of her jeans would not have been able to dam up the massive force of belly within the denim of her jeans, but it was quite uncomfortable now as her body began digesting the food, it was almost painful. She would need alternative clothing. Actually, she just noticed that her shirt was also too small now. It managed to cover her shirt up to just above her belly button, but no amount of stretching would let it come down lower.<br>\r\n<br>\r\nA low rumbling in her middle told her she was hungry again. This was both surprising and not. On the one hand she had, what was to her, a massive belly that didn't give her the right to be so hungry, especially after making such a pig of herself earlier;but on the other, it was dinner time and her body clock was used to eating around now. The fact that she'd missed lunch completely was also something to consider. The smell coming from the kitchen likewise tempted her and she found herself unable to resist at least going to have a look.<br>\r\n<br>\r\nGrunting with effort she managed to push herself to her feet, taking a moment to steady herself and then walked towards the kitchen.<br>\r\n<br>\r\nNow on her feet, Rika started to recognize more changes on her body. Her belly shoot and swayed when she walked and it felt like her pants were slightly tighter in other areas as well. She blushed as she thought about the areas where the fat was depositing itself. She didn't want to end up with huge, fat drooping arms and legs, the belly was enough, although... She held her belly in her hands, feeling it's weight and softness as she walked. \"I do kinda like the belly\" she murmured. She had to admit it felt good to have, felt good to have full, felt nice to hold, and having it exposed and so big gave her an odd feeling of rebellious glee, as if she were sticking it to someone, perhaps society as a whole.<br>\r\n<br>\r\nHalfwaddling into the kitchen Rika was suddenly overwhelmed by an incredible sight. First was Takato, looking like a newlywed wife with his kerchief and apron standing over a stove with each element cooking something in a pot. There was also bowls and plates of food scattered all over and she detected something in the oven too. Seeing it all, smelling it all, she began to drool and her belly rumbled loudly, which caught Takato's attention.<br>\r\n<br>\r\n\"Oh Rika!\" he said, surprised and almost frightened by her presence. \"Uh, how are you? Did you sleep well?\" Such a response was expected of Takato. <br>\r\n<br>\r\nRika wanted to apologize for what she had done, how she had acted, but another part of her didn't want to because A) it was embarrassing and B) She didn't want to show weakness. In the end, the latter won out.<br>\r\n<br>\r\n\"I'm fine.\" She replied simply. \"So what's going on here?\" Rika had a feeling he'd been cooking mostly for her, she wanted to believe that to be the case, but on the other hand, she was rather embarrassed for that to be true looking at all the food, enough for at least ten or fifteen adults, all just to feed her. She really had sunk to a new level of greed.<br>\r\n<br>\r\n\"Uh, great...., um aren't you uncomfortable?\"<br>\r\n<br>\r\nRika almost snapped at him but her mind thought it over. Was he referring to her exposing her gut and implying that she should be embarrassed with such a big fat belly exposed for anyone to see or was he referring to the fact that her belt and jeans were still done up?<br>\r\n<br>\r\n\"You mean by jeans?\"<br>\r\n<br>\r\n\"Uh, yeah. Isn't that painful? Uh, I have a drink, or well, my mom has one that can help with that. It probably won't make things better but it'll at least keep it from getting worse.\"<br>\r\n<br>\r\nRika pondered this. It sounded good enough, but it might also be good to have some new pants too, but that was an embarrassing thing to ask.<br>\r\n<br>\r\n\"Well I'll take the drink then\" She responded</span></div></div>",
            "created":1448168400,
            "id":2065520,
            "title":"Making dinner for the queen"
        },
        "11123111121212222121111221":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika wants more food",
                "Rika's too stuffed"
            ],
            "content":"<div class=\"\"><div> <span>\"No-no I think just the drink will be fine. It's... I'm not as big as I look alright!\" she insisted, her cheeks burning a light pink hue.<br>\r\n<br>\r\n\"Ah, right right. Um, well you can go ahead to the dining room and get started eating dinner, and I'll get the drink. I can't promise it'll taste good though.\"<br>\r\n<br>\r\n\"It's fine. I'm tough. You'd just better hope the dinner's taste makes up for it.\"<br>\r\n<br>\r\n\"Ah... haha, well I'm sure it will.\" Takato said nervously. \"I'll be back.\" Takato hurried out of the kitchen upstairs to his room, leaving Rika to wander into the dining room to see what awaited her and she was surprised to say the least.<br>\r\n<br>\r\nCrowding the small dining table were huge bowls and plates full of food with little dishes taking up what little room was left between them. A huge bowl of ramen noodles that had to weight at least ten pounds on its own, a huge bowl of rice, a large ham, pasta, buns, burgers, hot dogs. \"And it's all for me.\" Rika whispered to herself, drool dripping down her chin, her eyes glazed over with an almost irrational hunger.<br>\r\n<br>\r\nAll for her, this was all hers, every scrap of food on that table was hers to eat and there was even more in the kitchen. \"Plus there's dessert.\" She said with a naughty giggle. \"Alright Takato, is this a challenge? Well bring it on.\" Rika was now too thrilled, to excited to worry about her weight, her belly, her gluttony. She wasn't sure she could actually eat it all but she was sure going to try. She rubbed her belly eagerly as she sat down at the table. \"Now, where to begin.\"<br>\r\n<br>\r\nRika decided to start with the ramen bowl, hurriedly grabbing the chopsticks and quickly beginning to slurp up the noddles, but that was too slow so she instead just tilted the big bowl and began slurping up its contents directly. It took here mere minutes to finish the bowl and she set it down on the floor to make room for her to get the rest of the food, she patted the side of her belly which sloshed with its new contents and was already slightly bigger, putting more pressure on her waist.<br>\r\n<br>\r\n\"Ugh, I should probably wait for Takato, what's taking him so long.\"<br>\r\n<br>\r\n<br>\r\nUpstairs, Takato had been frantically looking about his room for the belly fat potion he had made earlier. He had found it but it had fallen down a small crevice between the wall and the floor that his dad kept meaning to fix but also kept forgetting. Finally he had managed to fish it out and hurried back downstairs to where Rika was waiting.<br>\r\n<br>\r\nHe hadn't actually intended to cook so much, but he had gotten so into it that he just couldn't stop. Now he had come up with the perfect little excuse to give Rika the formula and with all that weight going to her belly, it would help keep her pants intact, at least until her belly got so big that it destroyed her belt or whatever would happen.<br>\r\n<br>\r\nTakato hurried into the dining room and found Rika having already devoured the huge bowl of ramen and was currently tearing into the large rice bowl, her hands shoveling the grains into her greedy mouth at a rapid pace. Yet again, Takato was in awe, amazed that anyone could be so hungry, so ravenous, especially since Rika hadn't exactly been starved. He wondered what had happened to Rika to make her this way.<br>\r\n<br>\r\nHe cleared his throat to get Rika's attention, and the greedy redhead turned to look at him, grains of rice sticking to her face around her mouth and her cheek puffed up with food. He held out the bottle of formula to her.<br>\r\n<br>\r\n\"Is that the stuff?\" She asked.<br>\r\n<br>\r\n\"Yeah. Like I said, I can't promise it'll taste good or how long the effect will last but-\" Rika snatched the bottle from his hand, opened the lid and quickly guzzled its content, pouring it down her gullet and then shoved it back into his hand, then went back to stuffing her face without a word.<br>\r\n<br>\r\nTakato was bewildered by her behavior yet again, acting in such a greedy impatient manner wasn't really like the Rika he used to know. She seemed totally obsessed with the idea of eating everything in sight and as rapidly as possible. He watched her put down the bowl of rice, now empty and start rapidly scarfing down a tray of Takoyaki before putting that down and starting on the burgers. She quickly devoured one burger after the other, one in each hand and taking huge bites of each and barely chewing before swallowing. Takato wondered if the formula had some kind of side effect he'd missed, but he didn't think she was being any more greedy than she'd been with the bakery.<br>\r\n<br>\r\nRika finished the burgers and Takato peered down at her huge middle which seemed to be growing before his eyes as Rika ate and ate and ate. She began shoving down the hotdogs whole into her mouth and swallowing them without chewing, then dug her hands into the paste, getting them soiled with Tomato sauce and getting more on her face as she rapidly shoved it into her mouth, merging it with the ketchup, grease and other bits of food from her earlier dishes, some of it now spilling onto her shirt and belly, making her look quite messy.<br>\r\n<br>\r\nRika ate, and ate and didn't stop until finally, the last item on the table, the small pate of fried squid, slid down her gullet and she let out a massive belch that rattled the cupboards. She sighed contently and rested both hand on her engorged middle, now reaching more than halfway along her lap to her knees, a bit ball of pate white fat and tightly packed food. It was so big and round that it seemed almost unnatural, cartoonish even, but then again Rika's appetite clearly wasn't normal, nor was her behavior. Likewise, Rika had never been a normal girl and they were special kids who had gotten digimon after all. Maybe there was more different about them, maybe they could blend reality or.... wait... was Rika digivolving?<br>\r\n<br>\r\nTakato's dreamer mind went wild with thought. Had their exposure to digimon, particularly their biomerging, affected them in some way? What if Rika's appetite was the result of her body preparing to digivolve or something? What would she digivolve into?<br>\r\n<br>\r\n\"What's wrong gogglehead?\" Rika's slightly strained voice snapped him from his train of thought. <br>\r\n<br>\r\n\"Huh? Oh nothing, just thinking about stuff. Um, you okay? There's more food in the kitchen if you want it.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1448168400,
            "id":2065539,
            "title":"The Queen's Dinner"
        },
        "111231111212122221211112211":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika stays at the bakery",
                "Rika goes home"
            ],
            "content":"<div class=\"\"><div> <span>Rika thought for a moment, holding her belly in her soiled hands. crumbs and sauce dripped from her chin, creating a mess on top of her engorged gut was already sticking out so far, but thanks to Takato's potion or whatever it was, she wasn't any more uncomfortable than she had been, although she didn't know how much longer that would last. Her belt and pants and tucked themselves underneath her gut, putting more of the pressure on her back than her front, but at least she was alright for now.<br>\r\n<br>\r\nShe wondered if she should keep eating. She had already eaten so much, she was massive now, her belly was so huge it forced her shirt up to chest and she could feel it's hefty weight on her lap. She's been unbelievably greedy, all day she'd been like this actually, from the moment she had woken up. She felt another pang of hunger in spite of the fact that she felt fairly full, and she wondered if it was caused by Takato's potion making it a little too easy for her to keep eating. Still, she felt she had already gotten herself wet, so to speak, so she figured she might as well dive right in and think about it later.<br>\r\n<br>\r\n\"Yeah, I've got room for more.\" She answered. \"Mind getting me something to drink too?\"<br>\r\n<br>\r\nLike a gracious host Takato smiled. \"Sure, I think we have some pop to drink, and I can always get you water if that runs out.\" Takato hurried to the kitchen and returned a moment later with a 2 liter bottle of orange pop and a large pitcher full of water, setting both down in front of her and picked up the dishes stacked at Rika's feet, showing surprising strength. \"I'll get your food now.\" he said with a strained voice, and then headed back into the kitchen.<br>\r\n<br>\r\nRika blushed when she realized Takato hadn't left her a cup, knowing she wouldn't use it. \"I really am shameless\" she whispered to herself. She grabbed the bottle of pop and unscrewed the lid, bringing it to her lips and starting to chug. The acids burned at her throat but she ignored it, chugging quickly, rapidly downing the huge drink and she wondered if she could down the whole thing in one breath. Grinning at herself with her own challenge she tilted the bottle up even more, and chugged as fast as she could, letting the drink pour into her belly almost as fast as gravity would let it. She could feel it saturating the contents of her belly, it flt quite cool compared to the rest of it. She thought that her insides were probably like a furnace at the moment as they worked to digest the vast banquet she had eaten, with still more to come.<br>\r\n<br>\r\nRika's face started to turn purple as she was running out of air, but she was so close to finishing the bottle, she couldn't stop now. Finally the last drop fell into her mouth and down her slippery gullet and she gasped. \"Aha.... ahaha, I did it.\" She wheezed, proud of herself for her accomplishment. A whole two liter bottle guzzled in one shot. With so much food inside to soak up the fluid she wondered if she would even be able to burp if she wanted to. She had no more time to think about it as Takato arrived with armfuls of scrumptious looking foods.<br>\r\n<br>\r\nMeatloaf, steak, chicken fingers, deep fried prawns and another basket of freshly baked buns. Rika's mouth drooled anew as she watched the spread laid out before her, her hunger now a tool to enable her to eat so much delicious looking food instead of a case of concern. She'd be concerned later, right now she had some eating to do.<br>\r\n<br>\r\nRika grabbed the meatloaf first, bringing it closer and burying her face right into it, holding it between her hands and tearing into it with her teeth. It was not a clean procedure and Takato had to take a few steps back to keep flying debris from staining his clothes. Rika grabbed the chicken strips next, shoving one after the other into her mouth, taking an occasional fried prawn to add some variety until both plates were clean and discarded. She grabbed a bun in each hand and shoved them both into her mouth one after the other, her cheeks puffing out like a chipmunk's before taking one almighty swallow that sent them down her throat as a huge lump before it landed in her increasingly packed gut. Finally there was only the steak. She picked it up in her hands and tore a chunk off with her mouth, the warm juices coating her chin and dripping onto her increasingly messy belly top. She finally gobbled it all up and took a moment to rub her stuffed belly with her greasy fingers.<br>\r\n<br>\r\n\"Mmmm when did you become such a good cook Takato. I bet you can even cook better than Jeri now.\"<br>\r\n<br>\r\nTakato laughed nervously. \"Well like I said, I learned a little and she taught me a few things too. I'm uh... more impressed by you. You can really eat a lot. I guess that's why mom hired you as the taster.\"<br>\r\n<br>\r\nRika suddenly felt a little self-conscious. Takata had been polite in what he'd said, but she couldn't help but think of alternative hidden meanings to his words and wondered if he was actually being sincere. Then again, he had a point; she noticed she had been eating a lot more since becoming taster and Mrs. Matsuki had encouraged her a lot.... wait was that it? Had she had this hidden appetite all along and had only unlocked it thanks to Mrs. Matsuki's ample baking and encouragement? Had she really been.... a pig this whole time? Was this her real self? She didn't know. She couldn't think of how to answer that, but she did manage to find one for Takato.<br>\r\n<br>\r\n\"Yeah well.... you're mom's trained me well.\"<br>\r\n<br>\r\n\"Uh yeah I guess she's good at that. Uh... there is one cake for dessert if you want it.\"<br>\r\n<br>\r\nRika perked up at the mention of cake. She was stuffed, really stuffed, but dessert, a cake, more sweets, the things that Mrs. Matsuki had allegedly been training her on. She could do it, she knew she could. \"Yeah bring it!\" She said enthusiastically. \"I'll show you the results of my training.\"<br>\r\n<br>\r\nTakata grimaced. \"Well, it's not like I need it proven to me more...\" His voice trailed off as he left the dining room to retrieve the cake.<br>\r\n<br>\r\nRika blushed a bit at his comment, but didn't take it personally. She had been a glutton, a pig, undeniably so, but the notion that this might be her true self did have her wondering. Was she being more true to herself, acting as she should actually be acting by being this big of a glutton? She couldn't deny that she did enjoy the experience of gorging on large amounts of food. She loved eating, she couldn't deny that, but she was apprehensive about becoming the size of a whale, and at the rate she was going sh'd have trouble just fitting through the door by the end of the week.<br>\r\n<br>\r\nTakato's arrival back in the room ceased her self-reflection and her mouth opened wide at the large chocolate cake Takato carried in and lay before her. It was three thick layers with two of chocolate sandwiching one of fudge, all stacked with a thick coating of chocolate frosting. Her eyes glazed over as she leaned forward to devour it, Takato running to the corner of the room to save himself from the carnage she was about to unleash and unleash it she did.<br>\r\n<br>\r\nShe tore into the cake mercilessly, shredding it as she shoved handfuls into her mouth as fast as she could put them. Bits of cake fell onto her gut and splashed all over the room, Rika's face turning dark with chocolate frosting. It was so delicious, so decadent and delectable, her body demanded it be put inside her as soon as possible, like it was oxygen.<br>\r\n<br>\r\nThe cake was gone in mere minutes, Rika licked the plate clean and even bits that had fallen onto the table. When she started picking up the bits of food that covered her belly, Takato felt it was safe enough to approach her.<br>\r\n<br>\r\n\"So uh... Rika. Are you planning on going home tonight or would you like to stay?\"<br>\r\n<br>\r\nRika paused and gazed inwardly. She should probably go home if she could, but this massive gut would be easily noticeable by everyone and very embarrassing to go walking around in, assuming she could even walk at this point. Staying at the bakery would have the benefit of letting her sleep off her massive meal, hopefully digesting enough that her shirt would fit over her gut, though she doubted that. Also, her grandmother might be adverse to letting her stay at a boy's house, alone with him no less. It was possible she could avoid actually mentioning that Takato's parents were out of town, but knowing how the parents of the tamers kept in touch, she probably already knew. She could take a taxi home which would save her some embarrassment, and she could care less what some old cab driver thought about her big belly. \"Guy should be happy to see any part of a real girl naked\" she muttered to herself.<br>\r\n<br>\r\n\"Hm?\"<br>\r\n<br>\r\n\"Oh nothing.\" She said.</span></div></div>",
            "created":1448427600,
            "id":2066730,
            "title":"The Queen's second course and desssert"
        },
        "1112311112121222212111122112":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika arrives home",
                "Go to Mrs. Matsuki who has been watching the bakery via internet"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I should go home... somehow. I've been here enough and *urp* I don't want my grandma to be worried.\" 'Although she probably will be when she sees how damn fat I've gotten.' She thought sourly.<br>\r\n<br>\r\n\"Oh uh... okay. Um, I know a cab driver around here who can take you and.... well she's more understanding.... if you know what I mean....\" Takato didn't explain himself and Rika was grateful for it. Her belly would be impossible to hide and the fact that she was a woman would also be a small source of comfort; however small.<br>\r\n<br>\r\n\"Before that, let's see if I can even stand up first.\" Rika placed her hands firmly on the sides of the seat and tried pushing herself up. There was movement but her actions were obstructed by her belly laying on her legs and the fact that it was under the table. Grunting she pushed the able away and took her big bloated gut snugly in her hands. Her hands singing in just a bit as the contents shuffled around. Rika lifted her belly with her hands, taking pressure off of her legs and allowing her to slowly stand up. Her face flushed red with effort, her face showing strain as she struggled to stand with her new weight but she managed to get up and stagger away from the table as Takato moved the chair out of the way.<br>\r\n<br>\r\nEvery step she made felt heavy and her belly sloshed a bit, her hands managing to keep its waywardness under control. Grunting she turned around and headed out of the dining room towards the couch to sit down. Takato offered his help but she shook her head. If she was going to get home, even with a taxi, she had to be able to do this herself. Slowly she lowered herself onto the couch, supporting herself on one of the couch arms until she finally plopped into place, She sighed in exhausted relief. \"How do pregnant women do this all the time?\"<br>\r\n<br>\r\nTakato chuckled. \"You do look a pregnant I guess. M-maybe if you wear maternity shirts, it'll hide your belly more.\"<br>\r\n<br>\r\nRika raised an eyerbrow at Takato's suggestion, not because it was ludicrous, rather it made sense. Her belly did seem to be the part of her getting fat the fastest and it was about the same size as a pregnant belly would be on a woman, she supposed. Still, somehow the connotations didn't appeal to her. Then again, she might not have a choice if she wanted to keep her job and eating habits, something she was still unsure about.<br>\r\n<br>\r\n\"I'll keep that in mind.\" she said simply. \"Go and call the cab huh? I'm gonna just rest here a bit until it gets here.\"<br>\r\n<br>\r\n\"Oh, yeah sure.\" Takato scurried away to go to the phone, leaving Rika to sit and digest for a while. <br>\r\n<br>\r\nRika used her fingers to pick the rest of the food crumbs and chunks off her belly but it was still quite stained and painfully obvious contrasted against her white tummy flesh. She suspected her face was in a similar state. \"Damn, I've gotten to be such a pig\" she sighed. \"Eh, I'll think about it later. I have to think how I'll explain this gut to grandma if she's home.\"<br>\r\n<br>\r\nTakato returned a moment later with the water pitcher in hand. She'd forgotten about that. \"She's on her way, be just a few minutes\" He said, setting the pitcher down beside her. \"Figured you'd be thirsty again.\"<br>\r\n<br>\r\n\"Thanks. Uh, mind getting me some paper towels so I can clean up?\" Rika's cheeks warmed to a dark pink colour at the request but Takato only gave her his usual goofy smile.<br>\r\n<br>\r\n\"Sure, no problem.\" He scampered back to the kitchen yet again, giving Rika enough time to pour the entire contents of the water pitcher inside her. The cool liquid was refreshing to her mouth, throat and stomach, somehow relaxing it. She set it down just as Takato returned with a roll of paper towels. She grasped it thankfully and ripped off a few squares, wiping her face and grimacing when she saw how filthy it was. She kept wiping until no filth was left and then she worked on her belly, cleaning up it's smooth pale surface until it was all clean.<br>\r\n<br>\r\nA honking car horn disturbed the night outside and Takato went to the door. \"It's probably the cab.\"<br>\r\n<br>\r\nRika tossed the paper towels and grabbed the couch arm again. \"Okay, be right there.\"<br>\r\n<br>\r\nRika uttered a loud grunt of effort and got up to her feet. It wasn't that much weight really, but because she wasn't used to it, she felt very imbalanced and heavy. She suddenly had a new respect for all pregnant women and mothers. \"Now I know why most animals aren't bipeds\" she muttered. She waddled slowly towards the door, wary of her extra weight and bulk until she found the side door in the kitchen.<br>\r\n<br>\r\nStanding there with Takato was a slightly tanned woman with long wavy dark hair and deep green eyes. She wore a short red jacket and blue jeans not unlike her own. She seemed to be having a nice chat with Takato which meant they probably knew each other, knowing how shy Takato normally was. She spotted Rika out of the corner of her eye and smiled at her.<br>\r\n<br>\r\n\"Hey there, enjoying the Matsuki bakery I see.\" Rika resisted the urge to swear a retort but held her tongue. She wasn't able to hide her blush though, but the woman just laughed. \"Aww don't worry about it girl, I've come outta here with a belt buster myself a couple 'a times. Takato's mom sure loves stuffing girls silly.\"<br>\r\n<br>\r\nRika raised an eyebrow. \"She does?\"<br>\r\n<br>\r\n\"Oh yeah. I guess it's the baker part of her that doesn't like seeing anyone that looks hungry. Can't say I regret the free food but it's a hell of a time driving with a belly like that I can tell 'ya.\" She patted her exposed but only slightly soft looking tummy for emphasis.<br>\r\n<br>\r\nRika relaxed a bit. Now she understood more of why Takato had chosen this particular cab driver. It was a load off her mind and her self respect. She now felt she really owed Takato now.<br>\r\n<br>\r\n\"Anyways you're probably just barely standin'. Let's get ya in the van.\" Rika winced at the word 'van'. 'Guess I'm too fat for a car.' she thought half seriously.<br>\r\n<br>\r\nTakato held the door open for her and she stepped out into the cool night air. Gooseflesh started to prickle her skin, especially the expanse of her belly, almost as soon as she stepped out. Fortunately the Van was only a few steps away and the driver had already opened the side door to let her in. With both Takato and her help, Rika was able to get inside but she noticed there was no real seat, only a set of straps. The cab driver stepped in and began tying her up in these sturdy looking black straps, keeping her securely in place.<br>\r\n<br>\r\n\"Um, what is this?\" She asked.<br>\r\n<br>\r\n\"Oh it's like a seat belt, only there's no seat.\" She explained. \"A lot of people who ah... enjoy their food a lot can't always get in or fit in normal seats ya see.\" She smiled. \"Also handy for that one pregnant lady with quints. Damn she was a hell of a woman, wish I could be as strong as her.\"<br>\r\n<br>\r\nRika let out a heavy breath. She was struggling with just a stuffed gut; she couldn't imagine what a belly full of five babies would be like.<br>\r\n<br>\r\n\"Okay you're all strapped in.\" The driver stepped out and let Takato and Rika share a wave of parting before she slid the door shut. A moment later the driver was in the seat and they were off.<br>\r\n<br>\r\n\"I'm Sabine by the way.\" The driver said. \"I specialize in taking uh... handicapped people around.\" She grinned knowingly at Rika thorough the rear-view mirror.<br>\r\n<br>\r\n\"Rika.\" The redhead answered.<br>\r\n<br>\r\n\"Nice to meet you Rika, and I bet we'll be meeting again after tonight hm?\"<br>\r\n<br>\r\nRika's cheeks heated up. \"W-well I guess so since I have a job as Mrs. Matsuki's taste tester.\"<br>\r\n<br>\r\n\"Oh is that so? Well if the Matsuki bakery gets even better I'm going to have a busy business.\" She laughed. \"How long have you been at it.\"<br>\r\n<br>\r\n\"A little while.\" Rika answered. \"Not too long.\"<br>\r\n<br>\r\n\"Well here's hoping you have a good time at it. If Takato's anything like his mom, I'm sure you will.\"<br>\r\n<br>\r\nRika sighed inwardly but she had learned something about Mrs. Matsuki. She liked to see people well fed. That had to be why she never complained when Rika ate a lot more than she really needed to. It might have also explained Takato cooking so much and not complaining much around dinner time, although he was understandably timid earlier in the day.<br>\r\n<br>\r\n\"Well I guess we will be seeing each other more, although I don't know how my family will take my... condition.\"<br>\r\n<br>\r\nSabine shrugged. \"Awww it's not too bad. It's your job afterall, plus if they eat the same chow, they'll inflate pretty quick too and they'll be begging you to eat all their food so they don't get big.\"<br>\r\n<br>\r\nRika chuckled at the thought of her mother suddenly succumbing to an episode of gluttony. \"Maybe, but I still don't think it'll go over well, though I guess my grandma likes to spoil me.\"<br>\r\n<br>\r\n\"And if she gets jealous she might try to outdo Mrs. Matsuki.\" Sabine laughed. \"Then I'll have to use a flatbed to take you around.\"<br>\r\n<br>\r\nRika grimaced. \"Well I hope it doesn't get to that point, but.... well I guess it's just a way of showing love.\"<br>\r\n<br>\r\nSabine smiled and nodded. \"That's right. Everyone shows love in their own way, and as long as you're fine with it, that's all that really matters.\"<br>\r\n<br>\r\nRika thought back to Mrs. Matsuki and Takato and how well they had been taking care of her. It brought a sentimental smile to her lips and a hand fell onto her belly, giving it an affectionate rub. \"Yeah, love.\"</span></div></div>",
            "created":1448514000,
            "id":2067034,
            "title":"Rika goes home"
        },
        "11123111121212222121111221121":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika home alone for now",
                "Grandma's home"
            ],
            "content":"<div class=\"\"><div> <span>\"We're here.\" Sabine announced as the van came to a stop.<br>\r\n<br>\r\n\"Unf, good.\" Rika groaned, shuffling a bit to loose up her limbs a little. Sabine wasted little time in undoing the straps and helping her out of the van onto her feet.<br>\r\n<br>\r\n\"Hmm you're pretty stable for a firs timer.\"<br>\r\n<br>\r\n\"Yeah well, i'm stronger than I look.\" Rika managed to smile. \"Thanks for your help.\" Rika handed her a few large bills. \"Keep the change.\"<br>\r\n<br>\r\nSabine smiled. \"Thanks. If you need me again, you have my number.\"<br>\r\n<br>\r\n\"On my quick select list.\" Rika added. \"See you soon probably.\"<br>\r\n<br>\r\n\"Heh, I bet. Night Rika.\"<br>\r\n<br>\r\n\"Night Sabine.\" Rika waddled away from the road towards the house and thought about what would happen in the next few moments.<br>\r\n<br>\r\nHer mother was off on a business trip so it was just her and her grandmother at the moment, but her Grandmother was sometimes gone at dinner to eat with friends. She hoped that was the case. She'd find out eventually but Rika would be happy to put it off. She approached the door cautiously and then tentatively opened it, blushing when her belly rubbed against it.<br>\r\n<br>\r\nShe stepped inside and carefully removed her shoes, leaning against the door to hold herself up while she kicked her shoes off. Rika listened for any sounds of life in the house, wondering if her grandmother was home or not.</span></div></div>",
            "created":1448590380,
            "id":2067047,
            "title":"Rika arrives home"
        },
        "111231111212122221211112211211":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika dreams",
                "Next morning"
            ],
            "content":"<div class=\"\"><div> <span>\"Grandma? You home?\" Rika called out. It was far too early for her grandmother to be in bed sleeping, and no response seemed to indicate she wasn't home unless she was in the lavatory.<br>\r\n<br>\r\nTentatively taking the step up onto the floor of the house, Rika carefully navigated the corridors towards her bedroom, happy that there were no creaking floorboards. She reached her room and switched the light on, blinking as her eyes adjusted to the brighter light here than had been outside or in the corridors. She slid the door shut behind her and took a moment to think about what she should do now that she was home.<br>\r\n<br>\r\n\"Pants\" she realized. She had to think about how to get them off first, with both a very tight belt and button in the way, it was going to take a effort and it seemed like the long time holding her belly back was finally starting to weight on her, as her belly was now shaping up more now that it wasn't being stuffed constantly and was starting to properly fill out instead of just push over her belt and pants. She was running out of time. She needed to temporarily relieve the pressure somehow.<br>\r\n<br>\r\nShe looked around her room and spotted her desk. She waddled over to it and then set her belly on it's surface, shivering as her warm belly touched the cool desk surface. It did the job though, propping up her gut enough to relieve the pressure on her belt and allow her hands to snake underneath and her fingers reach the troublesome belt but she had a little trouble.<br>\r\n<br>\r\nShe now understood why it hadn't been bothering her as much. It had folded forward rather than try to take all the weight, leaving her still some room to grow, but she needed to get it off while she still could, and if for the extra support form the desk it would have been nearly impossible without another pair of hands. She grunted as she tried to work the snug belt undone, and finally managed to get it to slip out of the hole and come undone, letting her gut fill out more naturally, her hands holding back the torrent of flesh just long enough to let her undo the button of her jeans and finally let it all out.<br>\r\n<br>\r\nRika moaned with pleasure, her big gut finally free and loose. She took a moment to rub the sore spot where her belt had left an indentation, soothing the sore skin. Once that was done she pushed her pants down past her butt which odd to her hadn't grown at all since this morning. Well there was still time to digest all this food before more fat was made, not exactly something she was looking forward to but if her fat spread out a bit it might be easier to walk. She let her pants fall down and then stepped her legs out of it. As long as nobody else was home, she didn't mind standing in just her underwear. her shirt was next, tossing the badly stained and soiled top into her hamper, exposing her bare chest which held not a trace of extra fat, just an abrupt stop where her belly began.<br>\r\n<br>\r\n\"Damn I'm fat.\" she said for probably the hundredth time tonight. She felt tired too, hardly surprising after the day she had and how much work her body was probably doing to digest all this food. \"Guess I'll just brush and turn in early.\" Rika shuffled towards the lavatory. She was getting used to the huge weight of her belly and it was no longer painful now that her pants were off. Now her blue panties, snug around her hips and rear but only marginally tight around her waist, were her only clothing.<br>\r\n<br>\r\nShe headed into the lavatory and grunted as her belly hit the sink counter. Huffing with frustration she hefted it up and placed it on the counter top. She grabbed her toothbrush and started brushing hard, aware she had eaten a lot so there would be a lot to clean. She flossed just as thoroughly and then washed her face again. Satisfied with herself and left the room and waddled back her bedroom.<br>\r\n<br>\r\nShe found her pajamas but recognized that only the top three buttons on her top would even do up and her bottoms were questionable whether they would get high enough on her waist to fit her. She tried anyway, managing do up the three buttons of her striped blue pajamas and used the desk trick like earlier to worm her pajama pants up until they hooked above her bum, but she couldn't get them very high with her belly in the way, now having settled into a more natural but troubling position. Still they stayed up on their own and that was good enough for her.<br>\r\n<br>\r\nShe waddled back over to the light switch and shut it off, plunging her bedroom into darkness. She then wandered to her futon and tried to get into a sleeping position, but quickly found that sleeping on her back was more difficult with a massive belly pressing on you and the covers had a hard time covering what was basically a mountain under them.<br>\r\n<br>\r\nSighing she rolled onto her side, her belly sloshing and gurgling. The rough motion eliciting another small belch from Rika before it settled down and Rika was able cover herself with the blanket.<br>\r\n<br>\r\nIt had been a long day, and she was grateful it was over. She probably wouldn't be going to the bakery over the weekend but her belly would still be bigger on Monday when she returned than it had been first thing this morning, and she would have to deal with her grandmother this weekend too. What was she going to do....<br>\r\n<br>\r\nRika's mind started to lose focus as sleep and exhaustion overcame her. Finally she could resist no longer and she drifted off to sleep, a hand on her big belly and her chest rising and falling slowly with each quiet breath.</span></div></div>",
            "created":1448593800,
            "id":2067072,
            "title":"Rika home alone for now"
        },
        "11123111121212222121111221122":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Back to Rika",
                "Back to Takato"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Matsuki grinned as she watched the recorded footage taken by her secret security cameras tactically placed throughout the bakery and their home. She had installed them initially a long time ago to keep an eye on Takato via an internet connection, and now she stared at her laptop screen with an almost evil smile while her husband slept awkwardly in the nearby bed.<br>\r\n<br>\r\nShe had initially pulled up the live footage to let her check if Takato was up on time and to call him to get up, but Rika had arrived and beaten her to it, and she had provided quite a show. She'd been forced to stop watching near the beginning to spend time with her husband but now she eagerly watched the recorded footage of Rika just sitting at the bakery counter gorging, eating herself fatter and fatter, starting with the binge in the morning, her destruction of the cake. When Rika had gone to sleep she skipped through the footage of her sleeping until she woke up again and was pleasantly surprised to find that Takato had made a huge meal for her. There was no sound of course but she had a guess as to some of the words the two young teens had exchanged.<br>\r\n<br>\r\nIt hadn't been sweets but Rika had engorged herself on the dinner in a manner than almost exceeded her earlier gluttony, eating and eating totally unwavering until she had to wait for Takato to bring seconds, and then she ate that too. <br>\r\n<br>\r\nMrs. Matsuki was mesmerized by the young glutton, the way she just ate and ate and ate, how her belly just grew and grew, so soft looking. She really was exceeding her expectations! More than that, she had a bunch of modified recipes to try based on Rika's feedback and she had a feeling it would bring in a lot more customers to the bakery. Watching Rika destroy yet another cake was so satisfying and she wished she could have been there in person to soothe her by rubbing that beautiful belly, a sign of someone nicely well fed, and stuffed.<br>\r\n<br>\r\n\"And she's only going to get bigger.\" She whispered to herself. \"Once she starts having some of my formula again, she'll be so big she might not be able to move.\" Mrs. Matsuki made a goal that once she got back and Rika returned to the bakery, she would get Rika's belly to reach her knees before the end of the day. Smiling at the thought, she rewound the footage, making a quick check to make sure her husband was still sleeping and then watched everything again, watching Rika eat and eat and eat, and watch her belly grow bigger and bigger and bigger.</span></div></div>",
            "created":1448514000,
            "id":2067039,
            "title":"Go to Mrs. Matsuki who has been watching the ba..."
        },
        "111231111212122221211112211222":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Takato has a dream",
                "Back to Rika"
            ],
            "content":"<div class=\"\"><div> <span>Takato was hummed the digimon theme song to himself as he washed the dishes from Rika's dinner. Maybe he had gone overboard which how much food had made, but he couldn't argue with the results. Rika had surpassed herself and had devoured every last crumb of the meal, making cleaning the plates fairly easy; although, her messy eating had made quite a mess of the dining room and cleaning that up would not be so fun. Still he felt he had at least gained some favor with her. <br>\r\n<br>\r\nHe had to admit that he had always had a small crush on Rika; although, he also had a crush on Jeri too. He shook his head clear and vigorously returned to washing the dishes.<br>\r\n<br>\r\nHe was happy about how easy it had been to get Rika to drink the formula that would make virtually all of her excess fat deposit on her belly. It hadn't been nearly as awkward as he had feared, and from how much she had eaten and how big her belly had gotten he had no doubt that Rika would have a nice plump belly when she returned. Monday she had said, but Takato thought it was possible that Rika would come sooner, unless someone at Rika's home was able to satisfy that hungry belly of hers, she would probably be back. The rational part of his brain didn't want her to come back until his parents returned from their honeymoon on Sunday night; after all, Rika had eaten through quite a lot of the kitchen stores and the bakery was fairly bare as well until they would start baking new goods for Monday's reopening. That reminded him, he would have to go clean up the bakery too.<br>\r\n<br>\r\nHe sighed and flicked his hands clean of water, drying them on a towel. \"Ugh, I'll be in so much trouble if mom and dad get home before I clean all this up.\" Dragging himself away from the single to let the dishes air dry a little before he properly dried them, he grabbed a mop, filled up a small pail with water and went to the dining room.<br>\r\n<br>\r\nGlobs of food where everywhere on the floor, even under the table where bits had fallen off Rika's belly and the table itself was a scene of carnage with the guts of Rika's meal having been sent flying all the way to the opposite end. The mealoaf had been particularly gory.<br>\r\n<br>\r\nHe started scrubbing the table and chairs first, working his way down to to the floor and he thought about why he liked Rika's belly so much. Was it even something that he could explain? Was there a reason behind it? Maybe it was his own interpretation of his mother's insistence on feeding girls who seemed to be hungry, at least that's what she had said, but based on how things were going with Rika and a couple of times with Sabine. Maybe this was his interpretation of such that, something he had learned from his mother and interpreted through his own younger mind. As he finished cleaning the dining room, he started to think about why his mom was that way? It did seem like the kind of attitude a baker would have, but he wondered it there was more meaning behind it. He seemed to recall his father saying something about that aspect of him that attracted him to her.<br>\r\n<br>\r\nTakato had to admit that he himself was attracted to Rika's headstrong attitude, in the same way he was attracted to Jeri's infectious sweetness. Takato wondered if it was that part of Rika he liked that made her so eager and willing to eat enough to get so fat. He honestly didn't know.<br>\r\n<br>\r\nThe dining room was now clean and Takato dumped the mess into the garbage can outside. Now all he had to do was dry the dishes and he wondered if Rika would indeed come back. <br>\r\n<br>\r\nHe yawned exhausted. All the effort of looking after Rika had been a bit of a drain, and he now felt ready for bed. Maybe once he finished cleaning up he'd go to bed. That might be a good idea, because if Rika was going to come, he'd need all his energy.</span></div></div>",
            "created":1448751060,
            "id":2067717,
            "title":"Back to Takato"
        },
        "1112311112121222212111122112222":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika's midnight snack",
                "Rika dreams"
            ],
            "content":"<div class=\"\"><div> <span>Rika swallowed nervously as she approached her home. Sabine had dropped her off at the back of the house to be more discreet. The lights were on in the house so that meant someone was home, most likely her grandmother.<br>\r\n<br>\r\nRika absentmindedly tugged her shirt down, trying vainly to get it to cover her big gut. She really didn't want to face her family with this belly. Sure they knew she was working at the bakery but she didn't think they knew exactly what her job was and she knew her mother would be furious if she saw how fat she'd gotten. Her grandmother... she wasn't so sure.<br>\r\n<br>\r\nShe stepped into the house and listened. She could hear the sounds of the TV being on and guess that her grandma was watching her shows. Maybe if she remained distracted, Rika could slip past her unnoticed.<br>\r\n<br>\r\nPeering around the corner she saw her grandmother sitting in her chair and watching the TV as the commercials began to play. Swallowing nervously, Rika stepped out from behind the corner and crept along the wall. She winced as the floor creaked under her foot and watched anxiously to see if her grandma would notice. She didn't react however, so Rika continued.<br>\r\n<br>\r\nEvery step was nerve-wracking, her heart was pounding as she tried to sneak by. So far so good, everything was going fine so far.<br>\r\n<br>\r\n*Grrrruuuuurrrrrppppgl*<br>\r\n<br>\r\nRika froze and swore internally. Her belly's sudden noise was so loud she bet the neighbours could have heard it.<br>\r\n<br>\r\n\"Oh, welcome home Rika.\" her grandmother greeted. \"How was work today?\"<br>\r\n<br>\r\nRika bit her bottom lip and turned away slightly to try and hide her belly from view. \"F-fine. It was a... a busy day.\" Her grandma chuckled.<br>\r\n<br>\r\n\"Yes, I see that.\" Rika's cheeks burned bright red, knowing she had been caught. She fought to keep tears back and just wanted to die right there.<br>\r\n<br>\r\nHer grandma stood up from her chair and walked over to her. \"You don't need to be ashamed Rika, it's part of your job isn't it? Besides, you look cute with this tummy.\" She grabbed a handful of Rika's gut and felt it in her hands. \"A lot of tummy too. How odd that it's where all your fat seems to be going. You almost look pregnant\"<br>\r\n<br>\r\n\"Y-yeah well, I guess it's just how I am.\" Rika said quietly. \"Uh, you really don't mind?\"<br>\r\n<br>\r\n\"Of course not dear. You look adorable and as long as your healthy and happy I have no objections. Maybe when you have a hard time fitting through the doors I'll have second thoughts but until then feel free to eat and grow as much as you want.\"<br>\r\n<br>\r\nRika managed a tiny smile. \"Th-thanks grandma, but I'm not trying to gain weight it's just.... I'm so hungry all the time these days.\"<br>\r\n<br>\r\n\"Well you are a growing girl.\" Her grandmother said. \"And if you're hungry then you need to eat.\"<br>\r\n<br>\r\n\"Y-yeah but I think I'm just gonna turn in now. It's late and I'm pretty bushed.\"<br>\r\n<br>\r\n\"Alright then. Good night Rika.\"<br>\r\n<br>\r\n\"Night Grandma.\" Rika waddled to her room, feeling a huge sense of relief. Her grandma was willing to support her, or at least not freak out about her weight. Rika knew she was going to keep getting bigger if things stayed the way they were so she had little choice but to accept it if she wanted to keep her job. \"At least Grandma still loves me.\" Rika smiled.</span></div></div>",
            "created":1467926520,
            "id":2176876,
            "title":"Back to Rika"
        },
        "11123111121212222121111221122222":{
            "author_id":"thuasluhuall",
            "author_name":"Thuasluhuall",
            "choices":[
                "Rika gets out of the house and tries to figure things out.",
                "Rika is caught and must talk to her mother."
            ],
            "content":"<div class=\"\"><div> <span>          As Rika snuggled into her bed she rubbed her sore stuffed gut trying to settle it, and in doing so started to feel strange stirrings as she drifted off into a deep slumber.<br>\r\n<br>\r\nIn Rika’s dream she was in a glamorous palace reclining on a mound of pillows dressed in a satin bikini and over that she wore a see thru robe with golden accessories adorned with jewels. Takato was her manservant waiting on her every need and want. “Feed me another one of your delicious sweets Gogglehead!” Rika commanded with a loving smirk. Takato obliged with a smile popping the small cake like treat into mouth. Rika savored the taste and as she swallowed, she heard a strange sound a very faint hiss. “Gogglehead did you hear something unusual?” Queen Rika inquired trying to feign disinterest. “No my queen, I don’t hear anything unusual.” Takato replied as he moved behind Rika to fetch more sweets. <br>\r\n<br>\r\nRika gave him a skeptical look as watched him disappeared behind her peripheral vision, at which point she slumped into her pillows frustrated. “Where are the sweets?” She yelled impatiently at which point Takato was at her side a silver platter filled with treats and cookies that sparkled like gems. Takato started popping the sweets into Rika’s welcoming mouth. Occasionally she would quickly lick his fingers after eating one of his gifts giving him an alluring look, and he would smile back at her. That is until the sound returned that faint hiss that steadily got louder. “There it is again Gogglehead do you hear it.” Rika asked again as she looked frantically around the room for the source. “It is nothing to worry about my Queen.” <br>\r\n<br>\r\n“I suppose it is just distracting is all.” Rika agreed as she got comfortable again, and it was at this point she noticed something odd. “Gogglehead do I look larger to you?” Indeed, what had once been a trim thin stomach had puffed up looking as if she was nearing the end of her first trimester. “My queen you are beautiful as you always are.” Rika blushed at the sweet words “I am aren’t I?” she said as Takato brought another sweet to her mouth. “Well one more couldn’t hurt.” Queen Rika rationalized as she to the treat from Takato, and tossed it into her mouth. <br>\r\n<br>\r\nHowever, after she ate it the hiss returned louder than ever. Rika’s small belly swelled and swelled as she flew past the trimesters of pregnancy. “Takato! Where are you? Help me please!” She cried as she flailed around trying to sit up. In her panic she looked around for Takato from her seat, and when she found him he was behind her kneeling next to a helium canister with a hose trailing off toward her. <br>\r\n<br>\r\nRika was quick to realize what was going on. “Takato! What are you doing to me! Stop this right now!” She demanded. He did not answer though and just remained kneeled much to Rika’s aggravation.  She followed the length of the hose seeing it led to her back. “If you will not stop this than I will!” She tried to pull out the hose, but it was always out of reach. She grunted as her golden belt burst once her stomach had swollen to the size of a large beach ball. “Please stop it.” She pleaded of her servant and he replied. “I can’t my queen, for you are the one doing it.” Snapping her out of her sorrow Rika looked at to her hands an in them she held the helium tank her hand frantically turning the valve. <br>\r\n<br>\r\n“What am I doing? Stop it! Just Stop…it!” she cried but her hands would not listen. Her belly had inflated to a size that dwarfed her, and with its immense size it started to carry her into the air. <br>\r\n<br>\r\nShe felt alone and scared as an ominous shadow loomed over her oppressively.<br>\r\n<br>\r\n“To think that my daughter would want to be a fat balloon.” The shadow scoffed insultingly. “Mom!” Rika said confused.<br>\r\n<br>\r\nRika jerked awake in a cold sweat, breathing heavily, and red in the face, she took a second to compose herself as she took in her surroundings. “That Gogglehead is going to get a smack for that weird ass wet dream.” She said as she wondered why he was in those sorts of dreams for her at all. <br>\r\n<br>\r\nAs Rika slowly had her way to her bathroom to freshen up, she came to a shocking discovery. “What the hell?” Rika could see in her mirror that her stomach had barely shrunk at all from yesterdays feast. It was smaller but still big enough that she looked to be well into the second trimester of a pregnancy. “This is impossible! I knew that I would gain some weight from yesterday, but not like this.” She thought worrying about what her mother would think. “It’s like every pound of fat went straight to my gut.”<br>\r\n<br>\r\n“What am I going to do? I can’t let my mom see me like this. I need to get out of here.” She reasoned as she put on a loose shirt and skirt and prepared to sneak out of the house.<br>\r\n</span></div></div>",
            "created":1550297220,
            "id":2618352,
            "title":"Rika dreams"
        },
        "11123111121212222121112":{
            "author_id":"furulu",
            "author_name":"furulu",
            "choices":[
                "She finished, and wakes up the next day unaware of what happened",
                "She wakes up during the stuffing"
            ],
            "content":"<div class=\"\"><div> <span>Takato was no scientist or nutritionist, so he really didn't know much about people's metabolism, and he'd rather not risk it. What he did know was that more sweets meant more fat, which meant more belly. Takato stared at the pale dome that was Rika's bloated midsection. It was taut but still soft, and he knew it would only get softer and bigger the more she ate. That's what he wanted to see, and the more he looked at it, the more sure he was: After seeing her like this, Takato didn't want Rika to get fatter, He needed her to. He needed to see that belly grow bigger and rounder, and to see the red-haired girl become softer and chubbier.<br>\r\n<br>\r\nTakato had also noticed that, while still bossy and strong-willed, Rika seemed to become nicer when she was stuffed, more mellow. Also, the look of helplessness she had when she was completely stuffed stirred something inside him. Perhaps, is he got Rika to be ome, well, fat, she would be like that more often. Also, she looked just so cute...<br>\r\n<br>\r\nWith his mind made up, Takato headed to the kitchen and got ready a couple dozen donuts. She took one of them, chocolate covered, and waved it in front of Rika's rounding face. The plump tomboy stirred a little, and moved her head around a little, looking for the source of the smell. Takato could see her licking her lips as her mouth watered, and her face acquired a hungry but desperate look. A<br>\r\n<br>\r\nTakato was delighted by her reaction, and complied, putting the pastry on her lips. Rika opened her mouth widely and devoured the confection. This donut was followed by another, and then by another dozen. Takato soon started to see her bloated belly grow slightly, and his eyes widened as Rika's hands moved to her belly and started rubbing it, as the girl let out a soft moan.<br>\r\n<br>\r\nEverything was going even better than Takato had expected, and he resolved to have her eat the second dozen too.<br>\r\n<br>\r\nRika kept eating, until...</span></div></div>",
            "created":1379134800,
            "id":1662863,
            "title":"Feed Rika in her sleep"
        },
        "111231111212122221211121":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "The bath and Archimedes Principle",
                "Mrs. Matsuki is pleased with Rika's progress."
            ],
            "content":"<div class=\"\"><div> <span>Rika groggily woke up as her rumbling belly demanded to be fed.She sat up and cast off her blanket and then sat on the edge of her...... wait.<br>\r\n<br>\r\nShe looked around and suddenly realized that she was not in her bedroom, she wasn't even in her house; she was in the Matsuki's living room! She looked down at her hungry belly, now a big ball flesh after digesting her enormous meal yesterday; It was so big that she knew her shirt had no hope of trying to cover it.<br>\r\n<br>\r\n\"Good morning Rika.\"<br>\r\n<br>\r\nRika turned to see Mrs. Matsuki coming in with a huge tray that her arms were just barely long enough to carry. On the tray was a huge spread of eggs, sausages, bacon, bread, jam, and bagels.<br>\r\n<br>\r\nMorning? It was Morning! She had come in at lunch time! Did she eat herself into a mini coma?<br>\r\n<br>\r\nRika blushed and didn't meet her employer's gaze. She felt so ashamed.<br>\r\n<br>\r\n\"Takato told me what happened yesterday\" Mrs. Matsuki said as she placed the tray down.<br>\r\n<br>\r\n\"He, he did\", Rika asked nervously?<br>\r\n<br>\r\n\"Yes he told me you came in yesterday wanting to work but we weren't home. I'm really sorry about that I forgot to tell you we were taking yesterday off, but I'm so happy to know I have such a dedicated employee, one who insists on working even on her day off, so I thought that the least I could do after you worked yourself into exhaustion was let you spend the night peacefully and feed you a nice hearty breakfast. Don't worry I phoned your grandmother so everything's fine. Now eat up, you have more work to do today. Oh, and feel free to use the bath after.\"<br>\r\n<br>\r\nAs Mrs. Matsuki left Rika sat in stunned silence. Had Takato convinced his parents that her huge display of gluttony was her working? She grudgingly realized that she owed him big time, even more than she originally thought.<br>\r\n<br>\r\nHer rumbling belly was quick to remind her that there was breakfast lying in front of her and it was keen to begin. Not wanting Mrs. Matsuki's hard work to go to waste, despite being slightly intimidated by the huge spread, Rika dug in.<br>\r\n<br>\r\nHe started on the eggs, of which there were many forms. Scrambled, omelets, sunny side up, and it was all delicious. The eggs alone was more than she ever ate for breakfast, enough for a whole family for breakfast, but she had barely put a dent in the huge spread and her belly was eager for more.<br>\r\n<br>\r\nHer greed taking over, much as it did during 'work', she alternated between ham, handfuls of succulent sausages, and strips of crispy bacon, it was all soooo gooooooood.<br>\r\n<br>\r\nShe finished off the breakfast meats and took a moment to lean back and rub her belly. It was quite satisfied, but there was still more food on the tray that had yet to be eaten, and she wasn't going to leave it.<br>\r\n<br>\r\nShe took a bagel in one hand, a slice of bread in the other dipped them both in the jam and then devoured them both. She repeated this process until she finally finished off the last of the food.<br>\r\n<br>\r\nShe leaned back once more and placed a hand on top of her rounding belly, feeling content and full, suddenly not caring about her state. Being in unfitting clothes, her face and belly covered in stains from breakfast and the previous day, etcetera.<br>\r\n<br>\r\n\"There's a good girl\", Mrs. Matsuki said as she came back into the room. \"A good girl always eats everything put in front of her, and breakfast is the most important meal of the day.\"<br>\r\n<br>\r\n\"Now go ahead and use the bath, I'll try and get something for you to wear. Really those clothes are too small for a girl your age anyway.\"<br>\r\n<br>\r\nRika's cheeks turned pink at the mention of her clothes no longer fitting, but she was right and she did need a bath. She slowly got up, using quite a bit more strength than she was used to and then waddled to the stairs and went up to the bath while Mrs. Matsuki took care of the dishes from breakfast.</span></div></div>",
            "created":1379394000,
            "id":1664516,
            "title":"Dedicated employee"
        },
        "1112311112121222212111211":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Mrs. Matsuki has supersized pastries for Rika",
                "Takato gets an eyeful of Rika"
            ],
            "content":"<div class=\"\"><div> <span>The sound of rushing water filled the bathroom as Rika began to fill up the bathtub. She really did feel filthy so she was eager to bathe but at the same time, she was feeling a bit ashamed.<br>\r\n<br>\r\nShe had made a complete pig of herself in front of her employer, definitely not a good thing, even if Mrs. Matsuki only seemed encouraged by it, Rika couldn't help but feel that Takato's white lie had been the reason and she didn't want to have to rely on such things.<br>\r\n<br>\r\nRika removed her ill-fitting clothes, tossing them in a pile near the door, wearing only her panties and undershirt. She frowned at her reflection in the mirror and pinched the muffin top over her panties. She really was coming to realize that she was gaining weight and a lot of it. Her tummy stuck out over an inch beyond the waistband of her panties, and her bottom was lush and round. She gave it a light slap and grimaced as she watched it jiggle.<br>\r\n<br>\r\nShe stuck her index finger into her belly button, feeling how deep it was, an indication of just how much she had fattened. Her legs and arms with noticeably puffier as well. She didn't seem to have gained any on her face but at the rate she was going she doubted it would be long.<br>\r\n<br>\r\nShe turned off the tap on the tub once it had filled to the extent she usually filled a tub and then removed her remaining clothing to slip into the bath.<br>\r\n<br>\r\nShe sat down in the tub, blushing as she felt her butt rub against the sides and then inhaled sharply as the water in the tub got perilously close to the top. That shouldn't be! She hadn't filled up the tub any more than usual. Her cheeks turned red as she realized that she was the thing there was more of than usual.<br>\r\n<br>\r\n\"I really am fat.\" She muttered to herself, starting to scrub the stains off of her body, blushing as she felt the squishiness of her body.<br>\r\n<br>\r\nThere was a knock at the door and then Mrs. Matsuki came into the bathroom, a bundle of clothes in her arms. \"I've brought you some fitting clothes Rika.\" She placed them on the floor.  \"Are you doing alright?\"<br>\r\n<br>\r\n\"Uh... yeah... I am. Sorry for the trouble.\"<br>\r\n<br>\r\nMrs. Matsuki chuckled. \"Nonsense, I'm happy to help, and besides that, a young girl like you needs to grow as much as she can.\"<br>\r\n<br>\r\n'I'm not sure that's the kind of growing I should be doing.' Rika thought to herself.<br>\r\n<br>\r\n\"Well once you're out of the bath, I'll get things set up for your work. Don't be too long Rika.\" Mrs. Matsuki left the room and shut the door behind her.<br>\r\n<br>\r\nRika sighed and leaned back in the tub. \"Work\" she murmured. \"Well, I guess I can't blame my job for that. It's my own fault for being a pig. I mean, it is a job and it wasn't paid time where I got this big.\" She sighed. \"Well I guess I better get washed up.\"<br>\r\n<br>\r\nRika washed herself up quickly and then tried to put on her new clothes. The panties were a soft white cotton and the undershirt was the same white. All quite comfy for her and they fit nicely. The shirt was a large white t-shirt that was actually big on her, and for bottoms she had some stretchy gray shorts. \"Welp, off to work I guess.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1467923940,
            "id":2176862,
            "title":"The bath and Archimedes Principle"
        },
        "1112311112121222212111212":{
            "author_id":"furulu",
            "author_name":"furulu",
            "choices":[
                "Mrs. Matsuki's brings the clothes to Rika",
                "Rika in the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Matsuki had been pleasantly surprised to hear from Takato that Rika ad demanded that he baked for her, even though the bakery was closed. The redhead tomboy was turning out to be quite the glutton, especially once that pesky exercising was out of the way. Not only that, but judging from Rika's state, yesterday's binge had been the greatest one yet, and even though it didn't contain Mrs. Matsuki's \"special ingredient\", she still went to sleep right afterwards. It seemed like the girl had already become slothful enough that she didn't need to spike her food. It was no wonder, really, Mrs. Matsuki only needed one look to see that her plan was working even better than she had expected:<br>\r\n<br>\r\nRika had completely outgrown her jeans, as she started to develop thick thunder thighs, wide hips, and a jiggly bubble butt, making her look somewhat pear-shaped, although her belly wasn't far behind. Rika had developed a chubby, slightly bouncy paunch that stuck out a bit  (perhaps still a bit bloated), and formed small love handles above her tight panties, and that wouldn't be fully covered by any of her current t-shirts. Rika's breast had grown, ever so slightly, barely enough to make her go up a cup from her original size. The girl's arms had lost definition, and her face had softened, and was starting to develop a double chin, as it became rounder. <br>\r\n<br>\r\nMrs. Matsuki was very happy with Rika's new look; the girl was now definitively into \"chubby\" territory, and had probably gained around 30 pounds since she started working at the bakery, maybe more, given yesterday's huge meal. Now it was just a matter of continuing, and it seemed easy. With any luck, Takato would soon b affected by his friend's habits, and put on a few pounds himself.<br>\r\n<br>\r\nFirst order of business, though, was getting Rika some decent clothes. Mrs. Matsuki might have been fattening up the girl, but in truth she liked her, and she didn't want her to go around town half naked because she was getting deliciously chubby, even if the tight clothes had a certain appeal. No, Mrs. Matsuki would get Rika something cute to wear after she left the shower, she was sure Rika would appreciate it, and Takato might too.<br>\r\n<br>\r\nWhat comes next?</span></div></div>",
            "created":1379394000,
            "id":1664590,
            "title":"Mrs. Matsuki is pleased with Rika's progress."
        },
        "11123111121212222122":{
            "choices":[
                "Without the special ingredient, Rika can't finish, and Takato has to help her.",
                "Rika experiences some trouble with her clothes."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else might happen?</span></div></span></div>",
            "created":1357016400,
            "id":1499798,
            "title":"Other options"
        },
        "111231111212122221222":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika eats the cake",
                "Rika needs help with her wardrobe"
            ],
            "content":"<div class=\"\"><div> <span>Takato waited anxiously as the cake baked in the oven. He had never felt so in need of sweets as he did right then; unfortunately the sweets weren't for him.<br>\r\n<br>\r\nIn the other room Rika was devouring the dounts that had been left over from yesterday. Although they were a tad stale Rika was too hungry to care and they were the only donuts left.<br>\r\n<br>\r\nWith ten minutes left to go before the cake was finished Takato nervously went back to check on his ravenous guest.<br>\r\n<br>\r\nRika sat at the counter, a set of trays arrayed in front of her that just ten minutes ago had been piled full of the day old pastries, but now only one of them remained.<br>\r\n<br>\r\nRika herself was in quite a state, one that Takato would not have believed just twenty minutes ago, not even in a million years.<br>\r\n<br>\r\nRika's face was covered in frosting, mostly chocolate; and the crumbs and sprinkles from the donuts stuck to it, creating a messy ring of debris around her mouth. However her most striking thing, adorned her middle.<br>\r\n<br>\r\nRika's belly had grown significantly, forcing her shirt up until it simply rested on top and exposed her gut completely. Takato's point of view showed him her side, displaying just how far her belly stuck out. It's tremendous girth covered half of her thighs, and now that Rika was gorging on the last of the donuts she, it would only grow larger. Still, unilke the fatty aprons that he had seen on most obese girls, Rika's belly appeared to be a soft but held it's shape well. Not unilke some kinds of dough. Yes that was perhaps the best way to describe it: A big ball of dough.<br>\r\n<br>\r\nFrom his viewpoint Takato noticed something else as well. Rika had a muffin top going the rest of the way around her waist as her jeans struggled to contain the her increased mass. Looking back at her belly it looked like her jeans were still done up! Wasn't she uncomfortable? Was she so drunk with hunger that she didn't even notice?<br>\r\n<br>\r\nTentatively Takato stepped towards her. \"Uhhhhh, Rika?\"<br>\r\n<br>\r\nSuddenly there was a loud snap, followed quickly by the ping of the button on Rika's jeans ricocheting off the counter wooden facade. The button flew between Rika's legs and then the legs of the chair she was siting on before finally stopping on the floor of the bakery.<br>\r\n<br>\r\nTakato went and picked up the button and then tentatively looked back at Rika.<br>\r\n<br>\r\nRika had realized instantly what had transpired as it happened. Her face was red, but not from embarassement, of pleasure. Rika ran her hands over her belly, which now looked even more like a ball of flesh, freed from the constrainsts of Rika's jeans. Rika had obviously been in pain a moment ago, and was now experiancing the rapture of her freed belly. Her soiled fringers left streaks and stains on her otherwise pristine, white belly.<br>\r\n<br>\r\nTakato stood there for a good few moments, watching her rub and soothe her aching belly, oblivious to his presence. Seeing her rub her belly like that reminded him of a mother rubbing her preagnant belly. Looking at it that way Rika, despite Rika's deshelved appearance, the whole scene was quite, surreal, alluring in a way.<br>\r\n<br>\r\nA few heartbeats later Rika finally noticed him and her face turned beet red.<br>\r\n<br>\r\nTakato tried to think of a way out of this situation, something that would save him from a terrible beating. As big as Rika was now, he was sure that she could still catch him if she was angry enough, and if he didn't come up with something very soon, that was exactly what was going to happen.<br>\r\n<br>\r\n\"Y-y-you look really cute!\"<br>\r\n<br>\r\nIt was probably the dumbest thing he could say, not the worst, but probably the dumbest.<br>\r\n<br>\r\nRika jsut looked stunned, and more than a little perplexed. He wasn't sure she bought what he said, but if he took it back now he's really be in trouble.<br>\r\n<br>\r\n\"R-really, look really cute. Don't worry abou looking messy, caus even kids can look cute when they're all messed up.<br>\r\n<br>\r\nRika looked at him strangely for a moment and then looked down at herself, taking account of her appearance.<br>\r\n<br>\r\nShe finished up with a good long look at her large gut then looked back at him.<br>\r\n<br>\r\n\"You think I'm cute?\"<br>\r\n<br>\r\nTakato swallowed nervously.<br>\r\n<br>\r\n<br>\r\n\"Y-yeah, I always thought you looked cute Rika.\"<br>\r\n<br>\r\nShe narrowed her eyes at him. \"Then how come you never asked me out?\"<br>\r\n<br>\r\nNow it was Takato's turn to be surprised.<br>\r\n<br>\r\nTrue he did have a bit of a crush on her, but he didn't think he'd have a snowballs chance in hell with her.<br>\r\n<br>\r\n\"I-I didn't think you would be interested in me.\" He confessed.<br>\r\n<br>\r\n\"You never asked me\", Rika replied, slightly upset.<br>\r\n<br>\r\nTakato scratched the back of his head, not sure what to say.<br>\r\n<br>\r\nRika looked away from him, with her hands resting on her belly.<br>\r\n<br>\r\nTakato decided to focus his mind on the main issue here. Rika's pants could no longer do their job properly. They would likely stay up since they were still quite snug, enough to probably keep them up, but with her belly so exposed Takato doubted she'd be able to get away with being seen like that in public.<br>\r\n<br>\r\nA ringing sound interrupted his thoughts and in a near panic he ran back to the bakery kitchen to retrieve the cake from the oven.<br>\r\n<br>\r\nHe took the cake out of the oven and set it down on the table to cool.<br>\r\n<br>\r\nHe looked up and say Rika standing there, looking at it, holding her belly, almost like she was carrying it.<br>\r\n<br>\r\nShe looked up at him, and Takato wondered if she was seriously going to eat that whole cake.</span></div></div>",
            "created":1367298000,
            "id":1581586,
            "title":"Rika's jeans"
        },
        "1112311112121222212221":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika takes a cab home",
                "Rika sleeps at the bakery"
            ],
            "content":"<div class=\"\"><div> <span>For a few moments Rika simply stood, alternating her gaze between Takato and the cake, as if she was trying to make up her mind about something.<br>\r\n<br>\r\nFinally she down in one of the chairs and looked at him with serious eyes and a hint of pink of her cheeks.<br>\r\n<br>\r\n\"Feed me.\"<br>\r\n<br>\r\nTakato did a double take. Was she asking him to hand feed the cake?<br>\r\n<br>\r\nHer expectant look seemed to give him the answer and her was about to go and get a plate and fork but then he remembered how impatient and ravenous Rika had been. So he simply got a knife to cut the cake into slices and then used a small plate to hold it. He brought it over to Rika who's lips were curved ever so slightly in a smile.<br>\r\n<br>\r\nHe brought the plate close to her face and then picked up the slice in his hand and brought it to her mouth.<br>\r\n<br>\r\nRika bit into the cake and moaned pleasantly as she tasted the creamy chocolate and worked it around in her mouth before swallowing.<br>\r\n<br>\r\n\"Yummmmm, oh, this cake is good.\"<br>\r\n<br>\r\nTakato smiled, glad she was enjoying it. \"It's an old family recipe.\"<br>\r\n<br>\r\nRika licked her lips and rubbed the top of her belly as Takato moved the slice to her mouth again.<br>\r\n<br>\r\nTakao had to admit there was something about this that he enjoyed. She wasn't rushing or being forceful, she just seemed so.... content. So happy to simply sit on the chair and be fed delicious cake. He liked this Rika much more than the demanding girl she had been earlier.<br>\r\n<br>\r\nHe slowly fed her the cake and she savored every bite. <br>\r\n<br>\r\nHalfway through he found himself starting to rub her belly. It was so soft to the touch and felt like a giant marshmallow.<br>\r\n<br>\r\nRika moaned as he ran his hands along her gut, it's taught pale skin making it easy for his hands to glide over.<br>\r\n<br>\r\nHer stained face now smiled broadly at him whenever he brought her a new slice to eat, and her eyes lit up at him as he brought the slice to her mouth.<br>\r\n<br>\r\nFinally the last piece of cake slipped past her lips and went down her throat and she moaned softly and relaxed in her chair, patting her belly, her eyelids sliding closed dreamily.<br>\r\n<br>\r\n\"Yummmmm, that was good.\" She moaned. <br>\r\n<br>\r\n\"A-are you full now?\" Takato asked.<br>\r\n<br>\r\n\"Stuffed\" she replied. \"So, you like girls with big bellies eh?\"<br>\r\n<br>\r\nTakato's face turned red. \"N-no that's not- I mean, not necessarily. Wha-what I mean is that I thought you were cute before too.\"<br>\r\n<br>\r\n\"But you seemed to like rubbing my belly an awful lot.\" she said with a grin.<br>\r\n<br>\r\nTakato's face turned even redder. \"We-well yeah I... um.\"<br>\r\n<br>\r\nShe laughed. \"Relax Takato, I'm not upset. Actually I'm happy. It means that I can still show my face around here without you trying to haggle me.\"<br>\r\n<br>\r\n\"Oh I wouldn't' do that.\"<br>\r\n<br>\r\n\"Heh, I know you wouldn't, but it's great for piece of mind.\"<br>\r\n<br>\r\nShe yawned. \"Ugh, I'll never make it home like this\", she said cradling her belly in her hands. It almost reached her knees and had pushed her stained shirt all the was up to her chest. \"Maybe I'll just call a cab.\"<br>\r\n<br>\r\nTakato blushed a bit. \"Umm.... well my parents won't be back for quite a while, so you can sleep here if you want. If you don't mind my bed.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1391317200,
            "id":1737699,
            "title":"Rika eats the cake"
        },
        "11123111121212222122212":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Rika wakes up for Dinner",
                "Rika doesn't wake up till breakfast"
            ],
            "content":"<div class=\"\"><div> <span>Rika paused and took a moment to consider Takato's offer. Certainly in her current disheveled state she's rather not go out in public even if it was just too and from the cab, but being in a cab in such a state wasn't appealing either. Perhaps if she spent the night her bloated belly would digest the huge amount of food inside it, enough to maybe let her keep her pants on. Well assuming she could sow the button on it again.<br>\r\n<br>\r\n\"W-well I guess I am pretty tired.\" She admitted. \"Alright, I'll take you up on your offer.\"<br>\r\n<br>\r\n\"Okay then. Uh.... do you want to take a bath or a shower first?\"<br>\r\n<br>\r\nRika paused and looked over herself. Her pale dome belly was streaked with chocolate from her fingers which themselves were quite soiled. Thinking back over her earlier behavior she imagine her face was quite a mess too and she spotted a few dark spots on her shirt, probably chocolate stains.<br>\r\n<br>\r\n\"Yeah, that might be best but.... I don't have anything fresh to wear.\"<br>\r\n<br>\r\n\"Mom got some clothes for you. She figured with you working here there might be a time you'd end up stuck. You know like in an earth quake or bad weather. I can go get it for you.\"<br>\r\n<br>\r\n\"Sure you go ahead I'll get the bath ready myself.\"<br>\r\n<br>\r\nTakato nodded and walked over to the store room to retrieve the clothes leaving Rika to pick herself up and make her way to the bathroom.<br>\r\n<br>\r\nShe grunted and gritted her teeth as she worked to stand on her feet, her new weight making it difficult. True that cake wasn't as much extra weight as the donuts but getting up from the stool had been much easier than the lower lying chair. Still she managed to stand up without too much trouble but she had to quickly grab her jeans to keep them from falling to her ankles.<br>\r\n<br>\r\nShe exhaled in relief, finally back on her feet and put a hand on her belly, feeling it wobble slightly. Using one hand to hold up her pants and one to hold her belly she started waddled her way over to the stairs, feeling and hearing the contents of her belly slosh around as she did.<br>\r\n<br>\r\nThe stairs were a much greater obstacle, and she had to move one hand from her belly to grab the railing and steady herself. With ever step she took her knee banged into the underside of her belly in spite of how firm it was and how surprisingly little it sagged. After all it stuck out a foot from her body with all the liquids and sweets she'd eaten and it sloshed about much more now that she didn't have a hand to keep it steady and every time her knee hit it, her belly wobbled severely.<br>\r\n<br>\r\nEvery step took effort and by the time she was halfway up, a grunt as well, so by the time she reached the top of the stairs she was panting, and was more than a bit worn out. All that effort eating, digesting and then hauling her greater weight up the stairs she was winded.<br>\r\n<br>\r\nShe walked over to the bathroom and started the water to fill up the tub. Next she grabbed some toilet paper and started to wipe the dark finger streaks of chocolate off her belly and then did the same to her face. She looked at herself in the mirror and then flinched when she felt her belly press against the counter, surprising her. Sighing she ignored it for now and cleaned most of the chocolate off her face.<br>\r\n<br>\r\nTakato entered almost immediately afterwards carrying a bundle of clothing and then setting it down on the floor near the entrance. \"These are the clothes she said to use; took me a while to dig them out. Things tend to move around a lot in the store room.\"<br>\r\n<br>\r\n\"Thanks Takato.\"<br>\r\n<br>\r\n\"And if you need anything else I'll be downstairs.\"<br>\r\n<br>\r\nTakato left, shutting the door behind him, leaving Rika to tend to herself. She quickly removed her clothes and tossed them aside, leaving her new form naked for the first time. She didn't look at herself too much in the mirror, just enough to realize how big she really looked. She looked like she swallowed a basket ball and then a few pounds of marshmallows on top of that.<br>\r\n<br>\r\nPushing that thought aside for the moment she shut off the water and then slipped into the tub, sighing in relief as the warm water soothed her aching body and belly which poked up out of the water like a pale flesh island. She couldn't help but run her hands over it and feel the smooth skin, taught from its swelling.<br>\r\n<br>\r\nShe wondered how she'd been able to eat so much and what made her so hungry in the first place. She had a feeling it had to do with routine. Her body was so used to being filled with sugary sweets on a regular basis that the thought of going without ingesting a large amount of food had thrown her into a desperate rage. She'd have to watch that in the future or she wouldn't be able to do her tasting job properly, not to mention how embarrassing it was. Then again she had discovered that Takato was fond of her, certainly fond of her belly.<br>\r\n<br>\r\nShe wrapped her hands around it, feeling its size and mass, and running her index finger around the perimeter of her deep belly button. She had to admit that she did kind of like it, the feeling of having a nice full belly that is, she wasn't a fan of the extra effort it took to move around but she had to admit, the feeling of it had appeal.<br>\r\n<br>\r\nShe pondered these things as she washed herself up and then got out and dried herself. She went over to the clothes Takato had brought and found a pair of stretchy blue pants that were quite comfortable when she put them on and plain white tshirt that was quite baggy. Rika couldn't help but think that Mrs. Matsuki had anticipated Rika growing to some degree from her job as a tester.<br>\r\n<br>\r\nShe slipped out of the bathroom and carried her old clothes to Takato's bedroom, placing them near the door before flopping down on the bed and wincing as she heard it creak. She slipped herself under the covers and blushed upon seeing the hill her belly made in them as they draped over her. Sighing, she let her hair down and then plopped her head on the pillow, gradually falling asleep, unconsciously rubbing her gurgling belly as it digested.</span></div></div>",
            "created":1415941200,
            "id":1886243,
            "title":"Rika sleeps at the bakery"
        },
        "111231111212122221222121":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Time for Dessert",
                "Rika eats more dinner"
            ],
            "content":"<div class=\"\"><div> <span>Rika yawned and stretched as she woke. She found herself in a bed that wasn't hers and in a room that wasn't hers either. 'Oh right, it's Takato's room.' she remembered.<br>\r\n<br>\r\nGroaning she struggled to sit up, needing to push herself up with her hands to overcome the weight of her belly. It did seem to have digested most of the food she had eaten, but it was still quite large, now covered with fat instead of bloated with food. She rubbed the side of it and smiled a little as she felt the wonderful softness of her belly. No wonder Takato liked it, but of course, he didn't have to lug it around.<br>\r\n<br>\r\nSuddenly a wonderful delicious scent began tickling her nostrils; food freshly cooked. She looked at Takato's alarm clock that read 6:00 PM. \"Guess it is dinner time.\" Her belly let out a low growl and she felt the familiar pangs of hunger. \"Well I guess I shouldn't just eat sweets, I should eat proper meals too.\" She grinned.<br>\r\n<br>\r\nShe swung her legs out over the side of the bed and then with a mighty shove, pushed herself up to her feet. She wobbled a little but quickly stabilized and put a hand on her belly. \"Okay, now time to go eat.\"<br>\r\n<br>\r\nDownstairs she entered the dining room and stopped. There was a huge pot on the table with a large ladle in it. It had to be full, surely it was.<br>\r\n<br>\r\n\"Oh, Rika. Sleep well?\" Rika turned and looked at Takato who was wearing a large white apron. \"I uh, figured you'd be hungry for dinner so I made this for you.\" He gestured to the large pot. \"Um, you hungry?\"<br>\r\n<br>\r\nRika grinned. \"You know it. What's in the pot?\"<br>\r\n<br>\r\n\"Chilli. Figured you'd want something that would go down easy.\"<br>\r\n<br>\r\nRika looked at the pot. \"Easy huh? Wanna try something for me.\" Takato blinked<br>\r\n<br>\r\n\"Huh? Uh, sure. What?\"<br>\r\n<br>\r\nRika sat in the chair nearest to the pot and licked her lips. \"I want you to pour the pot into my mouth.\" Takato swallowed nervously.<br>\r\n<br>\r\n\"Are you sure? Can you even eat that fast?\" Rika snorted.<br>\r\n<br>\r\n\"Course I can. I decided that since you like my belly so much, I don't have to hold back and I can go full hog.\" She patted the top of her belly. \"Now you'll see how well I can pig out.\" She winked at him, eliciting a blush from Takato. <br>\r\n<br>\r\n\"O-okay Rika. If you're sure.\"<br>\r\n<br>\r\n\"I'm sure. Now lay it on me!\"<br>\r\n<br>\r\nTakato anxiously walked over to the pot and lifted it off of the table. Rika leaned her head back and opened her mouth as wide as she could. Takato tilted the pot and the chilli began pouring out and into the hungry redhead's mouth.<br>\r\n<br>\r\nRika moaned and put both hands on her belly as the chilli was poured into her mouth and slid down into her gut, feeling herself expand as the pot was emptied into her. It felt so good, so amazing to be stuffed so rapidly, feeling herself get bigger and bigger.<br>\r\n<br>\r\nTakato stopped pouring the pot and set it on the table. \"All gone Rika. Wow you sure are amazing. I didn't think something like that was possible.\"<br>\r\n<br>\r\nRika licked the bits of chilli off her face and let out a loud belch. \"Oooh, yeah it was really tasty. You're  a pretty decent cook too.\"<br>\r\n<br>\r\nTakato rubbed the back of his head nervously. \"Yeah well I can't make much different stuff but I can make a few things.\"<br>\r\n<br>\r\nRika leaned back in the chair and rubbed the side of her gut. \"Well then as a reward, you can rub my belly again.\" Takato gulped and his cheeks turned pink. Still, she was offering and he had done it before.<br>\r\n<br>\r\nReaching out his hand he tenderly placed it on the top of her belly and began to rub. Rika cooed softly as he rubbed and gooseflesh prickled her skin. <br>\r\n<br>\r\n\"Mmmmm feels good.\" Takato managed a small smile of his own. <br>\r\n<br>\r\n\"Yeah, it's so soft and warm. You're really amazing Rika.\"<br>\r\n<br>\r\nRika grinned. \"Of course I am. And I'll only get more amazing as I get bigger.\"</span></div></div>",
            "created":1467931200,
            "id":2176892,
            "title":"Rika wakes up for Dinner"
        },
        "11123112":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "She didn't meet anybody till she got home.",
                "Unfortunately, one of her friends found her..."
            ],
            "content":"<div class=\"\"><div> <span>After saying goodbye to each other, Rika set out for home, grasping her belly that was stuck out from her shirt. She also unbuttoned her pants in the middle of a taste testing, but she's too dazed to notice that she wasn't re-buttoning it yet.<br>\r\n<br>\r\n\"So heavy...ugh! I surely can't eat anymore today.\"  The redheaded girl panted from feeling of fullness. Then she accidentally let out a loud, wet belch. She felt a burning shame, put her hand over her mouth, and looked around. Luckily there was nobody about.<br>\r\n<br>\r\n\"I hope *<i>Burrp</i>* no one sees me of now...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1348376400,
            "id":1433344,
            "title":"Stuffed tomboy"
        },
        "111231122":{
            "choices":[
                "Henry and terriermon",
                "Takato"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The digimon queen walked down the street, rubbing her painfully full belly, when she heard a familiar voice.<br>\r\n<br>\r\n\"Rika, is that you?\" The voice said behind her. The stuffed redhead turned around to see...</span></div></span></div>",
            "created":1348894800,
            "id":1436980,
            "title":"Unfortunately, one of her friends found her..."
        },
        "1112311221":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Worried about her condition, Henry follows Rika to her home.",
                "Worried about her condition, Henry gives Rika some advice."
            ],
            "content":"<div class=\"\"><div> <span>“Ah, it’s you two…” Rika said. \"What’s up?\"<br>\r\n<br>\r\nHenry frowned. \"That's what I want to say, Rika. You look a little awkwa...\" Then he noticed her bloated and slightly exposed belly. \"R-Rika!! What just happen to you!?\"<br>\r\n<br>\r\n“Don't shout, Brainiac. I can hear you.” She sighed wearily. “Takato’s mother asked me to be the bakery's taste tester, so I undertook it. And *<i><font class=\"size2\" style=\"\">Urp</font></i>* frankly speaking, I overdid it. That’s all.” She said gruffly to hide the fact that she felt ashamed.<br>\r\n<br>\r\n\"I-I see,\" Henry gave a vague answer. He didn't want to arouse her displeasure by his unnecessary comment. “I hope you are not too tired.” <br>\r\n<br>\r\nTerriermon suddenly jump down from Henry’s shoulder and interrupted their conversation. “Yeah, and I hope you are not too fat!” Before Rika replies, Terriermon poked her belly. \"Wow, it's taut!\"<br>\r\n<br>\r\n\"You...\" The redhead's eyes flashed with anger, but then she shut her mouth, trying to hold another big belch in the stomach.<br>\r\n<br>\r\nHenry dragged terriermon away from Rika hastily. \"T-Terriermon! Don't be rude to her! Sorry Rika.\"<br>\r\n<br>\r\nShe opened her mouth in spite of herself. \"Never min- <i><font class=\"size35\" style=\"\">Buurrp!</font></i>\". Her cheeks flamed up vividly.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1349067600,
            "id":1438178,
            "title":"Henry and terriermon"
        },
        "1112311222":{
            "author_id":"biganime18",
            "author_name":"monster child",
            "choices":[
                "next day at the bakery.",
                "next day at the bakery."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh hey Takato thought i would have seen you today.\" She said facing him still rubbing her stomach and blushing slightly due to the that he might have heard her belch.<br>\r\n<br>\r\n\"Oh really why's that?\" He asked trying not to look at her rub her stomach.<br>\r\n<br>\r\n\"I was taste testing for your mom all day.\" She replied feeling another belch trying to slip up her throat thankfully stopping it from getting out.<br>\r\n<br>\r\n\"um yeah you do seam a bit bloated.\" Takato said carefully.<br>\r\n<br>\r\n\"thanks to your mom and her great cooking skills.\" rika said blushing from Takato's comment.<br>\r\n<br>\r\nboth teens didnt know what to say dua to awkward conversation so they both said by and to there own home's.</span></div></div>",
            "created":1348981200,
            "id":1437861,
            "title":"Takato"
        },
        "113":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic",
                "Force"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Weight Gain for Rika Nonaka?</span></div></span></div>",
            "created":1313038800,
            "id":1166115,
            "title":"Rika Nonaka"
        },
        "1131":{
            "choices":[
                "Thin",
                "Chubby (say, 20 pounds heavier than in the show)",
                "Fat (around 50 pounds heavier than in the show)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good old-fashioned eating, my favorite. But tell me, how should Rika start off?</span></div></span></div>",
            "created":1331355600,
            "id":1292050,
            "title":"Eating"
        },
        "11311":{
            "choices":[
                "Rika eats a lot of cookies, you decide exactly how many.",
                "Rika starts eating, but someone knocks at the door"
            ],
            "content":"<div class=\"\"><div> <span>\"This is so boring!\" Rika exclaimed, laying on her room's floor. There was a variety of Digimon trading cards laying around her. <br>\r\n<br>\r\n\"What is, Rika?\" asked her vulpine partner, appearing from the shadows.<br>\r\n<br>\r\n\"This! There's no enemy, no bioemergences, no anything!\" Rika picked up a card from the floor,\"Playing the game and making new decks is just not what it used to now that I've seen the real deal.\"<br>\r\n<br>\r\n\"Should we go ask one of the others for a sparring match?\" Renamon suggested.<br>\r\n<br>\r\nRika left the card down,\"Nah, Brainiac will say no, Gogglehead is working at the bakery, and don't even mention Ryo!\" she replied.<br>\r\n<br>\r\n\"I'm just so bored...\" Rika stared off into space for a few seconds before getting up. \"I'm gonna get a snack; I think grandma was making some of those chocolate cookies of hers.\" With that, Rika left her room. <br>\r\n<br>\r\nAs she approached the kitchen, Rika started salivating at the sweet aroma of her grandmother's chocolate cookies. Rika wouldn't admit it to anybody, probably even to herself, but she loved chocolate, she just couldn't resist it. As part of her tough girl attitude, she had decided sweets weren't for her, and even though she really enjoyed them, more than once she had refused them to keep up her image. Of all these sweets, chocolate was clearly the king.<br>\r\n<br>\r\nRika opened the kitchen door. \"Ah, Grandma, you're making cookies?\" Rika tried to sound surprised.<br>\r\n<br>\r\nHer grandmother's lips formed a knowing smile,\"Yes Rika, they are just ready, take a sit and help yourself.\" she replied while opening the oven to produce a tray full of at least two dozen cookies.<br>\r\n<br>\r\n\"Well, I'm not one for sweets, but since you just made them...\" Rika said, taking a sit. <br>\r\n<br>\r\nNow what?</span></div></div>",
            "created":1331355600,
            "id":1292067,
            "title":"Thin"
        },
        "113111":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "She was curious about it and decided to ask Rika why she ate so many cookies",
                "She likes it and decides to secretly fatten Rika up, since she'd never willingly"
            ],
            "content":"<div class=\"\"><div> <span>Rika let out a moan when she finished, having eaten 2 dozen cookies by herself. There was no denying she was a chocoholic, but it was very apparent now thanks to her crumb covered face and her belly, which had become so bloated it popped her pants button. After undoing her belt though, her stomach grew another 2 inches since it was no longer being restrained. \"Ah... that's better.\" said the young tamer as she rubbed her stomach, her grandmother giggling as she got Rika some milk. \"Goodness, you look like you're having a baby.\" Rika rolled her eyes as she grabbed some milk. \"A food baby, yeah.\" She gulped down the milk happily, semi-aware that Renamon was nearby. She always knew Renamon was near, just in case of an emergency, but she could never figure out what she was doing. In this particular case, Renamon was staring at Rika's small, stuffed belly.</span></div></div>",
            "created":1425445200,
            "id":1943613,
            "title":"Rika eats a lot of cookies, you decide exactly ..."
        },
        "1131111":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Renamon gave her more chocolate, wanting to see how much she can eat",
                "her pants fell to her ankles, unable to stay around her waist"
            ],
            "content":"<div class=\"\"><div> <span>Renamon came out of her hiding place, walking towards her tamer when Rika's Grandma noticed her. \"Oh, hello Renamon, I didn't notice you there.\" \"Hello Seiko, do you mind if I ask you something?\" Rika's Grandma stopped what she was doing to look at the fox Digimon. \"Of course.\" Renamon stood right next to Rika and gave her swollen stomach a poke, her claw barely sinking into the taut dome of flesh when she did. \"How come Rika ate so much? I've never seen her act that way before, and it's an odd sight to behold.\" Seiko couldn't help but let out a chuckle at Renamon's understandable confusion. \"It's because Rika is a chocoholic.\" Renamon just gave a confused look to Rika, hoping she could tell her what it meant. Renamon was smart, but she wasn't entirely knowledgeable on many human matters. \"It means I'm addicted to chocolate.\" Said the stuffed Tamer as she rubbed her stomach while Seiko got something from the fridge.<br>\r\n<br>\r\n\"Mhm. Rika has been addicted to the stuff ever since she was a little girl. She would eat double her weight in chocolate every day if you let her.\" Rika blushed slightly at the claim, being embarrassed by it. \"Grandma, that's not true. I'm not THAT addicted to the stuff.\" With a mischevious grin, Seiko presented Rika with another batch of chocolate chip cookies. \"Oh no?\" She said, leaving them right where they were, and before anyone knew what was happening, Rika, despite already being quite stuffed, began to scarf down the cookies, much to Renamon's amazement. Rika scarfed down the entier batch, her stomach feeling ready to explode if she ate so much as a crumb more. Moaning and rubbing her belly, Rika tried to relax when...</span></div></div>",
            "created":1440219600,
            "id":2024012,
            "title":"She was curious about it and decided to ask Rik..."
        },
        "11311111":{
            "author_id":"sorab4p",
            "author_name":"SoraB4P",
            "choices":[
                "A Television Ad for a Chocolate Ice Cream flavor",
                "Renamon With Even More Chocolate"
            ],
            "content":"<div class=\"\"><div> <span>          Renamon gave her more chocolate, wanting to see how much she could eat. Rika looked up to the offer, moaning a bit as she fixated herself to point directly towards her friend. \"Don't you think I had enough?\" Rika asked, under her groans. She attempted to keep civility inside her, but it was getting increasingly harder as Renamon waved the bar in her face, taunting her about her addiction. Something in Renamon wanted to see her tamer fill up with as much chocolate as possible. \"I think you can handle a couple of bars.\" Renamon boasted with a smile, \"It's just a matter of willpower.\" Rika's temptation got the best of her, as she grabbed a candy bar, scarfing it down without hesitation.<br>\r\n<br>\r\n          A few bars in, and her belly lets out a loud glorping noise, right on her navel was a red hot shine, reflecting the glow of the light above her. With a burp, she managed to speak. \"Oooh...I think I've had enough Renamon...\" Rika groggily states, as Renamon helped her up. Renamon's paws went to Rika's belly, giving it a slow rub. Rika's head fell back a bit, as she lets out a soft sigh of relief. She was paralyzed by the relaxation of her rubs, but something made her feel paralyzed with fear. She looked up, seeing...</span></div></div>",
            "created":1440219600,
            "id":2024095,
            "title":"Temptation"
        },
        "113111112":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Rika ate a bit too much and her stomach explodes (she also somehow survives)",
                "Rika's mother arrived, and she was very pissed off at what Rika was doing"
            ],
            "content":"<div class=\"\"><div> <span>Rika began to get a little worried by her partner giving her so much. Sure, she loved chocolate, but there were 2 problems. A. She was well on the brink of her stomach exploding and B. Her mother would kill her if she found out she had been eating chocolate. but it was just so good, she couldn't control herself. \"Renamon, if I explode, you're cleaning me off the walls.\" She said with a grumble as she grabbed the new chocolate bars and began to cram them into her mouth, much to renamon's amusement. \"Fair enough.\" she said as she watched Rika scarf down bar after bar. But then...</span></div></div>",
            "created":1444107600,
            "id":2044349,
            "title":"Renamon With Even More Chocolate"
        },
        "11311112":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "relax until her belly digests all those cookies",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Her pants fell down, revealing just how big her stomach had gotten. Rika looked like she was having a baby, much to her embarrassment. She got up and tried in vain to pull her pants back up, but they wouldn't fit over her swollen stomach, which made Renamon and Seiko laugh. \"Oh don't worry about it so much dear, it's just us girls here.\" With a sigh, Rika just took her pants off, realizing her Grandma was right. Sure, she was worried about how much weight she might gain, but surely it was nothing a little exercise couldn't fix. So she decided to...</span></div></div>",
            "created":1444107600,
            "id":2044347,
            "title":"her pants fell to her ankles, unable to stay ar..."
        },
        "113112":{
            "author_id":"dbzfan123",
            "author_name":"Logan",
            "choices":[
                "\"I didnt know you like chocolate chip cookies.\"",
                "\"Oh, is this a bad time?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Takato came over at that moment.<br>\r\nTakato: Hey Rika. Me and the others are gonna go see a movie. Wanna come--<br>\r\nHe was cut off by the sight of Rika with a cookie in her maw. What does he say next?</span></div></span></div>",
            "created":1336626000,
            "id":1334144,
            "title":"Secret blown"
        },
        "1131121":{
            "choices":[
                "The others and me are going to catch a movie, you coming?",
                "You know what? I forgot... Is that your grandma with more cookies?"
            ],
            "content":"<div class=\"\"><div> <span>Takato shut up and stared at the image before him. Rika was sitting next to a rather large tray of chocolate chip cookies, munching on one of them with a pretty happy and satisfied look on her face. Apparently she hadn't heard Takato, since she finished her cookie, licked her lips, and reached for another one.<br>\r\n<br>\r\nTakato looked perplexed for a second, before saying \"I didn't know you liked chocolate chips cookies.\" He looked thoughtful for a second, \"In fact, I didn't think you liked chocolate, or any sweets for that matter.\"<br>\r\n<br>\r\nThis time Rika did hear him, as she froze while giving her new cookie a large bite. She turned her head to her fellow tamer as her eyes widened. Quickly, she swallowed her current bite, almost choking in the process, and left the remaining piece on the tray.<br>\r\n<br>\r\n\"A-Ah, chocolate? No, not really. I'm not a very big guy of sweets in general.\" Rika replied as she got up, trying to keep a cool exterior.<br>\r\n<br>\r\nTakato wasn't very convinced. \"You sure? I just saw you eating a couple chocolate chip cookies.\"<br>\r\n<br>\r\n\"Yeah, well, my grandma made them, and I didn't want to make her feel bad.\" Was Rika's excuse.<br>\r\n<br>\r\n\"Really? Because you seemed to be enjoying them...\" Rika blushed slightly as she started to panic. \"Enjoying them a lot, in fact.\"<br>\r\n<br>\r\n\"Wha- Uh, No! I'm telling you I don't like them, Gogglehead, so shut up!\" Rika exclaimed defensively, as her cheeks reddened a bit further.<br>\r\n<br>\r\nTakato was taken aback for a second, but then he smiled a bit. Rika was embarrassed about this! This didn't happen very often, but it was quite amusing.<br>\r\n<br>\r\n\"If you say so...\" He moved towards the table, \"You don't mind if I have one, do you?\" He asked with a smile on his face.<br>\r\n<br>\r\nRika was starting to relax a little,\"Serve yourself.\"<br>\r\n<br>\r\nTakato picked one up and looked at it.\"You know, it's funny that you don't like them, these look very good.\" He took a bite off it,\"The ARE really good! I think I'll have a few. You should really have some more.\" Takato finished the cookie and picked another one up,\"You sure you don't wanna? You seemed to like them, you looked something like this.\" He bit the cookie and chewed it slowly, with an slightly exaggerated look of pleasure on his face. \"Hmmmmm.\"<br>\r\n<br>\r\nRika was red again, this time with a mixture of embarrassment and anger. Takato knew he was risking his life right now, but he was feeling lucky, and this was way too much fun.<br>\r\n<br>\r\n\"I mean, just look at them.\" Takato moved a cookie to Rika's face, \"It's so sweet, and tasty, and gooey, and chocolaty... Right out from the oven too, just smell it...\" Rika's eye was developing a small twitch, and her mouth was watering.\"Do you smell it?\"<br>\r\n<br>\r\n\"Darnit Goggles, give me that!\" Rika snatched the cookie from Takato and gobbled it, putting it whole into her mouth. As soon as she started chewing the cookie, her face relaxed a little, and her mouth formed a small smile as the sweet taste of the cookie flooded her mouth.<br>\r\n<br>\r\nTakato's smile couldn't get any wider, and he broke into laughter at Rika's suddenly chipmunk-like face, her cheeks full of cookie. \"Ha! So you don't like sweets, eh? It seems to me like you are liking that cookie.\"<br>\r\n<br>\r\nRika took a few more seconds of cookie chewing before she swallowed it. \"Ok, Gogglehead, you got me, I like sweets, and I love chocolate chip cookies, happy?\" Rika said in an annoyed voice.<br>\r\n<br>\r\n\"Yup.\" Takato smiled brightly,\"But why did you lie about it? I mean, it was funny, but I don't get why you would deny it.\"<br>\r\n<br>\r\nRika took another cookie as she started talking,\"I've got an image to keep, Goggles, liking sweets shows weakness.\" She started eating the cookie, \"I've already *munch munch* established to people that I *munch* don't like sweets, and *gulp* I want things to stay that way.\" Rika finished her cookie, and it wasn't long before she had another one in her hand.<br>\r\n<br>\r\n\"That's silly, Rika. Nobody is going to think any less of you because you like sweets. Look at me, you are eating cookies right now and I don't think any different, you are still as tough as always.\"<br>\r\n<br>\r\nRika looked at Takato pensively while she kept on eating cookies.\"Whatever you say, Gogglehead, but I'm not changing my mind. And you, of course, are not going to tell anyone about this, are you?\" Rika said menacingly.<br>\r\n<br>\r\n\"No, of course not. If you don't want me to say anything, I won't.\" Takato replied,\"But it's silly.\"<br>\r\n<br>\r\n\"Whatever.\" Rika ate another cookie.\"What did you come here for anyways?\"<br>\r\n<br>\r\n\"Ah yes...\"</span></div></div>",
            "created":1338440400,
            "id":1349482,
            "title":"Who, me? No way..."
        },
        "11311211":{
            "choices":[
                "Yup, reputation is important.",
                "Nope, this whole thing is silly, sweets are good."
            ],
            "content":"<div class=\"\"><div> <span>\"So, we were planning on going to the movies later this evening; Henry, Kazu, and I guess Kenta. You coming?\" Takato asked.<br>\r\n<br>\r\n\"Is Ryo going?\"<br>\r\n<br>\r\n\"Not that I know of, but I haven't really asked him.\"<br>\r\n<br>\r\nRika smiled as she devoured another cookie,\"Good, keep it that way.\" She said between bites.\"I guess I'll go then.\"<br>\r\n<br>\r\nTakato smiled,\"Awesome, I'll go tell the others. The movie starts at 6, are you coming with me now or will you meet us there?\"<br>\r\n<br>\r\n\"Can't you see I'm busy over here, Gogglehead?\" Rika said pointing to the shrinking pile of cookies. \"These are best warm. I'll catch up with you guys later.\" <br>\r\n<br>\r\nTakato was a bit surprised by Rika's choice, but nodded anyways.\"Ok, I'll see you there.\" He said as he approached the door.\"Enjoy those cookies.\" He said with a smirk.<br>\r\n<br>\r\n\"I will decided whether I enjoy them or not.\" Rika replied to her already absent friend. She continued eating cookies while she thought of her conversation with Takato. It would be nice to eat sweets whenever she wanted to. <br>\r\n<br>\r\n'I have an image to maintain, but Goggles might have had a point. Why should I not eat sweets just because of that? Lots of people eat sweets, and these cookies are just delicious.' Rika thought.<br>\r\n<br>\r\nShould Rika continue to hide her liking of sweets?</span></div></div>",
            "created":1341118800,
            "id":1370367,
            "title":"To cookie or not to cookie"
        },
        "113112112":{
            "author_id":"treex",
            "author_name":"Treex",
            "choices":[
                "Be moderate in eating -- Rika restrains herself (or so she thinks)",
                "Her grandma makes too much cookie dough by mistake"
            ],
            "content":"<div class=\"\"><div> <span>Rika continued to eat cookies silently while thinking. 5 minutes had passed since Takato left her room. The pile of cookies became smaller and smaller, and Rika's mind had gradually inclining toward Takato's view. After all, her image as tough and cool girl was nothing to do with her liking of sweets.<br>\r\n<br>\r\n“Do I really need to care about public eyes? If I admit I like sweets, I can eat those whenever I want! Even if I eat these cookies openly, my friends surely will not feel anything strange about me.”<br>\r\n<br>\r\nThough she still felt a little hesitation, finally the Digimon Queen decided to put an end to hide her sweet tooth. She smiled as she gave a cookie a bite.<br>\r\n<br>\r\nThen, her finger touched something hard -- Before she knows, the two dozen chocolate chip cookies were all gone. When Rika thought a little about a second helping while rubbing her belly unconsciously, her grandmother came back to the kitchen (a short time ago before Takato came, she had left the kitchen.)<br>\r\n<br>\r\n\"Grandma...Could you make some more cookies, please?\"<br>\r\n<br>\r\n\"Sure!\" Her grandma gave a pleased smile.<br>\r\n<br>\r\n</span></div></div>",
            "created":1352696400,
            "id":1466253,
            "title":"Nope, this whole thing is silly, sweets are good."
        },
        "1131121122":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "50 pounds worth",
                "250 pounds worth "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much does she make?</span></div></span></div>",
            "created":1440219600,
            "id":2023933,
            "title":"Her grandma makes too much cookie dough by mistake"
        },
        "11311211222":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "Drink the cookie dough",
                "make the cookies for her friends."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Rika do?</span></div></span></div>",
            "created":1441256400,
            "id":2029608,
            "title":"250 pounds worth "
        },
        "114":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Force Feed",
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of Weight Gain for Jeri Katou?</span></div></span></div>",
            "created":1313038800,
            "id":1166116,
            "title":"Jeri Katou"
        },
        "115":{
            "author_id":"blazingray",
            "author_name":"writersblock",
            "choices":[
                "Alice McCoy",
                "Suzie Wong",
                "Ai and Mako Maeda"
            ],
            "content":"<div class=\"\"><div> <span><b>Alice McCoy</b><br>\r\n<br>\r\nGranddaughter of Robert \"Dolphin\" McCoy of the Monster Makers, Alice brought Dobermon to the tamers to give them the power to biomerge. Now she's alone and emotionally vulnerable<br>\r\n<br>\r\n<br>\r\n<b>Suzie Wong</b><br>\r\n<br>\r\nHenry's little sister and Lopmon's tamer. She's an impressionable and naive girl.<br>\r\n<br>\r\n<br>\r\n<b>Ai and Mako Maeda</b><br>\r\n<br>\r\nImpmon's young tamers. Kids their age have no concept of maintaining weight and without Impmon they'll probably be lonely.</span></div></div>",
            "created":1468178580,
            "id":2178121,
            "title":"others"
        },
        "12":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "Guilmon",
                "Terriermon",
                "Renamon",
                "Impmon",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>remember only the digimon can gain weight!</span></div></span></div>",
            "created":1312952400,
            "id":1165818,
            "title":"digimons"
        },
        "123":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Eating",
                "Magic",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now then, how does this foxy Digimon pack on the pounds exactly, hmm?</span></div></span></div>",
            "created":1434171600,
            "id":1991920,
            "title":"Renamon"
        },
        "1231":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Rika's mother is really pampering Rika now, and doing the same to Renamon too!",
                "Renamon finds a shop run by a Digimon, selling delicious digifood",
                "Renamon begins hearing about the disappearance of fattened female digimon..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What food-based scenario is causing Renamon's weight gain?</span></div></span></div>",
            "created":1556101800,
            "id":2649458,
            "title":"Eating"
        },
        "12311":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Renamon bolts with Rika. She needed more answers. ",
                "Renamon isn't fast enough and Rika's mother manages to get them both"
            ],
            "content":"<div class=\"\"><div> <span>Through everything, Rika's mother was still not happy with her daughters' attitude and lifestyle. The D-Reaper incident had only made things worse. Rika and her had had their usual speal and shouting; Rika's mother wanting Rika to take the more safe route in life and be like her, while Rika still wanted to remain as she was and wanted her mother to accept her for it.<br>\r\n<br>\r\nIn most stories the latter situation would resolve. In this one, it did not. Rika was dragged kicking and screaming from her friends. They would not meet again for several years, but Rika and Renamon would again, by pure accident...<br>\r\n<br>\r\n<br>\r\nSeveral years after the D-Reaper Incident...<br>\r\n<br>\r\nThe same park. The one where Rika and her met. Renamon looked around the darkened forest, eyes wide. Her Bio-Emergence had been an accident; Guilmon's fault mostly. Yet she was right back where it all began for her. <br>\r\n<br>\r\nHow many years had it been since she and her Tamer had parted? She wondered as she made to the trees. Whenever she and Rika used to train in the dark, they would come here. The paths and trees were silent, with no sounds other than the chatterings of bugs or smaller animals. Renamon had no idea what to do now, she could try to open a portal back, but if she failed she'd likely be treated as a 'Wild One' by Hypnos. She kept leaping through the trees until a weeping sound caught her attention and she stopped on a branch and looked for the source. <br>\r\n<br>\r\nA very rotund posh looking girl was sitting alone at a bench near one of the paths. She had a familiar air about her, but Renamon couldn't place it. Maybe it was the star emblem...or her orange...hair...wait. Renamon dropped to the ground and moved closer. The girl looked up and met her gaze, those same purple eyes.<br>\r\n<br>\r\n\"Renamon? Is that you?\" Rika asked her partner and Renamon bolted. \"RENAMON!\" Rika called as she got to her feet and tried to run after the yellow fox. Renamon turned back to see her partner's pathetic attempt at running, and sighed as she slowed to a stop. By the time Rika caught up with her, she was sweating something fierce and Renamon finally realised how <i>fat</i> her friend had gotten.<br>\r\n<br>\r\nHer face was as round as a tomato, coloured just like one - now - , and had several chins accompanying it. Her arms and legs were stocky, thick with fat and not at all suited for any type of activity. Her breasts had gone up by a few sizes, swollen and heavy looking, but that belly. Her belly was a bulging beanbag of blubber, really testing that dress she was wearing. In addition it was only Rika's voice that caused Renamon to recognise her; she was dressed and stylized so differently no longer a tomboy in any sense of the word; her hair was loose and well-conditioned, she wore lipstick and a large amount of makeup, she was caught alive in a rich looking dress with gold accessories. She looked like her mother, but much fatter. <br>\r\n<br>\r\n\"Is that really <i>you</i>, Rika? You're so...big...so...ladylike.\" Renamon said. Rika looked down with an embarrassed and sad expression, \"What happened?\" The Fox Digimon asked.<br>\r\n<br>\r\n\"After the D-Reaper thing, Mom wasn't too happy about everything that happened. Just when I thought things were getting better, they got far worse. She wanted to take me away from everything, to stop all this nonsense because it wasn't safe. I didn't want her idea of safe then...but she slowly peeled everything away from me, the trading cards, the punk clothing, and put me in her shoes and made me fat so I wouldn't get any 'crazy ideas'.\" Rika said, grabbing and holding her fattened middle, \"And what's worse. I fell into it. I became her and I like it. I'm in love with food-\"<br>\r\n<br>\r\n\"RIKA HONEY, THERE YOU ARE!\" A familiar voice yelled causing both the Digimon and former Tamer to freeze and turn to see Rika's mother running over... </span></div></div>",
            "created":1556105160,
            "id":2649481,
            "title":"Rika's mother is really pampering Rika now,..."
        },
        "123112":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "...an unfamiliar massively obese cat-like humanoid.",
                "...a huge amount of food blocking the door"
            ],
            "content":"<div class=\"\"><div> <span>\"Renamon, run!\" Rika yelled as two figures shot out of the tree-line. Renamon fired off a Diamond Storm at the attackers but they bounced off them as they slammed into her, sending her into the Fountain. Renamon grunted in pain and got back to her feet and frowned at her attackers. They looked like a Lilymon and Rosemon...but they were MUCH fatter and had a doped expression on their faces. Why were they like that? Renamon looked towards Rika who was being 'comforted' by her mother, who was watching the scene with a weird look. <br>\r\n<br>\r\n\"Forbidden Temptation.\" A flash of pink light and Renamon's world turned black.<br>\r\n<br>\r\nNonoka smiled, that was faster than anticipated. She signaled to her Digimon who took hold out of the fox Digimon, and began to take her away. Rika was still struggling against Nonoka, but the muscle relaxents and her increased weight made even Nonoka stronger than her.<br>\r\n<br>\r\n\"Don't worry too much about her dear, she'll be taken care of very well and she'll be there when you get home!\" Nonoka said as she guided her daughter back to their vehicle. <br>\r\n<br>\r\n.........................<br>\r\n<br>\r\nThat was painful, Renamon shifted uncomfortably as she woke up at wherever she was. Rika didn't have her Digivice so Renamon would not have withstood a long battle with the Mega and Ultimate digimon, but she didn't want to leave Rika. <br>\r\n<br>\r\nRenamon looked at her surroundings, which looked to be a huge cell of sorts with a locked door. There was also something else in there with her, it was...<br>\r\n<br>\r\n</span></div></div>",
            "created":1556847060,
            "id":2654098,
            "title":"Renamon isn't fast enough and Rika's mo..."
        },
        "1231121":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "'You won't be saying that shortly...DebuKyuubimon'",
                "'I'm moving you to a nicer place soon. Maybe you'll change your mind.'"
            ],
            "content":"<div class=\"\"><div> <span>Renamon's eyes widened comically as she took in the other occupant of the cell. Rosemon and Lilymon were nothing in terms of fatness compared to the creature before her that was gulping down a huge tower of food. <br>\r\n<br>\r\nThey looked to be as tall and wide as a building but made of plush fat and fur. They had once been wearing gold plated armour but it had broken the fatter they had gotten. Her breasts were each the size of a small car while her stomach was as big as a house. Her arms were so fat-filled that they could only be used now to stuff things down her maw, which was already difficult with the cat Digimon's quad chins and multiple jowls. Her legs and butt were far too big or heavy for her to ever move again, but from the Digimon's brainless stare it didn't look like she wanted to. She also had an unusual tiger stripe pattern all over her exposed fur and even on her face. In total she looked to weight somewhere over 2000 pounds. <br>\r\n<br>\r\n\"Enjoying the view?\" Nonoka's voice echoed as she stepped into the room, flanked by two fat Lilymon. Renamon lunged at the woman, only for Lilymon to hit her with a Flower Cannon and restrain her. Nonoka had a mocking smirk on her face and walked over to the giant fatty,  \"Now that that's settled, Renamon, may I introduce you to DebuRasielmon.\" She said as she rubbed the end roll of the Digimon. DebuRasielmon purred as she continued to eat and blushed slightly at the contact.<br>\r\n<br>\r\n\"She was one of my earliest volunteers for our 'Debu' program.\" Nonoka cooed as she rubbed the former Ophan Digimon's belly. <br>\r\n<br>\r\n\"Debu Program? Is that what made Lilymon and Rosemon so fat?\" Renamon asked, as Lilymon held firm. They still had fogged eyes, \"And why aren't they responding. Did you brainwash them?\" She asked. Nonoka turned back to her.<br>\r\n<br>\r\n\"Brainwash...is a harsh term. They're more or less just completely apathetic if they aren't eating. Everyone in the world looked towards Digimon as a sort of cool fad...while they saw fighters, I saw pets. And the best way to keep a pet happy is to make it pampered and fat. Debu Digimon no longer have any obligation to care about anything so long as they can eat.\" Nonoka finished with a smile.<br>\r\n<br>\r\n\"You're treating them like trophies! JUST LIKE RIKA!\" Renamon snapped and Nonoka's expression turned angry. And then she smirked. </span></div></div>",
            "created":1556852460,
            "id":2654181,
            "title":"...an unfamiliar massively obese cat-like human..."
        },
        "12311211":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "A morbidly obese Kyuubimon lazily eating out of a bowl.",
                "A somewhat fat glassy-eyed Renamon sleeping on the floor. ",
                "A thin but very tired Renamon staring back with a restrained smile"
            ],
            "content":"<div class=\"\"><div> <span>Renamon just snarled as Nonoka walked away triumphantly. The orange haired woman gestured to the DebuRosemon. The obese plant Digimon entered the room holding a massive cake, much taller than themselves and much wider too. The digimon placed the cake down and cut off large chunks of cake with their vines and began walking over to the restrained fox digimon. One of them forced the Rookie Digimon's jaw open while the other readied a few pieces of cake. <br>\r\n<br>\r\n\"Have fun Renamon. You'll see Rika again once you're a little more...obedient.\" Nonoka called out as she left the room and as DebuRosemon shoved a cake piece into Renamon's maw and Renamon's senses exploded. An angelic scent hit her nostrils just as a delicious sugary explosion hit her tastebuds and she quickly gulped down the piece. Renamon shook her head, feeling her thoughts begin to float away as the divine cake residue remained in her mouth. <br>\r\n<br>\r\nShe didn't even realise she was eating another piece until her tongue felt like honey, and she looked back up at her captors. Another piece was coming her way and she turned her head to the side only for the DebuRosemon to straighten it as the third piece came and Renamon began to lose herself in the taste...<br>\r\n<br>\r\n<br>\r\n10 weeks later...<br>\r\n<br>\r\nIt had been an awful day for Rika. Her class at her college had been cancelled, meaning that she had to do her already completed presentation the next week, her other courses were fine but people were acting out, making it more difficult to listen, and the only available science lab was unavailable, as well as wait at a bus-stop for an extra 2 hours - like hell was she asking for her mom's help - with so many other people there judging her well-kept, overfed form. Not that she blamed them she was VERY privileged now thanks to her Mom and anyone of Rika's fatness was worth glaring at. Rika ignored all the stares and instead looked over the other appointments on the phone.<br>\r\n<br>\r\nIt was only 10 minutes later that her mother - unfortunately - appeared in the usual limo. Rika got in with a sigh of exasperation, the former had been doing this for some time but it wasn't any less embarrassing or demoralizing.That was probably the point anyway. Nonoka looked very cheerful as Rika did her seat-belt. <br>\r\n<br>\r\n\"I'm very sorry about your class today Rika. But I've got some good news for you! Renamo has finally come around, she's waiting at your room back home.\" Nonoka said in a happy voice. Rika's blood ran cold as the limo began the course home and Nonoka began chatting again, but Rika was terrified and awaiting what Renamon was waiting for her back home.<br>\r\n<br>\r\nSoon enough they had arrived back at the house and as fast as she could move Rika made her way to her room and flung the door open to find...</span></div></div>",
            "created":1558940820,
            "id":2664656,
            "title":"'You won't be saying that shortly...Deb..."
        },
        "12313":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "an empty shack.",
                "that the shores end here."
            ],
            "content":"<div class=\"\"><div> <span>Within the Digital World, strange things were occurring. Female Digimon were either vanishing without a trace, or growing fat and then up and vanishing. It was strange and worrisome. <br>\r\n<br>\r\nThis was why Renamon was currently self-volunteering herself as bait. She was also currently on the edges of the Digital Sea, the Data Shores. From here, you could see into the vast expanse that was the information This was where she had heard the disappearances happened the most, and it’s here she would start looking for information.....or get kidnapped. She didn’t see why not; she was a female Digimon, she looked very good (even for her species, which were quite pretty), and she honestly was interested in this whole affear. Who would kidnap female Digimon, and why? Especially fattened ones, that was the interesting part. So she set out to investigate with two end goals in her hard drives: find information or get kidnapped. Ether was fine by her.<br>\r\n<br>\r\nShe turned her attention back to the Data Shores. The lapping bright blue waves against the white and sandy green pulverised data fragments, with the occasional sever or palm tree popping up here and there...and not a Digimon to be found within miles. Peaceful, calm, she could lay in the sand for hours and just drift off into sleep for twice as long. It was so serene, so out of the way......and yet, Renamon knew something strange was going on here. Why else would she be here? The question is, would she find it...or would it find her? That intrigued her.<br>\r\n<br>\r\nSomething caught her eye, up ahead. She focused on it, and she saw.....</span></div></div>",
            "created":1570551660,
            "id":2730029,
            "title":"Digital Disappearing Acts"
        },
        "13":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "Takato Matsuki and Guilmon",
                "Henry Wong and Terriermon",
                "Rika Nonaka and Renamon",
                "more than one Tamer and digimon",
                "some other way to start"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>remember only humans and digimons can only gain weight!<br>\r\n<br>\r\nso who do we follow first!</span></div></span></div>",
            "created":1312952400,
            "id":1165824,
            "title":"humans and digimons"
        },
        "133":{
            "author_id":"veritax_95",
            "author_name":"Not Crazy",
            "choices":[
                "Rika's mother is trying to pamper them so that Rika won't be as reckless. ",
                "A weird new Digimon is causing humans and Digimon to plump up!",
                "Renamon and Rika are kidnapped by an individual with unusual tastes..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How are they gaining weight?</span></div></span></div>",
            "created":1556106180,
            "id":2649487,
            "title":"Rika Nonaka and Renamon"
        },
        "134":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "my story",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>fallow my own story or make you own!</span></div></span></div>",
            "created":1313038800,
            "id":1165978,
            "title":"more than one Tamer and digimon"
        },
        "1341":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "see what Rika Nonaka and Renamon are up too"
            ],
            "content":"<div class=\"\"><div> <span>It was a wonderful day outside in the late summer. Takato Matsuki and Guilmon were coming back from the train station to say good bye to Henry Wong and Terriermon. Henry was heading to visit his grandmother and grandfather in Osaka, while Terriermon join him for the ride. It has been peaceful since the days of the True Enemy....the D-Reaper itself! Most of the people of the world has grown to accept the digimon in the world, but there are some people that feel uncomfortable around them. It is why during their summer break, the Tamers go around Tokyo and telling people to not be afraid of the digimon. Sometimes they are successful, causing great cheer for the Tamers. Sometimes they are not successful, which results in the Tamers feeling bad for themselves. Nevertheless, they go on to deliver the message to everyone they find. Takato and Guilmon continue to walk back to their home, where they can have a nice lunch.          </span></div></div>",
            "created":1313038800,
            "id":1166044,
            "title":"prologue"
        },
        "13411":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "The Mouring"
            ],
            "content":"<div class=\"\"><div> <span>Over at the house of Rika Nonaka and Renamon, it was mostly quiet, some birds were chirping away outside of the house. Both Rika and Renamon were not there, out to get some groceries. Rika's life has been great since the adventurous days with the tamers, her life was as normal as the rest of the tamers. As for Renamon, living with Rika has never been better, her life is a lot easier now that the whole world knows about the digimon. Around the evening, Rika and Renamon came back from the local market, tried from a long day of shopping around for food. Once home, Rika's mother greet them as they drop off the groceries in the kitchen. The girls than went to their room to relax from their day outside. Rika has always seen Renamon as a sister for her, were Renamon has always seen Rika as the human she can always trust, her best friend. While in the room, they were discussing on what they were going to do tomorrow as well as how they will enjoy the rest of Rika's summer break. Luckly for Renamon, she can go anywhere with Rika, due to her anthropomorphic appearance. Of all the digimon that the many people in Tokyo has met, Renamon was the best to be around. After all, Renamon happen to be the most mature of the lot. Plus, Renamon just happen to resemble a Kitsune from Japaneses folklore, which offend was a bonus when it came down to meeting new people. After Rika and Renamon finish their discussion, they went back to the kitchen to their dinner.               </span></div></div>",
            "created":1313038800,
            "id":1166336,
            "title":"Prologue"
        },
        "134111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "after the mouring",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>In Takato's room, the sun was assaulting the windows with great force. Eventually, the sun won and sun beams flooded his room. The sun is quite a reckless enemy, Takato knew this. In nature, the sun always wins. Takato woke from his slummer, even if he did not what to. He got out of bed with his normal straight. He realized just how warm it was today. Luckily, he did sleep on his sheets and unbutton his pajama shirt so he can feel the air on his skin better. Once he fully got up, he want to wake up Guilmon so he can join him in his many tasks of the day.<br>\r\n<br>\r\nMeanwhile, over at the house of Rika Nonaka, she was already awake. she was getting fully dressed in her room alone. Renamon was helping out with Rika's mother. Rika was putting on her shirt with the broken heart, she does sometimes think about why she still wears the shirt. Not for the fact that it was the same shirt, but it was because her heart has not been for a long time. She than sat on her bed to put on her pants, sliding up her slender legs. Due to her slender from, grab her belt, and attach it to her pants. She finish putting on her cloths and walked out.    </span></div></div>",
            "created":1313298000,
            "id":1167804,
            "title":"The Mouring"
        },
        "1341111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "fellow the kids",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Takato and Guilmon enjoyed a great breakfast made by Takato's mother. They both headed outside of their house, into the warm sun. They realized it was a bad idea. Luckily, some of the building provide shade for them. Now in a cool place to think, they began to discuss on what they should do today. \"Well, we could go and visit Rika and Renamon or we can hang out with Kanu and Kenta, what do you say?\" said Takato. Guilmon stood their in the cool shade wondering which one to choice. Guilmon spoke \"why don't we go to visit that nice man at the buffet.\" Takato shook his head and said\"alright, sounds go to me!\" Both walked in the blistering sun towards the local Buffet.<br>\r\n<br>\r\nRika and Renamon were both chilling in their room wandering what to do next. Until, Rika said \"why don't we see what Tako and guilmon are doing?\" \"sure, I always wonder what they are up to\" answer Renamon.       </span></div></div>",
            "created":1313470800,
            "id":1169654,
            "title":"after the mouring"
        },
        "13411111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "still fallow the kids",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Takato and Guilmon took the bus to get to the buffet. the man that Guilmon was talking about is Ando the chef and owner of a buffet. Takato and Guilmon have been over to Ando's buffet many times. At first, Ando was not to keen when Takato brought Guilmon around to his buffet, mainly because Ando has never seen a digimon before. Now, Ando is has grown to liking Guilmon. Both takato and Guilmon enjoy the delicious food that Ando always makes for his lovely costumers. In Takato's mind, they were going to see how he has been over the summer, after all, they just had breakfast. In Guilmon's mind, he could not wait to gorge himself on the super scrumptious food that Ando makes. However, the bus ride to Ando's buffet has quite long, maybe he could get himself a nice snack while they are there. Anyway, he see it, he will most likely welcome any food that comes his way.<br>\r\n<br>\r\nBy the time Rika and Renamon came to the house of Takato and Guilmon, it was high noon. Both girls were starting to feel the heat of the summer. Rika and Renamon came inside of the sweet smelling store section of Takato's house. Rika asked Takato's mother if Takato and Guilmon were around. Takato's mother told them that she did not know where Takato and Guilmon  went. Rika and Renamon felt a bit disappointing to not see Takato and Guilmon at their home. They said goodbye to Takato's mother and headed out. Rika started to talk to Renamon about want they should do next. \"I would have love to spar with Guilmon one of these days, I guess not today\" spoke Renamon. It was Rika turn to speak, \"it would have been fun.\" \"You know, I would love to see what Impmon is up too, that little trouble maker\" said Renamon. Rika responded \"yeah, I still hear that he still hangs around the park, but I wonder if he is by himself or with Ai and Mako?\" Rika and Renamon decided to take the bus to the park to find Impmon.<br>\r\n<br>\r\nIt was about five past one in the afternoon when Takato and Guilmon finally arrived at Ando's buffet. They went inside to the cool fresh building and Takato took a seat. \"why hello there, Takato\" shouted Ando from behind a counter! Takato stood up to shake Ando's hand while Guilmon got his attention on a small kid sitting next to his mother. \"oh look mommy, a digimon\" shouted the kid! \"Hello, what is your name\" said Guilmon. \" My name is Hiroki\" said the kid. \"oh hello, Hirokimon\" responded Guilmon. the kid smile and laugh at what Guilmon just said to him. Guilmon walk back to Takato and sat next to him as Takato continue to talk to Ando. <br>\r\n<br>\r\n</span></div></div>",
            "created":1314075600,
            "id":1173820,
            "title":"fellow the kids"
        },
        "134111111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "the next day",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          Due to the many trees at the park, the temperature at the park was much cooler than any where else.  Rika and Renamon were strolling along the walkway in the park. They arrived at the playground, trying to see if they can find that small purple digimon. It was just than that small purple digimon show up, behind them. \"oh it Rika and Renamon, what are you guys doing here.\" spoke Impmon. \"just searching for you, but you just make it easier for us.\" said Renamon. Impmon came a bit close her, \"so what do you guys want?\" Rika and Renamon walk to a bench near them and sat. Rika spoke, \"just wanted to check on you, not causing any trouble now are you.\" Impmon gave her a nasty look, \"no but now that you said that I might, BA DA BOOM!\" \"I heard on that news that there has been robberies all over Shinjuku, you were not part of them are you\" question Renamon. \"ha, I never would do something like that,\" Impmon walk up a tree stump, \"you thing I'd would do that went I like to just mess with people.\" Rika and Renamon continue to talk to Impmon for awhile. Evenly, they grew a bit tried and said goodbye to Impmon. They got back on the bus. \"hmm, there is someone robbing people, sounds like fun!\" said Impmon as he lied back against the tree stump. <br>\r\n<br>\r\n           Takato and Guilmon came up from their buffet raid, both had plates full of food. They sat down on the stall when Ando came over. Ando said to Takato, \"the food is on the house and you should bring Guilmon more offend, that way more people will come to my buffet.\" Takato grab some noddles and shoved it in his mouth,\"sure, you keep us fed and we will bring in the people, right Guilmon.\" Guilmon did not paid any attention to Takato, he was too busy eating. \"ah, music to my ears\" said Ando as he left them in peace. Takato and Guilmon continue to stuff themselves silly with food. Takato was busy enjoying the sushi while Guilmon was enjoying about everything at the buffet. Evenly, they became full from eating. Takato when back to Ando and told him that it is a deal. Ando will pay them with the food at his buffet for the people that Guilmon bring in to meet and greet. Takato enjoyed this Idea because not only will they be working, but they will be paid in food and will help people become more accustom to the digimon. Takato and Guilmon walk outside to the mid day sun and got back on a bus to head to their home.         </span></div></div>",
            "created":1314162000,
            "id":1174369,
            "title":"still fallow the kids"
        },
        "1341111111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "talk to Mitsuo Yamaki and go to the buffet",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          Takato was asleep on his bed while Guilmon has slept right next to him. They were both full from the buffet raid yesterday. It is just past 8:00 Am, Takato can wake up, but he will enjoy himself a bit more. He just grew a little lazy from the the day before, and he actually like it. He did not know if Guilmon was enjoying it too, he can find out later. Time to rest for a bit more. He is thinking that he will wake up later when it gets hotter, plus he does not want to sent the rest of the day in bed. He also took off his pajama shirt, he know it will just get warmer in his room. He hope that Guilmon is okay with the heat. Guilmon slept like normal next to Takato. Than, Takato went back to sleep.<br>\r\n<br>\r\n          At the house of Rika Noaka, both Rika and Renamon have awaken and were in their room chatting away about many things. \"We can visit that nice old lady near the subway entrance or we can spar for a little bit, what do you say?\" said Rika. \"why not we do both\" answer Renamon. \"sure, why not,but first let me get dress.\" said Rika as she moved to her drawers. \"yes, I will see if I can help your mother\" said Renamon as she walk out of the room. Rika got her clothes out of the drawer and set them on her bed. She was wearing her pajama, but not for long as she started to take it off. She was standing in the middle of the room with her bra and panties. Rika has always been fit for most of her life. She always wanted to be the best in everything. She look in the mirror, and saw her reflection. She admire her slim body that she has. Her long legs and nice tights added to her trim body. The way her panties were hugging her butt, which she though might be too small, was a nice feature on her body. She had a nice breast size for a girl of her age. The rest of her body was fit and trim, her midsection was nice and slender. She enjoyed placing her hands on her fit body, feeling her skinny body. It just felt great, rubbing her stomach and her legs. It just hit her that, now that their is no more digimon threat or any type of calamity, why does she have to work so hard? She has worked so much in her life, that it might be time to slow down a bit. Her life is much happier now than ever before. She also wonder if Renamon would think the same way about her or about her self too. Maybe that is for another time, she has to get dress for the day. She put on a shirt which did not have the broken heart. She Finish off dress by putting on her e er so familiar steel toe shoes and walk out of her room.<br>\r\n<br>\r\n          Takato was already awake and putting on his clothes, putting his pants on felt a bit snug, but still fit. Guilmon was awake too, just watch Takato so they can have breakfast. They both walk down and headed to the kitchen. They had their breakfast and just went they were going to go outside, Takato's mother called him. \"Takato, you have a visitor\" yelled Takato's mother. Takato and Guilmon stop and went to see who it was. They both saw a man in a black suit with dark sunglasses, they know who it is. \"Well hello, Mitsuo Yamaki, long time no see\" said Takato.   <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1314334800,
            "id":1175382,
            "title":"the next day"
        },
        "13411111111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "at the buffet and to the old lady",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          In the house of Rika and Renamon, there was one room where they can practice there own teamwork or against others. That room was always the best for them. Both of them were in, they trying out some new cards that Rika has keep for a while. Their time there was spend with frantic energy and excitement as they tried each card out. Evenly they grow quite bored of their testing around. They decided to lay down for a rest. \"Yes, that was very interesting cards you had there, maybe you should get some more.\" asked Renamon to Rika who was beside her. \"of course, Renamon, anything for you.\" answer Rika. Renamon looked at Rika and wondered if something was bothering her. \"Rika, is there something amidst?\" Renamon questioned. Rika looked back at Renamon, knowing what she is going to say, \"Do you think that we are working too hard?\" Renamon stood up and said \"what makes you say that?\" Rika also stood up as well and said \"well, I have been like this for a long time, why should I keep this up.\" Rika paused for a moment to gather some of her thoughs that she will say, \"There has been no activity of digimons in a long time, I mean ever since Locomon,  nothing has really happen.\" Renamon looked at Rika for a while, she place a hand on her shoulder and said \" I understand what you mean, why keep on going if there is nothing left to do.\" Rika gave Renamon a reassuring look to her, \" it is good to hear you say that, good to know that you are on my side.\" \"Then what are we going to do if there is nothing left to do,\" Renamon remove her hand from Rika's shoulder and place it on her hip, \"you are going to enter school again, maybe it is time to be more focus on that.\" Rika said \" that is a good idea, now that I am in high school, but what you can do?\" Renamon responses, \" I can always return to the digital world if I see fit, we will always be in touch if we need ourselves.\" Rika gave Renamon a hug of joy to hear her say that, \" that sounds like a great idea, and not to worry, I will still get more cards to practice on.\" Renamon return the hug to Rika, they both decided it was time to visit that old lady, they both exited the room.<br>\r\n<br>\r\n          Mitsuo Yamaki was looking quite well to Takato, he has not seen him for a long time too. He sat across from Takato and Guilmon, Takato's mother came over to offer him something but he did not need anything. \"Just wanted to stop by and see how you two have been over the course of these months\" said Mitsuo as he took off his sunglasses and set them aside. \"Are you still looking for Digimon?\" said Guilmon taking a huge bit out of some bread. Mitsuo said \"well, that what I also came here to tell you guys, I am no longer the leader of Hypnos.\" Both Takato and Guilmon stop eating and stared at him. \"yup, I gave up my position as leader of the Japanese Hypnos and have become more focus on other Hypnos agencies I am creating across the world\" continue Mitsuo. \"oh, for a second there, we thought you completely step down as the leader\" said Takato as he continue his breakfast. Mitsuo took out a small map out of his pocket and gave it to Takato,\"I have been to many places with Riley and as of now we have establish Hypnos in North America and Australia, as you can see on the map.\" Takato and Guilmon looked at the map and nodded, \"that is quite good, as long as the rest of the world in safe and educated about digimon, it is all right with us.\" Takato gave back the map to Mitsuo, \"so what has been going with you two?\" Takato finish his breakfast as well as Guilmon, \"we been great, we even got a \"job\" at a buffet.\" Mitsuo replace his sunglasses on his face and stood up, \"well that is great to hear, but I am going to buy some bread from the bakery to give to Riley, hope that everything is quiet in the western front.\" With that said, Mitsuo walked back to the bakery. Takato and Guilmon decide to head to the buffet that they just mention to Mitsuo. They said their goodbyes to Mitsuo as the pair went to catch a subway train for the buffet.            <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1314766800,
            "id":1178751,
            "title":"talk to Mitsuo Yamaki and go to the buffet"
        },
        "134111111111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "a week later..",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          It was a nice day out in Shinjuku, not has hot as yesterday, but a nice day regardless. Near a subway entrance, which was as busy as any other subway entrance in a mega city. There is an old lady who owns a little shop that like to sell very special bathing shampoos and other bathing supplies. Her name was Amaya and she has own the store for quite some time. It was why Rika and Renamon were going to visit Amaya. They have always like to stop by and say hello to Amaya or to stop by and buy some of her lovely products. Amaya has always enjoyed the company of  the girls. She also has gotten used to seeing Renamon and the many other Digimon that has been around the area. <br>\r\nThey have arrived at Amaya's store and entered. They saw Amaya helping out a costumer and decide to look around the store. Renamon saw the many rows of bathing supplies that were on the walls. Were as Rika, she saw the lovely shampoos bottles that were on a table near her. The costumer left and now Amaya was free for them. \"hello Amaya\" said Rika. \"Why hello dearie, how have you been\" said the nice old lady. Both of them continue to chat for awhile, they chated about school and what Rika has been doing over the summer. In comes Renamon and Amaya focus on her. \"oh it's you, how are you?\" said Amaya. Renamon answer and Amaya chated with renamon. Until, Rika saw something that that interest her,\"excuse me, but what is that green clear bottle in that crate?\" Amaya saw what Rika was pointing at, it was small crate behind the counter which was sitting on a chair beside her. \"oh that, will dearie, that is a new shampoo that one of friends has made out in Adachi, it just came in yesterday by mail.\" said Amaya picking up a bottle and giving it to Rika. Rika examine the bottle of the green substance. \"do you know what is in this bottle?\" question Rika. \"well, she told me that she use very natural ingredients in the batch she made\" said Amaya. \"ah, sounds interesting, how much is this bottle\" said Rika as she gave it to Renamon to look at. Amaya place her hand on Rika's and said \"For you sweetie, since you have always been good to me, I well give it to you for free and also one for you, Renamon.\" Amaya been over and gave one to Renamon. \"Thank you, I always like to keep my fur nice and clean\" said Renamon as she ran her hand through her fur. They both said their goodbyes and went off to catch a ride.<br>\r\n<br>\r\n          The buffet was booming with chatter of the red digimon, people were wondering if said digimon will return today. Even Ando was wondering if Takato and Guilmon will come today. The buffet was becoming full of eager people waiting for Takato and Guilmon. Just then, they came in to the buffet, and were met with full attention. People were crowding around Takato and Guilmon, Takato left Guilmon behind so he can talk to Ando about their agreement. \"Well you showed up, and you brought Guilmon with you that is great, why don't you grab a plate and fill yourself up\" said Ando take Takato to the buffet. Guilmon stay behind to keep entertaining the many people that were around him. Kids came up to and ask questions about him and digimons in general. He continue to do so while Takato came back with a plate full of food.\"Guilmon, I will eat now so you can eat after me and than I will keep the people busy, okay\" said Takato as he sat in the booth next to Guilmon. For the rest of the time there, Takato and Guilmon would alternate between each other as one will eat where as the other will join the people. It was a busy time there at Ando's buffet, but it was all wroth it for Takato and Guilmon. Both of them were enjoying the company of the people and of the delicious food. By the time that they realized it was almost evening, Takato and Guilmon agree to finish up what they came to do. They were both quite full and decide to say goodbye to the many people who stay there the longest. Takato came up to Ando who was in the kitchen and thank him for the food and told him that they would love to come back. Ando beamed and told Takato that he and Guilmon are always welcome at his Buffet. The Tamer and his digimon left the buffet and head to the subway were they can take a nice ride home.             <br>\r\n<br>\r\n            </span></div></div>",
            "created":1315026000,
            "id":1180444,
            "title":"at the buffet and to the old lady"
        },
        "1341111111111":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "Takato notices and Rika plans out ",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>          Summer was at it highest point in japan. Most people have by this point left the big <br>\r\n<br>\r\nloud cities to much cooler place through out japan. Some even left the country to far off <br>\r\n<br>\r\nplaces. Those who stay behind had to deal with the even increasing heat hitting the earth. The <br>\r\n<br>\r\npeople who stayed behind also included the remaining tamers.<br>\r\n<br>\r\n          Takato was sleeping in his room. The room was not as hot as outside due to the fact <br>\r\n<br>\r\nthat Takato had put a fan in. The fan was keeping both Takato and Guilmon cool within the room. <br>\r\n<br>\r\nTo keep even cooler, Takato has taken off his shirt. This was a direct defiance against the <br>\r\n<br>\r\nheat and it shows. over next to Takato was Guilmon who was sound asleep as well. oddly enough, <br>\r\n<br>\r\nGuilmon was not as hot as Takato was. mainly because Guilmon was a fire based digimon. that <br>\r\n<br>\r\ndoes not mean that Guilmon is heat proof. once in a while Guilmon would grow tried from the <br>\r\n<br>\r\nheat. <br>\r\n<br>\r\n          Speaking of growing and becoming more tried, Takato has become a bit lazier as of late. <br>\r\n<br>\r\nIt has not come across his mind yet but all the summer eating has started to effect him. After <br>\r\n<br>\r\nsending a number of times chowing down at Ando's buffet. Takato has grown out throughout his <br>\r\n<br>\r\nbody. Over the couple of days, Takato has gain about 40 pounds. yet, Takato has not been aware <br>\r\n<br>\r\nof this. he was too busy eating that he now has quite the belly on him. His belly has gotten <br>\r\n<br>\r\nlarger with each pound. none of his shirts can really contain his fatten stomach. when he puts <br>\r\n<br>\r\non a shirt, his belly would hang out a bit. still, he did not notice that all too much. Along <br>\r\n<br>\r\nwith his enlarge belly, Takato has now breasts. small man boobs that rested a bit on his <br>\r\n<br>\r\nstomach. he also has chubbier arms but not too noticeable. his butt is much softer than before. <br>\r\n<br>\r\noverall, Takato is now a chubby boy.<br>\r\n<br>\r\n          Takato rested on his bed. there, he is body was exposed to all. lying down made him <br>\r\n<br>\r\nlook chubbier. gravity is pushing down on his body. his white belly extending it self across <br>\r\n<br>\r\nhis body. Takato's face puffed out a bit. giving him pitch-able cheeks for all to see.<br>\r\n<br>\r\n          Lying across from Takato is Guilmon, sound as sleep. just like his tamer, Guilmon has <br>\r\n<br>\r\ngrown out as well. most of his weight was directly to his belly. this made his weight gain <br>\r\n<br>\r\nstand out much more than Takato. however, Guilmon has gain as much weight as Takato. unlike <br>\r\n<br>\r\nTakato, Guilmon has notice his weight gain. for him, he did not care, due to him being more of <br>\r\n<br>\r\na glutton. Guilmon was contend with his fatty body. he enjoyed it too. making his body nice <br>\r\n<br>\r\nand squishy. oddly enough, this made sleeping much more comfortable.   <br>\r\n<br>\r\n          With out a moment to soon, an alarm was heard in the room of Takato. it took a moment <br>\r\n<br>\r\nto reach it's full effect. Takato gently put his hand on the alarm to stud it off. by command, <br>\r\n<br>\r\nit did just that. Takato opened his eyes to not only a new day but to a life.  <br>\r\n<br>\r\n<br>\r\n<br>\r\n          The sound of water hitting a furry body can be heard coming from Rika's bathroom. <br>\r\n<br>\r\nRenamon was finishing taking a bath. she turn off the stream of water. she stepped out and <br>\r\n<br>\r\nreached for the nearest towel. it took her a while to really dry off. once she was finished, she <br>\r\n<br>\r\ncame out of the bathroom and headed towards Rika's room. <br>\r\n<br>\r\n          Rika was on her computer looking up places to cool off during the summer. She has heard <br>\r\n<br>\r\nof a place in Tokyo where you can rent out a swimming pool out for a party. while she was doing <br>\r\n<br>\r\nthis, Renamon enter her room.\" oh, you are done, now for my turn\" said Rika. she turn off her <br>\r\n<br>\r\ncomupter and stood up to greet Renamon. she place her hand through her fur. \"I told you that <br>\r\n<br>\r\nthis shampoo does wonder to the body\" said Rika. \"yes, this shampoo was the right stuff for my <br>\r\n<br>\r\nfur\" answer Renamon. Rika headed towards the door. she got her clothes off her bed and turn to <br>\r\n<br>\r\nRenamon. \" just you wait when I use it for me.\" </span></div></div>",
            "created":1343365200,
            "id":1390456,
            "title":"a week later.."
        },
        "14":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "The Aftermath Saga",
                "The Heatwave Saga",
                "The Shadow Saga",
                "The Digital  Saga",
                "The Beyond Saga"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I am planing on my own stories after my main story<br>\r\n<br>\r\nyou can fellow my stories below and each will come with a description    </span></div></span></div>",
            "created":1313470800,
            "id":1169651,
            "title":"other"
        },
        "141":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "Year of the Trickster",
                "Project: Overload",
                "the other stories"
            ],
            "content":"<div class=\"\"><div> <span>The Aftermath saga takes places after events in my main story in this interactive story.<br>\r\n<br>\r\nthe Aftermath saga is about what fallows after the digimon tamers have gotten fat. In a way, it is fanfiction. <br>\r\n<br>\r\nIn, <b>Year of the Trickster</b> we see that Henry Wong and Terriermon have return from their trip. they find out of their friends have grown out. Meanwhile, strange happening are taking place in a local festival in Shinjuku, Tokyo.<br>\r\n<br>\r\nIn, <b>Project: Overload</b>, the tamers are back in school from their break. The gang try to fit in with the rest of normal students. However, not everything is normal at their school....   </span></div></div>",
            "created":1313470800,
            "id":1169727,
            "title":"The Aftermath Saga"
        },
        "1413":{
            "author_id":"red899",
            "author_name":"Cornelius slate",
            "choices":[
                "The Endless Harvest",
                "Land of the Sumos"
            ],
            "content":"<div class=\"\"><div> <span>In, <b>The Endless Harvest</b>, the gang travel with their parents to a getaway for winter break. It is a relaxing time for them but old foes come back to hunt them.....<br>\r\n<br>\r\nIn, <b>Land of the Sumos</b>, spring is here and the gang can't be even happier! Takato joins a small sumo team in his school to try to beat a ravel school. Meanwhile, the rest of the gang have to deal with the return of old enemies....</span></div></div>",
            "created":1313470800,
            "id":1169732,
            "title":"the other stories"
        }
    },
    "info":{
        "author_id":"red899",
        "author_name":"Cornelius slate",
        "brief_description":"a weight gain on the tamers and the digimon from the third season, as well as my stories ",
        "created":1313030520,
        "description":"<td align=\"left\" class=\"norm\">Rules: both male and female humans(as well as digimon) get fat in many ways!<br>\r\n<br>\r\n1. try to write a chapter longer than a paragraph<br>\r\n2. no sex or private bits<br>\r\n3. they can get as fat as you want<br>\r\n4. keep in touch with the show<br>\r\n5. making new character is okay<br>\r\n6. if you like vore, only digimon can do it<br>\r\n7. have fun and I will make my own stories too!  <br>\r\n<br>\r\nTake note that if you chose for humans, than ONLY the humans can gain weight<br>\r\nif you chose for digimon, than ONLY the digimon can gain weight<br>\r\nif you chose for humans &amp; digimon, than ONLY the humans &amp; digimon can gain weight <br>\r\n<br>\r\nthe story from ''more than one Tamer and digimon\" will be my main story for now, just to let you know. I will add stuff like \"other\" or \"something else\" for people who do not want to follow my story and if you want to follow my story, it will always be the first choice. <br>\r\n<br>\r\nIf you have not notice by now, I make creating some what of fanfiction stories here in the interactive story!<br>\r\nthese stories that I am making will be liner and will not be changed. however, remember that you can create your own stories or chapters within the interactive story. so my stories are off limit. <br>\r\n<br>\r\nNow for the stories themselves, you can find them in other. these stories take place after my main story in <b>more than one Tamer and digimon </b>. <br>\r\n<br>\r\nLastly, I ask you kindly to email me if you want me to keep on making these stories. Once I am done with the main Fat stories, I will continue them in an other place, However, would like some feedback from the many people who watch this here. thank you and have a nice time here! <br>\r\n<br>\r\nyou can now read some of my stories on fur affinity as well. <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.furaffinity.net/user/red899/\" target=\"_blank\">http://www.furaffinity.net/user/red899/</a></td>",
        "id":1800995,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570551660,
        "modified":1570551660,
        "pretty_title":"Digimon Tamers weight gain"
    }
}