{
    "chapters":{
        "1":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Male Almet",
                "Female Almet",
                "Male Valod",
                "Female Valod",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where will your journey begin?</span></div></span></div>",
            "created":1383800400,
            "id":1690962,
            "title":"Who will you be?"
        },
        "11":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Investigate the cause of the sound and shadow",
                "Wait and see if it approaches before assuming it's dangerous"
            ],
            "content":"<div class=\"\"><div> <span>As the herds main warrior, it's your job to look after the group while they sleep. You take first watch each night, armed with a single long spear. There are fires around the camp, to ward away the wolves. They've been encroaching as of late, though the head stallion can't fathom why--these woods are farther than they've ever traveled. <br>\r\n<br>\r\nYou walk a slow and careful circle around the sleeping mass of fifteen bodies. Some stand, some lay and lean their human torsos against one another for support. You glance at your sister, sleeping alone. She is the groups messenger, the one who speaks man's tongue and the one who taught it to you. She, in fact--<br>\r\n<br>\r\nYour thoughts break off at the sound of a snapping twig, and as your eyes find the location of the sound a shadow moves in the distance. The grip on your spear tightens.</span></div></div>",
            "created":1383867180,
            "id":1690967,
            "title":"Male Almet"
        },
        "111":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Allow her to rest, keeping watch to be sure she heads to her home, not your camp",
                "Offer to help her back to her own camp",
                "Turn, and leave her"
            ],
            "content":"<div class=\"\"><div> <span>You step forward, spear at the ready, hooves silent against the thick grass. As you near the space there's a gasp, shriek, and a figure leaps out--away from you. <br>\r\n<br>\r\nChase is given, the thing darting between trees. It's a human, obviously, but one that needs to be driven out of your herds camp. You're nearly upon the thing when it trips, shrieking again and falling over. You near and stand over it, but hesitate as it groans in pain. The human rolls over, revealing the face of a middle aged woman. She holds her ankle, breathing heavily.<br>\r\n<br>\r\nYou give her an angry face, and gesture with your spear. \"Go. Leave us be.\"<br>\r\n<br>\r\nShe nods, panting. \"I was, but...my ankle. I think it's broken...Please, I was looking for food. I have children. I just...need to lie and gather strength before returning...\"</span></div></div>",
            "created":1383867480,
            "id":1690968,
            "title":"Investigate the cause of the sound and shadow"
        },
        "1111":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Turn and flee with the others",
                "Turn and head to the gypsy camp to help "
            ],
            "content":"<div class=\"\"><div> <span>You take a few steps away, standing watch for all of ten minutes before she rolls over, getting to her feet. As she does so, you notice a dark tattoo across her hand and fingers, a typical gypsy marking. You make no comment, but watch as she gets to her good leg and leans against a tree. <br>\r\n<br>\r\nShe glances back and nods. \"Thank you...\" She turns, limping into the distance.<br>\r\n<br>\r\nYou turn as well, headed back to camp. Why on earth was she out here alone? Gypsies usually kept away from forests,  too tight to navigate their wagons through. Though the edge of this part of the forest was nearby, perhaps they camped along its rim? <br>\r\n<br>\r\nBack at camp, you stand watch once more. No damage was done in your absence, thank goodness. You make your slow circles until a fellow warrior snores himself awake, and stands. <br>\r\n<br>\r\n\"I'll take watch, Caesar.\" He says to you, stretching his legs. <br>\r\n<br>\r\nYou nod, thankful, and make your way to your sister. You lay down, tired, but your thoughts are still turning. Eventually you drift to sleep, but it's short lived. A shouting wakes you, and after a few moments of confusion you notice a pair of young human children running toward the herd, rather frightened. They pull up short, tears down their faces, and try to run around the group. <br>\r\n<br>\r\nYour sister is on her feet in an instant and calls out to them. They freeze, and as she tries to approach and calm them down, a woman holding her babe appears in the distance, fleeing with torn and bloodied clothes. <br>\r\n<br>\r\nYour stallion rears, addressing everyone. \"We flee! Farther into the woods!\"<br>\r\n<br>\r\nThe herd rises, turning and readying themselves to leave. Your eyes meet with your sisters as she gathers the children onto her back.</span></div></div>",
            "created":1383868200,
            "id":1690976,
            "title":"Allow her to rest, keeping watch to be sure she..."
        },
        "11112":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Take the young woman and flee with her",
                "Fight back, alongside the gypsies"
            ],
            "content":"<div class=\"\"><div> <span>You pick up your feet, turning toward the woman and passing her quickly. You thunder through the woods, following your instinct and, as you near, the smell of smoke. There is a loud commotion here, and you stop at the edge of the woods to take in the scene. <br>\r\n<br>\r\nFive wagons stand ablaze, their horses either slain or cut loose, running off in the distance. Women try to grab at their children--though some stand and fight with the men, but it's an obviously loosing battle. There are more bodies laying on the ground than standing on it, and one man turns to met your eye. He ducks away from his attacker, seizing the arm of a young woman and dragging her away from hers while dealing him a slice to the throat. The man crumples, and the couple approaches you. <br>\r\n<br>\r\n\"What are you--release me!\" The woman cries, trying to pull from the mans grasp. <br>\r\n<br>\r\n\"Take her and run.\" He says seriously, removing a necklace and stuffing it into her hand. \"You must do this now. Go.\"<br>\r\n<br>\r\n\"I could never just abandon--\"<br>\r\n<br>\r\n\"Then you condemn us <i>all</i> to die.\" He says, pushing her toward your back. \"Go, go..\"<br>\r\n<br>\r\nYou hold up your spear, uncertain. A woman screams as she's stabbed, a horse shrieks as its leads catch to flame.</span></div></div>",
            "created":1383868500,
            "id":1690981,
            "title":"Turn and head to the gypsy camp to help "
        },
        "1112":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Let her walk on her own",
                "Continue escorting her to the camp"
            ],
            "content":"<div class=\"\"><div> <span>\"I will aid you.\" You say, moving the spear into a less threatening position. \"Stand.\"<br>\r\n<br>\r\nThe woman seems grateful, and takes your hand as she gets to her feet. \"Thank you...\" She says, making her way to your back and sliding on. \"Our wagons should be straight west.\"<br>\r\n<br>\r\nYou walk with her silently, your vocabulary rather thin. After a five minute walk, she takes a deep breath. \"I smell smoke on the air. It's nearby. I can make it on my own, I think, if you wish to return to your people...\"</span></div></div>",
            "created":1383867720,
            "id":1690973,
            "title":"Offer to help her back to her own camp"
        },
        "11122":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Take the young woman and flee with her",
                "Fight back, alongside the gypsies"
            ],
            "content":"<div class=\"\"><div> <span>You don't slow, and continue to bring her to the camp. As you near, fire lights the horizon and you hurry your pace. She screams as she sees the fire grow larger as they grow closer, and when you reach the edge of the forest where it meets their camp you stop in awe. She slides from your back, unsheathing a dagger and leaping upon the nearest attacker. <br>\r\n<br>\r\nYou wait before rushing in, and take in the scene. Five wagons stand ablaze, their horses either slain or cut loose, running off in the distance. Women try to grab at their children--though some stand and fight with the men, but it's an obviously loosing battle. There are more bodies laying on the ground than standing on it, and one man turns to met your eye. He ducks away from his attacker, seizing the arm of a young woman and dragging her away from hers while dealing him a slice to the throat. The man crumples, and the couple approaches you. <br>\r\n<br>\r\n\"What are you--release me!\" The woman cries, trying to pull from the mans grasp. <br>\r\n<br>\r\n\"Take her and run.\" He says seriously, removing a necklace and stuffing it into her hand. \"You must do this now. Go.\"<br>\r\n<br>\r\n\"I could never just abandon--\"<br>\r\n<br>\r\n\"Then you condemn us all to die.\" He says, pushing her toward your back. \"Go, go..\"<br>\r\n<br>\r\nYou hold up your spear, uncertain. A woman screams as she's stabbed, a horse shrieks as its leads catch to flame.</span></div></div>",
            "created":1383868680,
            "id":1690983,
            "title":"Continue escorting her to the camp"
        },
        "14":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Tell her about your brothers woman, hoping she'll assume it's Valod",
                "Bid her goodnight, and keep your brothers secret"
            ],
            "content":"<div class=\"\"><div> <span>\"Mitan, haven't you finished yet?\"<br>\r\n<br>\r\nYou turn to your mothers call and smile a little. \"Not quite. I'll be in soon mother.\" You wait, and hear the door close behind her as she returns to the house. Your hands move absent-mindedly, pouring water over the small buds of plants that will, well into the month, become potatoes. Watering plants was your brothers chore, but he was off in the town. He'd said he was going to go sell his candles--a little hobby of his--but you knew there was a woman in the town he was with. You'd caught him in the lie days earlier, and promised to keep his secret.<br>\r\n<br>\r\nWith the watering finished, you replace the can by the well and walk along the fence line to the porch door, and enter. Your mother is looking at the window, toward town. She shakes her head when she hears you enter. <br>\r\n<br>\r\n\"That boy. Staying past sunset.\"<br>\r\n<br>\r\n\"It's still setting. Maybe he's on his way.\" You say, looking at the bright orange and purple skyline. <br>\r\n<br>\r\n\"He leaves me to so much worry. What could possibly be keeping him? And what could it be that he leaves before even doing his chores, putting them on your shoulders to carry for him?\"<br>\r\n<br>\r\nYou shake your head. \"I don't mind the chores.\"<br>\r\n<br>\r\nShe points a finger at you. \"You're too kind, Mitan. You'll be taken advantage of in life if you don't stand up for yourself.\"<br>\r\n<br>\r\nYou nod. \"Yes, mother...\"<br>\r\n<br>\r\nShe sighs, and turns. \"In any case, I'll talk with him in the morning. His father can sell the candles when he goes to town, the boy needs to stay here and work.\"<br>\r\n<br>\r\nYou glance at her. She's always going on about wanting grandchildren. Good, hardworking valod to keep on the farm after she's too brittle to do it herself. But there were certainly no valod in town, certainly not a valod at your brothers hand. This was part of the reason why the secret was so dear, you assumed. How would mother react if she knew her dear son was out with some snotty, spoiled Goslen who had no inkling as to what a day's work was? <br>\r\n<br>\r\nBut if she forbade him from going into town, he might be forced to sneak out and when the truth finally came to light...</span></div></div>",
            "created":1383869280,
            "id":1690989,
            "title":"Female Valod"
        },
        "15":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Male Quemaat",
                "Female Quemaat",
                "Male Noerok",
                "Female Noerok",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select your race wisely...</span></div></span></div>",
            "created":1383866820,
            "id":1690964,
            "title":"More Races"
        },
        "151":{
            "author_id":"finneas",
            "author_name":"Finneas Macabre",
            "choices":[
                "Make himself scarce before someone gave him some additional duties.  ",
                "Get his bow and make a sweep of the area surrounding their camp."
            ],
            "content":"<div class=\"\"><div> <span>It was a cool 70 degrees, on a sunny day with few clouds and a light breeze.  If you happened to be on one of the low surrounding hills, smoke could be seen lazily drifting from a small section of the forested valley. . . and were you to be a bird and fly towards that smoke, and then swoop under the thick canopy of the trees, you would happen upon a semi circle of seven wagons, a few tents and cooking fires next to a narrow stream.<br>\r\nThis is the camp of the Kaldera`roo Clan, which is to say, it is a rather large gathering of mostly family and extended family.<br>\r\n<br>\r\nDaijek was much like the other young men of his people, tall and lean with shoulder length dark hair, and an golden earring or two.  He had the traditional markings of his clan, which were the tattoo's adorning his hands and feet.  His mother had added a few individual touches like the ancient designs that ran down his spine from between his shoulder blades to his lower back.  That was not quite like the rest of his people, but his mother, Mirela, said she had learned them from her Puri daj (grandmother).  They were ruins of protection, strength and health, and his mother hoped it would help to keep her chavo (son) safe and healthy.<br>\r\n<br>\r\nLooking to the sky Daijek could see that it wasn't quite mid-day, but he'd already finished most of his chores.   He had started his morning with a quick breakfast of honey cakes and apples, made sure the horses were safe, and had food and water, set several rabbit snares, and collected enough wood so that his mother could cook the evening meal.  His mother and sisters (3 of them) would probably be turning the last of the deer meat into stew this evening, which was delicious, but would mean another hunt for him way too early tomorrow. . . still he wasn't complaining.  This had been a good year.<br>\r\n<br>\r\nShaking his hair back from face, although it would quickly reclaimed it's place over his left eye, Daijek decided he should probably:<br>\r\n<br>\r\n</span></div></div>",
            "created":1386232440,
            "id":1703545,
            "title":"Male Quemaat"
        },
        "1512":{
            "author_id":"finneas",
            "author_name":"Finneas Macabre",
            "choices":[
                "Travel up stream to the base of the hills, then circle the valley floor.",
                "Go down stream and find his cousin who should be standing watch up in a big tree"
            ],
            "content":"<div class=\"\"><div> <span>Making his way to the second largest of the wagons by the stream, Daijek decided to fetch his bow and arrows.  Walking up he greeted a couple of his aunts and female cousins that were washing clothes in the stream, as they traded stories and kept their eyes on three younglings playing in the grass. Further into the camp he could hear wood being chopped, the laughter of men, and the sound of someone (most likely his great uncle) picking out a new tune on his mandolin. It was good to hear laughter in the camp, and see his family safe.  It had not always been this way.<br>\r\n<br>\r\nHis family's wagon was almost twice the length of a horse and tall as himself, with a mural of a magical forest painted all around the wooden sides.  Mother was always adding some little detail here and there, which made the painting feel almost alive.  There was of course the tree's, grasses and vines of a forest, but mom would add eye's under a log by the creek, or fairies flittering about the branches.  The wagon carried all the essentials for then to survive, from pots, and pans, to medicinal herbs, food and clothing.  They usually slept in tents next to the wagon or underneath it when the weather was nice, and bugs permitting.<br>\r\n<br>\r\nNot bother to ascend the steps at the rear of the wagon, Daijek simply reached inside the door to the right and retrieved his bow and arrows. It was always good to be prepared when leaving the area near camp.  This forest seemed peaceful enough, but forest came with a collection of natural dangers as well as dangers from passer-by's.  \"The best way to keep everyone safe was vigilance\", that's what his papa had always said.  He missed his father, and always thought of him when he went on his \"sweeps\" around their camp.  Thinking of his father, made him remember that he didn't see his mother or any of his sisters around the wagon. . . but they were probably out gathering herbs, so Daijek passed by one of his aunts to let her know where he was off to.  She kissed his cheek and punched him in his leg as she mockingly scolded him to be careful.  Skipping out of her range for a second strike and sticking out his tongue Daijek made his way out of camp.<br>\r\n<br>\r\nLeaving camp Daijek decided to:<br>\r\n</span></div></div>",
            "created":1386917580,
            "id":1707014,
            "title":"Into the woods"
        },
        "152":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Admit that you have feelings for him, too.",
                "Apologize and say you don't see him that way.",
                "Thank him for the compliment, oblivious to his advance."
            ],
            "content":"<div class=\"\"><div> <span>\"Tiktet,\" You call. The coyote comes to your side, and gently takes the piece of meat you offer him. <br>\r\n<br>\r\n\"Your hunting dog is clever, Nan.\" Someone says to you. Turning, you find Min, a scout, with a broad smile. \"Mine would steal it from my fire. <br>\r\n<br>\r\nYou smile, and peel a strip of the meat from the spit and give it to him. \"Tiktet does not steal, because he knows I will offer it eventually.\" It was a metaphor, an inuendo, but she was still unsure if Min caught on. He smiled, and took the meat.<br>\r\n<br>\r\n\"Your mother is healing well?\" You ask. <br>\r\n<br>\r\nHe nods, and speaks through the mouthful, \"She is. She's darkened a few shades and is eating normally again.\"<br>\r\n<br>\r\nQuemaat were almost always in the sun, and so their skin was naturally dark. The strange pink his mother wore days ago was strange and frightening to witness. <br>\r\n<br>\r\n\"She was thankful to you, Nan. That you helped gather the weeds to make the medicine.\"<br>\r\n<br>\r\nYou take a bite of the meat and shrug. \"It was a duty to a sister, I would have done the same for anyone.\"<br>\r\n<br>\r\n\"Yes, but you do it differently.\" He said, staring. <br>\r\n<br>\r\nYou decide to humor him. \"How do I do it, then?\"<br>\r\n<br>\r\n\"You do it with your mind.\" Min says. \"Most do it with their heart, because it is their duty. You say this, but you also choose to do it because you wish to, yourself. It means much to me that you chose to help my mother, instead of help the men cut the tree. I heard they wished you were there to aid them.\"<br>\r\n<br>\r\nTrees were rarely cut down, but they needed wood for a boat. The river was nearby, and needed to be crossed. <br>\r\n<br>\r\nYou shrug and start to talk, but he inturrupts. <br>\r\n<br>\r\n\"You are beautiful, Nan, because you chose to be.\"</span></div></div>",
            "created":1383870300,
            "id":1691003,
            "title":"Female Quemaat"
        },
        "153":{
            "choices":[
                "a woman of Ozlah, these people always cause him trouble",
                "A Goslen princess who wants him to be her bodyguard",
                "His neighbor"
            ],
            "content":"<div class=\"\"><div> <span>It was another successful day in the mines. Crasskin and his fellow Noerok have dug up a boon of precious gemstones and gold. Crasskin was tall for a man of his race. Standing at 8'5\" he was not only the tallest, but also the strongest Noerok man. His obsideon colored hair and emerald green eyes attracted many Noerok, but he wasn't ready to settle down just yet. He wanted  to use what he mined to create jewelry to sell in Salo Market place. He was currently finishing up the last piece of jewelry that he wanted to make. It was a golden necklace. It had a dragon ornament at the very front which was embedded with a ruby.<br>\r\n<br>\r\n\"That's the last of the materials that can used for crafting jewelry. Maybe if I have time tomorrow a can forge a dagger or two.\"<br>\r\n<br>\r\nCrasskin looked at his collection of handcrafted weapons. He took great care to make sure that they stayed sharp. During his free time he would often practice with each of his weapons, but most of the time he had a busy day at the market. Many Goslen women would flock to his stall to pick up a trinket or two. Many of these women refused to speak to him, because they saw him as an inferior race. Like all Noerok would often boast of his exploits. In many of his conversations he would comment how stuck-up the Goslen women were that they refused to speak to him. His buddies would then laugh as they raised their mugs to celebrate either a successful day at the market or working in the mines.<br>\r\n<br>\r\nJust as he was about to fall asleep he heard a knock on his door.<br>\r\n<br>\r\n\"What fool would be knocking on my door this late at night?\"<br>\r\n<br>\r\nCrasskin heads over to the door armed with a dagger. If one thing was certain, he didn't trust people appearing on his doorstep late at night. When he opened the door he saw...</span></div></div>",
            "created":1436458140,
            "id":2005495,
            "title":"Male Noerok"
        },
        "155":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Male Ozlah",
                "Female Ozlah",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you certain?</span></div></span></div>",
            "created":1383866880,
            "id":1690965,
            "title":"Even More Races"
        },
        "1553":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Male Goslen",
                "Female Goslen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Goslen, then?</span></div></span></div>",
            "created":1383866940,
            "id":1690966,
            "title":"End of the List"
        },
        "15532":{
            "author_id":"relken0608",
            "author_name":"Heather I Relken",
            "choices":[
                "Ask if he'd like company for the night.",
                "Remember your place as a lady, and retire to your own home for the night."
            ],
            "content":"<div class=\"\"><div> <span>\"Are you certain?\" You ask him. Your fiancee nods.<br>\r\n<br>\r\n\"My mother will be just fine. Certainly I do think she'll be up all night, wondering where I am. But it won't kill her.\"<br>\r\n<br>\r\n\"And she'd never leave that little shack, either.\"<br>\r\n<br>\r\nHe winced. \"She wouldn't know what to do in a town. She'd get lost, poor thing.\"<br>\r\n<br>\r\nYou glance around the shabby inn as he gathers his belongings, setting them down in the corner. You offered to buy him a room at Amar A Estate, a much higher quality inn, but he refused. \"Then isn't it more concerning? What if she is so worried she tries to follow you?\"<br>\r\n<br>\r\nHe sighs. \"My dear, I mean <i>no</i> offence when i say this, but i'm not a man who's never had dirt or blood under his fingernails. She knows I can take care of myself, she only wishes i didn't have to.\"<br>\r\n<br>\r\nYou cross your arms and smile. \"Right. And so, why would being wed to me <i>not </i>ensure you wouldn't have to take care of yourself? Doesn't it align just <i>perfectly </i>with her ideals?\"<br>\r\n<br>\r\nHe laughs, coming to your side and holding your shoulders. \"Your humor is one of the main things I miss when I'm gone from you.\"<br>\r\n<br>\r\n\"I wasn't joking--<i>doesn't </i>it, though?\"<br>\r\n<br>\r\nHe sighs, and shrugs. \"She's a woman, and my mother. Who knows what she wants? Now, I've had a hard day. I'll be getting to bed...\" He turns, but gives you a meaningful look.</span></div></div>",
            "created":1383869700,
            "id":1690991,
            "title":"Female Goslen"
        }
    },
    "info":{
        "author_id":"relken0608",
        "author_name":"Heather I Relken",
        "brief_description":"Choose a race, and find their place in the world.",
        "created":1383866580,
        "description":"<td align=\"left\" class=\"norm\">Six races, spanning across three countries. Prejudices are held about each, in their own ways. Which appeals to you?<br>\r\n<br>\r\n1) Almet<br>\r\nThe almet are a horse-man race, long ago having been the peace keepers. When mankind decided they no longer needed such advisors, the Almet were driven away from their lands. Resentful, the Almet watched as their friends slowly waged war and polluted themselves. Now, they live scattered across forests and plains and avoid contact with man.<br>\r\n<br>\r\n2) Valod<br>\r\nThe Valod are kindly people who have an inbred green-thumb and understanding of livestock. They work as farmers and make the best vets. Valod are simple minded and stay away from politics and fighting, much more comfortable among plants and animals than their fellow humans.<br>\r\n<br>\r\n3) Quemaat<br>\r\nThese forest dwelling humans could be considered elves or witches, but those are old terms. They hold no magic, though a great understanding of healing herbs. They are a tightly-bonded unit of people, and when two tribes of the nomads meet, a joyous celebration is held. Members will often swap, choosing to spend time with their \"lost brothers and sisters\". The Quemaat believe all life is valuable, and when eating meat a thanksgiving is held for the life that was lost.<br>\r\n<br>\r\n4) Noerok<br>\r\nThese are a sturdy people, living their lives on the wall of a cliffside, dexterious and stubborn miners. The Noerok are merchant people who speak all languages and can appraise any piece of metal or gemstone. Sarcastic and quick-witted, these gossipers will make it well know to their fellows if you give them a hard time.<br>\r\n<br>\r\n5) Ozlah<br>\r\nConsidered the scum of the human races, and sometimes not even referred to as humans. These people are afflicted with Blindsight, a strange condition that prevents them from seeing color or light, but shape and movement come naturally. Their primary sense is that of smell, as evidenced by their lack of a nose and rather two long slits from their eyebrows nearly to their mouths. They grow no hair, and are often forbidden in cities--left to either starve, or steal. <br>\r\n<br>\r\n6) Goslen<br>\r\nThe high-and-mighty redheads who often have pockets lined with gold. The Goslen are a race of wealth, owning property and even people. These fair skinned folk are also the race of the royal ruling family, and so all others--related or not--feel like blood to the crown and they use this reputation to push around the other races. However, Goslen run a high risk of assassination--there's no need to kill off a harmless Valod, but a threat such as these red heads? Perhaps, for a good price...</td>",
        "id":1961815,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1436458140,
        "modified":1436458140,
        "pretty_title":"Tales from a different Earth"
    }
}