{
    "chapters":{
        "1":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Soshi",
                "Karin",
                "Chishio",
                "Naomi",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whose adventure will you follow?</span></div></span></div>",
            "created":1365051600,
            "id":1564531,
            "title":"The begining"
        },
        "11":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "He had actually been sleeping on the massive belly of his girlfriend Karin",
                "the bed is temperature and remote controlled"
            ],
            "content":"<div class=\"\"><div> <span>It was  another at the academy as the only boy student arose from his nightly slumber. Soshi Niji was the only boy at the prestigious Super Obese Monster Girls' Academy. He was close with the biggest girl in the school and she got him in and all the girls just took to him. He was the top student in most subjects. He yawns and sits up. He felt like his mattress was even softer and warmer than usual.</span></div></div>",
            "created":1389330000,
            "id":1725253,
            "title":"a New day"
        },
        "111":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Karin is content",
                "Karin asks her boyfriend to order more food",
                "They are interrupted by someone "
            ],
            "content":"<div class=\"\"><div> <span>Soshi gasped feeling the 'mattress' move up and down. He blushed realizing, \"Karin-chan?\"<br>\r\n<br>\r\nThe 'mattress' was in fact the massive king size mattress sized belly of his blob beauty vampiress girlfriend Karin Tepes. She was laying back crushing his queen sized bed beneath her collossal mass, poor bed never stood a chance. Karin opened her beautiful scarlet eyes and smiles lovingly seeing her adorable younger and smaller boyfriend awake, \"Morning Soshi-kun did you sleep okay?\"<br>\r\n<br>\r\n\"Yes Karin-chan,\" Soshi nodded.<br>\r\n<br>\r\nKarin giggles, \"My belly is a better bed than that old thing that is now rubble under my ass isn't it love?\"<br>\r\n<br>\r\nSoshi blushed. \"Yeah so big and warm,\"<br>\r\n<br>\r\n Karin was the biggest and most powerful student at the academy even the headmaster and teachers knew better than to upset her. Karin's belly alone was the size of the largest mattresses in the world more likely even larger, she had 25 flabby chins, her titanic breasts were so big they could completely trap a normal sized person forever, if the person fell into her valley of cleavage. Her collossal ass was so massive no human created chairs, beds, or couches could ever hold it. Karin's arms and legs were thicker than the largest tree trunks, her flabby feet would cause earthquakes whenever she moved and her flab jiggled like thick jello. Her flabby hands were larger than the largest dinner platters. Karin was Soshi's childhood sweetheart and his girlfriend.<br>\r\n<br>\r\n<br>\r\nThere was a low roar from her monstrous blimp like belly to signify her seemingly neverending hunger. The blond blob beauty giggled and strokes it, \"I took the liberty of having our breakfast brought here baby, I don't feel like going to the cafeteria today,\"<br>\r\n<br>\r\n\"Okay Karin-chan,\"  Soshi heard a knock on the door.<br>\r\n<br>\r\nKarin smiles, \"That must be the food deliverer,\" She opened the door with Telekinesis as a very fat lady but nowhere near Karin's girth rolled in a tray with a lot of silver covered platters on it. She brought the tray to the collosal vampiress and then leaves.<br>\r\n<br>\r\nKarin giggles and smiles to her lover, \"Soshi-kun dear, go ahead and eat what you want and then feed me what you don't eat,\" She winks at him making him blush cutely.<br>\r\n<br>\r\nSoshi slides down her belly and lands on the floor, \"Sure Karin-chan,\" He eats a portion of it and finishes.<br>\r\n<br>\r\nKarin giggles and rubs her growling belly, \"Come love, feed your princess,\"<br>\r\n<br>\r\nSoshi brought a huge platter filled with her favorite foods.<br>\r\n<br>\r\nKarin opens her mouth Soshi  dumps the whole platter in it. <br>\r\n<br>\r\nKarin gulps it all down and gives a small belch, \"BBBBBBuuuuuurrrrrppppp!!!\" She giggles and pats her belly opening her mouth again, \"More love,\"<br>\r\n<br>\r\nSoshi brought each of the remaining platters full of food and dumps it all down in his girlfriend's maw.<br>\r\n<br>\r\nKarin lets out a much bigger and louder burp, \"BBBBBBBUUUUUUUUURRRRRRRPPPPPPPPPPPP!!!!!!!!!!\" <br>\r\n<br>\r\nSoshi puts all the empty platters 50 in all back on the tray.<br>\r\n<br>\r\nKarin smiled, \"Come and rub my belly love your caress helps me digest faster,\"<br>\r\n<br>\r\nSoshi walks up to his collosal girlfriend and began rubbing her giant belly.<br>\r\n<br>\r\nKarin purrs and moans, \"Mmmmmmmm~ so good dear,\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1412744400,
            "id":1868979,
            "title":"Feeding Karin"
        },
        "1113":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Mizuki Niji",
                "Chishio Tepes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who interrupted them</span></div></span></div>",
            "created":1431505320,
            "id":1977568,
            "title":"They are interrupted by someone "
        },
        "12":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "A freshman girl arrogantly and foolishly challenges Karin",
                "Chisho wants Soshi to sit on her breast too",
                "Skip ahead to the next class"
            ],
            "content":"<div class=\"\"><div> <span>*BOOM* *BOOM*<br>\r\n<br>\r\nMany students all scattered as the ground shook violently as nearly 8-ton 18 yr old Karin Tepes, a powerful vampiress and the biggest girl in the entire academy waddled by. She had long wavy blond hair with black streaks in it. Her eyes were a crimson red with slit pupils in them, they occasionally glowed. She was truly a shocking and terrifying sight, her 90 foot 5500 lb belly stretched out in front of her and jiggled with her movement, her giant breasts weighed 2000 lbs each and measured about 250 ft in diameter, her midsection was basically a expansive mass of flabby rolls of fat, her thunder thighs were about 50 ft thick and weighed 1500 lbs each, her arms were the same size. Her face had 25 flabby chins and her cheeks looked like 35 large beachballs were stuffed in them. her monumental ass finally came into view, each cheek was double the size and weight of her breasts, weighing 4000 lbs and measuring 500 ft in diameter. Of course only her little boyfriend/lover Soshi Niji knew those exact measurements. Soshi rode atop his titanic girlfriend's huge breasts and often shyly went up to her head and snuggled against her flabby face. Soshi was 14 yrs old but looked younger than that like 10 or 11. He was also very small compared to his titaness of a girlfriend, he was almost like a flea on her giant breast.<br>\r\n<br>\r\nEveryone in the school knew better than to disturb their private moments. Once last semester, a small mean group of freshman girls had chased a poor victim into Karin and Soshi's shared room when they were about to make sweet love, interrupting them, greatly angering Karin something no one else ever did, the nearly 8 ton blonde beauty nearly crushed the bullies and their victim into a pulp, it was only the intervention of her little lover Soshi; him tenderly massaging her breasts and getting her back into the mood that stopped the vampire titaness from actually killing them.<br>\r\n<br>\r\nKarin was on her way to have breakfast and of course spend some quality time with her little boyfriend , who she loved and adored deeply. The only girl who even came close to Karin's girth was her own younger sister, Chishio, who weighed 10,800 lbs, over 5 tons. They also had a few friends who they've known since freshman semester, Naomi a Nine-Tailed Kitsune who weighed 7,900, Naomi was crazy about Soshi too but wasn't stupid as to challenge Karin, Sarah a beautiful young Harpy who also weighed 7,900 lbs, Kimiko a Fire woman who weighed 7,800 lbs, Yui a snow woman who weighed 7,700 lbs, Kiko a Siren who weighed 7'600 lbs, and Kuina a Cat-Girl who weighed 7,500 lbs. They all loved Soshi but knew better than try to take him from Karin and instead she agreed to share him with them, but she would be his main wife as she was the biggest and strongest of them; plus she has known Soshi longer.<br>\r\n<br>\r\nKarin found her younger sister Chishio and her friends already waiting for her and Soshi with the food already there. The table was just covered with dishes with piles of food on them.<br>\r\n<br>\r\nKarin sat down to the first of two dozen extra large burgers.<br>\r\n<br>\r\n \"Breakfast time, Soshi-kun.\" The beautiful blonde titaness cooed to her little lover. <br>\r\n<br>\r\nSoshi nodded. \"Ok Karin-chan.\" He briefly got off her breast and got some food for himself a much smaller portion of course and then he climbed back on her breast and started eating his portion.<br>\r\n<br>\r\nWhile they were eating...<br>\r\n</span></div></div>",
            "created":1365051600,
            "id":1564549,
            "title":"The nearly 8 ton Vampiress"
        },
        "121":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Kei uses her silk to (Attempt to) kidnap Soshi",
                "Kei grabs a piece of Karin's cake"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Vampire! I challenge you for that little cutie on your breast!\" Yelled another girl's voice.<br>\r\n<br>\r\nKarin was busy eating her burgers ignoring the voice.  Soshi heard it clearly though.  He wondered. '<i>Didn't Karin-chan hear that challenge?</i>'<br>\r\n<br>\r\nSoshi craned his neck and looked up at his titanic girlfriend's face from his perch atop her breast. \"Karin-chan, did you hear that?\"<br>\r\n<br>\r\n\"Heaw wat Soswi-kwn (Hear what Soshi-kun)?\" Karin asked, her words muffled and jumbled by all the food stuffed in her maw. <br>\r\n<br>\r\nSoshi blushed. \"Never mind.\"<br>\r\n<br>\r\nKarin swallowed and shoved another 3 extra large burgers into her  massive maw. <br>\r\n<br>\r\nThe person who yelled was pissed off that she was just ignored as if she was an insignificant pest. The girl had long straight black hair and red eyes. She was huge like all the girls here but compared to Karin, her friends and, her younger sister  she was considered a 'lightweight. The black-haired girl clenched her flabby fists in anger. <i>'How dare that blobby bitch just ignore me like I'm nothing!</i>'<br>\r\n<br>\r\nThe black haired girl was named Kei a Spider Woman, she weighed 5,400lbs one of the lightest first-year girls at the academy. Keiko was an arrogant spoiled bitch of a pig who lived up to her species' reputation of luring men wth her beauty and then eating them.  She devoured  hundreds of innocent men before coming here.  Keiko surprisingly didn't want to eat Soshi, she wanted to make him her little servant/lover for life. <br>\r\n<br>\r\nChishio didn't give the much weaker yokai even a glance,  instead the younger vampiress was focused on the 30 extra large pepproni and sausage pizzas before her. <br>\r\n<br>\r\nNaomi was using her 9 long tails to help feed her. <br>\r\n<br>\r\nYui was eating her food fast. Even though she was a Snow Woman she had lost her weakness to heat allowing her to finally enjoy heated foods. <br>\r\n<br>\r\nSoshi had finished his much smaller portion. \"That was good.\"<br>\r\n<br>\r\nKarin asked worry clearly visible in her jumbled words and muffled tone. \"Yow swre you donw't nweed mowe lowve? (You sure you don't need more love?)\" Karin was concerned for her boyfriend no matter how much he ate which was a lot for a boy his size, he never seemed to put any more weight on or grow taller, it's like he was cursed to remain short forever, not that the 8 ton blob beauty didn't mind ferrying her little lover everywhere, it was the best way for her to protect him, and it was a turn on to her to feel him anywhere on her mountainous form. <br>\r\n<br>\r\nSoshi smiled. \"I'm sure Karin-chan.\" <br>\r\n<br>\r\nKarin's fat balloon cheeks turned more pink as she blushed from his cute smile.  She swallowed her current meal. \"As long as you're okay, Soshi-kun.\"<br>\r\n<br>\r\nSoshi cleaned her breast of the crumbs that dropped on it.<br>\r\n<br>\r\nKarin moaned in pleasure, \"Oh yes darling, I always enjoy your hands on my sexy body.\"  The blobby blonde vampiress then turned her attention to the 30 reall tall vanilla buttermilk cakes with cream cheese icing for their dessert. \"Mmmm sis I'm pleased you rememebered that I loved cake for dessert!\" She grabbed a cake and scarfed it down in a single bite. <br>\r\n<br>\r\nKei shouted again. \"Hey listen to me you pig! I want that boy!\"<br>\r\n<br>\r\nKarin continued ignoring Kei and kept scarfing down her cakes. <br>\r\n<br>\r\nKei growled. '<i>I got to get her attention somehow...But how?</i>'</span></div></div>",
            "created":1365051600,
            "id":1565155,
            "title":"A freshman girl arrogantly and foolishly challe..."
        },
        "1211":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "See what happened to the last girls (Flasback)",
                "Karin chooses to turn Keiko into her slave",
                "Soshi has a compromise "
            ],
            "content":"<div class=\"\"><div> <span>Keiko had some lines ready to try and kidnap Soshi and she twitches a finger. The nearly invisible lines all converge on Soshi. Only to be caught in two flabby fingers. Karin was holding the threads with two fingers while still shoveling her cake into her mouth. <br>\r\n<br>\r\nKeiko was shocked, <i>'But how?! How did she notice?!</i><br>\r\n<br>\r\nKarin swallows the cake in her mouth, \"This is most pathetic attempt ever to steal my Soshi-kun.\" she then slowly twirls the threads around her fingers effortlessly dragging a struggling Keiko towards her. the poor Spider woman was no match for the immense vampiress's far superior physical strength. Karin smirks in thought, \"Now what to do with you?\" Her friends and sister were all glaring at the now cowering Spider woman. The vastly fat monster girls were outraged that this lower level yokai dare attempt to steal their man. <br>\r\n<br>\r\nKeiko was scared as she knew she was virtually screwed. Karin was known to be very protective of her boyfriend and VERY harsh on people who tried to seduce him from her. She remembered what happened to the last girls who had the ill fortune of getting in-between them. Their fates were kept secret and everyone just knew not to anger Karin ever again. The rumors about what Karin may have done to them terrified everyone. <br>\r\n<br>\r\nChishio suggested, \"Onee-chan how about you make her your slave?\" Their friends shouted their agreement.<br>\r\n<br>\r\n\"Hmm, it might have some benefits.\" Karin replied.<br>\r\n<br>\r\nSoshi felt small amounts of pity for the Spider girl he knew his girlfriend was quite protective of him. He shook his head and just sat on her breast in thought wondering if he could offer something that would make everyone happy. </span></div></div>",
            "created":1389330000,
            "id":1725278,
            "title":"Kei uses her silk to (Attempt to) kidnap Soshi"
        },
        "12111":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Karin comes along",
                "the tour continues "
            ],
            "content":"<div class=\"\"><div> <span>It was last year, Soshi was by himself on this day, He rarely was ever seen separate from his girlfriend Karin. He was hanging out in the courtyard when,he felt the ground shaking as 4 huge girls of near equal girth and size approach,  they were nowhere near as gargantuan as his girlfriend, her sister, or their friends but were still many times larger than him. These girls were freshmen and each looked to weigh between 4000 to 6000 lbs and stood between 10 to 12 ft tall. The lead girl was a red hair with blue eyes , there was also a brunette, a purple haired girl, and a blue haired girl. They had heard of the only boy in the school and wanted to meet him but didn't know,he was already in a relationship with the biggest girl in the school, they had heard the rumors but were optimistic and ignored them at the chance of winning over the cute boy.<br>\r\n<br>\r\nThe red haired girl smiles kindly, \"Hi there I'm Marie, these are my friends, Sarah, Emily, and Marisa,.\"<br>\r\n<br>\r\nThe others greeted him with smiles and giggles.<br>\r\n<br>\r\nSoshi was surprised at first that they were speaking to him, <i>Wow, they're actually talking to me without fear of Karin- chan.</i> Now don't get him wrong he truly loved his titaness girlfriend but he did like meeting new people by himself once in a while.<br>\r\n<br>\r\nSoshi smiled back.\"Hi I'm Soshi Niji,\"<br>\r\n<br>\r\nMarie giggles,  \"So Sempai- kun mind showing us around? \"<br>\r\n<br>\r\nSoshi smiled,  \"Not at all,\" He showed the 4 girls around the school.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1430729640,
            "id":1973223,
            "title":"Flashback "
        },
        "121112":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "It's Chishio Karin's younger sister and she goes to tell her",
                "One of the crowd goes to tell Karin"
            ],
            "content":"<div class=\"\"><div> <span>Soshi smiled as he showed the 4 freshman girls everything. <br>\r\n<br>\r\nMarie giggles, \"Its very interesting Sempai- kun,\"<br>\r\n<br>\r\nSarah smiles,  \"So Sempai- kun do you have a preference in girls? \"<br>\r\n<br>\r\nSoshi blushed at that, \"Well, um....\"<br>\r\n<br>\r\nEmily and Marisa giggle, \"Sarah! \"<br>\r\n<br>\r\nMarie smiles,  \"I'm curious too Sempai- kun.\"<br>\r\n<br>\r\nSoshi blushed and stutters. <br>\r\n<br>\r\nThe 4 girls giggled at his shyness to admit he likes morbidly obese girls like them.<br>\r\n<br>\r\nMarie poses making her fat jiggle, \"You love huge fat girls don't you Sempai- kun? \"<br>\r\n<br>\r\nSarah, Emily, and Marisa also pose for him and wink.<br>\r\n<br>\r\nSoshi blushed at the boldness. <br>\r\n<br>\r\nA small crowd had seen it and we're also amazed at the new girls' guts.<br>\r\n<br>\r\nOne girl whispered, \"If Karin finds out,\"<br>\r\n<br>\r\nAnother nodded, \"Those four are goners, she would never punish her man.\"<br>\r\n<br>\r\nA third girl agreed, \"Yeah she loves him far too much to punish him really.\"<br>\r\n<br>\r\nA fourth chimed in,  \"Yeah remember what happened for his last' punishment'?\"<br>\r\n<br>\r\nThe first girl nods, \"Yeah all he had to do was buy food and feed her for several months.\"<br>\r\n<br>\r\nThe second girl nodded, \"Yeah not really a punishment since he feeds her a lot anyways.\"<br>\r\n<br>\r\nThe others nod in agreement.<br>\r\n<br>\r\nSoshi stuffed tissues in his nose.<br>\r\n<br>\r\nThe 4 girls giggle and hug him pinning him between their massive fat figures. <br>\r\n<br>\r\nThey were unaware of the person who saw this.</span></div></div>",
            "created":1430746620,
            "id":1973280,
            "title":"Touring the school "
        },
        "1211121":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Follow Chishio and Karin as they arrive",
                "See what Soshi and the freshman girls are doing "
            ],
            "content":"<div class=\"\"><div> <span>Chishio was Karin's younger sister by a few minutes and weighed over 5 tons and standing just under 10 ft tall. She frowned seeing the freshman flirting with her sister's and her hopeful boyfriend, \"Nee-chan won't like hearing this.\" she waddled off to go tell her big sister. She looked around and then felt the ground shake and it didn't come from her, it was much more violent. she knew those quakes were her big sister's steps. <br>\r\n<br>\r\nKarin was waddling around searching for her little boyfriend worriedly, \"Soshi-kun where are you honey?!\" The near 8 ton vampire titaness had woken up this morning only to find her boyfriend wasn't on her belly like he usually would be as they share the same dorm room. It worried the blob beauty greatly fearing something might've happened to him. She looked all over the school so far.<br>\r\n<br>\r\nChishio waddles up, \"Nee-chan,\" <br>\r\n<br>\r\n\"Chi have you seen Soshi-kun?\" Karin asked her younger sister. <br>\r\n<br>\r\n<br>\r\n\"Yes Nee-chan,\" Chishio explained. \"There are 4 new freshman girls and they are trying to seduce him Nee-chan.\" <br>\r\n<br>\r\nKarin narrowed her eyes, \"Oh? some foolish new girls are trying to move in on my man? Take me there now Chi.\" <br>\r\n<br>\r\nChishio nods, \"Yes Nee-chan.\" She waddles off with Karin following.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1430768880,
            "id":1973385,
            "title":"Karin finds out"
        },
        "12111211":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "\"You look like you'd make a comfy cushion. \" (Squashing/Crushing) ",
                "\"I'll eat you!\" (Vore) "
            ],
            "content":"<div class=\"\"><div> <span>Karin and Chishio waddled their combined weight of nearly 13 tons shook the entire area as they neared where Soshi was with the freshmen girls.  <br>\r\n<br>\r\nKarin was enraged that some new girls thought they could just move in on her boyfriend like that without any consequences.  She would show them just what happens when you try to come between her and Soshi.<br>\r\n<br>\r\nChishio couldn't wait to see what her nee-chan would do to those freshman girls.<br>\r\n<br>\r\nSoshi was trying to stop Marie from kissing him, \"Marie- San please, I think you are very nice but if Karin- chan found out..\" He felt the ground shaking in a rhythm which he recognized,  \"Uh oh, Marie- San you and your friends need to leave quickly, \"<br>\r\n<br>\r\n\"Why? Sempai- kun?\" Marie asked.<br>\r\n<br>\r\nKarin stomped over, \"Why indeed?\"<br>\r\n<br>\r\nMarie and her friends gasped at the sight of the massive vampire.<br>\r\n<br>\r\nSoshi spoke, \"Karin- chan I um...I,\"<br>\r\n<br>\r\nKarin held one flabby hand up, \"You don't have to say anything Soshi- kun, it's okay Chi told me everything.\" She glares at the much smaller girls, \"These sluts are trying to seduce you. Its not your fault honey.\"<br>\r\n<br>\r\nMarie became very afraid of Karin's death glare at her and her friends.<br>\r\n<br>\r\nKarin waddled up to Marie towering over her by 5 feet, \"So you dare introduce yourself to my boyfriend and flaunt your small light self to him? You can't compete with all this.\" She does a sexy pose making all her beautiful mountainous flab jiggle like jelly.<br>\r\n<br>\r\nSoshi got a nosebleed and blushed. <br>\r\n<br>\r\nKarin smirked noticing her boyfriend's reaction and poses more for him,\"See? You only made him blush, but my boyfriend sees my beautiful body and he nosebleeds.\"<br>\r\n<br>\r\nMarie shivered,  \"What are you going to do to me? \"<br>\r\n<br>\r\nKarin pondered,  \"That's a good question,  what should I do to a little newbie who tried to seduce my man?\"</span></div></div>",
            "created":1430837940,
            "id":1973894,
            "title":"the rage of an 8 ton vampiress  "
        },
        "121112111":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Karin feels gassy (Fart Torture)",
                "Karin began sucking Marie inside her ass (Anal Vore)"
            ],
            "content":"<div class=\"\"><div> <span>Karin smirked at Marie, \"You look like you'd make a very nice cushion for me.\" <br>\r\n<br>\r\nMarie paled seeing just how much bigger Karin was than her clearly, Marie stood just around 9 ft tall and weighed 6,030 Ibs just over 3 tons. But Karin stood over 14 ft tall being a literal mini-giantess and weighed nearly 16,000 lbs nearly 8 whole tons. She knew that  if Karin sat on her, then she would be completely enveloped beneath the  much bigger girl's flab.<br>\r\n<br>\r\nMarie slowly backs up from the smirking mini-giantess vampire. She pleads, \"No please don't sit on me!\" she felt a big soft wall behind her and looks over her shoulder to see Chishio standing behind her. <br>\r\n<br>\r\nChishio smirked, \"Cushions don't move.\" she held Marie, \"Nee-chan where do you want to sit on her?\"<br>\r\n<br>\r\nKarin smirks, \"Here is fine and make her little friends watch every bit of it.\" She waddled up to Marie as her sister pushes her down to the ground. the blonde titaness slowly turns her massive bulk around so her wide flabby back was facing Marie along with her monumental ass. <br>\r\n<br>\r\nMarie paled and tries to move to no avail. <br>\r\n<br>\r\nKarin giggles and wiggled her massive moon sized huge fat ass, \"Ready cushion?\"<br>\r\n<br>\r\nMarie pleaded which again fell on deaf ears.<br>\r\n<br>\r\nKarin slowly lowers herself onto Marie, her giant shadow completely blocked any light from reaching her.  Her massive ass slowly comes down tauntingly on  Marie.<br>\r\n<br>\r\nMarie pleaded seeing a literal moon about to come down on her, \"NOOOOO PLEAS *MMMMMMPH!*\" <br>\r\n<br>\r\nKarin sat her gargantuan ass down on Marie, cutting off her pleas. She kept going completely enveloping Marie in her deep vast crack, and hit the ground causing a strong earthquake. Some of the trees nearby were actually knocked down by the powerful quake.  <br>\r\n<br>\r\nChishio waddled up to her sister and giggles not seeing even a little bit of Marie showing , \"Wow Nee-chan you are completely covering her.\"<br>\r\n<br>\r\nKarin giggled and wiggles her massive derrière, \"Mmmm I was right she is quite comfy.\" She closes her eyes relaxing.</span></div></div>",
            "created":1430921340,
            "id":1974323,
            "title":"a vampire's cushion"
        },
        "1211121111":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "The farts grow wetter and soon she has to shit",
                "the farts get stronger and louder"
            ],
            "content":"<div class=\"\"><div> <span>Karin felt a huge rumble in her belly, \"Oh dear I'm feeling some gas coming up.\" she pats her belly as the rumble got closer to Marie's position, \"Brace yourself cushion here it come!\" She grunts and unleashed a thunderous loud fart. PPPPPPPPPPPPPPPPHHHHHHBBBBBBBBBBBTTTTTTTTTTTTT!!!!!!!! the massive fart shook the ground in another earthquake. <br>\r\n<br>\r\nMarie gagged and coughed under Karin at the horrible stench. <br>\r\n<br>\r\nEven Chishio waved her hand in front of her nose, \"Whoa Nee-chan that stinks! What did you eat today?\" <br>\r\n<br>\r\nSoshi was used to smelling girls' gas as his loving mother who nearly weighed 9 whole tons had much  stronger gas and often let her gas loose whether she was consciously aware of it or not at the times. His house was full of the stench of her farts, all his sisters were just as gassy as she was. <br>\r\n<br>\r\nKarin giggled and thinks for a bit, \"I don't remember but obviously something that gave me some real powerful gas.\" Her huge belly gurgled again with more, \"Uh-oh cover your nose Chi, I got some more brewing.\" She was also fully aware of her boyfriend not being bothered by her farts from the beginning which is why she never felt embarrassed or hesitated in letting it rip in front of him. <br>\r\n<br>\r\nChishio plugged her nose just in time as her big sister let loose an even stronger thunderous fart. <br>\r\n<br>\r\nPPPPPPPPPPPRRRRRAAAAAARRRRRRRRRRRPPPPPPPPPPBBBBBBBRRRRRPPPPPPTTT!!!!!!!!<br>\r\n<br>\r\nThis one was clearly visible nearly in the form of a green-yellow rank semi-solid smog seeping from her ass crack.  Karin giggled waving her own flabby hand in front of her nose, \"Wow excuse me that one was smelly!\" <br>\r\n<br>\r\nMarie was coughing and gagging beneath the blob vampiress  as the fumes that hadn't escaped yet were caressing her and making her smell their scents. she screamed and struggled hard to no avail, she was stuck deep in her crack just in front of her asshole.<br>\r\n<br>\r\nKarin moaned from her cushion's struggles, \"I think my little cushion likes my gas.\" She lets another thunder-like fart rip. FFFFRRRRRRRRRRRRRRRRRRPPPPPPPPPBBBBPPPPPPPPBBBBLLLLLBBB!!!! This one made her massive ass cheeks jiggle like pudding. She giggled from it, \"That one felt a bit wet,\" </span></div></div>",
            "created":1431286020,
            "id":1976189,
            "title":"Gassy Vampiress"
        },
        "1211121112":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Deal with the other girls",
                "Leave with her man"
            ],
            "content":"<div class=\"\"><div> <span>Due to the way both girls were positioned, Marie ended up getting her head stuck in Karin's anus. \"Mmmm, my, my, my. It seems she wants to take it to the next level.\" Shuffling her great behind, Karin began the task of shoving the \"smaller\" girl into her behind. As she getting further in the giant vampire, Marie realizes what was happening and struggles, to no avail. Actually, this action only added to Marie's doom, as it increased the speed for Marie withdraw into Karin's bowels. \"Oh, yeah. Keeping struggling, bitch.\" At this point, Marie's hips and legs were only sticking out, would be a problem if someone wasn't Karin's girth. In mere seconds, Marie's legs were slurped up. <i><b>B-B-BRRRRTPRTTTRRRRRRAAAAMRT</b></i> The fart signaled Marie's demise, with Karin rubbing her large gut. \"Nee-san, I can barely see her. A girl of her stature stood no chance against a person of our strength,\" Chishio giggles as tiny bumps appeared and disappeared on the older vampire's stomach. \"Indeed.\" Standing up to her actual height, Karin looks at the remaining girls, and says aloud, \"What's next.\"</span></div></div>",
            "created":1431624360,
            "id":1978025,
            "title":"Cushion eating"
        },
        "121112112":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "\"Take them to my room I'll  eat them later.\"",
                "\"They might make good slaves.\""
            ],
            "content":"<div class=\"\"><div> <span>Karin smirks as her massive gut rumbles ominously in hunger and she strokes it, \"I'm a bit hungry right now so I'll eat you!\" She licks her lips as she looks down at the terrified smaller girl, \"Now as a vampire, I prefer my meat fresh and raw. Let's get this over with quickly, I have some special personal time with my boyfriend to do.\" <br>\r\n<br>\r\nSoshi blushed at that and this wasn't the first time he has witnessed his girlfriend devour someone whole, he had seen it before and it always turned him on to watch his woman eating someone else to add on to her mass. <br>\r\n<br>\r\nMarie cowered and turns to try and escape only for Chishio to block her escape path with her 5 ton girth.<br>\r\n<br>\r\nChishio waves her flabby finger in front of her face, \"Silly food. Food doesn't run, it just stays to be eaten!\" She nods to her sister. <br>\r\n<br>\r\nKarin smiled, \"Well done Chi.\" She grabs Marie and opens her mouth wide shoving the red head into her mouth head first. <br>\r\n<br>\r\nMarie screamed muffled and flails about trying to get free to no avail. <br>\r\n<br>\r\nKarin began to swallow pulling Marie's head down into her throat and her fat neck and wide flabby shoulders soon filled her mouth, luckily as a vampire Karin didn't need to breathe; so she was easily able to gulp the red head further into her body. <br>\r\n<br>\r\nSarah, Emily, and Marisa were scared and trembling.<br>\r\n<br>\r\nKarin gulps the squirming red head down further and further. <br>\r\n<br>\r\nMarie was nearly halfway inside the vampire's body, she was crying and pleading to no avail. She felt her face press against  the slit at the end of Karin's throat which opened revealing the massive humid chamber that was her stomach. Marie struggled more as her head entered Karin's belly. Soon Marie quickly realized it was hopeless and just gave into her fate as she was further pushed into her temporary prison and final resting place.<br>\r\n<br>\r\nKarin felt her prey give up and capitalized the opportunity, she tilts her head back and lifts Marie's flabby legs; the last part of her to swallow. Gravity aided her swallow as the legs quickly went into her mouth and slid down her throat, Marie's toes were the last seen outside of Karin's mouth. Karin quickly slurped them in and with an audible loud gulp fully deposited Marie into her belly. Karin's already mattress sized belly ballooned to an even greater size to accommodate her super sized meal. <br>\r\n<br>\r\nKarin sighed in content and rubs her bloated blimp size belly and gave out a loud thunderous burp that made her entire flabby body jiggle like Jello.<br>\r\nBBBUUUUUUUUUUURRRRRRRRRRRRRRRRRRRRRPPPPP!!!!!!<br>\r\n<br>\r\nChishio giggled, \"Excuse you nee-chan, how was she?\"<br>\r\n<br>\r\nKarin smiles at her sister and continued stroking her belly, \"Delicious Chi, one of the tastiest live meals I've ever had.\" She sat down on a specially reinforced bench nearby which her massive ass took the entirety of and even reinforced it still creaked and groaned. She smiles and beckons her boyfriend, \"Soshi-kun, come and rub my belly.\" <br>\r\n<br>\r\n\"Of course Karin-chan.\" Soshi walks over to his currently bloated girlfriend and climbs her belly.<br>\r\n<br>\r\nKarin giggled as her boyfriend's climbing tickled her. <br>\r\n<br>\r\nSoshi got to a good spot and began to rub her giant  belly.<br>\r\n<br>\r\nKarin moaned and arched her head back closing her eyes, \"Oh yes hon.\"  Her belly gurgles and groans as it began to digest her meal. <br>\r\n<br>\r\nChishio looked to the other three girls who were petrified by what they had just seen. She asked, \"Nee-chan what about the other 3 girls?\" <br>\r\n<br>\r\nKarin pondered while enjoying her boyfriend's belly massage which helped accelerate the digestion of her prey.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1430840460,
            "id":1973903,
            "title":"A vampire's meal"
        },
        "1211121122":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "\"Bring me some food from the cafetria.\"",
                "\"Massage me.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Bring them to me Chi, they will become my slaves,\" Karin told her little sister as she enjoys Soshi massaging her fat bloated belly as it digests her meal.  Sarah, Emily, and Marisa were terrified as Chishio approached them they knew better than to try and resist as they were no match for a vampire and them being much weaker yokai.  <br>\r\n<br>\r\nChishio smirked and dragged the three smaller girls over to her relaxing big sister Karin who just laid there on the bench enjoying her belly massage from her boyfriend. \"Here they are nee-chan,\"<br>\r\n<br>\r\n\"Thanks imouto-chan,\" Karin said as she smirked down over her massively bloated gut at the smaller shorter girls. \"So what made you three and your friend who is now my lunch think you would win over MY boyfriend?\" <br>\r\n<br>\r\nSarah stuttered. \"W-We didn't know we swear,\"<br>\r\n<br>\r\nEmily nodded. \"Y-Yeah we've heard the rumors about him being in a relationship but never thought you were his girlfriend.\"<br>\r\n<br>\r\n\"I'm much more than just Soshi-kun's girlfriend, I'm his future wife,\" Karin replied smirking. \"He and I have known each other since before we came to this schol, we are childhood sweethearts,\" <br>\r\n<br>\r\nSarah, Emily, and Marisa gasped.<br>\r\n<br>\r\n\"that's right you never had even a chance to try and take him, Soshi-kun is my mate and future husband,\" Karin replied now glaring at them. \"And I am very protective of my man,\" Her red eyes began to glow as she caught them in her hypnotic gaze. \"As you have tried to take my man, you must be punished, from here on out you  three will be nothing but my loyal slaves you will do anything I or Soshi-kun command and anything any children Soshi-kun and I have in the future say as well,\"<br>\r\n<br>\r\nSarah, Emily, and Marisa nodded as they fell completely under her hypnotic control. \"Yes,\"<br>\r\n<br>\r\nKarin smirked as she had them now completely under her power. \"Now you will regain your will but you will be loyal only to Soshi-kun and I you will refer to me only as Mistress or Mistress Karin and my Soshi-kun as Master or Master Soshi,\"<br>\r\n<br>\r\n\"Yes Mistress,\" They replied.<br>\r\n<br>\r\nKarin smirked and nodded as she gave them their will back.<br>\r\n<br>\r\nSarah, Emily, Marisa blinked and then bowed to Karin. \"What is your command mistress?\"<br>\r\n<br>\r\nKarin smiled as she thinks for a bit...</span></div></div>",
            "created":1493580180,
            "id":2313101,
            "title":"\"They might make good slaves.\""
        },
        "15":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Sarah",
                "Yui",
                "Kiko",
                "Kunia",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else will you choose?</span></div></span></div>",
            "created":1371963600,
            "id":1616482,
            "title":"More choices"
        },
        "155":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Lucertia",
                "Aiko",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Soshi's family?</span></div></span></div>",
            "created":1380776400,
            "id":1673912,
            "title":"Niji Family"
        },
        "1551":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Its liquid shit",
                "Its dry and a lot of logs",
                "her daughters come to use their 'father' too"
            ],
            "content":"<div class=\"\"><div> <span>At Soshi's home, his mother Lucertia was sitting on her special reinforced couch, made from an old flat bed truck, worried about her little boy. Lucertia was a massive blob of a woman, a literal mini giantess SSSBBW. She stood over 15 ft tall and weighed 17,500 Lbs, nearly 9 whole tons. Her giant matress like belly was able to cover a large truck with ease and crush it, her mammoth ass could crush a tractor trailer, her arms and legs were covered in thick flab thicker than redwood tree trunks, her huge flabby hands were the size of garabage can lids with her fingers larger than sasuages. Her face was wide and round, her cheeks were as big as large yoga balls, and she had over 30 flabby chins. Her hair was wavy and flowed down her flabby back stopping just above her mounmental ass. <br>\r\n<br>\r\nLucertia held her flabby garbage lid sized hands together as she thought of her precious son, \"Oh Soshi, my little baby I hope you're okay,\" She felt squriming under her massive ass and growled, \"Oh shut up, you worthless bastard!\" She ripped out a massive smelly thunderous fart. PPPPPPPPPPHHHHHHHRRRRRRRRAAAAAAAAAAAAATTTTTTTTTTTTTT!!!!!!!! She smirked evilly hearing muffled gagging under her, \"Breath my natural air slave!\" <br>\r\n<br>\r\nUnder her mountainous ass, wedged in her vast crack was her worthless ex-husband Josh who looked like a darker haired version of her baby boy Soshi. Lucertia hated her husband as much as she loved her son, the minute she gave birth to Soshi she fell in love with her little boy. He was just born and she already viewed her son more as a man than his father no sperm donor. Josh was a weak worthless excuse for a man and was divorced and enslaved by his ex wife and daughters, he was given an experimental drug to give him the attriubtes of a perfect slave, toliet, cushion for Lucertia and her daughters. His only air was the air from Lucertia and her daughters' massive asses and his drink and food was their piss and shit. They owned him and Lucertia made sure her little boy never knew of the bastard spinning a tale of his father dying on the year he was born.<br>\r\n<br>\r\n\"So slave how does it feel to be owned by a beautiful woman like me?\" Lucertia asked in an condescending haughty tone. She farts again. BBBBBBBBBBBBBBRRRRAAAAAAPPPPPPPPPPPPPPPPPP!!!!! \"Ahhhh sorry slave, I did that one on purpose,\" She let out a low hissing SBD immediately after that one and giggles, \"Sorry that one was accidental slave,\" She wiggles and grinds her ass on the bastard relishing in hearing his screams.<br>\r\n<br>\r\nHer massive belly rumbles as she grinned evilly, \"Looks like you're gonna have an early lunch today slave,\" She rubs her belly as her asshole puckers open.</span></div></div>",
            "created":1415222400,
            "id":1882115,
            "title":"The 9 Ton Mother"
        },
        "1553":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Akemi Niji",
                "Ai Niji",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who is it </span></div></span></div>",
            "created":1431505140,
            "id":1977566,
            "title":"Other"
        },
        "15533":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "Mizuki Niji",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> is it Mizuki Niji</span></div></span></div>",
            "created":1431505260,
            "id":1977567,
            "title":"other"
        },
        "155332":{
            "choices":[
                "Megumi Niji",
                "More than one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last sister</span></div></span></div>",
            "created":1485302400,
            "id":2268710,
            "title":"next"
        },
        "1553322":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "Cousins",
                "Grandmother"
            ],
            "content":"<div class=\"\"><div> <span>How about his cousins? They go to the same school as their favorite cousin, Soshi, and love him dearly, almost the same extent as his family. But they're much smaller than them and it has been years since they had last seen Soshi and vice versa.<br>\r\n<br>\r\nOr perhaps we go with Soshi's maternal grandmother, as she's one the one that gave Soshi's family the 'good' genes, if you know what I mean.</span></div></div>",
            "created":1485305700,
            "id":2268757,
            "title":"Cousins or grandmother?"
        }
    },
    "info":{
        "author_id":"animefanjm",
        "author_name":"Hollowichigo2nd",
        "brief_description":"This is an alternate version of Soshi Niji and his Giant SSBBW Girls.",
        "created":1365067020,
        "description":"<td align=\"left\" class=\"norm\">14 yr old Soshi Niji is the only boy in an all girls' academy and this one is a very special academy for very unique and super-sized girls.<br>\r\n<br>\r\nMain Characters:<br>\r\n<br>\r\nSoshi Niji (14 yrs old, looks younger though, 3'11, 108lbs): He is kind,smart, loving, and extremely shy around girls, he is the lover of the biggest and most powerful girl at the academy and is the only boy there.<br>\r\n<br>\r\nKarin Tepes (18 yrs old,  14'1, 15,900lbs): the biggest girl at the Super Obese Monster Girls' Academy, she adores her little boyfriend/lover Soshi and will kill anyone who hurts him or even looks at him wrong.<br>\r\n<br>\r\nChishio Tepes (16 yrs old, 9'11, 10,800lbs): Karin's younger sister, she too adores her sister's boyfriend and Karin has promised to share him with her. Second biggest girl in the academy. <br>\r\n<br>\r\nNaomi: (18 yrs old, 9'6, 7,900 lbs): A Nine-Tailed Fox who Soshi has known since freshman year. She loves him too. <br>\r\n<br>\r\nSara: (18 yrs old, 9'5, 7,900 lbs): A Harpy who also is a friend and love interest of Soshi's.<br>\r\n<br>\r\nYui: (17 yrs old, 9'5 7,800 lbs): A Snow Woman who has deep feelings for Soshi. <br>\r\n<br>\r\nKiko (17 yrs, 9'4, 7,700 lbs): A Siren who has feelings for Soshi but is too shy to admit them. <br>\r\n<br>\r\nKunia: (17 Yrs, 9'1, 7,600 lbs) A Cat-Girl who loves Soshi too. She is ver playful as expected of her species. <br>\r\n<br>\r\nSoshi's family:<br>\r\n<br>\r\nLucretia Niji (39 yrs old, 15'6, 17,500lbs): Soshi's mother, she is a stay at home mom and loves her son deeply, she often sends him letters asking how he's doing<br>\r\n<br>\r\nAiko Niji (26 yrs old 13'1, 9,980 lbs): Lucretia's eldest child and Soshi's eldest sister she often makes her little brother's food for him to take to school with him.<br>\r\n<br>\r\nAkemi Niji (20 yrs 13', 9,500 lbs): Second eldest sister, loves to dress and undress in front of Soshi.<br>\r\n<br>\r\nAi Niji (18 yrs 12'10, 9,300 Ibs): Youngest of the elder Niji girls loves to sneak into Soshi's room and cuddle with him at night. <br>\r\n<br>\r\nMizuki Niji (9 yrs old 12'5, 8,800 lbs): Soshi's little sister she adores her big brother and often worries about him. <br>\r\n<br>\r\nMegumi  Niji: (8 yrs old 10'5, 8,800 lbs): The youngest of Lucretia's children, like her older sisters she loves her big brother very much<br>\r\n</td>",
        "id":1927287,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1493580180,
        "modified":1493580180,
        "pretty_title":"Soshi's SSSBBW Monster Girls"
    }
}