{
    "chapters":{
        "1":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Male ",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Today was going to be an ordinary day. The gym is full with other gymnast and the trainer was blowing his top as usual yelling at anyone that make even make one mistake. Before we go any further, who are you? </span></div></span></div>",
            "created":1322370000,
            "id":1230133,
            "title":"Chapter 1: Gender"
        },
        "11":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Ryan",
                "Brian",
                "Richard"
            ],
            "content":"<div class=\"\"><div> <span>You are a male gymnast. What is your name?<br>\r\n<br>\r\nRyan- 17, strong fit body, alway strive to be perfect in his technique but can be quite cocky sometimes.<br>\r\n<br>\r\nBrian- 23, Slim body, friendly, funny person that everyone wants to hang around with.<br>\r\n<br>\r\nRichard- 29, Slim body, Mainly keeps to himself while training.<br>\r\n<br>\r\n</span></div></div>",
            "created":1322370000,
            "id":1230142,
            "title":"Male "
        },
        "111":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Hides somewhere",
                "Try to see who it is to get help"
            ],
            "content":"<div class=\"\"><div> <span>Ryan was a well fit 17 year old gymnast. HIs six pack abs and charming face is what makes all the girls go gaga over him. Ryan is one of the best on the gynmastics team at his high school, but he can sometimes boast about himself about it. Some the men alway like his cockiness and some get mighty piss about Ryan always saying that he was best and he can take on all of his teammate. Ryan's dream in life is to become to be part of the Olympic and become the best gymnast in the US. He determined to achieve this dream and nothing is going to get in his way.<br>\r\n<br>\r\n<br>\r\nOne day after practice, Ryan headed to the locker room and take a shower and go home. Their was no one in the locker room since Ryan took an extra hour of practice while everyone went home. He went to his locker to get his soap and towel. When he got to his locker, he started to feel weird. His clothes were getting baggier and the locker room was getting bigger. By time he reached his locker, he was already smaller than a mouse. He was totally naked since he outgrew his clothes. He couldn't believe he shrunk. Then suddnely he heard footsteps as loud as an earthquake. Ryan....</span></div></div>",
            "created":1322592300,
            "id":1231724,
            "title":"Ryan"
        },
        "1112":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "His friend Luke",
                "His gymnast coach, Mr. Bur",
                "Someone in your class (Anyone)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ryan was relieved that someone else is in the locker room , yet he was afraid of who was it. He looked to see and it was....</span></div></span></div>",
            "created":1322961960,
            "id":1234180,
            "title":"Try to see who it is to get help"
        },
        "11121":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Luke heard him",
                "Luke did not hear him"
            ],
            "content":"<div class=\"\"><div> <span>Luke went to the locker room becuase he forgot his wallet in his locker. He and Ryan had been friends ever since they were freshmen in high school. Not as cocky as his friend, Luke still always achieve to be as good as ryan. <br>\r\n<br>\r\nRyan seen his giant friend and Luke and was relieved. Ryan thought his best friend will help save the day and figure how to return back to normal. He called up to Luke and....<br>\r\n<br>\r\n</span></div></div>",
            "created":1329100320,
            "id":1276070,
            "title":"His friend Luke"
        },
        "111212":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Climbed on Luke's shoes",
                "Climbed in Luke's Backpack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Luke could not hear Ryan weak tiny voice. Ryan moved out of the way to avoid Luke giant feet. Ryan had to get Luke's attention, so Ryan...</span></div></span></div>",
            "created":1344495540,
            "id":1400888,
            "title":"Luke did not hear him"
        },
        "1112122":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Girlfriend's house",
                "His house"
            ],
            "content":"<div class=\"\"><div> <span>Ryan thought that climbing on Luke's shoes and legs would be dangerous, so he did the next best which was getting in Luke's backpack that was sitting on the floor. Ryan ran toward the backpack and ran for the small open pocket on the side of Luke's backpack. Once Ryan was totally in there, he just waited until Luke close of that part and left for home. <br>\r\n<br>\r\nSure enough, Luke closed that side pocket halfway and left to go his...</span></div></div>",
            "created":1386056820,
            "id":1702463,
            "title":"Climbed in Luke's Backpack"
        },
        "112":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "You try to transform Tom",
                "You attack Tom"
            ],
            "content":"<div class=\"\"><div> <span>Brian was a hard working everyday man. He liked soccer but had never been fully involved in a sport. One day his friend of two years Tom invited him to sneak in and participate for a say at a sports school. Brian said yes of course but when he researched the school he found a weird trace of disappearances this sparked his curiosity to see the school with Tom. Tom was mysterious and weird but funny and quirky, his interests could overshadow those of others but he was decent. <br>\r\n<br>\r\nThey stood outside the school as the bell rang on a Wednesday 'you first girly', Tom mocked Brian, Brian climbed over the fence and Tom followed. Tom directed Brian to follow him around the school to a specific room, Brian followed confused why they were not heading to where the soccer tryouts were for that day. 'okay what are you doing we're going the wrong way Tom!' 'Trust me Brian you'll love this' 'Okay this better not be a waste of time'. They climbed a building and looked down to see a gymnastics hall with female gymnasts flipping and turning, 'Isn't it call man, don't you want to be like em' said Tom, Brian replied 'Ewww no, gross man, I'm going to soccer' he climbed down the building and fell through the roof into the a locker-room. As Brian got up he saw Brian starting at him from the ceiling, 'you okay man' 'no' Brian jumped down and offered a hand up. 'I want to join this school sorry man' Said Tom with a glare in his eyes, he pulled out a medallion and stuck it to Brian's chest, it moved slowly, seemingly the medallion aborsbed in him. Suddenly the room started to get bigger and Brian felt a surge of power flow through his body almost like he was flying. Brian's hair transformed from blonde to black and started to grow, his shoes slowly vanished and his jeans started to fade revealing his black briefs. His face changed, Brian's nose went pert, his eyes went slightly squint and his became circular. 'What the?' He said in a high pitched voice as his hair slowly grew and his chest expanded quickly, while his crotch disparaged and his t-shirt and briefs transformed into a black and red leotard. 'I'm sorry they need a new female gymnast recruit and they couldn't find any, they said of I got them one I'd be able to be a soccer player'. 'Tom turn me back now!'. 'It's permanent sorry, you do look awfully cute as a gymnast, Brian or should I say Bella'.</span></div></div>",
            "created":1600072560,
            "id":2902680,
            "title":"Brian"
        },
        "1121":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Go to student reception",
                "Make out"
            ],
            "content":"<div class=\"\"><div> <span>Bella looked at the mirror in the locker-room with Tom grinning behind him noticing Tom had a second medallion. Bella felt feeling her crotch, it's smooth and feminine. She felt her breasts and hair tied up in a bun. She was now a female. He turned around to see he had a decent wagon, looking cute. Tom thought Bella was checking herself out so was caught unaware when Bella quickly grabbed tom's medallion and stuck it to Tom's chest, he quickly cried 'No, no, no, you can't do this'. Like that Tom became Olivia, while Bella was 4' 11'' Olivia was larger at 5' 6'' with lovely blond hair and a cute face. Olivia wore a black sparkly long sleeve leotard. Immediately the two started to grab each other and fight, upset they had both become feminized permanently. They screamed and cursed before finally loosing energy and sitting in opposite sides of the room looking at each other, panting for breathe. Bella grabbed her but and adjusted her leotard which had ridden up on her, 'gosh leotards give you a wedgie, how do girls wear these things to the beach', Bella was already accepting that she was a female, admiring herself in the locker mirror. Olivia sat on the floor like a child trying not to look down, In denial he ever got involved in gender transformation and that karma had turned him into the one thing he hated, being seen as feminine, worse being feminine. Olivia crossed her arms and felt the spandex of her leotard, flinching she whipped her head forwards and her blonde hair covered her face.<br>\r\n<br>\r\n'I hate this! I shouldn't have turned you into a girl sorry Bella but I don't deserve this' 'I'm not complaining' exclaimed Bella as she took pictures from all angles of her gymnast body int he mirror. Finally Olivia acknowledged her body, feeling the spandex, putting her hands on her bum and looking down at the two pointy things covering her smooth crotch. 'You know female leotards are so sexual, because they make the hips part high to show the legs, and now as a professional gymnast boys will see me as a piece of meat'. The intercom tuned on, Bella and Olivia please report to student reception</span></div></div>",
            "created":1600073640,
            "id":2902682,
            "title":"You try to transform Tom"
        },
        "12":{
            "author_id":"wege",
            "author_name":"wbe",
            "choices":[
                "Laura",
                "Karla",
                "Carly"
            ],
            "content":"<div class=\"\"><div> <span>You are a female gymnast. What is your name?<br>\r\n<br>\r\nLaura- 17, Curvy body, Determined to win no matter whose toes she step on.<br>\r\n<br>\r\nKarla- 23, Slim body, Has a great personiality and is very flexible<br>\r\n<br>\r\nCarly- 29, very fit, mainly keeps to herself while practicing</span></div></div>",
            "created":1322381040,
            "id":1230183,
            "title":"Female"
        },
        "121":{
            "choices":[
                "Laura is alone in the locker room?",
                "Laura and David shrink together? ",
                "Laura shrinks somewhere else?"
            ],
            "content":"<div class=\"\"><div> <span> At seventeen years of age, Laura Jones has nearly everything that a teenage girl could possibly want, and she is an incredibly beautiful young woman as well. She has a slender, well-defined body with curvy hips, and perky D size breasts that are natural by the way. She also has smooth fair skin, and strikingly attractive green eyes. Her face is extremely lovely too, and she stands 5’6. She has a fantastic ass, and her legs are muscular. She is extremely intelligent, but can be a bit ditzy sometimes. She is also in line for a spot on the United States Woman’s Olympic team, and she will stop at nothing to get that position. Normally, when Laura is not in any competition, she is an extremely nice person, but when something like the Olympics comes around, it is on like Donkey Kong. She becomes a ruthless super villain that nearly everybody hates, but still lust after. <br>\r\n<br>\r\n On this day, Laura has just gotten her uniform on, and is about to start her practice section. As she stands in the empty women’s locker-room, she hears something outside and decides to check it out. She opens the door of the locker-room and sees her cute boyfriend, Seventeen-year-old David Donald arguing with somebody. David stands six feet tall and is a gymnast as well. He has short brown hair, baby blue eyes, and lightly tanned skin, with a great ass. He has a lean, well-defined, muscular body, with no facial hair, or body hair on it. They have been dating for well over two years now, and they have similar personalities. He is normally a nice person, until a competition like the Olympics gets in his way. Then he turns into a super jerk, because he too is competing for a spot on the coveted United States Man’s Olympic team. He is dressed in his gymnastic uniform too, as he continues argues with some crazy old looking person. <br>\r\n<br>\r\n She watches the old person raises his hand to David’s face and blows magical powder all over David and Laura. The old man then left but the shrinking powder is all over the couple. A few minutes later…</span></div></div>",
            "created":1322556480,
            "id":1231605,
            "title":"Laura will Shrink!"
        },
        "1211":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Laura climbs onto the locker benches",
                "Laura heads to the gymnastics room"
            ],
            "content":"<div class=\"\"><div> <span>Laura woke up to find the locker room towering over herself. She was dazed and confused for a few seconds before realising she was shrunken to 4 centimetres tall. All the other girls were at practise, the benches in the locker rooms towered over her little head but she realised her friend Hanna has left her Gym bag next to the bench. She also noticed the door to the hall was off the ground high enough for her to climb under. </span></div></div>",
            "created":1600069920,
            "id":2902662,
            "title":"Laura is alone in the locker room?"
        },
        "12111":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Laura waits openly in the locker-room",
                "Laura hides in Hannah's bag"
            ],
            "content":"<div class=\"\"><div> <span>Laura admired her small stature, she flipped and tumbled her way on Hannah's bag onto the locker room bench, she looked around dwarfed by the lockers. thinking about how you never truly appreciate being normal size. She thought about David, why was he arguing with that man? Why did the man shrink David? Where was David? Could she ever return to normal size? These thoughts tortured her. Laura knew that waiting in the locker room would get her someone's attention, she just had to wait, she saw an opening in Hannah's bad maybe she could climb in there.</span></div></div>",
            "created":1600077000,
            "id":2902710,
            "title":"Laura climbs onto the locker benches"
        },
        "121112":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "It was the old man",
                "It was David"
            ],
            "content":"<div class=\"\"><div> <span>Laura climbed into Hannah's bag, the foul smell of odor filled her nostrils, she fell to the bottom cushioned by one of Hannah's leotards near the bottom. It was dark but she could see a stick of deodorant, a few tampons, two scrunchies, a lot of leotards and Hannah's phone, other figures were masked by the dark. Laura look at the crotch holes of Hannah's leotard comparing them to hers, remembering her legs being once that big. She sighed and sat down, laying on hey back looking at the light in to opening of the bag wondering what had happened. She had only caught a small amount of the powder blown from the old man and was just bigger then a teabag David was probably smaller than an ant as he had so much blown in his face, he's out there small wandering through the hall's thick carpet lucky to be 1mm tall. He doesn't deserve that. I don't deserve this. <br>\r\n<br>\r\nAn hour passed then the music in the gym stopped and Laura heard the door to the locker room open. Laura moved off the large leotard a hid under a scrunchie as the commotion of her friends chattering filled the air. She heard a coach walk in inquiring about her and David's whereabouts. A loud deep voice commented, 'probably making out for the past hour' that made her angry while she heard everyone, even Hannah laugh. Finally Hannah opened her bag and dumped her training leotard in pulling out her change of clothes. Laura felt the bag get picked up and zipped as the light let the bag, she was in total darkness clinging her tiny body tight to the scrunchie. <br>\r\n<br>\r\nLaura heard Hannah talking to her mum in the car about her day at gym unfazed by disappearance. Finally Hannah got home and dumped her bag on her desk as she started to pull things out she noticed she'd picked up a scrunchie with Laura holding onto it screaming in a high pitched voice begging for life. Quickly Hannah caught Laura as she fell placing the tiny gymnast on her desk. To Laura, Hannah's movements were slow and full of strength as her tiny body had made her quicker in speed and reaction time. 'Hey' Laura said in a unbearably faint high pitched voice waving at Hannah, Hannah cried 'What happened?! Why are you so small?! What do we do?!' 'An old man blew some powder at David, some of it passed to me, I woke up like this' 'Oh, oh, okay what do we do now?' 'We find the old man, but I doubt that's going to happen...' 'why were you in my Gym bag Laura?' 'I was hiding, I was scared' 'Oh, so if we can't find that old man how can you return to normal?' 'I don't think I can'. <br>\r\n<br>\r\nLife changed for Laura then on, Hannah would feed her small portions she had reserved from dinner. Laura's gymnastics skills saved her many times from being stepped on, lost and almost eaten by Laura's dog. It was quite the different life. By the time one month had past Laura had only ever interacted with Hannah like she was Hannah's little secret. In the early days Laura hid in Hannah's draw and Laura had found a ballet doll which ha da costume Laura could alternate with her gym leotard. Laura was only ever in a tutu, leotard, tights and plastic ballet shoes or just her gym leotard, soon Hannah found dolls 4cm tall with clothes for Laura but Laura liked the leotards she wore, she was used to it and it made evading situations while flexible easier. Laura lived like this for about three months when one day there was a knock at Hannah's door.<br>\r\n</span></div></div>",
            "created":1600078560,
            "id":2902717,
            "title":"Laura hides in Hannah's bag"
        },
        "1211121":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Try and save David",
                "Go back to a normal life"
            ],
            "content":"<div class=\"\"><div> <span>The old man stared at Hannah and smiled, so you've been hiding a little friend. Hannah was speechless and didn't respond staring with fear into his eyes. 'Don't be shy I'm here to return her to normal, of course unless she wants to remain your little living doll for the rest of her life'. Laura poked her head out of Hannah's pocket 'where's David?' 'I decided to return David to normal size' 'Oh phew, so your here to return me to normal to?' 'Yes, if you'd like me to, I didn't mean to shrink you and besides David's lesson is learn't he will permanently feel his change' 'what do you mean?' 'Oh I turned him into a female ballerina, he was being awfully rude to me before so I took his dignity instead of his size.' 'my boyfriend is a female ballerina?! I loved him turn him back!' 'Now missy don't get rude I could keep you that way or turn you into a frog' '...Turn me back please' There the old man blew a new powder onto the tiny Laura and she grew back 5' 1'', she was wearing the ballerina doll clothes and looked ridiculous as it was now clear that doll clothes are now made for people. 'Thank you' said Laura and Hannah, 'You're welcome' he said walking away, 'where is David?' Asked Laura, 'Not important' said the old man and he disappeared. Laura ran freely outside enjoying the fresh air and patting Laura's dog without he fear of being eaten. Hannah went upstairs and grabbed Laura's tiny leotard, which fit into the palm of her hand remembering the tiny Laura.<br>\r\n<br>\r\nLaura ran upstairs to see Hannah staring sorrowfully at the leotard 'I was once that big', 'It was torture wasn't it', 'yea it was' 'I think if it was torture for you we should go and save David from his being a female ballerina, it sounds like he really hates it'. Laura contemplated David's fate and look at the draw he had hidden in for three months. 'It can't be worse then this' she said 'Yea but maybe we should save him' said Hannah</span></div></div>",
            "created":1600079580,
            "id":2902729,
            "title":"It was the old man"
        },
        "12112":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Go to Hannah's beam and scream",
                "Lay low and wait for Hannah to rest"
            ],
            "content":"<div class=\"\"><div> <span>Laura lay on her stomach and began to climb under the door, the sound of her normal sized friends echoed like giants. As she climbed under the under part of her purple leotard got stuck and started to pull her. She tugged and tugged, her upper body was strong but it was clear she was stuck, she started to wonder how much longer she would be this way. She was flexible and managed to break free of the trap finally seeing that the gym hall dwarfed over her.<br>\r\n<br>\r\nThoughts rushed to her head, now what, she was tiny, an ant and all her everyone in the gym was busy training. She could get squashed. Laura adjusted her leotard and looked around seeing Hannah on the beam. She decided she needed to get Hannah's attention if she was ever to return to normal size, that way she could find that old man and ask him to reverse the effect of the powder. Hannah was practising flips on the balance beam. Her hair was in a brown bun, she had a pert nose, b cup breasts and brown hypnotic eyes. Laura though on how to get Hannah's attention</span></div></div>",
            "created":1600070460,
            "id":2902666,
            "title":"Laura heads to the gymnastics room"
        },
        "121121":{
            "author_id":"yeaboi123",
            "author_name":"Rigo",
            "choices":[
                "Chase after him",
                "Accept living life being small and go find David"
            ],
            "content":"<div class=\"\"><div> <span>Laura was small but fast, she ran stealthily like a ninja to the other end of the gym where Hannah was practising. There she screamed at the top of her lungs. But her screams were small and high pitched, too high pitched for Hannah to hear. Laura started to jump high, her athletic ability and lower body mass caused her to jump directly onto the beam as Hannah stopped flipping and started to do a split. Hannah's eyes widened to see Laura, no larger then a finger, waving her hands frantically in the air.<br>\r\n<br>\r\nHannah stopped and carefully put her hand out, Laura stepped in and Hannah sprinted to the locker room. 'How did this happen? Why are you so small?, are you okay?' Laura tried to explain but Hannah couldn't understand her high pitch. But Laura was smart and pointed to Hannah's phone, Hannah put her phone on the bench and Laura stood on the phone navigating it with her feet, jumping on the notes app. Using her Body Laura explained she was shrunk by an old man who her boyfriend was arguing with. Hannah was surprised and confused but quickly put on some track suit pants and quickly packed up her bag, putting Laura in her pocket as a carry on running out of the building looking for a weird old man. There was nothing to be seen anywhere int he carpark. then Hannah felt a tap on her shoulder she turned around and dust blew into her face. Laura jumped out of her pocket just before she became to small to ever be noticed and she watched as Hannah shrunk down to her size.<br>\r\n<br>\r\n'Oh my Gosh!' she screamed 'I'm tiny just like you!, I have a family that loves me, my mum will be so worried!', Laura clapped back 'Okay we can't panic, yes we are small and yes this is bad, I was relying on you to help me become normal again but we need to think his through we are small but we are skilled gymnasts, I jumped onto your beam with one leap! Our small size makes us mega athletes so our weaknesses can become our advantages!' The old man stood towering over them, their heads reaching the top of the tip of his boot. He started to walk away.</span></div></div>",
            "created":1600071240,
            "id":2902678,
            "title":"Go to Hannah's beam and scream"
        }
    },
    "info":{
        "author_id":"wege",
        "author_name":"wbe",
        "brief_description":"After a rigorous practice section, a gymnast suddenly shrinks in the locker room.",
        "created":1322376120,
        "description":"<td align=\"left\" class=\"norm\">A gymnast is finish practicing after a rough hour of gymnastics. Once the gymast gets to the locker room, they suddenly shrink to a mere inch.<br>\r\n<br>\r\nIn this story anything goes. The only rule is to not let the main character die.</td>",
        "id":1828672,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600079580,
        "modified":1600079580,
        "pretty_title":"The shrunken gymnast"
    }
}