{
    "chapters":{
        "1":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welcome to the story!<br>\r\nFirst things first, what gender of character do you want?</span></div></span></div>",
            "created":1528952400,
            "id":2507005,
            "title":"First Things!"
        },
        "11":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Aaron Grath, the college rugby player...",
                "Damien Johnson, the diligent student...",
                "Lind Frazier, the intellectual perv...",
                "Jason Luster, the greedy business man...",
                "How about some other characters?"
            ],
            "content":"<div class=\"\"><div> <span>A male character, huh?<br>\r\nOkay, how about one of these guys?<br>\r\n<br>\r\n1 - Aaron Grath<br>\r\nAaron is a college student, with medium length blonde hair and blue eyes. He plays for his college's rugby team, which had lead to him developing a good amount of muscle. <br>\r\n<br>\r\nAfter a hard day of practice, Aaron finds himself alone in the changing rooms. As he is packing up, he discovers a mysterious book filled with pictures...<br>\r\n<br>\r\n2 - Damien Johnson<br>\r\nDamien is the older brother of Lilith. He is 17 years old, with short brown hair and green eyes. He is a diligent student, and likes to help his sister study in the library. <br>\r\n<br>\r\nOne day after school, Damien and Lilith find themselves studying together in the library. Damien decides to take a break and browse the shelves. He finds herself in the Children's section, where he stumbles upon a rather interesting picture book...<br>\r\n<br>\r\n3 - Lind Frazier<br>\r\nLind Frazier is your typical know-it-all. He has short-clipped brown hair with matching brown eyes. Despite his impressive knowledge, Lind tends to slack off in class and perv on girls. <br>\r\n<br>\r\nHowever, when a new girl called Rose joins his class, Lind tries his best to win her over. In a ploy to get him away from the rest of the girls, Rose gives him a book filled with various pictures...<br>\r\n<br>\r\n4 - Jason Luster<br>\r\nJason is your typical business man. He is in his late fourties with greying hair and stern green eyes. Jason tends to think more of the money than the people, leading to him having a lot of enemies. <br>\r\n<br>\r\nAfter obtaining permission to demolish a row of houses, an irate mother sends him a 'gift'. When he opens this gift, he is so confused to find a small picture book...</span></div></div>",
            "created":1528952400,
            "id":2507008,
            "title":"Male Characters"
        },
        "111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Various types of girls?",
                "Various types of guys?",
                "Some other type of picture..."
            ],
            "content":"<div class=\"\"><div> <span>Aaron smashed into the ground. Hard. <br>\r\nHe was fully aware of the situation unfolding around him. The ball was ripped from his grasp by one of his team mates, who gave it a good hard boot up the pitch. A second later, the rest of his team tore past him, everybody ignoring him except for one. <br>\r\n<br>\r\n \"Come on, Aaron!\" <br>\r\nA rough hand reached down to him, which he quickly grasped. <br>\r\n \"We haven't lost yet!\"<br>\r\nHis best friend, Nick, flashed him a grin before following the rest of the team. Aaron wasted no time in following, ignoring the pain in his right side. <br>\r\n<br>\r\nA couple of minutes later, the match was over. Aaron's team narrowly won the match by a single try touched down in the last minute. His team all congratulated Nick, the one who did it, leaving Aaron sulking in the corner. If he hadn't been tackled, then he would've been the one to touch down at the end of the pitch. <br>\r\n<br>\r\n \"Don't be so hard on yourself, mate,\" Nick said, collapsing onto the bench next to Aaron. \"You got it up the pitch for me. Without you...\"<br>\r\n \"Yeah, yeah, I know,\" Aaron said, waving the words away. \"That's me. The supporting role of the whole team\".<br>\r\nNick shook his head. <br>\r\n \"And you don't think that that's important? You may not score much, but you enable us to score, you know?\"<br>\r\n<br>\r\nAaron was silent for a moment before letting out a reluctant sigh. <br>\r\n \"Yeah, I suppose you're right...\" He admitted before grinning at Nick. \"Now get going. You know Kennedy will want to congratulate you\".<br>\r\nNick rolled his eyes. <br>\r\n \"Don't remind me...\" He said before marching off. \"I'll catch you later!\"<br>\r\n<br>\r\nAaron watched the rest of his team slowly file out before deciding to move. Grabbing his school shirt, he pulled his blue rugby jersey over his head and threw it into his bag. He wiped mud from his muscular chest before pulling his shirt on. <br>\r\n \"Might not score much...\" He muttered as he buttoned his top. \"If the rest of the team supported me, then maybe I could...\"<br>\r\n<br>\r\n After pulling his trousers and shoes on, Aaron chucked his gear into his bag. As he scanned the changing rooms for anything left behind by him or his team, he spotted a small book with a grey cover. <br>\r\n \"What is this?\" He wondered, grabbing the book. \"Better question, who owns it?\"<br>\r\n<br>\r\n Flipping open the front cover, he found no name, which was odd. School rules dictated that all books must have the owners name scrawled somewhere within its pages. And yet, there was nothing in it. <br>\r\n<br>\r\n Turning to the next page, Aaron was surprised to find pictures of...</span></div></div>",
            "created":1529038800,
            "id":2507336,
            "title":"Aaron Grath, the college rugby player..."
        },
        "1113":{
            "author_id":"phillip100",
            "author_name":"Phillip Eugene",
            "choices":[
                "Inside the book, Aaron finds a ticket to a concert. ",
                "Aaron notices that the book has an address written inside the cover. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sleazy bars and taverns. Some of the pictures are of very drunk people passed out on the floor, or bathroom and many outside in their cars. </span></div></span></div>",
            "created":1547256420,
            "id":2602260,
            "title":"Some other type of picture..."
        },
        "113":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Various types of girls?",
                "Various types of guys?",
                "Some other type of picture..."
            ],
            "content":"<div class=\"\"><div> <span> \"Alright, class, listen in!\"<br>\r\nMrs Steels's commanding voice echoed around the classroom, silencing all conversations in progress. Slowly, all eyes turned to face her, all except...<br>\r\n \"Mr Frazier!\" She barked, focusing in on one student with short brown hair.<br>\r\n \"How many times do I have to tell you, stop staring at other students!\"<br>\r\n<br>\r\nLind, who had been staring at Sarah, a pretty girl with long black hair pulled into a ponytail, looked to the front with a smirk on his face. <br>\r\n \"Sorry, Mrs. But Sarah's hair looks especially luscious today\".<br>\r\nAt the mention of her name, Sarah shrunk back into her chair while the other girls sat around her snickered. <br>\r\n<br>\r\n \"Alright, settle down!\"<br>\r\nThe girls all feel silent. <br>\r\n \"Last warning, Lind,\" Mrs Steele warmed, staring directly at Lind. \"No more of this... behaviour\".<br>\r\nLind shrugged, to which Mrs Steele narrowed her eyes dangerously. <br>\r\n<br>\r\nAfter a few seconds, the tension seemed to dissipate as Mrs Steele got back in track. <br>\r\n \"We have a new student joining us today. Rose is an exceptionally gifted student, perhaps the equivalent of our own Lind\".<br>\r\nLind leaned back in his chair at the praise. Despite his constant slacking off and... inspection... of his classmates, he was probably the smartest in the entire class. <br>\r\n<br>\r\n Having somebody that could keep up with him could be interesting, but Lind was more interested in how she looked. If she looked like a cow's ass, then whatever. But if she didn't, then class might become a lot more fun. For him, anyway. <br>\r\n \"Rose?\"<br>\r\nThe door swung open. Lind's eyes lit up. <br>\r\n<br>\r\nLind had been expecting some mediocre girl that would blend in with the rest of his class, with the exception of maybe one or two girls. <br>\r\nWhat he didn't expect was a Goddess in mortal form. Perfect blue eyes, long and silky-looking black hair with purple highlights, a soft face...<br>\r\nHe grinned. He had found her at last...<br>\r\n<br>\r\nRose scanned the room. Her eyes fell upon the smiling Lind. She frowned as though his presence annoyed her. <br>\r\n \"There's an empty desk next to Lind,\" Mrs Steele said. \"And feel free to ignore Lind\".<br>\r\n<br>\r\nTaking her seat next to Lind, Rose refused to look anywhere near him. Lind was prepared to introduce himself, maybe try a few of his patented pick-up lines, but Mrs Steele took that moment to start class. Reluctantly, he decided to wait until after class had ended to talk with Rose. <br>\r\n<br>\r\nAs soon as the bell had rung, Lind pushed his plan into action. <br>\r\n \"Hey, I'm Lind,\" he said, leaning over. \"Might I say-\"<br>\r\n \"No, you won't\".<br>\r\nRose turned to face him, an icy stare on her face. <br>\r\n \"I've heard all about you, Lind Frazier. Nothing you try on me will work. Rather, it's what I try on you!\"<br>\r\n<br>\r\nShe rummaged through her bag, pulling out a grey book which she handed to Lind. Without a word, she poured her belongings into her bag and marched out, leaving Lind alone. <br>\r\n \"Playing hard to get, huh? And what would this be?\" Lind wondered.<br>\r\n \"Perhaps a picture book of you?\"<br>\r\n<br>\r\nFlipping open to a random page, Lind found himself staring at pictures of...</span></div></div>",
            "created":1529038800,
            "id":2507363,
            "title":"Lind Frazier, the intellectual perv..."
        },
        "12":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Jessica McWorth, the popular girl...",
                "Lilith Johnson, the childish teenager...",
                "Eleanor Millar, the mother of two...",
                "Samantha Wasser, the entitled child...",
                "How about some other characters?"
            ],
            "content":"<div class=\"\"><div> <span>A female, huh?<br>\r\nHow about one of these girls?<br>\r\n<br>\r\n1 - Jessica McWorth<br>\r\nJessica, who prefers to go by Jess, has shoulder-length brown hair and hazel-coloured eyes. She has D-Cup breasts with an ass to match, and is quite the popular girl. <br>\r\n<br>\r\nJess has just turned 21. For her birthday, she received the usual gifts befitting a girl of her age, however one gift in particular stands out. An odd book, filled with all sorts of pictures that seem to change each time she looks at it...<br>\r\n<br>\r\n2 - Lilith Johnson<br>\r\nLilith, who prefers Lily, is Damien's younger sister. She is 15 years old with vibrant red hair and green eyes and, unlike the rest of her friends, puberty hasn't set in yet, leaving her with a childish looking body. <br>\r\n<br>\r\nOne day after school, Damien and Lilith find themselves studying together in the library. Lilith decides to take a break and browse the shelves. She finds herself in the Children's section, where she finds a rather interesting picture book...<br>\r\n<br>\r\n3 - Eleanor Millar<br>\r\nEleanor has black hair with grey streaks beginning to appear throughout and startling blue eyes. She is 33 years old and is the mother of twins, Elizabeth and Serena, both aged 4. <br>\r\n<br>\r\nAfter dropping Elizabeth and Serena off at school, Eleanor finds herself cleaning their room. During her clean up, she discovers an odd picture book that she doesn't remember buying them...<br>\r\n<br>\r\n4 - Samantha Wasser<br>\r\nSamantha, Sam or Sammy is 8 years old, with dirty blonde hair and full blue eyes. Her parents and older brother, Peter, love to shower her with affection, making Samantha slightly stuck-up. <br>\r\n<br>\r\nOne day, Peter sends her a package containing some exotic treats, some new clothes and an odd book, filled with an uncountable number of weird pictures...</span></div></div>",
            "created":1528952400,
            "id":2507010,
            "title":"Female Characters"
        },
        "121":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Women...",
                "Men...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>\"HAPPY BIRTHDAY TO YOU!\"<br>\r\nClaps and cheers filled the small kitchen, along with a single whistle. Jess looked around at the people gathered in the kitchen. Her smiling father with his greying beard, her mother with her kind eyes and kinder smile, her best friend, Megan, and her boyfriend, Kevin. <br>\r\n<br>\r\n Jess opened her mouth to speak, yet no words came out. She had had parties in the past, but they had been huge parties in massive clubs with about a hundred people. This small gathering of her family and her closest friends... She didn't know why, but it rendered her speechless. <br>\r\n<br>\r\n Thankfully, Kevin stepped in. <br>\r\n \"Happy birthday, Jess!\" he said with a huge smile. He pulled her into a hug, which incited a snicker from Megan and a disapproving look from her father. <br>\r\n \"Thanks, everybody...\" Jess managed to get out, still overwhelmed by the whole ordeal. <br>\r\n<br>\r\n After Jess had calmed down and everybody had had a bit of cake, the party moved into the slightly larger living room. A small pile of presents sat in front of the fire place. Sitting next to them, Jess wasted no time in ripping through them. <br>\r\n<br>\r\n From her parents, she received a new phone, something she had desperately needed for a number of months. <br>\r\nMegan had got her a selection of clothes, ranging from a couple of new tops to a rather fashionable jacket. <br>\r\n<br>\r\n When she lifted the final present, labelled with a scrawled 'Kevin'...<br>\r\n \"Let's not open that here, shall we?\" Kevin laughed nervously, eyeing her father, who shot an angry look back. \"It's, uh... unsuitable for present company\".<br>\r\nJess gave him a knowing smile before moving into the final present. <br>\r\n<br>\r\n Unlike the others, which had been wrapped in bright paper, this one was covered in a layer of musty brown paper and sellotape. After a small battle involving a pair of scissors, Megan's sharp nails and a knife, Jess managed to get through the paper. <br>\r\n<br>\r\n \"A... Picture book?\"<br>\r\nJess eyed the book with disdain. She wasn't the biggest reader in the world, preferring the company of people to that of books. Whoever had bought her this clearly didn't know her that well. <br>\r\n<br>\r\n The rest of the room, however, paid no mind to it. In fact, it was almost as though the book didn't exist. Kevin shot her a wink, while her mother moved on with the camera, ushering the entire room together in front of the fire place for the customary birthday photograph. <br>\r\n<br>\r\n After the party had winded down, and Kevin and Megan had headed home, Jess found herself sitting alone in her room, a bottle of beer clutched in her hand. <br>\r\n \"Another year gone...\" She murmered, taking a large swig from her bottle. \"I really need to figure something out with my life...\"<br>\r\n<br>\r\n As Jess took another swig, the picture book caught her eye. She had no idea who had got her it, not did she particularly care, but something about the book was drawing her in, inviting her to read it, to gaze upon its contents...<br>\r\n<br>\r\n Reaching over, Jess grabbed the book. It was similar in size to a children's book. Its cover was pure grey with nothing on it. <br>\r\n \"Sounds intriguing...\" Jess yawned. \"Hopefully whatever is inside it is better...\"<br>\r\n<br>\r\n Flipping open to a random page, Jess found herself gazing at pictures of...</span></div></div>",
            "created":1528952400,
            "id":2507027,
            "title":"Jessica McWorth, the popular girl..."
        },
        "1211":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Jess stares at the picture of the fat woman...",
                "Jess's gaze is drawn to the picture of the pregnant woman...",
                "One of the other pages call to Jess..."
            ],
            "content":"<div class=\"\"><div> <span>Jess found herself staring at various pictures of women. She was surprised at the different types in the book. There was a rather large woman, with a large hanging belly, chunky thighs connected to a fat ass and a set of dropping breasts, a woman who was obviously pregnant, with heavy milk-filled breasts and a belly that looked as though it housed triplets, and many other photos. <br>\r\n<br>\r\nFlipping the page, Jess found even more pictures. These ones were much weirder than the other page, one of the pictures depicting a woman covered in white fur with large breasts and a heavy udder hanging between her legs. Another showed a woman covered in scales with a long tail instead of legs.<br>\r\n<br>\r\n \"What the hell is this thing?\" Jess muttered as she flipped back to the page with the fat woman and the pregnant woman. \"This is one weird ass book...\"<br>\r\nShe was tempted to give up on the book, throw it into the bin and pay it no further attention.<br>\r\n<br>\r\nHowever, the longer she looked at it, the more it called to her. She found her eyes slowly focusing on one of the pictures...</span></div></div>",
            "created":1528952400,
            "id":2507030,
            "title":"Jess looks at some women..."
        },
        "12111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Is fully engrossed with the picture, and continues staring...",
                "Begins to become aware of her tightening clothes...",
                "Slams the book shut when somebody barged into her room..."
            ],
            "content":"<div class=\"\"><div> <span>Oddly interested in the picture of the obese woman, Jess pulled the book closer for a better look. She didn't know why she would be so engrossed with this particular photograph, as she had never had anything resembling fat adorn her perfect frame. It was a repulsive idea to her, having a huge belly that just got in the way or a saggy pair of tits that swung about looking horrible. <br>\r\n<br>\r\nAnd yet, the longer and longer she stared at the picture, the more and more she could envision herself at that size. Her beautiful face decorated with a pair of soft chins and round cheeks. Her perfect and firm breasts, the envy of every girl and the want of every boy, turned into a set of heavy, cellulite-filled bags that constantly rested atop her massive gut. Her ample ass becoming a pair of soft basketballs, underwater riding into her ads crack...<br>\r\n<br>\r\nWithout realising it, Jess found herself slowly tracing the outline of the obese woman. As she did, the pages began to glow ever so slightly, casting a faint golden light over Jess's slim body. <br>\r\nTo Jess, the light was non-existent. She couldn't see the book glowing, only feel the warmth of its light wash over her, something she attributed to the radiator in her room. <br>\r\n<br>\r\nWith Jess completely oblivious to it, the light began to take affect...<br>\r\nHer slim belly bulged outwards by a centimetre. Her round backside swelled while her thighs and hips began to pudge up. Above her belly, her large breasts began to force the neckline of her crop top outwards. <br>\r\n<br>\r\nJess, of course, was completely ignorant of this. She was too busy inspecting the picture before her. <br>\r\n \"Such a big belly...\" She murmered, rubbing the woman's belly. \"And that lower body...\"<br>\r\nAs she leaned in for a closer look, more and more fat covered her. <br>\r\n<br>\r\nHer pudgy belly inches forwards, forming the beginnings of a beer gut that spilled over the waistband of her jeans. Her breasts, perky and firm, slowly became fatter, starting to sag downwards. Her backside swelled larger, tightening her jeans and causing a few small rips to appear. Her arms and thighs slowly became thicker, while rolls formed around her waist. <br>\r\n<br>\r\nJess...</span></div></div>",
            "created":1529125200,
            "id":2507774,
            "title":"Jess stares at the picture of the fat woman..."
        },
        "121111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Jess can't tear her eyes away...",
                "Jess realizes what is happening, and slams the book shut..."
            ],
            "content":"<div class=\"\"><div> <span>Unwilling to look away from the photo in front of her, Jess leaned in even closer. By now, her face was inches from the page, her eyes able to pick up even the smallest imperfection on the woman's soft flesh. She gazed at the woman's heavy breasts, utterly engrossed by the photo. <br>\r\n \"She looks so...\" Jessica paused. There were too many words she could use to finish that sentence. <br>\r\n<br>\r\nFat continued to add itself to Jessica's slowly swelling frame. Her fledgling beer gut had now evolved into two uneven rolls of flab. Her crop top, initially designed to cover the upper half of her belly, had been forced upwards, exposing the two rolls to the cold air. <br>\r\n<br>\r\nAbove them sat Jessica's swelling breasts. Their soft flesh bulged over the top of her bra, threatening to rip the garment apart. The neckline of her top slowly pushed downwards, revealing more and more of her ever-deepening cleavage. <br>\r\n<br>\r\nBeneath Jess, her skinny jeans were at their absolute limits. Each one of her ass cheeks were rivalling the size of basketballs at this point, their pale flesh peeking through the numerous rips in her jeans. Rolls of flesh bulged over the waistband of the straining garment, while the legs struggled to hold back her slowly swelling thighs. <br>\r\n<br>\r\n \"Beautiful...\"<br>\r\nJess let out a happy sigh as she finally got the word out. There was no mistaking it. This woman was beautiful, something she should aspire to be. A massive ball of flab, with no care in the world, content only to eat and grow rounder and heavier...<br>\r\n<br>\r\n<i> Is she beautiful though?</i><br>\r\nA small thought made itself known in the back of her mind. She had no desire to be this large, and never had. She liked her breasts, with their ability to draw all eyes to her. She liked her slim stomach, barren of anything resembling fat. <br>\r\n<br>\r\nWar began to rage within her head, one side confirming her desire to become bigger and bigger, the other fighting against it, screaming at her to close the book... </span></div></div>",
            "created":1529125200,
            "id":2507946,
            "title":"Fully engrossed..."
        },
        "12112":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Jess continues to admire the picture...",
                "Jess realizes something is awry, and tears her eyes away...",
                "Somebody bursts into her room..."
            ],
            "content":"<div class=\"\"><div> <span>Jess found herself unusually enthralled by the picture of the pregnant woman. Normally, she would be found this rather odd, as she had absolutely no interest in having kids of her own. She would much rather adopt than have her perfect body ruined by some kid. <br>\r\n<br>\r\nAnd yet, as she stared at the pregnant woman, admiring her large, smooth belly and milk-filled breasts, she felt a tugging in her gut. <br>\r\n<i>Maybe it'd be nice to be pregnant? </i>Jess thought, admiring how smooth and mark-free the woman's belly was. <i>Giving birth to the next generation, raising them, teaching them...</i><br>\r\n<br>\r\nAs Jess thought about this, the book before her cast a faint light over her body. It made her feel somewhat queasy and oddly bloated, feelings she attributed to having a bit too much to eat and drink. <br>\r\n<br>\r\nPulling the book closer so she could inspect the woman's round breasts, Jess didn't notice her slim belly begin to bulge outwards. Slowly but surely, the small bulge became rounder and rounder. Her breasts followed suit, becoming heavier and filling with milk. <br>\r\n<br>\r\nJess squirmed uncomfortably in her chair, but remained unaware of her swelling body. Her eyes were still firmly glued to the pregnant girl on the page before her. She had just noticed that the girl's backside looked quite soft, potentially covered by a layer of flab. <br>\r\n \"That would make sense,\" Jess whispered to herself. \"You tend to eat more while pregnant...\"<br>\r\n<br>\r\nAs Jess inspected this new detail, her own backside swelled slightly. Her hips silently cracked outwards, making room for her softening backside. Within a few seconds, her once pert backside had started to hang over the sides of her chair, while her hips were now marginally wider than her shoulders. <br>\r\n<br>\r\n \"I wonder how many she's carrying?\" Jess mused, inspecting the woman's belly. \"Maybe two or three? Potentially more?\"<br>\r\nBy now, Jess looked almost three months pregnant. Subconsciously, she rubbed her firm belly, still unaware of her changes... </span></div></div>",
            "created":1529192400,
            "id":2508107,
            "title":"Admiring the Pregnant Woman"
        },
        "12113":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "A typical blonde haired bimbo...",
                "A girl with an unusual bulge in her jeans...",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Before she can take a proper look at either one of the two woman, Jess is overcome with a sudden desire to take a look at the other pages of the book. <br>\r\n<br>\r\nFlipping away from the obese woman and the pregnant one, Jess finds herself staring at...</span></div></div>",
            "created":1529171040,
            "id":2507947,
            "title":"One of the other pages call to Jess..."
        },
        "121133":{
            "author_id":"vorkanstate",
            "author_name":"Vorkan ",
            "choices":[
                "She sees pages detailing a hyper slutty girl",
                "Woah...this girl in the picture has really really long, beautiful legs!",
                "More fetishes for Jess to conveniently find in the book"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Conveniently, Jess happens upon a few pages that are similar to even more readers' fetishes! What luck!</span></div></span></div>",
            "created":1529910240,
            "id":2511617,
            "title":"Something else?"
        },
        "1212":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Jess continues to look at her new favourite guy...",
                "Jess flicks back to the fat man on the other page, oddly enamoured by him...",
                "She decides to flick through the book a bit more..."
            ],
            "content":"<div class=\"\"><div> <span>Jess saw pictures of various types of guys. Her eyes initially fell on a rather hunky dude wearing nothing but boxer shorts. She smiled slightly as she admired his muscular arms and his built chest. Her finger traced lightly over his shorts, where an obvious bulge could be seen.<br>\r\n \"Aren't you a good-looking guy?\" She giggled, imagining herself pressing up against him. \"Wonder if there's anybody else like you?\"<br>\r\n<br>\r\n Flipping the page, her mood dropped. The hunk was replaced with a heavy guy with a case of bad acne and wild facial hair. He was clothed in a tight grey sweat too and matching pants which left nothing to her imagination. She could see his moobs, which looked to be the same size as her own ample chest. A bulge was seen in his pants, something Jess didn't really want to imagine. <br>\r\n<br>\r\n \"No, don't think about it...\" <br>\r\nJess shuddered as she flicked back to the previous page, where her new imaginary boyfriend was waiting. She grinned at him, her finger tracing his groin once more. <br>\r\n<br>\r\nThe longer she stared at the picture, the more she began to think. Sure, he looked great and she'd love to meet him, but the other guy didn't look that bad. Maybe if he shaved and did something about his acne...<br>\r\n</span></div></div>",
            "created":1528952400,
            "id":2507034,
            "title":"Jess looks at some men..."
        },
        "1213":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Animals?",
                "Articles of clothing?",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before she can take a proper look at either the men or the woman, Jess is overcome with a sudden desire to take a look at the other pages of the book. <br>\r\n<br>\r\nFlipping away from the men and women, Jess finds herself staring at...</span></div></span></div>",
            "created":1529189760,
            "id":2508090,
            "title":"Something else..."
        },
        "122":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Well-endowed teenager girls...",
                "Handsome teenage boys.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span> Letting out a sigh, Lily slowly flipped the page of the book she was meant to be studying. <br>\r\n \"Something wrong, sis?\" Her brother inquired, looking up from his own book. \"You seem really down!\"<br>\r\nLily shook her head. <br>\r\n \"No, it's fine...\" She replied half-heartedly. <br>\r\n<br>\r\n Of course, it wasn't fine. Yet another of her class mates now used a training bra, meaning she was the only girl in her class who didn't wear one. And as much as she tried to ignore this, Penny didn't let her. <br>\r\n<br>\r\n Lily snorted. <br>\r\nPerfect Penny, with her great marks in tests and exams. Teachers adored her, the other girls in her class wanted to be her and the guys in her class wanted to be with her. And who could blame any of them? Penny had started going through puberty years ago, and was still subject to the occasional growth spurt. <br>\r\n<br>\r\n As a result of this, she had a huge chest. Forget training bra, Penny used an adult bra! Her chest was like the size of her own mothers! And the rest of her body... Long black hair that was silky smooth, a beautiful face, nice wide hips and a full backside...<br>\r\n<br>\r\n Lily hated her, and Penny knew it. Everyday, it was constant teasing over her boyish body. The only remotely female part of her was her long red hair, which Lily had insisted be left alone. It hung down past her backside, almost touching her knees now. <br>\r\n<br>\r\n \"Sis?\"<br>\r\nHer brother's calm voice made her snap. She knew he was only trying to help, as she appreciated it, but at that moment in time, she didn't want it. She just wanted to be alone with her thoughts. <br>\r\n<br>\r\n Without a word, Lily stood up and stormed off. She heard her brother let out a sigh, having realised that things were not okay with her. But by the time he had decided to follow her, it was probably too late. The library was a huge place, and to search it all for one person would take hours. <br>\r\n<br>\r\n Lily had no idea where she was until she stopped in front of a familiar looking set of bookcases. Compared to the ceiling high shelves that were the norm in the rest of the library, the children's section had tiny shelves with barely any books on them. And the books that were there, the majority were copies of one another. <br>\r\n<br>\r\n And yet, she didn't care. The children's section was a place of happy memories for her. She remembered coming here with Damien almost every day to read or study. She would always walk out with a handful of books cradled in her arms, and by the next visit, she had finished them all. <br>\r\n<br>\r\n Without really thinking, she grabbed a book off of one of the small shelves. Flipping open to a random page, Lily saw pictures of...</span></div></div>",
            "created":1528952400,
            "id":2507063,
            "title":"Lilith Johnson, the childish teenager..."
        },
        "1221":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Lily found herself enthralled with the nervous brown haired girl...",
                "Begrudgingly, Lily stares at the picture of her rival, Penny...",
                "Another page calls to Lily..."
            ],
            "content":"<div class=\"\"><div> <span>As if the book had read her mind, which was still stuck on Perfect Penny and her womanly body, Lily found herself glaring at pictures upon pictures of girls around her age sporting huge racks and wide hips. <br>\r\n<br>\r\n \"Is this a joke or something?!\" She demanded. \"Why is this book in the kids section? This girl is practically wearing nothing!\"<br>\r\nLooking away from the offending picture, which showed a brown haired girl with tits the size of melons sporting a tiny bikini that just about hid her nipples, Lily flipped to the next page and instantly regretted it. <br>\r\n<br>\r\nStaring up at her with a smug smile was a black haired girl in a familiar school uniform. One hand was firmly planted on her fertile hips, while the other was crossed under her large breasts, pushing them up and straining the buttons on her white shirt. <br>\r\n<br>\r\n <i>Why the hell</i>, Lily thought angrily, <i>is Penny in this book? Can it read my mind or something?!</i><br>\r\nFor a moment, Lily was tempted to rip the page displaying Penny out of the book and chuck it into a bin, but something stopped her. <br>\r\n <br>\r\n \"Stupid Penny...\" She muttered unhappily. \"But even I have to admit, the photographer is exceptionally good. There's so much detail in both of these pictures!\"<br>\r\nFlicking back to the brown haired girl on the previous page, Lily started to pick up on some smaller details. Unlike Penny, who wore her usual smug grin, the girl had a nervous smile plastered across her face. Almost as though she was afraid of the camera or something. <br>\r\n<br>\r\n \"I'd be nervous to if somebody took a photo of me in nothing but my bikini!\" Lily said. \"Although, it looks a lot deeper than that. She looks the type to be scared of her own reflection!\"<br>\r\nLetting out a sigh, she went to close the book, but found she couldn't. An odd pulling sensation in her gut forced her to look at one of the two pictures...</span></div></div>",
            "created":1529489760,
            "id":2509714,
            "title":"Gazing upon that she wished to own..."
        },
        "12212":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Continued her intense staring match with the picture...",
                "Noticed her brother approaching..."
            ],
            "content":"<div class=\"\"><div> <span>Flipping to the next page, Lily found herself staring into the electric blue eyes of Penny. She wanted nothing more than to wrench her eyes away, to place the book back into the shelf and never ever look at it again. <br>\r\n<br>\r\nHowever much she wanted that, she found herself staring more and more at the finer details of the picture. <br>\r\n \"It must be one powerful camera,\" Lily commented, holding the book up.<br>\r\nShe could make out some pretty small details, such as the outline of Penny's bra pushing against her shirt, as well as the faint scar on the back of her hand where Lily had 'accidentally' clawed her. <br>\r\n<br>\r\nNo matter how hard she tried to avoid them, Lily's eyes soon ran out of other details to focus on. Reluctantly, her green eyes travelled to her two large breasts. Between two strained buttons, she could make out the lacy bra supporting their weight. <br>\r\n<br>\r\n \"Stupid Penny...\" She muttered again. \"Why'd you get such a good start through puberty?\"<br>\r\nAs she continued to stare at Penny's chest, the book began to emit a warm glow that washed over Lily. She shifted uncomfortably, an indescribable feeling spreading through her body. <br>\r\n<br>\r\nLily's flat chest slowly began to bulge outwards. Two round and hefty breasts began to form, forcing her shirt outwards. The top two buttons of her shirt began to strain under the stress of holding back the expanding flesh. <br>\r\n<br>\r\nAs her chest grew, her narrow hips and even flatter backside began to swell. The hem of her skirt began to rise while the waistband started to dig into her widening hips, causing discomfort for the redhead. <br>\r\n<br>\r\nStill glaring at the picture of her rival, Lily noticed none of this. Not even when the top two buttons finally gave in and ricocheted across the room did she look away. <br>\r\n<br>\r\nThe growth of her body slowly stopped. Her breasts, once flatter than a board, now matched the size of the ones adorning Picture Penny. A lacy bra had formed to support the heavy melons, the tops of which were visible to the world. <br>\r\nLower down on her body, her hips were now wider than her shoulders, while her backside resembled a pair of basketballs. The hem of her skirt was dangerously close to revealing her ass cheeks, while the waistband now dug painfully into her hips.<br>\r\n<br>\r\nStill completely oblivious to her body, Lily...</span></div></div>",
            "created":1529492100,
            "id":2509743,
            "title":"Picture Perfect Copy"
        },
        "122121":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "The next day at school, Lily stands up to Penny...",
                "Follow Lily as she goes about the rest of her day..."
            ],
            "content":"<div class=\"\"><div> <span>Despite her obvious and immense hatred of Penny, Lily refused to look away from the picture. She glared at the face of her bully, imagining that their roles were reversed. She was the one with the body of a supermodel, able to look down on the poor, flat-chested Penny...<br>\r\n<br>\r\n <i>What am I thinking?</i> Lily thought, the book still casting light over her body. <i>Of course I'm so much better than her! What does Penny have that I don't?!</i><br>\r\nLooking down, Lily showed no reaction to the two glorious breasts that sat proudly on her chest. Instead, she ran her hands underneath them, smiling triumphantly as she did. <br>\r\n<br>\r\nWhy had she ever been scared of Penny? She was so much more superior than her! Penny, much like her pitiful chest and ass, was nothing. <br>\r\n\"This has been a fun time,\" Lily said, shutting the book before her. The warm light slowly faded, leaving an almost unrecognizable Lily gazing down at its grey cover. <br>\r\n<br>\r\nWhere Lily had once stood, angry with her childish body and with Penny, now stood a teenager with a flawless hourglass figure and a penchant for bullying. <br>\r\n \"You've been a useful ally to me thus far,\" Lily cooed, running a finger over the cover of the picture book. \"I wonder if you can destroy Penny's confidence like you boosted mine?\"<br>\r\n<br>\r\n Slipping the book into her bag, Lily sauntered back to her brother. Unlike her, he noticed her changes instantly. <br>\r\n \"Lily?!\" He gasped, trying hard to not stare at her cleavage. \"What happened to you?\"<br>\r\n<br>\r\n \"What the hell do you mean?\" She asked. \"And stop staring at my chest!\"<br>\r\nDamien forced his eyes upwards. <br>\r\n \"But... It was so...\"<br>\r\nHe trailed off. He didn't want to be caught calling his sister's chest 'flat ', especially by her. <br>\r\n<br>\r\n \"Wanna finish that sentence?\"<br>\r\nLily raised an eyebrow. <br>\r\n \"No, it's nothing. I thought you had done something to your hair...\" He made up. It was a lame excuse , but thankfully, she seemed to buy it. <br>\r\n<br>\r\n \"Whatever. Let's get out of here. I'm starving!\"<br>\r\nWithout waiting for Damien to pack his books away, Lily left the library, oddly excited for tomorrow...</span></div></div>",
            "created":1529594820,
            "id":2510305,
            "title":"Feeling better about her body"
        },
        "1221211":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Lily allows Penny to read her book...",
                "Lily isn't done humiliating Penny yet..."
            ],
            "content":"<div class=\"\"><div> <span> \"Well, well. Look who finally grew a pair of tits!\"<br>\r\nLily smirked and looked up from her book. She watched as Penny entered the classroom, breasts wobbling and hair bouncing. <br>\r\n \"Or did you steal them from your brother?\" Penny mocked. \"Even he had a bigger chest than your sorry ass!\"<br>\r\n<br>\r\nThe class erupted into barely concealed snickers. Watching Penny rip into Lily was basically part of their daily routine at this point and, for a while, had become quite stale. Lily had grown accustomed to the merciless bullying, and Penny had run out of things to tease her about. With Lily's new body, Penny finally had more ammunition to use against her. <br>\r\n<br>\r\nOr so they thought. <br>\r\n \"Sorry ass?\" Lily stood up, running a hand over her round ass before planting it firmly on her wide hips. \"Does this look like a sorry ass to you?\"<br>\r\nPenny's face showed shock for a few seconds before her usual smug smile returned. Never before had she been spoken back to...<br>\r\n<br>\r\n \"Sorry? Yeah, it does. How much plastic you got stored in it, huh? Unlike you, mine is all natural!\"<br>\r\nTo emphasise her point, Penny shoved her hips out to the side. Unfazed, Lily laughed. <br>\r\n<br>\r\n \"What's so funny?\" Penny asked. <br>\r\nLily didn't answer, too busy laughing. Only when she began to gasp for breath did she finally stop to answer.<br>\r\n \"W-Where do I begin?\" Lily giggled. \"Your sense of superiority? Your obviously stuffed bra? Your horrible attitude?\"<br>\r\n<br>\r\nPenny's eye twitched, a sign Lily was getting to her. <br>\r\n \"A stuffed bra? How odd you would say that, considering that it's clearly what you did. No way could anybody grow a chest that size over night!\"<br>\r\nLily smirked. <br>\r\n \"Why don't you confirm your theory?\" She asked. \"Have a touch, I don't mind\".<br>\r\n<br>\r\nPenny's eyes widened at this request. Lily was acting awfully confident, almost as though she thought she was better than her. If she had to fondle somebody else's chest to prove her superiority to this annoying redhead...<br>\r\n<br>\r\nWithout a word, Penny crossed the room to stand in front of Lily. Equally silent, Lily stood up, revealing just how big her chest was. It was way larger than Penny's, large enough to strain buttons on her school shirt. Even Penny was shocked by its size. <br>\r\n<br>\r\n \"Well?\" Lily challenged. \"Go ahead!\"<br>\r\nThe class held its collective breath as Penny reached out, her hand just about big enough to cup one of her breasts. As her hand closed around and lightly squeezed, Lily let out a moan while Penny gasped. <br>\r\n<br>\r\n \"It's... real?!\"<br>\r\nLily let out a smug laugh. <br>\r\n \"That's right, Penelope! One hundred percent real!\"<br>\r\nPenny stumbled backwards, shock from the use of her real name hitting her hard. <br>\r\n<br>\r\n<i>The tables have turned</i>, Lily thought triumphantly. <i>I could go in for the kill, or use my secret weapon...</i><br>\r\nShe tapped the grey book sitting on her desk...</span></div></div>",
            "created":1529920380,
            "id":2511664,
            "title":"Lily vs. Penny"
        },
        "12212111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "\"It's me, but fat?\"",
                "\"It's a guy that looks like me?\"",
                "Some other version of Penny..."
            ],
            "content":"<div class=\"\"><div> <span> \"W-What the hell?!\" Penny stuttered, looking between her hand and Lily's chest. \"How did you... It's impossible!\"<br>\r\nIgnoring her protests, Lily decided to push forwards with her secret weapon. Sliding up to Penny with a flirtation smirk on her face, Lily pressed her chest against Penny's, the soft flesh fighting for room between them. <br>\r\n<br>\r\n \"I can show you...\" Lily whispered, seduction dripping from her voice. \"Just take my hand, and follow me...\"<br>\r\nShe extended the fingers on her right hand, waiting for Penny to interlock her fingers with hers. <br>\r\n<br>\r\nPenny, however, eyed her hand with suspicion. <br>\r\n \"Why should I?\" She demanded, her voice wavering. \"For all I know, you'll-\"<br>\r\n \"Make all your dreams come true?\" Lily cut in. \"Or I could bring your worst nightmares to life. The choice is all yours\".<br>\r\n<br>\r\nAt the mention of her worst nightmares coming to life, Penny gave in. <br>\r\n \"Alright, fine!\" She conceded. \"But I want somebody to come with me!\"<br>\r\nLily shook her head, her red hair swaying back and forth in a mesmerising manner. <br>\r\n \"Just me and you, Penny. Nobody else\".<br>\r\n<br>\r\nPenny grumbled unhappily before letting out a long sigh, her warm breath washing over Lily's face. <br>\r\n \"Whatever... But I'm warming you now, Johnson. Any weird moves, and everybody will hear about it. Got me?\"<br>\r\n<br>\r\nUnfazed by the threat, Lily shrugged and wiggled her fingers. <br>\r\n \"I'm not holding your hand!\" Penny insisted. \"And can you please back up?\"<br>\r\nLily didn't budge, instead opting to wiggle her fingers more and run her other hand down Penny's hips. <br>\r\nPenny glared at her rival unhappily before reluctantly taking Lily's hand. <br>\r\n \"Follow me...\" Lily whispered, finally pulling away from her and leading her out of the classroom. <br>\r\n<br>\r\nDespite the bell having rung, Lily continued to lead Penny down various corridors until she reached a small, forgotten room. <br>\r\n \"This is where you wanted to lead me?\" Penny asked, making a face at the small door. \"Where even is this?!\"<br>\r\nLily remained silent, pushing the door open and ushering Penny in. <br>\r\n<br>\r\nInside was a small room. Lily had used it in the past to escape Penny and her cronies, and had quickly adopted it as her own personal hideout. She had 'acquired' a couple of chairs, bought a couple of cushions and taken an old box from the trash to act as a table. She pushed Penny towards one of the seat before sitting on her own. <br>\r\n<br>\r\n \"So, what's this secret?\"<br>\r\nLily smirked back, placing a small book on the table in response. <br>\r\n \"A book?\" Penny eyed the book with obvious suspicion. \"A book made your chest swell into melons?\"<br>\r\n<br>\r\n \"Open it to a random page,\" Lily ordered her. \"And tell me what you see\".<br>\r\nPenny sighed as she flipped the book open. Her eyes scanned down the page, her brow slowly furrowing in confusion. <br>\r\n \"Well?\" Lily inquired. \"What is it?\"<br>\r\n<br>\r\nPenny looked up with confusion before answering...</span></div></div>",
            "created":1530104880,
            "id":2512504,
            "title":"Lily allows Penny to read her book..."
        },
        "122121111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Lily decides to enhance her own body...",
                "Lily decides to force Penny through another change...",
                "Lily decides to leave it there, and leaves the fattened Penny alone..."
            ],
            "content":"<div class=\"\"><div> <span> \"It's... a picture of me?\" Penny looked up at Lily, anger now mixed in with confusion. \"Why the hell do you have a picture of me?! And why am I so fat in it?!\"<br>\r\nLily responded with a giggle. <br>\r\n \"Why don't you take a longer look at it?\" She suggested innocently. \"Maybe the two of you have something in common?\"<br>\r\n<br>\r\n For whatever weird reason, Penny felt somewhat compelled to look back down at the picture of herself. She ran her eye over it, feeling disgusted as she saw her large hanging gut resting against her pillar-sized thighs. Her skirt was stretched tight, her blubbery ass cheeks partially visible below its hemline. Her perky breasts, her pride and joy, were replaced with two, sagging globes of flab, fighting against the buttons on her shirt. <br>\r\n<br>\r\n \"Something in common?!\" Penny laughed coldly. \"I haven't and never will look like that!\"<br>\r\nLily smiled as she watched Penny expectantly. She had spent all night trying to figure out how that book worked, enhancing her chest and ass little by little. She had even stumbled upon a picture of some dark-skimmed horned creature. She hadn't spent long looking at it, but what time she did spend filled her with a sense of power and seduction.<br>\r\nAnyway, if she was right, then Penny should start changing soon...<br>\r\n<br>\r\nSpying the wrinkles on her shirt starting to fade, a victorious grin spread across Lily's face. <br>\r\n \"Although, it is incredibly detailed...\" Penny mused, her eyes slowly glazing over. Her mouth hung open slightly, revealing her pearly white teeth. <br>\r\n \"It begins!\" Lily said gleefully, leaning back in her chair. <br>\r\n<br>\r\nPenny's trim belly slowly began to bulge outwards. It soon picked up speed as more and more fat began to gather, her belly soon peeking out from under her shirt. It didn't take long until her belly had grown into an apron of hanging flab, almost touching her knee caps. <br>\r\n<br>\r\nWhile her belly swelled, her breasts ballooned, quickly tightening her shirt and bra. Buttons pinged off, one after the other, towards Lily, who narrowly dodged the potentially dangerous projectiles. Only one, incredibly strained button remained, holding together the slowly shrinking shirt and covering her now basketball-sized breasts. <br>\r\n<br>\r\nPenny's pert backside filled with fat, soon reaching the edges of the chair she sat on. Her hips and thighs became thicker and thicker, causing her skirt to become tighter and tighter. Amazingly, it held as Penny's lower body outgrew the chair, her blubber hanging off the edges. <br>\r\nFinally, fat encircled her beautiful face, a second chin quickly forming. Her cheeks became rounder and softer. <br>\r\n<br>\r\nAs her growth reached its end, Penny slowly lowered the book, her dulled eyes still firmly glued to the page. Only when Lily let out a cough did her eyes clear. <br>\r\n \"What was that?!\" Penny demanded. \"And why do I feel so... heavy...\"<br>\r\nLooking down at her hefty body, Penny screamed. <br>\r\n<br>\r\n \"W-What did you do to me?!\" Penny asked desperately. \"I don't wanna be fat!\"<br>\r\nLily laughed at her rival's plight. <br>\r\n \"Well, your chest is bigger than mine!\" She noted, reaching over and poking a finger into her flabby tit. \"Too bad nobody likes fat!\"<br>\r\n<br>\r\nPenny was on the verge of tears, the book still in her grasp. She looked down at it and the picture of her fat twin. Maybe the book had something to do with this...<br>\r\n \"Yoink!\"<br>\r\nBefore Penny could test her theory, the book was yanked from her grasp by Lily. <br>\r\n<br>\r\n \"Sorry, Penny. But it's my book, and you can't read it without my permission!\" She giggled. \"Maybe if you're nice to me, I'll let you have another go!\"<br>\r\nPenny whimpered in response. <br>\r\n \"As for now...\"</span></div></div>",
            "created":1530111180,
            "id":2512546,
            "title":"Penny, but fat"
        },
        "1221211111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Lily leaves to flaunt her new body...",
                "Penny attempts to overpower Lily with her new heft..."
            ],
            "content":"<div class=\"\"><div> <span> \"Why should you be the only one who gets a new body? I'll make you watch as take your place as the most beautiful, most desirable girl in the entire school!\"<br>\r\nLily let out a cruel laugh before flipping through the book. Her eyes quickly scanned each page before moving into the next. <br>\r\n<br>\r\nOpposite her, Penny could do little but watch. Her new body was so heavy, and she would probably have trouble moving around with it. Plus, the door to get in was small, and at her size, Penny could potentially be trapped in here. <br>\r\n<br>\r\n \"Ah, this should do!\"<br>\r\nLily clapped as she decided on a page displaying a bunch of teenage models. Lilly's body paled in comparison to theirs, her breasts looking like tennis balls rather than the massive melons they sported and her backside was like a flat board of wood. <br>\r\n<br>\r\nLicking her lips eagerly, Lily stared longingly at the page. Penny watched as Lily's eyes glazed over, her mouth hanging open in wonder. She contemplated trying to snatch the book away and try to change herself back, but some unknown force prevented her from moving. <br>\r\n<br>\r\n \"Oh God, yes...\"<br>\r\nLily let out a moan as her ample bust grew. Already strained buttons on her shirt quickly gave in as her breasts surged forth, growing faster and faster. Her breasts quickly doubled in size before stopping, leaving Lily with a set of breasts the size of basketballs.<br>\r\n<br>\r\nLike her chest, her lower body grew as well. Her hips cracked outwards, while her backside swelled. The sounds of fabric slowly tearing filled the room as the sides of her skirt gave in to her growing body. The growth was brief, but significant, leaving Lily with hips that reached out to rather side of her body a good couple of inches and an ass that resembled a pair of pumpkins. <br>\r\n<br>\r\nAside from her now huge assets, a few other things had changed about Lily. She had grown a few inches, bringing her to the same height as the model. Her boyish face had become more feminine, with a pair of soft lips and round eyes. Her long hair, which she normally left messy and full of knots, had brushed itself and was now silky and smooth. <br>\r\n<br>\r\nLooking up from the book, Lily giggled. Her voice was softer and more seductive. <br>\r\n \"Look out, everybody,\" She said slowly, savouring her new voice. \"I am in charge of this school now!\"</span></div></div>",
            "created":1530180600,
            "id":2512830,
            "title":"Lily decides to enhance her own body..."
        },
        "123":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Pictures of Women?",
                "Pictures of Men?",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span> \"Messy kids...\"<br>\r\nEleanor let out a sigh as she surveyed the mess before her. The room looked as though a hurricane had run through it at some point. Toys were strewn across the floor, dolls lay abandoned on beds, pillows sat on the floor...<br>\r\n<br>\r\n Of course, she had expected this. Her twin daughters, Elizabeth and Serana, were the two messiest children Eleanor had even seen. They managed to spill food down themselves at every meal, they managed to get water on the floor during bath time and their room... Well, what she was looking at was mild. Everything after the paint incident was mild. <br>\r\n<br>\r\n Grabbing a basket, Eleanor marched around the room, chucking dirty clothes into it. After the clothes, she moved onto the toys. The pair didn't like to share, meaning Eleanor had to fork out the money for two of the same toy. They were swiftly returned to their corresponding toy box. <br>\r\n<br>\r\n Then came the dolls. Thankfully, Elizabeth's dolls all had the colour red on them somewhere, while Serena insisted on having pink on her. It was one of the few ways to tell the pair apart, another being the slight differences in their favourite hair styles. <br>\r\n<br>\r\n After the dolls had been returned to their resting places in the shelves above the two beds, Eleanor stopped for a rest. She looked around at the much cleaner room, thinking about how it would look in a couple of hours after the twins returned home from school. <br>\r\n<br>\r\n As she ran her eye over the room, she spotted something that she had never seen before. A small picture book with a grey cover...<br>\r\n \"I don't remember buying them this...\" Eleanor mused as she picked it up. She knew every toy that she had bought, and the book didn't have a pair, meaning it didn't belong in that room. <br>\r\n<br>\r\n \"I suppose I should take a look. Perhaps it belongs to a friend of theirs?\"<br>\r\nFlipping the book open, Eleanor found herself looking at...</span></div></div>",
            "created":1528952400,
            "id":2507043,
            "title":"Eleanor Millar, the mother of two..."
        },
        "1231":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Eleanor found herself staring at the messy trash woman...",
                "Eleanor found herself staring at the elegant lusty woman...",
                "One of the other pages call to Eleanor..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">At various pictures of women…?<br>\r\n<br>\r\n“What on earth…?” Eleanor mumbled in confusion, questioning how such a book ended up in her daughters’ room.<br>\r\n<br>\r\nThe worried mother continued studying the page she opened and was surprised at the different types of women she saw. <br>\r\n<br>\r\nThere was a heavily obese woman, in some completely stained outfit and small ill-fitting clothes, sporting an enormous hanging gut that reached her knees, thick beefy arms and chunky thighs that were connected to a fat ass and a set of huge swollen breasts; who looked like Trailer Trash.<br>\r\n<br>\r\nAnother obese looking woman, similar to the previous picture, but this one looked more elegant and was wearing a stunning red dress that was deliberately showing off her curves. A lustful pleasure-seeker of sorts…<br>\r\n<br>\r\nQuickly looking away from those two, Eleanor curiously flipped the page, to further check the book and found even more pictures. She saw a woman completely stacked with muscle, a woman gently and lovingly stroking her swollen belly, but then she found some… weirder ones. <br>\r\n<br>\r\nA woman covered in white fur with large breasts and a heavy udder dangling between her legs. A woman with a strange bulge in her trousers and lastly a woman covered in scales, sharp claws and oddly looking thick hind legs.<br>\r\n<br>\r\nEventually, Eleanor looked away from the book, her face completely puzzled at what she saw and muttered to herself, “Why would Elizabeth and Serena have a book like this…?” <br>\r\n<br>\r\nAs after all a single mom, her husband passed away some time ago, leaving her alone to look after her mischievous angels, but never had she come across something this strange. She flipped back to the page with the fat women. \"Wherever this book came from, it doesn’t belong here with the kids.\"<br>\r\n<br>\r\nEleanor was getting ready to close the book and throw it away in the rubbish outside, so; she could pay no further attention towards it. <br>\r\n<br>\r\nHowever, she oddly… couldn’t. She found her eyes slowly focusing on one of the pictures, as if it was calling out towards her, seeking for her attention and approval...</div></span></div></div>",
            "created":1529172300,
            "id":2507956,
            "title":"Interesting pics of women"
        },
        "124":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Girls like her?",
                "Boys?! Yuck!",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span> \"Samantha!\"<br>\r\nSamantha let out a sigh as she heard her mother's voice reach her from downstairs. She had been enjoying this new book, and right before the cool action part, her mother had decided to interrupt. <br>\r\n \"Yes, mummy?\" She called back. <br>\r\n<br>\r\n Her mother didn't respond, causing Sam to let out an irritated growl. Her mother would call her name and when Samantha responded, she had walked off. Sure, she knew to go downstairs, but she hated how she did it. Why not just come upstairs? Was it so important that she had to move away from her comfortable bed?<br>\r\n<br>\r\n Pouting, Samantha rolled off her bed and into her feet. She headed downstairs, where she found her mother standing with a large parcel. <br>\r\n \"Peter sent you something, dear,\" she explained, jiggling the package. <br>\r\nSam let out a joyful squeal, snatching the package from her mother and racing back upstairs. <br>\r\n<br>\r\n In her room, Sam dropped the package into the floor and sat cross-legged next to it. She loved when her brother sent packages! They were always full of nice things, like pretty clothes and tasty sweets! Once, he had even sent her this cool piggy bank in the shape of a camel!<br>\r\n<br>\r\n Ripping the box open, Sam let out a squeal of delight. The first thing she saw was loads of sweets.<br>\r\n \"There's like ten bags!\" She realised, counting them out. \"And they're all fizzy!\"<br>\r\nDespite constant warnings from their mother, Peter still insisted on sending fizzy sweets to Sam. They made her so hyper, and she loved them. <br>\r\n<br>\r\n After pulling all the sweets out, Sam reached back into the box. She pulled out a blue t-shirt with a happy penguin on it. She smiled at the penguin, which just happened to be her favourite animal. They were so cute and cuddly...<br>\r\n<br>\r\n Putting the t-shirt to the side, Sam reached back into the box. Her hand closed around a small item, which turned out to be a rather bland book. It had no blurb and both covers were completely grey. <br>\r\n \"It looks boring...\" She complained. \"Wonder if the story is any good?\"<br>\r\n<br>\r\n Flipping to a random page, Sam found herself staring at pictures of...</span></div></div>",
            "created":1528952400,
            "id":2507053,
            "title":"Samantha Wasser, the entitled child..."
        },
        "1241":{
            "author_id":"pedro01",
            "author_name":"pedro01",
            "choices":[
                "Sam begins to stare right at the obese girl.",
                "Sam glances at her eighteen year old self.",
                "Sam turns over the page to see herself more."
            ],
            "content":"<div class=\"\"><div> <span>Sam may have loved the gifts Peter brought for her, but the one thing she was puzzled with is the bland book she’s holding.  She may have number of questions as to why Peter wanted to give this to her.  But regardless, Sam shrugged and gives this book a shot and see what’s in them.<br>\r\n<br>\r\nWhat happens next is quite a surprise, but also come with shock at the same time.  Sam has gotten to the first couple of pages, seeing pictures of the girls in different shapes and forms.  But what’s even shocking to her is that every page the picture it has here, seemed to have some kind of a same girl each and every one.  She was left confused at first, before realised by the look on the face, which she begin to realised who this girl was?<br>\r\n<br>\r\n“Wait a minute!  Is that.... me in every single page?”  Sam looked surprise and realised it is her, but every page seem to look much different as far as looks and shapes in concerned.<br>\r\n<br>\r\nFor example, the first page contains her looking a lot obese for an eight year old.  The picture shows her in bottom heavy shaped, making the girl’s butt and thighs larger and wider, as well as the belly that’s look a lot fatter too!  The arms are looking thick, and her face is the same too, but still had that cute look, which made Sam blushed heavily in nerves.<br>\r\n<br>\r\nThen on the next page, Sam comes across herself looking much older than her actual age in reality.  It looked like she’s grown up ten years later, looking eighteen years of age, matured and even good looking, much to the girl’s real life confusing about Peter’s somewhat bizarre reason behind this one.<br>\r\n<br>\r\n“I can’t believe my brother gave me this book, so he let me show what I really look like.  But why would he do such a thing?”  Sam says rather concerned by any means.<br>\r\n<br>\r\nBut something goes through her mind, as each time she see’s the picture of it, it made her feel more curious the more she stares at it more.  So much so, that an eight year old girl is starting to invest this book all the sudden and decides to what?</span></div></div>",
            "created":1578627360,
            "id":2771729,
            "title":"“Is that suppose to look like me?”"
        },
        "12411":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "The book begins to affect her mind, making her lazier...",
                "Samantha realised what she's become...",
                "Samantha flicks through the book again..."
            ],
            "content":"<div class=\"\"><div> <span>Flicking quickly through the book, Samantha kept returning to one particular picture. <br>\r\n<br>\r\n \"She's so fat!\" Sam exclaimed upon her fifth return to the picture of her obese self. \"How'd she get that big?!\"<br>\r\n<br>\r\nThe picture didn't answer, leading to Samantha staring at it in thought. She tapped the floor next to her as she continuously inspected every aspect of the picture. <br>\r\n<br>\r\nThat cute double chin and chubby cheeks that decorated her childish face...<br>\r\n<br>\r\nHer flabby chest, adorned by two shapeless breasts that rested atop the rotund gut beneath them...<br>\r\n<br>\r\nArms that looked to be double their usual width, sleeves digging into her chubby upper arms...<br>\r\n<br>\r\nWomanly hips, wide and fertile, that could've belonged to somebody much older than her, connected to a backside that strained her jeans, each cheek the size of a melon...<br>\r\n<br>\r\nAnd finally, a pair of legs that, like her arms, had doubled, maybe even tripled in size. Each thigh, thick as a young tree trunk, threatened to burst free from her overtaxed jeans...<br>\r\n<br>\r\nSamantha, enthralled by her obese self, continued to stare, the world around her fading away. Her own body went numb as, steadily and without Samantha realising, pound after pound began to pile onto her childish body. <br>\r\n<br>\r\n \"So... fat...\" Samantha murmured, oblivious to the creaking of her jeans as layers of soft fat began to appear on her lower body. It didn't take long for her thin lower half to grow to resemble the one she bore in the picture, giving her a cartoonishly bottom heavy appearance, one she didn't even acknowledge as she continued to admire herself. \"I bet she's really soft...\"<br>\r\n<br>\r\nStroking the picture's belly, Samantha's own began to swell. Bulging out into a rounded curve, a potbelly soon formed that quickly gave way to a hefty gut that sagged down over her tight jeans. Above it, her flat chest grew, two breasts forming that grew to the size of tennis balls before stopping. And finally, her face grew rounder, a second chin forming beneath her first. As her cheeks took on a soft apprearance, the world came back to the now obese Samantha, who continued to stare at the book...</span></div></div>",
            "created":1597146960,
            "id":2883948,
            "title":"Sam begins to stare right at the obese girl"
        }
    },
    "info":{
        "author_id":"sparksalot",
        "author_name":"Reneg4de",
        "brief_description":"Somebody finds an odd book with the power to change the longer they read...",
        "created":1528994040,
        "description":"<td align=\"left\" class=\"norm\">Yet another simple story, featuring all new characters!<br>\r\n<br>\r\nA character of your choosing stumbles upon a picturebook. This book contains an infinite number of pages with an infinite number of different categories. <br>\r\nDepending on the page the chosen character reads, they will then undergo a gradual transformation pertaining to the category they are reading while they are reading it. <br>\r\n<br>\r\nLet's have an example, shall we?<br>\r\n<br>\r\nA girl reads a section of the book referencing weight gain in today's society. While she reads, both her mind and body are altered by the book, making her fatter and lazier. This will continue for as long as she reads. <br>\r\n<br>\r\nAnd to make matters worse for the reader, the book has a mild addiction quality, making it harder and harder to put down the longer the reader reads it. <br>\r\n<br>\r\nLike I said, a simple enough story. And like almost every story on this website, there are some rules to prevent the story from falling into complete and utter chaos:<br>\r\n<br>\r\n1 - Unlike my other story, you can use any gender, any age. An elderly man in his eighties? Go ahead! A female toddler? Why not! <br>\r\n<br>\r\n2 - Any transformation goes. Give a girl a dick and a guy a pussy? Go for it! Turn a guy into a immobile slug-girl that is also a pregnant bimbo? I don't see why not!<br>\r\n<br>\r\n3 - Make sure you write a half decent entry. That means good grammar, at least a paragraph in length, unless it's an option chapter, and don't deviate from the previous chapter. If the option selected is 'Weight Gain', then write something about weight gain. Nothing about inflation or something irrelevant. <br>\r\n<br>\r\n4 - Transformations are to be gradual. No instant gaining of a million pounds, or 'He read one word and suddenly he was a cowgirl'.<br>\r\n<br>\r\n5 - No excessive option chapters. One or two is fine, but if I see whole strings of 'Something else', then I'm busting out my deletion authority. It's fair game at the start until you find your chosen transformation, however. <br>\r\n<br>\r\n6 - Did I mention any transformation works? Like, literally anything you can think of.<br>\r\n<br>\r\nAnd with that, I think that's everything. Rules will be updated, because I know I've forgotten stuff. <br>\r\n<br>\r\nEnjoy the story!</td>",
        "id":2160956,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597146960,
        "modified":1597146960,
        "pretty_title":"The Picture Book of Change"
    }
}