{
    "chapters":{
        "1":{
            "author_id":"kan101",
            "author_name":"Neo Space",
            "choices":[
                "go see Sam......",
                "go see Paulina.....",
                "go see Jazz.....",
                "go see Maddie.....",
                "stay in the Ghost Zone......."
            ],
            "content":"<div class=\"\"><div> <span>    You have known about the Ghost Zone for a year now, but you have never been there before, but that was three weeks ago before you made a Ghost Portal to get to the Ghost Zone, and when you went through the Ghost Portal you ended up in a room that had nothing but old table with a old glowing lamp sitting on top of it. You go over to the lamp, pick it up, and rub it, you see a flash of light, and you see green smoke coming out of the spout of the lamp, the green smoke forms a shape that you see is a hot ghost, she looks at you for a second, she then opens her mouth and says, \"well, I'm waiting.\"<br>\r\nThen you said, \"for what?\" \"for your wish silly,\" she replied. \"What have you always wanted?\" she asked. \"OK, I wish for the power to shrink to any size I want, and to grow back to normal size whenever I want, and to teleport wherever I want,whenever I want,\" you said. She looks at like you nuts, but who is she to judge. She then waves her hands and says, \"And So You Have Wished It And So It Shall Be,\" \"it is done.\" You thank her and leave, but now what.....do you</span></div></div>",
            "created":1269579600,
            "id":857125,
            "title":"So You Have Wished It And So It Shall Be"
        },
        "11":{
            "choices":[
                "Ass",
                "Pussy",
                "Breasts",
                "Belly Button",
                "Feet"
            ],
            "content":"<div class=\"\"><div> <span>             You decide to go and see your friend Sam. You ask the ghost \"Can you also make me invincible?\" \"Of course I can,\" She answered. \"Well\" you say, \"I'm off to go \"see\" my friend Sam.\" \"Alright have fun, also if you need any more wishes granted, you can always come to see me.\" She said with a devious grin. <br>\r\n<br>\r\n             You then exit the portal and teleport yourself to Sam. She is probably your favorite girl, and you have a huge crush on her. You know at this time that it is gym for her at school and you have a chance of see her change in front of you. You teleport a few feet from her locker. As she walks in and grabs her gym clothes, you immediately get a boner. You watch her take off her clothes and stand only on her underwear. At this point, you can't take it and decide to teleport to...<br>\r\n<br>\r\nWHERE? YOU DECIDE BELOW!!!</span></div></div>",
            "created":1369544400,
            "id":1597336,
            "title":"go see Sam......"
        },
        "112":{
            "choices":[
                "Teleport away and spy on her.",
                "You decide to see what she is going to do next.",
                "Your powers fail and you are at the mercy of Sam."
            ],
            "content":"<div class=\"\"><div> <span>You decide to teleport to her pussy. You find out that Desiree was nice enough to make it so that Sam could not feel you whenever you touched her. As soon as you teleported, you felt the air around you get twice as hot. On one side was a soft wall made of a white fabric, and on the other side is a soft, cushy net of hair. You start to get more excited as you move the hair and see the bare skin and her lips opening up just a little, almost like it is inviting you in. You accept and start to walk in. It is warm and the walls are slimy. You decide to have some fun and teleport to her brain. You then put the idea into her head that you are in her pussy and she is torturing you. You teleport back into her pussy and begin to massage the inside. Sam starts to get close to her climax and you start to reach yours. You cum and then soon after, you are washed out in her cumfall. Sam then goes to the bathroom and cleans up her mess. As she does this, she sees you and picks you up.<br>\r\n<br>\r\nWhat do you do next? YOU DECIDE BELOW!!!!!!!!</span></div></div>",
            "created":1369544400,
            "id":1597388,
            "title":"Pussy"
        },
        "1123":{
            "content":"<div class=\"\"><div> <span>As soon as she sees you, you try to teleport away but your powers fail. You then gt up and jump off her hand, landing hard. It hurt really bad, but you have no major injuries showing that your invincibility is somewhat working. Sam then lifts her foot above you and says threatening \"You fucking pervert. Well at least now I can make you suffer for your actions!\"<br>\r\nAs she says this, she puts her foot down and pins you underneath. She continues to apply more pressure until it feels like your body is going to pop and you black out.<br>\r\n<br>\r\nYou wake up in pain but notice Sam is not standing on you any more. You look around your surroundings and notice that you are in her room. As you continue to explore, Sam suddenly jumps onto the bed and lands in front of you. She then puts a cup over you and says \"I will let you escape and not talk about this ever again if, you can beat me at a wrestling match.\" <br>\r\n<br>\r\n\"Alright I accept\" you say, knowing you can beat her assuming she will let you grow back. \"OK and you can make the first move\" says Sam as she lifts the cup off you. You ask her to give you a second and you try to grow back, but your powers aren't working. \"Hurry up, you don't much more time before I make the first move.\"<br>\r\n<br>\r\nYou run at her foot, and started grabbing it with your arms doing everything you can to even lift it a little bit, but it was all in vain as Sam just flicked him off of it. She watched you roll a couple inches backwards, then smiled to herself as she lowered herself on top of you pinning you to her bed with her massive weight. You feel  her pussy crush you as you know that you lost the match. You ask Sam \"Now what, you won now what are you going to do?\" She starts to laugh and says, \"Don't worry, you will see soon enough.\" She then picks you up and drops you into her panties, where you are never seen again.</span></div></div>",
            "created":1370581200,
            "id":1606686,
            "title":"Your powers fail and you are at the mercy of Sam."
        },
        "12":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Mouth",
                "Bra",
                "Panties (Front)",
                "Panties (Back)",
                "Shoes"
            ],
            "content":"<div class=\"\"><div> <span>You decided to spy on the dark-skinned popular girl, Paulina, as you teleported to her location. You looked to see that your transported to her room high on the dresser. You then see Paulina by herself and you decided to have a little fun with her. You then teleported yourself inside her</span></div></div>",
            "created":1501025460,
            "id":2359323,
            "title":"go see Paulina....."
        },
        "123":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "doesn't feel it and you continue with your fun",
                "felt it and checks to see what it is",
                "felt it and enjoys it herself"
            ],
            "content":"<div class=\"\"><div> <span>You then used your new powers to teleport yourself inside Paulina's panties by her vagina. Once you're there, you got turned on by the musky smell of her pussy. You then touched her vagina with your hand and begin to rub it down a bit. While you're doing that, Paulina</span></div></div>",
            "created":1502210880,
            "id":2366618,
            "title":"Panties (Front)"
        },
        "1232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "satisfaction",
                "confusion",
                "anger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Paulina got a bit turned on when she felt you touching her crotch. So, she decided to see what it was as she streches out her pants and her panties to see you next to her vagina. She pulls you out and brings you to her face, which has a look of</span></div></span></div>",
            "created":1509029400,
            "id":2406816,
            "title":"felt it and checks to see what it is"
        },
        "12321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "have her bring you back out",
                "stay in her panties"
            ],
            "content":"<div class=\"\"><div> <span>You expected her to be very embarrassed and pissed off with your perverted act. However, she seems to liked what you were doing, according to the expression on her face.<br>\r\n<br>\r\n\"You seemed to be having a good time in my panties. I know I was while you were touching me. Would you like to do more of that for me?\" Paulina asked with pleasure.<br>\r\n<br>\r\n\"Sure. I don't mind.\" You answered.<br>\r\n<br>\r\nPaulina smiled as she shoves you right back inside her panties to be next to her vagina again. You picked up where you left off and you begin touching her vagina while moving around. Paulina started moaning while she rubs her crotch from the outside of her pants.<br>\r\n<br>\r\n\"Oh yes! So good!\" Paulina moaned with lust.<br>\r\n<br>\r\nYou then switched from touching her crotch to licking it and it tasted really good to you. Paulina gasped more louder than before and her vagina started to ooze out cum. Soon enough, with all of you licking and touching, she orgasmed and her sex juices started to explode all over you and her panties. Paulina took her time to steady her breathing before she turns her attention back to you.<br>\r\n<br>\r\n\"That was amazing. You did a fantastic job, little man. Would you like to come out now?\" Paulina asked.<br>\r\n<br>\r\nYou then decided to....</span></div></div>",
            "created":1509030540,
            "id":2406823,
            "title":"satisfaction"
        },
        "13":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Explore Jazz",
                "Explore her room.",
                "Leave her room",
                "Change of mind (new girl).",
                "More choices. "
            ],
            "content":"<div class=\"\"><div> <span>You decide to check out Jazz Fenton but before you leave you ask Desiree for immortality, invulnability, to be indestructible, to be half ghost all powers and abilities included, and a few others she grants them all and says 'if u ever want more wishes made you are welcome to see me for more wishes!' With that you teleport to Jazz and you see that she's sleeping on her bed completely naked. The door for her bedroom is cracked open.<br>\r\n<br>\r\nWhat do you do next?</span></div></div>",
            "created":1588696020,
            "id":2830571,
            "title":"Jazz Fenton!"
        },
        "134":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Dani Phantom.",
                "Someone else.",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you pick?</span></div></span></div>",
            "created":1588696140,
            "id":2830573,
            "title":"Change of mind (new girl)."
        },
        "135":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Someone enters her room.",
                "She wakes up.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more choices.</span></div></span></div>",
            "created":1588696080,
            "id":2830572,
            "title":"More choices. "
        },
        "14":{
            "choices":[
                "clevage.",
                "ass crack.",
                "stomach.",
                "belly-button.",
                "pussy."
            ],
            "content":"<div class=\"\"><div> <span>You made the choice to spy on Maddie Fenton. She was very hot in your opinion. \"I know who I'm going to spy on first.\" you said with a devious smile. \"Sounds like you have a plan.\" Desiree said. \"Yes.\" you say back to the ghost genie, \"But first, I need a few more wishes granted.\" \"Wish away, my friend.\" Desiree chuckled.<br>\r\n<br>\r\nAfter telling Desiree your wishes, you teleport yourself to check on Maddie. Wanting a taste of what her body had to offer, you teleported yourself inside her...</span></div></div>",
            "created":1308546000,
            "id":1130376,
            "title":"go see Maddie....."
        },
        "142":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "Try to find an exit",
                "Explore for a bit",
                "Something happens around you're location"
            ],
            "content":"<div class=\"\"><div> <span>As light wrapped around you You then felt a strong wind of high speed as you teleported to your destination Light was still around you as you teleported as you suddenly felt like you where sinking down in height and you felt like a small person Several minutes later the light around you start to fade away you must of reach your destination As the light slowly disappear you can make it out that you are now on a brand new location<br>\r\n<br>\r\nAs you look around at your new sroundings It was pretty dark but you can make out the smell of the area which was quite foul and revolting You can also felt the air around you which was humid and sticky You can feel the ground beneath your feet which was soft and cushiony And finally you can hear something high above you but you can't make out the source since it was too far up<br>\r\n<br>\r\nYou then decided to use a flashlight on your pocket to see the place around you You turn on the light and looked around You're on a large fleshy cave that seen to smell pretty bad like something out of a restroom or something You try to remember about coming here but what?<br>\r\n<br>\r\nYou start to think about trying to find an exit of this place but then you have a second thought about trying to explore further into this cave</span></div></div>",
            "created":1401598800,
            "id":1805652,
            "title":"Humid Tunnel"
        },
        "1421":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "You made it out safely",
                "Something strange happened that caused you to get pushed back into the tunnel",
                "The walls opened all the sudden and you fall off into the unknown"
            ],
            "content":"<div class=\"\"><div> <span>You decided to find an exit around here since the smell around here is too foul and you wouldn't want to stay in a place that smelled this bad, would you? You go to the opposite way and try to find an exit Using your flashlight, you see what looked like it could be exit as it look to be a shape of a hole You went right towards it and soon as you got closer, you see that the exit seemed to be blocked by two fleshy walls pressed together Suddenly, you slowly started to remember what you been doing here, something about being inside a body part of some sort but you still don't remember much Since the walls looked soft, you might still be able to squeeze yourself between them through the crack but that might be a little risky since you could end up getting smothered to death but you know you don't want to end up in this stinky place so pressed on<br>\r\n<br>\r\nYou begin to walk towards the crack and begin to crawl and squeeze through it It wasn't very easy since your hands don't have much strength to push the walls clearly but you're still able to crawl between them You try the best as you could to squeeze through but you're not sure when are you going to make it out</span></div></div>",
            "created":1456376400,
            "id":2109483,
            "title":"Try to find an exit"
        },
        "14211":{
            "author_id":"greenharold18",
            "author_name":"G.Harold",
            "choices":[
                "Climb below",
                "Climb above"
            ],
            "content":"<div class=\"\"><div> <span>As you try to crawl out of these fleshy walls, you could feel that you are nearly about to exit this smelly cave. After a few seconds of trying, you could feel both your arm and leg have reached outside and soon you squeeze yourself out. You jumped out of those walls and landed on a springy surface. You looked at the tunnel and noticed that it wasn't even a tunnel at all, but an enormous butt. You remember!!!! You remembered that you wished to be small and get sent inside a butt like that, but who's butt was it, anyways?<br>\r\n<br>\r\nYou finally looked around your brand new location, it was completely white all around and it was soft and silky. You looked both sides to see two large holes that might well be were the legs are, you wondered if you could climb down and maybe to see what lies below. Looking up, maybe you could climb up instead and see what lies over there.<br>\r\n<br>\r\nWhat's your choice?</span></div></div>",
            "created":1460511960,
            "id":2132089,
            "title":"You made it out safely"
        },
        "145":{
            "author_id":"firelordzx5",
            "author_name":"darklordzx5",
            "choices":[
                "Try to find the exit",
                "Explore, go deeper into this place",
                "Something happend around you're location"
            ],
            "content":"<div class=\"\"><div> <span>Light surrounded you, feeling youself weightless for a moment until to be trapped into a moist and tight area, it was fleshy and overall soft, it was pretty dark with a strange scent that was quite strong, the entire place was wet and the walls and flood beneath your feet was soft and cushiony, you can heard something above but you can't place it as the source was far up<br>\r\n<br>\r\nturning on your flashlight in hand, you saw that you were in a fleshy tunnel, it was quite small and the walls seems to be have life in it's own, like if you were eaten by something, you try to remember, why you are here again?<br>\r\n<br>\r\nYour first objective was now to exit this place but you had a nagging feeling to explore further this strange place place</span></div></div>",
            "created":1463622480,
            "id":2150324,
            "title":"pussy."
        },
        "1452":{
            "author_id":"firelordzx5",
            "author_name":"darklordzx5",
            "choices":[
                "Get even deeper",
                "Climb down.",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>You had curiosity and the feeling to go deeper into this place, you began to climb upward. As you touch the fleshy walls, it react on your touch, mamking the place tremble slightly and the tunnel clamps down to onto you, pulling you deeper as it become moist.<br>\r\n<br>\r\nYou hear of what sounds like heartbeats rising and a low moan. It convince you that you're inside someone and yet why you couldn't remember? You weren't alarmed though, you wanted to find out in where you're.<br>\r\n<br>\r\nSoon, you got on front with a twitching ringed sphincter with a hole in it. It first, you were still confused until you finally realized in where you are. You're inside a vagina, deep enough to be facing the cervix. You were suprised, you remember the wish Desiree had granted you but which girl she.. inserted you? Well that doesn't seems to matter now, you were on front of the gateway to the woman's womb. You..</span></div></div>",
            "created":1502571000,
            "id":2368342,
            "title":"Explore, go deeper into this place"
        },
        "15":{
            "choices":[
                "Stay with Desiree.",
                "Go check on Ember.",
                "Scoop out Spectra.",
                "Peer at Kitty.",
                "Other ghost girls."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have decided to stay here in the Ghost Zone. You did think Desiree was very sexy. Of course, the Ghost Zone was packed full of hot ghost girls. You decided to....</span></div></span></div>",
            "created":1308546000,
            "id":1130368,
            "title":"stay in the Ghost Zone......."
        },
        "151":{
            "choices":[
                "Make a wish",
                "Try out your new powers",
                "Get to know her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You gave Desiree long look at her voluptuous body, stopping momentarily at her large breasts. How could you just walk away from a woman like that? She feels your gaze and gives you a playful smirk.<br>\r\n<br>\r\nWhat should you do now?</span></div></span></div>",
            "created":1354597200,
            "id":1482151,
            "title":"Stay with Desiree."
        },
        "1512":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "\"Right in between my cleavage.\"",
                "\"Inside the front or back of my panties.\"",
                "\"Right inside my shoe.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You don't mind of I try these powers out with you, right?\" You asked nicely.<br>\r\n<br>\r\n\"But of course. Show me the gifts I granted for you.\" Desiree said with a smile.<br>\r\n<br>\r\nYou nodded and give the shrinking powers a try first. You concentrated and you shrunk down to about 3 inches tall. Desiree was impressed and was feeling turned on to see you so small.<br>\r\n<br>\r\n\"The shrinking part works. Now, let's try the teleportation part out.\" You suggested.<br>\r\n<br>\r\n\"Would you like me to tell you where to?\" Desiree asked with a playful smile.<br>\r\n<br>\r\n\"Sure. Anywhere is fine.\" You said.</span></div></div>",
            "created":1501826160,
            "id":2364325,
            "title":"Try out your new powers"
        },
        "15122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "vagina",
                "ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Desiree grew from her ghost tail to a pair of legs so that she can have a pussy and an ass for you to see. You got turned on to see such a beauty as you teleported into her panties by her</span></div></span></div>",
            "created":1501827000,
            "id":2364340,
            "title":"\"Inside the front or back of my panties.\""
        },
        "1513":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "give her a hug",
                "give her a kiss",
                "ask her to go out with you"
            ],
            "content":"<div class=\"\"><div> <span>You decided to get to know Desiree a bit better since you're with her at the moment. She tolds you about how she just gives out wishes to everyone to make them happy, but she could never get anything that could make her happy in return. You feel her pain that she just gives and gives, only to be casted away like she'd never done anything good to begin with. You then</span></div></div>",
            "created":1501024620,
            "id":2359315,
            "title":"Get to know her"
        },
        "15132":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "normal-sized sex with you",
                "sex with you being so small"
            ],
            "content":"<div class=\"\"><div> <span>Out of nowhere, you plant a kiss on Desiree's cheek and she was blushing like crazy while shocked by what just happened. You realized what you'd done and you quickly turned your head around. Desiree then grabbed your face and turns you back to facing her.<br>\r\n<br>\r\n\"My friend? Think you can give me another one on the lips rhis time?\" Desiree asked with romantic intensions.<br>\r\n<br>\r\nYou smiled a little before leaning in and planted a kiss on her lips. You then felt her tongue entering yours and it felt kinda right kissing a female ghost like. When you two stopped, Desiree wants to try this somewhere that's more private. So, she uses her powers to bring you to a bedroom that has a bed bigger for you both.<br>\r\n<br>\r\n\"Ready for some fun?\" Desiree asked seductively.<br>\r\n<br>\r\n\"You bet.\" You said with excitement.<br>\r\n<br>\r\nDesiree then wants to try</span></div></div>",
            "created":1502210460,
            "id":2366616,
            "title":"give her a kiss"
        },
        "153":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Her bra",
                "The back of her panties",
                "The front of her panties"
            ],
            "content":"<div class=\"\"><div> <span>You use your new powers to teleport to see Spectra. You landed on the floor, shrunken, and turn around to see Spectra on her chair. She looks smoking hot with her red dress that she wears while she was a councilor. You look at her sexy legs going up to her red skirt. Spectra looks down and sees you on her floor. She looks at you with glee in her eyes. She picks you up bring you to her face.<br>\r\n<br>\r\n\"Hello there handsome. Tell me, how did you get so small?\" Spectra asked.<br>\r\n<br>\r\n\"Desiree.\" You answered.<br>\r\n<br>\r\n\"Well, I'll have to thank her later for bringing me such a good looking man.\" Spectra said.<br>\r\n<br>\r\n\"Actually, call me crazy, but this was kinda my idea.\" You said.<br>\r\n<br>\r\n\"Really? Well, you've come to the right place. I'm gonna enjoy this with you.\" Spectra said.<br>\r\n<br>\r\nSpectra then put you in</span></div></div>",
            "created":1466543400,
            "id":2168080,
            "title":"Spectra."
        }
    },
    "info":{
        "author_id":"kan101",
        "author_name":"Neo Space",
        "brief_description":"one day you meet Desiree the ghost of wishes and you wish for.......",
        "created":1269639840,
        "description":"<td align=\"left\" class=\"norm\">Your name is Matt and one day you meet Desiree, the ghost of wishes, and you wish for the power to shrink to any size you want, and grow back to normal size whenever you want, and to teleport wherever you want,whenever you want.<br>\r\n<br>\r\nanything goes here, just try to stay away from gay stuff, that is all.....HAVE FUN.....</td>",
        "id":1658927,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588696140,
        "modified":1588696140,
        "pretty_title":"Shrunk With The Girls Of Danny Phantom"
    }
}