{
    "chapters":{
        "1":{
            "author_id":"jsieker",
            "author_name":"Jsieker",
            "content":"<div class=\"\"><div> <span>A young couple had a night of pleasure. That one night a baby was conceived. So the young couple got married and thought this would be the best for the unborn child. And so he enlisted in to the service to have a good family life. The two seemed to get along really well and were happy until hurt turned the relationship for the worse. The young woman was very hurt by the young man. So she became angry, bitter and vindictive. So they young women decided that this man was not allowed to have anything to do with the unborn child. Putting the baby up for adoption was her answer so he couldn’t be with the child. The young man decided to wait to sign any paper work until after the baby was born. <br>\r\n   The day arrived for the baby to be born. It was a girl. The young women could not see this new baby girl because that’s how adoption works. So the young man went that night to see the baby. He wasn’t supposed too, but the baby was in another room and saw the baby girl. The young women found out and she became very angry. <br>\r\n The adoptive parents stood by the young women through the delivery. The time came for this young man to sign the adoption papers. He spent time with the baby and held it and took pictures. The adoptive parents were very supportive of having the open adoption.  The young man took a paternity test thinking maybe it wasn’t his child, knowing that the women may have had other relations with another man. So waiting for the results he finally had to sign off on a Friday morning. He really didn’t know what to do. But he finally signed not knowing that the baby could be his baby girl or someone else’s. <br>\r\nEmotions were going through the young couples minds. The adoptive parents were very emotional because they couldn’t bear to lose the baby that they wanted for 16 years. The family member’s hearts were broken knowing that they would never see or hold this child again. Emotions raced with all who were involved. It was like an emotional roller coaster. The young man’s family who watched him grow up was very angry at him for not keeping the child in the family.  The young man didn’t care what others thought. He signed off what he knew was best for the child weather it was his baby or someone else’s. Tears fell from the young man eyes kind of like grieving for a dying child. He knows that he will miss his daughter and will not be able to spend every moment with her. <br>\r\n He waits the day for the test to come back to give him the final answer to the paternity test. He just needs confirmation. Although it might be his he steps back and lets the adoptive parents love and care for the his baby girl. If the child is not his all will be relieved from all the hurt and pain he put his family through. Life is full of choices. Hopefully the choices we make will have good results in the end. The one thing for the young man because he asked for open adoption he will be able to see her again and watch her grow with pictures. And he will even be allowed to visit her. When the time comes for the child to know who her real father that door will be open for the baby girl. Morgan will see her real daddy someday and meet him. If the child is someone else maybe he will still be interested in knowing how she grows up. Or walk away knowing that the women he married lied to him. In May the young man will go into the service and learn many new things about life. <br>\r\n</span></div></div>",
            "created":1333267080,
            "id":1307194,
            "title":"The adoption"
        }
    },
    "info":{
        "author_id":"jsieker",
        "author_name":"Jsieker",
        "brief_description":"The emotions of an Adoption a young man must face.",
        "created":1333265700,
        "description":"<td align=\"left\" class=\"norm\">A youngs man desicion to proceed with adoption not know what holds in the future</td>",
        "id":1858554,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1333267140,
        "modified":1333267140,
        "pretty_title":"The adoption "
    }
}