{
    "chapters":{
        "1":{
            "author_id":"gwarner",
            "author_name":"Onlyonekey",
            "choices":[
                "Story #1",
                "Story #2",
                "Story #3",
                "Story#4",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, what are you waiting for? Pick a slot and have some fun!</span></div></span></div>",
            "created":1552955640,
            "id":2631995,
            "title":"New tales begin!"
        },
        "11":{
            "author_id":"gwarner",
            "author_name":"Onlyonekey",
            "choices":[
                "Choice 1",
                "Choice 2",
                "Choice 3",
                "Choice 4",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is for a story set in the world of My Hero Academia.</span></div></span></div>",
            "created":1555120740,
            "id":2644102,
            "title":"Story #1"
        },
        "12":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Hanson to Hannah.",
                "The siren girl.",
                "The dream maker.",
                "The reality witch.",
                "The shape shifter."
            ],
            "content":"<div class=\"\"><div> <span>There are five simple plots where one can get lost in a story...<br>\r\n<br>\r\n1. A boy named Hanson Hannah discovers that he can switch genders and become Hannah Hanson at will but finds it is not as fun as he expects it to be as he can not change back into a boy when wearing anything feminine like perfume. Worse, a girl learns his secret...<br>\r\n<br>\r\n2. A girl discovers that she can swoon any boy or man with her voice, make him do whatever she wants. The only draw back is she can only control one boy or man at a time and her brother is immune...<br>\r\n<br>\r\n3. A boy discovers that he can literally make his dreams and fantasies come true. Only this includes his nightmares and fears...<br>\r\n<br>\r\n4. A girl learns that she can change reality and change it back to normal at will. What mischief will she get into?<br>\r\n<br>\r\n5. A boy learns that he has the power to become anyone or anything he desires. Problem: He can only change when he is alone.<br>\r\n<br>\r\nSo, which simple plot will you chose, adventurer?<br>\r\n</span></div></div>",
            "created":1566361440,
            "id":2705482,
            "title":"Simple Plots..."
        },
        "13":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "The Barns family: protect a bullied sister.",
                "The Crocker family: stop a heated divorce.",
                "The Smith Family: problem unknown.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>You play a twelve year old boy named John Hanson with the fortunate or unfortunate supernatural ability to become one with any family in need of help. Pictures of you growing up appear in the family's home and they treat you as if you were always a member of their family. You also gain memories of growing up with the family overlapping but not taking over your own. Once the need is no longer there, you move on to another family where the process starts again. You always remember each and every family you enter but they no longer see or remember you as a relative once you leave until you enter again. You do not have any control over which family you fall into only the fulfilling of their need.<br>\r\n<br>\r\n<br>\r\nYou long to return to your own family but fear you may never reach that goal as so many families are in need of something. You fear you will fall into madness but that has not happened yet. How will you cope? Will you make it back to your own family? Will you go mad? What needs will you face as a member of everyone's child?<br>\r\n<br>\r\nYou decide...<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. First person writing (I, me, myself, etc)<br>\r\n<br>\r\n2. No killing the main character.<br>\r\n<br>\r\n3. Adding new characters is allowed.<br>\r\n<br>\r\n4. No transformations... you cannot become a girl in one family or a teenager or an adult. (see interactive rules)<br>\r\n<br>\r\nWhich family do you enter and what help do they need?<br>\r\n</span></div></div>",
            "created":1570050720,
            "id":2726966,
            "title":"Story #3 Everyone's child."
        },
        "131":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Coach Brown.",
                "Principal Edwards.",
                "Ms Jones, the English teacher.",
                "your choice.",
                "you decide."
            ],
            "content":"<div class=\"\"><div> <span>June 1st... It was just before the start of summer vacation. I had just resolved a rather nasty issue with the Bane family. Someone was stealing money from their home and they had begun to blame each other. I discovered it was actually Sarah Bane's crooked boyfriend who was the culprit. He was just using her to get a piece of the family fortune.<br>\r\n<br>\r\nIt felt good to see all of the money returned to the family and that lying, cheating thief put behind bars but I had a feeling that I would become his brother to solve his issues sooner than I wanted to...<br>\r\n<br>\r\n\"Leave me alone!\"<br>\r\n<br>\r\nMy thoughts were interrupted by a young girl screaming in protest. I turned only to feel dizzy for a moment. As my head cleared a second later, I knew I had switched families. The little girl was named Ina Barns, my baby sister. She was around seven years old with golden blond hair in pigtails and blue eyes. She was wearing the standard schoolgirl uniform with the pleated dark blue skirt, light blue blouse and dark blue vest. Surrounding her were two of the school's most notorious bullies. Greg Rivers and Karl Dune. They were pulling on her pigtails, flipping up her skirt and snapping her training bra among other things.<br>\r\n<br>\r\n<i>\"Here we go again...\"</i> Frowning, I thought. <i>\"When am I going to be one of their brothers so I can take them down a notch?\"</i><br>\r\n<br>\r\nI marched up to the three before pulling Ina out of their reach. \"You three should know better than to pick on my sister.\" Through gritted teeth, I hissed. \"Take a hike.\"<br>\r\n<br>\r\nGreg shot me a death glare, or at least tried to. He was not tall or muscular as far as bullies go. No, he was barely my height with short brown hair and brown eyes. He just had a rich father who always managed to clean up after him so he thought he could get away with anything.<br>\r\n<br>\r\nKarl just scoffed at me. He was not the tallest or strongest among his peers either. He was about an inch taller than me with longish bond hair and green eyes. He bullied others just to stay buddies with Greg. I found it ironic that without Greg, Karl would likely end up being the one bullied.<br>\r\n<br>\r\n\"We're just messing with her, Jon.\" Lightly, Karl said. \"Don't be so over dramatic.\"<br>\r\n<br>\r\nI had learned a lot while switching from one family to the other over the last two years. I learned martial arts from the Wayne family, deductive reasoning from the Holmes family, the list goes on and on. I was actually surprised by how quickly I learned such things but then again, I 'grew up' in these families.<br>\r\n<br>\r\n\"Why do you always have to ruin our fun?\" Walking away, Karl demanded. \"It's not like we were hurting anyone.\"<br>\r\n<br>\r\n\"Just leave her alone.\" Calmly, I replied.<br>\r\n<br>\r\nAfter they had left, Ina turned to me with a grateful smile. \"Thanks, big brother.\" Softly, she said. \"Only they really saved me.\"<br>\r\n<br>\r\nThis made me concerned. \"What do you mean they saved you?\"<br>\r\n<br>\r\nIna fell silent, tears forming and I knelt down to her level. \"Ina, you need to talk to me.\" firmly but kindly, I said. \"Who did they save you from?\"<br>\r\n<br>\r\nIna bit her lip as if to keep it from trembling as she whispered...<br>\r\n</span></div></div>",
            "created":1570366080,
            "id":2728814,
            "title":"The Barns family: protect a bullied sister."
        },
        "14":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "make a wish",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>My name is Max and I'm a normal teenage boy, age 16. I live with my parents in a small house in the big city of New York, in Queens. I am a single child and my mom is working as a secretary in law local bank office while my dad is leading an international company downtown Manhattan. This company sells some technology and also has some government connections where they get some secret orders from the government, mostly from the military Department or the CIA or FBI. Of course my dad is not allowed to speak about what they do and what they are currently working on of course my mom and myself always were curious but we never get any more information out of my dad that it's just important what he's doing and we should trust him that he does not do anything illegal or unethical <br>\r\n<br>\r\nI was attending the Queens high school also around there I was quite the average guy.<br>\r\nI have some friend, my best friend actually is Greg and he's white and handsome to be honest more attractive than myself and most probably for that reason has more luck with the girls. Unfortunately I always was losing any kind of competition against him also for this year’s school prom-He already got a nice girl to join him and be his company for the event while I was still struggling to get someone appropriate. My target is still to get someone and as my first idea I was thinking to ask this new girl from the class of miss Williams out for joining to the prom. Maybe I have a chance because she's new around here and I heard that she moved from somewhere in from a small town in New Jersey to the big city of New York and she might not have that high expectations. Even this is poor what I'm thinking it seems to be true <br>\r\n<br>\r\nI had one week of time until the time will come for the prom and so I just left in the day like any other day. It came that this morning that we had like our normal courses to join like mathematics English lessons biology chemistry and so on.<br>\r\nIn my lunch break I finally might get the chance to talk to the New Girl. Her name is Lisa Ange she is already finishing her lunch so I had to find a reason to sit next to her on her table because she wanted to leave and I should avoid her to leave.<br>\r\nI just asked her if she would mind if I sit next to her. She agreed and for some reason unexpected for me I have luck that she seems to be interested in me or at least she was nice to me and we could indeed establish a small chat, where I started to introduce myself and later ask her about herself-<br>\r\nI was getting confirmation about what I knew before that she was from a small town I never heard before somewhere New Jersey. Her dad has left her mother and she was living alone with her mother now.<br>\r\nShe told me the name of the street and it was nearby my place actually. Since she was new to New York she asked me if I could tell her where she could spare her time and meet some friends or actually make some new friends. With a nice smile I said why she would not start with me as her first New York friend and she smiled back answered why not. I was happy and hoping that this will start in the right direction give me the opportunity to get finally a nice girl on my side <br>\r\n<br>\r\nthis evening I returned home happy from the events around lunchtime when I starting talking to my mother, who wondered why I'm so happy. I told her that I finally met a girl, who showed some interest in me which also made my mom happy and later when she told my dad about this, he was also happy.<br>\r\nI went to bed and since I could not sleep and it was a warm summer night I opened the window looked out in there dark Sky watch this finally and suddenly found time star which was bright and shiny, maybe a comet or a wishing star…<br>\r\n</span></div></div>",
            "created":1587562800,
            "id":2822636,
            "title":"Story#4"
        }
    },
    "info":{
        "author_id":"gwarner",
        "author_name":"Onlyonekey",
        "brief_description":"A place for stories to be told.",
        "created":1552955580,
        "description":"<td align=\"left\" class=\"norm\">A little place for stories I'd prefer not to put on any of my other interactives. In other words, for more serious stories.<br>\r\n<br>\r\nOn a small note, this is not the place for transformation-based stories. If you want to do that, look at my other interactives or somewhere else.<br>\r\n<br>\r\nI would advise you speak to me before any potential chapters, as I have specific uses for this interactive.</td>",
        "id":2185701,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587562800,
        "modified":1587562800,
        "pretty_title":"Extra Stories"
    }
}