{
    "chapters":{
        "1":{
            "author_id":"seanp225",
            "author_name":"dark helmet",
            "choices":[
                "Mom",
                "Sister Michelle",
                "Aunt Sarah",
                "Maid Selina"
            ],
            "content":"<div class=\"\"><div> <span>You walk out of school on a warm summers day and have one thought \"Vacation time baby\" you shout as you get in your Ferrari Spyder<a rel=\"nofollow\" href=\"https://encrypted-tbn0.google.com/images?q=tbn:ANd9GcR6HU_r_feWWt7Qe7W2SwctaAfjCzMFe-_F5nbfUTAa6Pjd5NaKGg\" target=\"_blank\">https://encrypted-tbn0.google.com/images...</a>  (a gift from your dead dad) and speed home. When you arrive home your mom is waiting at the door \"Hello Jason\" she says pulling you into a big hug. \"Mom get off I'm suffocating\" you say pulling your face out of her massive tits. You run up the steps to your Huge mansion <a rel=\"nofollow\" href=\"http://www.martinhal.com/assets_live/282/villa32.jpg\" target=\"_blank\">http://www.martinhal.com/assets_live/282...</a> and into the door you run into your hot ass maid Selina and slap her huge firm butt jokingly as you pass \"Ah bastardo\" she cries out in mock surprise. You go to your room and feel a strange burning in your neck where a bug has bit you. \"Ah fuck\" you shout and hit out at the wall hurting your hand in the process. You feel funny and go to one of your many bathrooms.You sit on the toilet and see black. When you wake up you see a member of your family standing over you at 400 feet tall. But who is now moving to the toilet seat.</span></div></div>",
            "created":1336160280,
            "id":1329508,
            "title":"Summer Baby"
        },
        "11":{
            "author_id":"seanp225",
            "author_name":"dark helmet",
            "choices":[
                "Hallelujah.",
                "Oh shit."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh god my stomach\" your mom moans as she lifts the toilet seat up,\"may God have mercy on the bowl\" she comments completely unaware of her star son now swimming for his life in a torrent of icy water.She looks back into the water to check it's all nice and clean. Does she notice you?</span></div></div>",
            "created":1378603080,
            "id":1659324,
            "title":"Mom"
        },
        "12":{
            "author_id":"seanp225",
            "author_name":"dark helmet",
            "choices":[
                "Good ole solid logs.",
                "Horrible liquid Taco Bell of death."
            ],
            "content":"<div class=\"\"><div> <span>\"Out of the way Selina, I need to shit so bad\" you hear your sister shout at your maid.\"No problem miss Michelle\" your maid replies \"the cleaning can wait.\" \"Damn right it can 'cause what's brewing now will probably need a birth certificate\" Michelle laughs and as the door shuts you hear the zipper of her jeans get undone and see her monster ass plonk on the seat and not a minute too soon for as soon as she sits a huge torrent of shit assaults your body. Only question is what state was it in?</span></div></div>",
            "created":1378603440,
            "id":1659327,
            "title":"Sister, Michelle"
        },
        "13":{
            "author_id":"seanp225",
            "author_name":"dark helmet",
            "choices":[
                "Pissy river.",
                "Shit mountain."
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, time for an evacuation\" your slob of an aunt declares as her ass falls upon you, sealing off all light. Prrrrffffttt a huge fart escapes from the horror above. Coughing and wheezing you cry out \"Sarah no don't, it's occupied!\" but your tiny pleas fall on deaf ears as Sarah begins to sing tunelessly. Sje begins to take a long...</span></div></div>",
            "created":1378603680,
            "id":1659328,
            "title":"Aunt Sarah"
        },
        "14":{
            "author_id":"seanp225",
            "author_name":"dark helmet",
            "choices":[
                "Living room.",
                "Your mom's room.",
                "Aunts guest house.",
                "Sister's study.",
                "Derrick's Games room."
            ],
            "content":"<div class=\"\"><div> <span>\"I really should get to cleaning in here\" Selena sighs to no-one in particular. Hmm,¿dónde está el señor Derrick\" she wonders aloud before plunging her brush into the toilet below her titanic (to you) form. \"Alright I got one shot at this\" you think, as you grab on to the brush and begin the slow ascent upwards out of the porcelain prison. \"Freeeeeeedom\" you cry in full Willaim Wallace mode as you leap onto Selena's back, but your hopes are dashed as she suddenly straightens up and you get caught in her belt loop. \"Now that that's done, I must go clean the...\"</span></div></div>",
            "created":1378604160,
            "id":1659333,
            "title":"Maid Selina"
        },
        "141":{
            "author_id":"reborner",
            "author_name":"Reborner",
            "choices":[
                "The maid",
                "The mother or aunt",
                "The sister"
            ],
            "content":"<div class=\"\"><div> <span>Heading to the living room, Selena starts cleaning as you start struggling your way out. Eventually, you pop out and land on the counch, the shock scrambling your brains a bit. Once you recover from it, just in time to hear a gurgle above you and look up to see someone's ass over you. Who is it?</span></div></div>",
            "created":1532667540,
            "id":2525344,
            "title":"Living room."
        },
        "144":{
            "author_id":"vaji",
            "author_name":"Vaji",
            "choices":[
                "She has a gas attack.",
                "Your mom calls her downstairs.",
                "You attempt to escape."
            ],
            "content":"<div class=\"\"><div> <span>You'd hold onto her belt loop with all your might as she walked out of the bathroom, her humongous bottom swaying from side to side as it'd make your attempt at survival difficult.<br>\r\n<br>\r\nShe'd slowly make it into your older sister's room as her fat asscheeks clapped onto you, viciously pulling your arms away from her belt as you felt your entire body sink into her deadly buttcrack. She'd waddle over towards your sister's computer as she'd start dusting the screen, jiggling her bottom as she tried to reach the back of the screen. The sudden movement would cause her cheeks to clap once more as you dislodged yourself, falling out from her rump only to come crashing down onto the soft office chair beneath.<br>\r\nYou'd rub your head, looking up as your view was blocked by the titanic rectum of your maid. Her monstrous bottom stretching out for miles as her pants had slid down just enough to show a portion of her bubbly buttcrack. Although you really didn't have a lot of time to stare as the door soon slammed open.<br>\r\n<br>\r\n\"Fuck me, my pants will never be the same again.\" Your sister said angrily as she stomped into the room, throwing her spandex pants into the corner of the room with a loud \"Splotch\". \"Mom knows what mexican food does to my belly, the stupid cow.\"<br>\r\n<br>\r\nYou'd look around your shoulder as you saw the massive form of your sister stand in the opening, wearing nothing to cover the bottom part of her body as she'd stomp further into the room.<br>\r\n<br>\r\n(( <a rel=\"nofollow\" href=\"https://bootyoftheday.co/2015/04/13/big-butt-tight-squeeze/\" target=\"_blank\">https://bootyoftheday.co/2015/04/13/big-...</a> ))<br>\r\n<br>\r\n\"Selina, get the FUCK out of here, I have to far--- I mean, study.\"<br>\r\nYour maid nodded and stepped out, and soon enough, another shadow would loom above you as the naked bottom of your sister completely engulfed your sight. You thought Selina's butt was big, this one is otherworldly.<br>\r\n\"Gawd, I have to fart so badly.\" she'd exclaim as her fat rump jiggled above, sticking out like a shelf. She'd arch her back and let out a loud grunt as a fat, airy explosion of gas would erupt from her ass, the rancid stench of mexican food and month old trash invaded your nose as you'd cough and gag.<br>\r\nMichelle would slowly lower her fat rectum onto the tiny chair, her jello cheeks jiggling furiously as she'd smack her fat rectum onto the seat, pinning you deep into her sweaty buttcrack.</span></div></div>",
            "created":1459542360,
            "id":2126153,
            "title":"Sister's study."
        }
    },
    "info":{
        "author_id":"seanp225",
        "author_name":"dark helmet",
        "brief_description":"You have Shrunk in your house and must avoid your family members and there huge assets",
        "created":1336159500,
        "description":"<td align=\"left\" class=\"norm\">Please NO other guys. Keep it second person (eg: you ran into...)<br>\r\nCharacters:<br>\r\nYou (Derrick):Pretty averagely built, 16 year old who has good enough grades in high school and has a few close friends. You are quite good at climbing and manouvering about in a pinch.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://img.dailymail.co.uk/i/pix/2007/10_04/aleksDM2510_468x340.jpg\" target=\"_blank\">http://img.dailymail.co.uk/i/pix/2007/10_04/aleksDM2510_468x340.jpg</a><br>\r\n<br>\r\nMom (Julie): 32 years old fit as fuck and a former stripper.Huge tits and ass.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://29.media.tumblr.com/tumblr_lrtq3q2oOu1qkzfymo1_500.jpg\" target=\"_blank\">http://29.media.tumblr.com/tumblr_lrtq3q2oOu1qkzfymo1_500.jpg</a><br>\r\n<br>\r\nSister (Michelle): 24years old your older and only sister,acts very slutty.Has a huge ass and major tits.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.super-size-tits.com/wp-content/uploads/2010/12/bigwettitties.jpg\" target=\"_blank\">http://www.super-size-tits.com/wp-content/uploads/2010/12/bigwettitties.jpg</a><br>\r\n<br>\r\nAunt (Sarah):30 years old your live in aunt really lazy and slobbish and is also a secret pornstar.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.shufuni.me/wp-content/uploads/mvbthumbs/img_3012_big-tit-brunette-milf-pornstar-anal-pounded-by-window-washer-guy.jpg\" target=\"_blank\">http://www.shufuni.me/wp-content/uploads/mvbthumbs/img_3012_big-tit-brunette-mil...</a><br>\r\n<br>\r\nMaid, (Selina);20 years old your maid/fuck buddy Nice ass and pretty average tits.<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i161.photobucket.com/albums/t222/sabrebIade/galileamontijo-hot.jpg\" target=\"_blank\">http://i161.photobucket.com/albums/t222/sabrebIade/galileamontijo-hot.jpg</a></td>",
        "id":1865695,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1532667540,
        "modified":1532667540,
        "pretty_title":"Shrunk In Your Own House"
    }
}