{
    "chapters":{
        "1":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Fire Emblem 7 (Blazing Sword)",
                "Fire Emblem 6 (Sword of Seals)",
                "Fire Emblem 8 (The Sacred Stones)",
                "I personally would prefer a different game"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All great stories must have a beginning so let's get started...what game is the character from?<br>\r\n<br>\r\n<br>\r\nI kinda want this to stay in the GBA Universe but i will leave a other option for people to open up more choices</span></div></span></div>",
            "created":1307768400,
            "id":1124003,
            "title":"Let's get this started."
        },
        "11":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so you choose blazing sword do you? then would the shrinkee happen to be a boy or a girl oh and dont worry the short chapters will end once everythings set up</span></div></span></div>",
            "created":1307768400,
            "id":1124012,
            "title":"Fire Emblem 7 (Blazing Sword)"
        },
        "111":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Eliwood",
                "Hector",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who? short and simple</span></div></span></div>",
            "created":1307768400,
            "id":1124017,
            "title":"Choices...gotta love em'"
        },
        "1111":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "..Lyndis\"",
                "...Nino?!\"",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day in the Lycian territory of Pherae..Eliwood had been named marquess a few months ago after defeating the fire dragon and saving the world, but he was a little bored lately. \"*sigh* guess its backing to boring old Elibe...i need some kind of excitement soon otherwise im gonna die of boredom,\" Eliwood kept saying not knowing he was about to go on a really big adventure.<br>\r\n<br>\r\n2 days later<br>\r\n<br>\r\nEliwood woke up that morning feeling a little strange but he couldnt quite figure out what was wrong...until a little while later wouldnt you know it he shrunk. \"Oh shit...this is bad\" he said looking around at his new big surroundings. \"I need to find a way back to normal quick or im most likely going to die\" and just as he said that he heard giant foot steps coming down the hall. \"oh great just what i need...someone coming in\" Eliwood ran for the nearest hiding spot (which was under his bed) and waited...soon the foot steps grew louder and louder and then he saw the door open to reveal who it is..\"Oh great, it's...</span></div></div>",
            "created":1307854800,
            "id":1124214,
            "title":"Eliwood"
        },
        "11111":{
            "author_id":"7777",
            "author_name":"This site is dead.I wana leave",
            "choices":[
                "Come out of hiding",
                "Stay hidden"
            ],
            "content":"<div class=\"\"><div> <span>\"Lyn!\"<br>\r\nHe saw a large pair of brown boots enter the room, attached to some staggeringly long legs, he looked up to see Lyndis's drastically larger body, ending with her larger face, and a long, dark green pony tail.<br>\r\nEliwood was surpised to see her, and wondered if he should go to her or stay hidden. The timing of her arrival was fortuitous, on the other hand did that mean she was the one who shrunk him? <br>\r\nMaybe that mean he should try to avoid her. But.... she might be able to help him, and even if she was the one who did this, would going with her be so bad?<br>\r\nEliwood decided to....</span></div></div>",
            "created":1308114000,
            "id":1126380,
            "title":"..Lyn\""
        },
        "11112":{
            "author_id":"7777",
            "author_name":"This site is dead.I wana leave",
            "choices":[
                "Young",
                "Sage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Young Nino or Sage Nino?</span></div></span></div>",
            "created":1308114000,
            "id":1126378,
            "title":"Which Nino?"
        },
        "111121":{
            "author_id":"7777",
            "author_name":"This site is dead.I wana leave",
            "choices":[
                "Approach her",
                "Stay hidden"
            ],
            "content":"<div class=\"\"><div> <span>\"Nino!\"<br>\r\nHe saw a huge pair of purple boots enter the room, but when he looked up and saw her bright green and distinct childish face their was no mistaking her. She was still as short as she had been before and still looked like a kid, but to Eliwood she seemed titanic! The contrast was very strange.<br>\r\nEliwood wondered what she was doing here. She seemed to be looking around for something, Eliwood wondered if it might be him. Could Nino have shrunk him with a spell? It would explain her presence here...<br>\r\nHe could feel immense footsteps apporaching the bed. He wondered if he should reveal himself or stay hidden. <br>\r\n</span></div></div>",
            "created":1308114000,
            "id":1126379,
            "title":"A surprise guest"
        },
        "1111212":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "wave your arms like mad and scream method",
                "Try to climb up the bed method"
            ],
            "content":"<div class=\"\"><div> <span>\"I should probably remain unseen....i still need to see what her motives for coming here are\" Eliwood thought to himself. He watched Nino walk towards the bed then she stopped. \"They told me Eliwood was in his room...and i had a new spell to show to him.\" She said with her eyes still scanning the room. Eliwood started smiling \"so maybe it was just a new spell that back-fired without her knowing...that's a relief!\" Eliwood started to walk out of his hiding place to think of ways to contact her when he heard her say, \"Huh? is that a bug?!\".  \"Oh shit!\" he dived back under the bed just as her purple boot stomped where he just was. \"Okay, that was not my greatest idea ever\" from up above Nino was scanning the room for the \"bug\". \"Where'd it go? i don't want Eliwood to come back to a bug in his room\". Eliwood saw her start moving again looking around the room the the \"bug\" that she just tried to stomp. \"Maybe i should just stay under the bed...no don't think that way Eliwood come on now! You have to find a way to contact her, cause obviously staying hidden is not the best option\" Eliwood decided his best options were to either climb up the bed to be closer to eye level with her or try the stupid way to wave his arms like mad and scream for her attention, but hey stupid ways may be stupid but they have a chance to work, right?</span></div></div>",
            "created":1308114000,
            "id":1126460,
            "title":"Aware...But Unware"
        },
        "11112121":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "He's stuck to her boot",
                "He thankfully comes off her boot"
            ],
            "content":"<div class=\"\"><div> <span>Eliwood could not believe what he chose to do. He has just narrowly avoided death from her foot and was now about to run out and try to get her attention. \"Maybe shell recognize me this time...or she'll just stomp me out of existence...you know this is sounding like a worse plan every second...oh well!\" Eliwood charged out from under the bed and started waving his arms like mad and screaming things like \"Nino!\" \"Down here!\" and \"Dont squish me!!\" but none of them seemed to reach her ears...well atlest from Eliwood perspective.<br>\r\n<br>\r\nNino's POV ~<br>\r\nNino was still searching around for the bug when she thought she heard tiny screams \"Hmm what's that?\" she wondered as she looked around. Then she looked down and saw the bug standing there looking like it was trying to get her attention. \"So you saved me the trouble to look for you little buggie\". She walked over towards the bug and saw it running away. She just stepped forward a few steps and stomped the bug. She stomped a few more times just to be sure then deciding it was dead, left the room.<br>\r\n<br>\r\nEliwood's POV ~<br>\r\nEliwood figured it was no use. Nino wouldn't hear he tiny screams and even if she did hear him she'd probably try to stomp him again. As soon as Eliwood was about to turn around he saw her look directly at him. \"She must have heard me!\" but then her heard her say \"So you saved me the trouble to look for you little buggie\". \"Oh i must have won an award for my stupid ideas by now\" Eliwood said as he started running at top speed away from her. After a little bit he felt he was making progress when he saw a shadow loom above him. He looked up and saw her boot heading towards him at an alarming rate. Eliwood tried to get away but the boot stomped right on him. He immediately noticed the stench, these were the same boots she wore all day so obviously they would but, the smell seemed intensified at his current size, Then came the other stomps. He saw the boot go down 2 more times before she finally stopped. Eliwood was coughing out blood at this point. \"How the hell am i not dead yet...\" Soon he would regret his body clinging on to life as she started to move out of the room.</span></div></div>",
            "created":1308114000,
            "id":1126949,
            "title":"Stupid Things lead to bad Situations..."
        },
        "111121211":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Contact Her",
                "Rest...The pain is catching up to you"
            ],
            "content":"<div class=\"\"><div> <span>\"You have got to be kidding me\" Eliwood said as he realized he was stuck to the bottom of her boot. The motion of her foot going up and down over and over again was sickening and every time her foot hit the ground Eliwood experienced a new level of the word PAIN. By the time she left the room he could feel the life draining from his body and he coulda sworn he heard some bones crack. \"Goddammit why won't i just die!\" Eliwood pleaded to die quickly so the pain would end but death just wouldnt come. Then she sprinted out of the castle. As this new motion brought more pain Eliwood threw up from motion sickness a few times. \"Must T-Try t-t-t-o get free\" he couldnt manage a single sentence without either studdering or coughing up blood. Eventually he seemed to just be a spot on the bottom of her boot until eventually she stopped moving. \"Is....Is it over?\" he noticed she was moving around but couldnt see what she was doing then he heard her say \"Ill set up camp here....it's still a little ways back to my house but im sure i can make it\" As Eliwood heard that he ounce again filled with hope of being found or atlest finding a way to contact her. Eventually she threw her boots off inside her tent and went to sleep. When Eliwood pried himself from her shoe he thought to himself \"Okay, i'm surprisingly less hurt then i thought....well i can atlest move without much pain so i must be still be in one piece\" Eliwood started walking towards the bed Nino was sleeping in but the pain in his legs suddenly flared and he fell down. \"Dammit i will not die after ive gotten so far!\" his will seemed to be the only thing pushing him forward. The pain is his legs got worse but he endured all the way to her sleeping body. \"Finally now i just need to get her attention without almost killing myself this time\". Eliwood ran towards her face, the easiest way he could contact her, but when he got there he was amazed by just how big it looked and he couldnt help but admiring her beauty since it seemed magnified. But he pushed those thoughts aside now then he decided he could either climb up her fact to her ear and get her attention that way OR he could try to find a safe place on her body to rest</span></div></div>",
            "created":1308200400,
            "id":1127716,
            "title":"Atlest I'm still alive....for now"
        },
        "1111212112":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Pervert",
                "Just go find someplace"
            ],
            "content":"<div class=\"\"><div> <span>Eliwood realized the pain was too much to bear at this point and just decided to search for a place to rest.After a while of searching he realized that there was nowhere on her to rest. \"She wears a skirt so there's no pockets..i guess i could go in between her boobs...no no thats perverted. If she found me there...there'd be hell to pay. What should i do then?\" Eliwood decided he could either let his pervert side take over a little and go in between her boobs OR he could just find a spot somewhere in the room and probably pass out there.</span></div></div>",
            "created":1308286800,
            "id":1127912,
            "title":"Rest"
        },
        "11112122":{
            "author_id":"7777",
            "author_name":"This site is dead.I wana leave",
            "choices":[
                "She hears him and turns around",
                "She doesn't hear him"
            ],
            "content":"<div class=\"\"><div> <span>Eliwood knew he had to act fast. He waited till Nino was looking away from his direction and dashed for the other of the bed.<br>\r\nHe then jumped up and and quickly start climbing the wodden pillar.<br>\r\nIt was quite a high up, but his fear gave him a rush the rush of adrenaline he needed to get up quickly. He jumped onto the bed and ran beck to where Nino was. Eliwood was daunted by the size of her face, but hoped that up here she might recognize him.<br>\r\nHe called out to her<br>\r\n</span></div></div>",
            "created":1308200400,
            "id":1127366,
            "title":"Try to climb up the bed method"
        },
        "111121221":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "\"Eliwood!\"",
                "\"There you are you stupid bug!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But does she realize its Eliwood, or does she still think its a bug?</span></div></span></div>",
            "created":1308200400,
            "id":1127719,
            "title":"She Hears him but....."
        },
        "1111212211":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Eat you!\"",
                "Play with you!\""
            ],
            "content":"<div class=\"\"><div> <span>\"Eliwood!\" Nino screamed after she turned around and saw Eliwood sitting shrunk on the bed. \"Oh my gosh. Are you ok? did i hurt you?\" Nino seemed very sacred she hurt Eliwood so he chose not to mention how he narrowly escaped being crushed under her foot. \"I'm fine Nino i hid under the bed when you first came in\" That seemed to only make her freak out more. \"So wait does that make YOU the bug i was going to squish! Oh god Eliwood im so sorry i should have made sure it was a bug first!\" At this point she was crying. \"Don't bang yourself over it..how were you supposed to know i was shrunk to the size of a bug! I'm just glad you found me.\" She seemed to relax a little bit. \"So do you have any idea how this happened?\" Eliwood shook his head \"No i dont i only think maybe the new spell you were gonna show me backfired or something....wait a second why do you have that look?!\" She was staring at him intently. \"You know youre kinda cute at this size it almost makes me wanna-</span></div></div>",
            "created":1308200400,
            "id":1127724,
            "title":"Discovered...but"
        },
        "111121222":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "He's Dead",
                "He's Alive"
            ],
            "content":"<div class=\"\"><div> <span>Eliwood after a while realized she didn't hear him so he decided he would rest for a while, The energy he used to climb up the bed finally left and he felt exhausted. After laying down for a while he heard Nino say \"I'm sure Eliwood won't mind if i rest here a bit\" and she started walking towards the bed to sit down...right on Eliwood. Eliwood saw her skirted behind coming down but he was too tired to move. Her butt soon made contact with the bed....and him. The pain he was feeling from the pressure alone was great but when she sat fully down he felt he was gonna pop in seconds, but he didn't. She seemed completely unaware that he was being crushed under her massive behind. \"Damn how did i get myself in this situation, well at lest i'm not dead...yet\" She started shifting around which caused well nothing but discomfort for Eliwood. \"Agh! god damn i'm gonna die at this rate..\" Then he heard her say \"I think ill lay down\" She shifted to a sleeping position which at that point Eliwood was sure he heard bones crack. Is this the end for Eliwood?</span></div></div>",
            "created":1308286800,
            "id":1127931,
            "title":"Is this the end?"
        },
        "1111212221":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "content":"<div class=\"\"><div> <span>Eliwood could feel his life slipping from his body and he could also still feel the extreme pressure of Nino sitting on him still. \"Why'd it have to end this way....to get killed by one of my friends without them even realizing!\" Eliwood's body eventually burst and his innards went everywhere, Nino unfortunately didn't notice and eventually went home. when she got home she noticed the blood on her skirt and said to herself \"Huh...Must have sat on that bug...oh well guess ill look for Eliwood tomorrow\". They searched for Eliwood for 2 years but never found out how he met his demise. Eventually they officially named his son, Roy, As Marquess of Pherae.</span></div></div>",
            "created":1308286800,
            "id":1128059,
            "title":"Butt alas it's too late"
        },
        "1113":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Matthew",
                "Guy",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so on to the next two</span></div></span></div>",
            "created":1307768400,
            "id":1124021,
            "title":"More choices"
        },
        "11133":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Yes! I love him!",
                "Next..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok if not those two then how about Raven the mercenary?</span></div></span></div>",
            "created":1307941200,
            "id":1125441,
            "title":"Raven?"
        },
        "111332":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Yeah, sure.",
                "Nah, whats next?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Erk, the mage from Etruria?</span></div></span></div>",
            "created":1307941200,
            "id":1125443,
            "title":"How about..."
        },
        "1113322":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Yes!",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pent, the student of athos? he might have had a spell go wrong or something...</span></div></span></div>",
            "created":1307941200,
            "id":1125445,
            "title":"Then how about..."
        },
        "11133222":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Sure",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mark the Tactician?</span></div></span></div>",
            "created":1548478800,
            "id":2607929,
            "title":"Nah"
        },
        "112":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Lyn",
                "Nino",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>going for the girls eh? well lets get this over with...who?</span></div></span></div>",
            "created":1307768400,
            "id":1124018,
            "title":"Oh lookie here"
        },
        "12":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then going for that one eh? then lets ask the obvious question:<br>\r\n<br>\r\nBoy? or Girl?</span></div></span></div>",
            "created":1307768400,
            "id":1124043,
            "title":"Fire Emblem 6 (Sword of Seals)"
        },
        "121":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Roy",
                "Alan",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok let's move on to the next question, who?</span></div></span></div>",
            "created":1307941200,
            "id":1125426,
            "title":"Boy"
        },
        "1211":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Lilina",
                "Sophia",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Roy was growing bored of the peace Pherae had experienced since he defeated Zephiel and Idoun. He had become Marquess Pherae after his father's death and had been ruling now for a year and a half. \"Man I need some kind of excitement , but i know thats not gonna happen\" Just then Roy felt dizzy and fell to the ground. \"Ugh my head...I must be sick..\" He passed out. He woke up hours later in his bedroom and figured Marcus or someone must have seen me unconscious and brought him there. But then he noticed his surroundings were much larger then normal. \"Ok when did my room get so big?\" he asked him self as he looked around. Then he heard footsteps and quickly hid behind the pillow with his sword drawn which had thankfully shrunk with him. When the door opened he was prepared to meet the person responsible for this but was shocked to see who entered the room. Well, Who entered?</span></div></div>",
            "created":1308286800,
            "id":1128100,
            "title":"Roy"
        },
        "12111":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Confort Her",
                "Stay Hidden"
            ],
            "content":"<div class=\"\"><div> <span>Roy couldnt believe it. It was Lilina but she seemed so...so titanic! He also couldnt believe it to be her who shrunk him because of how sweet shed been to him after his father passed. He saw she was looking around frantically obviously searching for something. \"Oh where's Roy! I hope he's not hurt\" She said as she searched. Roy could obviously tell she had been looking for him for a while. Eventually she sat down on the bed saying \"It's hopeless, i can't find him anywhere...guess i'll just sit here a while and see if he comes in\" Roy started thinking that maybe she WAS the one who shrunk him but she did it by accident...or maybe on purpose. Roy wanted to push aside these thoughts but they kept creeping back he then decided to...</span></div></div>",
            "created":1308286800,
            "id":1128114,
            "title":"Lilina, Friend or Foe?"
        },
        "1213":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Chad",
                "Wolt",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, Next batch...</span></div></span></div>",
            "created":1307941200,
            "id":1125438,
            "title":"More"
        },
        "122":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Lilina",
                "Fir",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's move on to the next question, Who?</span></div></span></div>",
            "created":1307941200,
            "id":1125428,
            "title":"Girl"
        },
        "13":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok lets get one of the 2 obvious questions out of the way:<br>\r\n<br>\r\nBOY? OR? GIRL?   oh look it was in caps lock<br>\r\n</span></div></span></div>",
            "created":1307768400,
            "id":1124044,
            "title":"Fire Emblem 8 (The Sacred Stones)"
        },
        "131":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Ephraim",
                "Seth",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's move on to the next question, Who?</span></div></span></div>",
            "created":1307941200,
            "id":1125430,
            "title":"Boy"
        },
        "1311":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "L'Arachel",
                "Lute",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Ephraim had been King of Renais for about 3 years now and every year he goes around checking the country for anything the people find wrong. He knew there would always complaints but he tried to have as few as possible, Especially since the rebuilding of Renais had taken this long to reclaim it's formy glory he wanted to make it greater than before.<br>\r\n<br>\r\nAs his horse rode along the road he would notice the villagers would carry about their daily lives. Women would be watching children as they ran around with smiles on their faces, and the men would be plowing in their fields and if they noticed Ephraim they would wave and say things like \"How are you today king?\" or \"Look, it's King Ephraim!\" which he enjoyed rather well because it showed how far happiness had come in Renais.<br>\r\n<br>\r\nHe had just finished making his rounds when Ephraim saw something strange,he saw a strange light in a house which he hopped off his horse to investigate. <br>\r\n\"This light...Is somebody practicing magic here?\"  he thought to himself as he approached the door to the house.As Ephraim stepped towards the door, he heard the grass crunch from behind him.  Feeling the prescence of someone behind him. \"Who's there?\" he said in alarm as he spun around with his spear ready....but he saw no one. \"....Must've just been hearing things...\" then Ephraim felt a strange sensation. \"Ugh...I don't feel too well all of a sudden\" he decided to cast aside the light and began to walk back to his horse when he got hit in the back of the head with something hard and passed out. He awoke later to find himself in a strange room. He took this time to survey the surroundings. He appeared to be in a home, there was a kitchen in front of him some stairs leading to 3 seperate rooms to his right and to his left he saw a room with a coffee table and 2 couches, behind him was the door. He noticed something else however. The whole house seemed to be gigantic! The door itself seemed to rise like a colossus and the distance from him to the kitchen seemed to be 1,000 Miles. \"I'm in a very bad position right now...\" Ephraim said to himself. Then, he heard the door knob start turning and he ran to the nearest hiding place, which happened to be a closet he noticed was by the door. He saw the door slowly open which revealed the person who opened it to be...</span></div></div>",
            "created":1308286800,
            "id":1128162,
            "title":"Ephraim"
        },
        "1313":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Frantz",
                "Innes",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok how about these two?</span></div></span></div>",
            "created":1307941200,
            "id":1125440,
            "title":"More"
        },
        "13133":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "Rennac",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rennac?  Or someone else?</span></div></span></div>",
            "created":1308286800,
            "id":1128133,
            "title":"Rennac?"
        },
        "131331":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "Big thief",
                "Tiny thieves are so cute.~"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Larger Rennac or smaller Rennac?</span></div></span></div>",
            "created":1308286800,
            "id":1128134,
            "title":"Rennac"
        },
        "1313312":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "L'arachel.  The light of Rausten",
                "Lute.  Prodigy of Renais"
            ],
            "content":"<div class=\"\"><div> <span>It's been a few weeks since numerous members have been with the Renais liberation army.  Still working towards their own goals, they follow the future heroes of the continent to get the Sacred Stones and save the world from the Prince in Despair, Lyon.  Tonight is a night that followed after the gruelling battle for Renais' castle, though the castle has been taken back, the main army slept in their tents...ready for departure in the morning.<br>\r\n<br>\r\nAs a celebration and promise towards the Rogue of Carcino, Tethys set up her tent to be very cozy, yet inviting.  As Tethys was lighting one of her scented candles, Rennac walked in.  He lightly pushes the curtain to let himself in and carefully closes it after he enters.  \"This is quite a night you've chosen to fulfill your promise, my fair dancer.  Are you ready to invigorate me?\"<br>\r\n<br>\r\nTethys turned to him and winked seductively, \"You insult me.  A dancer of Jehanna always keeps her word.~\"   As she steps onto a rug in the center of the tent, she signals Rennac to have a seat.  \"Please, enjoy the drink next to you that I've prepared and relax...\"  She begins to dance and a mysterious music plays from nowhere.  Rennac watches in a state of ecstasy, paying attention to Tethys's features.  Her large soft breasts, her equally large and soft butt, her rosy red lips concealed by a veil, even her small delicate feet.   The excitement he experiences does leave him a bit thirsty.  He reaches for the prepared drink next to him and drinks from it.  He continues to watch and begins to feel dizzy.  In an echoing voice Tethys says to her viewer \"You've chosen to drink I see.~   Very good.  Now I will make sure that you'll get the reward you truly deserve.\"<br>\r\n<br>\r\nRennac slowly tries to stay awake. \"This...This drink...what did you--\"  Without another word, Rennac passes out.  Tethys walks up to him and kisses him on the forehead.  \"I hope you enjoy your reward, handsome.~\"  From outside the tent, a young female's voice is heard.  \"So, have you gotten what you desire?\"<br>\r\n<br>\r\nTethys turns to the curtain where the voice comes from.  \"Yes, everything went according to plan, you truly are the prodigy you claim to be.\"<br>\r\n<br>\r\nLute walks into the tent.  \"And you expected otherwise?  I AM the best you know.\"<br>\r\n<br>\r\nTethys giggles and nods her head.  \"Indeed you are.  Now...about this perv.~\"<br>\r\n<br>\r\n\"If I may,\" Lute answers, \"I have an idea of the kind of 'Reward' he deserves...but it won't be death, we still need him in our future missions\"<br>\r\n<br>\r\n\"So be it.  Just make sure he learns not to harass me for my dances again...\"  With this, Tethys walks off.  Lute's shadow looms over him as she laughs.<br>\r\n<br>\r\n<br>\r\nThe next morning, Rennac awakens, but covered by a cloth of some sort.  They feel very light and seem to have a little bow on it.  He crawls out of the cloth to see that he's sleeping in a large pair of panties...outside he realizes that everything is large.  He hears someone coming and he hides back inside the panties.  Who's tent is he stuck in?  Who's panties are these?</span></div></div>",
            "created":1308286800,
            "id":1128146,
            "title":"Tiny thieves are so cute.~"
        },
        "132":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Eirika",
                "Tana",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's move on to the next question, Who?</span></div></span></div>",
            "created":1307941200,
            "id":1125431,
            "title":"Girl"
        },
        "1323":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "Ismaire",
                "Tethys",
                "My girl isn't listed here..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, sorry to expand the list...<br>\r\n<br>\r\nIsmaire, Tethys or more?<br>\r\n<br>\r\nIsmare = Queen of Jehanna<br>\r\nTethys = Elegant Dancer of Gerik's Mercenaries.<br>\r\nMore = You don't need me to tell you....</span></div></span></div>",
            "created":1308286800,
            "id":1128103,
            "title":"Renais and Frelia's princesses?  Are you kidding?"
        },
        "13232":{
            "author_id":"rhaise2",
            "author_name":"Ragnorious2",
            "choices":[
                "I want my dancing girl to be the larger one",
                "No, I'd rather have her be doll-sized."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry, one more question.  Should she be the large one or the small one?</span></div></span></div>",
            "created":1308286800,
            "id":1128124,
            "title":"Tethys"
        },
        "14":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Path of Radiance",
                "Radiant Dawn",
                "Japanese Games"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so if you don't want those games then i guess well go off of the GBA games....Hows Path of Radiance/Radiant Dawn sound? or maybe one of the Japanese fire emblem games...they're good too.</span></div></span></div>",
            "created":1308114000,
            "id":1126953,
            "title":"Other choices"
        },
        "141":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so you like that one then huh? well lets get right on to characters...Boy? Girl? what do you want</span></div></span></div>",
            "created":1308114000,
            "id":1126956,
            "title":"Path of Radiance"
        },
        "1411":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Ike",
                "Boyd",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let the choosing commence now then since youre going with the boys that might make things easier...So who's it gonna be?</span></div></span></div>",
            "created":1308114000,
            "id":1126958,
            "title":"Boy"
        },
        "142":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Radiant Dawn huh? cant really blame you theres some good characters there too..so you know the drill....Boy? or Girl?</span></div></span></div>",
            "created":1308114000,
            "id":1126957,
            "title":"Radiant Dawn"
        },
        "1421":{
            "author_id":"shadow321",
            "author_name":"Ichigo",
            "choices":[
                "Edward",
                "Leonardo",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then time for the usual...Who will be the unfortunate shrinkee?</span></div></span></div>",
            "created":1308114000,
            "id":1126961,
            "title":"Boy"
        },
        "1422":{
            "author_id":"mattdruzian",
            "author_name":"MattDruzian",
            "choices":[
                "Yes, let's go with her!",
                "Nah, another."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the protagonist, Micaiah, the Silver-Haired Maiden?</span></div></span></div>",
            "created":1550120400,
            "id":2617552,
            "title":"Micaiah"
        },
        "14221":{
            "author_id":"mattdruzian",
            "author_name":"MattDruzian",
            "choices":[
                "Giantess of Dawn, please.",
                "Doll-Sized Maiden is better."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will the Dawn Maiden grow or shrink?</span></div></span></div>",
            "created":1550120400,
            "id":2617553,
            "title":"One more choice"
        },
        "143":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Awakening yeah",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Fire Emblem Awakening?</span></div></span></div>",
            "created":1411275600,
            "id":1859820,
            "title":"Well other games at least"
        },
        "1431":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Tharja shrinks Robin to make (him/her) her's forever",
                "Problems for the male time travelers as they shrink upon arrival",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Awakening is your choice ... so what happens here?</span></div></span></div>",
            "created":1411275600,
            "id":1859821,
            "title":"Awakening yeah"
        },
        "14311":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Male (Short, white spiky hair)(Passive/timid)",
                "Female (Tall, redhead)(Headstrong/stuborn)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So as you know Tharja obsesses over the tactician whether they're male or female so what is the gender of the target of Tharja's plan to get a tiny lover/toy/pet/slave/plaything?</span></div></span></div>",
            "created":1411275600,
            "id":1859826,
            "title":"Tharja shrinks Robin to make (him/her) her's"
        },
        "143111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "1 foot",
                "5 inches"
            ],
            "content":"<div class=\"\"><div> <span>Tharja cackled as she finished her potion, once she added the clear liquid to Robin's meal her lovely tactician would be hers forever. She slipped into a daydream thinking of all the things she could do with him<br>\r\n<br>\r\nRobin was rather short for such an imposing grandmaster, so much so that Tharja took great pleasure in jumping out at him so he would walk into her getting his face massed into her large breasts ; allowing her to imagine he'd dived straight into her cleavage voluntarily. She'd hold him close, rubbing her fingers through his ivory coloured hair for the few minutes it took him to get away before her ran off, his face redder than Cordelia's hair<br>\r\n<br>\r\n Tharja smiled, walking over tot he cooking area having allowed herself to be conscripted by Sumia to help with dinner, mostly so she could get Robin without needing to be as sneaky (especially with how oblivious Sumia is) quickly pouring the potion onto Robin's plate, the 2 hr time delay meaning she knew Robin would be alone in his tent when it took effect<br>\r\n<br>\r\n Exactly 2 hrs after dinner Tharja snuck her way into Robin's tent ..... but how small did the potion make him?</span></div></div>",
            "created":1411621200,
            "id":1862009,
            "title":"Male (Short, white spiky hair)(Passive/timid)"
        },
        "1431112":{
            "choices":[
                "Tharja doesn't get answer because someone walks in",
                "Play a game or cuddle or both"
            ],
            "content":"<div class=\"\"><div> <span>Robin was on his bed at 5 inches tall about the same size as the little dolls Tharja sees libra make. Robin was starting to wake up his eyes blinked a bit and he looked up and saw a giant Tharja looming over him. \"Hello dear.\" Tharja said grinning. \"Okay, this is a dream, I'm just gonna close my eyes and when I open them there won't be a giant Tharja in front of me.\" Robin said slowly and he closed his eyes and then opens them still seeing the giant Tharja looming over him and Robin looked more afraid then he has ever in his life which Is saying a lot. \"Okay this isn't a dream and I'm going to start freaking out now.\" Robin said slowly then he started screaming like crazy calling for help. Tharja quickly grabbed the timid tactician and stuffed him into her cleavage pressing her breasts together to prevent him from calling for help which he wasn't going to get. <br>\r\n<br>\r\nTharja got to her tent and pulled out Robin who was ..crying? \"Do want you want with me there's nobody who's coming to save me and I'm left at your mercy and nobody would get suspicious if I disappeared.\" This was true as because he was so timid and shy despite being the tactician of chroms army he didn't really have any friends as he was always to intimidated by everyone else as as all of the sheperads with the exceptions of Ricken and nowi were taller than him. \"Don't be like that darling, I would never hurt you and admit it you like this do you?\" Tharja asked stroking the small tactician calming him down a bit. \"Actually I have to admit but you are actually the most beautiful woman I have ever seen and I actually have always had a thing for taller and older women.\" He said blushing a bit. \"Older!? Are you implying I'm old?\" Tharja hissed and Robin raised his hands defensively. \"No quite the opposite, I may not remember much but I'm only seventeen.\" \"Seventeen?\" \"Yeah why do you think I'm so short and young looking?\" \"Genetics?\" \"Well that's part of the reason but I guess I can take advantage of spending time with a sexy giantess, so what do you want to do?\" Robin asked with a little bit of confidence</span></div></div>",
            "created":1463374800,
            "id":2149126,
            "title":"My little birdy"
        },
        "14311121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "He wants to stay where is he and cuddle",
                "He wants to kiss her, and let her taste him"
            ],
            "content":"<div class=\"\"><div> <span>''Well...'' <b>''THARJA!''</b> Tharja paled ''Shit, I need to hide you'' she quickly slide Robin back between her large breasts before turning around as an annoyed Lucina enters her tent. ''Tharja, where is Robin?'' the dark mage's eyes widen in surprise before answering ''I don't know princess, he asked for one day a week where I don't act as his shadow, it's part of my attempt to be 'normal' '' the bluenette scowls ''Well when you do find him, tell him father is looking for him'' ''Is it important?'' Tharja asked, curious as to whether to bring her tiny love to them or not (probably not) ''I don't know, father just asked me in passing to find him, and I assumed you'd know where he is as usual. Apparently not'' Lucina then turned and left.<br>\r\n<br>\r\n''What's her problem?'' Robin asks as he peeks out of Tharja's cleavage ''Beats me, maybe she has a crush on you. Or maybe she just hates our kids'' Tharja answers, before her eyes bulge and she turns beet red ''Sorry about that, that was blunt and forward even for me'' ''It's okay Tharja, I know what you mean Lucina's from the future so she knows us from the future, such as any kids we eventually have. It might also explain why she always looked at me weird, she didn't know I was normal sized at anytime as I was probably this size in the future'' Tharja blinks in surprise ''You mean you want to stay this size?'' ''Honestly I kind of do, at first it was rather intimidating, particularly how huge you are, but I'm starting to get used to it, particularly those soft breasts of yours I feel so safe snuggling up to them'' Tharja grins ''Oh you're such a sweet talker, no wonder I'm keeping you forever'' Robin smiled and nuzzled her chest happily, both moan as Tharja squeezes her breasts around his tiny body . ''So what you want to do little cutie?'' Tharja asks as she sits on her bed, Robin is silent for a few minutes while he thinks about his options before answering...</span></div></div>",
            "created":1463893200,
            "id":2152215,
            "title":"Interuptions"
        },
        "143111212":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Continue Tharja and Robin's fun",
                "A week later they run into a future kid... that's their's."
            ],
            "content":"<div class=\"\"><div> <span>Robin turned to look up at her face ''So Tharja seeing as I'm your... eh plaything...'' Tharja laughed ''Well I was thinking boyfriend but if you prefer plaything...'' ''No, boyfriend is fine, great actually'' Robin stuttered as his face turned bright red. Robin was surprised, he was sure when Tharja shrunk him it was to be her little pleasure toy, something to be hidden away until she felt the need before being crushed against her huge tits, soft rear or even in... Robin blushed harder and tries to burrow himself further into her cleavage... but to think she wants him as a boyfriend, him timid little Robin, the boy with no past, it makes his heart soar that such a beautiful woman could desire him.<br>\r\n<br>\r\n''Hey Tharja?'' ''Yes love'' ''Seeing as you've claimed me as your boyfriend, can I give you a kiss?'' Robin's answer came in the form of a squee, as Tharja's overjoyed he's come around so quickly (she was sure she needed another day and more boob squishing before he was actually participating) and plucked him from her cleavage and brought him up to her face. ''Well here I am lover'' she singsonged with a smile, Robin smiling too as he stepped close enough to her mouth to put a hand on each side before kissing her pouty lips. Tharja held herself still, letting her little man have his fun until she felt him lick her upper lip, after which she internally smirked and parted her lips just as she jostled Robin so he fell 'into' her mouth, shutting it behind him.<br>\r\n<br>\r\nRobin was happily losing himself in the pleasure of kissing the goddess before him, Tharja tasting like a treat he would want forever when the 'wall' in front of him gave way and he plopped into dark and wet. ''Tharja!'' Robin yelled before he found himself being bounced around rather violently, her tongue flipping him from one side of her mouth to the other like some hard candy she'd stolen from Gaius. Once she was a little less crazy about it Robin actually started to enjoy it, covered in her saliva and being swirled around inside her mouth. The only slight problem was that her mouth was filling up as she wasn't swallowing, which in of itself was a good thing as Robin didn't want to find out if he was digestible or not yet (Spoiler: he would be just fine). Once the 'water' level rose beyond what he could swim in he began to yell for help, hoping Tharja would here him over her own near orgasmic moaning.<br>\r\n<br>\r\nTharja was in heaven, Robin had such a sweet taste with the slight tang that usually filled the air around magic users, the perfect taste in the dark mage's opinion. She was moaned and groaned as he was swirled around in her mouth, enjoying the feeling of him against her tongue and the roof of her mouth, until she heard him calling to be let out. She pouted but also thought back to what Robin intially thought was her reason for shrinking him: if he was her plaything she'd have no reason to care, in fact she could use this moment to remind him he still exists because he's hers and she decides his fate from now on. Hell she could just swallow him, remind him of just who owns him by making him spend the night in her belly, her hands subconsciously rubbing her flat stomach. But no, that wasn't her reason, she shrunk him because she loved him and wanted him to be hers, she didn't want him to be hurt, Grima be damned she used the potion that made the target invulnerable just to be sure, not just because of all the things she'd like to do to him that under normal circumstances would probably kill him.<br>\r\n<br>\r\nWith a slight frown, Tharja tilts her head down and spits Robin out, the tactician falling and bouncing slightly when he reached the ground. When his vision returns he notices he's between Tharja's pale feet, the woman herself standing directly over him with her hands on her hips, grinning cheekily as she licks her lips of what remains of Robin's flavour ''Oh dearie, you feel so good, I'm never letting you go, ever'' Tharja moans, her long fingers ghosting over her breasts</span></div></div>",
            "created":1463979600,
            "id":2152706,
            "title":"He wants to kiss her, and let her taste him"
        },
        "1431112122":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Skip straight to Morrigan",
                "Get to know their oldest and youngest first/on the way"
            ],
            "content":"<div class=\"\"><div> <span>It had been a week since Robin had been shrunk and him &amp; Tharja had gotten together, during that time they had found a couple of people from Lucina's time, including Nowi's daughter who was nothing like her, and Sully's daughter who was Lucina's best friend and exactly like her mother minus being able to ride a horse. The sheer scale worried Tharja as she worried about her own future kids (Lucina admitted that Robin was right, she hadn't known he had originally been normal size, and that she was wrong in that Falchion's wielder did get on well with their kids, she just didn't like her and Robin's sister for being Grimleal. Good news, Robin found out he has a sister) were they like her or Robin? Did they get along in the future? Were they as messed up as she was? (In a word, kinda)<br>\r\n<br>\r\nThey were passing by a field that unbeknownst to them was frequented by kidnappers and slavers when they heard screaming and explosions ''Everyone move!'' Chrom yells and they Shepherds do as asked, Tharja like the other magic users sticking to the middle of the group (as in behind the guys with big shields but in front of the archers) as they entered the fray... to find one person picking off all these bad people with what looked to be quite an old, poor quality bow. All they could make out was that she was a busty female, the purple hood obscuring the top of her head. They did notice though that the braces on her wrists glowed before each shot, Tharja practically tasting the magic they were pumping out.<br>\r\n<br>\r\n<b>''You people irritate me, NOW YOU DIE!''</b> the hooded archer smirked with pointed teeth as ash/smoke condensed into an arrow and she fired it, striking a Berserker and causing the body to incinerate. Tharja was shocked and awed to see such powerful magic, especially as it looked to be used quite casually, this one was defiantly theirs. The woman had taken down 3 fliers in the time it took Tharja to get to her, not that any of the others in their group were going to approach her (Cowards). Luckily the rest of the enemies were staying away from her too, giving them some space.<br>\r\n<br>\r\n''Hello'' Tharja greeted trying not to sound as worried as she felt. The archer's head tilted silently in her direction at a speed that should've caused an audible crack, then stared as though judging her soul. Apparently she somehow passed (or she noticed Robin hidden in her cleavage as per usual) as she smiled and pushed back her hood revealing her large dark eyes and shock of white hair (yep definitely Robin's kid). ''Hello mother'' she returned then twitched as though uncomfortable ''Mom's here?'' Tharja heard the squeak, it couldn't be but it was, there was a little black haired boy nestled in her daughter's massive cleavage ''Hi mom, nice to see you safe and sound, is dad around? Or is he somewhere safe due to his size?'' Tharja blushed slightly and pointed to her breasts, ideally wondering why it was taking Robin so long... opps. ''One moment please'' Tharja actually held up one long finger before sticking her hands into her outfit to save Robin from being trapped between her bra and her under boob. ''And here we are, daddy all safe and sound. Robin meet your kids'' Tharja put her hands out so the 2 of them could see Robin and her could see them ''I think they have a better system going'' Robin joked ''well we should I've been doing this since I first got tits'' the woman rolled her eyes, barely reacting when the boy slapped her breast and told her to be nice ''Tell Lilith to stay out of this'' he hissed, peaking both parents interest. ''Lilith?'' Robin asks ''Morgan named the darkness inside me, she sometimes comes out and he's the only one safe from her'' Noire answers, looking at the floor as she shuffles her feet ''And Morgan is the name of the little boy nestled in your cleavage'' Tharja stated, not need to get an answer ''Are we going to get your name as well, your actual name?'' her white haired daughter actually smirked ''Noire mother, Noire Necrophage'' she seemed to enjoy the look of surprise and almost horror on her mother's face. She then burst out laughing ''Oh Grima that was brilliant, don't worry mother I've never actually used that name, daddy practically disowned himself the last time he met grandfather'' ''Oh thank Grima, please don't scare me like that again'' Tharja scolded, her free hand over her heart ''What's wrong love?'' Robin asked worried ''Nothing dear, just a name from Plegia that shouldn't be messed with'' Tharja answered, not telling him it was the name given to those with Grima's blood in their veins, people with near limitless power  who because of this, were sot after either to worship or to kill.<br>\r\n<br>\r\n<u>Later</u><br>\r\n<br>\r\n''So it's just the 2 of you?'' Tharja asked on the way back to camp ''No, there's one more, my little sister, the middle child, Morrigan'' ''Oh'' ''She's a dark mage like you mother, she wants to make you proud like Morgan wants to make dad proud'' ''and you?'' Noire blushes ''I want to be known as more than Gri.... your and father's daughter'' she answered, hoping Tharja didn't notice her slip, now was not the time to deviate from the plan, especially not without Morrigan around. Tharja was confused but shrugged ''You're the eldest kid, you're the one who'll set records the other 2 will have to try match or top. You don't have to be so hard on yourself'' Noire nods and hugs her, surprising them both ''Thank you mother, you have no idea how much that meant to me'' Tharja blushes but returns the hug. When they release ''So, where will Morgan be staying?'' ''Well he usually stays in my cleavage at night, but if you'd prefer to take him...'' ''No, it's fine, besides it'll give us another day at least to get used to this'' Tharja waved her off knowing she was going to offer to go alone, something she knew would probably hurt the girl, in a similar way not being around Robin hurts her ''Goodnight mother'' ''Goodnight Noire'' Tharja said removing Morgan from between her breasts (he had been having some private time with Robin, like how Noire and Tharja were having out here) and returning him to her ''I know I don't need to tell you to keep him safe but humour me. Keep your brother safe'' Noire grins and nods, before letting Morgan crawl between her breasts.<br>\r\nWhat next?</span></div></div>",
            "created":1464152400,
            "id":2154010,
            "title":"The archer and the tactician"
        },
        "14311121222":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "They meet Morrigan",
                "Robin & Tharja have a proper discussion with the kids about Lilith"
            ],
            "content":"<div class=\"\"><div> <span>Day broke and this time they decided to cross the gender divide and each parent get to know their opposite gendered kid<br>\r\n<br>\r\n<u>Robin &amp; Noire</u><br>\r\n<br>\r\n''So Noire, what do you like?'' Robin asked nervously, clinging to his daughter's shirt fearfully as usually he'd be a safe passenger between Tharja's breasts and while the two are about the same size (Noire possibly even a little bigger) her being his daughter made things awkward ''Papa, dad, Robin whatever you want me to call you, don't panic. I've had a younger tiny between my boobs before'' Noire smiled as she tried to reassure him, which had the opposite effect ''How many people have seen these?'' which surprisingly caused Noire to laugh ''Just Morgan, I was actually referring to the fact that I'm older than you'' Robin blinked and tried to form words, but all he could produce was ''What?'' ''Yeah, I'm nearly 19 and I know you were/are 17 when you and Mother got together and had me'' she grins and Robin groans and blushes; he knew that expression Tharja used it all the time, she knew his thoughts on older women and damn she was nearly identical to her mother, the white hair the only thing that was his. He clung to that thought as he buried his face in her throat ''You still didn't answer my question'' he said trying to steer the conversation back from crazy town, as well as praying Morrigan wasn't like this ''Well I like to practice my skills, research new ways to utilize my magic and <b>I'd like to keep Morgan smothered between my massive tits but the little scamp has to eat sometimes</b>'' she answered, Robin noting the hardened edge in her voice as she neared the end. ''Noire?'' he called, shuffling to her shoulder so the woman could look at him; it was the he noticed blackness forming and  growing from the edge of her eyes, as well as her finger nails lengthening into talon like claws (basically her magic is causing there to be a physical distinction between Noire and Lilith being the dominant personality). ''Hey kid? Robin called, then he noticed where she was looking, Tharja &amp; Morgan were standing over with Lucina and the girl was gushing over the kid... oh<br>\r\n<br>\r\nSorry papa'' Noire says which confused Robin until he was picked off her shoulder and very skilfully flung directly into Tharja's cleavage<br>\r\n<br>\r\n<u>Tharja &amp; Morgan</u><br>\r\n<br>\r\n''So what do you want to do kid?'' ''I want to be the best tactician, even better than dad'' Morgan answered, Tharja laughing slightly as she pets his head ''Well if that's what you want I hope you succeed'' she said. ''Morgan!'' Tharja looks up as she sees Lucina running towards her, a wide grin after seeing the black haired tactician nestled in her cleavage ''Hey Luci, um mom can I?'' Morgan raises his hand in a symbol for getting out which she does, removing him from her breasts and placing him on her shoulder. Well until Lucina grabs him and kisses his head.<br>\r\n<br>\r\n''Oh my precious little shota'' Lucina gushed rubbing Morgan against her cheek, until he was ripped away from her. The future exalt turned to see who had taken her shota when she met pitch black eyes, she barely reacted before long bony fingers had wrapped themselves around her throat ''<b>MIINNNNNNNNNNNE</b>'' she growled and began to squeeze.<br>\r\n''Lilith stop!'' Morgan yelled from his sister's other hand, though the girl seemed to ignore him ''Come on Noire make her stop'' Noire's head tilted to the side as though curious before releasing her grip. Morgan was brought up to her face staring into those black eyes with deep purple iris <b>''You will stay with me'' </b>she hissed and lowered him up to his neck in her cleavage <b>''I think it's time for some fun'' </b>she smirked and placed a hand on each tit, squeezing them together before rubbing them up and down, eyes rolled back in their sockets as she feels Morgan being squished between her breasts. ''Stop it you'll hurt him'' Lucina yells and Noire blinks, releasing her hold and letting all of them hear Morgan's giggling ''Don't worry Luci, Noire and Lilith would never hurt me'' Morgan tried to comfort his friend but Lilith wasn't exactly making it easy <b>''If I  could grow to giant size you would be the first person I killed, you'd be nothing but a bloody smear on my massive tits. Run along girly, the only reason I've not already killed you is because Morgan seems to like you and I don't like it when he's unhappy'' </b>she sneers at the woman who makes a break from it. <br>\r\n<br>\r\nLilith smiles before beginning to moan rather erotically, which continues for a few minutes before she nearly falls to her knees if not for Tharja grabbing her. Blinking tiredly Tharja notices her much brighter eyes and gentler smile as she gets up, once again squeezing her breasts together but this time to get Morgan to pop up like a diglett ''Thanks for the reset brother'' she grins and kisses him, his entire head finding it's way into her mouth. ''Can someone explain what just happened?'' Robin asked, having been found and removed from Tharja's cleavage by the woman during Lilith's attempt to traumatise Lucina ''Morgan found there to be several points on my body that would be able to get Lilith to become distracted enough for me to take back control from her and beat her back into her box'' Noire explained, now rubbing Morgan's head who was purring like a cat. ''I have no words'' Robin says with wide eyes ''And all these pressure points are on your boobs?'' ''No, just some of the pleasure ones, pain points are found at the base of my ribs on my back but Morgan doesn't like to use those as they hurt me and Lilith and he doesn't like his sisters being in pain?'' ''He sees you as his sisters?'' ''No, he sees Lilith as a part of me, I meant myself and Morrigan when I said sisters'' ''Oh''<br>\r\nWhat now?</span></div></div>",
            "created":1464238800,
            "id":2154504,
            "title":"Lessons in insanity"
        },
        "143111212222":{
            "choices":[
                "Morrigan finally appears",
                "Focus on Morgan and Tharja (or Robin and noire)"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay kids step into my office.\" Robin said. \"I think Morgan is the only one capable of going into mother's cleavage besides you.\" Noire teases and Robin sighed. \"Okay let's go into our tent.\" Robin said. <br>\r\n<br>\r\nWhen the family got into Robin and Tharja's tent Tharja set him on the bed next to her while noire kept Morgan snuggled up in her cleavage. \"Okay kids, this is a serious matter we need to discuss Lilith because I don't want to explain to Chrom why his oldest daughter is dead/traumatized.\" Robin said. \"So exactly when does Lilith show up?\" Tharja asked. \"Well she appears whenever I'm surrounded by enemies, if Morgan or Morrigan are in danger or if Morrigan is putting Morgan in danger if she involves him in one of her 'experiments' or if Morrigan is being a bit sadistic with him as she is a bit sadistic when it comes to cute and defenseless things which is the exact definition of Morgan. She also appears if I'm really annoyed or angry. As well she appears whenever... A girl who isn't in the family goes near Morgan.\" Noire admits blushing at the last part. \"So she's like me with you.\" Tharja said teasing her husband. \"So what are we supposed to do besides stand around like idiots if Lilith comes out?\" Robin asked ignoring the comment from his wife. \"Hm I guess you could drag me off and throw me in a room alone with Morgan as he is 100% garunteed to survive Lilith. \"Why is that?\" Tharja asked curious. \"Well Lilith is a bit obsessed with Morgan as he doesn't really freak out when she comes out, also I guess Morgan is just to darn cute for Lilith to hurt him as well she is really protective of him. But I don't blame her for being obsessed with Morgan, he's just so cute and wonderful, he knows how to please me, he has such soft skin, oh is just the perfect little boy and if I wasn't his sister I'd probably want to **** his small little body.\" Noire then blushed at what she just said while she was going on about her brother. \"Please tell me Morgan didn't hear that.\" Noire asked to her wide eyed father and grinning mother. \"Huh, did I fall asleep again? Sorry it's just so comfortable and warm down here I just couldn't keep my eyes open.\" Morgan apologized. \"Oh thank goodness.\" Noire said wiping her brow. \"Thank goodness what sis?\" Morgan asked. \"Uh don't worry about, oh I realized you didn't get enough time with mom since Lucina appeared, so bye!\" Noire said quickly grabbing her father and dropping her brother into her mother's cleavage and noire quickly ran out. \"What just happened?\" Morgan asked. \"Don't worry about baby, just cuddle up to momma.\" Tharja said grinning.</span></div></div>",
            "created":1464238800,
            "id":2154534,
            "title":"Why does Morgan have to be so cute?"
        },
        "1431112122221":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Family bonding (all 5 of them)",
                "Skip  to the Dragon's Table"
            ],
            "content":"<div class=\"\"><div> <span>The group were trekking through the ruins of time, mainly because Noire &amp; Morgan sensed their sister's magical signature in the area, something Lucina considered ignoring until the other mages in the group also told her they could feel the dark magical signature the others were, except they had never met Morrigan so were unable to confirm the identity or even the gender.<br>\r\n<br>\r\n''So how do we know if Morrigan is anywhere near us?'' Tharja asked, just before the partly destroyed body of a Risen flew through the air and landed between then, incinerating itself before their eyes ''That'' Noire points to the ash, then in the direction the monster had come from ''We go that way'' she calls and the family head towards a clearing, where many Risen were all attacking a single person (and despite getting their ass kicked Risen lack higher brain function for the most part so aren't trying to run away like those guys Noire was killing a few chapters ago) ''Found her'' Noire cheered as she hopped down to assist her full mage sister (To massively over simplify things: Morgan is a mini Robin in that he's a tactician, Morrigan is a mini Tharja in that she's a dark mage, Noire is the first one so just tried out a bow and discovered she was awesome, then later adding her magic to make things explode, because who doesn't love explosions?)<br>\r\n<br>\r\nThe girl had the usual headwear of a dark mage, as well as the rather seductive enchanted 'armor', which went well with her thin waist and large breasts. Despite the headgear they were still able to make out the 2 white bangs mixed in with her black locks. Raising a hand to release a spell the Risen was killed with an arrow through his head, turning around she found a certain white haired archer approaching her ''Nice to show up sister dearest'' Morrigan smiled, Noire rolling her eyes and pulling her sister towards her, giving her lovely little sadist a hug.... and subsequently getting a low level bolt to her ribs ''Yowch!'' she yelped jumping away from a now chuckling dark mage. ''Well she's definitely takes after me'' ''and Aunt V'' Morrigan adds with a smirk ''Who?'' ''Dad's sister, she's the one who assisted you in training me in dark magic, especially as V said dad had problems with dark magic since his amnesia'' Robin nodded in understanding ''Note to self: find sister and years later leave middle child's magical training to wife and sister'' ''Pretty much'' Noire and Morrigan nodded<br>\r\n<br>\r\n<u>Back in camp</u> (If anyone's wondering Morgan slept through the reunion and is now spending time with Robin and Tharja)<br>\r\n<br>\r\n''Morrigan!'' ''Hello sister, what do you desire?'' ''What, I can't check up on my little sister?'' Noire asked ruffling the girls' hair ''No, it's simply not what you and I do'' she answers and Noire sighs, Lilith clicking her heels in anticipation ''Fine, I want to make sure you're still okay with the plan, things could go very badly if Lucina and the others notice'' Morrigan rolled her eyes ''You say that as though it's the 2 of us against them all, we have our own guys ready and waiting'' ''I'm aware of that, but seeing their families could have turned them back to Luci'' ''Unlikely, their parents are all still alive back home so there's little difference'' ''But what will we do when they try to defeat them?'' ''We don't interfere, if they succeed we can enjoy it like the rest of them, but if they fail, well at least you'll  be able to use that training, heir of the world'' Morrigan smirked, her blood red eyes sparkling and Noire rolled her eyes ''Har, har Morgana, but just remember, I'm still in charge of this'' she hissed, eyes flashing purple ''Crystal clear, Silence''<br>\r\n<br>\r\nSo what happens next?</span></div></div>",
            "created":1464325200,
            "id":2154900,
            "title":"Morrigan finally appears"
        },
        "14311121222211":{
            "choices":[
                "See some actual family bonding ",
                "Skip to the dragons table (again)"
            ],
            "content":"<div class=\"\"><div> <span>Actually Morrigan and noire were wrong about Morgan being with their parents as they had to leave to a meeting which Morgan didn't mind. Morgan breathed in and out it was now one of those few moments he had alone to practice. Morgan quickly raised his hand in the air causing several lightning bolts to strike around him in a perfect circle, he then used wind magic to propel himself in the air, then turned around and extended his palm using arcfire to quickly bring him back down to earth. \"The grand finale.\" Morgan said and he focused all of his dark magic within him, which wasn't that much and fired a ball of dark magic diagonally with his right hand then swiftly brought down his left causing a lighting bolt to go through it creating dark lighting and causing a black shockwave to appear once it hit the ground. Since Morgan lacked capability of using dark magic on its own he would combine it with regular magic, healthy, not really, powerful, definitely.<br>\r\n<br>\r\n\"Hey kid nice moves.\" \"Sans! What did I tell you about sneaking up on me like that? Anyway how's it going with the other Morgan?\" Sans was the same size as Morgan when he visits as to level to the playing field. \"Oh it's going great, it was easy to get to his timeline but to bring him here will take a while as it takes lots of power for being to go into another timeline within their own universe which is why we have the dimensional drill, anyway he's bringing judgment, sever, and his worlds falchion with him. But why do we need him again?\" Sans asked. \"Well this Morgan has both Grima and Naga's blood which will allow him to preform the awakening to get exalted falchion then he could combine it with sever and judgement to form the legendary true falchion, then once we get to Grima we have that Morgan use the three orbs to go into grandmaster of death form (Morgan still looks the same he just has O.P godlike powers.) then with the power of grandmaster of death and true falchion the final blow will be powerful enough to destroy Grima in every timeline including in the timelines that haven't even been created yet.\" Morgan explained. \"You know kid that destroying a being in every timeline even if it isn't a major one could have some drastic effects, and with this being in particular being Grima I can't imagine what would happen.\" Sans said. \"Don't worry about it, besides its only going to take away grim as blood in anyone who has it, besides its worth it infinite life's will be saved, and we won't have to suffer anymore.\" Morgan said. \"Okay I'm going back to check on how far the drill has gone.\" Sans said, \"Also are you sure you don't want to take up another name, some people do it in plans like these.\" Sans said. \"No I'm proud of my name, although...\" Morgan paused for a second. \"Probaly once the other Morgan gets here you can call me <b>Calibri</b> to avoid confusions then call me Morgan once the other guy goes back to his world.\" Morgan said. \"Okay I'm off.\" Sans said and he left. Morgan's parents and sisters came back into the tent. \"Sorry we left you alone baby, we finished what we needed to do so all five of us can do some family bonding.\" Tharja said picking up her son. \"YAY!\" Morgan said cheerfully, his cheerfulness was real, Morgan was a naturally a cheerful and optimistic boy but knew when to dile it down when it came to his plan; <b>Operation Genocide</b><br>\r\n</span></div></div>",
            "created":1464325200,
            "id":2154945,
            "title":"A plan of his own"
        },
        "14311121222212":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Now we're good, off to the Dragon's table",
                "You missed something else you numpty"
            ],
            "content":"<div class=\"\"><div> <span>''Robin I need to speak with you'' Lucina announced after their confrontation with Validar (the dark mage fleeing with an arrow in his leg and magical burns from both Robin's daughter's) the tiny grandmaster having no reason to disagree nodded and allowed himself to be picked up, and was therefore carried to Lucina's tent. ''So what did you want to discuss with me?'' Robin asked as he paced Lucina's desk, the future exalt watching him closely as she removed a small dagger from her armour.<br>\r\n<br>\r\nLucina stabbed the knife into the table pinning Robin to it by his coat ''Lucina what the Hell?'' Robin yelled ''This needs to be done, you are the reason Chrom is dead and the world is destroyed, therefore you must be killed for the greater good'' Lucina answered drawing parallel Falchion ''I know the magic used on you makes you pretty durable, but Falchion is a blade forged by Naga herself so your miniscule curse is nothing to it'' she raises the sword above her head, ready to strike ''This is how it must.. .AHH!''<br>\r\n<br>\r\nLucina screamed as 2 arrows hit her, the one to her right making her drop Falchion, while the other pinned her left hand to the table. Gritting her teeth she manages to hold back just enough pain to be functional... until she feels the burning sensation to the back of her neck (As well as the smell of burning, which is expected when you shove a red hot arrow through hair). ''You try to hurt father again, our leader or not I will send an arrow through that obnoxiously thick, Ylsian skull of yours and take control of the time travel party'' Noire hissed from just behind her, mildly amused when she sees Lucina's pained twitching. Lucina knew she had no control over her spasms of the pain, Noire's black arrows had a ring of decay curse built in, she was feeling her flesh within a 3 inch radius of the arrow being eaten away by Noire's dark magic.<br>\r\n<br>\r\n<b>''What's going on here?'' </b>Both Lucina and Noire groan when they hear the shrill yell of Cynthia as she spies them from the open tent flap, her yells also drawing others, namely Morrigan (&amp; Morgan), Tharja, Sumia and Chrom. ''Step away from my sister'' the wannabe hero demands, Noire snorts in amusement as well as disbelief that the Pegasus knight believes she's threatened by her. ''You try anything and you'll bleed out quicker than it would take for you to realise you've been injured ''Morrigan hissed, doing a much better job of intimidating as mother and daughter took a few steps away from the dark mage.<br>\r\n<br>\r\n''Let's try this again'' Tharja began, having unpinned her husband and slid him into the safety of her bosom ''Lucina here thought it was a bright idea to kill father, which among other things would cause irreparable damage to the timeline due to almost all of us here being wiped from existence'' ''But wouldn't altering the timeline do that anyway?'' Sumia asked, like most confused by time travel and it's many rules ''We're protected from most paradox consequences, such as if Lucina was to touch her younger self she wouldn't explode. But nothing can protect you from the time shock of never existing in the first place'' Noire answered, having the most knowledge as the one to suggest time travel in the first place (Lucina liked to claim Naga did it, but Noire and a few others saw Naga as simply an annoying, overgrown magical battery). ''Lucina!'' Chrom and Sumia scolded, finding their anger now they weren't busy being very confused ''You should know Robin has my complete trust'' ''But he is the avatar of Grima, and besides didn't you see what Validar was able to make him do? He stole the Fire Emblem, he could just as easily be made kill you'' Lucina yelled, trying to get her point across as quickly as they could both so this could be over and also so she could get her hands fixed before the rot becomes permanent. <br>\r\n<br>\r\n''No Lucina, we're not bound by fate, we can make a difference or else there was no point in you traveling through time to try change the past'' Lucina winced knowing how badly she's disappointed her one role model ''Noire, pull back a little'' the white haired girl raised an eyebrow ''I don't want Lucina to die just because she won't look me in the eye'' Tharja hissed, Morrigan rolled her eyes but pulled the elder girl away. Lucina then had her head tilted to stare into the witch's dark eyes ''Listen here Lucina, if you ever try this again I won't kill you quickly, despite all the anger held within her Noire didn't want Morgan to be sad so would've killed you quickly and relatively painlessly. I on the other hand will make you suffer for days before actually killing you'' Lucina paled as she could see in her eyes that the Plegian was serious ''Are we clear?'' nod ''Good'' Tharja smiled and slapped Lucina's cheeks, before sheparding her daughters out of the tent.<br>\r\n<br>\r\nNow what?<br>\r\n</span></div></div>",
            "created":1464670800,
            "id":2156867,
            "title":"Something was missing"
        },
        "143111212222122":{
            "choices":[
                "Skip to the dragons table",
                "Why skip when you have fluff and cuddly stuff? Lucina gushing over Morgan etc."
            ],
            "content":"<div class=\"\"><div> <span>Morgan was utterly horrified. His loved ones all trying to kill each other, his best friend/somewhat secret crush attempted to murder his father and his sisters and mother tried to kill her. Morgan during that moment decided to just silently pray and cry for nobody to die, lucky for him his prayer came true. After the whole incident there was left with distrust between Lucina and Morgan's family even though she swore she wouldn't try anything. Morgan still had faith in Lucina, Morgan might of done the same in her situation .<br>\r\n<br>\r\nWhen Morrigan reached her tent she pulled out Morgan and set him on the bed next to her. \"Hey Morrigan, can you please leave me alone for a few minutes, I need to get my thoughts straightened.\" Morgan asked. Morrigan nodded in understanding his reasoning. \"Just call if you need anything squirt.\" Morrigan said before leaving the tent trying to lighten the mood a bit.<br>\r\n<br>\r\n\"I can't take this anymore!\" Morgan said crying in frustration. \"I come back to change the past and what do I find? My loved ones trying to murder each other while in another timeline I have to hope that the me there has confidence and guts to actually try his plan, I just have to be patient, like sans said I just need to do my work here and keep everyone's morale  up until the time the true final blow can be preformed and Noire and Morrigan won't have to go through with their plan, whatever that is.\" Morgan said. \"Hey kid how's it going?\" Sans asked appearing next to him. \"Not good my loved ones attempted to kill each other, how's it going with the two other Morgan's?\" Morgan asked. \"Well the smash Morgan is still getting over to the other guys universe, anyway Morgan who volunteered for the true final blow said to refer to him as Calibri until the true final blow as been preformed.\" Sans said. \"Okay got that, man Calibri has guts to volunteer for this, helps that he did come up with the plan, anyway there are only three Morgan's involved with this plan.\" Morgan said. \"Well I'm gonna go now sweet dreams.\" Sans said before leaving.<br>\r\n<br>\r\n\"Hey baby how are you doing?\" Tharja asked as she Robin, and Morgan's sisters walked into the tent. \"To be honest I wouldn't be suprised if get nightmares.\" Morgan said. \"Well you don't have to worry Morgan, you've got your parents and your big sexy sisters to help you.\" Noire said picking up the ten year old. \"Thank you, it's because of all of you that I'm able to get through.\" Morgan said and the family did a big family hug squishing Robin and Morgan.<br>\r\n<br>\r\n</span></div></div>",
            "created":1464670800,
            "id":2156974,
            "title":"Nightmare fuel for dinner"
        },
        "143112":{
            "choices":[
                "Kidnap Robin ",
                "Kidnap Morgan and have him hostage and Probaly have fun with him"
            ],
            "content":"<div class=\"\"><div> <span>Tharja was once again thrown about fifty feet after groping her crush Robin. Robin was a tall red head who stood at a whopping 6.5 feet tall and had the biggest breasts out of all the sheperads which was saying a lot as Tharja herself had an impressive pair. Robin was also married and really stubborn and nothing changes her opinion nothing. Chrom wanted to only have one kid and Robin wanted one they had two kids and Robin bragged about her always being right by saying that having a second child (who came from the future who still isn't born yet)  was a good idea. She was right as Morgan their youngest had to be the most adorable little boy she has ever seen (Tharja's feelings extended a bit to the child) and ironically was really short despite having a titanic mother. Tharja liked to leap from behind corners to start groping Robin's goddess like breasts and then after a little bit Robin would get pissed (Robin honestly loved the feeling of her breasts being massaged but she didn't like it when Tharja did it however. Although Tharja learned Morgan was a pretty good masseure and massages his mother's breasts to help please her.) and throw Tharja fifty feet away with her impressive strength (the reason why Chrom only wanted one kid was because when Robin and Chrom first made love his pelvis got broken and he was be ridden for a while). Tharja had finally came up with a plan.. Wel actually two. Plan one she could shrink Robin and keep her as a tiny pet/lover (the one downside being she wouldn't get to enjoy Robin's goddessly breasts) or plan two she could hold Morgan hostage and in return for his safety Robin has to ditch Chrom but Robin is still allowed to at least \"make Morgan\" as she didn't want to end up erasing the cute ten year old from existence.<br>\r\n<br>\r\nNow which plan should she go with?</span></div></div>",
            "created":1463893200,
            "id":2152353,
            "title":"Improvising"
        },
        "14313":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Giantess",
                "Continue with shrinking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With mostly shrinking options how about a chance for growth, it'd be nice to see the girl get bigger?</span></div></span></div>",
            "created":1415336400,
            "id":1882849,
            "title":"Bigger maybe"
        },
        "143131":{
            "author_id":"steakfan1",
            "author_name":"FiletMignon",
            "choices":[
                "Robin/Lucina",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's try to put the choices in clusters to keep the chapters short.<br>\r\n<br>\r\nStarting off with the Smash reps.</span></div></span></div>",
            "created":1417582800,
            "id":1897357,
            "title":"Giantess"
        },
        "1431311":{
            "choices":[
                "Keep talking",
                "Eh nope!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if there is some special trait all plegian women have?</span></div></span></div>",
            "created":1463806800,
            "id":2151727,
            "title":"What if"
        },
        "14313111":{
            "choices":[
                "Something bad happens to Morgan ",
                "Everything goes well"
            ],
            "content":"<div class=\"\"><div> <span>Morgan was playing chess with his father in what Chrom likes to call \"the man tent\" for when Lucina and Robin were away. \"Checkmate.\" Morgan said. \"Darn it! Best 23 out 47?\" Chrom asked and the ground shook with a booming feminine voice calling \"MORGAN!\" \"Morgan what did you do this time?\" Chrom asked and the ground kept shaking. \"Nothing, we both know that I'm the most well behaved out of all the future kids.\" \"Either way you should still run.\" Chrom said and Morgan ran out of the tent.<br>\r\n<br>\r\n\"Oop, sorry, pardon me.\" Morgan said as he went around people the ground still shaking. Sadly for him he ran out of people run around and he was soon scooped up brought to a familiar face. \"Looks I win again baby bro.\" It was Morgan's older sister Lucina who stood at a whopping 100 feet tall. Now you might be thinking how in the freaking world could these two be related? Well you see Robin, Lucina and Morgan's mother, is plegian and plegian women are born giant the more powerful they are the bigger, now don't get me wrong age and genetics still calculate height with Robin being 125 feet tall. \"Darn it, I thought going through crowds would make you slow down allowing me to win, but nope you win again, like always.\" Morgan pouted playfully. \"Cmon little bro, let's get to our tent.\" Lucina said walking their tent which was big enough to fit Lucina (since plegia has giant women they make giant everything.) Now Morgan and Lucina did things toghether like normal siblings, they hung out, played games, got into trouble but they did things normal siblings didn't do such as sleep toghether (not in a sexual way) and Lucina would sometimes keep Morgan inside her stomach because plegian women are physically incapable of digesting loved ones. Also Lucina liked to tease Morgan with their height difference, speaking of which...<br>\r\n<br>\r\n\"Lucina, can I please come out now?\" Morgan asked from the inside of his sister's stomach. \"I don't know, can you?\" Lucina asked playfully and Morgan sighed \"okay may I come out?\" \"Nope!\" Lucina said cheerfully patting her stomach. \"You feel great in there.\" \"Cmon Luce, remember the rule mom made, if you eat  me and I'm not willing you can only keep me in here for a total of a half hour unless if I say I want to stay longer or if it's bed time and it's been 45 minutes and it's only 4 in the afternoon.\" Morgan complained. Luckily for Morgan their mother and father walked in (with Chrom standing on his wife's shoulder). \"Lucina let out your brother right now or your grounded.\" Chrom threatened and Lucina just smirked. \"Ground me from what? If you take away falchion I could still easily fight (falchion was able to change to fit Lucina because of it being a magic weapon) and if you prevent me from fighting it just gives me more free time.\" Chrom looked defeated and said \"I swear ever since we found Morgan Lucina has been acting a lot more sassy.\" Luckily Robin had a secret weapon. \"If you don't spit out you brother you'll be grounded from Morgan.\" Lucina's eyes widened. \"You can't do that, where would Morgan even sleep?\" \"With me, and if you don't spit out Morgan right now I'll give you the Heimlich and you won't be able to go near, talk to or even look at Morgan.\" Lucina's eyes widened and she gagged and spat out Morgan onto her bed. After Morgan got wiped off Robin said. \"Morgan can you be a dear and go into town and go buy some food we seem to be running low.\" \"Sure mom.\" Morgan then went off to go get the wagon used to pull food. Lucina was going to follow but Robin cut her off. \" You can't go into town with your size Luci, but just closely follow behind and only allow yourself to be know if Morgan is in danger okay?\" Lucina nodded in understanding and followed rather stealthily for a hundred foot tall woman. What happens when Morgan goes to down</span></div></div>",
            "created":1463806800,
            "id":2151730,
            "title":"Big family "
        },
        "143131111":{
            "choices":[
                "They manage to get back to camp (and possibly cuddle)",
                "Something happens along the way (good or bad I don't care)"
            ],
            "content":"<div class=\"\"><div> <span>Everything was going well for Morgan he had some alone time and he managed to get food for his mother. Until everything started going horribly wrong. \"Well, well, well what do we have here? A little runt pulling a ton of food around, surely you aren't gonna eat it all yourself.\" An older boy said walking up with four boys. \"Of course, not the food is for my mother and everyone else at camp.\" The ten year old boy said cheerfully. \"Wow with that much food that means that you have a lot of people at camp, or..\" The leader of the older boys said smirking. \"Your mom is obese\". \"Yah no wonder why he's so scrawny and runty cuz his ma keeps all the food away.\" One of the older boys said laughing and Morgan frowned. \"My moms not fat, she just has a really big appetite, now excuse me so I can get back to camp.\" Morgan said calmly walking past the group until he was pushed back. \"Surely your little camp doesn't need all this food and your mom can lose some pounds so allow us to lighten your load.\" The leader said reaching for a banana but Morgan slapped his hand away. \"I payed for this food, and make all the fat jokes you want but my mother is infinitely times prettier than all of your moms combined.\" Morgan said frowning and he was then shoved to the ground. \"Are implying that our moms are ugly?\" One of the other boys said. \"No I'm just saying my mom is much, much, much, much, much, much more prettier than your moms.\" Morgan said. \"Oh you little runt you gonna regret your words.\" The leader said and all the boys started kicking Morgan as he was lying on the ground. \"HEY!\" The boys looked up and saw a 100 foot tall blue haired woman looking down at them. \"How dare, you think you boys can just walk up and insult and attack my little brother like that?\" Lucina said scowling. \"Wait your his sister?\" The leader asked weakly. \"Yep and you know what happens to people who mess with my baby brother?\" Lucina asked. \"They go very far away.\" Lucina said slowly and she picked up all the boys who were attacking Morgan and threw them as far as she could. \"I'm sorry!\" The leader said as he went flying out of sight.<br>\r\n<br>\r\n\"They didn't break anything right Morgan?\" Lucina asked worried. \"No, they insulted mother and kicked me a lot.\" Morgan said lying on the ground. \"Thanks for saving me Lucina.\" Morgan said. \"Well it's my job as an older sister to protect you, now come lets get back to camp.\" Lucina said gently sliding her ten year old brother into her cleavage. She grabbed the food wagon and slowly walked back to camp as not too her her brother or drop any food.</span></div></div>",
            "created":1463893200,
            "id":2152017,
            "title":"Bullies have a bad time"
        },
        "1431311112":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "They reach the adults with little problem, (skip to that)",
                "Morgan wants to ride with/on Noire the rest of the way"
            ],
            "content":"<div class=\"\"><div> <span>Lucina was making her way slowly back to camp when she was blindsided, and pulled into a crushing hug. The white bang in her face told her all she needed to know; it was Noire (if anyone's wondering how you sneak up on a giantess, it's simply by being stealthier) ''We're back!'' Noire squealed happily, before letting go of the bluenette and Lucina sighed, the 3 dark mages had been in Plegia to ensure the Grimleal were behaving and not trying to resurrect the 600 foot Grima (again) ''Great, and you're here because'' ''Well after dealing with the boys...'' even Lucina smirked at the comment, due to the size difference males were usually referred to as boys by Plegian women, mostly affectionately or jokingly ''...mom and Aunt Versa said we should come and see you all, and look I managed to get the magic down right. Please let me show you, please, please,please'' Noire was a dark mage like both her parents (Hi Henry... bye Henry) the reason anyone thought she was a sniper was due to how she used her magic; the energy was released as a beam that pierced it's target, rather than an energy ball that exploded.<br>\r\n<br>\r\nLucina rolled her eyes as Morgan popped out of her cleavage ''Come on Luci I want to see Noire's new trick'' Morgan pouted up at her, his slightly bruised face making his puppy dog pout stronger (as in he's literally a kicked puppy) ''Fine show us what you've done'' ''Yay!'' both Morgan and Noire cheered, the latter hugging Lucina again, pressing her larger frame and breasts against the royal siblings. Noire then stepped away giving her 110 ft form some space before extending her index finger above their heads. A deep crimson magic began to gather at the tip, forming a ball of magical energy that she then released producing a beam of fire magic about the size of Morgan in diameter. ''Grima's bouncy tits, Noire you could've hit us'' Noire just shrugged ''No I couldn't, I aimed up'' Noire despite her usually meek nature did on occasion like to bring up the fact she was taller when she had any good opportunities, sometimes just because it irritated Lucina. ''So now you're finished trying to kill us, can we just go home with the food?'' ''Okay!'' Noire chirped and linked arms with the bluenette who shrugged her off and walked off with the food.</span></div></div>",
            "created":1463893200,
            "id":2152242,
            "title":"Arrival of family and friends"
        },
        "14313111122":{
            "choices":[
                "They get back to camp and Morgan gets smothered by everyone after getting clean",
                "Something happens (I don't know what!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey why is Morgan all bruised up?\" Noire asked noticing Morgan's bruised face. \"Oh Morgan was shopping for food and some bullies appeared and tormented him.\" Lucina said and that set off noire. \"WHERE ARE THE MINISCULE BUGS WHO DARE HARM MY PRECOUIS SHOTA? SO I MAY CRUSHING THEIR PITIFUL BODIES UNDER MY FEET OR I CAN REDUCE THEM TO MERE FOOD FOR MY STOMCH!\" Noire shouted her ballistic side appearing and while Morgan cowered in Lucina's cleavage Lucina herself smirked. \"Oh I just threw them far, far away.\" \"Okay that's good.\" Noire said going back to normal, then her eyes lit up. \"Wait this is the perfect time to show off a new skill I learned while I was gone.\" \"What is it?\" Lucina asked. \"Well you know how we're incapable of digesting loved ones?\" Noire asked and Lucina nodded happily remembering all the times she kept Morgan all snuggled up in her stomach. \"Well I learned to make it so that when a loved one is inside my stomach I could have the acids heal the person like a healing staff but more cozy.\" Noire said with a grin. \"Okay sure you could try this out.\" Lucina said and Noire squealed and plucked Morgan from Lucina's cleavage. Noire placed Morgan in her mouth and started swishing him around and moaning. \"Oh how I've missed your delicious taste Morgan, so nice and sweet just like your personality.\" Noire than swallowed the boy and patted her stomach when she felt Morgan land.<br>\r\n<br>\r\n\"Weee! Oof.\" Morgan said as fell. \"Hi Morgan how's it going.\" A familiar voice said. \"Henry? Is that you? What are you doing in here? How are you here without noire knowing? Why are you in here?\" Morgan asked. \"Up its me Henry, you friendly neoghborhood dark Mage. Anyway I got here because I snuck into Noire's sandwich when she got here. Im here because I'm escaping Tharja, because the longer she goes without making love the rougher she is when she gets back to doing it.\" \"Also the reason why noire doesn't know I'm here is because of MAGIC!\" Henry explained doing jazz hands when he said magic. \"Ooh, Noire's new trick is working, sure it isn't bloody and violent but it's still neat.\" Henry said noticing that Morgan's wounds are healing. \"Wow your right ,well, I better get to work.\" Morgan said and he started rubbing Noire's stomach walls.<br>\r\n<br>\r\n\"Ooh yes Morgan's rubbing my stomach walls, Lucina I'm jealous your little brother has hands like an angel, he makes a amazing masseure, I wish I had a little brother that I could cuddle up and eat.\" Noire said pouting and then started moaning in pleasure again. \"Yeah I know Morgan's amazing,  maybe when we get back  you could ask her for a brother or two or twenty.\" Lucina said joking (Tharja only recently has give birth to little noire). \"Yeah that would be amazing twenty little boys rubbing my body all for myself maybe I could bring that up to mom.\" Noire said continuing rubbing her stomach. (Fun fact it's impossible for a male plegian to have a younger sister because there is some genetic trait where once a female plegian gives birth to a male child they are incapable of having any female children  afterwards luckily the percentage of a female plegian's first child to be female is 90% while the possibility of the first child be male is 10%)</span></div></div>",
            "created":1463893200,
            "id":2152304,
            "title":"Tactical retreat"
        },
        "143131111221":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "They want to play some games with Morgan",
                "Skip to when Tharja comes back (minus a now sleeping Henry)"
            ],
            "content":"<div class=\"\"><div> <span>Noire and Lucina happily strolled into camp, glad there were no problems along the way not that it would be much more than a mild inconvenience for them. The duo headed towards the tents set up for the Plegians where the giantesses would definitely be. ''We're back'' Lucina called as she entered the tent ''... he can't just disappear, I have needs too'' ''And we're going again'' Noire meeped, both girls getting the tail end of Tharja/Aversa/Robin's conversation and very glad it was only that ''Oh hey girls'' Robin greeted, hugging first her daughter then her best friend's kid. ''You got the food, but where's Morgan?'' Noire blushed ''There were some assholes who hurt Morgan, so Noire is using her newest trick to heal him inside her stomach'' Lucina answered ''Oh. Well will he be coming out anytime soon?'' Robin asked, absentmindedly petting Noire's flat stomach. Noire shrugged ''I don't see why not, this was the first time I did it properly'' she answered<br>\r\n<br>\r\nNoire sticks her long fingers down her throat, gagging slightly before coughing up Morgan..... and Henry. ''Papa?'' Noire blinked once she'd wiped the tears from her eyes ''you little baka'' Tharja angrily growled ''hiding from me inside our daughter'' ''Um hi dearie, what I miss?'' Henry asked trying not to look her in the eye ''You didn't miss anything, see you guys later We'll be back in a few hours'' Tharja waved to the girls as a pale Henry was carried out of the tent. ''Let's not talk about that'' Aversa stated, everyone nodded quickly in agreement. ''Come on Morgan, we need to get you cleaned off'' Robin said picking him up and carrying him away.<br>\r\n<br>\r\n''Mom, that tickles'' Morgan peeped as Robin sudded him up, and cleaned him off, making sure Noire's stomach juices were washed off. ''Sorry baby, don't worry we're nearly done'' Robin giggled as she towelled him off, before sliding him into her cleavage ''Time to see how the others are doing'' she said and returned to the others. ''Morgan you're back'' Lucina yelled as she plucked him from Robin and cuddled him against her bosom. ''Hey no fair, you can't hog him all to yourself'' Noire complained, sliding over to Lucina, squishing Morgan between both busty girls. ''Oh remember when we used to fight over boys like that?'' Aversa giggled while Robin just looked at her with raised eyebrows ''Oh wait that was a flat chested girl, still she was cute for a Ylssian'' Robin rolled her eyes before separating the girls and reaching for her son, except Aversa grabbed him first and dropped him in her mouth. ''AVERSA!'' Robin growled ''What?'' Aversa mumbled around Morgan who was still being bounced around her mouth ''Drop him, now'' Robin ordered like a dog hand extended. Aversa frowned before spitting him out... down Robin's shirt, the white haired grandmaster nearly spasming as the now very slimy boy slid through her cleavage.<br>\r\n<br>\r\nEventually everyone managed to calm down and agree to behave themselves (as Tharja's... busy that means Aversa took the longest to agree to that) Robin set Morgan on her desk ''Now I know you all want to play with Morgan but remember while as a Plegian he's more durable than normal boys you should still be careful. Also on a more general note you need to learn how to share, so we'll all be spending time with Morgan together'' she smiled, Morgan &amp; Noire cheered, Aversa smirked and Lucina frowned for a moment before forcing a smile onto her face (Robin didn't notice)<br>\r\nSo what now?</span></div></div>",
            "created":1464325200,
            "id":2154967,
            "title":"They get back to camp just fine"
        },
        "1431311112211":{
            "choices":[
                "Morgan is found!",
                "No he is not. (Another Morgan story)"
            ],
            "content":"<div class=\"\"><div> <span>\"What to play, what to play?\" Aversa was asking to herself. \"I know we can play hide and seek, I can hide and the rest of you can try to find me!\" Morgan cheerfully answered and the plegians nodded in agreement. They covered their eyes and counted while Morgan smiled to himself already knowing where to hide. Now with growing up with several plegian women Morgan was the best climber in the army, and the most popular with plegian women. Morgan rushed over to the leg of the bed climbed up it and crawled under the mattress as far as he could. Due to Morgan's bloodline Morgan was more durable than the average plegian, sure he could suffer from cuts and stab wounds but blunt trauma wouldn't break his bones. <br>\r\n<br>\r\nNow was the time to reflect on his life. When Morgan traveled to past he only remembered six people besides himself: his parents, his sister, His aunt Aversa, Noire and her mother. Morgan eventually befriended some of the people he forgot about. As well he could remember the first time he was eaten by the women who loved, except for his mother who ate him a little bit after he was born.<br>\r\n<br>\r\nFor Lucina it was Robin teaching her ability to safely consumed loved ones.<br>\r\n<br>\r\nSeveral years ago<br>\r\n<br>\r\n\"You want me to what to what!?\" \" I said eat him\" \"Listen mom I'm not gonna eat him, do you want Morgan to die?\" \"Listen Lucina, us plegian women have the ability to eat the ones we love without having them perish, now eat your brother or your grounded.\" \"Heh fine.\" Lucina sighed and looked down at the three year old Morgan who seemed unfazed at what was happening actually jumping around waiting to get eaten. Lucina lifted him up and plopped the bluenette into her mouth and a wave of pleasure overwhelmed the 14 year old Lucina. Morgan tasted like candy but better, she swirled her tongue over Morgan who seemed to be giggling. About a minute later Lucina swallowed and patted her stomach satisfied. \"You see?\" Robin asked with a smug look on her face. \"Okay you were right mother, he does feel wonderful in there.  Lucina was rubbing her gut and felt Morgan rubbing the inside of her stomach walls.<br>\r\n<br>\r\nMorgan finished his memory and listened to the others. \"Man where could that kid be?\" Aversa asked \"Maybe he's here!\" Lucina said.<br>\r\n<br>\r\nBut is she right?</span></div></div>",
            "created":1473397200,
            "id":2208275,
            "title":"Hide and seek"
        },
        "14313112":{
            "author_id":"gabuts",
            "author_name":"Max",
            "choices":[
                "Lucina",
                "Robin (Female)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who would it be?</span></div></span></div>",
            "created":1504846800,
            "id":2382304,
            "title":"Eh nope!"
        },
        "143131122":{
            "author_id":"gabuts",
            "author_name":"Max",
            "choices":[
                "Not too far (Near Tharja's tent)",
                "Kinda far (Near Chrom's tent)"
            ],
            "content":"<div class=\"\"><div> <span>Tharja had called Robin to her tent to show her a new tome she had found<br>\r\n<br>\r\nRobin of course went to visit Tharja to learn about this new \"tome\" but in reality Tharja had prepared a spell for Robin something to make her better or at least she thought so<br>\r\n<br>\r\nAfter Robin entered the tent Tharja fired her spell towards Robin making her fly backwards<br>\r\n<br>\r\nHow long does Robin travel?</span></div></div>",
            "created":1505106000,
            "id":2384008,
            "title":"White haired Tactician!"
        },
        "1431312":{
            "author_id":"steakfan1",
            "author_name":"FiletMignon",
            "choices":[
                "Lissa/Maribelle",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Next is the Princess of Ylisse and her best friend.</span></div></span></div>",
            "created":1417582800,
            "id":1897358,
            "title":"Next"
        },
        "14313121":{
            "author_id":"steakfan1",
            "author_name":"FiletMignon",
            "choices":[
                "Lissa",
                "Maribelle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl is going to grow?</span></div></span></div>",
            "created":1417582800,
            "id":1897359,
            "title":"Lissa/Maribelle"
        },
        "143132":{
            "choices":[
                "Tiny freaking Morgan ",
                "Insert tiny Morgan or suffer the consqences "
            ],
            "content":"<div class=\"\"><div> <span>I have explored new lands and I come bearing the greatness of tiny male Morgan. All women want his small body. He slaughters all who oppose him he destroys Bill Cosby and shrek and even Morgan freeman no one can resist his greatness come with me my brothers and spread the word of Morgan.</span></div></div>",
            "created":1463374800,
            "id":2149132,
            "title":"I am spreadin the word of Morgan "
        },
        "1431321":{
            "choices":[
                "\"Hot springs! \"Pit get back to kid Icarus ",
                "More Morgan son!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is my first story idea. Morgan is at the hot springs and ends up getting shrunk I'm bad at descriptions<br>\r\n</span></div></span></div>",
            "created":1463374800,
            "id":2149162,
            "title":"Tiny freaking Morgan nu. 1"
        },
        "14313211":{
            "choices":[
                "Robin and Lucina worried about their son/younger brother",
                "Anna wanting to make huge profits off of selling a tiny Morgan "
            ],
            "content":"<div class=\"\"><div> <span>Morgan sighed ready to relax, the sheperads just finished killing a crap ton of risen and as a reward they get to relax. Morgan was wearing blue swimming trunks and nothing else he also felt that he was undeservingly lucky as he was able to get amnesia and forget all the nasty things that plague the other future children. \"You know right over there, there is a special hotspring that can help recover lost memories.\" The Anna that worked at the gift shop said. \"Really?\" Morgan asked his eyes lighting up. \"Yup and the longer you stay there the more memories you'll recover.\" The Anna said with her signature finger to lip pose and when she turned she saw Morgan running towards the hot spring as fast as sonic the hedge hog. <br>\r\n<br>\r\nUnfortunately for Morgan the ten year old tactician happened to step on a thing of bar soap with the words \"baby soap\" carved into that was left by some lazy guy.<br>\r\n<br>\r\nIn some random universe<br>\r\n\"SANS! IT IS CENTURY'S BATH TIME AND I CANNOT FIND THE BABY SOAP! DID YOU LEAVE IT AT THE HOT SPRIINGS YOU TOOK CENTURY TOO LAST WEEK?\" \"Oh crud! I think I did oh well guess it <i>slipped my mind.\"</i> \"OH MY GOSH SANS THAT WAS HORRIBLE!\" \"My son doesn't think so he's laughing his little head off right now, who's a good baby, your a good baby.\" \"SANS CENTURY IS NOT A DOG HAVEN'T YOU RAISED A CHILD BEFORE?\" \"That was tori who's had a kid before, not me anyway I'm gonna go grab some soap from the store watch century and don't <i>slip up</i>and don't let anyone touch my son got it?\" \"OH MY FREAKING GOSH SANS PUNS ARE NOT GOOD FOR BABIES! YOU NEED TO GIVE HIM PUZZLES LIKE A GOOD MOM!\" \"Papyrus we've been over this a male parent is called a dad, a female parent is called a mom, anyway I seriously hope that nobody slipped on it because I'm pretty sure the particular hot spring that I used has nasty effects if used by the wrong person anyway watch the baby bye.\" \"OH THANK GOODNESS NOW I CAN GIVE YOU PUZZELS BECAUSE I THE GREAT PAPYRUS IS THE WORLDS GREATEST UNCLE!\" \"Oh also paps, no puzzles while I'm gone.\" \"WHY MUST YOU MAKE MY LIFE SO DIFFICULT!?!?\"<br>\r\n<br>\r\nBack to Morgan <br>\r\nWhen Morgan stepped on the soap bar he slipped went flying 5 feet into the air and fell face first into the water knocking him unconscious. Another unfortunate thing that spring didn't recover memories it shrunk people so Morgan shrunk to 4 inches tall floating in the water.<br>\r\n<br>\r\n\"Hey wake up are you okay?\" A feminine voice asked and Morgan opens his eyes flickering a bit and saw a giant </span></div></div>",
            "created":1463374800,
            "id":2149182,
            "title":"Anna why u mess with people?"
        },
        "143132112":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Aversa",
                "Tharja or Noire"
            ],
            "content":"<div class=\"\"><div> <span>Morgan blanched when he saw the red headed trickster standing over him, her face a mix of concern but mostly intrigue. ''So are you okay squirt?'' she asked again, this time Morgan nodding in response ''Good'' she said in relief as she picked the little guy up ''Wouldn't want such a little guy to get hurt, especially as I almost stepped on you'' Morgan paled as Anna appraised him ''You know a little cutie could sell for quite a lot of gold'' Anna mused to herself eyes flashing with greed ''Hey you can't just sell me off, I'm a person'' Morgan argued but shut up when Anna squeezed ''Hush now, I don't want to damage the merchandise but you're being sold off no question'' she then produce a small cage like for a rodent or large insect <br>\r\n<br>\r\nAfter the Shepard's had dealt with the Risen the hot springs were reopened to the public, meaning Anna simply had to go over to the female side of the building and she'd have a huge potential client base. Using the bell at the edge of the spring she managed to get most if not all her patrons attention ''Ladies I have a very special product available for purchase for one night only!'' she then reveals the cage containing tiny Morgan from behind her and places it on a flat rock that functions as a table ''Your own little boy toy to use as you please'' Anna announces, getting interested murmurs from the women ''I'll start with an initial asking price of a gold bar (medium bullion = 5,000 gold)'' Anna said, watching gleefully as the gold skyrocketed<br>\r\n<br>\r\nAs he sat in the cage watching the women outside fight over him, Morgan wished his mother or sister were in the crowd But they weren't (mostly because we know Robin would take Morgan and feed Anna her intestines rather then buy him back) so all he could hope for was an owner who wouldn't mistreat him or be too aggressive/forceful with whatever she wanted him to do.<br>\r\n<br>\r\n''Sold to the sexy lady with the big titties'' Anna announced with a grin as she took her sack of gold and handed over Morgan's cage. Despite himself Morgan smiled slightly, he may be a possession now but at least he recognised the woman and she was cute<br>\r\n<br>\r\nWho is it?</span></div></div>",
            "created":1463461200,
            "id":2149560,
            "title":"For one night only!"
        },
        "1431321121":{
            "choices":[
                "No (Uh oh)",
                "Aversa agrees (She does get a lot of money)"
            ],
            "content":"<div class=\"\"><div> <span>While she wasn't cute she was more sexy. Morgan's aunt Aversa, who smiled down at him and gave him a wink. She turned to face the crowd of women and loudly declared, \"This little boy is mine, and if anyone of you is foolish enough to take him from I'lol blast you all to kingdom come.\" She then walked out of the female's side of the building. Morgan had been removed from his cage and placed upon Aversa's shoulder him clinging to her wet hair. \"While I am curious about how you shrunk it interrupts with planning for all the fun we'll have once we get home.\" \"Wait Aunt Aversa shouldn't we try to find a way to get me back to normal?\" Morgan said worried, \"Yes of course we'll do that but I did pay a hefty price for you and I want to have a bit of fun first.\" Aversa said she soon spotted Robin who noticed her ran towards the dark skinned plegian. \"Aversa I can't find Mor-\" Robin had just noticed her tiny son on her sister's shoulder. \"My baby what happened to you!?\" Robin asked after plucking the tiny boy of Aversa's shoulder. \"The Anna working here said that there was a hot spring that could bring back memories so I went to it slipped on a piece of soap and realized that she lied and it shrunk people. The Anna in the army found me and decided to use me in an auction and Aunt Aversa bought me.\" Morgan had explained, Robin was steaming mad disgusted with how those gold diggers could lie to her son than sell him off like a profit she was then thinking of ways to feed the sisters their own intestines. After Robin had calmed down enough to form words she asked \"While Aversa I know you paid a lot of money get Morgan back I ask you not as a queen but as your sister to give me back my son and I'll happily give you twice as much money you paid for him if you agree.<br>\r\n<br>\r\nAversa hummed for a bit before giving her answer.</span></div></div>",
            "created":1481864400,
            "id":2250826,
            "title":"Morgan's savior (or not)"
        },
        "14313212":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a modern day au?</span></div></span></div>",
            "created":1464152400,
            "id":2153906,
            "title":"A little mix up"
        },
        "143132121":{
            "choices":[
                "friends of the family show up",
                "They get some swimming done"
            ],
            "content":"<div class=\"\"><div> <span>\"It's so hot!\" 21 year old Lucina  complained and she was right as it was the middle of June and practically the hottest day of the year. Lucina then remembered there were Popsicles in the freezer grabbed an orange flavored one then sat back on the couch and slouched. She took off the wrapper stretched her arms then when she put the Popsicle in her mouth she started moaning as the Popsicle tasted delicious. Lucina then quirks her eyebrow it was too delicious and Lucina noticed that the Popsicle was bigger than normal. She pulled the Popsicle out of her mouth and saw her inch tall ten year old brother Morgan clinging to it. \"Morgan why are clinging to my Popsicle?\" \"I was getting desperate okay? It's flippin hot out here and the Popsicle is so cold.\" Morgan said and Lucina laughed. \"You are right, okay you can stay.\" \"Yay!\" Morgan cheered and Lucina placed the Popsicle with Morgan clinging to it back into her mouth. \"I have good news everyone.\" Chrom said as he and Robin walked into the room. \"The pools now open so we're going.\" Lucina took the Popsicle out of her mouth (with Morgan still inside her mouth) and said \"that's great news\" \"YAY!\" Morgan said popping his upper body out of Lucina's mouth. \"AHH! I swear I'll never get used to that.\" Chrom said after screaming while everyone else was laughing.<br>\r\n<br>\r\nAfter everyone got to the pool after they changed into their swim wear Morgan went under the bars and was soon met with a familiar face. \"MORGAN! Your here!\" Morgan's five year old cousin century said giving him a big hug, with century being 3/5 of an inch tall. \"Hey cousin, I guess that aunt aversa and uncle sans are here too?\" Morgan asked after he spun around holding century. \"No, daddy had to leave because he said he's not used to high temperatures as most of his life was spent somewhere super cold and snowy so daddy's visiting uncle papyrus and he said he's going to dunk Linda which I don't get but whatever's fine with him.\" Century said with a pout.<br>\r\n<br>\r\nWherever sans is<br>\r\n<br>\r\n\"Hi Linda.\" \"OH CRAP! Sans I thought you moved.\" \"I did, but it's super hot where I live right now and I'm not one for swimming, so I came here to visit my most favorite person to dunk.\" \"Sans it isn't even the school year so you can't prove me wrong at the pta meetings anymore.\" Linda said rather annoyed. \"Wrong, I can still dunk you (by that he means by totally prove wrong) no matter what time of year it is, anyway I'm gonna go say hi to paps\" sans said walking off the something slipped out of his pocket. \"Whoops dropped something.\" Sans said picking it up. \"May I ask what it is?\" Linda asked curious. \"Sure it's a picture of my son, Century cute little fella ain't he?\" Sans asked showing Linda the picture and she gasped. \"I recognize him from the last pat meeting.\" <br>\r\n<br>\r\nLast pat meeting<br>\r\n\"Say it kid.\" \"Fight me Helen!\" \"My word is that a tiny five year old?\" \"Oh shoot I forgot abort, abort!\" Sans said G.T.F.O of the there.<br>\r\n<br>\r\n\"Oh yeah well anyway prepared to get dunked on soon Linda it's coming.\" Sans said walking backwards eying Linda.<br>\r\n<br>\r\nBack with the others. <br>\r\n<br>\r\n\"There you are you two.\" Aversa said scooping up the two. \"Hi aunt aversa.\" Morgan said waving. \"Hey mommy!\" Century said cheerfully. \"There you are baby, your aunt Robin and your cousin Lucina want to see you.\" Aversa said.</span></div></div>",
            "created":1464152400,
            "id":2153926,
            "title":"To the pool!"
        },
        "1431321211":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Noire accidentally swallows Morgan or Century while swimming",
                "There were no incidents"
            ],
            "content":"<div class=\"\"><div> <span>''Hey everyone!'' Tharja called as she appeared, followed by Henry and Noire, the dark raven haired woman hugging her friends, Aversa more enthusiastically than Robin. ''Damn it's hot'' Henry muttered nearly white with sun screen to prevent his already pale skin from burning, Noire inheriting her mother's own resistance to the sun so only had a visible dab on her nose.<br>\r\n<br>\r\nMorgan who had just slipped into the pool after Lucina, saw the swim suits Noire &amp; Tharja were wearing and blushed, he could tell Robin was going to lecture Tharja for what were essentially nipple triangles, while Noire at least had a top similar to a sport's bra. The white haired girl slipped into the pool as Tharja was dragged away by an angry Robin, Aversa chuckles while Henry and Chrom rolled their eyes. ''Hey Morgan'' Noire greeted, popping up so Morgan was lifted out if the water by her breast, chuckling as the boy gapped with a bright red face ''H-h-h-hey Noire'' Morgan stuttered his reply. ''Morgan'' Century yells as he swims over to him, climbing Noire's breast to get to him ''Century!'' Morgan yelps, before pushing him off the tit then jumping off himself. Lucina chuckled behind her friend ''Nice try'' she jokes, then gets soaked when Tharja bounced into the pool, (She's more mellow and at times childish in this world) Noire giggling at the wet dog look the bluenette had with her hair nearly plastered to her face. Tharja popped up between them ''Hey kiddies'' she chirped before swimming over to Henry who was sitting at the edge of the pool.<br>\r\n<br>\r\nCentury swam his way across to his mother, like with Noire climbing her breast and laying upon it ''Hey kiddo, you tired?'' ''Yeah mom, this is a big pool'' Aversa chuckled and leaned against the side letting her son sleep.<br>\r\n<br>\r\n''Hey Morgan'' Robin slips into the pool and picks up the boy who was hyperventilating as he swam ''Any problems?'' ''No mother, just need to cool off'' Morgan answered, Robin noticing he was blushing bright red chuckled ''Did something happen?'' ''Um Noire kind of appeared...'' ''And?'' ''...and she rose up and I was on her breast'' ''Oh baby'' Robin soothed, sitting him on her own large chest ''Was there any problem?'' ''It was just embarrassing'' Morgan blushed even brighter ''Oh baby don't worry it's okay, if there had been any problems Noire would've said something, or probably been blushing either brighter'' she answered, pointing over to the snow haired girl splashing Lucina with a wide grin. ''Oh, okay then'' Morgan nodded in understanding ''Going to get back into the pool kiddo?'' ''Yes mom'' Morgan nodded, the bounced into the pool using her breast as a springboard. Robin rolled her eyes before Chrom swam up to her ''you okay dear?'' ''Yes honey'' Robin answered kissing him on the cheek, before pushing off the side to swim lengths.<br>\r\n<br>\r\nDid anything happen while they were in the pool?</span></div></div>",
            "created":1464238800,
            "id":2154569,
            "title":"The Nocturns show up"
        },
        "14313212111":{
            "choices":[
                "Comfortable; century stays inside noire (and Morgan possibly joins him)",
                "Uncomfortable; century is let out right away"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm back honey.\" Sans said as he appeared and gave his wife a kiss. \"I thought you don't like hot temperatures?\" Aversa asked. \"I don't but I realized I could of just put on a ton of sun screen, and I guess I could sit in the shade.\" Sans said shrugging. \"So how did 'dunking Linda' go?\" Aversa asked. Sans just gave a grin like a cat eating crap. \"Oh it went <i>swimmingly</i>.\" Sans said. \"Oh you are so handsome my little comedian.\" Aversa said. \"I thought I was your little comedian?\" Century said popping out. \"You both are.\" Aversa said. \"Wait if he truly is a Skeleton he needs to tell a joke.\" Sans said (skeleton is his last name which gives sans the excuse in this world to tell skeleton related puns). \"What does a skeleton use to tile his roof?\" Century asked. \"What?\" \"<i>Shingles\"</i> century said giving a cute grin. \"That's my boy, now go back in the pool.\" Sans said and century nodded before heading into the pool. \"What exactly does <i>dunking Linda</i> mean?\" Henry asked after sans sat down next to him. \"Oh you know saying that all of her research and reasoning are total B.S, insulting her cooking, the occasion prank, etc.\" sans explained<br>\r\n<br>\r\nSome where else.<br>\r\n\"I'll get it.\" Linda said opening the door noticing a package. She brought it inside set it on the table. She then opened it revealing a pie which apparently had a spring underneath it which shot the pie in her face. \"SANS! I SWEAR AT THE NEXT PTA MEETING I WILL MAKE YOU PAY!\" Linda screamed.<br>\r\n<br>\r\nBack at the pool.<br>\r\n<br>\r\nNoire was doing laps in the pool, she was unaware that century was in her path and she ended up having him stuck in her throat. \"Uh-Gurk.\" Noire gasped before swallowing the five year old. \"Oh crap. I think I just swallowed century.\" Noire said meekly before getting out of the pool. \"OH CRAP WE NEED TO CALL A DOCTOR, NO WAIT SOMEONE DO THE HEIMLICH!\" Henry said freaking out. \"SANS MY DAUGHTER JUST ATE YOUR KID HOW ARE YOU NOT FREAKING OUT?!?!?!?!\" Henry asked. \"Because I know century would be fine, I once took him and Morgan with me to poker and Grima got super drunk and mistook them for candy luckily they were just fine. Another reason why I'm so calm is because I'm a patient person, unless if your name is Linda and your a horrible racist baker who works in the PTA.\" Sans said shrugging. \"YOU TOOK THEM TO SEE GRIMA! DON'T YOU KNOW SHE IS THE LEADER OF A CULT?\" Robin asked freaking out now. \"Of course I know, it helps that your best friend is the owner of a company that specializes in security cameras.\" Sans said calmly.<br>\r\n<br>\r\nCipher security enterprises <br>\r\n\"Why can't I get the job mister cipher?\" Inigo asked and Bill just laughed. \"What's so funny?\" \"Do you think I would trust your resumé, your so stupid it's funny, kid I know your search history, and I think it'd make the female workers uncomfortable if they have to work with someone who looks at porn and I don't trust you since you peep on my best friends niece and sister in law, and wife and friends.\" Bill explained. \"Wait isn't knowing that stuff illegal?\" Inigo asked. \"Not if your best friends cousin in law the leader of a cult.\" \"Now get out of my office and never show your face around here you useless piece of perverted white trash.\" Bill said. \"There goes another job interview down the drain.\" Inigo said as he left. Bill sighed and rested his feet on the table. \"I love owning a company, it allows me to not to work with people I don't like.\" Bill said.<br>\r\n<br>\r\nBack to the pool (again)<br>\r\nSans walked up to noire and placed his ear on her stomach. \"Hey kiddo how are you doing in there? Are you comfortable or not?\" Sans asked and he heard a reply. \"Hey papa, I'm..\"</span></div></div>",
            "created":1464238800,
            "id":2154595,
            "title":"Swallowing children = angry parent (usually)"
        },
        "14313212112":{
            "choices":[
                "More swimming",
                "Something unexpected happens"
            ],
            "content":"<div class=\"\"><div> <span>For a five year old who was 3/5 of an inch tall Century was a really good swimmer. It kind of helps since his mother Aversa, was a fan of long swims so she made sure that Century knew how to swim and he did it often in the hot tub Aversa pestered Sans into getting. He swam with both speed and grace it helped that he inherited his fathers stamina and speed, once Century managed an impossible feat of running on water albeit it was only for about ten seconds before he started drowning.<br>\r\n<br>\r\n\"I think somebody put a mako shark in the pool.\" Tharja said a tiny but worried (although she will deny it later). \"Nah, it's just Century, the little fella could possibly make the olympics if it weren't for his size and age.\" Morgan said and Century who wasn't paying attention to his surroundings accidentally bumped into Lucina's breast. \"Sorry cousin Luci.\" Century apoligized after he climbed onto said breast to get a breather.<br>\r\n\"Don't worry about it little guy, Morgan did it too when we used to bathe together because mom was afraid he would drown if he took a bath alone.\" Lucina teases. \"Luci! Well you embarrassed me so everyone listen to this!\" Morgan said. \"On Lucina's 21st birthday she got drunk off her first <u>legal</u> sip of alcohol she mistook me for a marshmallow and ate me.\" Morgan said with a smug grin towards Lucina. \"What do you mean by legal?\" Robin asked with her and Chrom glaring at Lucina. \"Okay I had it before I turned 21 but that's because of a dare by Severa.\" Lucina said.<br>\r\n<br>\r\n\"And speak of the devil!\" Tharja said as Severa and her parents, Cordelia and Frederick, came into the pool. \"Hey you guys, Century look who's here.\" Severa said placing her five year old son Sora (who is the same height as Century) on Lucina's breast next to Century. \"Sora! \"Century!\" The two five year olds gave each other a bear hug. Your wondering how could 19 year old Severa be a mother? Well you see when she was 13 the grimleal kidnapped her and injected some strange something into her creating Sora. (Grima was unaware of this and fired the people who were responsible and helped Severa's family with child support) \"aww they look so cute toghether.\" Noire said and Cordelia who was standing next to her nodded in agreement.</span></div></div>",
            "created":1464670800,
            "id":2156853,
            "title":"Just keep swimming "
        },
        "1431321212":{
            "choices":[
                "Continue focusing on Morgan, Century, and the others",
                "Skip to Bill and Grima's wedding"
            ],
            "content":"<div class=\"\"><div> <span>\"Sans, I've been looking for you.\" Bill said running up to his friend. <span style=\"font-family:comic sans ms, cursive\">\"What happened that requires you to run so fast?\"</span> sans asked. \"I'm getting married!\" Bill said bursting with joy. <span style=\"font-family:comic sans ms, cursive\">\"That's nice pal,so who's the unlucky lady?\" </span> sans asked. \"Grima!\" Bill said. <span style=\"font-family:comic sans ms, cursive\">Okay, I'm just gonna use the portable teleported my late father left me (san's father was the Royal scientist in undertake) and tell everyone what just happened.\"</span> sans said before using his teleport ring (for your information it's on his right ring finger while his wedding ring is on his left ring finger)<br>\r\n<br>\r\nAt the pool.<br>\r\n\"Marco!\" Lucina said. \"Polo!\" Morgan and century said giggling as they were literally centimeters away from Lucina. Lucina then turned around and used her breasts to catch the two small boys. \"Gotcha.\" Lucina said opening her eyes smiling at the her younger brother and cousin squirming between her breasts. <span style=\"font-family:comic sans ms, cursive\">\"Aversa! Bill and Grima are getting married!\"</span> sans said jumping over the fence. \"Aunt grima's getting married?\" Century asked. (Even though they are second cousins Lucina, century, and Morgan call Grima aunt Grima instead of cousin Grima, because Grima is only two years older than Robin so it would be awkward to call her cousin). \"That's amazing!\" Morgan said getting out of Lucina's grip and climbing onto her breast.<br>\r\n<br>\r\n\"I told Sans the good news, more than likely he rushed to tell aversa and the others.\" Bill said while sitting next Grima. \"So how did the grimleal react?\" Bill asked. \"Let's just say it was interesting.\" Grima said.<br>\r\n<br>\r\n\"Good news everyone, I'm getting married!\" Grima announced. \"Lady Grima is getting married, who is worthy of you?\" One of the grimleal asked. \"Bill cipher.\" Grima said. \"That little blond motor mouth, he is not worthy of you, he is lily liveried outlandish fool is only a grain of sand compare to you!\" One of the other grimleal said. \"We'll deal with it, I'm getting married and you have to get used to him being my second in command.\" Grima said rather annoyed her employees(?) were dissing her fiancé.<br>\r\n<br>\r\n\"Well I don't care what they say your witty humor and chaos help brighten up my life.\" Grima said leaning on Bill's smaller form (Bill in this is human and about the same height as sans who is also human, and they are both shorter than their wife/fiancée because they are both tall for women and sans and Bill human are just scrawneir than the average man). \"Well thanks, besides, I need a woman who isn't afraid to back down, a stubborn, determined lady to help prevent me from doing something dumb with my life. Also your drop dead gorgeous.\" Bill said. \"Why you little.\" Grima said putting bill in a head lock and giving him a noogie.</span></div></div>",
            "created":1464411600,
            "id":2155259,
            "title":"Congrats"
        },
        "1431322":{
            "choices":[
                "Who is worthy to fight Morgan?",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if someone challenges Morgan to a dual</span></div></span></div>",
            "created":1463461200,
            "id":2149637,
            "title":"A dual perhaps?"
        },
        "14313221":{
            "choices":[
                "Go swimming",
                "Build sand castles "
            ],
            "content":"<div class=\"\"><div> <span>Morgan decided this was the worst vacation he's been on ever. He was on the beach running for his life bruised and bleeding from a skeleton a whopping six times his height. \"GET BACK HERE HUMAN AND FIGHT ME!\" The Skelton yelled. \"I don't want to fight you.\" \"WELL YOU DID NOT ACCEPT MY OFFER FOR A COOKING CONTEST!\" \"That's because I don't have any cooking utensils, now can you please let me enjoy my vacation?\" \"YOU DON'T GET YOUR VACATION UNTIL I BEAT YOU IN THIS DUAL AND THEN I CAN TAKE YOUR TITLE AS MOST AMAZING PERSON IN THE UNIVERSE LIKE SANS SAID YOU HAVE THAT TITLE!\" \"I don't know what your talking about, even if I did accept your challenge I'm horribly underarmed, I don't have any weapons on me and I'm only wearing a swimsuit and you keep on shooting bones at me.\" Morgan said ducking from a bone spear. \"SANS TOLD ME YOU CAN USE MAGIC NOW USE MAGIC TO TRY AND DEFEAT THE GREAT PAPYRUS!\" \"I don't know how magic works where you come from but here I just can't straight up use magic without tomes.\" \"Mom! Luci, save me!\" Morgan yelled finally reaching his destination climbing up a giant beach chair. \"HA CLIMBING UP A GIANT BEACH CHAIR WON'T SAVE YOU FROM MY SPECIAL ATTACK! WAIT DID THE NARRATOR SAY GIANT BEACH CHAIR?\" Papyrus asked. Yup. Two women sitting in the beach chairs turned around revealing a white haired woman and a shorter blue haired woman. Papyrus realized that he has made a horrible life choice. You see Morgan isn't your average adorable ten year old tactician, he was a adorable ten year old tactician who was born tiny now at ten years old reaching a pitiful height of one inch tall so that would make papyrus 6 inches tall. \"Mom, Luci there's this scary guy who's trying to hurt me.\" Morgan said whimpering to his mother and sister. \"HOW FREAKING DARE YOU TRY TO HURT MY LITTLE BROTHER THERE WILL BE CANSQUENCES!\" Lucina screamed at how some one was horrible enough to try and hurt her baby brother. \"Now, now Luci you don't need to scream we can solve this problem easily.\" Robin said calmly but with blazing anger in her eyes. Robin picked up papyrus by the head and flung him as hard as she can into the ocean. \"ALPHYS YOU MESSED UP THE SETTINGS!\" Papyrus screamed before hitting the ocean with a plop. \"There problem solved, now Morgan I said I would of let you explored on your own if you stayed out of trouble but clearly you did something wrong.\" Robin said. \"I did he just came out of no where and challenged me to a cook off but I said no, so he started chasing me and throwing bones at me.\" Morgan explained. \"Well either way I made a mistake of leaving you alone on the beach now where going to the medic tent and get you fixed up, afterwards your going to spend time on the beach with me and your sister, okay baby?\" \"Okay mom.\"<br>\r\n<br>\r\nAfter Morgan got cleaned up and has some medical attention to treat the cuts (bones can be suprisingly sharp) Robin and Lucina were lying on the beach chairs trying to get a tan with Morgan laying on his sisters stomach. \"I'm bored I want to go do something laying people here is boring.\" Lucina complained. \"Okay then what do you want to do then?\" Robin asked.</span></div></div>",
            "created":1463461200,
            "id":2149646,
            "title":"Beach time "
        },
        "143132212":{
            "choices":[
                "Robin comes back with ice cream",
                "Lucina and Morgan have alone time"
            ],
            "content":"<div class=\"\"><div> <span>\"How about we build sand castles mother?\" Lucina asked and Robin responded \"That sounds like a good idea lets go get some shovels and buckets\" Robin said. They got up and went to go get supplies.<br>\r\n<br>\r\nAfter they got shovels and buckets (which they brought from home as the ones Anna was selling were overpriced) and they found a good spot. Sometime after Robin and Lucina made some castles Morgan asked. \"Is there anything I can do to help?\" Morgan asked. \"Thanks but no thanks sweetie me and Luci are doing fine on our own.\" Robin said smiling at her miniscule son. \"Once again I'm useless\" Morgan said and Lucina picked him up and dangled him above her mouth. \"Useless little boys do have one use; they make a great appetizer.\" Lucina said playfully. You see Morgan suffered a lot from low self confidence and self esteem so much Robin and Lucina came up with a plan. Every time Morgan said something negative about himself Lucina or Robin would have him say three good things about himself or he gets eaten and have a mountain of food crush him (Morgan was immune to digestion and actually enjoyed getting eaten so if he does get eaten for saying something negative he gets crushed with a bunch of food that gets eaten so it makes it uncomfortable). \"I think after this I'll probably eat a gallon or two of ice cream.\" Lucina said while slowly lowering Morgan into her mouth. \"Better hurry up Morgan or you'll get frostbite.\" Robin warned and Morgan quickly said three good things about himself. \"I'm cute, I give good massages and everyone is happy when their near me.\" Morgan said and Lucina placed Morgan on top of one of the sand castles. \"There now hold down the castle while your sister and I get ice cream for all of us.\" Robin said and she Lucina walked off.<br>\r\n<br>\r\nSome time later<br>\r\n<br>\r\n\"HUMAN! I Am READY FOR OUR DUEL I BELIEVE THAT YOU HAVE HAD PROPER TIME TO PREPARE YOURSELF.\" Six inch tall papyrus said coming out of the ocean. \"Cmon why can't you leave me alone?\" Morgan asked. \"BECAUSE FOR IT'S FOR THE SAKE OF MY PRIDE! NOW DODGE THIS!\" Papyrus said before summoning a flurry of bones towards Morgan who jumped backwards off the castle and landed behind it. \"MOM, LUCI! The scary guy is back.\" Morgan cried and luckily someone came. \"So you think that once my baby brother is alone you can just come along and try and hurt him?\" Lucina asked. \"WELL YOU SEE THIS HUMAN HAS THE TITLE OF MOST AMAZING PERSON IN THE UNIVERSE, SO I. THE GREAT PAPYRUS, PLANNED ON DEFEATING HIM AND TAKING THE TITLE FOR MYSELF!\" Papyrus explained. \"Even if that is true that is not a valid excuse, and you know what happens to people who try to hurt my Morgan?\" Lucina asked. \"They meet falchion.\" Lucina said and she grabbed falchion from her beach chair, grabbed papyrus threw him up in the air and swung falchion like a baseball bat sending papyrus flying. \"DARN YOU HUMAN, I WILL BE BACK EVENTUALLY!\" Papyrus said as he was flying through the air. \"Where's mom Luci?\" Morgan asked as Lucina picked up her brother. \"Oh she sent me back here in case if something bad happened, mother's intuition I guess?\" Lucina said.</span></div></div>",
            "created":1464238800,
            "id":2154495,
            "title":"Say three good things about yourself or get eaten"
        },
        "14313222":{
            "choices":[
                "Interesting",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if Lucina and Aversa were forced to work together?</span></div></span></div>",
            "created":1464152400,
            "id":2153933,
            "title":"Working together "
        },
        "143132221":{
            "choices":[
                "Cuddle",
                "Play a game"
            ],
            "content":"<div class=\"\"><div> <span>\"So why are we here again?\" Aversa asked her sister Robin when she was led to her room along with Robin's daughter Lucina. \"I have noticed that you two have been causing lots and lots of damage in the castle, There have been explosions and lots of priceless things broken because you two keep on fighting.\" Robin said. \"It's not my fault, don't you know she's partly responsible for the apocalypse.\" Lucina said her arms pointing to aversa. \"That was back then Luci, forgive and forget, anyway as you know it's Chrom's and I's third wedding anniversary is coming up, so what I want as a present from both of you is for you two to start getting along while I'm on my vacation.\" \"WHAT!?\" Aversa and Lucina said at the same time. \"Yep, also I thought of the perfect thing that could get you two to get along, you have to look after a tiny Morgan <u>TOGHETHER</u>.\" Robin said. \"Wait how would you know that Morgan would agree to this?\" Aversa asked. \"Because you two are in his top five list of favorite people and he would be willing to do anything for you two to get along, also I already talked to him about it and he agreed.\" Robin said. \"Hi.\" A tiny Morgan about three inches tall popping out of Robin's cleavage. \"OH MY GOSH HE'S SO CUTE!\" Lucina said grabbing the tiny Morgan and rubbing him against her cheek. \"I can't believe it Robin, you just made my adorable nephew even more adorable how's that even possible?\" Aversa asked after she grabbed the ten year old and placed him on her chest getting a pout from Lucina. \"Well at least you two can agree on one thing. Anyway I'm going now and don't make sure to kill anyone, bye.\" Robin said giving a kiss on the cheek to Lucina and aversa and giving a really big kiss to Morgan.<br>\r\n<br>\r\n\"Okay whether we like it or not we're stuck toghether so we probably need to find something for us to do that we can agree on.\" Aversa said. \"I know what we can do.\" Morgan said. \"And what's that?\" Lucina asked</span></div></div>",
            "created":1464152400,
            "id":2153944,
            "title":"A meeting"
        },
        "1432":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "Yeah",
                "A different game"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then how about Fire Emblem Fates?</span></div></span></div>",
            "created":1463461200,
            "id":2149369,
            "title":"Fates?"
        },
        "14321":{
            "author_id":"anthonyhu",
            "author_name":"George",
            "choices":[
                "shrink",
                "GROW"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Shrink or grow?</span></div></span></div>",
            "created":1464152400,
            "id":2153988,
            "title":"corrin and Co."
        },
        "143212":{
            "author_id":"mattdruzian",
            "author_name":"MattDruzian",
            "choices":[
                "Nohr",
                "Hoshido"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nohr or Hoshido?</span></div></span></div>",
            "created":1471323600,
            "id":2196806,
            "title":"GROW"
        },
        "14322":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the latest release? Fire Emblem: Three Houses </span></div></span></div>",
            "created":1565326800,
            "id":2699590,
            "title":"Three Houses"
        },
        "143221":{
            "author_id":"penslayer5",
            "author_name":"PenSlayer5",
            "choices":[
                "Black Eagles",
                "Blue Lions",
                "The Leicestor Alliance "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose your side</span></div></span></div>",
            "created":1565326800,
            "id":2699591,
            "title":"Who will you side with?"
        }
    },
    "info":{
        "author_id":"shadow321",
        "author_name":"Ichigo",
        "brief_description":"Wanna see the fire emblem guys and girls go through some size changes? I do",
        "created":1307850660,
        "description":"<td align=\"left\" class=\"norm\">*This story just started so give it time to grow* *I will be adding at lest TWO (2) chapters a day so if you want to watch expect that everyday unless something comes up*<br>\r\n<br>\r\n<br>\r\nWell Fire Emblem is one of my favorite video games and i have seen very little GTS material...so i decided to create it myself, is there really that much to say? anyway on to the rules:<br>\r\n<br>\r\nRule 1: NO Short chapters. I can not tell you how many times ill be reading a good stories and ill get a chapter with like 1 sentence that doesnt lead into other choices or anything so please make chapters decently lengthed<br>\r\n<br>\r\nRule 2: No gay stuff. I just dont like it it's as simple as that<br>\r\n<br>\r\nRule 3: Try not to kill off the character too early, but remember that even though they're video game characters they can't survive everything<br>\r\n<br>\r\nother then that go crazy i guess </td>",
        "id":1784415,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1565393460,
        "pretty_title":"Fire Emblem Size Changing"
    }
}