{
    "chapters":{
        "1":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Johnny",
                "Gil",
                "Dukey"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is it! Choose a charecter to shrink/grow</span></div></span></div>",
            "created":1295067600,
            "id":1036078,
            "title":"Choose your charecter"
        },
        "11":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Johnny shrink or grow?</span></div></span></div>",
            "created":1295067600,
            "id":1036079,
            "title":"Johnny"
        },
        "111":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Butt",
                "Balls",
                "Mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Johnny was on his bed playing video games when a bright light shines on him and he blacks out. He awakens to find he is in somewhere that is hot and slimy. He quickly realizes he's in someone's ...</span></div></span></div>",
            "created":1392008400,
            "id":1743125,
            "title":"Shrink"
        },
        "1111":{
            "author_id":"miningmitch20",
            "author_name":"MiningMitch20",
            "choices":[
                "Used as a dildo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And then he hears his sisters taking so he knows he was under Marys butt<br>\r\n</span></div></span></div>",
            "created":1498280400,
            "id":2342015,
            "title":"Butt"
        },
        "11111":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Mary",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who uses him as a dildo?</span></div></span></div>",
            "created":1529864340,
            "id":2511452,
            "title":"Used as a dildo"
        },
        "1112":{
            "choices":[
                "Yes, balls",
                "No, pussy",
                "No, in the lab"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure that you want balls?</span></div></span></div>",
            "created":1484974800,
            "id":2267214,
            "title":"Are you sure?"
        },
        "11121":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Dukey...",
                "Gil..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whos balls?</span></div></span></div>",
            "created":1508302800,
            "id":2403292,
            "title":"Yes, balls"
        },
        "11122":{
            "choices":[
                "Susan or Mary ",
                "Sissy"
            ],
            "content":"<div class=\"\"><div> <span>Johnny wakes up in a dark, hot, humid place. \"Where the hell am I?\" Says Johnny as he tries to stand up. Suddenly, he hits his head on what seems to be the ceiling. Just then the room illuminates and Johnny is grabbed and brought up to a colossal face.<br>\r\n<br>\r\nWho is it?</span></div></div>",
            "created":1484974800,
            "id":2267217,
            "title":"Pussy "
        },
        "111222":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Butt",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey johnny did you like being that close to my pussy?\" Asked sissy \"NO,\" johnny screened. \"Well then I might know a place that you will like,\" said sissy as she starts to lower him.</span></div></span></div>",
            "created":1527742800,
            "id":2501065,
            "title":"Sissy"
        },
        "1112221":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Susan came up behind her and saw the whole thing",
                "Sissy went home to enjoy her little \"pet\" in different ways "
            ],
            "content":"<div class=\"\"><div> <span>Johnny is brought to the back side of her. Then she grabs her pants and panties and drops him into her humongous rear. \"Sissy let m-,\" he was cut off as she released her grip on her pants trapping him in the dark squished against her right butt cheek. \"Oh johnny you feel really good back there squirming around,\" said sissy as she moaned from the pleasure.</span></div></div>",
            "created":1527742800,
            "id":2501073,
            "title":"Butt"
        },
        "1112222":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Boobs",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1527742800,
            "id":2501067,
            "title":"Other"
        },
        "11122222":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Feet",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about </span></div></span></div>",
            "created":1527742800,
            "id":2501068,
            "title":"Other"
        },
        "111222221":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "No...",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sissy puts Johnny in her sock</span></div></span></div>",
            "created":1528088400,
            "id":2502728,
            "title":"Feet"
        },
        "1112222213":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Her shoe?",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is Johnny gonna be in?</span></div></span></div>",
            "created":1577088480,
            "id":2763471,
            "title":"Other"
        },
        "11122222132":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Yes!",
                "Next "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about if Sissy taped Johnny to the bottom of her bare foot and then put her sock over him and shoved her foot back in her shoe and went off to exercise?</span></div></span></div>",
            "created":1577088600,
            "id":2763473,
            "title":"Other"
        },
        "11123":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "On a chair",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you in the lab?</span></div></span></div>",
            "created":1529816400,
            "id":2511449,
            "title":"No, in the lab"
        },
        "1113":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Jump out and run to see the face of the person he was almost eaten by",
                "Stay put and let nature run its course. ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Johnny quickly realized he is in a mouth, but who's? He runs to the teeth and pounds on it as it opens to let food in.<br>\r\n<br>\r\nWhat does he do?</span></div></span></div>",
            "created":1577088960,
            "id":2763476,
            "title":"Mouth"
        },
        "11131":{
            "author_id":"mikereaux",
            "author_name":"MikeReaux",
            "choices":[
                "His mom",
                "Miss X"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The same woman of his sexual desires....</span></div></span></div>",
            "created":1583908140,
            "id":2799869,
            "title":"Jump out and run to see the face of the person ..."
        },
        "112":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Kill susan and marry",
                "Rampage town"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Johnny wakes up in his sisters lab. \"Woah!\" Johnny exclaimed. \"Im like 60 feet tall!\" Indeed, said marry. \"Hmm....what should I do?\" thought johnny.</span></div></span></div>",
            "created":1295067600,
            "id":1036080,
            "title":"Grow"
        },
        "1121":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Put them in his briefs (back)",
                "Put them in his briefs (front)",
                "Step on them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he kill them?</span></div></span></div>",
            "created":1295067600,
            "id":1036082,
            "title":"Kill susan and marry"
        },
        "11211":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "He breakes out of the house and goes on a rampage",
                "He realizes hes hungry"
            ],
            "content":"<div class=\"\"><div> <span>Johnny had a large smile on his face. \"What are you thinking?\" Asked the sisters. \"Oh nothing, I just remembered I had a bean broccoli burrtio!' Said johnny. Marry and Susan knew what this meant and ran for the door screaming. Johnny snatched them up. He brought them to eye level. He had a huge smile on his face. \"IM finally gonna get my revenge on you two for all those years of experiments!\" said johnny. The sisters wouldnt stop screaming. \"It will all be over soon!\" Said johnny. He pulled the elastic on his extremely tight briefs, dumped then in and let go. Susan and marry were squeezed against the tight, firm, golden, gassy buns of johnny. They heard his stomach rumbling. \"Here they come!' said johnny. Johnny let out a monsterous 20 second long fart on susan and marry. The briefs were very tight so they inflated with toxic gass. They barley had time to scream and squrim, they were dead within seconds of the warm, stinky fart. Johnny threw the dead bodies away and then...</span></div></div>",
            "created":1295067600,
            "id":1036087,
            "title":"Put them in his briefs (back)"
        },
        "112112":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "go out to town to have a little \"snack\"",
                "Eat his dad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Johnnys stomach starts to rumble. He decides to...</span></div></span></div>",
            "created":1295067600,
            "id":1036089,
            "title":"He realizes hes hungry"
        },
        "11212":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Kill his parents",
                "Eating rampage"
            ],
            "content":"<div class=\"\"><div> <span>Johnny felt a huge sense of power! Dukey was watching so he wanted to assert his dominance. He said to dukey \"watch and learn!\" His underware was extremly tight and an enormous bulge was present. He snatched the screaming girls up and dropped them in the front of his briefs. They sqirmed alot being pressed against johnnys massive penis and balls. His area was huge when he wasent a giant. He would always walk around naked. The squirming caused him to get a boner and squish marry into a bloody wreck. Susan thought she was smart and hit under his balls. She realized they were too heavy and she couldnt escape, and was smothered. \"That was amazing!\" Said dukey. Johnny thought he needed to move on.</span></div></div>",
            "created":1295067600,
            "id":1036122,
            "title":"Put them in his briefs (front)"
        },
        "112121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Eat them",
                "Step on them",
                "sit on them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he plan to kill them?</span></div></span></div>",
            "created":1533313380,
            "id":2528590,
            "title":"Kill his parents"
        },
        "1121211":{
            "author_id":"giantessmeal",
            "author_name":"Giantessfan25",
            "choices":[
                "They were going to find Sissy",
                "They were going to find Bumper",
                "They were going to cause mayhem",
                "They were going to find Johnny some food",
                "They were going to find Jillian"
            ],
            "content":"<div class=\"\"><div> <span>Johnny thought about how to get rid of his parents. They were too strict and always yelled at him. After thinking about it for a minute, Johnny decided the best way would be to devour them. After all, he was pretty hungry. Meanwhile, Dukey was going crazy. The giant picked him up, causing his dog to become afraid.<br>\r\n<br>\r\n“YOU KILLED SUSAN AND MARY! ARE YOU OUT OF YOUR MIND?” He yelled. Johnny smiled and shook his head.<br>\r\n<br>\r\n“No, I’m just extremely powerful.” He said. He started to pet Dukey softly with one finger, causing him to shudder. “Now, since you’re my best friend I’ll give you a choice. You can become my personal servant and help me with my fun or I can crush you under my foot. If you want the second option, I’ll make it quick and painless.” Johnny explained.<br>\r\n<br>\r\nDukey thought about his options. He knew Johnny was being honest when he said he would give him an easy death. The power had gone to his head but the giant still had feelings for his friend. The dog also realized that it might be fun and rewarding to help Johnny. After a moment, he sighed.<br>\r\n<br>\r\n“Ok Johnny, I’ll help you. Just promise you won’t hurt me.” Dukey said.<br>\r\n<br>\r\n“Only if you betray me.” Johnny smiled and set Dukey down. “Now, I want you to bring my parents here. It’s time I dealt with them.” He said. Dukey nodded and did as he was told. As he waited, he pulled out Susan’s dead body.<br>\r\n<br>\r\n“You shouldn’t have done all of those experiments on me. I’m not just some guinea pig.” Johnny said. He gave her a kiss before setting her on the ground. He moved his foot over her and completely crushed her body.<br>\r\n<br>\r\nWithin a few minutes Dukey (acting like a dog) brought his parents out. They were shocked when they saw his size. His father stomped up to him, pissed off. The giant smiled, knowing his dad couldn’t do anything.<br>\r\n<br>\r\n“Johnny! What did I say about becoming a giant? And where are your sisters!? They are so grounded!” He yelled.<br>\r\n<br>\r\n“Don’t worry about them. Instead, worry about yourselves.” Johnny said, picking up his parents. They started to struggle, unaware of the danger they were in.<br>\r\n<br>\r\n“Johnny! Put us down this instant!” His mother yelled. The giant chuckled.<br>\r\n<br>\r\n“Sorry but I don’t have to listen to you. Instead, I have a better idea.” Johnny licked his lips, eyeing his parents. It took them a few moments to realize what he meant. When they did, they started to struggle even more.<br>\r\n<br>\r\n“JOHNNY! ARE YOU OUT OF YOUR MIND?” His father screamed.<br>\r\n<br>\r\n“No, I’m just hungry.” He responded. Johnny tossed his father in and closed his mouth tightly. His mother watched in horror, imagining what her husband was going through. The giant tossed the man around, making sure he got a good taste. After a minute, he swallowed and gave a happy sigh.<br>\r\n<br>\r\n“Meh, I didn’t really care for his taste. Maybe you’ll taste better.” Johnny said. He gave her slow lick, causing the woman to shudder. “Hm, maybe you’ll be tastier without your clothes.” The giant started to reach for her, causing the woman to scream.<br>\r\n<br>\r\n“Wait! At least let me do it!” His mother yelled, causing the boy to hesitate. “If you’re going to eat me, at least let me get myself ready.” Johnny nodded and held her in his open hands. <br>\r\n<br>\r\nThe woman hesitated but eventually started to strip herself. She worked slowly, sad and afraid. As more skin was revealed, the giant smiled. Thoughts went through his mother’s mind. She was now just a piece of candy to him. It had also occurred to her that he might have done something to her daughters, but she didn’t want to know what. Once she was completely naked, she looked up at her son once more.<br>\r\n<br>\r\n“Ok, I’m ready.” She said softly. Johnny brought her up to his mouth and gave her a lick. His tongue felt slimy but soft. His mother crawled in, causing him to close his mouth shut. He tossed her around, loving her taste. Johnny tasted her for a few minutes before swallowing. The giant gave a burp and smiled.<br>\r\n<br>\r\n“Wow, she tasted really good!” He said. Dukey looked towards the city, then back at the giant.<br>\r\n<br>\r\n“So…what’s your plan now?” He asked. The giant gave him a smile.</span></div></div>",
            "created":1575733740,
            "id":2756608,
            "title":"A new servant and a good meal"
        },
        "11213":{
            "author_id":"dra90n68",
            "author_name":"Mladenovic5@live.com",
            "choices":[
                "Squish",
                "EAT"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\">step or eat</font></span></div></span></div>",
            "created":1503378000,
            "id":2373193,
            "title":"Step on them"
        },
        "112132":{
            "author_id":"dra90n68",
            "author_name":"Mladenovic5@live.com",
            "choices":[
                "Look to for things to break",
                "Continues hunting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Johnny did not hesitate, he grabbed Susan and Mary and took off their cloths, now naked Johnny tossed them in his mouth, tasting them, they taste good.<br>\r\nOnce done Johnny swallows the two and let them digest for knowledge.</span></div></span></div>",
            "created":1503378000,
            "id":2373205,
            "title":"EAT"
        },
        "1122":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "vengance",
                "Meets Gil",
                "Torture more people"
            ],
            "content":"<div class=\"\"><div> <span>Johnny broke out of the house and ran to the center of town. \"AWESOME!\" said johnny. He picked up some screaming people and dangled them over his open mouth, then swallowed them alive with a gulp. \"mmm\" said johnny. Then he put around 5 people in his stinky sweaty armpit and laughed at thier screaming. He closed it shut. The smell of the hellish, smelly, very sweaty armpit was worse then any smell ever. They died whithin seconds and stopped screaming and squirming. After that he made a group of people smell his enourmous sweaty feet. Most of them died smellying it and the rest fled. The fleerers were sentanced to be gassed. Johnny tossed them in the back of his extremly tight briefs and snapped the elastic shut. He uttered an enourmous silent fart. \"Ahhh.\" moaned johnny with a smile. The fleeres tried to hide from the smell. One tried to hide under johnnys HUGE sweaty, stinky ballsack. Johnny laughed and picked him up. He shoved him up his butthole. Johnny laughed at the feeling of the man screaming and squirming and struggling the in his anal cannal, strugling for air.   The people with blood coming out there eyes from the fart died shortly after. Johnny was satisfied with the hallocoust he created with his butt, feet, and mouth. \"Hmm...What should I do now?\" asked johnny.</span></div></div>",
            "created":1295154000,
            "id":1036509,
            "title":"Rampage town"
        },
        "11221":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "No! Stick with this one!",
                "Yes! Another story!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about an alternative story?</span></div></span></div>",
            "created":1513659600,
            "id":2430229,
            "title":"vengance"
        },
        "112212":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Story 1",
                "Next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a story</span></div></span></div>",
            "created":1513659600,
            "id":2430233,
            "title":"Yes! Another story!"
        },
        "1122121":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Growing! Giant Johnny!",
                "Shrinking! Tiny Johnny!"
            ],
            "content":"<div class=\"\"><div> <span>Johnny grumbles as he walks in, saying \"Dukey! I need to get taller! I can't take being short anymore!\" then he rushes to the lab. Dukey was good and asleep, however.<br>\r\n<br>\r\nJohnny begins to rummage through the lab, looking for some sort of growth ray. He finds a growth ray and takes it back to his room, trying to figure out how it works..<br>\r\n<br>\r\nDoes he end up growing or accidentally shrinking?</span></div></div>",
            "created":1520226000,
            "id":2460647,
            "title":"Story 1"
        },
        "11221211":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Zap Sissy! Make her the biggest, or second biggest!",
                "Zap himself again! This school is too small!"
            ],
            "content":"<div class=\"\"><div> <span>Johnny let out a laugh as he pulled the trigger.<br>\r\n<br>\r\n\"Bigger!\" He yelled out, shooting up to 7 ft before he let go of the trigger.<br>\r\n<br>\r\nHe looks down at his shoes and says \"Well that kinda stinks. I liked those shoes.\" as he picks up the shredded remains.<br>\r\n<br>\r\n\"Time to see how they like me at school!\" He says.<br>\r\n<br>\r\nThe next day, at school, he had become the most popular guy in school, the tallest too! The second tallest person in school, was a female, standing about 6 ft 6. <br>\r\n<br>\r\nJohnny had a big idea.</span></div></div>",
            "created":1527742800,
            "id":2501484,
            "title":"Growing! Giant Johnny!"
        },
        "11223":{
            "choices":[
                "Pee on the highway",
                "Crush cars with his feet"
            ],
            "content":"<div class=\"\"><div> <span>Johnny sees a group of people running away from him. He reaches down and picks them up. They are brought to the evil boys smiling face. <br>\r\n\"I feel kinda gassy, hehe.\" Johnny pats his stomach as the people scream in fear. He brings them up to his mouth and...<br>\r\n*BUUUUUUUURRRRPPPP* \"Ahhhh\" Johnny burped in all of their faces and he was using his free hand to waft to smell over to them. Everyone in his hand was coughing and gagging from the stench.<br>\r\n\"That was a chunky one!\" <br>\r\nHe started gathering up saliva in his mouth until he had a huge glob up at his lips. Slowly, he lets the drool fall out of his mouth onto the people in his hand. They scream as they get pelted with Johnnys sticky spit. <br>\r\n\"Now that youre nice and lubed up, youll go down my throat easier!\" Says Johnny. The frightened citizens start to squirm as they hear this, knowing that they are about to become an evil boys snack. <br>\r\nJohnny holds his fist if victims over his mouth and breathes his hot, smelly breath on them. He slowly releases his grip, letting the tinies fall onto his maw. <br>\r\nAs soons as they are all in his mouth, he snaps it shut, tilts his head back and gulps loudly. <br>\r\n\"Ahhh, another great meal of squirming little bugs.\" Johnny hears his stomach rumble.<br>\r\n\"I have to take a dump.\" He says<br>\r\nJohnny spots a news helicopter flying his way and quickly grabs it out of the air.<br>\r\n\"Looks like someones gonna get to be my toilet!\" Says Johnny happily. <br>\r\nThe three people in th news chopper scarmble for their parachutes in a desperate attempt to escape, but it was too late. Before they knew it, Johnny had already put the chopper in the back of his underwear. <br>\r\n\"Here it comes!\" <br>\r\nJohnny tightens his cheeks and squats down, and after letting out a long silent, putrid fart on his captives, he takes a massive shit on the tiny chopper, laughing evilly as he does so. <br>\r\nAfter he is done, Johnny lifts up his leg and releases one more wet fart on the helicopter. <br>\r\n\"Im assuming youre all dead in there, but just in case...\" Johnny stomps over to a crowded highway of cars trying to escape the city. Johnny plants both of his feet down on either side of the freeway, and sits down on it, crushing the helicopter and mixing the scrap metal with his poop, as well as killin several motorists and crushing countless cars under his giant hiney. <br>\r\n<br>\r\nJohnny decides to<br>\r\n<br>\r\n</span></div></div>",
            "created":1351918800,
            "id":1459702,
            "title":"Torture more people"
        },
        "12":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Grew",
                "Shrunk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gill woke up in his bed. \"I feel wierd!\" Said gil. Gil had...</span></div></span></div>",
            "created":1295067600,
            "id":1036091,
            "title":"Gil"
        },
        "121":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "makes people smell his giant sweaty feet",
                "Gassy Gil",
                "Classic rampage"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wow am I angry! Said gil. How does he take his anger out?</span></div></span></div>",
            "created":1295067600,
            "id":1036092,
            "title":"Grew"
        },
        "1211":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Smell his foot and die",
                "Become gills tasty snack"
            ],
            "content":"<div class=\"\"><div> <span>Gil is angered. He breakes open the roof of his house and jumps out. He instantly spots an anaware pedistrian. He instantly snatches the man up and puts him next to his foot. Gil lays his foot ontop of the man to restrain him. \"Smell my feet!\" Screams gil. \"\"If you dont I will eat you!\" The man chooses....</span></div></div>",
            "created":1295067600,
            "id":1036096,
            "title":"makes people smell his giant sweaty feet"
        },
        "12111":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Put people in his armpits",
                "butt torture"
            ],
            "content":"<div class=\"\"><div> <span>The man chooses to smell gils sweaty feet. \"Good choice.\" Gil put the mans face inbetween his 3rd and fourth toes. The man screams. Gil laughs at the mans muffled screams and squirms. \"Im glad you like smelling my feet, I havent washed them in years!!!\" The mans squirms slowly fade. \"Ahhhh.....feels good to torture humans with my feet and then end there pathetic lives\" gil says with a smile. Now what does he do?</span></div></div>",
            "created":1295326800,
            "id":1037912,
            "title":"Smell his foot and die"
        },
        "12112":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "horny ",
                "rampage"
            ],
            "content":"<div class=\"\"><div> <span>The man refuses. This makes gil smile. \"oh is that so!?, I guess you will be my snack!\" \" \"Wait, No! I change my mind!!!\" \"To late!\" said gil. Gil raised the man. Gil licked his lips with a smile. He raised the crying, screaming man over his hungry, open mouth. The man was dangling for a good 10 seconds. Gil finally dropped the man in his mouth and swallowed with a loud gulp. \"Mmmm...\" Said gil. He then let out a loud belch. Gil was pleased. \"Hmm...I want to torture other tiny humans! I am feeling horny, then again I want to go rampaging...</span></div></div>",
            "created":1295067600,
            "id":1036114,
            "title":"Become gills tasty snack"
        },
        "1212":{
            "author_id":"legend1",
            "author_name":"levi1234",
            "choices":[
                "Gil farts on more people",
                "rampage"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow am I gassy!\" \"Hmm...I should kill tiny humans with my stinky, hellish farts!\" He spotted a man inna car that said \"just married\" He snatched the car up and emptied the contents. He smiled at the little man and put him in the back of his pants, pushed him in between his golden butt cheeks and welcomed the man with a nice, loud, warm fart with a smile on his face. The man screamed and hid under his ball sack. He smelled ballsweat and tried to get out. He was stuck, gils huge balls were to heavy. He finally got out, gil then farted a huge silent fart, killing the screaming man with blood coming out of his eyes whithin 30 seconds</span></div></div>",
            "created":1295067600,
            "id":1036164,
            "title":"Gassy Gil"
        },
        "122":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Aware",
                "Unaware",
                "New character to shrink."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gil is shrunk but is this aware or unaware?</span></div></span></div>",
            "created":1577089020,
            "id":2763477,
            "title":"Shrunk"
        },
        "1223":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Bling bling boy",
                "Brain freezer",
                "Other. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1577089080,
            "id":2763478,
            "title":"New character to shrink."
        },
        "13":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "susan",
                "mary",
                "johnnys dad",
                "johnnys mom",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>will put dukey in options now who shrinks/grows  </span></div></span></div>",
            "created":1456808400,
            "id":2111811,
            "title":"Dukey"
        },
        "131":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Shrink ",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Susan shrink or grow</span></div></span></div>",
            "created":1527742800,
            "id":2501059,
            "title":"susan"
        },
        "1312":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "She sits on johnny",
                "She goes to find gill",
                "She destroys the town"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Susan wakes up outside \" what happened? Why is everything so small?\" She asked. \"Every thing hasn't shrunk you have just grown,\" said johnny. Susan then thought of all the things she could do...</span></div></span></div>",
            "created":1527742800,
            "id":2501063,
            "title":"Grow"
        },
        "133":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Johnny's dad shrink or grow?</span></div></span></div>",
            "created":1529864220,
            "id":2511451,
            "title":"johnnys dad"
        },
        "1331":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Johnny's mom",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Johnny's dad was cooking his casserole when he started to get dizzy \" I need to sit down,\" he said. He then closed his eyes and fell asleep when he woke up he was only two inches tall. \" what happened to me,\" he said. Then he heard loud bangs then he realized that someone was coming but who was it.</span></div></div>",
            "created":1530239340,
            "id":2513073,
            "title":"Shrink"
        },
        "13312":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Susan",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it.</span></div></span></div>",
            "created":1530239340,
            "id":2513074,
            "title":"Other"
        },
        "133122":{
            "author_id":"piedog",
            "author_name":"Cam Durgin",
            "choices":[
                "Mary",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was it.</span></div></span></div>",
            "created":1530239400,
            "id":2513075,
            "title":"Other"
        },
        "1331222":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Sissy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is it?</span></div></span></div>",
            "created":1577089260,
            "id":2763481,
            "title":"Other"
        },
        "13312222":{
            "author_id":"worker1398",
            "author_name":"Worker1398",
            "choices":[
                "Bling bling boy's mom",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a scary one.</span></div></span></div>",
            "created":1577089320,
            "id":2763482,
            "title":"Other"
        },
        "135":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "dukey",
                "readers choice",
                "readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about </span></div></span></div>",
            "created":1457154000,
            "id":2113192,
            "title":"other"
        },
        "1351":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Grow ",
                "Shrink",
                "Free Choice Chapter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Dukey grow shrink or will something else happen to him?</span></div></span></div>",
            "created":1528088400,
            "id":2502765,
            "title":"Dukey"
        }
    },
    "info":{
        "author_id":"legend1",
        "author_name":"levi1234",
        "brief_description":"Make any charecter shrink/grow!!!!!!",
        "created":1295143860,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\nNo lesbian<br>\r\nkeep vore to a minimum<br>\r\ntry to stay on plot</td>",
        "id":1742177,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583908140,
        "modified":1583908140,
        "pretty_title":"Johnny Test Shrink/Grow"
    }
}