{
    "chapters":{
        "1":{
            "author_id":"silvertop69",
            "author_name":"T",
            "choices":[
                "Run home",
                "Cast a random spell on him",
                "Cast same spell on him"
            ],
            "content":"<div class=\"\"><div> <span>You start walking home, looking through all the different pages. You saw som pictures of sacrifices and gods, but you were really interested in the text. You started saying random things on the page but nothing happened, you knew this thing had to be powerful, but had no idea how to use it. You thought to go to the first page and start reading, maybe you have to trigger a specific spell first. You read the first 3 lines and tense up, dropping the hood to the ground. You felt good, stronger and more awake. You pick the book up and the paragraph you read glows slightly, you knew you triggered something now.<br>\r\n<br>\r\nWhen you almost home, you see a neighbor down the street walking his Yorke. You thought you might as well try something and see what happens. You read, “Illr megin,” and the dog starts shaking. You see it start growing and loosing hair. It’s teeth start growing and getting sharper, untill it’s about 5 times the size and looked like a rabid saber tooth tiger. It jumps on the owner and bites his head clean off, then runs into the woods. Your standing there with your mouth open, not sure what to do.</span></div></div>",
            "created":1601666520,
            "id":2914087,
            "title":"Discovery"
        },
        "11":{
            "author_id":"silvertop69",
            "author_name":"T",
            "choices":[
                "Read more spells",
                "Put it under your bed forever",
                "Read whole first section"
            ],
            "content":"<div class=\"\"><div> <span>You run home panting, seeing 2 people die in one day really heightened your anxiety. You run inside and see Alyssa sitting at the kitchen table. “Are you okay? You seem freaked out. What’s that book?,” she asks. You realize you were sweating like crazy and panting like a dog. “I’m fine, it’s just a text book. I have an online assignment due soon.” You run up stairs and lock your door as fast as you can, then lay in your bed to catch your breath. You look at the book, and feel a lot of different emotions. What do you do with it?</span></div></div>",
            "created":1601693760,
            "id":2914226,
            "title":"Run home"
        },
        "111":{
            "author_id":"silvertop69",
            "author_name":"T",
            "choices":[
                "Móðir Monst ",
                "braksterkrinnr Warr",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look through the book and just look at random spell that you have no idea how to read. You decide to just try one and see what happens.</span></div></span></div>",
            "created":1601785260,
            "id":2914768,
            "title":"Read more spells"
        },
        "1111":{
            "author_id":"silvertop69",
            "author_name":"T",
            "choices":[
                "1",
                "2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You say the spell and nothing happens.. this worries you because it could literally be anything. You decide to put the book down for a while and try to live a normal life. Maybe you shouldn’t mess with something that has this much power. </span></div></span></div>",
            "created":1601785920,
            "id":2914771,
            "title":"Móðir Monst "
        },
        "1112":{
            "author_id":"silvertop69",
            "author_name":"T",
            "choices":[
                "Fast transformation",
                "Slow transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose....</span></div></span></div>",
            "created":1601787240,
            "id":2914777,
            "title":"braksterkrinnr Warr"
        },
        "11121":{
            "author_id":"silvertop69",
            "author_name":"T",
            "content":"<div class=\"\"><div> <span>You read the spell and feel a tingle through your body, it was slight at first put started getting stronger. You feel your jeans getting tighter and your shirt stretching. You look down, and a gut is starting to form, along with you getting wider. Your pants start ripping and your shirt rises up to your breasts. Your hairless body also starts to look like a lumberjacks, along with a huge beard. The chair your sitting in snaps and you hit the ground, sounding like a dresser falling over. You keep growing on the floor until your jeans are completely ripped off and your t shirt looks like a bra. You look at your feet as well, and they split through your shoes. You went from a  size 10 to like a size 16. You get up and look in the mirror, your body looks basically like this but 6’5 height and super hairy.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://ibb.co/G9vz12g\" target=\"_blank\">https://ibb.co/G9vz12g</a><br>\r\n<br>\r\nYou had no idea what you were going to tell your family, your friends, everyone you knew. You went from a 5’8, 160 pound “soy-boy” to a Viking warrior. You go into your closet and look for something that might fit. You’d imagine your like a 3 or 4 XL now, and all your shirts and pants were mediums. You hear the door opening, and you jump in bed and get under the covers. Your mom walks into the room with a box. “Hey honey, your clothes cans in the mail today. I got you 4X shirts and a bunch of 3X sweats because those jeans are too expensive for you to keep ripping.” She looks over at the ripped jeans on the floor. “Why did you even try those on? You knew they wouldn’t fit.” She chuckles and leaves the room after putting the box on your bed. You were so confused, why did she know you were huge now? Does everyone know? You put your new clothes on and go to the bathroom to get on the scale. Earlier you were 160... the scale broke at 400.. You wonder if that means your strong now, so you go into your room and try to pick up a dresser that you could barely push before. It felt like picking up a laundry basket. You realize this could be pretty cool if everyone already accepts who you are. You hear your mom call everyone to dinner, so you go down stairs. You get to the kitchen table and there’s a huge living room chair at the end, along with some wooden kitchen tables. You start to sit on one of the wooden chairs, but halfway down it starts creaking hard. You were starting to realize how huge you are, and thinking of things you could do now you couldn’t before.<br>\r\n<br>\r\nEveryone sits down and you mom brings KFC into the room. “Okay guys here’s our bucket, and here’s your bucket Zeke,” she said. You were surprised, you’ve never eaten more than 3 wings before at a time. You take one bite of a leg and before you realize it you cleaned it. You start devouring chicken faster and faster before you finish the whole bucket before anyone else got to their second piece. “There’s a bowl of mashed potatoes and gravy if your still hungry honey,” your mom says. You grab the gravy and pour it over the whole bowl, grab a wooden spoon, and finish it in under 3 minutes. </span></div></div>",
            "created":1601817540,
            "id":2914890,
            "title":"Fast transformation"
        },
        "11122":{
            "author_id":"silvertop69",
            "author_name":"T",
            "content":"<div class=\"\"><div> <span>You feel a slight tingle through your body, but nothing much. It freaks you out and you put the book in your dresser, not planning to look at it anytime soon. You didn’t even know what this spell was going to do, you just hope it didn’t turn you into some horrible monster. You start to get really tired, which is weird since it’s 7 PM. You lay down and before you can even plug your phone in, you pass out.<br>\r\n<br>\r\nYou wake up the next morning to your mom shaking you.<br>\r\n<br>\r\nMom: Honey wake up, your gunna be late for school. <br>\r\n<br>\r\nYou look up at her looking back at you with a confused face, then walks out. You rub your eyes and feel some fuzz on your face. You look at yourself in your camera and see a short beard. You never had facial hair before, and you figured it definitely has something to do with that spell. You rip the covers off and look down, seeing you have a little bit of a belly now. You were 140 the other day so you thought you might as well check again. You go to the bathroom and stand on it, shocked that it says 165. How the hell did you gain that UCB over night. You look in the mirror and your shirt is pretty stretched out. You notice your arms went from chicken bones to pretty big. You flex in the mirror and your muscles actually pop for the first time ever. You had to get to school, but none of your shirts s fit that well. You go into your brothers old clothes and get an XL AC/DC shirt. </span></div></div>",
            "created":1604204280,
            "id":2932544,
            "title":"Slow transformation"
        },
        "113":{
            "author_id":"silvertop69",
            "author_name":"T",
            "content":"<div class=\"\"><div> <span>You remember when you read the first section, you were able to cast a spell. That means reading more must make you stronger? You start where you left off, feeling more and more powerful the more you read. You try to stop, but somethings keeping you going. You feel different emotionally as well. Your conscience starts deteriorating and the lust for power consumes your mind. You read the whole section after about an hour, and by the time your done, you feel like a whole new person. The only thing you could think of was everyone bending to your will. You felt like you could do anything. </span></div></div>",
            "created":1601870340,
            "id":2915196,
            "title":"Read whole first section"
        }
    },
    "info":{
        "author_id":"silvertop69",
        "author_name":"T",
        "brief_description":"Change and manipulate people and reality with spells in an unknown language.",
        "created":1601665680,
        "description":"<td align=\"left\" class=\"norm\">Your name is Ezekiel. Your a 16 year old boy that’s a Junior in high school, and are walking home with a kid you were starting to become friends with named Jake who moved in not too long ago. You walk to your house and pass a trail you’ve never been on and explain it to Jake. “Let’s go down it, I’m trying to learn more about the area anyway! Maybe we can actually discover something together?” You agree and walk down it. <br>\r\n<br>\r\nAfter about 10 minutes, the trees get thicker and it seems to get darker. You walk up A small hill and see a stone rune with a Trikvetr Knot on it. The boys have no idea what it is, but Jake goes up to touch it. He puts his hand on the symbol and gets entrapped in a closing latch around it. It pierced his arm, making him splutter blood everywhere. The tune starts going into the ground and pulling him down with it. You grab his ankle and pull, but it feels like a semi truck is pulling him under. You slip and loose your grasp and he gets sucked under in seconds, cutting off his screams almost instantly. Your freaking out, you sprint home and grab a shovel and come back within 20 minutes. You knew in anyone found his body, you would be suspect number one for a murder. You start digging, but the ground is hard and takes about 19 minutes to get half a foot. After about an hour and a huge hole, you fall to your knees and start to cry. You don’t know what your going to do, or how your going to explain how he disappeared.<br>\r\n<br>\r\nWhen your about to leave, you see a hand burst from the hole. You fall down in shock, as you see Jake come out of the hole. He looked very different though, with pale/grey skin and black eyes. He walks out with a book that had the same symbol as the rune. “Þinn sacrifice hearneðr þú þessi bók ór limitless makt. Gersemr þú wish mit því.  Takþessir planet aptr fyrir godsrinn.” He then tossed the book in front of you and blows away into pieces of ash. You had no idea what this book was or what Jake’s “body” said, but you knew you had some kind of power wielding this book. And you we’re about to find out what.<br>\r\n<br>\r\n———————————————-<br>\r\n<br>\r\nFamily:<br>\r\n<br>\r\nMom- 45<br>\r\nDad- 49<br>\r\nAlyssa- 24<br>\r\nDerek- 21<br>\r\nMaddy- 14<br>\r\nDani- 9<br>\r\n<br>\r\n———————————————-<br>\r\n**SPOILERS, DONT READ IF YOU WANT AN UNPREDICTABLE EXPERIENCE.**<br>\r\n<br>\r\nTranslations so far:<br>\r\n<br>\r\nEvil strength- Illr megin<br>\r\nMother monster- Móðir Monst <br>\r\nStrong warrior- braksterkrinnr warr</td>",
        "id":2233860,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604204280,
        "modified":1604204280,
        "pretty_title":"Spell Book of Power"
    }
}