{
    "chapters":{
        "1":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Aang/Katara/Zuko tortured by Fire Lord Ozai or The Boulder.",
                "Timmy /Vicky/Mr. Crocker tortured by Jorgen Von Strangle/Crimson Chin/Dyno Dad",
                "CatDog or Windslow tortured by Cliff of the Greasers",
                "Jenny/Tuck/Sheldon/Biff & Tiff tortured by Himcules",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going on?</span></div></span></div>",
            "created":1329800400,
            "id":1281704,
            "title":"What's going on?"
        },
        "11":{
            "author_id":"evilguy496",
            "author_name":"evilguy496",
            "choices":[
                "Aang",
                "Katara",
                "Ozai",
                "Boulder",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1412053200,
            "id":1864242,
            "title":"Avatar"
        },
        "114":{
            "author_id":"evilguy496",
            "author_name":"evilguy496",
            "choices":[
                "Toph",
                "Katara",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you unleash your farts on?</span></div></span></div>",
            "created":1412053200,
            "id":1864243,
            "title":"Boulder"
        },
        "1143":{
            "author_id":"tealord",
            "author_name":"Kingme",
            "choices":[
                "aang",
                "sokka",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what these choices?</span></div></span></div>",
            "created":1587095820,
            "id":2819970,
            "title":"More"
        },
        "12":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "timmy",
                "vicky",
                "Mr. Crocker",
                "Cosmo or Wanda",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you?</span></div></span></div>",
            "created":1329800400,
            "id":1281916,
            "title":"Fairly oddparents torture"
        },
        "121":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Jorgan Von Strangle",
                "The Crimson Chin",
                "Dyno Dad, your superhero dad"
            ],
            "content":"<div class=\"\"><div> <span>You come home after a long day at school. As usual, school was boring, and your neglectful parents left you home with Vicky, your torturous babysitter, but now you have your fairies to chare you up, but you find someone big and tuff in your room.<br>\r\n<br>\r\n\"Timmy Turner!\" the voice sais with a very dominent tone...<br>\r\n<br>\r\nI-It's...</span></div></div>",
            "created":1329800400,
            "id":1281928,
            "title":"timmy turner"
        },
        "1211":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Jorgan sits on you and farts",
                "Jorgan farts in your face",
                "Jorgan puts you up his ass"
            ],
            "content":"<div class=\"\"><div> <span>Jorgan Von Strangle, tuffest fairy in the universe!<br>\r\n<br>\r\nHe grabs you and teleports the two of you away.<br>\r\n<br>\r\nYou find yourself at his house. Jorgan, who could always change his size, is huge, and you are about the size of a newborn baby to him.<br>\r\n<br>\r\nHe places you on his comfortable lazy boy chair and prepares to sit on you.<br>\r\n<br>\r\n\"Puny Turner, you have made one too many bad wishes, NOW YOU WILL BE PUNISHED!!!</span></div></div>",
            "created":1329886800,
            "id":1281953,
            "title":"Jorgan Von Strangle"
        },
        "12111":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Now for the TRUE torture"
            ],
            "content":"<div class=\"\"><div> <span>He turns around and you see his huge buttocks. He backs up closer to you and makes you stare at his well sculpted ass. After about 30 seconds, he starts softly tapping his manly ass, doing this right in your face for 20 seconds, then clenches his cheeks.<br>\r\n<br>\r\nHe comes closer and his butt begins to touch you. The very smell of his ass stinks, but soon, he slowely begins to sit on you.<br>\r\n<br>\r\nJorgan then pushes out a wet, loud fart that smells so bad that you are stunned for a second.<br>\r\n\"Yes, Turner, SMELL MY FARTS!!!!\"</span></div></div>",
            "created":1329886800,
            "id":1282000,
            "title":"Jorgan sits on you and farts"
        },
        "121111":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Torture begins"
            ],
            "content":"<div class=\"\"><div> <span>Before you know it, Jorgan is now huge, well he was always huge, but now he is so big that you only reach his ankle.<br>\r\n<br>\r\nHe puts his hand out, and his giant wand appears. He thuds it on the ground.<br>\r\n<br>\r\n Now, everything around you was huge as well, to fit Jorgan's size.<br>\r\n<br>\r\nYou are still on his, now huge, lazy boy.<br>\r\n<br>\r\n\"NOOO!! JORGAN PLEEEASE!! DON'T\" you cry.<br>\r\n<br>\r\nJorgan lowers his colosal ass even closer to your tiny, pathetic body. His butt touches you, and, while stepping back, you fall back. You are at Jorgan's mercy.</span></div></div>",
            "created":1329886800,
            "id":1282021,
            "title":"Jorgan gets big(ger)"
        },
        "1211111":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "fart to the face",
                "bare assed fart to the face"
            ],
            "content":"<div class=\"\"><div> <span>With his ass now barely touching you, Jorgan gloats and wiggles it in your face.<br>\r\n\"Now, Turner, you will suffer the wrath of me, and my awesome muscles\" Jorgan sais as he flexes his enormous muscles (like always)<br>\r\n<br>\r\n\"And of course, my rank wind\" he states, then begins to laugh maniacly.<br>\r\n<br>\r\nSuddenly, you feel a warm, moist wind, then smell something that makes you come close to gagging. As you stumble back, Jorgan sits on you, sighing in comfort<br>\r\n<br>\r\n\"G-GET OFF\" you yell<br>\r\n<br>\r\nJorgan answers you with a roaring fart...</span></div></div>",
            "created":1329973200,
            "id":1282678,
            "title":"Torture begins"
        },
        "12111111":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Squash you beneath his meaty mounds",
                "Fart your clothes off"
            ],
            "content":"<div class=\"\"><div> <span>You feel the vibrations to you as the stench and warmth floods your body. Jorgen's army pants is so tight around his glutes that they practically appear to be painted on.<br>\r\n<br>\r\n\"What's the matter Turner?\" Jorgen teases as he wiggles his round buns of steel upon your tiny body. \"Is your puny little nose too weak for my rancid butt stench?\"<br>\r\n<br>\r\nJorgen flexes his enormous biceps and worshipes each one with a kiss while grinding his smelly buttocks upon your poor suffering face. His butt reeks of cabbage and rotten eggs, and he clenches his cheeks continuously until you find yourself caught in his crack, between his bronze globes. You feel the strength of his muscled toosh squeeze the air out of you, and once you are securely in position he raises his buns in the air and points you to a nearby wall.<br>\r\n<br>\r\n\"Prepare to suffer, Timmy Turner,\" Jorgen laughed as he brewed up a strong, deep fart beneath his eight pack and released the loudest fart Fairy World had ever seen and that any human has ever heard. Not only are you the first to hear such a rip, but you're also the first to smell it and feel the impact of it as you crash into the wall reeking of Jorgen's ass gas.<br>\r\n<br>\r\nYou groan as you prepare yourself for more suffering. You can see the bulk of muscle approaching you already. Jorgen's smugness proves that you have no chance of escape, and when he turns around and aims his butt at you again, he prepares to . . .</span></div></div>",
            "created":1409547600,
            "id":1850814,
            "title":"fart to the face"
        },
        "12113":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Start farting",
                "Pull you out",
                "Have a seat"
            ],
            "content":"<div class=\"\"><div> <span>Jorgen Von Strangle is your worst nightmare, and right now your worst nightmare is flexing his biceps, pecs and boulder shoulders until his mighty muscles becomes too much for his shirt to handle. As his shirt tears to shreds, you cannot shift your eyes from the shine of Jorgen's bronze pecs.<br>\r\n<br>\r\n\"Enjoying the view, Turner?\" Jorgen laughs as he bounces his pecs repeatedly. \"Take a good look at my pecs, puny boy, because now, you soon I will be doing this with my butt cheeks.\"<br>\r\n<br>\r\nYou panic at the sight of the Jorgen's massive glutes as he removes his pants and bares his sculpted bronze ass. Jorgen's sadistic grin does not leave his handsome face as he clenches his ass cheeks together and tightly and releases them frequently.<br>\r\n<br>\r\nWithout warning, Jorgen picks you up and holds you in his palm. You know what he's about to do. But first . . .<br>\r\n<br>\r\n<b>SLAAAAAAAAAAAAAP!!!!</b><br>\r\n<br>\r\nJorgen swats you against his round ass cheek, and you don't know what's more painful: the power of his giant hand, the strength of his firm, muscled rump, or the humiliation the toughest fairy in the universe is causing you.<br>\r\n<br>\r\n\"Night night, puny Turner.\"<br>\r\n<br>\r\n\"Ugh!\" You groan as you find yourself shoved into the greatest ass in the universe. Soon you are smothered in manly butt stench and beefy ass meat.<br>\r\n<br>\r\n\"Hahahaha!\" Jorgen laughs as he prepares to . . .</span></div></div>",
            "created":1409720400,
            "id":1852006,
            "title":"Jorgan puts you up his ass"
        },
        "121131":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "A merciess beating",
                "A Fart Fest",
                "Some foot play"
            ],
            "content":"<div class=\"\"><div> <span>First Jorgen traps you, forcing you to remain between his ass cheeks with no escape by clenching his large bronze glutes together and crushing you into the smelly abyss. Then, you feel movement as the stench and laughter begins to fill you nose and ears.<br>\r\n<br>\r\n<b>FAAAAAAAAAAAAAAARRRRRRRRRRRRRRRRTT!!!!</b><br>\r\n<br>\r\n\"Oh, pardon me Turner,\" Jorgen teases. \"Let me give you some <i>air</i>.<br>\r\n<br>\r\n<b>FAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRRRRRRRRRRRRRRTT!!!!</b><br>\r\n<br>\r\n\"Cosmo! Wanda! HELP!!!\" You yell desperately as Jorgen's ass meat smothers you in your smelly trap.<br>\r\n<br>\r\n\"No one can hear you in the moon, Turner,\" Jorgen laughs. \"Scream all you want.\"<br>\r\n<br>\r\nJorgen was enjoying putting you in your place. Weak, pathetic and puny Timmy Turner deserves to be in the ass of the mightiest, toughest, beefiest fairy in the entire universe.<br>\r\n<br>\r\nJorgen finally spreads his ass cheeks apart and releases you from his ass. Now that you reek of Jorgan's farts and sweat. You struggle to get to your feet, but it doessnt even matter. Jorgen immediately places his bar foot over your entire body except your head, so you can see his manly might.<br>\r\n<br>\r\nHis feet seem to stink too, the salty musk of a manly workout which had clearly paid off in Jorgen's favour. There he stood, flexing his massive biceps and bouncing his wide, juicy pecs as he effortlessly crushes you to the ground.<br>\r\n<br>\r\n\"Now, Turner, get ready for . . .\"</span></div></div>",
            "created":1410152400,
            "id":1854224,
            "title":"Start farting"
        },
        "1211312":{
            "choices":[
                "Jorgen decides to squish you under his balls",
                "Jorgen puts on underwear and forces you in a Dutch oven."
            ],
            "content":"<div class=\"\"><div> <span>Jorgen simply smirked down at you,smothered under his sweaty sole. His tan body was sweating profusely,and you were now drenched in foot sweat. Jorgen swiped you up,and placed you on a chair. \"It's time for a fart fest,and my round ass is going to smother you.\" Jorgen played coy as he slammed his butt down on you,his stomach gurgling. \"I'm going to perform different styles of farting... Such as silent but deadly..\" Jorgen real eased hot wind on you,but it wasn't loud. Suddenly,you were over taken by the smell. \"But,mostly all I can produce are deafening,rotten farts..\" Jorgen clenched his stomach,it someone protruding. He needed to refill his gas,even if he was a fairy.<br>\r\n<br>\r\nJorgen's ass was foul and sweaty,and the overall feeling was disgusting. Jorgen's hole opened up and let out <br>\r\n<b></b>FFFFTTTTTTTTPPTTT<b></b><br>\r\n<br>\r\nJorgen laughed and grinded you into his massive globes.Jorgen fondeled his groin as he felt your tiny presence under him. He wanted to make himself bigger,and being a being of magic,he could do that. Jorgen grew himself so that his ass enveloped you,and he almost broke the chair. The massive man bounced his pecs and laughed heartily at his new growth,farting on you again.</span></div></div>",
            "created":1410325200,
            "id":1855334,
            "title":"A Fart Fest"
        },
        "12113122":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Go for a run with Timmy still inbetween his ass",
                "Fart on him against a wall this time"
            ],
            "content":"<div class=\"\"><div> <span>\"There's nothing you con do to save yourself Turner!\" Jorgen said as he put on some briefs. He got up from his chair and started to squat. \"Get ready for the fumes!\" Jorgen said as he shook his massive ass and started grunting.<br>\r\n<br>\r\nFAAAAAAAAAAAAAAAARRRRRRRRRRT!!!!!!!!<br>\r\n<br>\r\n\"HAHA! How do you like that Timmy Turner? It's smells bad right? Well here's some more for you\" Jorgen says as he is smacking his large ass, waiting for more farts. <br>\r\n<br>\r\nThen another one comes out and was worse than that. There is sweat on all sides of you and you think to yourself that this can't get any worse. It does. <br>\r\n<br>\r\n\"Now I want to...\"</span></div></div>",
            "created":1412485200,
            "id":1867254,
            "title":"Jorgen puts on underwear and forces you in a Du..."
        },
        "121131221":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Staring at a bigger Jorgen",
                "In a wrestling ring with Jorgen",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Jorgen's deep, booming laughter was all that Timmy could hear while trapped in the bronze orbs of Jorgen's ass. At least, that's what he heard when the farts didn't take over.<br>\r\n<br>\r\n\"HAHAHAHA!!!\"<br>\r\n<br>\r\nFAAAAAAARRRRRRRRRT!!!!!!<br>\r\n<br>\r\n\"HAHAHAHA!!!\"<br>\r\n<br>\r\nFAAAAAAARRRRRRRRRT!!!!!!<br>\r\n<br>\r\nAnd this cycle repeated as Jorgen ran. Timmy felt like he was being cushed between two solid walls, except that he was covered in Jorgen's butt sweat. Unable to escape because of the underwear trapping him in Jorgen's ass, he was lingering on the edge of consciousness as Jorgen's cheeks jiggled.<br>\r\n<br>\r\n\"Haha! Now Turner, let's kick it up a notch.\"<br>\r\n<br>\r\nTimmy heard a deep low rumbling as Jorgen grunted in his deep, manly voice. Jorgen gathered his manly gas and then pressed his sweaty, underwear clad ass against a wall. Now the gas could not escape, and Timmy would definately suffer intensely.<br>\r\n<br>\r\n\"Get ready Turner, here it comes.\"<br>\r\n<br>\r\nNo matter what, Timmy would never be ready for the next fart.<br>\r\n<br>\r\n<b>FAAAAAAAAAAAAARRRRRRRRRRRRTT!!!!</b><br>\r\n<br>\r\nTrapped with the salty musk of Jorgen's butt sweat and the rotten gas of his mighty farts left Timmy unconscious. But before his eyes could fully close, Jorgen farted Timmy out of his ass and observed his trophy - the tortured Timmy.<br>\r\n<br>\r\n\"Nighty night, Turner.\" Jorgen said.<br>\r\n<br>\r\n<br>\r\nWhen Timmy woke up, he was . . .<br>\r\n<br>\r\n</span></div></div>",
            "created":1412571600,
            "id":1867599,
            "title":"Go for a run with Timmy still inbetween his ass"
        },
        "1211312211":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "Let out a Strom on timmy",
                "Make thing worse for him "
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning turner it time that we get back to your punishment.\"jorgen said to him<br>\r\n timmy opened his eyes only to see that jorgen had hulked out and was now four times bigger then he was \"what happened to you.\"timmy said conerred <br>\r\n\"oh this well I might gave help myself to Cosmo and wands magic that and a little extra from the big wand.\"jorgen said to timmy as he pick timmy up<br>\r\n\"but enough chat time for punishment.\"jorgen said as he put timmy in between his pecs as he squish tmmiy around in them before let him fall back to the ground only to black his massive butt down on him again<br>\r\n \"I hope you ready for this tunrer.\"as jorgen let it a big lone <br>\r\n<br>\r\nFFFFFAAAARRRTTT<br>\r\n<br>\r\nOn timmy as he...</span></div></div>",
            "created":1528538940,
            "id":2504738,
            "title":"Staring at a bigger Jorgen"
        },
        "1211312212":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "The Match Begins!"
            ],
            "content":"<div class=\"\"><div> <span>When Timmy woke up, he was in a wrestling ring with Jorgen. Jorgen Von Strangle had changed his clothes at this point, now sporting a camouflage singlet that looked skin tight on his body. Timmy was still disoriented, but he got to his feet. \"What are we doing here?\" Timmy asked. \"We are going to wrestle!\" Jorgen said as he flexed his biceps and his pecs. \"Yeah right!\" Timmy said as he tried to leave. However when he tried, he got pushed back by an invisible force. \"What was that?\" Timmy said as he rubbed his forehead while Jorgen was laughing. \"It is an invisible force field to stop you from leaving! You can't escape Timmy Turner!\"</span></div></div>",
            "created":1415077200,
            "id":1881585,
            "title":"In a wrestling ring with Jorgen"
        },
        "12113122121":{
            "author_id":"tealord",
            "author_name":"Kingme",
            "choices":[
                "keep him under his ass for more fun ",
                "deiced to give Timmy a bronco buster and maybe more"
            ],
            "content":"<div class=\"\"><div> <span>as bell chimed as he wasted no time charge the puny Timmy turner as he grab him <br>\r\n“now let have fun.”Jorgan said as he placed Timmy between his pecs and squeezed hard as they felt like stones as Timmy got press out and shot into the field once again as it bounce him back toward Jorgan <br>\r\n<br>\r\nJoran jump over him as he held himself in the air with magic as Timmy hit the other side of the force field and got sent back as he let him self drop and body slammed Timmy hard into the Matt as Timmy got dazed by the attack<br>\r\n<br>\r\nJorgan got up and climbed the rope as he used that for his next move a banzai drop as his large bronze ass crush Timmy as he felt the fairy brute is check that felt like stone as he grinded down on him and farted on the tiny kid and when he got up Timmy was stuck as he laughs</span></div></div>",
            "created":1571006100,
            "id":2732434,
            "title":"The Match Begins!"
        },
        "1212":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Let Me torture you with my body!",
                "Let's wrestle!",
                "Someone else helps The Crimson Chin torture Timmy"
            ],
            "content":"<div class=\"\"><div> <span>The buff, spandex clad superhero known as Crimson Chin looks over you and looks like he needs your help.<br>\r\n<br>\r\n \"Crimson Chin, what are you doing here\" Timmy said.<br>\r\n<br>\r\n \"There is no time for that come with me, Timmy\" Crimson Chin says.<br>\r\n<br>\r\n He grabs you by the back of your collar and drags you to his comic book world<br>\r\n<br>\r\nWhen you arrived, you were at his place which was filthy.<br>\r\n<br>\r\n\"Okay Crimson Chin, what do you need my help for?\" you asked him.<br>\r\n<br>\r\nHe smirk deviously as he said: \" a lot of things Timmy, so much that you will  never be able to leave this world!\"<br>\r\n<br>\r\n\"Wanda! Cosmo! Poof! Help Me!\" Timmy screamed.<br>\r\n<br>\r\n\"They can't hear you! My radar shows that they have been caught by Jorgen in the Fairy World!\"<br>\r\n<br>\r\nHe shows you this and you are terrified as you look at his body. After a while of no crimes, he let himself go. He still has a lot of muscle but his arms, pecs,&amp; lower body have grown. He took of his suit, the only thing he has on is his mask a shirt and white boxers \"Now here's your first task...</span></div></div>",
            "created":1412485200,
            "id":1866784,
            "title":"The Crimson Chin"
        },
        "12123":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Nega-Chin",
                "Golden Gut"
            ],
            "content":"<div class=\"\"><div> <span>Timmy is now stuck in Chincinnati forever as the Crimson Chin is about to torture him. Suddenly, the door rings and Crimson Chin answers it. Timmy can't get out because Crimson Chin's musclegut body is big enough to block him from the exit. \"Looks like my guest has arrived\" Chin said as he moved out of the way to reveal the person. Timmy was shocked to see who it was.<br>\r\n<br>\r\nWho was it?<br>\r\n<br>\r\nThe Nega-Chin, who is Crimson Chin's evil Twin Brother and weighed the same as him<br>\r\n<br>\r\nOr<br>\r\n<br>\r\nThe Golden Gut who is an evil sumo wrestler made out of solid gold that wanted to destroy the Crimson Chin and all of Chincinnati in the past.</span></div></div>",
            "created":1412485200,
            "id":1867134,
            "title":"Someone else helps The Crimson Chin torture Timmy"
        },
        "121231":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Doube Trouble Torturing!"
            ],
            "content":"<div class=\"\"><div> <span>It was Nega-Chin who showed up at the Crimson Chin's door; he looked and weighed the same as his twin.<br>\r\n<br>\r\n\"Why?!\" Timmy said.<br>\r\n<br>\r\n\"Because there's nothing better when 2 people who argue in the past can get along for a common goal!\" Nega-Chin said as he slapped his belly.<br>\r\n<br>\r\nTimmy screamed and jumped out of the window.<br>\r\n<br>\r\n\"What is he doing?! Doesn't he know that I'm on the 4th floor?!\" Crimson Chin said.<br>\r\n<br>\r\n\"Don't worry we have magic on our side!\" Nega-Chin said calmly as he snapped his fingers.<br>\r\n<br>\r\nWhile this was happening, Timmy was falling. \"I rather be dead than have to deal with them!\" Timmy said as he fell.<br>\r\n<br>\r\nBefore he could hit the pavement, a trampoline that had Nega-Chin's symbol on it appeared.<br>\r\n<br>\r\nTimmy bounced back up and into the room where he jumped.<br>\r\n<br>\r\nNega-Chin snapped his fingers again and repaired the windows with something that won't break.<br>\r\n<br>\r\n\"You'll pay dearly for that Timmy!\" Crimson Chin said as they walked towards Timmy.<br>\r\n<br>\r\nThis was going to be a long night for Timmy Turner. </span></div></div>",
            "created":1416978000,
            "id":1893886,
            "title":"Nega-Chin"
        },
        "1212311":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Crimson chin and Nega Chin's fists",
                "A long storm of farts"
            ],
            "content":"<div class=\"\"><div> <span>\"You thought you'd get off that easy, Timmy?\" Crimson chin said, beefy arms folded across his chest.<br>\r\n<br>\r\nThe Nega chin grinned while standing in the same position as Crimson chin. \"You're in for a world of pain now.\"<br>\r\n<br>\r\n\"Oh DOUBLE crud!\"<br>\r\n<br>\r\n\"You got that right\" the buff men said in unison before using their huge butts to smother every inch of Timmy's face and body.<br>\r\n<br>\r\nTimmy grunted in pain as their butts smacked both sides of Timmy's face. It was then that the Nega-Chin took a good seat on Timmy's face, while the Crimson Chin sat on his lower belly. The reeking stench of the large ass on his face was enough to make Timmy gag, but it was all intensified when they blasted Timmy with powerful super farts. Timmy hair blew back from the impact, and he soon found even more torture from...<br>\r\n<br>\r\n</span></div></div>",
            "created":1436418000,
            "id":2005682,
            "title":"Doube Trouble Torturing!"
        },
        "1213":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Dad's butt squashes you",
                "Vicky shows up",
                "Dad's got Crimson Chin as backup"
            ],
            "content":"<div class=\"\"><div> <span>Your buff, spandex clad dad glares over you and you don't know what he's so angry about.<br>\r\n<br>\r\n\"Hey, dad,\" you say unsurely.<br>\r\n<br>\r\n\"You were supposed to clean your room and wash the dishes before you left for school, Timmy,\" Dyno Dad says.<br>\r\n<br>\r\nYour eyes widen. \"I'm sorry dad, I'll get right on it.\"<br>\r\n<br>\r\n\"NO! Let's see how YOU like things dirty, son.\"<br>\r\n<br>\r\nYou are surprised when Dyno Dad turns around with his large, muscular butt pointed at you. He gives his right cheek a rub and a quick slap before he launches a loud and raunchy ...<br>\r\n<br>\r\n<b>FAAAAAAAAAAAAARRRRRRRRRRRRRRRTT!!!!</b><br>\r\n<br>\r\nThe smell hits you instantly, and you realize that those cans of beans in the cupboard probably aren't there anymore. You realize by that sadistic smirk on Dyno Dad's face that he's not done with you yet. You turn around and try to make it to the door, but you are instantly stopped when . . .</span></div></div>",
            "created":1409634000,
            "id":1851045,
            "title":"Dyno Dad, your superhero dad"
        },
        "12131":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Dyno Dad takes his son with him to the bathroom",
                "Dyno Dad wrestles his son"
            ],
            "content":"<div class=\"\"><div> <span>Dyno Dad's ass squashes Timmy. \"Get off of me Dad!\" Timmy said as he is trying to lift his dad's ass to no avail. <br>\r\n<br>\r\n\"Those beans sure were good Timmy, how you would like a taste?\" asks Dyno Dad as he blasts a mighty fat fart on Timmy's face. Dyno Dad grinds has large ass further in Timmy's face, making sure he smelled the meaty gas he laid out on his son. Dyno Dad grunts as his farts start to get wetter and wetter. \"Well son, I guess we can spend some father-son time together!\" He told his son.<br>\r\n<br>\r\nTimmy yelled; \"Noooooo!</span></div></div>",
            "created":1414299600,
            "id":1877993,
            "title":"Dad's butt squashes you"
        },
        "121312":{
            "author_id":"tealord",
            "author_name":"Kingme",
            "choices":[
                "a straight stinkface",
                "top rope banzai drop"
            ],
            "content":"<div class=\"\"><div> <span>“Yes timmy now let see what you got in the ring.”dyno dad said as he grabbed you and head off to go find one which was easy with his power as he took it and drop it off in their garage as he tossed his son into the ring “hoe your ready timmy i was a wrestling champion.”dyno dad said as he got ready to bring timmy hurt with...</span></div></div>",
            "created":1571117400,
            "id":2733089,
            "title":"Dyno Dad wrestles his son"
        },
        "1213121":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Dyno Dad bodyslams Timmy",
                "Dyno Dad continues farting on Timmy",
                "Dyno Dad teabags Timmy"
            ],
            "content":"<div class=\"\"><div> <span>Dyno Dad's huge pecs and ass were bulging out of his tight superhero suit. He smirked at his weakling son, Timmy, and got ready to put the hurt on him.<br>\r\n<br>\r\n\"Round one, son!\"<br>\r\n<br>\r\nBAM!!!<br>\r\n<br>\r\nTimmy found himself being crushed against the post on the corner of the ring, his back against the post while his face was full of ass. Dyno Dad ass to be exact. Dyno Dad was delivering a mighty stink face.<br>\r\n<br>\r\nTimmy struggled while Dyno dad just stood there with ease. A relaxed smirk was on his face but it became even more relaxed after he released a long wet fart on Timmy's face.<br>\r\n<br>\r\n\"See why I was the champion, son?\" Dyno Dad asked with his ass on Timmy's face again. \"And that's not even half the moves I know...\" <br>\r\n<br>\r\n\"Dad get off!\" Timmy yelled into his dad's meaty ass, only to have it muffled by the thickness of it. <br>\r\n<br>\r\n\"Can't hear you, Timmy. I'm too busy giving you a beating. <br>\r\n<br>\r\nAfter the stinkface had succeeded in turning Timmy's face into a fart absorbing cushion, Dyno Dad decided to show Timmy some other moves in his repertoire. Although most of them ended with Timmy being forced to sniff his dad's ass or getting teabagged.<br>\r\n<br>\r\n</span></div></div>",
            "created":1572303120,
            "id":2739520,
            "title":"a straight stinkface"
        },
        "13":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Cat",
                "Dog",
                "Both",
                "Winslow",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one gets the gas?</span></div></span></div>",
            "created":1387688400,
            "id":1711726,
            "title":"CatDog or Windslow tortured by Cliff of the Gre..."
        },
        "14":{
            "author_id":"haninozuka325",
            "author_name":"Mitsuhiko",
            "choices":[
                "Jenny",
                "Tuck",
                "Sheldon",
                "Biff and Tiff",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be the unlucky victim?</span></div></span></div>",
            "created":1330405200,
            "id":1285722,
            "title":"Jenny/Tuck/Sheldon/Biff & Tiff tortured by Himc..."
        },
        "142":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Pain",
                "Worship",
                "Fart"
            ],
            "content":"<div class=\"\"><div> <span>You are just walking down the street, avoiding as many gross things as possible, when suddenly you hear loud stomping. Citizens of the town run in fear, as you hear a manly voice echo...<br>\r\n\"I AM HIMCULES!!!!\"<br>\r\nFor some reason, you get curious and rush to see what that manly voice was.<br>\r\nA big, muscular man in a black toga appears, flexing his muscles for the world to see. He gladly rips off the wall of a tall building and orders those inside to shower him with their money.<br>\r\n\"Gimme all your LOOT!!\" he yells, flexing his muscles on the last word, before posing as the money rained down upon him.<br>\r\nHimcules, a man named after the demi-god, he gains strength from the pain, embarrassment, or humiliation he enflicts on his victims. He was thrown in jail, how is he back?<br>\r\nAs Jenny's sidekick (next to your brother, of course), you can't just let him loot the town like this, and you call out for Jenny. She doesn't show up, and now Himcules knows of you. This is bad.<br>\r\n\"Ah, I remember you,\" the giant god-like man said to you, towering above you. You know he won't let you go now, but before you get a chance to run, he grabs your shoulder. You look back in dire fear as he smiles sadistically down at you.<br>\r\n\"Boy, I can have some fun putting you in your place, kid.\"</span></div></div>",
            "created":1345006800,
            "id":1404924,
            "title":"Tuck"
        },
        "1423":{
            "author_id":"haninozuka325",
            "author_name":"Mitsuhiko",
            "choices":[
                "bare butt",
                "underwear cladded butt",
                "stuffs him in his toga and farts on him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does he fart on him?</span></div></span></div>",
            "created":1345006800,
            "id":1405629,
            "title":"Fart"
        },
        "14231":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Stuffed inside my ass",
                "Sat on",
                "Pissed on"
            ],
            "content":"<div class=\"\"><div> <span>Himcules lifts his black toga and reveals his lack of underwear beneath it. His round, muscular ass is pointed right at you.<br>\r\n<br>\r\n\"You know what I'm gonna do, boy?\" Himcules asked with his seductive smile.<br>\r\n<br>\r\nYou cower in fear at the sight of his gaseous glutes, and you can't take your wide eyes off them. You slowly shake your head fearfully before he grunts and releases a long fart right in your face.<br>\r\n<br>\r\nYou cower in fear as the smell enters your nose and the bass fills your ears. You close your eyes as he booms with laughter.<br>\r\n<br>\r\n\"Hahaha!! Now to profit from your pain.\"<br>\r\n<br>\r\nYou close your eyes for one moment, and when you open them again, you see that Himcules' ass has grown bigger, rounder and stronger along with the rest of his buff body. You suddenly remember his ability to grow larger when witnessing the pain of others, and right now the lingering stench in the air was leaving you in pain.<br>\r\n<br>\r\nHimcules continues to laugh as he grows and flexes his biceps and farts some more.<br>\r\n<br>\r\n\"Ugh!\" You groan.<br>\r\n<br>\r\n\"Yes! Yeeees! That's it . . . Your pathetic pleas give Himcules MUCH STRENGTH!\"<br>\r\n<br>\r\nAnd it shows. Himcules' glutes grow to the size of mountains and he stands above you with his ass squatted above you, blocking all light and preparing to squash you beneath his manly mounds of meat.<br>\r\n<br>\r\n\"Jenny will beat you!\" You suddenly yell without thinking.<br>\r\n<br>\r\n\"That pathetic girl? Ha! She's probably too busy in the kitchen,\" says Himcules. \"I, on the other hand, am what you call ... Moi macho. Now prepare to be . . .\"</span></div></div>",
            "created":1409634000,
            "id":1851337,
            "title":"bare butt"
        },
        "142312":{
            "author_id":"tealord",
            "author_name":"Kingme",
            "choices":[
                "he eventually gets dne and jenny hasn't showed up",
                "jenny show up"
            ],
            "content":"<div class=\"\"><div> <span>\"my personal seat while work on my biceps perhaps you can help with just make sure to squirm.\"Himcules said as he sat back down on top of you as you were unfortunate enough to not be crush under himcules is ass as your hand wasn't as lucky enough as it was crushed under is rock sold cheeks as you began to work out with on top of him </span></div></div>",
            "created":1572137220,
            "id":2738826,
            "title":"Sat on"
        },
        "15":{
            "author_id":"cooldude9404",
            "author_name":"The Boy",
            "choices":[
                "Rudy Tabootie tortured by Odiferous Maximus (the farting ancient Greek guy)",
                "A Robotboy character tortured by Santa Claus (who is really buff on that show.) ",
                "Danny Phantom Tortured by Vlad",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going on?</span></div></span></div>",
            "created":1329800400,
            "id":1281709,
            "title":"Other"
        },
        "153":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Vlad was too strong and kept farting",
                "Danny broke free",
                "Vlad's next fart knocked Danny out"
            ],
            "content":"<div class=\"\"><div> <span>\"Whoa! You've beefed up,\" Danny noted as he saw Vlad, his arch foe, who had increased in muscle mass beyond his large stature from before.<br>\r\n<br>\r\nVlad grinned as he flexed his inflated biceps, which looked as though they would tear through his white suit at any moment. \"And that's not all, boy.\"<br>\r\n<br>\r\nVlad turned around to show Danny his greater assets, his large, round butt. It was the size of two basketballs, and Danny stared in disbelief as Vlad laughed deviously before readying himself with a squat and launching Danny backwards with a large, wet . . .<br>\r\n<br>\r\n<b>FAAAAAAAAAAAAAAARRRRRRRRRRRRRRRT!!!!!!</b><br>\r\n<br>\r\nDanny coughed and huffed as the stench sent him on his back. He tried to get up only to find the two globes wrapped in white pants about to crush his face. His face soon became a chair for Vlad Masters, now Plasmius, to relax his rump.<br>\r\n<br>\r\n\"Foolish boy, you always think you can beat me,\" Vlad laughed.<br>\r\n<br>\r\n\"I do!\" Danny yelled, although the sound was muffled against the meat crushing his face.<br>\r\n<br>\r\n\"Ha! Pathetic excuse for a hero. If you ever truly beat me I wouldn't be here squashing your face beneath my ass. Tell me, boy, how does this feel?\"<br>\r\n<br>\r\nVlad let out another deep fart, this time it was trapped on Danny's face.<br>\r\n<br>\r\n\"Ugh!\" Danny groaned and shook violently beneath Vlad, but ...</span></div></div>",
            "created":1409634000,
            "id":1851037,
            "title":"Danny Phantom Tortured by Vlad"
        },
        "1531":{
            "author_id":"thefireofice",
            "author_name":"Fire of life",
            "choices":[
                "Sat on danny for the rest of the day",
                "Reless a fart Strom on him",
                "Reader's choice "
            ],
            "content":"<div class=\"\"><div> <span>No matter how hard danny shook he couldn't get plasmis off his face <br>\r\n<br>\r\n\"Tell me Danny boy do you think I have remained on the same power as always cause if so your in for a surprise Danny my boy.\"vlad said as he released another deep fart on danny<br>\r\n<br>\r\nAfter which he took the teen by the arms and ragging him back to his place were he could show danny what he was in for as he tossed the teen on a nice chair face up as he set his giant ass down on his face as me wiggled a bit yo find comfort on danny face he found it in the worse spot for the teen as danny face was basically inside vlad ass crack as he farted hart and long on danny face<br>\r\n<br>\r\n\"Soory my boy it seem who I ate isn't agreeing with me.\"vlad said as he then</span></div></div>",
            "created":1528539480,
            "id":2504739,
            "title":"Vlad was too strong and kept farting"
        },
        "15311":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Beat Danny to a pulp and keep farting on him",
                "Replicate himself and have all fart on Danny "
            ],
            "content":"<div class=\"\"><div> <span>How many hours had it been, Danny thought, as his face was pressed into the ground by his arch enemy's now huge ass cheeks. Vlad's new muscular appearance wasn't just for show, he now had the strength to beat Danny to a pulp. But instead, he used his new buff body to squash Danny under his butt like a couch cushion.<br>\r\n<br>\r\nVlad sighed every time he released a fart on Danny, reveling in his victory over the heroic teen. Finally the score had been settled. But Vlad wasn't just going to sit on Danny all day. Well... He was... But he felt that to truly take revenge on Danny, he should have some fun with the teen while stinking up his face.<br>\r\n<br>\r\n\"Oh, Danny boy, you've given up already? You haven't even gotten to the main course yet.\"<br>\r\n<br>\r\nFAAAAAAAAAAAAARRRRRRRRRRRRT!!!!<br>\r\n<br>\r\nDanny grunted as that massive fart blasted his face. The humiliating impact made Vlad's butt cheeks shake a little, and eventually engulf Danny's face deeper between them. Vlad chuckled as suffered, and decided that it was time to really pump the gas with this fart torture revenge.<br>\r\n<br>\r\n\"Well, Danny, you can't simply lay beneath me and sniff farts all day, that's lazy,\" Vlad teased as he stood up.<br>\r\n<br>\r\nDespite the instant relief and freedom, Danny couldn't move as he watched his enemy's giant ass lift from his face. As Danny laid there, eyes half closed and dazed, he saw Vlad's smug expression as he stood over him.<br>\r\n<br>\r\n\"Let's see,\" Vlad thought out loud, his fingers stroking his jaw in thought. \"How shall I defeat you today? Farting on your pathetic face has proved quite effective, but how to spice things up.\"<br>\r\n<br>\r\nDanny's eyes blinked in a beaten and dazed confusion,as Vlad's eyes lit up as he found the perfect way to humiliate and beat Danny. Vlad decided to... </span></div></div>",
            "created":1530575520,
            "id":2514231,
            "title":"Sat on danny for the rest of the day"
        },
        "153111":{
            "author_id":"tealord",
            "author_name":"Kingme",
            "choices":[
                "tie Danny down to a chair to be a cushion",
                "knock Danny out a figure it out later (readers choice)"
            ],
            "content":"<div class=\"\"><div> <span>\"let just rough you up a but see were that goes and and of course plenty of gas.\"Vlad said as he grabbed Danny by his collar before sending him flying with hard punch as with Vlad new size came a stronger attack as Danny went through the wall as he quickly followed weaken Danny as he vanished before appearing in front of him He punched him in that face again <br>\r\n<br>\r\n\"this is fun Danny boy.\"Vlad said as he grabbed Danny and slammed him hard into the wall before turn and planing his ass hard on his head and blasting him with fart as Vlad laughed at his pathetic foe as he clenched his ass hold Danny face <br>\r\n<br>\r\n\"fun facts squats are great for ass grip.\"Vlad said as h he started flying fast toward a wall before turned and slamming both his ass and Danny into the wall as he felt teen body go slack a bit<br>\r\n<br>\r\n \"now now Danny stay with me\"Vlad said as he uncleched his ass and grabbed Danny by his throat and lapping him back awake <br>\r\n<br>\r\n\"there now back to were we started.\"Vlad said as he tossed Danny into a chair as his head was on cushion part as Vlad jump on to the chair stuffing Danny face into the cushions as he grinded Danny face down into the chair s he let out a long wet and filthy fart into both the chair and Danny face <br>\r\n<br>\r\n\"this is fun but now what else should i do with Danny can't keep doing this all day.\" Vlad said as he thought about it...</span></div></div>",
            "created":1571005140,
            "id":2732426,
            "title":"Beat Danny to a pulp and keep farting on him"
        },
        "1531111":{
            "author_id":"sajoker",
            "author_name":"SaJoker",
            "choices":[
                "Punching Danny with his huge arms",
                "Humiliating Danny with farts ",
                "Get creative (Readers Choice) "
            ],
            "content":"<div class=\"\"><div> <span>Vlad put his finger to his chin on thought, and grinned as an idea entered his head.<br>\r\n<br>\r\n\"You know, Daniel, as much fun as it is beating you to a pulp it's also quite draining. I think I need to sit down.\"<br>\r\n<br>\r\nWith that, Vlad raised his hand and a ghostly glow surrounded the chair. Vlad had conjured a rope which tied Danny down to the chair in a position that stuck his head to the cushion part. Danny was helpless and immobile as he fearfully watched Vlad's round, perfected ass onto his face.<br>\r\n<br>\r\nFAAAAAAAAAAAAAARRRRRRTTT!!!<br>\r\n<br>\r\n\"Oh well listen to that. I guess I still got a few left in me. What do you say Daniel? Shall I finish you off?\"<br>\r\n<br>\r\nDanny grunted in helpless frustration as Vlad continued to beat him simply by sitting on his face. Fart after fart left Danny dazed, he hardly had any fight left in him. <br>\r\n<br>\r\nVlad chuckled as he felt Danny weaken beneath his ass. He decided to untie Danny from the chair, then he squeezed his ass cheeks together and used them to lift Danny's face off the chair. Then BAM!! He slammed Danny back down while squashing the poor hero's face once again.<br>\r\n<br>\r\nVlad got off Danny and turned around so that he could admire his handy work. His defeated foe had been pummeled and farted on immensely. Yet Vlad couldnt decide what he enjoyed doing with his improved physique more. Punching Danny around with his huge arms, or humiliating  him with farts from his huge ass.<br>\r\n<br>\r\nVlad smirked as he decided to continue... </span></div></div>",
            "created":1572302040,
            "id":2739512,
            "title":"tie Danny down to a chair to be a cushion"
        },
        "154":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Ms. Mister/BH tortured by The Super Duper Sumos",
                "Ren & Stimpy tortured by The Lout Brothers",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going on?</span></div></span></div>",
            "created":1416200400,
            "id":1888040,
            "title":"Other"
        },
        "1541":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Ms. Mister",
                "BH",
                "Dr. Stinger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is getting tortured by the Super Duper Sumos?</span></div></span></div>",
            "created":1416718800,
            "id":1892659,
            "title":"Ms. Mister/BH tortured by The Super Duper Sumos"
        },
        "15411":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Kimo, Mamoo and Booma has successfully defeated Bad Inc. and now has the leader, Ms. Mister, in their lair.<br>\r\n<br>\r\n\"Why am I here? Shouldn't I be in jail?\" Ms. Mister asked.<br>\r\n<br>\r\n\"You should be.\" Kimo said.<br>\r\n<br>\r\n\"The reason why you're not is because we have a better way to punish you.\" Mamoo said to her.<br>\r\n<br>\r\n\"With what?\" Ms. Mister asked again.<br>\r\n<br>\r\n\"With our bodies!\" Booma said as he slapped his butt a couple of times.<br>\r\n<br>\r\n\"No way!\" Ms. Mister said as she was starting to get scared.<br>\r\n<br>\r\n\"You shall pay for all the crimes that you committed which will take a very long time.\" Kimo told her.<br>\r\n<br>\r\nThe 3 sumos advanced their positions to start the torture on Ms. Mister.</span></div></div>",
            "created":1418187600,
            "id":1900381,
            "title":"Ms. Mister"
        },
        "1542":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Yes, I'm sure!",
                "By Jose Poo",
                "By Victor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure about this? There are other characters that they can get tortured by.</span></div></span></div>",
            "created":1416200400,
            "id":1888051,
            "title":"Ren & Stimpy tortured by The Lout Brothers"
        },
        "1543":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Rocko tortured by Various Characters in his world",
                "Reader's Choice",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going on?</span></div></span></div>",
            "created":1416200400,
            "id":1888047,
            "title":"Other"
        },
        "15431":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Edward \"Ed\" Bighead",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does Rocko get tortured by?</span></div></span></div>",
            "created":1416200400,
            "id":1888056,
            "title":"Rocko tortured by Various Characters in his world"
        },
        "154312":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Sure!",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the Garbage Strike Rats?</span></div></span></div>",
            "created":1416200400,
            "id":1888059,
            "title":"Someone Else"
        },
        "1543122":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Really Really Big Man!",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Really Really Big Man?</span></div></span></div>",
            "created":1416200400,
            "id":1888061,
            "title":"Someone Else"
        },
        "15431222":{
            "author_id":"mrtrj",
            "author_name":"Mr TRJ",
            "choices":[
                "Phil the Pig",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Phil the Pig who is a plumber?</span></div></span></div>",
            "created":1418360400,
            "id":1901513,
            "title":"Someone Else"
        },
        "15432":{
            "author_id":"toilettwinsx",
            "author_name":"Fart Twins X",
            "choices":[
                "In the Loud Fart House!",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>In a world where Lincoln was stuck in the universe where he's the middle kid of eleven boys, he tries to survive more than ever - especially when he and his brothers are gassy. In a never ending fart war where it's ever Loud for himself, Lincoln has as many glorious victories as he's had humiliating defeats. Extra especially so when their parents are out for the foreseeable future.</span></div></div>",
            "created":1572045000,
            "id":2738408,
            "title":"Lincoln Loud, the middle kid of eleven boys."
        },
        "15433":{
            "author_id":"haninozuka325",
            "author_name":"Mitsuhiko",
            "choices":[
                "Otto Rocket is tortured by Lars",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about this one?</span></div></span></div>",
            "created":1476075600,
            "id":2221687,
            "title":"Other"
        },
        "154331":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Lars stuffs him in the back of his underwear",
                "Lars sits on him",
                "Lars traps him in his armpit"
            ],
            "content":"<div class=\"\"><div> <span>Otto Rocket loved to ride. In fact, he was skating about, grinding on railings, forcing people to dive out of the way, narrowly avoiding people moving furniture, the usual for \"Ottomatic.\" But, despite his best efforts, his riding was gonna get him into a heap of trouble.<br>\r\n<br>\r\nHe was in the middle of grinding a rail, while, without his knowledge, one rude dude was crossing the corner. The moments Otto hopped off the rail, this dude crossed right in front of him. <br>\r\n<br>\r\n\"Watch out, dude!\" Otto shouted. The dude turned, just in time for 1) him to see Otto riding right at him, and 2) Otto to realize this dude happened to be local rude dude, Lars Rodriguez.<br>\r\n<br>\r\n\"Gah!\" he shouted in realization. The two collide, Otto tackling over him. \"Grah! What's your problem, dude?!\" <br>\r\n<br>\r\n\"Hey! It's not my fault I didn't see you!\"<br>\r\n<br>\r\n\"And what? I should've seen you?\" Otto picked up his skateboard, checking it for damage. \"Don't ignore me while I'm yelling at you!\"<br>\r\n<br>\r\n\"C'mon, I've gotta get back to shredding.\" Before Otto could \"shred\" anymore, Lars grabbed him by the shirt collar and throws shoves him against the nearby wall.<br>\r\n<br>\r\n\"No way, dude! You've gone too far this time!\" He suddenly picked up a vial of powder.<br>\r\n<br>\r\n\"What's that funk y'got there?\" Before Lars answered, he uncorked the bottle, pours it into his hand, and blows it into Otto's face. He coughs and coughs. As he coughed, he didn't notice something worrying: he was shrinking! After his coughing fit, he shrunk to the size of an ant. Otto realized this when he looked up at Lars' cruel grin.<br>\r\n</span></div></div>",
            "created":1476075600,
            "id":2221800,
            "title":"Otto Rocket is tortured by Lars"
        },
        "1543311":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "He keeps farting",
                "He pounds the bulge in the back of his pants",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Lars grabbed Otto and moves his hand towards his back. He hooked the back off his drawers with his finger, then pulled it back, revealing his backside. Otto struggled even harder in Lars grips, but it was for not. He lets go, and Otto falls, right into his pants. He removed his finger, his pants shutting with a snap.<br>\r\n<br>\r\n\"How y'like that?\" Lars taunted. Otto tried his hardest to punch and push against Lars' backside.<br>\r\n<br>\r\n\"Cut it out?!\" Otto tried to shout. Unfortunately, even if Lars could here him, it wouldn't matter. He hears a foreboding rumbling, and a chill runs up his spine in response. His struggles are answered with a nasty fart. He coughed and groaned at the stench.<br>\r\n<br>\r\n\"How's that, 'Ottomatic'?\" He continued farting on him. Unfortunately, he went on with it a little too long. As he continued, the powder started to wear off. He grew, filling out his shorts, forcing him up against his butt. \"Well, that's mildly inconvenient...\"</span></div></div>",
            "created":1476075600,
            "id":2221806,
            "title":"Lars stuffs him in the back of his underwear"
        },
        "15433111":{
            "author_id":"storysorry",
            "author_name":"Reader",
            "choices":[
                "Nice",
                "Bad"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it smell?</span></div></span></div>",
            "created":1498021200,
            "id":2340093,
            "title":"He keeps farting"
        },
        "15433112":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "He continues the beating",
                "He goes back to gas",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Otto stretched his pants out, it squeezed against hi waist, making him extremely uncomfortable. As if running into him wasn't bad enough, this punk had the nerve to strain his waist.<br>\r\n<br>\r\n\"Why'd you gotta go doing that?!\" Lars shouted as he punched at the bulge Otto formed. Otto squirmed at the hit. \"Didn't like that one, huh?\" He kept punching and punching. Otto squirmed more and more, not only because it hurt, but because it was pressing him deeper and deeper against his butt. Lars stopped punching, and positioned his rear towards the wall. \"You're gonna hate this then!\" He thrust his hips backwards, smashing his butt against the wall, and against Otto. Again, it hurt, and again, it pushed him deeper and deeper into his butt.<br>\r\n<br>\r\nHe kept thrusting and thrusting, and Otto kept punching and punching. After one finally thrust, there was a pause. Otto secretly sighed in relief, believing it was over. But it wasn't. Lars took a running stance, than ran forward. He suddenly kicked his legs out from under him, dropping rear first on the pavement. He skidded a bit, which only hurt Otto even more as he skid. Each skid shoved him up against Lars' backside. He got up, took a running stance, and did the same thing as before. He repeated at least 3 more times, bruises forming on Otto. Once more, Lars took a running start and ran. But, unknown to Otto, he was running straight for a wall. Before he collided, he quickly turned his rear towards it, slamming into it with the momentum he gathered before, smashing Otto harder between him and the wall than before.<br>\r\n<br>\r\nOtto would've described the situation as being hit in the back by a truck into a garbage bag. It hurt so bad and smelled so horrible! As if to add insult to injury, after that running slam, Lars continued to slam his ass against the wall, over and over and over. Suddenly, he paused his attack.<br>\r\n<br>\r\n\"Bet you regret shreddin' on me now, eh?\" he taunted. He completed his taunt with a smack to his rear, causing it to jiggle around Otto's face, pressed in between his cheeks. <br>\r\n<br>\r\n\"This is bogus...\" Otto said, barely loud enough for Lars to hear. He grinned at his displeasure.<br>\r\n<br>\r\n\"If you thought that was bad...\" Lars filled the pause with a chuckle. \"...we aren't even half way done...\"</span></div></div>",
            "created":1476075600,
            "id":2221847,
            "title":"He pounds the bulge in the back of his pants"
        },
        "154332":{
            "author_id":"rogerdavis",
            "author_name":"davis ",
            "choices":[
                "Legend of Korra",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Legend of Korra?</span></div></span></div>",
            "created":1597868100,
            "id":2888064,
            "title":"Other"
        },
        "1543321":{
            "author_id":"rogerdavis",
            "author_name":"davis ",
            "choices":[
                "Bolin",
                "Tonraq"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's does the torture</span></div></span></div>",
            "created":1597868280,
            "id":2888067,
            "title":"Legend of Korra"
        },
        "15433211":{
            "author_id":"rogerdavis",
            "author_name":"davis ",
            "choices":[
                "You fall in his butt crack without him knowing",
                "You fall in his butt crack and he notices"
            ],
            "content":"<div class=\"\"><div> <span>One day you decide to sneak into the Fire Ferrets locker room but they aren't there. While waiting for them you sit down on the bench but began to shrink. You finally stop at around one inch tall when Bolin walks in. As he approaches the bench he notices you and his eyes widen.<br>\r\n<br>\r\n\"Whats is this thing?\"<br>\r\n<br>\r\nHe asks as he sits next to you.<br>\r\n<br>\r\n\"I'm a big fan! Well not anymore. I was shrunk down somehow!\" You yell up to your hero.<br>\r\n<br>\r\n\"Wait, you're a tiny person! How?\" Bolin asks.<br>\r\n<br>\r\n\"I don't know! I was just sitting there waiting for you guys to come in here and then suddenly I was this size!\" You explain, freaking out.<br>\r\n<br>\r\n\"Calm down, I'm sure there's an explanation.\"<br>\r\n<br>\r\nBolin says as he puts his hand around you.<br>\r\n<br>\r\n\"You're really tiny. You probably could sit on my pinky!\" He says with a grin.<br>\r\n<br>\r\nHe continues to grin as he considers his next move.<br>\r\n<br>\r\n\"I think I need to test this out. Hold on...\"<br>\r\n<br>\r\nHe says as he stands up and squats down next to the bench. He then puts his pinky out for you to sit on. You hop onto his finger as he stands up.<br>\r\n<br>\r\n\"Woah, that's amazing...\" He says in amazement.<br>\r\n<br>\r\n\"I've got to get ready for the match though so I'll leave you here.\"<br>\r\n<br>\r\nHe says as he places you on top of his locker and turns arounds.<br>\r\n<br>\r\n\"Yeah, that's fine.\" You reply.<br>\r\n<br>\r\nAs he changes into his pro-bending uniform you look down over the edge of the locker to watch his huge body. Your eyes are drawn to his ass for some reason. You follow the contour of his cheeks and admire his big buns. As he bends over the top of his butt crack reveals itself and you notice the small trail of hair that seems to lead deep between his cheeks. <br>\r\n<br>\r\nYou're leaning over the edge of the locker in awe when he stumbles and bumps into the one you're standing on causing you to fall off.<br>\r\n<br>\r\n\"Shit!\"</span></div></div>",
            "created":1597868400,
            "id":2888068,
            "title":"Bolin"
        },
        "154332111":{
            "author_id":"rogerdavis",
            "author_name":"davis ",
            "choices":[
                "He sits on you",
                "Mako sits on you"
            ],
            "content":"<div class=\"\"><div> <span>You shout as you're tiny body descends towards Bolin's giant hair dusted coin slot.<br>\r\n<br>\r\n\"Wait!\"<br>\r\n<br>\r\nYou yell as you dive headfirst into his ass crack.<br>\r\n<br>\r\nYou tumble along his crack before stoping somewhere deep between his plump cheeks.<br>\r\n<br>\r\n\"What the...\" Bolin asks as he turns around and doesn't realizes what has happened.<br>\r\n<br>\r\nHe dismisses the feeling and gives his butt a scratch.<br>\r\n<br>\r\n\"Aah, my butt itches.\" Bolin says scratching.<br>\r\n<br>\r\nUnfortunately your tiny body is pushed farther into his deep manly butt crack from this and you're held in place by his thick ass. You're able to move around a bit and that's when you feel Bolin pull his pants back up over his crack, unknowing of your situation.<br>\r\n<br>\r\nYou wiggle around a bit but you're unable to get out from his butt. You begin to get embarrassed too as you feel your little manhood harden.<br>\r\n<br>\r\n\"Bolin! Help! I'm trapped in your butt!\" You yell.<br>\r\n<br>\r\nBolin, now getting ready for the match, can't hear you. You're trapped.<br>\r\n<br>\r\nThe two of you head to the match with you bouncing up and down in his butt. He still hasn't noticed that you're in there.<br>\r\n<br>\r\nThe match starts and the two teams line up. You're still in Bolin's butt and there doesn't seem to be any way out. You can only hope that he wins or at least doesn't get hurt.<br>\r\n<br>\r\n\"Here we go! First quarter starting!\" The referee shouts.<br>\r\n<br>\r\nBolin takes a step forward.<br>\r\n<br>\r\n\"Go Bolin!\" You hear Mako shout.<br>\r\n<br>\r\n\"Let's do this boys!\" Korra says.<br>\r\n<br>\r\nThe two opponents advance at Bolin who seems to be toying with them. He feints left and right before firing a disk and hitting one opponent with such force the poor soul is sent flying backwards.<br>\r\n<br>\r\nAs for you, you find your tiny self bouncing up and down in Bolin's butt. You're scared out of your mind but it feels so good at the same time. The man's such a beast on the field and right now he's putting all his skill into play.<br>\r\n<br>\r\nHe's already dodged around two opponents and sent one flying with his earthbending. Now he's knocked another one off his feet with another disk.<br>\r\n<br>\r\nHe's building up a sweat, especially in his thick butt which your 1 inch tall body is trapped in.<br>\r\n<br>\r\n\"We got this!\" You hear Mako shout as the rest of the team gets into the action.<br>\r\n<br>\r\nThey easily win the match but Bolin is breathing heavily. He's covered in dirt and sweat and his uniform is drenched. His butt isn't any less sweaty either.<br>\r\n<br>\r\n\"Let's go guys! We won!\" You hear Mako shout.<br>\r\n<br>\r\nThis is almost drowned out by the sound of Bolin's stomach rumbling though.<br>\r\n<br>\r\n\"Bolin! You with us man?\"<br>\r\n<br>\r\n\"Huh?\" He asks scratching his head.<br>\r\n<br>\r\nHe stops and clenches his ass. His butt wiggle a bit as he does.<br>\r\n<br>\r\n\"I think I ate too much fried food yesterday.\" He says and continues walking to the locker room.<br>\r\n<br>\r\nYou can't believe this. He's walking, running, sweating and butt shaking all the way to the locker room after a match while you're still trapped in his butt. And the rumbling seems to move closer towards his ass with each step.<br>\r\n<br>\r\n\"BOLIN GET ME OUT OF HERE!\" You yell.<br>\r\n<br>\r\nHe stops unclenching his butt long enough to release a huge airy fart that blows you into the sweaty and smelly fabric of his briefs.<br>\r\n<br>\r\n\"Ha ha!\" You hear him laugh as he begins changing. \"Got a little airbending in my butt!\"<br>\r\n<br>\r\nA collective \"Ew\" can be heard throughout the locker room.<br>\r\n<br>\r\n\"Bolin! You couldn't wait a few minutes? That's disgusting!\"<br>\r\n<br>\r\n\"Sorry Mako. I just have to release every now and then. Can't be holding it in all the time.\"<br>\r\n<br>\r\nYou roll around in his briefs, gagging from the stench. As he lowers his briefs to step out of them, He notices you poking around in his underwear.<br>\r\n<br>\r\n\"What the heck are you doing?\" He says looking down at you.<br>\r\n<br>\r\n\"You trapped me in your butt!\" You say.<br>\r\n<br>\r\nHe laughs. \"Wait really! That's what the itch was!\"<br>\r\n<br>\r\nYou groan as he picks you up from the pile of dirty clothes and places you on the bench.</span></div></div>",
            "created":1597868580,
            "id":2888070,
            "title":"You fall in his butt crack without him knowing"
        }
    },
    "info":{
        "author_id":"cooldude9404",
        "author_name":"The Boy",
        "brief_description":"Inspired by \"Nicktoons Farts\"",
        "created":1329866640,
        "description":"<td align=\"left\" class=\"norm\">• Inspired by the deleted story Nicktoon Farts<br>\r\n• Only men can fart<br>\r\n• <span style=\"text-decoration:line-through\">Sexual antics are accepted, but don't go too far (ex. tea-bagging is okay, taking dick out of pants=not okay)</span><br>\r\nEDIT: So I've decided that all sexual activity is okay.<br>\r\n• Mostly Butt and Fart torture<br>\r\n• No Abrupt Ending<br>\r\n• No death<br>\r\n* Have fun</td>",
        "id":1849810,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597868580,
        "modified":1597868580,
        "pretty_title":"Nicktoons guys STINK"
    }
}