{
    "chapters":{
        "1":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Yukari Takeba",
                "Mitsuru Kirijo",
                "Fuuka Yamagishi",
                "Aigis",
                "Other Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Obviously, we need to choose which female we want to expand first. If none of the main ladies suit your fancy, there are other choices as well.</span></div></span></div>",
            "created":1252904400,
            "id":760428,
            "title":"Choose Your Female!"
        },
        "11":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Weight Gain",
                "Inflation/Gas/Water",
                "Pregnancy",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Probably the most normal of the girls in terms of personality, Yukari is usually friendly and tends to show her emotions alot more than Mitsuru or Fuuka. She's pretty average, to tell the truth. She's the one who gave Junpei the nickname of 'Stupei'. She's close with both Minato and Mitsuru.<br>\r\n<br>\r\n<br>\r\nHow shall she get bigger?</span></div></div>",
            "created":1252990800,
            "id":760839,
            "title":"Yukari Takeba"
        },
        "111":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Stuffing/Force Fed",
                "Magic",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yukari Takeba is going to gain weight, but how?</span></div></span></div>",
            "created":1255237200,
            "id":773667,
            "title":"Weight Gain"
        },
        "1111":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Stuff Herself",
                "Be force Fed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yukari is either going to stuff herself or be force fed.</span></div></span></div>",
            "created":1255237200,
            "id":773668,
            "title":"Stuffing/Force Fed"
        },
        "11111":{
            "author_id":"dleagueman",
            "author_name":"DLM",
            "choices":[
                "Love",
                "Laziness"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what will be the reason for stuffing herself with food?</span></div></span></div>",
            "created":1406213940,
            "id":1832922,
            "title":"Stuff Herself"
        },
        "111112":{
            "author_id":"shinyespeon64",
            "author_name":"ShinyEspeon64",
            "choices":[
                "The next day she goes to a all you can eat buffet to stuff herself ",
                "She eats everything in her dorm to stuff herself"
            ],
            "content":"<div class=\"\"><div> <span>After S.E.E.S. defeated Erebus Yukari slowly became lazy and got a much bigger appetite and rarely went to archery practice. On the 18th of April the archery team kicked her off mainly because she was almost never their and she was getting bad at aiming when she was their. Since then Yukari did start gaining because of what she dose with her time now. She wakes up eats a big breakfast goes to school eats a lot at lunch goes home and do stuff that dose not require walking. She started getting flab on her stomach and thighs then everywhere else. Yukari did notice but she did not mind to much \"Hmm this is probably because I don't do much but I like how my body is softer now.\" Yukari now weighs 147 pounds (I have no idea now kg work :/) her belly is getting bigger it is around the size of half a soccer ball her breast are plumping up she (witch she likes.) her arms are flabby along with her plump legs and is forming a double chin. Yukari debated with herself for a little bit if she wanted to gain more after 10 minutes she figured their is no avoiding it mainly because she only walks to get food and go to the bathroom at her dorm. She ordered two pizzas and snacked on chips when waiting. After she ate the pizzas she started hurting but she did know that she was getting bigger witch she deiced to purposely get fat because she  liked being soft and she knew she was going to get more lazy. </span></div></div>",
            "created":1406752320,
            "id":1835529,
            "title":"Laziness"
        },
        "1111121":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "She was meeting Mitsuru and Fuuka at the cake shop.",
                "She was entering a competitive eating competition, and Akihiko is her coach."
            ],
            "content":"<div class=\"\"><div> <span>Yukari said to herself as she walked down the street. She noticed a bizzare sign that said \"Want something sweet? Then come on down to Byakuya's Cake Emporium! We're the only place on Eart that has an all you can eat cake buffet!\"<br>\r\n<br>\r\n\"Lets see.......they open.........TODAY! YES!\" Yukari yelled with glee.<br>\r\n<br>\r\nYukari immediately went to the cake shop.<br>\r\n\"May I help you miss?\"<br>\r\n\"Yes.\" Yukari said. \"I would like to eat at your all you can eat buffet.\"<br>\r\n---<br>\r\n<br>\r\nTwo weeks later.<br>\r\n<br>\r\n\"Dang, I can't *mmph* get my pants on\" Yukari said as she ate a piece of lemon filled cake.<br>\r\n<br>\r\nYukari now weighed 177 pounds. The weight was evenly distributed, and she was now growing a double chin.<br>\r\n<br>\r\n\"Whew. Finally. I got these stupid pants on. Hopefully, I won't be late to the meeting.\"</span></div></div>",
            "created":1406753640,
            "id":1835539,
            "title":"\"I could really go for something sweet...\""
        },
        "11111211":{
            "author_id":"shinyespeon64",
            "author_name":"ShinyEspeon64",
            "choices":[
                "Goes shopping",
                "Goes home"
            ],
            "content":"<div class=\"\"><div> <span>\"Your'e late Yukari.\" Mitsuru said to Yukari trying to keep her pants buttoned.<br>\r\n<br>\r\n\"Sorry it's just that it took me forever to get these on.\" Yukari said<br>\r\n\"Well we did not get anything yet so no harm done.\" Fuuka said to Yukari.<br>\r\n<br>\r\nBoth Fuuka and Mitsuru did start gaining weight from hanging out with Yukari. (mainly because Yukari's appetite and laziness started rubbing off  on them)<br>\r\n---<br>\r\n<br>\r\nA few minutes later<br>\r\n<br>\r\nAt their table their was quite a few cakes with lemon or chocolate filling (most on Yukari's side.)<br>\r\n<br>\r\nMost of the time their was silent mainly because the three were to busy stuffing their faces to remember what they were their for until Yukari finished her 1st out of 9 cakes where her pants popped.<br>\r\n<br>\r\n\"Now I can see why you were late now.\" Mitsuru said smugly <br>\r\n<br>\r\nYukari took her belly and let it hang for comfort and she keep eating the cakes one by one when she finished her most of her belly was visible<br>\r\n<br>\r\n\"Yukari you should buy new more outfits.\"<br>\r\n<br>\r\n\"You know what.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1406766900,
            "id":1835609,
            "title":"I need quite a few sweets"
        },
        "111112111":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "2 years later...",
                "Yukari becomes a BBW model."
            ],
            "content":"<div class=\"\"><div> <span>\"Takeba are you *urp* almost finished?\"<br>\r\n\"Senpai, don't rush her!\"<br>\r\n<br>\r\nMitsuru and Fuuka had gained more than a little weight since they started hanging out with Yukari. They had both gained 80 pounds. Their stomachs were much pudgier. Mitsuru's face had become much chubbier, and she now had puffier cheeks and a second chin. Mitsurus breasts were now minature globes of fat that rested on top of her paunch middle. Fuuka's butt was now a giant round sphere that she had difficulty fitting into doors.<br>\r\n<br>\r\n\"Okay! I'be finished changing!\" Yukari said as she got out of the changing room.<br>\r\n<br>\r\nYukari was wearing a pink moo moo that fit her new fat frame quite well.<br>\r\n<br>\r\n\"I found this in the maternity section. I didn't think that people made moo moo's for pregnant women, but I guess that you learn something new everyday, huh?\"</span></div></div>",
            "created":1407038160,
            "id":1836698,
            "title":"This is gonna be \"sweet\"!"
        },
        "1111121112":{
            "author_id":"shinyespeon64",
            "author_name":"ShinyEspeon64",
            "choices":[
                "Yukari dose it alone",
                "Yukari invites Mitsuru and Fukka to be BBW models with her"
            ],
            "content":"<div class=\"\"><div> <span>Yukari started to love everything about being fat. She loved how soft her body was, she loved on how much more plump her boobs and her ass and thighs are, she loved eating a lot more when S.E.E.S. was active.<br>\r\n<br>\r\nBut for some time she felt that she was alone with her opinion but she found that there is a surprisingly large (no pun intended) community of people that loved being fat and people that love fat girls.<br>\r\n<br>\r\n\"Well what do you know.\" Yukari thought out-loud. Yukari found models that were just as fat or fatter then her and found art of fat girls.<br>\r\n<br>\r\nYukari thought about it while looking at her self Yukari as of now is 242 pounds her face is squishy and just soft and works well with the rest of her body with an obvious double chin that wiggled every time she moved or laughed. Her boobs despite being big are small when compared to Mitsuru's they are like two cantaloupes her arm fat is all wiggly when she moves them around and like her face also jiggle and belly. Speaking of her belly it is trying to from a roll in the middle and when naked hang's to her crotch it is the biggest thing on her body with out a doubt. Her love handles make it almost impossible to wear jeans but they push her hips out adding a very sexy look to even those who are not fas. Her thighs are like small logs of fat that jiggle with every step along with smaller but by no means small caffs.<br>\r\n<br>\r\nYukari deiced after some thinking that it would be a good course of action.<br>\r\n<br>\r\nI mean it is not like she is getting smaller any time soon and with her large appetite and stretched out stomach she would only get larger and larger.<br>\r\n<br>\r\nNot to mention that she did kinda need more money I mean she lives with Fukka and Mitsuru but they do need to buy their own food.<br>\r\n<br>\r\n\"Hmm now that I think about it would Mitsuru-Senpai and Fukka want to be part of this to we just sit around use the internet watch TV and Fukka plays video games.\"   </span></div></div>",
            "created":1436165460,
            "id":2003953,
            "title":"Yukari's \"big\" discovery "
        },
        "11112":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Shadow",
                "Freinds/Classmates"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone is going to force feed Yukari, but who?</span></div></span></div>",
            "created":1255237200,
            "id":773669,
            "title":"Be Force Fed"
        },
        "111122":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Attraction",
                "Revenge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yukari is going to be fed by someone! Why?</span></div></span></div>",
            "created":1255237200,
            "id":773670,
            "title":"Freinds/Classmates"
        },
        "1111221":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "Mitsuru",
                "Minako"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will plump Yukari up?</span></div></span></div>",
            "created":1390149780,
            "id":1729903,
            "title":"Attraction"
        },
        "1111222":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "Mitsuru",
                "Aigis"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who wants revenge on Yukari?</span></div></span></div>",
            "created":1390149840,
            "id":1729906,
            "title":"Revenge"
        },
        "11112222":{
            "author_id":"kangaroo43",
            "author_name":"yellowturkey",
            "choices":[
                "Pure concentrated lard (horrific taste but best result of fattening)",
                "Heavy meats coated with lots of fat mixed with gallons of chocolate milkshakes"
            ],
            "content":"<div class=\"\"><div> <span>Its been 3 weeks since everyone from the dorm has moved out but Aigis and Yukari, however Aigis has always been jealous of Yukari in the past for always being the center of attention to the main protagonist. Not to mention she being a robot and her being a human makes things hard to have a normal life, Aigis thought to herself that if she can't leave the house to due her \"circumstances of being a robot\" then why should Yukari. <br>\r\n<br>\r\nUpon doing a maintenance at night on her software, she accidently downloaded a virus that had numberous information of a special weight gain machine that can be used to make somebody morbidly obese and way too fat to move. She was pleased with this rare find and thought to herself, this will be the perfect option to make her feel her pain being forced to stay at home and being so close to the main protagonist before he died. So Aigis built the machine in 3 hours due to her supernatural speed and processor for a brain, the machine consisted of a chair that can extend in very wide angles, a tube that attaches to the mouth and holds onto the neck, and a gigantic vat that can hold all the fattening materials to pump her up with. With how fast the machine can pump and its ability to determine when to stop it will be no time before Yukari becomes a gigantic blob. Now the question is before Yukari comes home from school, what materials should be used to help fatten her up?<br>\r\n<br>\r\n</span></div></div>",
            "created":1407903540,
            "id":1840808,
            "title":"Aigis"
        },
        "111122221":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "\"Sure, Aigis. Anything for you.\"",
                "\"No.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><i>Yes.</i> Aigis thought to herself. <i>This will be perfect!</i><br>\r\n<br>\r\n\"Takeba.\"<br>\r\n\"Yes, Aigis?\"<br>\r\n\"I wanted to discuss something with you. Could you please meet me in my room in two hours?\"</span></div></span></div>",
            "created":1408081860,
            "id":1841638,
            "title":"When in doubt, lard it out...."
        },
        "12":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Weight Gain",
                "Inflation/Gas",
                "Pregnancy",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Mitsuru Kirijo, the ice-cold Empress and heir to the Kirijo Corporation. She is an intelligent and beautiful woman with long red hair the color of blood. She is the oldest member of SEES alongside Akihiko and Shinjiro. She may act serious and distant at first, but she has a hidden sweet side.<br>\r\n<br>\r\nHow shall this lovely lady (and my personal favorite) get bigger?</span></div></div>",
            "created":1252904400,
            "id":760449,
            "title":"Mitsuru Kirijo"
        },
        "121":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "During their Social Link dates, Minato takes Mitsuru to alot of fast food places",
                "Losing both her father and Minato has made Mitsuru comfort herself with food",
                "Other Plotlines"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are some plotlines we can use to help give a valid reason for why Mitsuru is getting fatter. Which shall it be?</span></div></span></div>",
            "created":1252990800,
            "id":760841,
            "title":"Mitsuru gets fat...how?"
        },
        "1211":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "One week later...",
                "Yukari has gained weight too.",
                "Minato likes thick girls."
            ],
            "content":"<div class=\"\"><div> <span>Mitsuru had just started to hang out with Minato last week, and she couldn't be any happier. He was smart, charming, and pretty cute, too.<br>\r\n<br>\r\n<br>\r\nThey had eaten at all sorts of fast food restaurants. Mitsuru had gained 15 pounds over this one week period, but she did not seem to notice this,</span></div></div>",
            "created":1406208300,
            "id":1832899,
            "title":"Wild Duck Burger."
        },
        "1212":{
            "author_id":"dragonage2ftw",
            "author_name":"Dragonage2ftw",
            "choices":[
                "Mitsuru goes to Wild Duck Burger.",
                "Mitsuru orders ramen.",
                "Mitsuru goes to the sweet shop with Yukari."
            ],
            "content":"<div class=\"\"><div> <span>It had been two days since Minato had died, and Mitsuru couldn't be any sadder. Who could blame her? She had just recently got over the death of her father, and now her boyfriend is dead as well. It was enough to drive most people to insanity. Mitsuru sighed as she layed on her bed, staring at the ceiling.<br>\r\n<br>\r\nThe silence was interrupted by the sound of her growling stomach.<br>\r\n<br>\r\n<i>It's been a whole day since I last ate. I might as well get something to eat.</i>Mitsuru thought to herself.</span></div></div>",
            "created":1402866000,
            "id":1812624,
            "title":"Losing both her father and Minato has made Mits..."
        },
        "1213":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Mitsuru is cursed by a Shadow's spell that makes her grow fat",
                "Yukari tricks Mitsuru into getting fat for her own pleasure (yuri path)",
                "Even more choices for Mitsuru!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some other reasons that the red-haired beauty can gain...</span></div></span></div>",
            "created":1252990800,
            "id":760842,
            "title":"Other Plotlines for Mitsuru"
        },
        "123":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Shadow spell",
                "Parting gift from Minato",
                "She finds true love"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Mitsuru become a mommy?</span></div></span></div>",
            "created":1255150800,
            "id":773358,
            "title":"Pregnancy options"
        },
        "1231":{
            "author_id":"vfanatic",
            "author_name":"Vfan",
            "choices":[
                "Mitsuru gives birth one by one, growing a bond which each child.",
                "Mitsuru has all at once, ensuring a large belly but unable to teach all kids",
                "Mitsuru confronts SEES and asks for their help and opinion."
            ],
            "content":"<div class=\"\"><div> <span>It had been a year since Mitsuru lost her close friend Minato and disbanded SEES, she was on a cruise ship for the Kirijo's, the wind blew her hair around. \"It's almost time for me to become the CEO of the company, Father I will keep your company strong.\"<br>\r\n<br>\r\nMitsuru sat on a deck chair reading a book, looking up she saw a familiar figure. \"No...it can't be!\"<br>\r\n<br>\r\nShe got up and ran around the corner and looked around, nothing, she gasped as a hand touched her. \"Miss Kirijo are you okay?\"<br>\r\n<br>\r\n\"Oh, yeah, I'm fine.\" She said.<br>\r\n<br>\r\nLater that night Mitsuru was in the shower washing herself, the hot water making steam come off her body, she stepped out having finished her shower, she cleaned off the mirror, something seemed off when she looked, she turned to the side, did she put on a pound or two? That's the only thing she asked herself. \"Must be nothing.\"<br>\r\n<br>\r\nShe sat on the bed getting ready to call it a night. \"I'm feeling hungry.\"<br>\r\n<br>\r\nWalking over to a fridge Mitsuru opened it up and ate a fresh sandwich and sat down, eating, she looked through some magazines she brought with her that Yukari suggested, for some reason she was looking over the Maternity section. \"These women, they have a motherly glow, hmmp wonder if I'll have such a thing. No...I won't have time to settle down.\"<br>\r\n<br>\r\n\"Hmm hmm hmm, I wonder...if that's as true as you think?\" Mitsuru turned to the door seeing Takaya.<br>\r\n<br>\r\n\"You! But...you're supposed to be dead!\"<br>\r\n<br>\r\n\"Oh I am Miss Kirijo, I'm a...Shadow of the Past if you will.\"<br>\r\n<br>\r\nMitsuru went to get an Evoker she had just in case but Takaya was holding it. \"Looking for this?\"<br>\r\n<br>\r\n\"No...\"<br>\r\n<br>\r\n\"Oh don't worry, I'm not here to kill you, in fact...I CAN'T kill you.\"<br>\r\n<br>\r\n\"What do you mean Takaya?\" Mitsuru asked suspicious.<br>\r\n<br>\r\n\"I can't kill you because like I said, I'm a Shadow. The real Takaya is in fact dead, but his strong desire to see Nyx destroy all humanity...lives on through me, his Shadow. His shadow bore from hate against this world and it's insignificant people.\"<br>\r\n<br>\r\n\"You're...a Shadow!?\" Mitsuru said.<br>\r\n<br>\r\n\"Yes, and I've come to tell you that you my dear miss Kirijo have a nasty curse about you now.\"<br>\r\n<br>\r\n\"C-Curse?\"<br>\r\n<br>\r\n\"It seems Nyx had one last trump card up her sleeve, if the Death Arcana couldn't stop you all, then the World Arcana will.\"<br>\r\n<br>\r\n\"You mean...there's something stronger then Nyx coming!?\" Mitsuru was in shock.<br>\r\n<br>\r\n\"Oh it's already started, inside your womb that is, see you my dear Miss Kirijo, are going to be the mother of 20 Bouncing baby shadows all of the Aracana that are needed to from The World. Oh they'll LOOK human, but they'll be shadows through and through; instinct, mission, all of it. Then once they're here they'll fuse into the World Arcana shadow that Nyx has planned, and this world will be dust.\"<br>\r\n<br>\r\nMitsuru gasped running a hand down her stomach the Shadow Takaya laughed. \"Yes you can feel it can't you Miss Kirijo?\"<br>\r\n<br>\r\n\"I'll find a way to stop it.\"<br>\r\n<br>\r\n\"Heh good luck, oh and I'll send flowers when the little bundles of Death are born.\" The Shadow Takaya vanished.<br>\r\n<br>\r\nMitsuru fell to ground and began to cry. \"WHY!? WHEN WITH THIS BE OVER!?\"<br>\r\n<br>\r\nShe wrapped her hands around her stomach, grabbing a knife she held it up high, but she couldn't. She remembered what Shadow Takaya said, that they'll look human. Could they not only look, but be human? Could Mitsuru change this all and prevent the world's destruction by forming a bond with her future children? If they came one by one she could teach each child like a mother would, if they came at once she'd have a hard time teaching 20 kids at once. Maybe advice from her old friends could help.<br>\r\n<br>\r\nWhat is Mitsuru's fate?</span></div></div>",
            "created":1255150800,
            "id":773369,
            "title":"The Next One"
        },
        "13":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Weight Gain",
                "Inflation/Gas/Water",
                "Pregnancy",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>A short and timid girl, Fuuka helps direct Minato and the others as they traverse through the many floors of Tartarus. She has short green hair and is usually rather quiet. She is also a bit of a computer geek, and is usually on her laptop most of the day. She was rescued by SEES and became a member of the group when it was discovered she could summon a Persona. She is terrible at cooking, but strives to become better.</span></div></div>",
            "created":1252990800,
            "id":760844,
            "title":"Fuuka Yamagishi"
        },
        "131":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Her constant attempts at cooking (and eating it) has affected her waistline",
                "Laziness due to being the only SEES member who doesn't fight",
                "Other Choices for Fuuka"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How shall Fuuka Yamagishi fatten up for your pleasure?</span></div></span></div>",
            "created":1253163600,
            "id":761690,
            "title":"Fuuka's Gain"
        },
        "14":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight gain",
                "Inflation/Air/Water/Blueberry",
                "Pregnant",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which expansion is Aigis is going to become?</span></div></span></div>",
            "created":1258261200,
            "id":791943,
            "title":"Aigis"
        },
        "141":{
            "author_id":"therealfake",
            "author_name":"Therealfake",
            "choices":[
                "Ask Arisato to take her out to eat",
                "Borrow money from Junpei for food",
                "See if she could eat the potted plants"
            ],
            "content":"<div class=\"\"><div> <span>Aigis stood in the fourth floor command room. Only Mitsuru was present as she stood in front of her.<br>\r\n<br>\r\n\"Is something the matter Mitsuru-San?\" Aigis asked in her semi-monotone voice. Her robotic eyes reflected curiosity within as she stared at the red-haired young woman before her.<br>\r\n<br>\r\n\"There you are Aigis\" Mitsuru said, keeping her usual calm demeanor. \"The Chairman stepped out, but he wanted me to tell you, as you're now attending school with us, he wanted to add a new feature.\"<br>\r\n<br>\r\nAigis seemed confused and curious. \"New...feature?\"<br>\r\n<br>\r\n\"Yes. You have been fitted with an additional energy system that will enhance your parameters in combat. Finding out how to power it without leading to overheated presented some difficulties. However, some of the scientists proposed that it be fitted as a sort of synthetic stomach. In other words, you generate new energy by eating, similar to human beings, which will also help camouflage you further as a human being.\"<br>\r\n<br>\r\nAigis paused. She realized that human beings did need nourishment from food in order to go achieve the energy needed to go about their daily actions.<br>\r\n<br>\r\n\"Very well.\" Aigis responded. \"I shall accept this 'stomach' so that I may further appear as a human being.\"<br>\r\n<br>\r\n--------------<br>\r\n<br>\r\nLater the next day, Aigis walked up to the roof with bag lunch in hand. From what she saw, eating on the roof was a popular way for students to spend their lunchtime. She opened the bag, pulling out a sandwich; cuts of ham, cheese and lettuces with mayo between two round, toasted bread buns. She opened her mouth, took a bite, chewing as crumbs stuck around her lips.<br>\r\n<br>\r\n\"Taste buds...operating at...93% efficiency...\" She said to herself with a mouthful of food as she chewed. Luckily she was sitting in a corner as she said this to herself, so no one overheard her.<br>\r\n<br>\r\nShe continued to eat. As she didn't need to worry about oxygen and breathing, and thus choking, she ate down her sandwich fast. She reached back into the bag, pulling out a bag of potato chips. She popped open the bag and quickly stuffed the crispy chips into her mouth. Other students stared in awe, assuming her to be gluttonous.<br>\r\n<br>\r\nThey weren't wholly wrong.<br>\r\n<br>\r\nWhile Aigis had a rather simple lunch to herself, her new battery had only received a 6% increase in stored power from what she had eaten, sitting at 31% now.<br>\r\n<br>\r\n\"I should bring my stored energy up to 100% before we next go to Tartarus.\" Aigis said to herself.<br>\r\n<br>\r\nShe slowly picked herself up from where she sat and decided to...</span></div></div>",
            "created":1354424400,
            "id":1480363,
            "title":"New Battery Pack"
        },
        "15":{
            "author_id":"felio",
            "author_name":"Jimmy",
            "choices":[
                "Metis",
                "Chidori",
                "Elizabeth",
                "Yuko Nishiwaki",
                "Chihiro Fushimi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some other girls we can make bigger...</span></div></span></div>",
            "created":1252904400,
            "id":760432,
            "title":"Other Choices"
        },
        "155":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "Continue with Chihiro",
                "Go with Fem Protagonist"
            ],
            "content":"<div class=\"\"><div> <span>Chihiro is a wonderful girl...but thanks to Persona 3 Portable Atlus has introduced a new girl into the mix.<br>\r\n<br>\r\nCurrently she is nameless (although even after release she may end up like Devil Survivor's lead and be known simply as \"Protagonist\") regardless she is the new optional heroine for P3P.<br>\r\n<br>\r\nSo how about it, stay on route with Chihiro or go with the new girl?</span></div></div>",
            "created":1252904400,
            "id":760552,
            "title":"Hold on a second..."
        },
        "1551":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Weight Gain/Stuffing",
                "Pregnancy",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will this shy, bespectacled treasurer expand? You have a variety...okay, well just 3, choices to consider...</span></div></span></div>",
            "created":1261026000,
            "id":806785,
            "title":"Continue with Chihiro"
        },
        "15512":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "Shadows!",
                "A result of one of her and Minato's 'Special Evenings' together~ "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Miracle of life, huh? Shall this bundle of joy manifest from a vile construct of hatred and misery or a passionate evening from Persona 3's Pimp- I mean, Protaganist?</span></div></span></div>",
            "created":1261026000,
            "id":806789,
            "title":"Pregnancy"
        },
        "155122":{
            "author_id":"roninmogura",
            "author_name":"Ronin Mogura",
            "choices":[
                "After awaking, Chihiro is feeling a bit queasy...",
                "The morning arrives without incident."
            ],
            "content":"<div class=\"\"><div> <span>She was always afraid...Scared that they would harm her...<br>\r\n<br>\r\nAnd yet, after she had met Minato Arisato...the fear that once gripped her, soon began to release it's hold upon her, until eventually...she was free from it's grasp. Finally able to speak for herself, be strong for herself...and it was all thanks to Minato. With his guidence and support she was able to overcome this, and transform into a whole new person...well, she was still a bit timid, but not nearly as much as she was before. Now that she had conquered this with Minato, Chihiro began to notice something else...that she loved him. <br>\r\n<br>\r\nAnd after giving him a manga she once read, as a token of her appreciation for helping her, Chihiro and Minato had already began 'going out', and although Chihiro felt 'selfish' for having him all to herself, this emotion was soon over powered by that of sexual pleasure as she and Minato became one on that faithful night...<br>\r\n<br>\r\n--------- <br>\r\n<br>\r\n\"Minato-san...\" Chihiro gasped her arms wrapping around the neck of the teenager who lay atop her body, his hands still groping her nude bosom. It was a first for her...and her lover, the both of them having finally made it to the next level of their relationship by the means of joining as one and sharing their heated passion in a wondrous, but short, sexual encounter. Chihiro was afraid at first...but this was Minato, the one who helped her become strong, there was no reason to be afraid of the man who helped transform her into a better woman. \"...I love you...\" <br>\r\n<br>\r\n\"'Love you too...\" Minato replied bringing his head down and locking his lips with hers in a passionate kiss. As much as he wanted to stay and let her nestle into his chest...he had to get going. It was getting late, and not only did he have school tomorrow, he didn't want others finding out about what he and Chihiro just did together. Although premarital sex was somewhat uncommon amongst the youth in Port Island City...it was still an immoral thing to do, regardless of if the two loved each other or not.<br>\r\n<br>\r\nAs Minato arose from her lips, she could see it in his eyes, the fact that he had to leave so early even though she was just getting warmed up to him. \"...You have to go...don't you...\" Chihiro said, crestfallen that he had to leave her. But she knew it was for the best...<br>\r\n<br>\r\n\"Yeah...afraid so...\" Minato sighed as he arose from Chihiro's bed and searched for his underwear and trousers, finding them haphazardly thrown almost clear across the room. It was almost funny, how the initial trip to the bed and everything thereafter was nothing but a blur to him. Only the act of making love to Chihiro was what his mind could fathom from him even being here in the first place...not that he minded it. As he pulled out of Chihiro's womanhood (the two of them having remained locked together like this even after he came inside her), he quickly made haste to his underwear and pants, slipping on the former first before his eyes came to see Chihiro covering her own. \"Heh, why're you afraid to look?\"<br>\r\n<br>\r\n\"Ah...I don't really know...\" Chihiro replied a blush still reddening her cheeks as she giggled in light of her own actions. \"I guess, I have to get used to us doing this, huh Minato-san...\"<br>\r\n<br>\r\n\"Yeah, this was our first time...\" Minato said with a smile pulling up his black, uniform pants, zipping the fly of them up and searching for his shirt and jacket. He had to get back before Junpei did, if not then he'd surely ask a number of questions that Minato...just wouldn't want to answer just yet. He glanced up to Chihiro who lay on her side, her breasts were...a bit larger than he imagined, but that made intercourse all the more enjoyable. Watching them bounce and jiggle about was a definite plus for the experience. \"Ah, do...do you have club meeting tomorrow?\"<br>\r\n<br>\r\n\"Ah, right I forgot that I did!\" Chihiro perked up, now having realized her duties as the treasurer still remained even though her cowardice didn't. \"Although...not much has been happening now, but I guess we still have to meet...\"<br>\r\n<br>\r\n\"Hm, it has been quiet lately...\" Minato hummed slipping on his shirt and jacket, his headphones still in the pocket of his uniform jacket. \"Well, I'll see ya at school tomorrow.\"<br>\r\n<br>\r\n\"G-goodbye, Minato-san...\" Chihiro smiled warmly to the young man as he parted with her, waving her had to him. \"You...you're going to be back right...?\" Chihiro spoke up, suddenly sitting up in her bed causing her breasts to shake from the sudden movement of her body. <br>\r\n<br>\r\n\"Of course, you're amazing, Chihiro-chan.\" Minato replied with a smile, the gesture getting Chihiro face to redden once more, before he left her room completely.<br>\r\n<br>\r\nFlopping on her back; naked in bed, and giggling at the joyous feeling that was aflutter in her chest, Chihiro soon realized just how late it truly was. It was far later than she had first remembered. Looking out the window, she could see some of the evening lights of the city beginning to illuminate the dusk colored streets and less people roaming around. Perhaps she and Minato went at it a bit too long...<br>\r\n<br>\r\nOh well, no matter how long it was...it was wonderful. The closeness the two of them shared, the passion of the moment. If it weren't for the moral issue of premarital sex, then Chihiro would be in absolute bliss at the moment. Feeling sluggish from having expended most of her evening energy during the inital love making, Chirhio pulled the covers over her nude frame and fell asleep...</span></div></div>",
            "created":1261026000,
            "id":806905,
            "title":"Unbreakable"
        },
        "1552":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "Weight Gain",
                "Inflation/Gas",
                "Body Expansion or some other method"
            ],
            "content":"<div class=\"\"><div> <span>As already stated not much is known at the moment about our new heroine outside of her appearing to be a bit more emotionally \"happy\" then the original hero, along with Aigis, Pharos, and Ryouji still being apart of her story (as can Elizabeth by the way).<br>\r\n<br>\r\nAlso as mentioned she currently has no name but given the original hero's manga name and the fact that it was seemingly the first to be given to her by the fanbase let us for the time-being refer to her as \"Minako Arisato\", or Mina for short.<br>\r\n<br>\r\nSo how will the new leading lady begin to swell in weight?</span></div></div>",
            "created":1252904400,
            "id":760560,
            "title":"Protagonist-Chan"
        },
        "15521":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Naturally",
                "Force fed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Via her own efforts or being force fed?</span></div></span></div>",
            "created":1600499760,
            "id":2905790,
            "title":"Weight Gain"
        },
        "15523":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "Breast Expansion or Butt Expansion",
                "Other form of gaining..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here a decision will be made if the fem protagonist will gain through a body expansion (more in her breasts or butt then anywhere else) or if another gaining option has to be made.</span></div></span></div>",
            "created":1252904400,
            "id":760562,
            "title":"Body Expansion or some other method"
        },
        "155232":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "We go with Minako!",
                "Metis and Labryis, away!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oi wait! We have the other robots as well to choose from!</span></div></span></div>",
            "created":1600499100,
            "id":2905786,
            "title":"ROBOTS"
        },
        "1552322":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Metis",
                "Labyris"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now, Metis or Labyris?</span></div></span></div>",
            "created":1600499820,
            "id":2905791,
            "title":"Choose your machine"
        }
    },
    "info":{
        "author_id":"felio",
        "author_name":"Jimmy",
        "brief_description":"The girls of the popular game Persona 3 get bigger!",
        "created":1252948200,
        "description":"<td align=\"left\" class=\"norm\">The female characters of Shin Megami Tensei: Persona 3 begin to get large through the path that you choose! Even the robots, Aigis and Metis, will also find themselves plumping up! How they get big is up to you...!!<br>\r\n<br>\r\nNo male weight gain, gore, or anthropormorphic transformations allowed.<br>\r\n<br>\r\nVore and explicit sex scenes are.<br>\r\n<br>\r\nPlease make additions, and enjoy!</td>",
        "id":1599630,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600499820,
        "modified":1600499820,
        "pretty_title":"Persona 3 F.A.T."
    }
}