{
    "chapters":{
        "1":{
            "author_id":"dragonburb",
            "author_name":"Azur",
            "choices":[
                "Put my mind into hers",
                "Explain this to Dad"
            ],
            "content":"<div class=\"\"><div> <span>As nick was walking down his street after hanging out at a friends house he saw something catch his eye. Behind some trees in the park there was a girl looking very happy and a fat middle age dude on the ground.<br>\r\nWounder what was going on I snuck up to a tree close to them.<br>\r\n<br>\r\n\"I can't believe that the device works I now have this hot body all to myself this is great.\"<br>\r\n<br>\r\n'Wait what is she talking about what device this isn't making sense why is she talking like that's not her body' I thought to myself<br>\r\n<br>\r\nAs I was thinking about what she is talking about I saw a strange remote looking thing on the ground not far from the tree, quickly grabbing it and hiding again I looked at the large screen that covered the upper half of the device it showed a line of text saying <i>Mind Stored</i> with two options below it to paste or delete.<br>\r\n<br>\r\nLooking lower on the screen it showed a name of the stored mind <i>Sally Brooks</i>.<br>\r\n<br>\r\nRealizing but still not fully believing that this device took the mind out of this Sally person and I'm guess put the mind of the man that's on the ground which means he is just a shell now.<br>\r\n<br>\r\nLooking back around the tree the lady was gone probably of to enjoy her new life but the body was still here not wanting to be caught with it I ran home. I ran past my mom and up to my room closing the door.<br>\r\n<br>\r\nThis can't be real I have a device that can make anyone I know into a lifeless doll and I can even put myself into them.<br>\r\n<br>\r\nAll of a sudden my door open hiding the device behind me I turned to see my mom.<br>\r\n<br>\r\n\"You where in quite a rush there I didn't get to tell you your father and I are going out to dinner tonight and you will have to fend for yourself.\"<br>\r\n<br>\r\n\"Okay I guess I will have pizza.\"<br>\r\n<br>\r\n\"Just remember to clean up this time and not leave the box on the kitchen table.\"<br>\r\n<br>\r\n\"Yeah I know.\"<br>\r\n<br>\r\nAs my mom turned around to leave the idea hit me I should test out the device on mom my sisters at a friends and my Dad wound't be home for a while.<br>\r\nPointing the device at her I push the giant button on the center of the device but nothing happened as my mom left I looked at the device, all the screen said was <i>can not have two saved minds</i>.<br>\r\n<br>\r\n\"Wait so I will have to delete Sally's mind before I can use it, but if I delete it doesn't that just destroy her mind that would be killing her.\"<br>\r\n<br>\r\n\"But Sally Brooks isn't dead that fat guy is her now which means the only place to put her is in his fat body and I'm sure she doesn't want that so I will just take her out of her misery.\" and I press the delete button.<br>\r\n<br>\r\nSneaking downstairs I saw my mom sitting watching tv.<br>\r\n<br>\r\nI pointed the device at her and pressed the button and she fell limp the device read mind saved.<br>\r\n<br>\r\nWalking over to my mom I noticed that her body was limp and had lifeless eyes.<br>\r\n<br>\r\n\"I should move her so that if anyone comes home early they would not react well if the saw mom like this.\"<br>\r\n<br>\r\nI carried my mom upstairs and into my room. Looking at her laying on my bed I had a women's body laying on my bed that I could do anything to granted its my mom but beggars can't be choosers I then started to take of my moms clothes.<br>\r\n<br>\r\nTaking off her shirt I saw the first real boobs with my own eyes they where beautiful mounds I  took of her bra and grabbed them and they where like clay. I can't help but feeling aroused by what I was doing not thinking I reached down and and took off her pants and panties in one motion.<br>\r\n<br>\r\nPutting my finger into the great unknown I felt like my finger was inside of a wet gave that kept convulsing, I was suddenly pulled out of my trance.<br>\r\n<br>\r\n\"Beth are you here we should head out soon.\"<br>\r\n<br>\r\n\"Crap its Dad I can't just put Moms soul back in and put her clothes on before he gets up here what should I do?\"<br>\r\n</span></div></div>",
            "created":1506510720,
            "id":2392523,
            "title":"Start"
        },
        "11":{
            "author_id":"dragonburb",
            "author_name":"Azur",
            "choices":[
                "To the Date",
                "After the Date"
            ],
            "content":"<div class=\"\"><div> <span>I can probably put on moms clothes fast if she was doing it.quickly grabbing the remote I pointed it at moms body and pressed the transfer button. As my vision burred I suddenly saw my body falling on top of me, quickly pushing it onto the bed I heard Dad coming upstairs I threw on moms pants and her shirt just in time for Dad to open the door.<br>\r\n<br>\r\n\"Nick have you seen ... oh there you are Beth what are you doing in Nicks room?\"<br>\r\n<br>\r\n\"Oh Mark I didn't hear you come home.\"<br>\r\n<br>\r\n\"Yeah I just got home but why are you in Nicks room and why is he sleeping?\"<br>\r\n<br>\r\n\"umm he was feeling sick so I brought him to bed.\"<br>\r\n<br>\r\n\"Oh hope he feels better, anyway you should get ready otherwise we will be late for the reservations.\"<br>\r\n<br>\r\n\"Yeah sure let me finish checking him out the I can  get ready.\"<br>\r\n<br>\r\n\"No he will be fine lets go.\" He started to drag me out of the room and into the master bedroom.<br>\r\n<br>\r\n'crap how am I going to get out of this when dads like this he wouldn't listen if I tried to change back to myself.'<br>\r\n<br>\r\nGoing into my parents room I see a dress that mom had prepared laying on the bed, nervously looking at Dad I saw him in the closet getting his clothes taking off moms clothes only to remember that I didn't put on my Moms underwear because I was in a rush but it was to late Dad already turned around.<br>\r\n<br>\r\n\"Oh going commando today oh I love this little show your putting on.\" As he was saying this he was already standing next to me.<br>\r\n<br>\r\n\"AHH\" I let out a little cream as he grabbed the mounds on that where now on my chest.<br>\r\n<br>\r\n\"Ahh D...Mark please we have a reservation to right.\"<br>\r\n<br>\r\n\"Fine .. but we will finish this when we get home.\" He whisper into my ear.<br>\r\n<br>\r\n'ah I just threw up in my mouth'<br>\r\n<br>\r\nguess there is no way to change back which means I have to go on a date with my father.</span></div></div>",
            "created":1506513360,
            "id":2392546,
            "title":"Put my mind into hers"
        },
        "112":{
            "author_id":"jarceus",
            "author_name":"Jarceus",
            "choices":[
                "Yes, he leaves you be for now",
                "No, he gets what he wants when he wants"
            ],
            "content":"<div class=\"\"><div> <span>The date was probably the most embarrassing and awkward thing I have done in my life. Not only did I have to pretend to be my Mom, but I also had to remember to call Dad Mark. To make matters worse for me, Dad kept on staring at me with such a loving look that it was making me feel weird, in an oddly pleasurable way. I was glad when we got back home and I went back into my parent's room to get undressed. Now, as I take off the dress that I wore on my...date I feel Dad grab my ass from behind.<br>\r\n<br>\r\n\"I did tell you we'd finish this when we got home, didn't I Beth?\" I hear him whisper in my ear making me realise just how screwed I was, figuratively and oh most positively literally if he got his way<br>\r\n<br>\r\n\"Now, Mark, we've had a long night, why don't we get some sleep for the morning?\" I ask my father hoping to every type of god I could think of that he would take my advice<br>\r\n<br>\r\n\"Oh, Beth... That was my idea.\" My father whispered to me, right into my ear. Yep, I am definitely cursing every god I can think of. His tone was that of a sexual nature, the type I'd expect him to say when he wants to get intimate, which I know he does right now<br>\r\n<br>\r\n\"Mark dear, why don't we wait for the morning? After all, it's be a nice wake up call.\" <br>\r\n<br>\r\nDoes he listen to my advise?</span></div></div>",
            "created":1513076700,
            "id":2427033,
            "title":"After the Date"
        },
        "1122":{
            "author_id":"jarceus",
            "author_name":"Jarceus",
            "choices":[
                "In the night",
                "In the morning"
            ],
            "content":"<div class=\"\"><div> <span>Before I can react, Dad pins me to the bed and is already taking his pants off, letting his giant penis flop out as it started to stand, erect<br>\r\n<br>\r\n\"Beth... You know I get what I want after waiting.\" Mark whispers in my ear while an alien pleasure ripples through my body, Mark having thrusted his dick deep into my pussy instantly.<br>\r\n<br>\r\n\"Mm...\" I moan in pleasure as Mark begins to thrust in and out, this caused waves of pleasure to ripple throughout my body, numbing my mind as all thoughts against this left my mind<br>\r\n<br>\r\n\"We know you needed this.\" I hear Mark say as he continues his thrusting, driving his dick in deep, slightly tapping the outside of my womb<br>\r\n<br>\r\n\"Yes...\" I manage to moan out in pleasure as I pull Mark in close, not wanting to let go of this pleasure, against a good portion of my mind telling me that this was wrong<br>\r\n<br>\r\n\"Beth...\" Mark groaned before a massive ripple of pleasure shot through my body as my Dad finally had an orgasm, shooting his semen directly into my womb as we laid on the bed, panting before both Mark and I fell into the loving embrace of sleep</span></div></div>",
            "created":1513256880,
            "id":2427990,
            "title":"No, he gets what he wants when he wants"
        }
    },
    "info":{
        "author_id":"dragonburb",
        "author_name":"Azur",
        "brief_description":"You get a device that takes a persons mind allowing you to send your mind into the doll.",
        "created":1506506580,
        "description":"<td align=\"left\" class=\"norm\">You get a device that takes a persons mind allowing you to send your mind into the empty shell. <br>\r\n-To use the device you much first remove the mind of the person you want to use it on then you can delete the mind of the person or just save it, then you can send you own mind into that of the empty shell turning your body into a empty shell.<br>\r\n<br>\r\n-Nick(18): A closet pervert who gets a device to fulfill his perverted desires . He is 5'6\" and is jokingly mocked by his twin sister who is a little bit taller. Has black short hair, green eyes, and a medium build.<br>\r\n<br>\r\n-Alice(18):Nick's twin sister. Long black hair, green eyes, and medium chest.<br>\r\n<br>\r\n-Beth(37):Nicks Mother. Long blond hair, green eyes, curvy build, large chest.<br>\r\n<br>\r\n-Mark(40):Nicks Father. Short black hair blue eyes, muscular build.<br>\r\n<br>\r\n</td>",
        "id":2135831,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1513256880,
        "modified":1513256880,
        "pretty_title":"Doll Device"
    }
}