{
    "chapters":{
        "1":{
            "author_id":"furrieballoon",
            "author_name":"Chris",
            "choices":[
                "He visits Patrick",
                "He visits Squidward",
                "He goes to work",
                "He goes to Boating School",
                "He decides to stay home"
            ],
            "content":"<div class=\"\"><div> <span>Spongebob Squarepants is a happy, care-free sponge who lives in his pineapple home, and wears square pants. Today he wakes up at the sound of his blaring foghorn alarm.<br>\r\n<br>\r\n\"Good morning, Bikini Bottom!\"<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1171494840,
            "id":382345,
            "title":"Good Morning, Bikini Bottom!"
        },
        "11":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "A seanut butter and jellyfish sandwich",
                "spongebob decides to call up squidward",
                "Spongebob has to do a few errands first before visiting Patrick",
                "Planktin is at the Door"
            ],
            "content":"<div class=\"\"><div> <span>\" I think i'll visit Patrick for a while\", decided Spongebob. \"I think i remember a Bubble Blowing convention opening up in a few hours maybe Patrick will want to come\". Blowing Bubbles is Patrick and Spongebob's favorite thing to do next to annoying Squidward. \"But first I should pack a snack for us to share!!\", he giggled. \"Meow\", groaned Gary, rolling his eyes. \"AWW!! Don't worry gary! You can come too!\" Gary hissed and retreated back upstairs. \"Hmmmmmm. Now what should i pack?\" wondered Spongebob.  </span></div></div>",
            "created":1172600940,
            "id":385540,
            "title":"What's for Lunch?"
        },
        "112":{
            "author_id":"shadowfox83",
            "author_name":"Fox",
            "choices":[
                "Go pay Squidward or Patrick a visit",
                "Get back to packing a meal"
            ],
            "content":"<div class=\"\"><div> <span>Before deciding what to pack a small thought occurs to our spongy friend.<br>\r\n<br>\r\n'Hmm...maybe Squidward would like to come along?'<br>\r\n<br>\r\nMaking his way over to his shellphone, Spongebob rings up Squidward's number, unaware that his often cranky neighbor is as usual still asleep...<br>\r\n<br>\r\nOver at Squidward's the phone blasts it's ring-tone through out the house of Spongebob's co-worker.<br>\r\n<br>\r\nGrumbling to himself the still somewhat sleepy squid lifts himself from his pillow and bed.<br>\r\n<br>\r\n\"Is it time for Spongebob to ruin my day...\" he mumbles to no one in particular before answering the phone.<br>\r\n<br>\r\n\"Hi Squidward!\" he hears Spongebob scream from the other line. 'Yup just as I thought...'<br>\r\n<br>\r\n\"Spongebob what is it?\" Squidward in a somewhat annoyed mood.<br>\r\n<br>\r\n\"I was hoping you'd come with me and Patrick to a Bubble Blowing convention later today.\"<br>\r\n<br>\r\n\"NO!\" yells Squidward in reply to his neighbor's words slamming the phone in the process.<br>\r\n<br>\r\n\"Squidward? Oh well guess he dropped his phone. Now what?\" wonders the happy sponge.</span></div></div>",
            "created":1172629800,
            "id":385658,
            "title":"Calling up Squidward"
        },
        "1121":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "spongebob breaks into Squidward's house"
            ],
            "content":"<div class=\"\"><div> <span>\"OH NO!\", shouted Spongebob horrified.\"Squidward must have dropped his phone!\"<br>\r\n<br>\r\n'There's no time to call him', thought Spongebob to just himself. (which really made no sense because calling squidward would have been faster but there's Spongebob for ya!)<br>\r\n<br>\r\n\"I will just stay calm and climb through Squidwards bedroom window to save his life!\"<br>\r\n<br>\r\n\"I'M COMING SQUIDWARD!!!!\"</span></div></div>",
            "created":1173640740,
            "id":388599,
            "title":"I don't need a hero"
        },
        "11211":{
            "choices":[
                "decides to investigate a near by mouse hole.",
                "anything else....."
            ],
            "content":"<div class=\"\"><div> <span>spongebob smashes squidward's window and climbs in,\"squidward??!\" spongebob yells into thin air. he stares at the hung up phone and startled squid.<br>\r\n<br>\r\n\"spongebob what are you doing in my house??!!\"squidward yells. spongebob chuckles awkwardly and...</span></div></div>",
            "created":1275944160,
            "id":895993,
            "title":"spongebob breaks into Squidward's house"
        },
        "112111":{
            "choices":[
                "get patrick to help",
                "go back to packing lunch"
            ],
            "content":"<div class=\"\"><div> <span>\"going to check out that mouse hole\" spongebob says. \"There is no such thing as mice in water!\" squidward says. \"well what I really came over for is-\" \"get out!!\" squidward yells as he shoves him out the window. \"But I need to tell you about the-\" squidward shuts the window. \"well I guess I should......</span></div></div>",
            "created":1298333460,
            "id":1058356,
            "title":"decides to investigate a near by mouse hole."
        },
        "1122":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "It was Patrick wondering if he was ready to go",
                "it was the new dating service he ordered."
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmmmm now what else do I need?\",said Spongebob to himself. \"I know chocolate! That is a perfect snack!\" <br>\r\nSpongebob opens his kithcen cupboard to get some chocolate. \"Yummmmmy in my tummy!!\" DING DONG!<br>\r\n\"Don't worry Gary I'll get it!\" \"oops\" In Spongebob's wild dash to the front door he dropped a jar of jellyfish jelly. \"oh well i'll clean that up later\" said spongebob as he opened the door.</span></div></div>",
            "created":1173131040,
            "id":387085,
            "title":"Chocolate"
        },
        "12":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "He wakes up Squidward",
                "Spongebob forgets about Squidward and finds a shrink ray",
                "Spongebob runs in to Patrick on the way to Squidward's house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Spongebob gets out of bed he suddenly realizes that he has to tell squidward something!<br>\r\n\"Squidward here I come!!!\"</span></div></span></div>",
            "created":1172628420,
            "id":385652,
            "title":"Important Message?"
        },
        "13":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "Spongebob takes the bus",
                "He decides to walk",
                "He decides to hitch a ride"
            ],
            "content":"<div class=\"\"><div> <span>\"Jumpin Crabby Patties!!\",exclaimed Spongebob.<br>\r\n\"I'm going to be only twenty minutes early instead of thirty minutes early! I have to get to work! see ya Gary!\", said Spongebob as he ran down the stairs and out the door. \"hmmmmm\" I wonder if my best buddy squidward will give me a ride\" Squidward having heard that because Spongebob talks really loud sometimes for some reason replied \"GET LOST SPONGEBOB SOME OF US NEED OUR BEAUTY SLEEP!!! Take the bus if you really need a ride!!\" That's a great idea thought Spongebob to himself maybe I'll see some of my friends!<br>\r\n</span></div></div>",
            "created":1173640200,
            "id":388597,
            "title":"Gotta Be Early"
        },
        "132":{
            "author_id":"sparty",
            "author_name":"Lucky Bengal",
            "choices":[
                "He sees Mrs.Puff acting like a baby",
                "Walking Krabby paties ",
                "Mr.Krabs playing with plankton"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While he is walking he notice something strange what is it?</span></div></span></div>",
            "created":1570504740,
            "id":2729770,
            "title":"He decides to walk"
        },
        "14":{
            "choices":[
                "Stolen by plankton",
                "Half term",
                "On a trip"
            ],
            "content":"<div class=\"\"><div> <span>He walks to boating school but he fogets the way. Squidward is laughing at him, and soon the whole of bikini bottom knows about it. \"Hey look its SpongebobForgetpants,\" jested everyone. He took the bus there while trying to ignore those immature bullies. \"Hmmf!\" Sighed Spongebob. He arrived finally! He opened the door. No-one was there. \"Where is everyone?\" He thought. </span></div></div>",
            "created":1298420700,
            "id":1058965,
            "title":"He goes to Boating School"
        },
        "141":{
            "choices":[
                "Dance",
                "Sing",
                "JUST GET THE FORMULA ALREADY!!"
            ],
            "content":"<div class=\"\"><div> <span>Plankton laughed to himself, \"My computer wife, Carry, I have a very good plan!\"<br>\r\n\"What now, Plankton?\" She asked rolling her eyes.<br>\r\n\"I feed thoose kids my chum (which makes them do what I say!) and get them to stea the secret formula!\"<br>\r\n\"Is it gonna work?\"<br>\r\n\"Yes baby, YES!!\" Plankton got the rolling machine going, and placed chum in a bucket.<br>\r\nAll the kids ran out of their seats. But they ate a little and it was \"YACK!\"  But they were already under the spell, ALL OF THEM INCLUDING MRS.PUFF!<br>\r\n\"First I want you to...\"</span></div></div>",
            "created":1298455800,
            "id":1059234,
            "title":"Stolen by plankton"
        },
        "1413":{
            "author_id":"zarcher",
            "author_name":"V-Phoenix",
            "choices":[
                "The boat's class members were back to normal again!",
                "Plankton laughed evilly"
            ],
            "content":"<div class=\"\"><div> <span>The spelled boating class moaned and started walking towards the door slowly, drooling with their mouths open. Then, out of nowhere, SpongeBob came!<br>\r\n\"Oh no you don't Plankton!\" He yells triumphantly. \"I'll save you, guys! Patrick, bring in the crabby patties!\"<br>\r\n\"Okie Dokes SpongeBob.\" Patrick gave a thumbs up and appeared out of nowhere, then brought out a really big hose. \"Here it comes!\" He pressed a button and for a second, nothing happened.<br>\r\n\"Patrick! I told you to-\" SpongeBob began.<br>\r\nA huge amount of Crabby Patties went shooting out the hose end and Patrick lost control of it. Plankton's secret lair was suddenly filled to the brim with Crabby Patties and continued to expand until...BOOM! Plankton's secret lair exploded! Then, as the smoke cleared...</span></div></div>",
            "created":1311040800,
            "id":1150089,
            "title":"JUST GET THE FORMULA ALREADY!!"
        },
        "15":{
            "author_id":"enolse",
            "author_name":"Enolse",
            "choices":[
                "Clean the Kitchen",
                "Do something else other than cleaning",
                "clean something else",
                "Do something fun"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Think I better just stay home.\" thought Spongebob to himself as he remembered he had chores to do. \"I'd better finish them\", he thought unhappily.</span></div></span></div>",
            "created":1173477960,
            "id":388169,
            "title":"Chores"
        }
    },
    "info":{
        "author_id":"furrieballoon",
        "author_name":"Chris",
        "brief_description":"What the title says",
        "created":1171494540,
        "description":"<td align=\"left\" class=\"norm\">Welcome to the Spongebob Squarepants Interactive! Here you will follow the path of Spongebob and his friends as they go through daily life in Bikini Bottom. In this story anything goes, be as crazy or messed up as you want. The only rules are...<br>\r\n<br>\r\n1) No sex-related content<br>\r\n<br>\r\n2) No cursing<br>\r\n<br>\r\n3) No endings<br>\r\n<br>\r\nBesides that there are no limits, so have fun!</td>",
        "id":1218055,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1570504740,
        "modified":1570504740,
        "pretty_title":"The Spongebob Squarepants Interactive"
    }
}