{
    "chapters":{
        "1":{
            "author_id":"shrinkfeet",
            "author_name":"iamtheman",
            "choices":[
                "He wakes up taped to her bare sole",
                "He wakes up in her shoe",
                "He wakes up on her bed",
                "He wakes up in between her big and second toes"
            ],
            "content":"<div class=\"\"><div> <span>It was an ordinary day in the Gosselin home. Kate had just sent the kids off to school and daycare and was finally relaxing. Ever since she had divorced Jon she was completely independent and it felt good. She didn't know what Jon was up to, and frankly she didn't really care. She hoped he was in terrible pain for what he did to her. How dare he cheat on her! What a douche! Kate sprawled herself out on the sofa, kicked off her slippers, and turned on the TV. Shortly after turning on the television the doorbell rang. Kaye opened the door to see her ex-husband, Jon, standing on the porch. <br>\r\n\"Kate, we need to talk. Can I come in?\" asked Jon. <br>\r\n\"Fine. Go sit down in the kitchen and wait for me,\" she grumbled. <br>\r\nJon walked to the kitchen and sat down at the table. He looked around the room and noticed not much had changed since he left. Kate walked to her room and opened a box that was under the bed. She opened the box and removed a strange blinking remote. She hid the remote in her pocket and slid the box back underneath her bed before she locked the door and headed back to the kitchen. <br>\r\n\"Kate let me just go ahead and tell you why I'm here. I hired a lawyer, and I want full custody of the<br>\r\nkids. I'm taking you to court for it and I intend to win,\" sneered Jon. <br>\r\nKate looked shocked. She thought she was going to cry, but then she remembered the remote! She wasn't going to get mad or upset, she was going to get even. <br>\r\n\"So... Do you have anything to say?\" asked Jon with a smug look on his face. <br>\r\n\"Jon I just want you to know that the kids are getting bigger, and well pretty soon it'll look like I'm getting bigger too. Very very big,\" she said with a laugh as she removed the remote from<br>\r\nher pocket and aimed it at the astonished Jon.  <br>\r\n\"Kate what are you doing? What is that thing?\" he screamed. <br>\r\nKate said nothing, she pushed the button on the remote and Jon instantly began to shrink until he was looking up at his ex-wife's face. He was barely the size of her smallest toe now. She looked down at him and an evil grin spread across her face. Jon looked scared and suddenly he passed out. Kate knew this was going to be fun, and today was no longer an ordinary day. She decided Jon would wake up to a smelly surprise when he finally awoke. <br>\r\nlonger an ordinary day. </span></div></div>",
            "created":1255477920,
            "id":775208,
            "title":"The Fun Begins..."
        },
        "14":{
            "choices":[
                "She is going to grind him between her toes",
                "She wants him to giver her a foot rub",
                "She puts her sneakers on",
                "She puts her boots on",
                "She tastes him"
            ],
            "content":"<div class=\"\"><div> <span>When Jon woke up, he found he was trapped between two large walls of pink-ish material. They were clamping down on him from both sides, and as much as he struggled, he was powerless to escape. Then he released something funny about the walls...they felt like skin. They smelled terrible too! Then Jon realized something terrible...and looked up. Sure enough, he was stuck in between Kate's big and second toes, wedged in like a toe spacer. He saw his gigantic ex-wife smiling down at him.<br>\r\n<br>\r\n\"Hi Jon! You have a pleasant sleep?\" Kate asked with a smirk.<br>\r\n\"Of course not, you giantess bitch! Now let me go!\" Jon cried angrily.<br>\r\n\"Hm, I don't think so little John,\" she retorted.<br>\r\n\"Please...\" he begged.<br>\r\n\"No, I think I'll just leave you in there all day,\" she answered.<br>\r\n\"Is that the best you can do?\" he teased.<br>\r\n\"Of course not...\" Kate gave an unfortunate response.</span></div></div>",
            "created":1277614920,
            "id":907179,
            "title":"He wakes up in between her big and second toes"
        },
        "141":{
            "choices":[
                "Taste him",
                "Tell him to clean her toes",
                "Pretend to crush him"
            ],
            "content":"<div class=\"\"><div> <span>Kate then got a great idea to torture Jon; she started moving her big and second toes back and forth. This was like grinding a bit of dirt between her toes, expect the bit was Jon. He screamed and told her to stop, but she just kept on going. Eventually, Jon was getting battered from Kate moving them against each other.<br>\r\n<br>\r\nNow that she had broken John, what should she do now?</span></div></div>",
            "created":1277753160,
            "id":908015,
            "title":"She is going to grind him between her toes"
        },
        "142":{
            "choices":[
                "RUB HARDER",
                "get in the shoe",
                "run"
            ],
            "content":"<div class=\"\"><div> <span>\"Rub my feet\" she says. jon gets to her foot and starts rubbing. he doesnt want her to get mad. <br>\r\n\"Oh thats it...rub harder.\" <br>\r\n\"I dont think I can.\"<br>\r\n\"I said rub or I will stick you in my shoe for the rest of the day.\"</span></div></div>",
            "created":1294285500,
            "id":1029937,
            "title":"She wants him to giver her a foot rub"
        },
        "1421":{
            "choices":[
                "a few days later she takes him out",
                "still in the shoe"
            ],
            "content":"<div class=\"\"><div> <span>jon then starts to rub harder.<br>\r\n\"OH YES!\" she yells as she starts to get really horny. then jon starts to notice something. He is getting really hard. So he starts to hump her foot. She enjoys this<br>\r\n\"harder HARDER!\" she screams! Jon goes crazy on her foot. He starts to lick and kiss her soles. this makes her very happy but she stops him...<br>\r\n\"TAKE OFF YOUR CLOTHES\" she says. so he rips off hisd clothes. Kate grabs his dick with he foot and starts rubbing. she rubs harder and harder as he kisses her foot and then he cums all over her beautiful sole. She stops.<br>\r\n\"well little man you look tired I should let you rest.\" she then puts him in her shoe. he doesnt mind it. He then spend the rest of the day in there.</span></div></div>",
            "created":1294285860,
            "id":1029942,
            "title":"RUB HARDER"
        }
    },
    "info":{
        "author_id":"shrinkfeet",
        "author_name":"iamtheman",
        "brief_description":"Kate shrinks her ex, Jon and uses him as her foot toy and slave",
        "created":1255476780,
        "description":"<td align=\"left\" class=\"norm\">Jon &amp; Kate Plus 8 ex-couple, Jon Gosselin and Kate Gosselin have divorced, but Kate finds the ultimate way to get revenge on Jon for cheating on her. She shrinks him and tortures him with her feet!<br>\r\nRULES:<br>\r\n1. No 1 sentence chapters. I always forget to make this a rule and the stories end up with 10 chapters and 10 sentences. Write at least a paragraph or don't bother adding on at all<br>\r\n2. Try to use correct grammar. Everyone makes mistakes, but don't spell like a 2nd grader so no one can read it. <br>\r\n3. Don't be a jerk. Last story I did someone thought it'd be funny to write random letters so I'd end up with a chapter like this: \"dhsahwjdndjaj\" and that's annoying. Don't do that. <br>\r\n4. Use mostly feet stuff. Other stuff is ok but use mostly feet and no toilet, butt, or poop stuff. No vagina stuff either because that ends up being just nasty. <br>\r\n5. Only Jon shrinks. No one else shrinks, and Jon doesn't grow back to normal. Kate doesn't shrink and Kate doesn't grow. Period. <br>\r\n6. No other characters. Forget the \"plus eight\". No one else besides Jon and Kate. I don't want the kids getting involved and making this sound weird and creepy. <br>\r\n7. Have fun. This is the most rules I've ever put, but I'm only doing this so we end up with a decent story. Please add on. I'll give gift points if you have a really good addition. Feel free to add multiple chapters. Thanks. </td>",
        "id":1608117,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1294285860,
        "modified":1294285860,
        "pretty_title":"Kate Gosselin Shrinks Jon Gosselin"
    }
}