{
    "chapters":{
        "1":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Asked him if he wanted to be put in diapers",
                "Forced him into diapers involuntarily",
                "Snatched the diaper out of his hand",
                "Shouted at him for acting so oddly",
                "Did something else"
            ],
            "content":"<div class=\"\"><div> <span>One warm summer morning, Fred Jennings was with his mother, Alyssa, in his younger siblings' nursery.<br>\r\n<br>\r\nAlyssa was changing the diapers of her three-year old son Rick and three-year old daughter Velma.<br>\r\n<br>\r\nFred watched as his mother diapered his younger siblings. He didn't know why, but the sights, smells, and feel of diapers made him feel a little excited.<br>\r\n<br>\r\nAt first, he thought it was merely a strange interest or his curiosity taking over. Then he thought that maybe it was a whole lot more complex than that.<br>\r\n<br>\r\nFred walked over to the changing table and picked up one of the diapers. He held it in his hand and rubbed it in his palms. It felt so thick and soft, like a solidified cloud.<br>\r\n<br>\r\nAfter a moment, he raised the diapers up to his cheek and rubbed it against his face, inhaling its pleasant odor.<br>\r\n<br>\r\nBefore long, Alyssa noticed what her older child was doing with the clean diapers. She was a little stunned at first, but then it occurred to her that there was a possibility that he actually found the diapers enticing.<br>\r\n<br>\r\nThen Alyssa got an idea and she</span></div></div>",
            "created":1346130000,
            "id":1415835,
            "title":"The Day's Beginnings"
        },
        "11":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Fred agrees to be diapered",
                "Fred agrees to be diapered... only if Alyssa is, too",
                "Fred still resists the idea of being diapered",
                "Fred asks to be diapered by the twins instead",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>After a moment of silence, Alyssa candidly told her oldest child \"You know, Fred, if you really want, I could diaper you just like your siblings. Then you could get the true feel of a diaper, just like you were little again.\"<br>\r\n<br>\r\nAt this abrupt comment, Fred snapped out of his reverie and quickly stepped away from the pile of diapers. Then he proclaimed \"Mom, I am 18 years old and don't need diapers anymore. It would be so embarrassing to wear a diaper.\"<br>\r\n<br>\r\nAlyssa just scoffed and remarked \"Oh, come on, young man, I am your mother, and I won't tell anyone about diapering you. You know you want to try one on and it might be fun. I have not put diapers on my baby boy in 16 years. Now let your mom have her fun?\"<br>\r\n<br>\r\nAlyssa softly grinned at her 18-year-old son and gave his bottom a few mommy pats. Then she declared \"You know you want to and I bet they will fit your sweet, little teenage bottom. Now come on, get out of your jeans and slip off your boxers, young man. You're about to get diapered by your mother.\"<br>\r\n</span></div></div>",
            "created":1403154000,
            "id":1814677,
            "title":"Asked him if he wanted to be put in diapers"
        },
        "111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Alyssa starts to baby Fred",
                "Alyssa asks Fred to diaper her",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Fred knew there was no way out of this that didn't involve his mother getting to baby him. So as per her instructions, he removed his jeans and boxer shorts.<br>\r\n<br>\r\nAlyssa left the nursery and returned with two large cloth diapers and diaper pins. \"Now lay down on the end of the bed\" she ordered.<br>\r\n<br>\r\nFred followed her wishes. \"Open your legs wide, little boy\" Alyssa instructed him. He did this, and she powdered his private areas just like he was a baby being diapered. With an arm under his knees, Alyssa lifted Fred's legs up with ease and set his bottom down on the thick soft folds of the diapers she placed under his bottom. With Alyssa's strong hands she pulled the diapers up snugly between his legs forcing his legs wide apart. Fred blushed beat red with the thoughts of his mother diapering him just like his baby siblings.<br>\r\n<br>\r\nAlyssa quickly had the diapers pinned tightly but comfortably in place. Then she said \"Okay, Fred, stand up my sweet little baby boy, and let Mommy see the job I did on your diapers.\"<br>\r\n<br>\r\nAlyssa helped Fred up off the bed and he stood in front of her with his legs apart. The diapers were extremely comfortable to him. His mom stepped back to admire the job she had done on Fred's thick bulky diapers. \"Not bad,\" was her only comment, \"Not bad at all.\"<br>\r\n<br>\r\nShe followed her comments with a few firm diaper pats to Fred's bum. They both smiled and laughed a bit from the little poof of baby powder that came from the top of the perfectly folded and pinned diapers.<br>\r\n<br>\r\nFred was diapered just like his baby siblings in perfectly folded and pinned thick cloth diapers and had the cutest of cute appearances as well. With his t-shirt top on he looked just like a baby except bigger. This was certainly the impression he got as he looked in the full-length mirror on the wall.<br>\r\n<br>\r\n\"Mom, I am a baby again; look at how nice my diapers look,\" Fred said, almost giddy at the statement.<br>\r\n<br>\r\nHis mother stepped over to him and gave him a big hug and a few firm diaper pats. Then she told him \"Sweetheart, you will always be my baby, and if you ever want mommy to diaper you, you just ask.\"</span></div></div>",
            "created":1403154000,
            "id":1814680,
            "title":"Fred agrees to be diapered"
        },
        "113":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Fred goes with it.",
                "Fred still can't go with it.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm just...not comfortable with this...\" Fred replied, backing away a little.<br>\r\n<br>\r\nAlyssa frowned and then looked to the door to her bedroom.<br>\r\n<br>\r\n\"Come here baby.\"<br>\r\n<br>\r\nFred furrowed his eyebrows a little in confusion as his mother suddenly grabbed his hand and led him to her bedroom. There, she let go of his hand and sat on the couch.<br>\r\n<br>\r\n<a class=\"duLink\" rel=\"nofollow\" href=\"http://fap.to/images/full/49/208/2085382407.jpg\">Preview</a>  <a title=\"New Window\" href=\"http://fap.to/images/full/49/208/2085382407.jpg\" rel=\"nofollow\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a><br>\r\n<br>\r\n\"Sweetie, I'm very serious about this. It feels like over the years and especially after your father died, you were gradually drifting away from me. Why is that?\"<br>\r\n<br>\r\nFred's lips quivered but shook his head in denial. \"That's...not true. We live in the same house.\"<br>\r\n<br>\r\nAlyssa's gave a sad smile. \"...and yet, I can hardly remember the last time you gave me a hug...or kiss. Sweetie, I'm...very lonely. You and your twin siblings are all I have left! Is it so much for me to ask that I can take care of you again? To be able to hold you in my arms and kiss you goodnight?\"<br>\r\n<br>\r\nFred started to stare at the floor and grew red. He could hear his mother's maternal voice in his head. He...when was the last time he gave his mother a hug? Ah...it was when he hit 13. At that point, he grew interested in girls and then...noticed his mother was actually quite the looker and had pretty big breasts. Perhaps that was the reason he started to distance himself, albeit uintentionally.<br>\r\n<br>\r\nRubbing his arm, Fred felt guilty. That was his mother's plan perhaps. He did it out of curiosity, but could he go through wearing diapers everyday in the house?<br>\r\n<br>\r\n\"I...I don't like the idea of having to use a diaper...or anything like that though,\" Fred reasoned.<br>\r\n<br>\r\nAlyssa nodded, understanding. \"That's okay sweetie. I'm not asking you to pee or poo in your diapers silly. Just wear them and...come back to being with mommy, please?\"<br>\r\n<br>\r\nFred felt himself about to tear up. He couldn't imagine how much his mother was alone. She always stayed positive, but it must've been hard.</span></div></div>",
            "created":1406523600,
            "id":1834728,
            "title":"Fred still resists the idea of being diapered"
        },
        "1131":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "...succeeded, his cock remaining limp.",
                "...failed as his cock rose to impede his diapering.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"I-I'll do it,\" Fred finally agreed with a bit of a shiver.<br>\r\n<br>\r\nAlyssa gave a heart-warming smile. \"Oh thank you baby. Thank you for trying. Just wait right here while I grab a pair of diapers. You should rest on the bed in the meantime.\"<br>\r\n<br>\r\nFred nodded, still red as a tomato as he held his breath and got on his mother's bed. Alyssa in the meantime, walked out of her room to get a pair and came back, feeling happy that her son was willing to bond with her.<br>\r\n<br>\r\nFred stared at the ceiling, wondering how this would pan out. He saw his mother shadow over him with a warm smile. In turn, Fred looked away, unsure if he could stare at his mother.<br>\r\n<br>\r\n\"I know this must be embarrassing, sweetheart. I want us to grow to share everything though, okay?\"<br>\r\n<br>\r\nFred nodded a little, but still couldn't face her in the eyes. Alyssa nonetheless continued and started to unbuckle her son's pants. While this was going on, Fred's heart was beating. How was she going to react to \"that\". It worried him.<br>\r\n<br>\r\nHis mother didn't take it slow though as she pushed her fingers underneath his pants and underwear waistline, pulling them off and revealing his limp, yet slightly thick cock.<br>\r\n<br>\r\nAlyssa couldn't help but comment. \"Oh...you've really grown haven't you?\"<br>\r\n<br>\r\nFred could only grown, putting his hands to his face. When his mother noticed this, she gave an apologetic smile.<br>\r\n<br>\r\n\"I'm sorry baby. I know how difficult this must be for you. Still, you don't know how proud I am to have a son like you,\" she praised.<br>\r\n<br>\r\nThis didn't let up Fred's embarrassment, but it did make him happy to hear his mother acknowledge him.<br>\r\n<br>\r\nWithout anymore waiting, Alyssa lifted her son's bottom in order to place an clean diaper. This, however, caused Fred to gasp as her touch caused some rather...interesting feelings. He tried his hardest not to grow a hard-on, especially in front of his mother and he...<br>\r\n</span></div></div>",
            "created":1406523600,
            "id":1834730,
            "title":"Fred goes with it."
        },
        "11311":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "...but he wanted to be the only person breastfed.",
                "...he didn't mind sharing either."
            ],
            "content":"<div class=\"\"><div> <span>Luckily, whether Fred had control or not,  his cock stayed limp although it did enlarge and stiffen a little. Alyssa did not notice the enlargement as she had already covered her son's crotch and secured the diaper.<br>\r\n<br>\r\nShe patted her son's padded crotch as if her work was golden. She then slid off Fred's remaining shirt leaving him half-naked and exposed like a baby.<br>\r\n<br>\r\nHe blushed considerably and looked away, not regretting to ever agreeing. His mother seemed to be extremely happy though with the developments and lifted him up, holding him tight in her arms.<br>\r\n<br>\r\nFred hugged his mother back, shivering as her large breasts squished against him. It was heavenly. By this point, he already popped a full-boner but at least it couldn't be seen with how padded the diaper was.<br>\r\n<br>\r\nAlyssa pulled back and smiled maternally at her son. \"Oh baby, thank you so much for agreeing to this. But simply diapering you isn'I t going to cut it. I want to be able to cuddle, carry, and just kiss you all over, sweetie!\"<br>\r\n<br>\r\n\"M-mom...\" Fred groaned.<br>\r\n<br>\r\nAlyssa shook her head and waved her finger. \"Nope, I want you to call me mommy. okay?\"<br>\r\n<br>\r\nFred looked down, his lips curling. \"M-mommy...\"<br>\r\n<br>\r\nAlyssa sighed lovingly. \"Oh baby. Now, you must be hungry, right? Do you want mommy to start breastfeeding you?\"<br>\r\n<br>\r\n\"B-breastfeeding?!\" Fred widened his eyes, his mouth opened as he stared at his mother incredulously.<br>\r\n<br>\r\nAlyssa giggled. \"Oh don't be so surprised, baby. I stopped breastfeeding your sisters at one, but hadn't stopped lactating. I could start again and breastfeed you all once again. Would you like that?\"<br>\r\n<br>\r\nFred couldn't believe what he was hearing. He was actually going to sucking from those tits he had wet-dreams about. Of course, he was okay with this!<br>\r\n<br>\r\n</span></div></div>",
            "created":1407387600,
            "id":1838597,
            "title":"...succeeded, his cock remaining limp."
        },
        "113111":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Alyssa gasped as she felt her son's boner.",
                "Alyssa didn't feel her son's boner (luckily or unluckily)."
            ],
            "content":"<div class=\"\"><div> <span>\"I...don't mind it. I would like that mommy, but...I want to be the only person breastfed,\" Fred answered with some shame.<br>\r\n<br>\r\nAlyssa didn't take her son's selfish request as bad. She was actually happy to see that he wanted to be attended alone. She thought for a moment.<br>\r\n<br>\r\n\"Well...your sisters weaned themselves as they were getting tired of it. I won't force them into being breastfed which means mommy's milk is entirely yours. Does that sound good?\"<br>\r\n<br>\r\nFred couldn't believe what he was hearing. He nodded eagerly which caused his mother to smile gently. \"That settles it then. I'll be breastfeeding you at least six times a day since I know your a growing boy. Of course, you are welcome to eat regular meals, but I want this to be a serious relationship if I am to breastfeed you. One before and after each meal, okay?\"<br>\r\n<br>\r\nFred nodded. \"I'm fine with that.\"<br>\r\n<br>\r\nAlyssa smiled, glad to see that Fred was already so willing to become her baby. She wasn't sure how she planned to take her hands off of him now.<br>\r\n<br>\r\nLowering her loose dress, Fred gasped to see her large breasts popping out. It appeared she wasn't wearing a bra the whole time. He wasn't sure if her breasts were leaking before or she was just simply excited, but he could visibly see drops of milk appearing from her nipple.<br>\r\n<br>\r\nAlyssa shivered, her hands holding her son tighter. \"Oh baby...you have no idea how long I've wished to breastfeed you again.\"<br>\r\n<br>\r\n\"M-mommy...\" Fred couldn't help but whimper and rushed to latch onto her breast. His mother moaned in response as she leaned forward, smothering her son deeper into her chest. She wrapped her arms and legs around her son and started to stroke her baby boy's hair.<br>\r\n<br>\r\nSlurping and smacking noises filled the room, noises that a regular baby would never make but of course, Fred wasn't a regular baby. He embraced his mother's flowing river of sweet, warm milk. At the same time, he glossed his hands all over his mother's body and especially around his mother's breasts. He never imagined he would ever get the chance to touch these beauts and yet, here he was.<br>\r\n<br>\r\n</span></div></div>",
            "created":1407387600,
            "id":1838604,
            "title":"...but he wanted to be the only person breastfed."
        },
        "12":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Alyssa feeds Fred and the twins breakfast",
                "Alyssa dresses Fred in baby clothes",
                "Alyssa walks Fred around the block in nothing but his diapers",
                "Alyssa gets diapered herself",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"It looks like we need to get out four diapers this morning,\" Alyssa said, looking at Fred standing by the piles of folded diapers in the nursery, \"One for Rick, one for Velma, and two to put on Fred.\"<br>\r\n<br>\r\nFred was taken completely off-guard by this statement. He turned to his mother in alarm. Alyssa just looked him straight in the eye and told him \"Go back to your room while I change the babies; I'll be in to diaper you in a jiffy.\"<br>\r\n<br>\r\nFred wanted to protest, but his mother appeared to mean business. So he went back to his room and didn't have long to wait. A couple minutes later, Alyssa came briskly into his room. She stripped off her son's clothes and laid out two very large folded diapers on his bed. As she lifted Fred up and lay him down on top of the diapers she said, \"First we put the baby on the diapers.\"<br>\r\n<br>\r\nAnd as she pulled the padding up between his legs she added,\"Then we put the diapers on the baby!\"<br>\r\n<br>\r\nAs she pinned his diapers snug over his left hip she looked down at him and said, \"It looks like mommy has three babies now.\"<br>\r\n<br>\r\nThen she pinned the left side of his diapers snug and tight over his right hip.<br>\r\n<br>\r\nNext she lifted Fred off the bed and took him by the hand and led him over to the full-length mirror on the closet door. She grinned and announced happily \"Just look at you - Mommy's little diaperboy!\"<br>\r\n<br>\r\nAnd there Fred was, reflected in the mirror wearing nothing but two snow white baby diapers. <br>\r\n</span></div></div>",
            "created":1403154000,
            "id":1814672,
            "title":"Forced him into diapers involuntarily"
        },
        "122":{
            "author_id":"butt311",
            "author_name":"john doe",
            "choices":[
                "he resist",
                "he docent resist"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>dose he resist</span></div></span></div>",
            "created":1517471940,
            "id":2447836,
            "title":"Alyssa dresses Fred in baby clothes"
        },
        "124":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Fred diapers his mother with her help",
                "Fred diapers his mother without her help",
                "Alyssa diapers herself in front of Fred"
            ],
            "content":"<div class=\"\"><div> <span>Fred was given a few minutes to examine himself in profile. He was certainly embarrassed that he was wearing diapers in front of his mother, which was further extenuated by the fact that Alyssa had been the one who diapered him. However, he was not entirely embarrassed about wearing diapers in general. They did feel incredibly soft, comfortable, and bulky. They made him feel wonderful.<br>\r\n<br>\r\nAfter an interval of silence, Alyssa gave her son a hug, patted his padded bottom a few times, and said \"You look so cute in your diapers, Fred. I should have put you back in them a long time ago.\"<br>\r\n<br>\r\nFred just blushed and said \"Yeah, I... I suppose so. Th-th-thanks, Mom.\"<br>\r\n<br>\r\nShe smiled and told him \"It's my pleasure, sweetie. But how about you return the favor?\"<br>\r\n<br>\r\nFred was confused at first. He asked his mother \"What do you mean?\"<br>\r\n<br>\r\nAlyssa did not answer straightaway. She just took her son's hand and led him back to the nursery. The thickness of his diapers was so pronounced that Fred was forced to waddle the whole way there.<br>\r\n<br>\r\nWhen they reached the nursery, Alyssa walked over to an open drawer. This drawer was full of diapers, both cloth and disposable. Fred noticed that they were as large as the ones his mother had put on him.<br>\r\n<br>\r\nAlyssa removed two more of the cloth diapers and beckoned Fred to accompany him to her room. He obeyed without any protest.<br>\r\n<br>\r\nAs soon as they reached Alyssa's bedroom, she placed the diapers on the bed and turned to her son. Then, in front of his eyes, she began to undress. First her shoes and socks came off. Then she unbuttoned her jacket and slid it off. After that, she unbuttoned her blouse and pulled it off, revealing her nice firm breasts encased in a size D bra.<br>\r\n<br>\r\nFred was greatly confused by his mother's actions at first, but he found them to be strangely stimulating in a way. He could have sworn he felt his manhood quiver a little against the front of his diapers.<br>\r\n<br>\r\nOnce her bra was removed, Alyssa unfastened her pants and slid them down to her feet. She stepped out of them and tossed her clothes to the side. Now she stood in just her satin bra and panties.<br>\r\n<br>\r\nShe turned back to Fred and asked him \"Do you know how to diaper someone? Be it cloth diaper or disposable diaper?\"<br>\r\n<br>\r\n\"Y-y-yes,\" Fred stammered nervously, \"I've changed Rick and Velma plenty of times. You showed me how.\"<br>\r\n<br>\r\n\"That's right,\" Alyssa affirmed, \"But let's see how well you can diaper someone your own size.\"<br>\r\n<br>\r\nFred did not expect to hear that at all. He queried \"What are you saying, Mom?\"<br>\r\n<br>\r\nShe smiled again and replied with \"How about you try diapering Mommy? If not, I could teach you how to diaper me.\"</span></div></div>",
            "created":1404450000,
            "id":1822741,
            "title":"Alyssa gets diapered herself"
        },
        "1241":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Fred's father is dead",
                "Fred's father is away",
                "Fred's father left them"
            ],
            "content":"<div class=\"\"><div> <span>\"I could probably do it on my own,\" Fred stated, \"But I... I suppose I could use your help.\"<br>\r\n<br>\r\n\"Alright, honey,\" Alyssa agreed, \"I'll be happy to guide you.\"<br>\r\n<br>\r\nAlyssa then laid down on top of the front of the bed. She waited for a couple moments, and then she looked up at her son<br>\r\n<br>\r\n\"If you want to diaper me, you'll have to kneel in front of me, sweetheart,\" the busty woman told her son, spreading her legs and moving back on the bed a little. That way, the padded boy could put the diaper on her without standing.<br>\r\n<br>\r\n\"Okay, Mom, now what?\" he said, kneeling in front of her.<br>\r\n<br>\r\n\"First, pull down Mommy's panties...\" Alyssa cooed, trying to stay calm and relaxed. However, this very sentence she had just said turned her on a little. She shook it off and waited for Fred to do as he was told.<br>\r\n<br>\r\nFred blushed red, but he complied. He carefully gripped the sides of Alyssa's panties and slowly slipped them off.<br>\r\n<br>\r\nAlyssa smiled and gestured to the cloth diapers. She instructed him \"Alright, baby boy, raise Mommy's bottom and lay the diapers under me.\"<br>\r\nShe was focusing more on directing Fred than her son's discomfort.<br>\r\n<br>\r\nFred tentatively picked up the soft cloth diapers. As he unfolded them, he scoffed and remarked \"These are really thick and puffy, Mom.\"<br>\r\n<br>\r\nHe then slid it under her as instructed. As he lowered her back down, he helped her into position. Every now and then, one of his hands rested on her private area for a split second.<br>\r\n<br>\r\nAlyssa bit her bottom lip to hold back any sounds of pleasure as Fred's soft hands caressed her sensitive womanhood. \"Mmmm...You do a good job with this sweetie...\" she cooed playfully, giving her son a little wink before continuing to instruct him. \"Alright, buddy; now raise the front of the diapee up and pin it snugly into place.\"<br>\r\n<br>\r\nFred folded the diaper up and held it in place with his right hand. Then he picked up the diaper pins with his left hand and went to work putting them in. He pinned up the right side and then the left side. Once he was finished, he examined all parts of the diaper to make certain it was on securely and properly. After confirming this, he smirked, patted the front of his mother's puffy cloth diaper, and told her \"There you go, Mom. All done.\"<br>\r\n<br>\r\n\"Good job, sweetie!\" Alyssa responded with a smile, holding out her hands. Fred took them and helped his mother to her feet. She looked down at him and gave him another hug. She continued grinning and told him \"Now we're all diapered and ready for the day.\"<br>\r\n<br>\r\nIt was then that Fred fully remembered that he had just been diapered a few minutes ago. He was quickly embraced by the awkwardness and embarrassment of it all.<br>\r\n<br>\r\nHowever, his mother did not seem to feel awkward or embarrassed at all.<br>\r\n<br>\r\nAlyssa just ran her hands over her new diaper and admired it. Fred realized she was absolutely enjoying them. He had to admit, his own diapers did not feel bad. Quite the opposite; they felt heavenly against him. But nonetheless, they were still diapers, and Fred was extremely flustered.<br>\r\n<br>\r\nAfter a minute, Alyssa stated \"Well, if we're all going to be like this, I suppose I'm a little overdressed.\"<br>\r\n<br>\r\nShe then reached back and unclipped her bra, letting it fall off her and onto the ground. She let her firm, round, size D breasts hang freely.<br>\r\n<br>\r\nOnce again, Fred felt his manhood press up against the front of his diapers. He did not know why, but the sight of his beautiful mother in nothing but a diaper was oddly enticing.<br>\r\n<br>\r\nBefore we progress any further, what are the whereabouts of Fred's father?</span></div></div>",
            "created":1404450000,
            "id":1822747,
            "title":"Fred diapers his mother with her help"
        },
        "12411":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Fred enjoys the kiss",
                "Fred pulls away"
            ],
            "content":"<div class=\"\"><div> <span>Alyssa has a full-length mirror on the wall next to the closet in the room. She waddled over to it and examined her reflection. She seemed to be very pleased with what she saw, and she smoothly ran her hands along the front of her diapers. As she did this, she smiled in contentment.<br>\r\n<br>\r\nBut no matter how satisfied Alyssa appeared to be, her son was even more mesmerized by her appearance. It was still hard enough to believe that he had just been diapered by his mother; let alone that she had asked him to diaper her in return. However, despite his shock and astonishment, Fred found that he was not appalled by Alyssa's appearance.<br>\r\n<br>\r\nHe watched his mother as she admired her reflection. Alyssa was a 40-year old mother of three, but she had the face of a 30-year old, the body of a 25-year old, and a figure that nobody would have imagined belonged to a woman who had given birth. Fred had always believed his mother to be a beautiful woman. His friends always made comments about how attractive she was (but never anything derogatory). He had seen Alyssa in a bikini and her underwear on occasion. Whenever that happened, he could not deny that his mother was a wonder to look at.<br>\r\n<br>\r\nHowever, now she was wearing nothing but thick soft white cloth diapers. For some reason Fred could not fathom, he thought Alyssa looked far more appealing in diapers than anything else she had ever worn. In a way, it made her look... desirable to him.<br>\r\n<br>\r\nWhen she was done admiring herself, Alyssa turned to her son and told him sweetly \"Thank you, again, Freddy. Doesn't Mommy look good in her diapees?\"<br>\r\n<br>\r\nFred slowly nodded his head and muttered \"Yeah... yes, she does. You look... a-amazing, Mom.\"<br>\r\n<br>\r\nAlyssa smiled, waddled over to her son and hugged him. He happily returned the hug. In the midst of this, Alyssa slid her hand down his back and patted her son on his diapered bottom. Fred enjoyed the feeling, so he decided to return the favor. He glided his hand across his mother's back and let it rest on her diaper. He lightly patted her padded bottom and she sighed happily.<br>\r\n<br>\r\nWhen they came apart, they remained smiling at each other in silence. Then Fred saw the need to address something. He said \"Uh, Mom; I was wondering something.\"<br>\r\n<br>\r\n\"What is it, sweetie?\" she queried.<br>\r\n<br>\r\n\"Well, uh; I find it unlikely that you just happened to have these large diapers on hand,\" Fred remarked, \"And I don't think you'd try them out just to make me feel less awkward. So I'd like to ask you something.\"<br>\r\n<br>\r\n\"Of course,\" she affirmed.<br>\r\n<br>\r\nFred looked away for a few seconds, and then he asked \"Do... do... do you have a diaper fetish, too?\"<br>\r\n<br>\r\nAlyssa grinned even wider at this, and she nodded her head, saying \"Yes, honey; I do. I've had it ever since I was a child. Your father had the same fetish, too.\"<br>\r\n<br>\r\nFred was surprised to hear that. \"Really? Dad liked to wear diapers?\"<br>\r\n<br>\r\nAlyssa nodded her head in confirmation and stated \"Yes. In fact, that's one of the main reasons he and I fell in love. We met at a club for infantilists. Both of us showed up wearing just diapers and shirts. When I wet my diaper, he offered to change me. I happily accepted, and later on I gave him a diaper change. Along with my phone number. I never would have thought that would have led to twenty years of blissful marriage and three beautiful children.\"<br>\r\n<br>\r\nAlyssa then sighed and looked away. Fred noticed she seemed sad, and he enquired in concern \"Are you alright, Mom?\"<br>\r\n<br>\r\n\"Yes,\" she assured him, \"It's just... I miss your father. Very much.\"<br>\r\n<br>\r\n\"I know,\" he commented, \"I miss him, too. If only he could be here with us.\"<br>\r\n<br>\r\n\"Then we'd all be able to wear diapers and have fun together,\" Alyssa conjectured. She turned back to her son, brightened up, and said \"At least you're here to keep me company. I'm so glad to see you have the desire to wear diapers, too. You and I will have such a good time.\"<br>\r\n<br>\r\nFred was a little confused. \"What do you mean?\"<br>\r\n<br>\r\nAlyssa did not answer straightaway. She just embraced her son again, closed her eyes, and kissed him on the lips affectionately.<br>\r\n<br>\r\nHow does Fred react?<br>\r\n.<br>\r\n</span></div></div>",
            "created":1405314000,
            "id":1827794,
            "title":"Fred's father is dead"
        },
        "124111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "\"Let's eat breakfast.\"",
                "\"Let's go get the mail.\""
            ],
            "content":"<div class=\"\"><div> <span>Fred's mother had kissed him on the lips many times before. But all those times, she had only kissed him the way a mother kisses her son to show she cares for him and is there for him. This time when she kissed him, she was conveying much more than her usual motherly love. This time, she was kissing him with what could only have been passion.<br>\r\n<br>\r\nFred did not expect this at all. He loved his mother greatly, and he knew she loved him just as much in return. He never suspected that she may have loved him in a way a mother is not supposed to love her son. Initially, the thought of that made him feel profusely uncomfortable. The kiss made him feel somewhat uneasy, as well.<br>\r\n<br>\r\nHowever, this uneasiness only lasted a few moments. After that, Fred started to look past the barrier that separated him and Alyssa as son and mother. He could not deny that his mother was a tender and kind woman; not to mention a wonderful kisser. Secretly, he used to have fantasies about him and her where they were not related. For obvious reasons, he had never brought them up to anyone.<br>\r\n<br>\r\nNow, it would appear as though he would actually have a chance to live out one of those fantasies.<br>\r\n<br>\r\nFred closed his eyes and returned the kiss passionately. Alyssa took this as a sign that he was not rejecting her approach. She slowly raised her right hand up to his face and softly caressed his cheek. This was a rather soothing gesture.<br>\r\n<br>\r\nFred returned the favor by wrapping his arms around his mother. He glided one of his hands up and down her back gently. She lightly sighed in contentment.<br>\r\n<br>\r\nAfter about a minute of this, they came apart for air. They gazed lovingly into each others' eyes. Ultimately, Alyssa broke the silence by saying \"Let's have some fun today. Just the two of us while the twins are sleeping.\"<br>\r\n<br>\r\nFred smiled in approval and patted his mother's diapered bottom, saying \"I'd like that very much.\"<br>\r\n<br>\r\nShe smiles, too, and rubbed her son's diaper softly. Then she said \"First things first, though...\"</span></div></div>",
            "created":1406523600,
            "id":1834701,
            "title":"Fred enjoys the kiss"
        },
        "1241112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Somebody comes outside",
                "Nobody comes outside"
            ],
            "content":"<div class=\"\"><div> <span>\"We should probably go get the mail,\" Alyssa proposed, \"I'm expecting some important letters to arrive today.\"<br>\r\n<br>\r\n\"Okay, Mom,\" Fred agreed, \"Let me just slip on a shirt and some pants, and I'll be ready...\"<br>\r\n<br>\r\nFred was about to leave this bedroom and head to his own room, but before he was halfway to the door, his mother stopped him and said \"No. Let's go ahead and go like this.\"<br>\r\n<br>\r\nFred was deeply surprised by this suggestion. He muttered nervously \"But, Mom... we're not wearing anything but cloth diapers.\"<br>\r\n<br>\r\n\"I noticed,\" Alyssa replied a little sarcastically, \"Don't worry, Fred. It'll be fine. It's still really early in the morning. Nobody should be out on the streets at this hour. Besides, don't you think it would be kind of... exciting to go out like this?\"<br>\r\n<br>\r\nFred spent a moment thinking about this idea. Although he was very glad that he could be open with his mother about his love for diapers and that she shared the same fetish, he was somewhat skeptical about going outside with his diapers visible. He wasn't quite ready for other people to learn about his unusual interests. However, his mother did raise a fine point. It was still the early morning. The Sun had hardly even risen yet. It was logical to assume that most of their neighbors were still asleep, just waking up, or having breakfast.<br>\r\n<br>\r\nUltimately, he looked up at his mother and told her \"Alright, then. If you insist, I suppose I can risk it.\"<br>\r\n<br>\r\nAlyssa smiled, kissed her son on the cheek, and stated \"Trust me; you won't regret this, honey.\"<br>\r\n<br>\r\nThe sexy mother took Fred's hand in hers and led him out of the room. For Fred, walking around took some getting used to. The thick mass between his legs was quite comfortable, but very spacious, as it kept his legs apart. His mother laughed as he waddled alongside her. She was diapered just as thickly as he was, and she waddled as well, but her waddle was not as pronounced as his. Mostly because she was used to walking in them.<br>\r\n<br>\r\nAs they walked hand-in-hand, Fred couldn’t help watching his mother's diapered bottom and her breasts as the swayed and bounced a little. She had the body of a goddess. A diapered goddess, at that. Which in Fred's mind was the best type of goddess.<br>\r\n<br>\r\nSoon they reached the front door of the house. Alyssa unlocked it, and then she and Fred headed outside. Fred felt the cool morning air against his bare skin.<br>\r\n<br>\r\nAs they stepped out into the open, he still could not believe this was happening. He and his mother were totally naked except for some thick, soft, white cloth diapers. They did not even have any socks or slippers on. Interestingly, Alyssa had more exposed than her son, yet she was far less nervous than he was. Fred had to admire his mother's bravery.<br>\r\n<br>\r\nFortunately, she was correct. There was nobody out in the streets. They were in the clear for the moment.<br>\r\n<br>\r\nThey quickly made their way to the mailbox. Fred stood on the edge of the sidewalk as Alyssa opened the lid and removed a small pile of mail. Fred thought they were just going to grab the mail and go back inside. But instead, his mother chose to sort the mail whilst standing at the box. She certainly took her sweet time with them.<br>\r\n<br>\r\nWhile Alyssa looked through the mail, Fred anxiously gazed around the street, looking for the slightest sign of movement everywhere.</span></div></div>",
            "created":1408251600,
            "id":1843081,
            "title":"\"Let's go get the mail.\""
        },
        "12411121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Gretta is baffled by what she sees",
                "Gretta is unbothered by what she sees"
            ],
            "content":"<div class=\"\"><div> <span>Fred was hoping that his mother would hurry up and finish sorting the mail. But Alyssa seemed extremely calm, serene, and nonchalant about their lack of attire. While she continued sorting the mail, he nervously gazed around the vicinity. He was prepared to bolt towards the front door of his house at the first sign of movement.<br>\r\n<br>\r\nJust as Alyssa was nearly done with organizing the mail, someone came outside. It was their next-door neighbor, a woman named Gretta Williamson. She had left the house to pick up the morning newspaper, and she did not notice Fred and his mother until she had leaned down and picked it up off the sidewalk.<br>\r\n<br>\r\nFred had been gazing in the opposite direction when Gretta reached the front of her property. He did not notice her until it was too late. As soon as he realized she was out there, he froze in shock and fear. His hands went to his padded crotch in a vain attempt to hide the diapers he was wearing, but they were far too thick and bulky to be concealed.<br>\r\n<br>\r\nA few seconds later, Alyssa finally looked up from the letters and discovered that she and her son were no longer alone. However, she did not seem the least bit concerned or apprehensive about being nude except for the thick cloth diapers she was wearing.<br>\r\n<br>\r\nAfter a lengthy interval of unpleasant silence, Alyssa merely smiled and amiably remarked \"Hello, Gretta.\"</span></div></div>",
            "created":1424494800,
            "id":1938068,
            "title":"Somebody comes outside"
        },
        "124111212":{
            "choices":[
                "A pharmacy ",
                "A Walmart she wants more than just new diapers"
            ],
            "content":"<div class=\"\"><div> <span>Gretta looks at both Alyssa and Fred in diapers and says \"what a novel idea Alyssa you can save on water bills and get your little boy back\". She then comes up to you and pinches your cheek. \"Why thank you Gretta maybe you should give it a try with your son, you never know he might like it like little Freddy here\" Alyssa said as she smacked Fred on the diapered butt. \"Alyssa I have one question why are you using cloth diapers? I use disposables for my youngest. You should them for the four of you\" Gretta said. \"What a novel idea they would be much easier to deal with and all we have to do is throw them away. Guess little Freddy Rick Velma and I need to go back out to go get some diapers for all of us. Thank you Gretta\" Alyssa said as she got back into the car. Fred stood there not sure what happened then he heard his mom tell him to get in the car so he did. Alyssa drove right over to....</span></div></div>",
            "created":1425186000,
            "id":1941980,
            "title":"Gretta is unbothered by what she sees"
        },
        "1241112121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "there were several other people there",
                "Only the clerk (young and female) was there"
            ],
            "content":"<div class=\"\"><div> <span>Although Fred was rather stunned by how casually Gretta had accepted the fact that he and his mother were diapered and wearing nothing else outside, he was even more surprised by how supportive she seemed of it, as well as the suggestions she made. However, what shocked him the most was the fact that Alyssa had asked him to get into the car without either of them putting on any clothes. At first, he assumed that this was a joke or something. But it was not; Alyssa was totally serious.<br>\r\n<br>\r\nShe briefly stepped inside to get Rick and Velma. She brought the twins back out a moment later. Both of them were still clad in just their diapers, and so was their mother. Alyssa secured the toddlers in their car seats in the back of their car. After that, she hopped into the driver's seat and started the car. Fred was riding shotgun, and he was more than a little apprehensive about what was going on.<br>\r\n<br>\r\nBefore Alyssa started driving, Fred turned to his mother and stated \"Hey, uh, Mom?\"<br>\r\n<br>\r\nAlyssa looked to her eldest child and asked \"What is it, sweetie?\"<br>\r\n<br>\r\nFred sat for a moment, contemplating a response, and then he remarked \"Going out to fetch the mail in nothing but diapers is one thing. But aren't we a little too underdressed for appearing in public?\"<br>\r\n<br>\r\nHis mother just smiled softly, patted him on the shoulder, and assured him \"We're just going to a pharmacy, honey. It's still pretty early, and I'm fairly sure that there won't be many people there. Just trust Mommy; she knows what she's doing.\"<br>\r\n<br>\r\nFred was still very against this idea, but his mother seemed adamant about this. He sighed and commented \"Alright. If you insist.\"<br>\r\n<br>\r\nAlyssa had leaned closer to her son when she gave him that rationale for going out with their diapers exposed. Her large, round breasts were less than a foot away from Fred. He tried to focus on his mother's eyes, but her cleavage was too enticing to ignore. He could soon feel him member starting to rise and strain against the front of his diapers.<br>\r\n<br>\r\nAlyssa noticed her son was staring at her upper body, and she noticed the bulge in the front of his diaper. She was not aggravated or disgusted. If anything, she seemed pleased. She smiled again and observed \"Besides, it looks as though you're enjoying seeing me like this. Are you?\"<br>\r\n<br>\r\nFred blushed lightly and tried to think up a response. A moment later, Alyssa slowly reached over and placed her hand on the front of her son's diaper, beginning to rub it softly. This gesture immediately had the intended effect on Fred; he started moaning in pleasure and breathing more deeply.<br>\r\n<br>\r\nAlyssa gradually increased the speed of her rubbing. The bulge in the front of her son's diaper became bigger. His member was so hard that it almost seemed as though the diaper would not hold.<br>\r\n<br>\r\nJust before Fred hit his climax, Alyssa stopped rubbing him. She continued to smile and said \"Sorry to stop short, darling. We'll finish this later, I promise.\"<br>\r\n<br>\r\nFred nodded in agreement eagerly. One thing was certain; his mother was very persuasive.<br>\r\n<br>\r\nAlyssa then turned her attention to the front of the car and began driving. About five minutes later, the small family arrived at a pharmacy. There were a couple cars in the parking lot, but nobody was outside at the time.<br>\r\n<br>\r\nAlyssa then asked Fred to help her with the twins. Fred took Velma in his right arm and Alyssa took Rick in her left arm. The diapered mother then took her diapered teenage son's left hand in her right hand and guided him towards the pharmacy.<br>\r\n<br>\r\nWhen they passed through the automatic doors, they saw that...</span></div></div>",
            "created":1429667220,
            "id":1967668,
            "title":"A pharmacy "
        },
        "12411121212":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Hailey was a Diaper Lover, too",
                "Hailey was familiar with the Adult Baby lifestyle"
            ],
            "content":"<div class=\"\"><div> <span>On the plus side, the building was nearly devoid of people. The only exception was the clerk at the counter.<br>\r\n<br>\r\nThe clerk was a young woman. She appeared to be a few years older than Fred, and she was roughly the same height as him, too. She had long brown hair tied up in a ponytail, and she wore a polo shirt with a short skirt.<br>\r\n<br>\r\nWhen she heard the automatic doors slide open, she turned to the front entrance. When she saw Alyssa, Fred, and the twins enter the pharmacy, she was quite stunned. One could hardly blame her; it was not every day that a woman and her three children - one of which was female - came into the shop wearing absolutely nothing but diapers. She could not believe what she was seeing. She had to pinch herself to make certain she was not hallucinating.<br>\r\n<br>\r\nBy the time the clerk managed to verify that she was not imagining this, Alyssa and her children had approached the counter. The young mother smiled and greeted her with \"Good morning.\"<br>\r\n<br>\r\nThe clerk snapped out of it and unsteadily returned \"Um, hello, ma'am. Can I help you?\"<br>\r\n<br>\r\n\"Yes, you can...\" Alyssa began, leaning a little closer to get a look at the clerk's name-tag. She then added in \"Hailey.\"<br>\r\n<br>\r\nDespite the awkwardness of the scenario, Hailey decided to just go along with this. She could have invoked the \"no shoes, no shirts, no service\" policy, but she had never seen the point of that regulation, and she had never enforced it before. She figured she could work around it, anyway. Hailey stood up straight and queried \"What can I do for you?\"<br>\r\n<br>\r\nAlyssa informed her \"For years, I've been using cloth diapers on my children. As well as on myself, for that matter. However, a friend of mine advised me to give disposable diapers a try. I'm looking to buy some for the four of us. Could you give us a hand in searching?\"<br>\r\n<br>\r\nHailey nodded her head, picked up a clipboard, and responded with \"Sure. Come with me.\"<br>\r\n<br>\r\nShe then led Fred, his mother, and his siblings to the back of the store. There was an entire aisle devoted to diapers for all ages. Rick and Velma could easily fit in Pampers, Huggies, and other baby diapers. As for adults, the first specimens were some Attends and Depends, but those were very low-quality, and Alyssa bypassed them straightaway. There were plenty of diapers of higher-quality; diapers that were frequently used by the ABDL lifestyle.<br>\r\n<br>\r\nHailey spent five minutes describing the varieties of adult diapers, such as Tena Slip, Tena Maxi, Tena Super, Abri-Form, Bambino, Cushies, and others. She was able to go over the pros and cons of all of them in detail. Both Alyssa and Fred were a little amazed by how much she knew about them. In fact, she almost seemed a little TOO well-versed in them.<br>\r\n<br>\r\nWhen Hailey finished her explanation, Fred said \"Hey, Hailey, can I ask you something?\"<br>\r\n<br>\r\n\"Sure, what's up?\" the brunette avowed. By now, she seemed accustomed to seeing the family of four in diapers.<br>\r\n<br>\r\nFred paused for a moment, and then he inquired \"How do you know so much about adult diapers?\"<br>\r\n<br>\r\nHailey did not answer right away. She appeared a little hesitant to reply. Ultimately, she just scoffed and revealed that...</span></div></div>",
            "created":1429669620,
            "id":1967684,
            "title":"Only the clerk (young and female) was there"
        },
        "124111212121":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Hailey was wet",
                "Hailey was dry"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I happen to be interested in them, too,\" Hailey disclosed.<br>\r\n<br>\r\nFred and Alyssa were stunned by that statement. Fred raised an eyebrow and asked \"Really?\"<br>\r\n<br>\r\nThe brunette simply nodded her head in confirmation. Then she reached down, took a hold of the hem of her skirt, and lifted it up, revealing a thick lair of white, crinkly padding wrapped around her waist. There were pictures of colored blocks on the front of the garment. Alyssa recognized it as a special variety of adult diaper, specifically a Bambino.<br>\r\n<br>\r\n\"Seems to fit you perfectly,\" the diapered mother observed.<br>\r\n<br>\r\n\"It does,\" Hailey affirmed.<br>\r\n<br>\r\nFred stared at the clerk's padded crotch, and then he examined all of her in perspective. He then shyly murmured \"Well.. you look really cute in that diaper,\"<br>\r\n<br>\r\n\"Thank you,\" Hailey stated in response, blushing a little, \"It's my favorite brand.\"<br>\r\n<br>\r\nAfter a bit of silence, Alyssa stepped forward and inquired \"Would you mind if I checked you?\"<br>\r\n<br>\r\nHailey blushed harder, and she gazed anxiously off to the side for a moment, but then she looked back to the older woman and replied with \"Sure... go right ahead.\"<br>\r\n<br>\r\nAlyssa approached the young woman, reached out her free hand, and softly rubbed the padding between Hailey's legs.</span></div></div>",
            "created":1451339820,
            "id":2080591,
            "title":"Hailey was a Diaper Lover, too"
        },
        "1241112121211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Hailey changed herself",
                "Hailey let Alyssa change her"
            ],
            "content":"<div class=\"\"><div> <span>Although the front of Hailey's diaper appeared to be white, the material easily squished as Alyssa squeezed it. It was a telltale sign that the clerk had used her diaper.<br>\r\n<br>\r\n\"Looks like you've had an accident,\" Alyssa cheekily pronounced, smirking.<br>\r\n<br>\r\nHailey blushed again, but she nodded her head and lowered her skirt. She expounded \"I've been here all night by myself. I didn't want to leave the pharmacy unattended, even to take a bathroom break. Since I was wearing a diaper, why not take advantage of that?\"<br>\r\n<br>\r\n\"That's certainly logical,\" Fred perceived.<br>\r\n<br>\r\n\"Indeed,\" Alyssa commented. After some silence, the padded mother enquired \"Would you like me to change you?\"<br>\r\n<br>\r\nThat offer surprised both Fred and Hailey, as it was quite unexpected. Even so, Hailey took a minute to consider it, and ultimately, she made her decision</span></div></div>",
            "created":1451341380,
            "id":2080600,
            "title":"Hailey was wet"
        },
        "12411121212112":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "She accepts the offer (albeit tentatively)",
                "She needs some time to think about it first"
            ],
            "content":"<div class=\"\"><div> <span>\"O-Okay,\" Hailey murmured, a little nervously, \"If you wouldn't mind, ma'am.\"<br>\r\n<br>\r\n\"Oh, I don't mind,\" Alyssa insisted, smiling kindly. She carefully handed Rick over to Fred, who was still carrying Velma. Once the diapered teenager was holding both of his toddler twin siblings, Alyssa told \"Let's go behind the counter.\"<br>\r\n<br>\r\n\"Alright,\" Hailey agrees, still somewhat anxious. Evidently, she was not used to having her diapers changed by others.<br>\r\n<br>\r\nSince they went behind the counter, they would be concealed from Fred's view. So at least they had some privacy. They would also be hidden if anyone else happened to enter the store whilst Hailey was being changed. Of course, Fred and the twins were still in plain sight; there was no way THEY could hide. Fred just hoped nobody else would come inside until they left.<br>\r\n<br>\r\nAlyssa had Hailey lie down on her back, and she hiked up her skirt to fully expose her soaked padding. Alyssa then proceeded to change Hailey's diaper.<br>\r\n<br>\r\nHailey was very perturbed by the current scenario. Here she was, on her back at work, having her wet diaper changed by a woman twice her age. This same woman was wearing nothing but a thick cloth diaper in public! Furthermore, she was a mother of three, and her eldest - who was only two years Hailey's junior - was also out and about in just a diaper.<br>\r\n<br>\r\nThe day was only just beginning, and already it was weirder than most other days.<br>\r\n<br>\r\nThankfully, Alyssa was quick yet efficient. After removed the soaked diaper and wiping Hailey's crotch, the diapered mother swiftly placed a cloth diaper beneath Hailey's bottom. She then powdered Hailey's crotch, pulled the front of the padding up, and pinned it shut. After checking to ensure that the diaper was on, Alyssa patted Hailey's crotch and announced \"There you go!\"<br>\r\n<br>\r\nAlyssa helped Hailey back to her feet, and the young clerk examined her new diaper. She seemed fascinated by it. \"I've never worn a cloth diaper before. Not since infancy, I believe.\"<br>\r\n<br>\r\n\"At the moment, cloth are all we have,\" Alyssa revealed, \"Of course, you already know that; the whole reason I'm here is to get some disposables for myself and my children. You've shown me quite an impressive collection, though.\"<br>\r\n<br>\r\n\"Any that stick out, ma'am?\" Hailey asked<br>\r\n<br>\r\n\"Yes,\" Alyssa replied, \"I'm compelled to give them all a try, but for now, I'll go with Abri-Form Regular for myself, Aww So Cute for Fred, and Pampers for Rick and Velma.\"<br>\r\n<br>\r\n\"Very well,\" Hailey conceded. She proceeded to get two packs of each, rung them up at the register, and sold them to Alyssa.<br>\r\n<br>\r\nJust before the padded woman and her children left, Alyssa asked Hailey \"When does your shift end?\"<br>\r\n<br>\r\n\"In less than ten minutes, actually,\" the clerk responded.<br>\r\n<br>\r\n\"Then, if you've nothing planned for the day, how'd you like to come over to my house and have some fun with me and my children?\" Alyssa offered.<br>\r\n<br>\r\nHow does Hailey answer her?</span></div></div>",
            "created":1513278480,
            "id":2428046,
            "title":"Hailey let Alyssa change her"
        },
        "124111212122":{
            "choices":[
                "Hailey is babysitting tonight",
                "Hailey wanted to come see what being diapered is like so she is coming over"
            ],
            "content":"<div class=\"\"><div> <span>\"Well Fred the reason that I know so much about Adult Diapers is because I am an adult babysitter\" Hailey said. \"You are a what\" Fred asked. \"I am an adult babysitter, so little boys and girls or at least they want to be, have their mommies or daddies pay me to babysit them. It is like I am a babysitter just with adults instead of real babies\" Hailey said. \"Oh I see now that is pretty cool I guess, bet you get paid a lot for it\" Fred said. \"Oh yeah tons it is a really good job and they even pay me extra to punish them\" Hailey said. <br>\r\n<br>\r\n\"Hailey did I hear that you like to babysit\" Alyssa asked from down the isle. \"Yes ma'am I do\" Hailey replied. \"Well as much as I like wearing the diapers I think it is time for mommy to be the mommy again. Hailey does your pharmacy sell clothes by chance I am in need of a pair really quickly\" Alyssa said. \"Why of course come with me\" Hailey said as she left the isle. Alyssa walked over to Fred and handed him Rick, so now he was holding both Rick and Velma in his arms. \"Be right back Fred\" Alyssa said as she to left the isle following Hailey. <br>\r\n<br>\r\nA few minutes later your mom came back with Hailey in new clothes. \"Now about those diapers, lets get Freddy some Tena Maxi and Rick and Velma some Huggies Supreme\" Alyssa said as she took back Rick from you. \"Wonderful choices\" Hailey said as she walked with you and Alyssa to the front of the Pharmacy, she rung everything up and your mom paid for it all. \"Thank you for your help Hailey, thank your for agreeing to what I talked to you about it will be a big help\" Alyssa said. \"No problem ma'am, see you three later\" Hailey said. Then you all left. \"Mom what did she mean by see you three later\" Fred asked Alyssa. </span></div></div>",
            "created":1429743120,
            "id":1967944,
            "title":"Hailey was familiar with the Adult Baby lifestyle"
        },
        "15":{
            "choices":[
                "Asked him if he was ok",
                "Just left the room ",
                "She shrunk him",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else did Fred's mom do?</span></div></span></div>",
            "created":1346130000,
            "id":1415848,
            "title":"Did something else"
        },
        "151":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Alyssa hugs Fred.",
                "Alyssa accepts it and moves on.",
                "Alyssa confronts him further on the diaper."
            ],
            "content":"<div class=\"\"><div> <span>Deciding not to be so judgemental, she decides to approach concerned to her son.<br>\r\n<br>\r\n\"Fred? Are you alright?\"<br>\r\n<br>\r\nSaid boy jumped, his expression contorting into horror as he realized his mother had to have just saw him inhaling the scent of diapers. Honestly, he didn't know what came over him...<br>\r\n<br>\r\n...actually, he does. He...he wants to be babied and spoiled by his mother too, but there's now way he's going to admit that. Turning to his mother, he put the diaper quickly behind his back and tried to come up with an excuse.<br>\r\n<br>\r\n\"Ah...um...y-yeah! I'm good! I just...er...got curious about the texture of diapers now. Y-you know, just to see if anything has changed or i-improved.\"<br>\r\n<br>\r\nAlyssa knows her son is sweating like crazy and that maybe it wasn't a good idea to say anything. She curls her lips, wondering what she should do. Perhaps just accept her son's reasoning less she embarrasses him further...or...<br>\r\n<br>\r\nPreview of mother: <a class=\"duLink\" rel=\"nofollow\" href=\"https://pp.userapi.com/c836521/v836521520/2be1b/7dC2HrAXcLg.jpg\">Alyssa</a>  <a title=\"New Window\" href=\"https://pp.userapi.com/c836521/v836521520/2be1b/7dC2HrAXcLg.jpg\" rel=\"nofollow\" target=\"_blank\"><img loading=\"lazy\" style=\"opacity:.4;\" src=\"https://www.Writing.Com/nw.gif\" onmouseover=\"$(this).css('opacity', '1');\" onmouseout=\"$(this).css('opacity', '.4');\" height=\"12\" width=\"12\" border=\"0\"></a></span></div></div>",
            "created":1495977600,
            "id":2326557,
            "title":"Asked him if he was ok"
        },
        "1511":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "He asks what Alyssa has in mind.",
                "He decides to completely reveal his desires and selfish wants.",
                "He remains silent as Alyssa begins to take off his clothes and change him."
            ],
            "content":"<div class=\"\"><div> <span>Without any words, she feels sorry for her son and in her own way of apologizing, she surprises Fred by walking fast towards him and pulling him into embrace before he could react.<br>\r\n<br>\r\nFred was confused and shaking as his mother forced him into a hug. With her warmth, the smell of her perfume, and the lovely curves of his mother cushioning him, he relaxed a little and wraps his arms around his mother's back in response.<br>\r\n<br>\r\nFor few seconds of silence, they hug and then Alyssa speaks after sensing him calm down. She decides to pose a simple question and soothes him a little by swaying. Being a few inches taller than her son, something she was happy about, it was nice to be able to lean forward to kiss her son's forehead.<br>\r\n<br>\r\n\"Fred sweetie, I'm not angry or upset. Just one question: Am I neglecting you?\"<br>\r\n<br>\r\nFred feels his lips quiver, wondering how his mother could come to that conclusion. Perhaps she saw through his poor attempt to shrug off the diaper and saw deeper meaning to it.<br>\r\n<br>\r\nTo be honest, he was a poor liar when it came to his mother. Even if he did lie successfully to her, the nature of her being such a sweet and loving mother eventually guilts him to reveal the truth.<br>\r\n<br>\r\nWith that in mind, he answers honestly. \"No, you've been absolutely great, it's just that...\"<br>\r\n<br>\r\nHe couldn't finish his sentence, unable to reveal his desires that came to fruition. Knowing that he couldn't come to say the issue at hand, Alyssa takes the lead, keeping him calm expertly.<br>\r\n<br>\r\n\"I'm glad to hear that sweetie, then let me ask another question: Do you want me to care for you like your siblings? There's no shame in saying you want to spend more time with me.\"<br>\r\n<br>\r\nFred takes a deep breath. Seeing his mother be so accepting, he could only continue to answer honestly as she sways. It almost feels like she's hypnotizing him in a way.<br>\r\n<br>\r\n\"Y-yes...\"<br>\r\n<br>\r\nAlyssa finally lets go, satisfied to hear the real reason of why he was so intently focused on the diaper. Was it abnormal, yes, but she isn't about to punish her sweet son like that.<br>\r\n<br>\r\nTaking his hands into her own, she smiles warmly at her son. \"Then <i>baby</i>, let's get you changed in that diaper okay? We'll make any adjustments as necessary, okay?\"<br>\r\n<br>\r\nFred takes a deep breath, unable to believe that this sort of acceptance is happening and in such a short time too. He could only silently nod as he's pulled away with the diaper still in his hand.<br>\r\n<br>\r\nWhat does Fred do before entering Alyssa's bedroom.</span></div></div>",
            "created":1495978560,
            "id":2326563,
            "title":"Alyssa hugs Fred."
        },
        "15112":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "She sucks him off first.",
                "She gives him a titty fuck."
            ],
            "content":"<div class=\"\"><div> <span>Seeing how unexpected his mother is accepting of his change, he can bites his lips as he wonders whether it's okay to clarify further what he wants. He's glad that his mother is able to discern him wanting a closer relationship, but he feels the need to explain himself more.<br>\r\n<br>\r\nEntering her bedroom, he stops, pulling away from his mother a little and fidgeting a little. Seeing her son in contemplation, she furrows her eyebrows in concern and raises her hand to cup his cheek, pulling his attention towards her.<br>\r\n<br>\r\n\"What's wrong, baby?\"<br>\r\n<br>\r\nFred takes another deep breath as he tries to recollect himself. \"Is it okay if I explain myself more?\"<br>\r\n<br>\r\nAlyssa takes a moment to process before chuckling. \"Oh sweetie, you don't need to force yourself. That said, I'm willing to support my baby boy in any way possible.\"<br>\r\n<br>\r\nFred shivers and her willingness gives him goosebumps in a good way. Then, he simply starts to clarify what he wants from her:<br>\r\n<br>\r\n\"T-then...c-can you breastfeed me? I know that you weaned Rick and Velma a few months ago and I don't know if it's still possible but...\"<br>\r\n<br>\r\nAlyssa smiles and hushes her son sweetly. \"It's okay, yes I think I can still lactate. That's perfectly fine, I can breastfeed you as much as you want, okay?\"<br>\r\n<br>\r\nFred can't help but shiver again and this time, he feels himself grow hard at the thought of sucking his mother's huge mammaries all day. Despite that, he continues seeing how his mother was right in supporting him anyway.<br>\r\n<br>\r\n\"...t-then, is it okay that we also bathe together and um...\"<br>\r\n<br>\r\nFred couldn't say it. Plainly, he wanted to do a lot of sexual stuff and skinship with his mother. Luckily, Alyssa figures into what he's trying to say. Admittedly, she feels a little hot by his declaration but can't say she's against it. More importantly, she wants her son to feel loved and comforted.<br>\r\n<br>\r\n\"You don't have to say anymore. Come on the bed and mommy will change you, okay?\"<br>\r\n<br>\r\nFred nods, hesitant now that he has a boner but with everything he's revealed verbally, he takes the plunge.<br>\r\n<br>\r\nSitting on the bed, Fred lets his mother take his clothes off. The feeling of his mother's touch make him slightly groan. It's only when she starts to take off her pants does he sweat nervously as he hears a small gasp from his mother. Surely she should have expected this, right?<br>\r\n<br>\r\nIndeed, Alyssa did expect this knowing her son is a teenage boy but she didn't expect him to react so quickly. She then wonders if he felt like this all the time around her.<br>\r\n<br>\r\nSaddened by the fact that she may have been causing trouble for her baby, she slides his underwear off allowing his penis to spring up with some freedom.<br>\r\n<br>\r\nWhat does she do?</span></div></div>",
            "created":1495979880,
            "id":2326570,
            "title":"He decides to completely reveal his desires and..."
        },
        "151121":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "She will start breastfeeding you.",
                "She cuddles and takes a nap with you.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"Baby, hold still okay?\" Alyssa asks sweetly.<br>\r\n<br>\r\nYou flinch as your mother goes to work, leaning forward and taking in your member with her mouth. The fact that this beautiful woman is actually giving you a blowjob is something that you could never imagine.<br>\r\n<br>\r\n\"Oh, mommy!\" you groan.<br>\r\n<br>\r\nAlyssa bobs her head gently, making slurping noises that spread throughout her bedroom. To hear her baby boy in pleasure makes her pleased. She felt pride and joy in all of her kids.<br>\r\n<br>\r\n\"M-mommy...deeper...please!\"<br>\r\n<br>\r\nYour mother hums and then finishes you off by pushing further, nearly gulping down your cock. In that instance, you ejaculate into her throat and she doesn't let any of it escape.<br>\r\n<br>\r\nYou feel your body weakening as she cleans you with her mouth, then pulls away. You find yourself staring at the ceiling with a stupid grin on your face.<br>\r\n<br>\r\n\"I...that was so good,\" you breathe.<br>\r\n<br>\r\nAlyssa smiles warmly and then rubs your tummy. You let out another relaxed sigh in response.<br>\r\n<br>\r\n\"Baby, it's now my responsibility to take care of you. As a mother, there's no greater joy, even if it means that I have to take care of your cute little pecker here too.\"<br>\r\n<br>\r\n\"Oh mommy, this is...more than I could have asked for. I...love you.\"<br>\r\n<br>\r\n\"I love you too,\" Alyssa responds back with much love and care in her voice, \"...now, let's get you a fresh pair of diapers, okay?\"<br>\r\n<br>\r\nShe changes you and in your relaxed state, you paid no heed to how careful she wrapped a fresh pair of diaper around your crotch. No doubt, you would start to dirty it again.<br>\r\n<br>\r\nWhat's next in Alyssa's plans?</span></div></div>",
            "created":1531634580,
            "id":2519945,
            "title":"She sucks him off first."
        },
        "152":{
            "choices":[
                "It starts to grow to fit you",
                "Your little sister says something to you",
                "You shrink"
            ],
            "content":"<div class=\"\"><div> <span>Instead of saying anything to you, your mom just left the room and closed the door behind her. You keep rubbing the diaper all over your face. When that isnt enough anymore you take off your pants then your boxers and rup it all over your penis and butt. You keep doing this for a while. You are about to put the diaper on for good when...</span></div></div>",
            "created":1346130000,
            "id":1415860,
            "title":"Just left the room "
        },
        "1521":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Your mother comes back in",
                "You diaper yourself",
                "You put the diaper down hesitantly"
            ],
            "content":"<div class=\"\"><div> <span>To your sudden (yet pleasant) surprise, the diaper inexplicably starts growing. Slowly but steadily, it expands to increase its size. Before long, it's the perfect size for you.<br>\r\nYou stare in amazement at the enlarged garment. A moment ago, it was only big enough for your twin siblings. But now, you could put it on without having to stretch it to its limits.<br>\r\nAt that moment,</span></div></div>",
            "created":1346216400,
            "id":1416373,
            "title":"It starts to grow to fit you"
        },
        "15211":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "asks to diaper you.",
                "is angry with you."
            ],
            "content":"<div class=\"\"><div> <span>Your mother suddenly comes back into the room without warning. You turn to her in surprise; you had been so caught up in your reverie that you paid no mind to her.<br>\r\nWhen she sees the enlarged diaper in your hands, as well as how you have your pants lowered, she becomes inquisitive.<br>\r\n\"What were you doing?\" she asks.<br>\r\nHesitantly, you decide to tell the truth that you had a strange interest in diapers, and you were considering putting one on when it started growing on its own accord.<br>\r\nWhen you are finished with the explanation, your mother</span></div></div>",
            "created":1346216400,
            "id":1416375,
            "title":"Your mother comes back in"
        },
        "152111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "Agree to her offer",
                "Change your mind"
            ],
            "content":"<div class=\"\"><div> <span>Your mother just smiles and remarks \"If you wanted to be in diapers, then why didn't you just say so?\"<br>\r\nYou are stunned to hear this. You answer her \"I would have thought you'd be disgusted or shocked.\"<br>\r\nYour mother smirks and tells you \"Remember, I'm the one who changed your diapers sixteen years ago. I'd love to do it again, Freddy.\"<br>\r\nAt that moment, you are not certain whether you should give in or question the scenario. Ultimately you</span></div></div>",
            "created":1346216400,
            "id":1416377,
            "title":"asks to diaper you."
        },
        "1521111":{
            "author_id":"arnoldjameson0",
            "author_name":"Stendier",
            "choices":[
                "play ",
                "eat breakfast"
            ],
            "content":"<div class=\"\"><div> <span>A smile slowly creeps onto your face and you say \"Alright, Mom. I'll take you up on your offer.\"<br>\r\nShe joyfully walks over to you and hugs you. When you come apart, she says \"Let's get you undressed, young man.\"<br>\r\nShe helps you step out of your pants and underwear. Then you raise your arms and allow her to pull your shirt off of you. Now you are standing in front of your mother as naked as you were when she gave birth to you.<br>\r\nYour mother has you lie down on the floor (as your siblings' changing table is not big enough to support your weight) and begins unfolding the diaper. She lifts you up enough to slide the diaper under your bottom and sets you down on it. She then takes a container of baby powder and liberally covers your crotch with it. Once she has rubbed it in, she brings the front of the diaper up between your legs, pulls the sides up, and snugly tapes it shut. Once this is accomplished, she pats the front of your diaper and helps you back to your feet. Then she has you turn around and pats your padded bum to make certain it is fully padded.<br>\r\n\"You have to see yourself,\" she whispers in your ear, \"You look so adorable!\"<br>\r\nShe has you stand in front of the full-length mirror. You see yourself naked except for the large diaper you are wearing. You smile as you enjoy the sight and the feel of the diaper encasing your crotch and bottom.<br>\r\nYour mother smiles and asks you \"What do you want to do now, baby boy?\"<br>\r\nYou tell her that you want to</span></div></div>",
            "created":1346216400,
            "id":1416380,
            "title":"Agree to her offer"
        },
        "15211111":{
            "choices":[
                "Your little sister is pointing a gun at you",
                "Your siblings playing dolls"
            ],
            "content":"<div class=\"\"><div> <span>\"Mommy I want to go and play with my little siblings\" you say. \"Ok Freddy, but you need to remember you are now on the same level as your siblings\" your mom said \"now go play\". Your mom then leaves your siblings room and goes to her room. You turn around and see...</span></div></div>",
            "created":1348808400,
            "id":1436522,
            "title":"play "
        },
        "15212":{
            "author_id":"18natem",
            "author_name":"Weekend532",
            "choices":[
                "You need to pee.",
                "Your siblings come in."
            ],
            "content":"<div class=\"\"><div> <span>Fred smiled and decided to wear the diaper, so he took off his pants and underwear, unfolded the diaper, and taped it around his butt and crotch. He looked in the mirror and liked how he look and how comfy it was. Fred said “These feel so good, I’m so glad to be back in diapers.” You pull your pants over your diaper and they fit, and as you do that.</span></div></div>",
            "created":1572358500,
            "id":2739798,
            "title":"You diaper yourself"
        },
        "152121":{
            "author_id":"18natem",
            "author_name":"Weekend532",
            "choices":[
                "Use the toilet.",
                "Use the diaper."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then, you feel something in your penis feeling full, you need to pee, you go to the bathroom and close the door, and you were thinking of the toilet when it hit you, you have a diaper on, so what will you do?</span></div></span></div>",
            "created":1572380040,
            "id":2739860,
            "title":"You need to pee."
        },
        "1522":{
            "choices":[
                "Yes",
                "No",
                "Grab it and go back to your room"
            ],
            "content":"<div class=\"\"><div> <span>You turn around to your little sister poking your leg. \"Fred why are you rubbing one of my diapers all over you?\" she asks. \"Well I er uhh\" you say back caught red handed. \"Fred it is ok I know what you want, I saw you looking at the clean diapers earlier. Do you want to try one on?\" she said as she held one that was big enought for you to put it on. </span></div></div>",
            "created":1346216400,
            "id":1416488,
            "title":"Your little sister says something to you"
        },
        "15222":{
            "choices":[
                "You sister comes back with the diaper",
                "You mom comes in"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No I really dont want to wear one\" you say as you leave the room. You then go to the living room to watch some TV. Soon </span></div></span></div>",
            "created":1347512400,
            "id":1426836,
            "title":"No"
        },
        "1523":{
            "choices":[
                "3 feet tall (same height as you little siblings)",
                "2.5 feet tall (you come up to your siblings chins)",
                "2 feet tall (you come up to their chests)"
            ],
            "content":"<div class=\"\"><div> <span>All the sudden you see the diaper begin to get bigger in your hand, but then you look around and realize that not only is the diaper getting bigger but so is the rest of the room. You also realize that your clothes are not shrinking with you. You try to run out of the room as you shrink, but this causes the shrinking to occur faster. You reach the door to your little siblings room and realize that you are...</span></div></div>",
            "created":1346302800,
            "id":1416826,
            "title":"You shrink"
        },
        "15232":{
            "choices":[
                "Emily",
                "Adam"
            ],
            "content":"<div class=\"\"><div> <span>You stop shrinking and look around at how big everything is to you. Emilys crib is huge it seems to be about ten feet tall and Adams matches it. Then you look over and see the changing table which seems to be about 2 feet taller than you which is about half your height there was no way you chould reach it without help. The final thing that you noticed was one of Emily's diapers lying on the floor right in front of you. It could easily fit around you and up to your belly button. Then a shadow came over you and you looked up into the eyes of none other than...</span></div></div>",
            "created":1358053200,
            "id":1508332,
            "title":"2.5 feet tall (you come up to your siblings chins)"
        },
        "152321":{
            "choices":[
                "Not tell your mom",
                "Go tell your mom, your big sister said to"
            ],
            "content":"<div class=\"\"><div> <span>You are looking up into the eyes of your not so little sister Emily. Emily looks down at you and starts to giggle. \"Wwwwhat Emily\" you ask a little scared of your giant little sister. \"Fred you went pee pee all over the floor\" Emily said pointing at the puddle of pee at your feet. \"Oh what the heck\" you said as you jumped away from the puddle of pee. \"Fred you need a diaper now cause you had an accident, good thing you were trying to wear one earlier cause it is now on the floor. You get to be in diapers after all, just like Adam and I\" Emily said as she picked up the diaper in one arm then put the other around you. You are totally shocked you didn't even fight her as she lied you down and put her princess disposable diaper around your waist. It did come up past your belly button. She then stood you up and said \"Fred you need to go tell mommy what you did or I will tell her for you as your BIG sister\" she giggled and emphasized the last two words. You decided to....</span></div></div>",
            "created":1425249840,
            "id":1942005,
            "title":"Emily"
        },
        "1523211":{
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You're too shocked to do anything so Emily runs off to tell your mom. When she enters the room she's obviously surprised to see her 18 year old son now being shrunk and wearing a diaper with princess prints. ''What happened?'' she asks. ''I don't know, I just shrunk somehow, I really don't know.'' you reply, equally confused. ''Well, since you are now baby size and I already know how much you like diapers you might as well be treated like a baby.'' she says with a little smile and continues: ''it's actually nice to have you back as a baby again.'' You were excited as well but tried your best not to show it since you were a little ashamed of your fantasy.<br>\r\n<br>\r\nShe then looks at the diaper you're wearing. ''Aww Emily, did you give Fred one of your diapers? That's so sweet but I think your brother is still a little small for them.'' You look down and see it has almost fallen off. Your mom takes it off and carries you to the bathroom and puts you on a changing table. Soon she comes back with a pack of smaller diapers which used to belong to Adam but were now too small for him. ''I think these will be just the right size'' she says as she grabs your ankles, lifts up your bum and slides the diaper under you and closes the tapes. <br>\r\n<br>\r\n''Aww aren't you a cute little guy'' she coos and carries you to the kitchen where she sticks a baby bottle to your mouth. ''Ok sweetie, finish your bottle and then you can play with Emily and Adam.'' You gulp down the milk while sitting on her lap, it really feels safe and comfortable. After you're done she carries you out of the kitchen and puts you into the playpen with your siblings.</span></div></div>",
            "created":1448400360,
            "id":2066350,
            "title":"Not tell your mom"
        },
        "153":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "1 foot",
                "Smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How small?</span></div></span></div>",
            "created":1402203600,
            "id":1809288,
            "title":"She shrunk him"
        }
    },
    "info":{
        "author_id":"arnoldjameson0",
        "author_name":"Stendier",
        "brief_description":"Fred is put in diapers with his younger twin siblings",
        "created":1346197080,
        "description":"<td align=\"left\" class=\"norm\">An 18 year old boy named Fred lives with his mother and his twin siblings who are both three and in diapers.<br>\r\nSoon, his mother will have three children in diapers!<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\nNo vore<br>\r\nNo killing off people<br>\r\nNo transformation into animals<br>\r\nNo age regression.<br>\r\n<br>\r\nYou may shrink and/or grow.<br>\r\n<br>\r\nIncest between Fred and his mother is alright. Just try not to go overboard with graphic detail.<br>\r\n<br>\r\nTry to make it long, okay?</td>",
        "id":1887893,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1572380040,
        "modified":1572380040,
        "pretty_title":"Fred's Adventures"
    }
}