{
    "chapters":{
        "1":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Tooth Division",
                "Claw Division",
                "Bone Division",
                "((WORKING ON SETUP))",
                "((WORKING ON SETUP))"
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the belchers cup, a championship where the strong eat the week, the'll be alot of full bellies, day ones match ups and contestants will follow.. enjoy your feeding, and do your best to win yourself a place at the top, everyone else well stowed in your ample frame<br>\r\n<br>\r\n<br>\r\nCONTESTANTS.. (First person to post for a characters storyline can develop it far past these rough details.. Written down by Division<br>\r\n<br>\r\nTOOTH<br>\r\n<br>\r\n1.A brontosaur, black and red colorings, 23 feet all, massive body, non anthro<br>\r\n2.A Anthro triceratops, 12 foot muscular.<br>\r\n3.Stegosaur, slow, fat, 15 feet tall, protected by natural defenses.<br>\r\n4.Golden colored muscular anthro rex 17 feet tall<br>\r\n5.Dark green Utah Raptor, 12 feet tall. Black stripes down his flanks<br>\r\n6.Smilidon anthro. Saber toothed feline, pure white fur, fast and hungry, tanding 10 foot tall<br>\r\n7.Mammoth non anthro- Thick shaggy brown fur, trusks trunk. lots of weight.<br>\r\n8.A massive boa naga, 50 feet long, 8 foot upper torso, pure serpant. Anaconda like markings, deep purple base. <br>\r\n9.Anthro Gator, red hide, moderate armor, standing 9'2 <br>\r\n10.Heavy anthro blue dragon, two tails and two heads, Experienced Gladiator\t<br>\r\n<br>\r\n<br>\r\nCLAW<br>\r\n<br>\r\n1.A Massive golden dragon, non anthro, Musclar but fat, 45 feet long, 30 feet high, without counting his tail<br>\r\n2.a smooth looking eastern style red dragon, white mane and fur down the body. The dragon is both Quick and quite long<br>\r\n3.Nessy Style Dragon, 30 feet long light blue with dark orange spots on back<br>\r\n4.A ravenous Saber tooth otter, 12 foot tall, fast and far stronger than it looks<br>\r\n5.A gargantuan cave roo. 30 feet tall, peach colored fur, black tongue, markings on its chest and belly that look like a bib.<br>\r\n6..Non anthro gator, 23 feet long, smooth sea green color. Thick armor plates<br>\r\n7.A sky blue Allosaur, a red hourglass on its snout. 15 feet tall. Muscular build<br>\r\n8.Giganotosaurus-22 feet tall, non antro yellow and brown color scheme<br>\r\n9. A quick white raptor, a red crescent marking on his left haunch, 8 feet tall, ravenous<br>\r\n10 A huge Igunadon, wears armor on the lower part of its body. Pale blue and yellow colorat<br>\r\n<br>\r\nBONE<br>\r\n1.An muscular anthro stego with a pot belly,17 foot tall wearing armor on its flanks, It wears a eyepatch over the left eye <br>\r\n2.A Hadrosaur (Duck billed dino), Pure black with white markings on his rib cage. Stands 20 foot tall. A newcomer<br>\r\n3.A non anthro lean black dragon, fast and able to cook dinner himself.<br>\r\n4.A Wyvern. 50 foot wingspan, but Far less impressive on the ground..  maybe 10 feet of body.. but it sure is hungry<br>\r\n5.A non anthro lean black dragon, fast and able to cook dinner himself.<br>\r\n6. A young, just of age, Silver dragon anthro hatchling... massivly fat, small wings, standing 14 feet tall.<br>\r\n<br>\r\nLast four are still assembling<br>\r\n<br>\r\n<br>\r\n<br>\r\n(Participants still assembling)<br>\r\n</span></div></div>",
            "created":1180674000,
            "id":416243,
            "title":"So It starts"
        },
        "11":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Stegosaur vs Dark Green Raptor",
                "2 headed blue anthro dragon vs Anthro red gator",
                "Boa Naga vs Mammoth non anthro",
                "Black and Red Bronto vs Golden anthro rex",
                "Anthro Triceratops  vs Smilidon Anthro"
            ],
            "content":"<div class=\"\"><div> <span>Play from the roll of the character you wish. anyone can be pred or prey, depending on how the players play.  Try to make the matches last for all participants entertainment<br>\r\n<br>\r\n<br>\r\n<br>\r\n*Strongly against one player running the table with a character, give other people a chance to join in and add to your storylines every few chapters</span></div></div>",
            "created":1180674000,
            "id":412550,
            "title":"Tooth Devision round one"
        },
        "111":{
            "choices":[
                "Lightning offensive.",
                "Cautious defensive."
            ],
            "content":"<div class=\"\"><div> <span>You bask in the bright lights that shine down on you and your opponent.  No matter how many times you do it, stepping into those lights makes you feel invigorated.  There is a little time to play to the crowd.  Chances are that most of them expect you to lose.  That does not matter though.  It is always more fun to surprise the crowd and it makes the experience a lot more entertaining for them as well.  Your opponent may have a few feet on you and his girth shows he is very successful, but there is no doubt in your mind that you will win this fight.<br>\r\n<br>\r\nAfter playing to the crowd you take a much closer look at your opponent.  He is almost your opposite as far as fighters go.  Your well toned muscles are those of a quick and lethal predator while your opponent has the fat and slow, yet extremely muscular, body of someone that is used to using sheer overwhelming power.  By the way your opponent is licking his lips you can tell he expects you to make him just a little fatter and slower.  To you, the fat body looks absolutely delicious.  It will make for a nice meal to start out this tournament.  You will probably need the extra nutrients later on.<br>\r\n<br>\r\nThe cage begins to lower.  It looks heavy enough to keep either of you from escaping.  There are long spikes all over the cage and you would be surprised if it was not electrified as well.  No escape, that is perfectly fine with you.  A few opponents in your past have managed to escape through the crowd and it is nice to know you did not have to worry about that here.  It is time to concentrate on the opponent before you now.  The bell will be ringing soon and you doubt he will hold back while you admire the cage.<br>\r\n<br>\r\nYou still need to come up with a strategy to beet the stegosaur before you.  He did not get that big by being stupid and careless.  There are a couple of ways you could go about this.  You could go on the offensive immediately and use your overwhelming speed to finish this match quickly.  It might be a good idea to stay on the defensive though.  You should be able to avoid anything he can throw at you and tire him out.  That way he would struggle less as he slide down your throat and all those spikes would be a little less uncomfortable as you added his own girth to your own.</span></div></div>",
            "created":1181451600,
            "id":415220,
            "title":"Speed VS Power"
        },
        "1111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Latch onto the side of the Stego and Press your attack",
                "Play as the Stego..."
            ],
            "content":"<div class=\"\"><div> <span>Being cautious might work if you were in a better posiition to wait out the foe. He probally will be all to happy to use the slow and steady method, ending with you squirming in his midrift. Your strength is in speed,first strike, maim him and keep on it till you have won. You wait a moment for him to inhale, then time your attack for when there is the least air in his lungs <br>\r\n<br>\r\n<br>\r\nYou move in quickly, Ducking low to avoid the Stegos first move, you swing around to Grab its left arm with your jaws, its fat but you can get your lips around it, you slide both your hind legs into position and kick his middle hard.  Then add a quick double kick to his chest, staggering him. Carefullly avoiding his plates and spikes you continue to soften him up<br>\r\n<br>\r\nThe beast is already a few seconds behind you. Your kicks to his stomach make it wobble.. Your forclaws grab its head and start to wrench, continuing a frenzied assault. Even as you grapple you start tot taste that meaty armflesh, your tongue rubbing against it again and again, moaning at the pleasure.. The sweet hide just makes your drool run more and more.  perhaps you should do hit and runs.. but if you keep attacking you can trip him up.... You add a strong one two set of kicks to his knee, scoring telling blows, the feel of bone under the fat is quite obvious.</span></div></div>",
            "created":1181538000,
            "id":415434,
            "title":"Speed kills..Will it feed?."
        },
        "11112":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Flop over on the Raptor and crush him under your girth.",
                "grab his head with your spare hand and tear him off.. and then"
            ],
            "content":"<div class=\"\"><div> <span>You grunt in pain, the raptor was to fast, it grabbed you and seems to be trying to eat you a bit at a time. You swing your body, trying to use your momentum to get him off but hes lodged in there, grappling and chewing, trying to get through your protective hide and fat.<br>\r\n<br>\r\nThe Raptor readjusts its bite, trying to get closer to your vitals,Its drool runs down your body as you feel its attacks, though its hitting you hard your layer of fat protects and cushions you far more than he knows. nothing crucial yet, all an all its not a smart speed demon. A few missed kicks  and you manage to catch a calf in the assaulted side, making him yelp, in surprise.. you might not be fast overall, but you closed your hand nice and firm.<br>\r\n<br>\r\nTaking a deep breath you  flex your muscles and decide its time to teach him a lesson in Stego style Combat. Its close, brutal, and always won by the bigger man.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1181538000,
            "id":415474,
            "title":"Staggered, but not out"
        },
        "111121":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Lay on his back, Yank his ankle back, twisting hard , shove your plates into him",
                "Put your arms behind his head in a headlock.. and rape him"
            ],
            "content":"<div class=\"\"><div> <span>Having the leg hold on the frantic raptor you fall to your side. The raptor can't get away with you holding on though. The sudden shift of position, your torso and shoulders slamming into his body pinning him to the floor, forces air from his lungs removing the bite from your underarm. You quickly pin the head down, keeping its eyes looking away. You don;t want it to see what its doing after all..<br>\r\n,<br>\r\n<br>\r\nThe crowd cheers in pure bliss at the surprise, a big boy isn't well liked till they start to win, your not flashy, but the crowd gets the idea that an initial offense can easily lead to an offensive gurgle from a sated gut.  You feel the raptor struggling for breath under you, squirming to get out. Still holding his foot you are at liberty to try your nest move<br>\r\n</span></div></div>",
            "created":1181538000,
            "id":415481,
            "title":"A weight to much for raptor to bear"
        },
        "1111212":{
            "choices":[
                "Switch to the raptor.",
                "Attempt to grab the raptor while he attacks."
            ],
            "content":"<div class=\"\"><div> <span>You wrap your arms around his head.  This will definitely be something fun to do before you add him to your girth.  It will probably wear him out so he will not try to claw your throat on the way down.  The poor little guy never really stood a chance you laugh to yourself and lick your lips in anticipation.<br>\r\n<br>\r\nYou are about to penetrate the raptor when he starts chuckling.  That seems weird for somebody in his situation.  Then he says, “You leaf eaters are all the same, all brawn and no brains.  What do you think your dealing with, another one of your smooth footed companions?”<br>\r\n<br>\r\nYou feel something pointy against your leg.  Crap, you had forgotten about those lethal feet of his.  He had kicked you a few times, but it was his head he had been using as his primary weapon.  Now you had left your own leg open to a vicious attack from his free foot and the raptor was taking advantage of your carelessness.<br>\r\n<br>\r\nThere is a loud ripping sound as the raptor’s claw tries to tear up your hamstrings.  You roll off of him before he can completely cripple one side of your body.  The cut was still bad.  Not bleed to death bad, but you were definitely going to be even slower on your feet than before.  That was not much of a disadvantage though.  Your back was well protected and he would have to come at you from the sides or come in for a head on attack.  The little raptor would also have to do a lot more damage to you than you would to him in order to take him down.  It would only be a matter of time before he made a mistake and you got your hands on him once more.  And your arms were perfectly fine.<br>\r\n<br>\r\nThe raptor is charging, jaws agape.  You ready yourself to counter his charge.</span></div></div>",
            "created":1181538000,
            "id":415511,
            "title":"Retractable Claw"
        },
        "11112121":{
            "choices":[
                "Finish him.",
                "The stegosaur is feigning injury."
            ],
            "content":"<div class=\"\"><div> <span>You were hoping that he would concentrate on your head once again.  Sure enough, that is just what he does.  The stegosaur tries to get anther headlock on you, but when you are within inches of him your jaws snap closed and you go for another kick to his injured leg.  You really dig in with your claws and he cries out in pain.  Then you dart back from him just before he can take your head off with his fist.<br>\r\n<br>\r\nThe stegosaur is now clearly unstable on that leg.  That should make it a lot easier for you to get off as many hit and run attacks as you want.  You would not want to get in his grip again.  It would not be good if he tried to rape you in the middle of the ring once more.  You are not really afraid of being raped, it is just that you have a little surprise for those that try to have sex you and want to keep it a secret until you encounter some of the larger opponents in this tournament.<br>\r\n<br>\r\n“Aw, what’s the matter?  Does the big bad herbivore have a little trouble walking on that delicious looking leg?”  You figure taunting will help make him a little sloppy.  The crowd is also cheering.  It seems that it has once again become a match of the little guy overcoming all odds to beat his monstrous opponent.  He might have the strength of an enraged opponent, but you are already faster than he is and you should be able to dodge him even better if he does not put much thought behind his attacks.  The stegosaur snorts and you think you have his attention.<br>\r\n<br>\r\nYou sprint back in and he looks a little better prepared for an attack to his legs, which is why you go for the arm you bit before.  This time you just bite down and try to swing your head back and forth to tear up the arm before backing up immediately.  You are not going to make the mistake of enjoying his flavor while he still has a free arm to grab you with.  That had been a stupid mistake and it had been embarrassing to get caught by the stegosaur that way.  Your raptor ancestors would be ashamed.  There will be plenty of time to enjoy his flavor once you have him sliding down your throat.<br>\r\n<br>\r\nBy the way his arm looks; you might have actually hit something vital this time.  His arm is hanging limply and now he only has one good leg and one good arm.  You lick your lips, sensing a kill.  This might be over faster than you had thought it would be.  “Did that hurt?  Don’t worry; I’m sure all the pain will go away after I’ve digest you.”</span></div></div>",
            "created":1181624400,
            "id":415762,
            "title":"Hit And Run"
        },
        "111121211":{
            "choices":[
                "Eat, uh, meet and greet a few fans.",
                "Go and digest your meal."
            ],
            "content":"<div class=\"\"><div> <span>He may be strong, but he cannot beat you with only one arm.  You play to the crowd a little bit since the stegosaur is not going to be having any sudden bursts of speed.  The crowd loves it too.  None of them want the match to be over too soon anyways.  They want to get their moneys worth out of these fights.<br>\r\n<br>\r\nYou go in and delver a kick here, a bit there, and the occasional claw rake to the stegosaur.  The attacks do not do much damage, but the crowd has fun watching you do them while the stegosaur tries to grab you.  All of these attacks do serve to tire the stegosaur down as he continues to make angry, but sloppy, swings at you.  It eventually becomes so easy to dodge him that you are letting him come within inches of getting you before pulling away from him.<br>\r\n<br>\r\nYou go in for one more kick to his leg.  Right after you do so, you are taken by surprise as he attempts to lay on you.  There is just enough time to dance backwards before his immense weight flattens you.  That was a lot closer than you would like the crowd to think.  Then you notice the stegosaur is not getting back up.  He had not done that on purpose.  He had just fallen over and he did not look like he could get back up.  Beating up on a standing opponent was one thing, but the crowd would turn on him if he tormented someone who could not even stand up.<br>\r\n<br>\r\nYou walk up to your fallen opponent.  He makes one more weak attempt to attack you with his good arm.  You just grab his arm and shove it in your mouth.  He tries to shake his arm out of your mouth, but he is too weak to do that anymore.  You swallow his arm all the way up to his shoulder.  Then your jaw starts to expand as you take his head and chest into your mouth.  Now is the time to savor your opponent, before you have to deal with those spikes.  Whatever the stegosaur has been eating has made for excellent seasoning.  This is one of the best stegosaurs you have ever eaten.  In fact, he tastes so good that you do not even notice when the spikes hit your throat.  The meal is just so delicious nothing else matters.  Your mouth and throat expand impossibly as you try to force a meal larger than you are into your belly.  Even the sounds of the roaring crowd do not register with you as you enjoy your victory.  All that is left of the stegosaur that is outside of you is his spiked tail.  It tries to use it to whack you in the side of the head in one more futile effort to defeat you and escape.  You had been anticipating that and caught his tail with your hands.  A few more gulps and you had slurped the tail down as well.<br>\r\n<br>\r\nYou only wish the stegosaur had been a little bigger.  It is a little sad that the meal has to over so soon.  You let out a satisfied belch and take a good look at yourself.  It looks like you have grown in more ways than one.  You are a couple feet taller than you had been and your belly still drags pleasantly against the floor.  As you lick your chops to and rub your belly happily with both hands as you let out another belch as you wait for the cage to rise so you can get out and the next match can begin.  This is a good way to start this tournament out.</span></div></div>",
            "created":1181624400,
            "id":415763,
            "title":"Food Chain"
        },
        "1111212111":{
            "choices":[
                "stay as raptor",
                "The boys pov"
            ],
            "content":"<div class=\"\"><div> <span>After you have left the ring and the tribune, some ambulance men comes.<br>\r\n\"We must check your healthiness, please come with us\" on of the ambulance men say.<br>\r\nThey admistrate you a long, complicated way to the clinic.<br>\r\nAn half an hour later arrive you the clinic. \"Why is the way to the clinic so long? Why you haven´t built the clinic by the exit?\" you ask a little angry.<br>\r\n\"Err... you must ask the architect. We aren´t responsible for the construction\" an other ambulance man say confused. \"Now we will check your healthiness, please lie down on the operation table\" he add.<br>\r\nSo you lie down and they clamp some electrodes in your face and on your chest.<br>\r\n\"pulsebeat is solid\" one man say.<br>\r\n\"Its almost done, we only give you an injection\" the doctor say and take a syringe. \"It won´t hurt\" he say and injects a clear fluid.<br>\r\nAfter some minutes the doctor say: \"Its done. You can go back your changing room\"<br>\r\nSo you go out the clinic and try to find back the way you had taken. \"What stupid guys! Why they have built the clinic so far away?\" you talk to yourself after some ineffective tryings to find back.<br>\r\nOne hour later you are back the exit. \"Phew! Now I want to have a rest\" you say exhausted and open the door. Then you see a teen is standing in your changing room and smiles excited.<br>\r\n\"What are you doing here?\" you ask suprised.<br>\r\n\"Its so a glory for me to meet you!\" the stutter.<br>\r\n\"When you want a autograph, you have bad luck because I can´t write\" you say a little nerved.<br>\r\n\"No, I don´t want an autograph. I want to be a wrestler like you and I wanted to know if you, err..., can train with me?\" the boy ask shyly.<br>\r\n\"You want to train with a dinosaur?\" you ask dumbfounded.<br>\r\n\"Yes, I really want. Its my dream to become a popular wrestler\" he answer excited.<br>\r\n\"Ok, I can train with you, but we must make it more realistic\" you say<br>\r\n\"How?\" he ask astonished<br>\r\n\"Do you have a costum?\"<br>\r\n\"No, I always wrestled in my shorts\" he say<br>\r\n\"Ok, then make you ready\"<br>\r\n\"Yes, we can start\" he say unsure<br>\r\n\"Because you are the learner, you can attack me and I will avoid\"<br>\r\nThen the teenager run to you and try to punch you, but you jump away easily. He quickly turn around and try to kick you. You avoid every attack of him. \"You must be faster\" you say.<br>\r\n\"I try, but you too fast for me\" he answer enervated. The teen kick and punch but never score a hit.<br>\r\nAfter many ineffective beats you say: \"Now its my turn! You must try to avoid\" <br>\r\nYou smile snaky.<br>\r\nThen you kick him. He jump away, but it was scant. \"Hey, good!\" you compliment him.<br>\r\n\"Thanks\" he say very happy.<br>\r\nDuring he talk, you kick his belly so hard, that he fall backwards. He gasp, but you put your feet on his belly. \"You lose\" you simply say.<br>\r\n\"Ok, let me stand up, please\" he say.<br>\r\n\"I can´t\" you say with a viciously smile.<br>\r\n\"Why not?\" he ask a bit scared.<br>\r\n\"Haven´t you read the rules? I´m the winer and you are the loser. You know what will happen when you will lose.\" you say.<br>\r\n\"But I´m no member by this tournament\" he say shocked.<br>\r\n\"You fought against me and then you are a member\" you answer.<br>\r\n\"Please...\" he cry but you ignore his please and you bend forward. You open your mouth and...</span></div></div>",
            "created":1238432040,
            "id":668762,
            "title":"foolish fan"
        },
        "11112121111":{
            "choices":[
                "next match"
            ],
            "content":"<div class=\"\"><div> <span>You bend forwards and look in his with fear filled face. A little saliva drop from your jaw and land on his bare chest. He try to disengage him and try to push your feet with his free hand away. But its useless, you are to strong for him.<br>\r\nHe cry muted whereupon you predominant laugh. \"You cowardly worm! Stop crying and comply your fortune\" you say scoffing. Thereupon he cry louder. \"Why me? You have eaten a whole dinosaur. Why me too?\" he snivel tearstained. \"I always could bear a little snack... and you have the right size\" you answer conniving. Now flow more saliva out of your mouth and you lick it with your tongue away. You try to solace the boy by you say to him: \"That is not so bad... you won´t feel the digesting acids. You will be quasi a part of me\"<br>\r\nNow you bend more forwards. You are really close to his face with your mouth. You open it wide and lick his face. You close your eyes for enjoyment. \"Human tastes sooo good... and its really funny to eat them alive\" you say. You laugh and devour his head. Your prey shout and struggle, but it only come a muted sound out.<br>\r\nYou tear at his head and you work you slowly to his shoulders<br>\r\nYou set your foot back on the ground and elevate you head. The boy kick in the air and try to free himself out of his cramped prison, but by every kick slides he deeper in your mouth.<br>\r\nWhen you have reached his belly, you bring your head in a straight position. More saliva runs out your mouth. You lick his belly and enjoy his flavor. \"You taste so good.. and send the stego my regard\" you say and must laugh. Now you elevate your head again and the boy slide deeper in your stomach. The bulge in your belly becomes bigger the more the boy disapear in your gullet.<br>\r\nThe boy struggle and struggle, but he can´t arrange against your avarice.<br>\r\nWhen you have reached his legs, it become faster. You lick him a last time before you swallow him whole.<br>\r\nYou feel how his feet slide down your gullet und hum jubilant.<br>\r\nYou sit down at the ground and rub against your with a dinosaur and a human filled belly. You burp loud and feel how the escape attempts of the ugly boy attenuate.<br>\r\nSome minutes later you go to your room and lay in your bed. You rub your belly one more time and fall asleep</span></div></div>",
            "created":1239098340,
            "id":671992,
            "title":"Living Meal"
        },
        "111121211111":{
            "author_id":"riptortalon",
            "author_name":"RiptorTalon",
            "choices":[
                "It is a employee of the tournament.",
                "It is the female wanting to talk."
            ],
            "content":"<div class=\"\"><div> <span>*A loud knock is at the door that startles the green dinosaur awake. You give a sigh of annoyance upon realizing that the dream of being the center of attention in a harem of beautiful females was just and probably only be a dream. Stretching your scaled arms above your head you yell out to whoever is on the other side.*<br>\r\n\"If you have keys to this place then come in. If I did not give you keys then give me another hour of rest.\"<br>\r\n<br>\r\n*You know that there is only a few people with a key that would dare wake the victor of the last match. It is either a worker from the tournament to give you news on the next match or the female who introduced you to this fighting league that you gave a spare key to.*</span></div></div>",
            "created":1436589420,
            "id":2006322,
            "title":"Rude awakening."
        },
        "1111212111112":{
            "author_id":"riptortalon",
            "author_name":"RiptorTalon",
            "choices":[
                "was a poor raptor looking for a way to get fame.",
                "was a rich dino who just had perverted fantasies of eating others."
            ],
            "content":"<div class=\"\"><div> <span>*Finally getting out of bed your green scaled belly sloshes back and forth noisily. Giving your gut a firm poke you can judge that most of the stego and human snack are mush but not ready to come out yet. The door swings open revealing it to be Ananda the one responsible for you being here. As she gets into full view you are able to gaze at her body that you have not seen for several weeks. She is a fellow raptor but has tan scales a little taller then you and has a little bit of chub around her belly.*<br>\r\n\"Hello Ananda, what brings you here? Last I recall you said I should not make it to the big leagues and here I am with one win already.\"<br>\r\n<br>\r\n*She groans as you jiggle your belly to show off the last challenger. After you are done teasing her she replies with a smirk.*<br>\r\n\"I said you should not try going into the big league since you are not ready yet. The smaller matches when I was training you, you almost lost half of your matches and it seems that only luck was on your side. Yesterday I saw your first match and was surprised that you went against my judgement on your skills. Don't you remember how this all started in the first place?\"<br>\r\n<br>\r\n*You sit down on the bed and  continue to rub your squishy belly while responding.*<br>\r\n\"Of course I know how this all started. Years ago when I had nothing to do YOU asked me who at the time was a...\"</span></div></div>",
            "created":1436591280,
            "id":2006334,
            "title":"Why did she come?"
        },
        "11112122":{
            "author_id":"banzillaa",
            "author_name":"Banzillaa",
            "choices":[
                "Make fun of him, embarrass you're meal before eating it.",
                "Kick him around alittle more...People DID pay to see this."
            ],
            "content":"<div class=\"\"><div> <span>You're opponent thinks you are now nothing but a helpless vegetarian with a sore bleeding leg, but he is wrong, while it may seem that you simply rely on brute strength you use you're own body fat in you're strategy...You still have afew more tricks up you're armored hide. <br>\r\n<br>\r\nHe's charging at you looking ready to simply swallow you right then and there since of you're attempt to rape him, he's not taking chances anymore. His comment on how burly \"leaf eaters\" like you're self all fight the same way, thats odd coming from someone from a species that has will not change their strategy of attack; hit and run. To you this is no warriors way of fighting. You come up with a plan, it's risky due to chance but if this doesn't work you might not have time to think of another one before he gets you in his mouth. <br>\r\n<br>\r\nHe's making a full on charge at you seeming to be targeting a spot you wouldn't expect or be able to counter in time. You get you're defenses up with both you're arms held strongly in front of you, he stops three feet ahead of you and drats around you to try and naw at the side of you're belly...Just as you expected. <br>\r\n<br>\r\n\"Fatal mistake!\" you say with fury in you're booming voice, and swing as hard as you can with you're spiked tail. The next thing you here is a bloody smack as like as if a hammer swung down hard and hitting tough meat. The crowd gasps then roars in excitement, you look at you're foe laying half broken on the muddy ground bleeding from his right shoulder and his thigh...You can see his shoulder and thigh was impaled by the spikes on you're tail, he's squirming in pain, in so much pain he can't even scream but instead has a face of pure shock. You're thinking that he's trying to figure out what went wrong. <br>\r\n<br>\r\nYou feel sorry for him, but then you're belly churns and reminds you why you're here, to eat those that make the foolish mistake of doubting you're power. So what shall you do?</span></div></div>",
            "created":1218964200,
            "id":571195,
            "title":"Attempt to grab the raptor while he attacks."
        },
        "111121221":{
            "author_id":"banzillaa",
            "author_name":"Banzillaa",
            "choices":[
                "Fast quick swallows .",
                "Slow and easy gulps."
            ],
            "content":"<div class=\"\"><div> <span>While you did feel sorry for him for a moment, your cruel side arises as you remember at how he taunted you for being as fat as you are. Being fat is natural for your race but none the less you still hate it intensely when others poke fun at you for it. <br>\r\n<br>\r\nYou figure that since he'd be hardly any trouble to gulp down in his beat up state you might as well give him something to remember in his final moments of the outside world. <br>\r\n<br>\r\n\"Whats the matter? Don't have it in you to get knocked down again?\" you say with a smirk. He mumbles something foul and strains to get back on his feet but his wounds prevent him from doing so, he makes it to one knee though. <br>\r\n<br>\r\n\"I wouldn't do that if I were you, you might bleed to death before I can enjoy breaking your pride into little pieces and eating them.\" You laugh at his sad attempts to fight back and watch him snarl furiously at you. You decide it's enough taunting for now, you've delayed your stomachs will for too long and the crowd is getting impatient. <br>\r\n<br>\r\nSo how will you finish your meal?</span></div></div>",
            "created":1219049400,
            "id":571645,
            "title":"Pfft...THAT was your best?"
        },
        "1111212211":{
            "author_id":"banzillaa",
            "author_name":"Banzillaa",
            "choices":[
                "You get visitors...Most likely fans.",
                "Switch to the Raptor."
            ],
            "content":"<div class=\"\"><div> <span>You're not in the mood to take this slowly, you hungry now. <br>\r\n<br>\r\nYou slowly walk over to you're defeated meal and rub you're stomach in impatience, the way he bleeds makes you thirsty, you imagine how it would feel going down you're throat. <br>\r\n<br>\r\nHe's stretched out on the ground breathing heavily with half of his body covered in his own blood due to struggling to get back into the fight but that only widened his wounds. <br>\r\n<br>\r\nYou stand over him looking down at him as he stares back up at you narrowing his eyes because of the pain his wounds are causing him. \"It hurts alot, right? Don't worry...It won't hurt for much longer.\" and with that you pick him up with one hand and stick his head in your mouth, he struggles weakly but this isn't even noticeable to you, you continue to slurp his body up like a noodle. A bulge is visible in your throat, you can feel him start to move into your stomach as his legs inter your throat. <br>\r\n<br>\r\nHe suddenly starts to kick around, you wonder why as he's pretty much gone anyway, struggling at this point is pretty pointless. You make one last hard swallow, and he plops in your stomach completely. It's sort of difficult to tell if you even eat something as large as him, you would really have to look closely to see his bulge through your girth. You wave to the cheering crowd as belch with gusto, your meal is rather quite now despite the digestive process not beginning yet.<br>\r\n<br>\r\nThey rise the spiked gate and lead you back to the relaxation area while talking to you about your victory. </span></div></div>",
            "created":1219130580,
            "id":571988,
            "title":"Through the teeth and past the gums."
        },
        "112":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Play the two Headed game...",
                "Pick up a sharp Piece of steel to use as a spear... equalizer?"
            ],
            "content":"<div class=\"\"><div> <span>Your a muscular beast, standing almost ten feet tall.. well more like 9 but you claim it to the smaller foes before you eat them. You have tons of natural talent, a eating and fighting machine. Limber and flexible you stretch as your the first in the arena.. its done up like the ruins of a city.. countless objects to hide behind, tons of dangerous pointy objects<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe foe... this is.. interesting, he's a big boy, hes blue, and covered with hard scales and chitinous plates, furthermore he has two heads and two tails, all looking hungry, It shows countless scars of battle.. its a bit pudgy and standing at 7'11..The Warrior smiles, unarmed, you realize that both heads are independent... its like fighting two at once.. this isn't going to be easy.. on The other hand.. they might argue....<br>\r\n<br>\r\nYou decide to wait, your not going to give away your abilities to soon, and if you keep your eye on this dragon you probably have speed over that armor... on the otherhand.. a bit of range could help feel it out.. well your life will be decided here, a old champ or you the new one...</span></div></div>",
            "created":1181710800,
            "id":415946,
            "title":"2 headed dragon Vs Anthro Gator"
        },
        "1121":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Switch to the two headed dragon's perspective",
                "Continue as the gator"
            ],
            "content":"<div class=\"\"><div> <span>You decide to see if you can play the dragon's two heads against each other. If you can get them to argue you can gain the advantage.<br>\r\n<br>\r\n\"Hey I've never seen a two headed dragon before so I'm curious about something. Which one of you is the smartest?\" You ask the dragon's two heads. The eyes on the dragon's two heads blink in confusion at the sudden question and look at each other for a second.<br>\r\n<br>\r\n\"Why my brother is!\" The head on the right replies in a thick British accent.<br>\r\n<br>\r\n\"Why thank you old chap.\" The head on the left responds in a British accent as well. \"But I'm certain that it is you who is the smartest.\"<br>\r\n<br>\r\n'Well that didn't work.' You think to yourself as the two dragon heads continue to compliment each other's intelligence. You need to think of a different question if you want to get the two heads to argue.</span></div></div>",
            "created":1189227600,
            "id":443075,
            "title":"A Two Headed British Dragon"
        },
        "113":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Continue on as the naga.",
                "Switch to the mammoth's perspective."
            ],
            "content":"<div class=\"\"><div> <span>You slowly slither in, letting the big crowd gasp and 'oooh' over your thick, scaled length, slowly coiling it about your side of the ring and flexing those rippling muscles underneath the layer of fat you've built up in the arena matches.  Your 50-foot length twitches in anticipation as you look across the ring to your opponent.  It seems you've been set up with an odd one this time -- a huge wooly mammoth, taken straight out of the ice age!  You hiss and flick your forked tongue out as you gaze up, and up...and up to its massive, towering head, those curled tusks over eight feet long!  Your coils bunch in anticipation of such a feast, saliva already building in your maw as you imagine stretching your jaws over such a huge beast...  It looks like just a dumb animal, staring back at you without a word, without much more than a few blinks and a deep stare...but at the same time, it's huge, and that fur probably protects and hides a lot of muscle that will keep you from getting a good grip with your coils.  Even as your assessing the situation in front of you, trying to get your slithery mind around the possible ways of gulping this furred elephant down, the bell rings, and with a great, echoing trumpet...he charges forward!</span></div></div>",
            "created":1181624400,
            "id":415645,
            "title":"Slithery Power Versus Towering Elephant"
        },
        "114":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Take The Tyrants Roll",
                "Take the Thunder's Roll",
                "(maybe adding something odd later)"
            ],
            "content":"<div class=\"\"><div> <span>Two enter, one leaves, rules as old as time.. Feast or be feasted on.. the two contenders have left the revelry of the fans behind and now stand in the \"obelisk\" arena, designed of cold black stone, filled with obelisk of obsidian that are both shark and nearly indestructible... plenty of places to duck behind and slam people against, this isn't a match for the timid, .. even at this gargantuan scale the larger combatants might get cramped.<br>\r\n<br>\r\nThunder the Bronto, 23 foot tall and horny, The dark black and Red bronto towers over nearly everyone one, looking down at both fans and foe his body is bulked up and built on the bones of many raptors, a specialist in a way he has hidden his weakness.. for till this moment he has never faced a rex... that being said he has girth, size, and a much hardier natural form than his foe. he swings his tail and smiles, though his hide is thick, and functions as some  natural armor it doesn't hurt that he has stacked the deck and added plates to protect your most sensitive areas and a mace on the tip of his tail... as you stare at the Rex you feel your passions fight for control.. urging you own, filling your body with more than just hunger, you WILL win.. in all ways.<br>\r\n<br>\r\n<br>\r\nTyrant the rex... Thats what they call you, Its a simple name for a 17 foot beast, it shows how long you've been here. As a rexian you stand almost five feet shorter, Your powerful female form is basically anthro. you body lacks much of the mass of the herbivore, the gain for that lightness is both speed and agility... with loosing little of power or chugging ability. thick golden scales adorn you like armor. While you don't look it you are a gladiator with years of experience. You have devoured many things bigger than you and this delicious two toned bronto just is making your teeth dribble with drool, you let them gape open slowly as you watch your foe</span></div></div>",
            "created":1196314680,
            "id":470090,
            "title":"Thunder Lizard Vs Tyrant Lizard"
        },
        "1141":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Bite at the Brontos Leg, Once its on the ground its all yours..",
                "*shuder* draw it in, offer to suck its cock... and when its not paying attention",
                "Your surprisngly agile, try to do a body block take down,aiming at his shoulders"
            ],
            "content":"<div class=\"\"><div> <span>You were born to feed on others, the bigger the more satisfying, a raptor is just a snack in your mind, wiggly finger food. You might be more humanoid than your kin but that doesn't mean your any less deadly, fast, agile and with stout body.. You start to circle the slower beast, carefully watching.. This'll be tricky.. he is bigger by a good bit, and unlike most of your big meals is an experienced fighter, the armor covering his vitals shows that all to well... You slap your hands together, stretching slightly, never breaking eye contact..<br>\r\n<br>\r\nHis voice echos and he licks his chops \"Keep circling, i wanna see that ass, cause i'm going to plow you so hard you'll never walk again\"Thunder snickers, one of his great forelimbs pawing his codpiece... \"Don't worry, i'll PLAY with you first, and then i'll unleash my FINISHER, and tomorrow morning i'll be making a golden bowel movement pretty boy..\"\" <br>\r\n<br>\r\nYou stare at the Massive beast and hold your position right  out of range.. You contemplate taunting him into being stupid, but decide against it.. the'll be plenty of taunting time when your belly is gurgling around him   But for now you want to think about this. thje last person who charged you didn't end well afterall..<br>\r\n</span></div></div>",
            "created":1219018620,
            "id":571467,
            "title":"Take The Tyrants Roll"
        },
        "11411":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Thunder takes you underneath him, burying you underneath his greater bulk.",
                "You find a way around the crippled behemoth and leap atop his back!"
            ],
            "content":"<div class=\"\"><div> <span>You continue to circle your larger, taunting foe.  He seems pretty confident, even making a few half-hearted lunges at you, which cause you to circle more...as if he's trying to corral you into using your ass, just like he said.  When he tries again, moving a step closer and flexing his legs, you make your move instead, lunging down and in, underneath his arms, your strong, scaly arms hugging at his hips while your jaws gape and teeth sink into his left leg!<br>\r\nHe lets out a roar at that and pounds at your back with a big fist, but you merely savage at that limb, leaving it bloodied and crippled...until you feel his long tail wrapping about your waist and tugging you back, throwing you around...you'd not expected his tail as a weapon...  The crowd goes into a frenzy, both fighters down now.  You cough and feel at your ribs, but taste his blood on your tongue and find the strength to stand again...only to see that he's on his feet again as well, trundling in and using his tail as a crutch of sorts, his shadow looming over you!</span></div></div>",
            "created":1219033920,
            "id":571566,
            "title":"Bite at the Brontos Leg, Once its on the ground..."
        },
        "114111":{
            "author_id":"riptor",
            "author_name":"Scaleyvore",
            "choices":[
                "You throw the Bronto off you",
                "You can't budge him and he stuff you up his ass"
            ],
            "content":"<div class=\"\"><div> <span>You look up in horror as you see the Bronto's ass heading toward you  and try to push back but fail as you feel your legs give way and yo are pinned beneath the massive beast. You growl in anger as you hear the bronto speak \"Hehe, you rex's make great cushions\" and he begins to wiggle his bum rubbing his cheeks in your face. \"you really hurt my leg you know, I think it's time for some payback\" and with that the bronto releases a loud fart with a horrible \"PPPRRRRRRUUUUUUBBBBBUUURRRRTTTTT!\" sound. The crowd goes into hysterics at the bronto's gas. \"Ahhhh, farts feel so great when your sat on some one\" the bronto taunts, You however are gagging at the horrible smell and begin tp push with all your might to try and get the bronto off, and soon.....</span></div></div>",
            "created":1222888680,
            "id":589714,
            "title":"Thunder takes you underneath him, burying you u..."
        },
        "115":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Attack her",
                "Taunt her."
            ],
            "content":"<div class=\"\"><div> <span>You stretch a bit, your eyes adjusting to the light of the arena, life has always been tough, for most of your life you've been laughed at, seen as little more than an oddity, well they soon learned that your anger made you hungry.  Standing at 12 feet tall, with a body built on the bones of those who once ridiculed you. Your muscles stand out from your body, strong upper body, heavily protected skull. The natural Triceratops helmet might not be as big as the non anthros you've seen, but its far more mobile, just like the rest of you Cracking your knuckles together you lick your chops, it'll be a good match, but you should win, and fill your belly with a sumptous looking snack, heck you might even get to play with her sweet body first.. Deep down though you know thats bravado.. She wouldn't be here if it was easy..<br>\r\n<br>\r\n<br>\r\nYour foe seems to lack little though, she is agile, she is muscular, she is eroticly shaped her eyes glimmer with hunger, the pure white  fur glistening with sweat. The felines size is a few feet smaller than yours, so your probally safe.. probally is the right world  the way she is licking her chops and iddly stroking her belly hints that she'd give your bulky form a try if you gave her a chance<br>\r\n<br>\r\n<br>\r\nBoth stand in the circular arena, walls closed off, escape chances removed, the spikes on the walls preventing any attempt to escape should things go wrong, two enter, one leaves.. that is the way. . Your stomach rumbles.. The fight to the death.. and to the dinner.... Your first move....</span></div></div>",
            "created":1180760400,
            "id":412780,
            "title":"Trike Vs Cat"
        },
        "1152":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "As the Trike.. continue to taunt.. sexually",
                "Continue as the Felne"
            ],
            "content":"<div class=\"\"><div> <span>You lick your lips as you admire her body, it'll slip down so nicely, why not share your thoughts<br>\r\n\"Hey furball, thats a pretty coat you have, i bet it'll taste real nice sliding through my lips, and those melons you have too.. yummy\"<br>\r\n<br>\r\nShe seems to be totally oblivious, her eyes staring at you intently, twitching.<br>\r\n<br>\r\n\"No speakyed da English?\" You say, then point to her and rub your belly, making a dry burp to bridge the language barrier\"<br>\r\n<br>\r\nShe nods energetically and approaches<br>\r\n<br>\r\n\"Oh good, you want to crawl into my belly\" You laugh, you look scrumptious when you walk, swing it baby.\"<br>\r\n<br>\r\nShe continues to approach, you notice her claws extending<br>\r\n<br>\r\n\"Hey hey, don't be like that or i might have too..\"<br>\r\n<br>\r\n\"Shut up,and fight\"She snarls viciously. \"Talk after your in my belly!\"<br>\r\n<br>\r\n....</span></div></div>",
            "created":1181451600,
            "id":415017,
            "title":"Cats be food... only right"
        },
        "11521":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "You dodge out of the way at the last possible moment.. for now",
                "Shit... you moved the wrong way,  she trips you up and slurps on your tail"
            ],
            "content":"<div class=\"\"><div> <span>You manage to hide your surprise at her words.. She.. she can't actually belive that she has a chance... but the more you look at the form you start to get distracted by things that aren't worth dying for your taunts continue, almost on autopilot while you struggle to get your mind focus<br>\r\n<br>\r\n\"Hey pussy, your to cute, why don't you start meowing and let me show you my lower horn!\" You pat your crotch and start to stroke yourself. She doesn't blink, staring at you licking her lips<br>\r\n<br>\r\n\"Catfood, don't you want to suck on some meat before your down\" You add, getting a bit honry.. no.. thats not from watching her..<br>\r\n<br>\r\n\"Hey puss... If you give me some kinky play i might just make you my biiii....<br>\r\n<br>\r\nYour words are suddenly cut off as you see her move, to fast, way to fast, you instinctively move.</span></div></div>",
            "created":1181538000,
            "id":415636,
            "title":"Reving up the taunting"
        },
        "115212":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "You manage to shake her off your tail",
                "She clings on as you swing, And when you stop those claws hit your hamstrings ha"
            ],
            "content":"<div class=\"\"><div> <span>You react, but the exact way she wanted, as you lift a foot she slides under, grabbing your right ankle and pulling, teetering you over. You almost keep your balance before a roundhouse kick with exposed talons comes right under your helmet. sending you on your belly and leaving three small red marks on one of your few vurnable areas<br>\r\n<br>\r\n\"Oh shit...\"mrpph\" you land on your belly hands moving back to grab your head \"What  the hell, how'd you hit...\" She doesn't say anything before the feline grabs your tail in her mouth and kicks hard...just as you realize the weakness of being aroused... You feel her foot under your hips and hit your sensitive region, you yowl in pain, the crowd starts to laugh. You see stars.. Come on.. pull it together<br>\r\n<br>\r\nShe keeps deep throating your tail, swallowing alreayd half of it while you shake your head, this can't happen. You rear your left hand back to swipe at her only to find the nimble feline spin kick it hard. Your own grasp is a second to slow.. Damn fast cat. She keeps eating.. defeating your attempts to rear back and grab her. <br>\r\n<br>\r\nLegs..thats gotta work.. you bring them together, only to miss her again, getting her feet down on your knees, claws first, pain arcs through your body. \"This can't happen\" you scream 'What are you part grasshopper.!\" You feel your knees buckle weakness flowing through them.. Shes.... hitting with percsion..<br>\r\n<br>\r\nAll you have left is your tail... and thats being eaten.. maybe your strong enough to shake her off..its attached FAR stronger to you than her....<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415643,
            "title":"wrong way three horn"
        },
        "1152121":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "As you get up shes on you again.. pouncing and swallowing your head",
                "She remains stunned long enougn for you to get to your feet."
            ],
            "content":"<div class=\"\"><div> <span>the felines wet jaws keep greeping up your body as you struggle, your mind is racing, what kind of feline is this, so far all your attacks have been worthless in this pose, on your belly.. eaten up tail first...<br>\r\n<br>\r\ntail...thats it. You start to swing your tail.. Muscular tail root straining a bit at her added bulk, You wince and groan as you lift her from the ground, slam her down, she stays stuck,you try to swing her, each motion sending pain and stress up your spine,  But your feeling your tail get cold again, just the trail of her saliva left as you slowly begin to work your own way out of her Jaws,. Each thrash of your tail  gets easier and easier untile finally with a great feat of posterior strength you send her flying. your tail soaked, trembling, your body still aching so much you hardly hear her her land<br>\r\n<br>\r\nTaking three breaths, you begin to rise. Enough of this shit. That cat is going down... hard...</span></div></div>",
            "created":1181710800,
            "id":416092,
            "title":"Cat-apult"
        },
        "11521211":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Try to Shake her off your head again.",
                "Pry her off with your hands."
            ],
            "content":"<div class=\"\"><div> <span>You get to your hands and knees and look up, seeing the felines wide open jaws stretched fully, they move over the front of your head before you know whats hapening, your snout half into her mouth. her tongue , licks your face slightly, before she moves again The sudden shock lets her get your entier cranium to the frill in back into her jaws. Then she bites, securing herself, the fangs perfectly placed around your head to hold you in tight.. You might have her.. she can't swallow you this way perhaps... <br>\r\nStill this is letting you stare down her  gurgling gullet, the dark tube ahead of you beckoning, drool feeling your eyes, coating your face even as you squim. The smell of her last dinner assaulting your nose, making you feel somewhat lightheaded.You feel her legs brace on your chest, clinging onto you tightly... but thats it..<br>\r\n<br>\r\nShe doesn't seem to be moving down your gullet much... but then you realize.. HERE she doesn't have to... your an airbreather just like she is.. and need alot more of it with your body.. your nose and mouth are obstructed.. only her mouth.. she could wait you out if you don't do something. </span></div></div>",
            "created":1181710800,
            "id":416096,
            "title":"It goes dark"
        },
        "115212111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Your eyes struggle to stay open, air..going",
                "A bit late, but try to pull her off.."
            ],
            "content":"<div class=\"\"><div> <span>You thrash and shake your head, moving every  bit of your body your screams muffled, your head struggling to pierce her with your horns, but other than apparently tickling her palat your not getting your horn in with enough pressure, shes just moving with your struggled.Her drool sinking into your eyes, her own panting well modulated even as you struggle. <br>\r\n<br>\r\nThe lioness starts to lick you, her belly rumbles, she keeps making yummy sounds over your face, a few licks of your eyes send you into more convulsions... but soon you realize your little air is going far faster now....</span></div></div>",
            "created":1181710800,
            "id":416171,
            "title":"No no, your not going to be eaten"
        },
        "1152121111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "The stomach acids wake you up",
                "You drift off into a peaceful airless slumber"
            ],
            "content":"<div class=\"\"><div> <span>You fight, your head shifts, twists,  you struggle to get breath, but its gone.. your lungs burn.. you feel the exertion coming to bite you hard. your body aches, each moment your eyes are open is a victory, staring down her gullet, your heart races. You hear the slobber rush against your armored body.. all your thick hide won't do you a bit of good... <br>\r\n<br>\r\nYou manged to get to your hands and knees.. your body stiffening but then your air passes, you struggle to swallow enough.. but its gone...your being suffocated.. each weak motion just quickening your fate... just like those who went in your belly so many times. A few tears run down your face as it is pressed down.., a tight hot squeeze, her gullet has your skull.. she's starting to dine on your massive form already.<br>\r\n<br>\r\nHer jaws  creep down your body, leaving you twitching slowly. Soon you feel in a half dream state, oozing, sliding down the feline gulelt, feeling it clench around you, lack of air, seals your resistance, her soft mouth moving over more and more, by the time her jaws are at your belly your head pokes into her stomach, eyes closed, the fumes only barely register. ..</span></div></div>",
            "created":1181970000,
            "id":417214,
            "title":"The End is Near!"
        },
        "11521211112":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Continue on as The Sabertooth"
            ],
            "content":"<div class=\"\"><div> <span>your eyes never open, you feel warmth all over, a few light kicks and your rocked to sleep, its so tight, so warm, you can't resist, your body shuts down in silence, hardly a struggle even as it starts the digestion into feline belly..<br>\r\n<br>\r\nThoughts dance in your mind, your not sure for how long, you were an embarrassment, you should have been wary,you shouldn't have been so confident.. at least you won't hear the laughter and jokes about what happened, just the dull roar of the crowd through the predatory felines stretched gut... You imagine it far longer than it really happens, but your last thoughts are of. .. At least i probably got eaten by the champ.. would be a shame to lose to anyone else.<br>\r\n<br>\r\nsoon though, your all hers.. the survival of the newly crowned fattest and fittest...</span></div></div>",
            "created":1182229200,
            "id":418249,
            "title":"Rise of the Mammals"
        },
        "11521212":{
            "author_id":"lamejokeguy",
            "author_name":"Foxy",
            "choices":[
                "Next Match",
                " Enjoy her digest some more."
            ],
            "content":"<div class=\"\"><div> <span>She really stunned now. while shes still you open mouth and taking in her feet. Moaning at her delicious taste you gulping her and then taste. Gulping you reach her chest when she starts struggling, but it to late now. The crowd cheers as you take in her chest as she s struggling as hard as she can. Left that's left is her head, then you gulp that too. Her bugle is visible on your stomach as you let out a monster burp. You simile you knew she was only food. Your stomach starts to gurgle as it deigests her.</span></div></div>",
            "created":1250777220,
            "id":747160,
            "title":"Kitty Meal"
        },
        "12":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Golden Non Anthro Dragon vs Sky Blue Allosaur",
                "Saber toothed otteress vs Igunadaon",
                "Eastern dragon Vs Cave Roo",
                "Giganotosaurus vs Non anthro gator",
                "White Raptor vs nessy style dragon"
            ],
            "content":"<div class=\"\"><div> <span>Play from the roll of the character you wish. anyone can be pred or prey, depending on how the players play. Try to make the matches last for all participants entertainment<br>\r\n<br>\r\n<br>\r\n<br>\r\n*Strongly against one player running the table with a character, give other people a chance to join in and add to your storylines every few chapters<br>\r\n<br>\r\n</span></div></div>",
            "created":1180674000,
            "id":412776,
            "title":"Claw Division"
        },
        "122":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Make your way in slowly, slashing with your thumbclaws.",
                "Switch over to the otteress as she plans her strategy."
            ],
            "content":"<div class=\"\"><div> <span>You've built your body on a towering heap of victories, often overpowering bigger, stronger dinos and reptilians when they thought they had a chance.  They looked at you -- an iguanodon of all things -- and simply prepared for your digestion in their bellies...but you didn't grow so massive simply by eating leaves and trees.  In fact, you've spent your entire life in the gladatorial arena, and have picked up not only fat and muscle, but some tricks to protect yourself.  Sure, you're not as swift as raptors and you don't have teeth like a rex or dragon, but you've got some huge spiked thumbclaws and your weight to throw around, and you've managed to pick up some armor to cover your rounded lower body with over the years.  Now, you look across the ring at a busty little otteress not even half your size, clad in a too-snug one piece outfit, the furred femme licking over her sabertoothed fangs and stroking at her plump stomach as if she were eyeing you up for dinner, herself!  With a snort, you bang the armor over your huge stomach and laugh, pointing a sharp thumbclaw at her.  \"Don't make me laugh, little furball!  I've coughed up bigger pieces of fluff than you, and it's just a shame my stomach will be done with you before I even leave the ring!\"  You take in the crowd's cheers and grin at her, licking your long tongue around your lips.  The fans know the winner here, already.  You just plan to drag it out for some fun.</span></div></div>",
            "created":1181624400,
            "id":415647,
            "title":"Tons of dino stacking up to a tough little otter!"
        },
        "1222":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Sexual Luring... your to hot for words afterall",
                "Little otters are very strong...when hungry"
            ],
            "content":"<div class=\"\"><div> <span>You stare at the big dino, he is a pretty thing, you've always liked big boys and girls, there such fun, so cute to play with. His scales and armor glitter slightly in the sun. You purr deeply, rhythmically. You can't control yourself, Tail waving. Slowly you approach. <br>\r\n<br>\r\nSure your not huge, Size is fun, but it scares so many people off to play with, especially when your so naturally cute and pretty. You actually love those you fight with, and remember them always... <br>\r\n<br>\r\n\"Oh, your so big\" you lisp, stroking your fangs innocently ..<br>\r\n<br>\r\nHe'll be putty in your paws... and the crowd'll cheer you to the championship<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415713,
            "title":"Adorable, Sexy, furry.;and that dino e loksso cute"
        },
        "12221":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "his dino dick is already out and THROBBING for you.",
                "He's panting and looking uncomfertable. trying to resist"
            ],
            "content":"<div class=\"\"><div> <span>You make eye contact with him, smiling sofightly, you run your paws down your lucious body as you start to talk, Your eyes trembling,your body dribling sweat while you make slow erotic movments \"oh my god your so big... your huge, i've never seen someone like you\" you say, your voice softly resonating.You keep just enough distance from him as you add your tail to the mix, slowly stroking between your legs with both hands, moving up, your one piece looking more than damp.<br>\r\n<br>\r\n\"I know i'll never win against a stud like you\" you lisp, your eyes crossing for effect, but such a man\" You continue to moan shimming your hips. your own paws sliding over your chest, fondling yourself visibly as you crouch aslightly than stetch, making your boosum bounce.. even as different species you can see his eyes staring at your pillows<br>\r\n<br>\r\n\"Your\" He starts but just can't get out another word<br>\r\n<br>\r\n\"Come on.. we all know how this'll end\" you say sweetly, starting to pull down your one piece revealing your breasts to the world, a few oohs, alot of awws..and probally mostlys, \"shit.. those'll be bad to lose\" Escape the crowd. You continue to slowly disrobe\"He nods, jaws a bit agape, most certainly not what he expected. \"Why should i wear anything to reduce my flavor to your saurian tastebuds\" You continue, Stripping downhalf way, your own eyes sizing up the brute.<br>\r\n<br>\r\nYou hear him moan, closing his eyes for a moment, still unable to talk right.., so you continue..\"But.. why do you need armor? it must be very hot, look, your sweating already from the heat...\"of course its the heat your putting on but he looks down at his armor, apparently able to think for a few moments and realizes that your harmless.. and certain things are getting a bit steamy.. could use some airings. He pulls off his armor and drops it to the ground ,returning the smile to you..<br>\r\n<br>\r\n\"Ohh, thats a good idea \"You muse, as you inwardly chuckle, continuing your strip job slowly, watching his lips drool, sure he wants to eat you, but now in more ways than one. By the time you kick off your disrobed one piece toward him he reflexivly grabs it, then drops it if realizing it doesn't look very predatory. Your sweaty smooth body has him facinated though while you move closer, slowly approaching far closer than he would have allowed earlier, your soft paw on his left hanch sends him stiffined as the croud hoots. <br>\r\n\"Yes..YES..YES..GO FOR IT\" is pretty much the appeal of the crowd<br>\r\n<br>\r\n<br>\r\n<br>\r\n\"Whatever could i do to you though\" You continue \"You could eat me in one gulp, but then, then i'll be all gone, just food.. nothing more..\"You whip a tear \"And the fans won't get a show...\"They boo and hiss \"And you'll be all unsatisfied down bellow \"The dino blushes \"I mean.. if your afraid of little old naked me.. i can't understand?  why don't you play with your prize... i might not be big but i bet i'm a wonderful desert to whatever you want before hand. You turn around,spread your legs erotically and hear him huffing<br>\r\n<br>\r\nIt really wasn't fair. The igunadon had hardly said a word, just following orders... and now...</span></div></div>",
            "created":1181624400,
            "id":415720,
            "title":"Striptease in a match? Okay... sure.. sure..."
        },
        "122211":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "\"Suck me off\" he moans lewdly",
                "\"I'm going to PLOW you\" he bellows..."
            ],
            "content":"<div class=\"\"><div> <span>The dinos huge dong glistens in the light, the crowd oohs and aws at the veterns endowment, you even smile slightly as you look at the thobbing meat, his eyes half closed in pure pleasure, you can only imagine what he is dreaming and thinking now.. the pulsing member already peaked just by your look and your words. . The heavy belly sagging, dribbling sweet onto his members head \"<br>\r\n<br>\r\n\"I'm going to rape you\" He grunts, Putting a paw on your unresisting head'<br>\r\n\"Can't rape the willing\" you purr back, pressing your hands between his legs and making his whole body go stiff again.<br>\r\n\"You should be honored to be screwed by the devourer of countless huge dinos\"<br>\r\nYou nod silently, smiling up in aw. little revealing the same fact about how he should feel.<br>\r\nhe dino lifts his arms and puts them behind his head, showing off to you, posing for the crowd \"MINE\" he says, stomping his foot on the ground. Dominating you, showing ownership.. Jeeze.. the dinos a kid at this you muse. The igunadon has no idea..<br>\r\n<br>\r\n<br>\r\nHe slides one paw under your tail to lift it, you don't resist a bit, letting him do as he pleases, you feel his arousal rub against your body even as he turns you around, leaving a messy trail on your bust as it rests between them, . The sweaty dino almost blocks everyone elses view of you... but even that you see his knees shaking, his body trembling. it makes you wonder if he ever had willing sex... won't matter for long<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415724,
            "title":"Dino and otter Erotic Lit"
        },
        "1222112":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "He cums..his biggest ever..and size starts to change as he spurts",
                "He pulls out, splattering a full load over your body stickily.."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to plow you so hard that you'll never have to walk again\" he laughs, putting both paws on your shoulders, having them tense as if he expects you to struggling, when you dont he turns you around and moans, rubbing that huge dino meat against yuor tight puckered vulvu, then your anus,as if trying to chose...\"I might just play with this furrball till its nearly bursting\" he hows. the crowd cheers.. then chuckles.. then smirks.. Some are all to curious... but he is still totally focused,<br>\r\n<br>\r\nYou grunt.He is big, and that wonderful well used cock head presses into your feminne areas without any more forplay, he is TRYING to be brutish and rape, but just can't his body isn't letting him. Each inch your rear swallows gets a deeper moan, from normal to sub sonic while he sheaths in you, hunching over, tail flagging behind him. His pre just aids in the lube of your smooth wet passage, you feel him press himself in so slowly, your almost board before you feel him hilt with a strangled roar, the crowd getting some rather hot action.. but surprisingly subdued. <br>\r\n<br>\r\nboth his hands rest on your breast as he pulls out a bit then ack in, a bit more stimulation is all he needs, His mind is stuffed so full with pleasure nothing else in the world matters to him than filling your derrier with his prideful seed..<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415727,
            "title":"Forward plow"
        },
        "12221121":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "He's 15 feet, weakend.. your 15.. but FAR fatter now",
                "He's half your size.. and slim... total reversal.."
            ],
            "content":"<div class=\"\"><div> <span>The dino moans huskily, his breath right in your, face,licking your snout even as he starts to fill you with hot gallons of seed, pressing f lushly you feel the throbbing member racing, his body reacting to pure pleasure ,and your tight ass suckling him down in ways he could never believe. You slide your paws down to feel your growing stomach, moaning at the hot loving.. your eyes half closed in bliss... those who say sex is wrong should just jump up your ass... <br>\r\n<br>\r\nYou chance a look back and smile, almost sad to see his happy face, but the die has been cast, you curl your tail gently around him holding him tight, letting him get a few more moments... and then a few more.. the dino mustn't have came in weeks, he just keeps going, filling you and swelling you. The warmth flows through your body for what seems like forever \"Your a big man\"you mumble<br>\r\n<br>\r\n\"God dam right you slutty Fucker.\" He grunts in passion, eyes tightly closed, Still trying to be the bully. With that a good deal of your pitty flows away.. \"OHH YESS\" he moans, the crowd gasps....but not to his rape... as he gets off...his grip is less assured, his guaranteed victory slips away. the hot ottery depths keep suckling, taking every bit he can give.. and just a bit more<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe Igunadons load fully spent he opens his eyes and finds out the truth, he can't belive it, his eyes look up, and then down, while still pressed into your backside.. he is no longer bigger than you. Your body even more lucious after draining him he falls backwards and stares open jaws as you turn around, the crowd goes into histerics</span></div></div>",
            "created":1181624400,
            "id":415731,
            "title":"Sex changes things"
        },
        "122211211":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "He charges in a rage, jaws open, seeking to pin you down.",
                "You laugh and use your new girth to mow him down."
            ],
            "content":"<div class=\"\"><div> <span>You chuckle lightly and lick your tongue over your long saberteeth as he settles into shock from the odd reversal.  \"Something wrong, sugar?  You look...different, somehow.\"  You wriggle your thick tail and soft butt some, squeezing about his still-impressive cock.  \"I hope you don't mind that I helped myself to a bit more?  It was so good to have you in me, after all...\"<br>\r\nSlowly, you stroke over yourself again and grunt as you slickly pull your ass off of him, turning so all can see what's happened.  You've gained a couple of feet, and he's shrunk so much that he's now your own size, even if he's retained his fat nature.  Your previously soft and lightly plump form has fattened tremendously, though!  Now your overly-big bosom spills out and rests upon a massive, round belly, covered in your soft, smooth pelt.  With a few pats to that huge gut, you wriggle and clench your ass, giggling and feigning an innocent shyness as he looks over you, fury growing in his eyes.  \"Now, don't be mad!  I said I couldn't help it, and now you've made me look so much more beautiful, don't you think?\"  The crowd cheers and hollers their agreement, and the iguanodon, once the bully and favorite, looks around as his lot falls around him.  Clenching his fists and staring back at you with a steaming, slathering fury, he growls lowly.  \"You bitch!  I don't care how you did this, but I'll just get it all back by stuffing you in me, anyway!\"<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415936,
            "title":"A Mismatch to a Same-sized Fight!"
        },
        "1222112112":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "With your back turned to him, he finds the strength to push you off!",
                "He's scared witless by your words as you lower yourself down..."
            ],
            "content":"<div class=\"\"><div> <span>You let out a little girlish giggle and gently grope one of your heavier breasts, winking at him and at the crowd as low moans escape the many fans.  \"Sweetheart, you look too tired to do all that...and I told you how this would all end, didn't I?\"  You notice his dong has slipped back inside him, and he looks prepared to tear into you, even if he's still panting and sweating from the long bout of sex.  In fact, he looks ragged and worn, and you smirk, listening to your belly let out a deep rumble.<br>\r\n\"Oh, my!  Was that me?\"  The crowd simply yells more wildly, and he glares daggers at you, but before he can get his energy back, you bounce forward, your great, fattened stomach hitting his chest and slamming him on his back.  He groans and gasps as he falls hard, and you don't give him a moment to recuperate, padding over and planting a paw down on his groin, pushing in hard and listening to him moan, watching him writhe in pain.  After a moment, you let up and grin down at him.  \"Hmmm...you know, maybe you'd like to try and 'rape' me again?  Only this time, I think my ass is even hungrier...  It longs for you, -all- of you...\"  You've got a gleam in your eye that he shivers at, trying to squirm out as you clench and unclench your fattened rump, turning about to show him the wet slit of your loins and the stretched hole of your anus just above, where his cock already plowed it's way inside.  \"I bet you'll feel sooooo good inside it...\"</span></div></div>",
            "created":1181624400,
            "id":415937,
            "title":"Things are Heating Up..."
        },
        "12221121122":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "His thumbclaws score a deep wound, enough to stall you out.",
                "You finish him off, nice and slow."
            ],
            "content":"<div class=\"\"><div> <span>Turning to look over your shoulder with a toothy grin, you watch the round dino wriggle and squirm, a look of sheer horror in his eyes as your stomach groans in need again, and you move to straddle him, thick tail flagging up and rump descending, your paws grabbing onto each buttcheek to spread them wide.  \"N-no!  No, please don--!\"  The rest of the Iguanodon's protests are muffled by your round ass as you heavily press down on his head, letting out a little shiver and gasping as you sit down upon it, shoving it deep inside your ass, letting him smell his own cum within you, as well as that rich scent of otter...which he's going to become, of course!<br>\r\nThe crowd is going wild at your antics, and you settle down some again, using his rounded belly as a pillow of sorts, even as your ass clenches and 'swallows' around him, his wide shoulders disappearing into the stretched hole.  With a drooling moan, you bounce up and down a few times, each bounce pressing more of the poor, screaming dinosaur into your rump.  Soon enough, you've forced him in to his elbows, and you groan as his hands try to stab and grab at your legs, his upper body bulging out your stomach even more.<br>\r\n\"Oooh!  You feel so big in me!  This is what it's like to really have a -man- inside you...\"</span></div></div>",
            "created":1181710800,
            "id":415938,
            "title":"Taking Him Inside You Again...WAY Inside..."
        },
        "122211211222":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Continue on as the otteress."
            ],
            "content":"<div class=\"\"><div> <span>Your enjoying yourself far too much to worry about the little scrapes and scratches he makes with his thumbclaws, and besides, with another wet, slurping squelch, those disappear into the hugely-stretched entrance to your butt.  You slide a paw down over the massive dome of your stomach to plunge into your wet slit, using your fingers to stroke your aroused vaginal walls as you pull more of him inside, the crowd going wild, many in a high state of aroused pleasure themselves!  \"Uunf!  Just a bit more...just a bit more, sweetie...\"<br>\r\nThe muffled roars coming from within your stomach do little to slow you down as you half-shove, half-swallow his plump stomach and wide hips, your eyes closed tight as your anus stretches massively about that big portion of scaly meat!  You work your paw deeper into your sex the more you suck the iguanodon up, feeling his scaled flesh slip deeper within your ass, until you have to slide over to lay on your side, your legs held apart and your tail still flagged up so the crowd can plainly see the last bits of the kicking feet and scaled tail slurped up noisily between your buttocks.<br>\r\nAs the last of him disappears and your rumpcheeks slide back into a more normal position over your wonderfully-rounded butt, you groan and stuff both paws down into your loins, crying out as you cum, juices sliding down your already-slickened thighs.  Opening your eyes, you watch the enormous bulge of the dinosaur inside you squirm and struggle about, your wet, sticky paws moving to caress and hug him.  \"Mmmm...that's it, big guy.  Squirm as much as you can...it only makes me feel all the better.\"  You sigh and gently grope yourself one more time, before a loud fart rips through the arena, and you quickly clench your rump again, blushing.  \"Oooh!  Guess one has to get the air out some way...\"  You chuckle loudly again as your dinner weakens, slowly making it to your paws and waddling off.</span></div></div>",
            "created":1181710800,
            "id":415942,
            "title":"Showing Off the Power of Otter Rumps"
        },
        "123":{
            "choices":[
                "The dragon taunts back.",
                "The dragon just attacks."
            ],
            "content":"<div class=\"\"><div> <span>You had been looking forward to this tournament ever since you had heard about it.  It had been a while since you had been able to participate in something like this and an even longer time since you had been guaranteed to be able to introduce your opponent to your belly.  You had been so excited you put in a lot of extra training to prepare for this event.  Now not only were you 30 feet tall, now you had muscles on top of muscles.  You look at your opponent and your round belly gurgles in anticipation.<br>\r\n<br>\r\nThe fact that your opponent looks quick and lethal is lost on your stomach.  What matters to it is that your opponent looks like a long furry noodle.  The dragon may be longer than you are tall, but you still think you have the weight advantage due to how thin it is.  You wonder what its strategy will be to beat you.  Its limbs are a little short to defend that long body.  They are not that short, they just look that way compared to its body.  It just looks like it would be awkward to bring limbs placed so far apart into play in a fight.  If you could pin down one half of its body you doubt it would be able to do anything but lash at you with its tail.  You are pretty sure you could deal with that pain as you sucked him down.<br>\r\n<br>\r\nAs the bell rings you lick your lips in anticipation of a good meal and the many more meals to follow.  “I hope I’m not hungry half an hour after this match,” you taunt the eastern dragon.  It does not look that bothered about what you just said.  Then again, dragons and other reptiles never show much emotion in your opinion.  Those stiff faces of theirs did not allow them to.  That does not matter much to you though.  Whether they have a stiff face or not is not important.  The only thing you care about is how they taste as they slide down your throat.</span></div></div>",
            "created":1181538000,
            "id":415436,
            "title":"Dragon VS Roo"
        },
        "1231":{
            "choices":[
                "You think you find a flaw in its form.",
                "Switch over to the dragon’s perspective."
            ],
            "content":"<div class=\"\"><div> <span>“You won’t need to worry about ever being hungry again by the time this match is over mammal.  I just hope you don’t taste as funny as you look,” the dragon sneered.  You let the insult slide right off of you.  There had been a few opponents that managed to get their jaws around you in the past and they said you tasted quite nice.  Then you had gotten them off of you and sent their delicious bodies to your own stomach and thanked them for the compliment.<br>\r\n<br>\r\nYou expected things to go much the same this time.  Then again, if they do not go your way that means you will get digested so there is no point contemplating that future.  Well, it is time to get this match started.  You go right in on the attack.  The dragon looks like it is just waiting for you.  You will show it what a mistake it is to just wait for you to come and get it.<br>\r\n<br>\r\nThen the dragon displays what it can do with that awkward looking body.  As you try to grab its head it leans back out of your reach.  You are not used to an opponent that can lean that far back while keeping the lower half of its body well within attack range.  A swift kick to your gut followed up with a tail lash make you pay for that mistake.  The dragon’s tail is sort of whip like and it hurts a little more than you had expected.<br>\r\n<br>\r\nThis is not the best way for you to start out a match.  But, it looks like the dragon is about to make a mistake as well.  It looks like it is about to follow up on its attack with a punch or a grapple.  The dragon must not have fought a cave roo before because its head is on the same level as one of your more powerful kicks would be.  It had pretty much it admitted never tasting a cave roo before with its taunt and you doubt he was aware of how easily you could bring your large feet into play.  As the dragon comes in for his attack you lean back on your tail and aim both your feet at his head for one powerful kick.  The dragon did not see that coming, but it had some quick reflexes and only took a glancing blow.<br>\r\n<br>\r\nBoth you and your opponent back away from each other while you really think about what it can do with that funny looking body.  By the way it is looking you up and down you think he is thinking the same about you.</span></div></div>",
            "created":1181710800,
            "id":416190,
            "title":"Awkward Looks, Dangerous Fighters"
        },
        "12311":{
            "choices":[
                "You have perfect timing and execution.",
                "The dragon counters your move."
            ],
            "content":"<div class=\"\"><div> <span>You think for a little while and notice a problem with the dragon’s form.  It is pretty flexible, but that does not mean it can defy gravity.  When it dodged your attack it had to get in a pretty awkward position.  If you had been expecting that type of flexibility it would have been pretty easy to trip it up.  You thought of how you might be able to force it to dodge an attack the way you desired or force an awkward attack that would leave it off balance.  Then you would show that noodle what you could do.<br>\r\n<br>\r\nThe dragon looks like it has thought of a strategy of attack as well.  It is charging you and it looks a lot faster than it had before.  You prepare to grapple with the dragon, but you have misread its intentions.  The dragon ducks under your arms and wraps itself around your body and uses its tail to trip up your legs.  You fall to the ground and the dragon performs one of the most complicated leglocks you have ever seen.<br>\r\n<br>\r\nThis might have been a good move to use against most opponents, but not you.  A move like this requires leverage, which the dragon did have, but they also required a lot of strength to maintain.  If you had not been training so much since you heard about this tournament this dragon might have had you.  But now you use some of the most powerful legs in the animal kingdom to break the hold and kick the dragon halfway across the ring.<br>\r\n<br>\r\nThe dragon is up and charging across the ring once more before you have a chance to get up.  You swing around and use your tail to try and trip it up before it can get near you.  It stops in time to keep from tripping and the upper half of its body moves in for the attack.  That is the mistake you had been looking for.  You spring into the air in hopes of landing on the dragon’s midsection.  It is doubtful it will have to ability to force you off of him once you have him pinned to the mat under your bulk.</span></div></div>",
            "created":1181970000,
            "id":417326,
            "title":"Legs"
        },
        "123111":{
            "choices":[
                "Start eating it, and maybe get in a little rape.",
                "The dragon reverses the situation."
            ],
            "content":"<div class=\"\"><div> <span>The dragon had quick reaction time, but it looked like it was taking the dragon a little while to get over the surprise of seeing you jump so high.  Even though you were a kangaroo most people just did not think something as massive as you could jump that high.  They should not underestimate kangaroos, especially ones that had survived long enough to get as large as you are.  Then you land right on the middle of the dragon’s back.<br>\r\n<br>\r\nIt is struggling beneath your weight as you sit on top of it.  You let him struggle for a while.  The best he can do is move a couple of inches across the mat.  This is perfect.  All his speed will not do him a bit of good in a situation like this.  Then again, there are only but so many things you can do to him as well.  Most submission moves you know would be very difficult to pull off on something with a body built like this dragons.<br>\r\n<br>\r\nThe dragon exhausts itself trying to escape while you sit around rubbing your chin and think about what to do with him.  It tries using its body like a whip to make you get off of him.  The position it is in is just too awkward for that to work at the moment.  If its’ entire body was available to it that just might work.  For now, all it can do is annoy you.  You had planned on just eating it, but if it keeps this up a more extreme approach might be called for.</span></div></div>",
            "created":1182488400,
            "id":418923,
            "title":"The Thinker"
        },
        "1231111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Finish the rape before you start to swallow...",
                "Gulp hump.. gulp hump"
            ],
            "content":"<div class=\"\"><div> <span>Perched atop him you let your weight continue to drag . planted like a flag he has no chance at getting you off of him, each moment he struggles he wastes more energy. Brains must not be strong in this one afterall. Waiting out the passioned struggles'll hurt you little, though the audience starts to hollar and howl in derision, not liking the boring but effective maneuver. Eventually the dragon seems to calm down.. . <br>\r\n<br>\r\nThinking to yourself that the foe might be playing possum you stay planted, and then slide your paw to your crotch, starting to paw yourself, it works well.. as always, stiffening up and getting the crowd to calm down some, liking lewd acts. When the first drop of pre leaves your roohood you take your paws off, letting it drop on the dragon.. BINGO... it screams \"FUCK YOU PERVERT\" and thrashes all the stronger. You don't say a word but smile, grinding your furry ass as you feel him buck up and down&gt; you let your cock dribble, holding back enjoying his struggling as it gets weaker and weaker, starting to whimper.. then you step off, grabing his middle like a vice, holding on tight, and shoving you waiting roohood up the dragons backside without a second thought. He makes a strangled gasp and thrashes in your grip, but the energy was wasted early, he can't write free as you bare down, pulsing arousal ready to plow his virgin rear...</span></div></div>",
            "created":1185944400,
            "id":430975,
            "title":"A finishing move?"
        },
        "12311111":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Continue as the dragon"
            ],
            "content":"<div class=\"\"><div> <span>You decide that dinner can wait as you continue humping in and out of the dragon's rear. The dragon keeps gasping and snarling obscenities until you shut him up with a swift blow to the head that knocks him out.<br>\r\n<br>\r\nAfter several minutes you grunt loudly as you cum explosively into the dragon getting a loud cheer from the crowd in the process. You start to pull out of the dragon's backside so you can start eating him when the dragon's ass muscles suddenly tighten around your roohood preventing you from pulling it out.<br>\r\n<br>\r\n\"What the?\" You stammer in confusion as you pull harder but your tool stays firmly lodged inside the dragon's tail hole. Unfortunately the crowd has noticed your \"problem\" and you can hear people starting to laugh. The dragon is still stunned from the blow to the head you gave him so he doesn't know what's going on.<br>\r\n<br>\r\nYou think for a second on how to get loose and get an idea. You carefully position your large feet against the dragon's butt cheeks and push against them to use them as leverage to try and pry yourself out. Unfortunately the awkward angle causes you to lose your balance and you watch in horror and extreme embarrassment as your feet slip into the dragon's butt. The dragon's rear bulges outward ridiculously as your momentum causes you to slide in all the way up to your waist with your tail trapped inside. You try to quickly pull your way out but the dragon's iron tight tail hole muscles keep you firmly in place.<br>\r\n<br>\r\nBy now the crowd is laughing hysterically and you're starting to panic as you push, pull and shove against the dragon's backside. You put your hands against the dragon's butt cheeks and try to push yourself out but some of your leftover cum causes your hands to slip into the dragon's tail hole trapping them with the rest of your body.<br>\r\n<br>\r\nThe dragon's unconscious body shudders intensely and you can only watch in blind panic as the dragon’s anal muscles spasm powerfully and pull you in up to your neck with a loud and disgusting SLURP!<br>\r\n<br>\r\nThe dragon's body starts to shudder again and you struggle in vain as the dragon's anal muscles release another powerful spasm. Your head is yanked into the dragon's rear and your vision goes dark as you're encased in smelly darkness.<br>\r\n<br>\r\n\"Winner by anal voring!\" You hear the referee declare through the walls of your stinky prison. The still unconscious dragon groans as you feel him being lifted up off the mat and carried to the locker room. But you're a little too preoccupied to care as the dragon's anal muscles keep spasming and pulling you deeper and deeper into the dragon's bowels until it eventually pushes you into the dragon's stomach.<br>\r\n<br>\r\n\"Nooooo!\" You wail as the dragon's stomach acids start the task of stripping you to the bone.</span></div></div>",
            "created":1189054800,
            "id":442653,
            "title":"Round Peg Into Square Hole"
        },
        "124":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Charge suddenly, spinting and getting your jaws on one of those drumsticks",
                "Patience..Patience,  Wait for it to make its first and last mistake.."
            ],
            "content":"<div class=\"\"><div> <span>Your eyes open slowly. Your body starting to come online from the chilly morning . You've never really likes the cold, its the heat that keeps your reptilian mind sharp. Your long massive body trembles as you stand, food hasn't been down your gullet in almost a week, it has made your eyes far bigger than your stomach. At just over 20 feet long, heavy set, and having the naturally tough hide of your species you resemble a vehical of war more than anything else. Few would expect your natural speed and sprinting abilty. <br>\r\n<br>\r\n<br>\r\nYour sea green hide glistens abit in the noon sun, each moment you feel it beat down on you continues to fill your tank with hunger and power. Basking in the loving glow, warming your hungry body up while you admirer your dinner. its bigger than you, but whats in that size.. Its got alot of hieght on you but one good snap at one of those legs, a twist of your head and it'll be hobbled and helpless.. how these.. dinosaurs.. .are going to survive the world just boggles your mind, so much.. extra, that reduces the pure predatory power that was perfected by your ancestors...<br>\r\n<br>\r\n<br>\r\nYou stretch your jaws open slightly, countless hungry teeth wait the signal to start, each breath you take, each smell you make, is making you hungrier to put the sauring where it belongs. You slowly creep closer, working to get the beast in range of an initial Sprint.</span></div></div>",
            "created":1180933200,
            "id":413353,
            "title":"Huge, Primitive, Survivor Gator vs dino"
        },
        "1241":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Continue as the Gator",
                "Play The Gigantosaur"
            ],
            "content":"<div class=\"\"><div> <span>The heat stirs your mind. The heat sooths your body.. Everyone knows that. The Big two legger thinks he has time before you strike. That shows what trying to evolve things that aren't needed will get you.  Really, You make a deep chuckle to yourself and wait, creeping.. oh sure its watching you.. but you know your range..it doesn't..<br>\r\n <br>\r\nSoon your ten feet within your sprinting range. And rather than a slow step you break into a full sprint. Charging with all four legs pumping, tail thrashing, jaws wide. You got the drop on the two legger, he only reacts a few moments before your jaws ar at his thighs. He kicks out and turns in the same motion, The moment is at hand.<br>\r\n<br>\r\nYour jaws score, clamping closed around the Saurians left calf, you clench your teeth as your big body is lifted and shaken a bit. This beast does have strong legs, even as you grind your teeth in deeper it still licks, the leg should have snapped by now... You feel him heft you, kick again, but your jaws remain clamped<br>\r\n<br>\r\nSuddenly you feel him lift it's leg, and it/s jaws sink into your side, \"Damn.. you didn't think about that.. but thankfully he starts to tug,trying to get you off before doing any major damage, you suddenly unlatch your jaws and get thrown a few dozen feet back into the arena.. your back has a half dozen punctures, oozing, but staring at your foe your attack did damage. its limping, You didn't crush the leg, but at least it won't be as fast.. <br>\r\n<br>\r\nSo... the first scuffle wasn't desicive.. your made to survive..just a few more bites and your mealy'll be stewing in your gator gut....</span></div></div>",
            "created":1181451600,
            "id":415007,
            "title":"Sinking your teeth into the meat"
        },
        "12412":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Await its next chage, try to swallow it head first",
                "Follow up your blow and try to Finish it while shock still dulls your pain"
            ],
            "content":"<div class=\"\"><div> <span>Shit.. that prehistoric beast just plays dirty..<br>\r\n<br>\r\nYou feel your left leg thob, oozing painfully, It bit deep, it bit hard but your bones and muscles took it well. You've always been lucky,glad it didn't stop today. Your adrenilin works to shut off the pain in your leg as you take a few steps closer, watching carefully. Its fast, and its still got the legs. He'll be a delicous snack to help make your wounds heal all the better<br>\r\n<br>\r\nYou take a few extra test chomps, his flavor strong in your mouth, your eyes watching intently for his first move.. he's doing the same., A few licks of your teeth and you make the first move, ignoring the pain of your leg you stomp toard him, lifting a leg as he makes a bite, landing the leg on his skull and walking over the gator, making the earlier wound you inflicted all the more painfull. You turn just in time intercept the turning gators snap with your own jaws clamping on his lifting him and tossing again you chuckle.. Dumb lizard.<br>\r\n<br>\r\nYour body aches a bit from the pressure on your left calf. Maybe the wound was worse, but you'll have plenty of time to rest after this match.. just keep it together, the gator itself now seems to be lame in one of its front legs. maybe it got hurt in the run over.. just a big hungry smile slides over your lips <br>\r\n\"Hey lizard lunch.. you've LOST..and your going to sag my stomach wonderfully, overgrown NEWT\"</span></div></div>",
            "created":1181451600,
            "id":415013,
            "title":"Damn Gator thing"
        },
        "124121":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Your gape proves victorious!",
                "It seems the croc is full of surprises!  Switch to playing him."
            ],
            "content":"<div class=\"\"><div> <span>You grin to yourself as you see him snort and stomp his one uninjured foreleg, though he quickly winces at the pain in his other.  Good, he's gotten himself riled up just as you wanted...and if he's as dumb as most of his kind, he'll just try to charge in again, and right down your gullet he goes!  You favor your own good hindleg some and snap your jaws at him.  \"Nice scaly snack to round out and bloat my belly nicely, you'll be!\"<br>\r\nTaking a step back with a wince and a growl, you watch as the gator begins charging in awkwardly with the limp in his foreleg, but he's still barrelling in strong and hard, and as he nears he gapes his jaws widely as he did before, aiming for your other leg...but that gape of his is instead met with your own wide-open jaws as you drop and yawn hugely!  You take delight in the surprise in his dim-witted eyes, and prepare to start swallowing...</span></div></div>",
            "created":1181538000,
            "id":415620,
            "title":"Croc jaws, meet dino jaws!"
        },
        "1241211":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Finish him off for good!",
                "Have a bit more fun with the poor thing..."
            ],
            "content":"<div class=\"\"><div> <span>The sweet, swampy taste of the big croc's flesh as his gaping jaws are stuffed into your own proves overwhelming, taking your mind away from the pain in your leg as you concentrate on finishing up this bellystuffer once and for all.  The croc gives a muffled roar, and one of his webbed forefeet slashes out at you, but your scales are thick enough to prevent any real damage -- it's the jaws you have to worry about, and they're safely packed into the back of your throat, a massive swallow tugging in a quarter of the reptile's body.<br>\r\nDespite the pain in your leg, you lift the croc up in your jaws, clamping them down tightly enough to dig into his armored back and soft underbelly, letting the blood flow along your tongue and lips, slurping it up as a throat-wetting appetizer before the feast.  The stupid, relentless croc keeps thrashing, and his huge tail thwacks you on the injured leg, causing a rocket of pain to go up your spine for a moment.  You almost lose your grip on him, but you quickly latch your powerful foreclaws onto him and gape again, using those three-fingered claws to help shove him in, until half of the big reptile is bulging out your neck, the crowd going wild as you chug him down.  You soak up the cheers, once again forgetting the pain as you savor the crowd's roar and the wonderful taste and feel of another opponent stuffed into your gullet.  You toss your head and upper body about, sending the croc's lower half flying this way and that as you get heady with all the excitement!</span></div></div>",
            "created":1181538000,
            "id":415623,
            "title":"Playing with Your Food..."
        },
        "12412111":{
            "author_id":"stalbon",
            "author_name":"Stalbon",
            "choices":[
                "Continue on as the Giganotosaur."
            ],
            "content":"<div class=\"\"><div> <span>As much as you love playing with your food, it's hard to get excited with an opponent as stupid and pitiful as this one.  Sure, he got you good, but he'll be stewing for a day in your belly before your finally done with him, and that's punishment enough.  With cheers of 'Chug, chug!' coming from the crowd, you do just that.  You grip at the croc's haunches and toss him and your long jaws up, swallowing mightily until just those kicking hind legs and tail hang, your chest puffed out around the big reptile.<br>\r\nYou watch in satisfaction as that tail thrashes futilely, the croc putting all of his strength into this last bit of fight, even as you rub your thighs together and stroke over your belly.  You snap hard over his tailbase and listen to the scream inside of your gullet before you finally toss back your head again and swallow him down, feeling the scutes on his back bump and slide along your gullet until he comes to rest in your gut, which sags out and downward heavily, pressing into your thighs and the aroused region of your loins...<br>\r\nWith a hearty belch and a lick of your bloodied lips, you hug that great sag in your middle with both forelimbs, stroking it fondly.  \"Mmm, see you newt?  I said you'd be sagging my middle, and you look so wonderful in it...  A shame there aren't more of you, or bigger ones that would make my belly drag so beautifully...\"<br>\r\nYour speech is interrupted by another massive belch, one that sends out spatters of crocodile scales onto the mat.  With a loving stroke, you waddle off of the arena floor to the cheers of the fans.  You soak them up, ignoring the pain in your injured leg as you go to sleep off your feast.</span></div></div>",
            "created":1181538000,
            "id":415627,
            "title":"Overgrown Newt is Sent to Saurian Stomach"
        },
        "124121111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Sleep and continue to recover till your next match",
                "Get some sexual release after your match"
            ],
            "content":"<div class=\"\"><div> <span>The walk back to your room is satisfing, you feel the beast sag your belly, dumb as it was, simple minded as it was, it is quite a treat, nice aftertaste, a few licks of your maw  will encourage you to hunt his kind more in the future, just a nice scally morsel.. The digesting meal sooths all your pains, the nourisment flowing to your hurt leg, even as you walk your limp gets less and less pronounced.. By the time your at your room your confident enough to make a belch, knocking the door inward without the need to touch it with your body.<br>\r\n<br>\r\nYou feel the final twitch of the hard scaled brute in your gut the moment you plop down on your side, the feeling of the final victory of your stomach sends your  other girth to oozing. the pleasure coursing though in time with the nutrients, your only half awake as the medically trained female triceratops come in.. You don't move, letting the two of them sturture your lacerations, disinfect them, and perform the general needs of a fighting warrior. Scars are fine, but you might not have as easy a fight next time, best get the wounds cleaned and bandaged afterall.. that and the fact nurses  are doting on you while you recline is nothing to sneeze at, But you resist the urge to devour one as she gets close to your jaws.. You'd get in troble and might have a big wound to heal eventually... your foes are for that..and anyone who claims to be a fan..<br>\r\n<br>\r\nEvery moment of rest you feel your wound throbbing less, staring over your full body you can't help but stroke your belly soothingly \"Now your helping me heal newt\" you chuckle to the still,  big bulge...<br>\r\n<br>\r\n</span></div></div>",
            "created":1181624400,
            "id":415737,
            "title":"Digesting, Recovering, Lounging..."
        },
        "1241211111":{
            "author_id":"riptor",
            "author_name":"Scaleyvore",
            "choices":[
                "A Non-anthro red dragon.",
                "A anthro stegosaur."
            ],
            "content":"<div class=\"\"><div> <span>You continue to stroke your gut and you lay there. You decide you should sleep it off and close your eyes and drift of too sleep. Later you wake up and go to get up as you smile to your self as you lift both your legs up and let out a nice loud fart with a loud \"PRRUUUBBBBBUUURTTT!\" You lay there feeling proud of the fart before you take a sniff \"WHEW! that over grown newt was worse than mexican\" You get out of your bed and go to the toilets and release the remains of your meal from your bowels. \"AHHH! that feels good\" you say as you look down to see some scales in your crap as you chuckle\" You should be grateful gator boy, it's an improvement\" you get ready for your next match which is against a...</span></div></div>",
            "created":1221785700,
            "id":584182,
            "title":"Sleep and continue to recover till your next match"
        },
        "125":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Think Raptor think.. thres gotta be a way",
                "Play from the Nessy"
            ],
            "content":"<div class=\"\"><div> <span>A quick and nimble raptor, you move faster than anyone, claws, jaws, and a frenzy like nature you've eaten people twice your size before they knew what hit them, Still that was mostly herd beasts and the like, things you were born to hunt and devour. Your crescent markings move in almost a hypnotic way, the 8 foot frame seemingly far less impressive than your used to..  your first to the arena.. a specially made one, it resembles a huge island with water surrounding it.. your brought in on a raft... and left..alone.. <br>\r\n\"HEY? whos my dinner\" You roar to the crowd\"<br>\r\n\"ohh... its finally arived \"A deep resonating voice echos from the water behind you. so surprising you run and dive into the middle of the island, turning around to stare at the lifting head of the creature.. its not a dragon.. its a mixture of some prehistoric monstoisity and a snake. the head held up out of the water.. its own island like back rising, flippers slowly moving onto the ground.. Pulling it up . It gives off a wet fishy smell, water slucing off of its body as it moves<br>\r\n\"What the hell is THAT!\" you shout <br>\r\n\"Your... the foe... I thought i'd draw something worth while, a big fat dragon, a rex.. and i get THIS?\" Its body shows  a mixture of male and female parts.. you shudder at the thought that you've gotten a freak foe in every way. Its thick purple hide mottled on the bottom, huge flippers moving slowly, but without pause. \"Where are the other ones \"Shi chuckles.. approaching..\"You can't be it\"<br>\r\n<br>\r\n\"HELP\" you whimper, looking around... The fans.. they....they are leaving for refreshments.. thats.. thats brutal.. they aren't even giving you a chance... or worthy watching.. You whimper and shake your head, scratching your thight with a claw.. no dream.. no nightmare.. its real..<br>\r\n<br>\r\nYou've got one thing on the nessy like beast, speed, it can't cover the whole island... and you could run rings around it, you might very well have to. You start to run over options in your mind.. Not enough end with you not in the wet smelly belly<br>\r\n</span></div></div>",
            "created":1181710800,
            "id":415945,
            "title":"White Raptor Vs Nessy"
        },
        "1251":{
            "author_id":"riptortalon",
            "author_name":"RiptorTalon",
            "choices":[
                "Ignore the flippers and get on him.",
                "Attack the flippers to cripple him."
            ],
            "content":"<div class=\"\"><div> <span>The thing you do is run to the other side of the island to be safe for a while longer.<br>\r\nYou go over the few facts that you have onn the beast in your head.<br>\r\n1. It is a large long necked aquatic beast.<br>\r\n2. It moves slowly with its flippers.<br>\r\n3. It has experience taking down things larger than me.<br>\r\nThat is about all you know about it. Thankfully you can see your opponent having trouble moving towards you on the land with its flippers.<br>\r\nTHE FLIPPERS. that is his biggest weakness. You can jump on the sea dragonthing's back and it cannot hit you off. Or you can break his flippers so he cannot move at all.</span></div></div>",
            "created":1188882000,
            "id":442001,
            "title":"The first two options you think of."
        },
        "12512":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "It starts to crush you with its body.",
                "It bends its neck down to bite your head"
            ],
            "content":"<div class=\"\"><div> <span>The monster grins at you and slams both flippers on the ground, it shakes the ground... you look down.. oh SHITTT....You look back at the nessy as it smiled and slamed its whole weight on the ground... the land stated to sink.. this wasn't.. fair... okay, think fast, it'll be getting more and more advantages if you let this go. <br>\r\nYou decide on surprising it,.as the beast is about to lower the boom again you race forward, far quicker of foot you are leaping onto his for fluke as it coomes down. ridding his left for fluke you administer a bite at the root swing and kicking at it with your whole body.. <br>\r\n<br>\r\n<br>\r\nIt dawns on you a bit late that this was a bad move... yes, you got your teeth on the flipper base...  but there are tons of Nessy right near you.... and that long neck.. it might not be built for close combat... but... just like a sauropod .... not many are dumb enough to make such a frontal assault</span></div></div>",
            "created":1218992820,
            "id":571301,
            "title":"Crippling strike?"
        },
        "13":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "content":"<div class=\"\"><div> <span>Play from the roll of the character you wish. anyone can be pred or prey, depending on how the players play. Try to make the matches last for all participants entertainment<br>\r\n<br>\r\n<br>\r\n<br>\r\n*Strongly against one player running the table with a character, give other people a chance to join in and add to your storylines every few chapters</span></div></div>",
            "created":1180674000,
            "id":412554,
            "title":"DIvision soon to come"
        },
        "14":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Beak division",
                "Scale division",
                "Hatchling division",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other divisions...</span></div></span></div>",
            "created":1358051820,
            "id":1507469,
            "title":"((WORKING ON SETUP))"
        }
    },
    "info":{
        "author_id":"talonsaurn",
        "author_name":"Talon",
        "brief_description":"A fighting Championship where the losers are devoured by the winners. Prehistoric Entrants",
        "created":1180718460,
        "description":"<td align=\"left\" class=\"norm\">Its time for another round of eat or be eaten!<br>\r\nSo whats different about this?<br>\r\nThe winners of this competition will Be made into full characters at some point by me, The loosers.. well there part of the winners body for all eternity. Its a cutthroat competition till the last four or so...it allows people to help mold and design new gladiators that might appear in other places.  . The skill of the writers will dictate who wins the matches if everything goes well.. root for your favroties, devoure the loosers<br>\r\nPLEASE post with some length, and just as important, play fair. Develop the characters if possible too<br>\r\n<br>\r\n<br>\r\n*Matches will be set up by the Author, when someone is devoured let the winner go on.  So please leave the following fight setups to me. Feel free to taunt, enjoy the victory and digest, just will set up the next matches myself.<br>\r\n<br>\r\n(will set up a bracket of 32 contestants</td>",
        "id":1270355,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1436591280,
        "modified":1436591280,
        "pretty_title":"The Belchers Cup Tourny:Prehistoric"
    }
}