{
    "chapters":{
        "1":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Zelda",
                "Midna",
                "Fi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will it be?</span></div></span></div>",
            "created":1370667600,
            "id":1607083,
            "title":"Begining"
        },
        "11":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Butt",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which way will she grow?<br>\r\n</span></div></span></div>",
            "created":1370667600,
            "id":1607084,
            "title":"Zelda"
        },
        "111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Magic.",
                "A monster.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Zelda get a bigger chest?</span></div></span></div>",
            "created":1402635600,
            "id":1811386,
            "title":"Big-chested princess."
        },
        "1111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A friend.",
                "A foe.",
                "A neutral party."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, who cast such a spell?</span></div></span></div>",
            "created":1440046800,
            "id":2023173,
            "title":"Mammary mysticism."
        },
        "11111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Link.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did it?</span></div></span></div>",
            "created":1456635600,
            "id":2110616,
            "title":"Close friends."
        },
        "111111":{
            "author_id":"niclol",
            "author_name":"niclol",
            "choices":[
                "Link makes Zelda's boobs bigger now",
                "Link makes Zelda's boobs bigger later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>While link was travelling through Hyrule he comes across a strange book called \"The shape of Magic\". He took it with him, and when he arrived home he started reading it. AS he reads it, it's magic starts to effect Zelda.</span></div></span></div>",
            "created":1514437200,
            "id":2433666,
            "title":"Link."
        },
        "1111111":{
            "author_id":"niclol",
            "author_name":"niclol",
            "choices":[
                "A spell that made zelda's breast bigger by eating",
                "A spell that made zelda's breast bigger by sleeping"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Link decided that it was time to make some changes to Zelda.<br>\r\nHe entered in zelda's bedroom when everyone in the castle was sleeping. Link cast a spell on zelda.</span></div></span></div>",
            "created":1514523600,
            "id":2433922,
            "title":"Link makes zelda's boobs bigger now"
        },
        "11111111":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Goes to find link "
            ],
            "content":"<div class=\"\"><div> <span>Zelda goes to the kitchen to eat breakfast,  after she starts eating her breast grow pushing her shirt out more. She didn’t notice that her breast were growing as she ate the rest of her breakfast. Zelda try to stand up to get out the chair, then she see that her breast are bigger, when did get so big they were a-lest E cup size.<br>\r\n<br>\r\nAfter three pancakes Zelda was still hungry so she ate more pancakes, her breast grow larger busting out of her shirt wow my breasts are huge she exclaims, she takes off her shirt to see her breast size.<br>\r\n<br>\r\nH cup size what how can this be, I wonder if someone cast a spell on me?  <br>\r\n</span></div></div>",
            "created":1573621200,
            "id":2746287,
            "title":"A spell that made zelda's breast bigger by eating "
        },
        "11112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Ganon.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which foe was it?</span></div></span></div>",
            "created":1450760400,
            "id":2078035,
            "title":"Destroyers of unity."
        },
        "1113":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Bring the food ",
                "Look at that water ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What she eats goes to her breast or she drinks mysteries water  </span></div></span></div>",
            "created":1492405200,
            "id":2306597,
            "title":"Something else."
        },
        "11133":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "New bra ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A mysterious new bra</span></div></span></div>",
            "created":1506315600,
            "id":2391305,
            "title":"Other "
        },
        "111332":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Natural ",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Her breast just grow bigger naturally </span></div></span></div>",
            "created":1510376400,
            "id":2413944,
            "title":"Other "
        },
        "1113322":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Yes magical breast expansion jewelry ",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some magical jewelry that makes her tits titanic?</span></div></span></div>",
            "created":1599334620,
            "id":2898105,
            "title":"Other "
        },
        "112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A wish.",
                "Cursed underwear.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Zelda's butt grow?</span></div></span></div>",
            "created":1403499600,
            "id":1816359,
            "title":"A princess' new \"assets\"."
        },
        "1122":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A friend gave them to her.",
                "An enemy dropped them.",
                "She found them."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did Zelda get these underwear?</span></div></span></div>",
            "created":1469682000,
            "id":2187496,
            "title":"A tail-end tale to remember."
        },
        "11221":{
            "author_id":"grimbailey",
            "author_name":"GrimBailey ",
            "choices":[
                "Ass starts growing now",
                "Gets dressed (grows later)"
            ],
            "content":"<div class=\"\"><div> <span>Zelda walked in to her palace chambers, all was normal except for the small pink box atop her dressing table. Curious, the princess opened the box to find a pair of black lace panties. At first, zelda felt embarrassed at the lewd present, but the more she felt the silk material in her fingers, the more she wanted to try them on. Slipping off her dress and current underwear, Zelda donned the new panties, the silk running up her smooth legs making the princess shiver. <br>\r\nOnce on, they fit snug, hugging her peachy butt softly, almost carresing her nethers. At first, Zelda was sceptical, but now she didn't care. These panties felt good. Maybe Link would like a peek.<br>\r\nBut first...</span></div></div>",
            "created":1603832100,
            "id":2930057,
            "title":"A friend gave them to her."
        },
        "112211":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Zelda realises how much she likes it, and continues wearing them.",
                "Zelda manages to pull off her new undies, then notes how much she'd grown."
            ],
            "content":"<div class=\"\"><div> <span>Still stood in her chambers near her dressing table, Zelda stood and marveled at her gift's comfyness.<br>\r\n<br>\r\nIt was almost like these had been tailor-made to fit her peachy little butt perfectly.<br>\r\n<br>\r\n<br>\r\nThough it wasn't long before the spell effect of these black panties was activated.<br>\r\n<br>\r\nZelda now felt her butts' shape, in this short time, had become slightly different from the one she knew.<br>\r\n<br>\r\nAt first she reasoned it wasn't worth minding, since it was a new pair she wasn't used to after all.<br>\r\n<br>\r\nBut soon Zelda couldn't ignore the sensation any longer.<br>\r\n<br>\r\nShe felt down upon where the sensation originated and realised what was happening!<br>\r\n<br>\r\n<br>\r\n\"By the Goddess!\" Zelda said to herself; \"These panties are making my butt grow bigger!\"<br>\r\n<br>\r\nZelda looked down and saw her theory confirmed, it was definitively a bit larger now than before!<br>\r\n<br>\r\n\"How long has this been happening for?\" Zelda asked herself, not sure of how much had passed while she thought of other things related to 'Link' and 'giving peeks'.<br>\r\n<br>\r\n<br>\r\nIn a moment of instinct, she grabbed on to the black lace straps and tried pulling downwards.<br>\r\n<br>\r\nThe panties themselves also seemed to have expanded a bit in size, still fitting her bum ever so perfectly and comfortably...<br>\r\n<br>\r\nBut Zelda thought getting enspelled by growth magic was a bit freaky, so she tried getting out of this magical gift<br>\r\n<br>\r\nGetting into them had been easier than they now were to get out off, feeling that her ass curve's middle, where it was largest, didn't let her panties get past.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>Zelda wondered what to do now:<br>\r\nShe could this gifted spell run its course. It can't make her that much larger, can it?<br>\r\nOr she might try to pull them off again? She has her will. There must be a way!</b></div></span></div></div>",
            "created":1604000100,
            "id":2931347,
            "title":"Zelda is caught off guard by a weird sensation...!"
        },
        "1122111":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "She looks in the pink gift box again, and finds a note there she missed before!",
                "The friend who gave it to her comes into the room! It's...?"
            ],
            "content":"<div class=\"\"><div> <span>Zelda prapared herself to force her tightly gripping panties down yet again, but then hesitated.<br>\r\n<br>\r\nShe felt her butt fill out and her thighs widening.<br>\r\n<br>\r\nHer hips was gaining curvature and her skin felt a bit softer.<br>\r\n<br>\r\n\"Why was I trying to take these panties off of me again...?\" Zelda reasoned to herself.<br>\r\n<br>\r\n<br>\r\nShe let go of the magical undergarment and goes up to a mirror, posing with her ass towards it.<br>\r\n<br>\r\n\"Quite a remarkable change it has undergone thus far, eh?\" Zelda thought, eager for the spell to continue.<br>\r\n<br>\r\nShe stroked and patted her recently expanded buttocks, feeling her spine tingle with excitment as her fingers grazed across their big, pale, cold, soft surface.<br>\r\n<br>\r\n<br>\r\nAnd the growth wasn't done yet it seemed, though with hints that it was losing speed.<br>\r\n<br>\r\nHer panties also felt way tighter, despite not looking that way to her in the mirror.<br>\r\n<br>\r\nHer figure became ever curvier, even at this slow speed, and her butt size was sure to turn heads now, in any clothing.<br>\r\n<br>\r\n<br>\r\nAt last, the magic effect wore of, which disappointed Zelda, but she reasoned it her gift was just single-use item.<br>\r\n<br>\r\nShe admired her ass and the wide black panties stretched across it.<br>\r\n<br>\r\nExcept they weren't as black now, slowly fading into a pink colour now that the spell was used up.<br>\r\n(The spell effect can be recharged, and it'll turn back to being black again.)<br>\r\n<br>\r\n<br>\r\nZelda stood looking at herself in the mirror, admiring and massaging her ass and overall thiccer frame.<br>\r\n<br>\r\nShe imagined that she'd probably never get bored of massaging her ass like this, being very grateful for her gift.<br>\r\n<br>\r\n<div align=\"center\"><b>And speaking of that gift and the friend who gave it to her...</b></div></span></div></div>",
            "created":1604004840,
            "id":2931389,
            "title":"She decides: Having a bigger ass isn't bad at all!"
        },
        "11223":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "They Talked due to a soul living in them",
                "They caused Zelda to fart"
            ],
            "content":"<div class=\"\"><div> <span>(This will be BOTW Zelda)<br>\r\nZelda Was walking one day and found a pair of underwear<br>\r\nWell no use letting these go to waste as she dropped her pants revealing her perfect butt<br>\r\nTime to slip on these underwear onto my bum as she put them on<br>\r\nAhh they feel good now too pull up my pa-HUH<br>\r\nshe looked behind her and her bum grew to twice it’s original size<br>\r\nMy bum it’s more sexy,as she squeezed it<br>\r\nJust then another side effect from the cursed underwear happened...<br>\r\n</span></div></div>",
            "created":1582952400,
            "id":2794797,
            "title":"She found them."
        },
        "1123":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "[The Great Fairy of plentitude ♡]",
                "[Your timeless admirer, Link~]",
                "[No name was written]"
            ],
            "content":"<div class=\"\"><div> <span>Princess Zelda was going about her daily business at Hyrule Castle, handling kingdom policies and other princess-ey stuff.<br>\r\n<br>\r\nShe was sat at her desk, reading through a small pile of letters varying in topics that she'd recieved from her many different subjects in Hyrule.<br>\r\n<br>\r\nSome were business oriented, while others were fan-mail or otherwise mundane.<br>\r\n<br>\r\n<br>\r\n<b>*Knock Knock*</b><br>\r\n<br>\r\nThe sound of a castle servant knocking on Zelda's door caught the princess' attention.<br>\r\n<br>\r\n\"Package adressed for 'ye, ma'm. 'Tis one wasn't bundled in with the other letters.\"<br>\r\n<br>\r\nZelda turned over her shoulder and acknowledged him, telling him to leave it by her door for her to open later.<br>\r\n<br>\r\nThe servant obliged, and went on his way, putting the small brown box down before he did.<br>\r\n<br>\r\n<br>\r\nZelda thought that these letters in front of her could wait, as this unknown package she'd recieved was far more exciting.<br>\r\n<br>\r\nIt's not often you recieve a package unexpectedly, after all.<br>\r\n<br>\r\nZelda leaned down to lift the box of the ground, which wasn't as heavy as she'd imagined, then brought it to her desk.<br>\r\n<br>\r\nShe swept a pile of letters aside to make room for it, as she placed it down to inspect it further.<br>\r\n<br>\r\nIt was brown, rectangular and with a simple lid ontop, tied down with some white string.<br>\r\n<br>\r\nZelda also noticed a tag attached to the lid, which read:<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>- To: Princess Zelda of Hyrule<br>\r\n- From: [Reader's Choice...!]</b></div></span></div></div>",
            "created":1600040460,
            "id":2902504,
            "title":"Zelda opens a mysterious box!? (GONE SEXUAL.)"
        },
        "11233":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "The explanation is simple...",
                "The rules of the growth trigger is complicated..."
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"><b>- To: Princess Zelda of Hyrule<br>\r\n- From: ...</b></div><br>\r\n<br>\r\n\"No sender credited. Huh.\" Zelda thought to herself, wondering what some unnamed stranger would want to send her.<br>\r\n<br>\r\nAnd she didn't need to wait for long, as when untied the string and popped the lid off... She saw a stuffed doll inside!<br>\r\n<br>\r\n<br>\r\nZelda checked to see if the rest of the box was empty, seeing no instructions or other noted included, and then held the doll up to see it better.<br>\r\n<br>\r\nIt was a very well made plush doll, with strands of cloth making up its hair, small black buttons for eyes, a sewn on happy smile and nose, and wearing a pink-white dress.<br>\r\n<br>\r\n\"Was this suppsed to resemble me, perhaps?\" Zelda guessed, flattered by the gift regardless.<br>\r\n<br>\r\n<br>\r\nZelda discarded the box, put the doll beside her bed. Choosing not to dabble with it any further for now, she returned to the other mail on her desk.<br>\r\n<br>\r\n<br>\r\nIt was then however, right after Zelda sat back down by her desk again that she experienced the effects of the booty boosting doll.<br>\r\n<br>\r\nZelda didn't notice the subtle changes that were instilling themselves upon her, since reading the letters took up her full attention.<br>\r\n<br>\r\nThe thighs were becoming slightly more full in size, and the shape of Zelda's \"hit box\" got more pronounced as it widened outwards.<br>\r\n<br>\r\n<br>\r\nThe thought now crossed Zelda's mind that something unusual was happening.<br>\r\n<br>\r\nShe stood up, spinning her head to see if something in her room was causing her to loose focus whilst reading.<br>\r\n<br>\r\nZelda couldn't out her finger what she would even be looking for, but there was a sensation she couldn't ignore that compelled her into action.<br>\r\n<br>\r\nHowever, everything looked normal to her in her room. Same as it always ways.<br>\r\n<br>\r\nBut, she couldn't ignore the pleasureable hint she felt as her breathing grew slightly burdened.<br>\r\n<br>\r\n(She had still not noticed the change to her legs nor rump.)<br>\r\n<br>\r\n<br>\r\nTrying now to shrug it off, Zelda carefully sat back down, and returned to her reading.<br>\r\n<br>\r\nIt was then again that the doll's effect was activated again, and Zelda's ass began to slowly, slowly expand in size...<br>\r\n<br>\r\n<br>\r\n<b>But before the story continues...<br>\r\nWhat about the doll made it affect Zelda in this way?</b></span></div></div>",
            "created":1600042860,
            "id":2902524,
            "title":"Anonymous ass granting gift."
        },
        "113":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A curse.",
                "An item?",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she grow?</span></div></span></div>",
            "created":1401944400,
            "id":1807769,
            "title":"Method of growth?"
        },
        "1132":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "New bra and panties.",
                "A set of jewels.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What item changed her?</span></div></span></div>",
            "created":1424322000,
            "id":1936756,
            "title":"Some treasures aren't worth it..."
        },
        "11321":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "She  puts them on In front of link",
                "She puts them on in private"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda receives a cute new pink bra and panties from link </span></div></span></div>",
            "created":1440997200,
            "id":2028118,
            "title":"New bra and panties."
        },
        "113212":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Her breast and butt grow now",
                "Her breast and butt grow later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda thanks link for the gift and heads to her room to Ty them on, after putting them on her breast and butt start to feel funny</span></div></span></div>",
            "created":1440997200,
            "id":2028120,
            "title":"She puts them on in private"
        },
        "1132121":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Breasts.",
                "Butt."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What grows first?</span></div></span></div>",
            "created":1480827600,
            "id":2245580,
            "title":"Zelda's new look."
        },
        "1132122":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Her breast expand first ",
                "Her butt expands first "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda then puts on a cute pink low cut shirt  and a tight pair of sweat pants</span></div></span></div>",
            "created":1440997200,
            "id":2028121,
            "title":"Her breast and butt grow later"
        },
        "11321222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "It grows fast",
                "It grows slow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda's pants to start to feel tighter then the usual and when she looks she sees that her butt has grown and her panties are starting to show</span></div></span></div>",
            "created":1440997200,
            "id":2028125,
            "title":"Her butt expands first "
        },
        "113212221":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "The expanding stops",
                "It continues "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then the expanding fastens up and her sweats get half way down her butt and get stuck while her butt keeps on expanding, the panties don't get tighter cause they grow with her butt</span></div></span></div>",
            "created":1440997200,
            "id":2028126,
            "title":"It grows fast"
        },
        "1132122212":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "they grow more",
                "it stops"
            ],
            "content":"<div class=\"\"><div> <span>her butt stopped expanding, zelda thought that it was over but then her a cup breast started to expand,with in minutes they were already a nice juicy pair of 32C breast, her pink top was starting to show a good bit of cleavage, after a few more minutes they hit the 36FF cup size and her shirt was so tight that it showed the under half of her breast </span></div></div>",
            "created":1445058000,
            "id":2048637,
            "title":"It continues "
        },
        "11321222122":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "she looks for a bikini",
                "she looks for a bra "
            ],
            "content":"<div class=\"\"><div> <span>the growing stops (for now) and zelda is sitting in her room feeling her ass and breast, then she walks over to a mirror and gets a real good look of her new slef and she says \"mmmh, i look so sexy and hot, i wonder if i have any bikinis or sexy bra's that fit other then the one i have on.</span></div></div>",
            "created":1445058000,
            "id":2048638,
            "title":"it stops"
        },
        "113212221221":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "its link",
                "its her maid "
            ],
            "content":"<div class=\"\"><div> <span>she goes to her dresser and finds a black bikini that is too small for her, but she decides to try and put it on, after 10 minutes and struggling to put it on zelda gets the black bikini on and it is very tight and shows off her glorious 32FF breast, while she is looking at herself in the mirror someone knocks on her door, who is it she asked </span></div></div>",
            "created":1445058000,
            "id":2048639,
            "title":"she looks for a bikini"
        },
        "1132122212212":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Have a little bit of alone time with the curvy maid...",
                "Leave the room and look for fun elsewhere..."
            ],
            "content":"<div class=\"\"><div> <span>Zelda opened the door and a small woman, about 5 foot 6, wandered in.<br>\r\n\"Oh, your highness!\" She mumbled, seeing Zelda in her black bikini. \"Terribly sorry! I shall leave and return later.\"<br>\r\nZelda looked he woman up and down with keen eyes. \"No, dear woman, please stay.\"<br>\r\nBowing her head, the maid enters, brushing past Zelda's newly large body. The maid starts to work and the princess soaks up her appearance. She was a black haired woman, with soft tanned skin and brown eyes. She had pinkish lips on a soft face along with a small nose. The maids body was something quite stunning. Under her black and white dress Zelda could see a pair of large breasts and a round ass, neither of which matched Zelda's own large assets, but they were something to marvel at. The princesses hungry eyes traveled down the maids long legs and to the floor. A thought dashed through zelda's mind. She decided to...</span></div></div>",
            "created":1482123600,
            "id":2252140,
            "title":"its her maid "
        },
        "11321222122122":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "The town!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Deciding that fooling around with the maid would mean she had to take off her bikini that she fought so desperately to fit into, Zelda instead left the room, only after thanking the castle help.<br>\r\n<br>\r\nZelda strutted down the hallways of the castle, feeling her chest jiggle and bounce happily infront of her and her ass jiggle and bounce equally as boyantly behind her. With every chance she got, the woman stared at her body in a mirror or window reflection, looking at her new soft chest and shapely hips. The castle was quiet, as always, and she loved the sounds of her bare feet on the polished tile flooring. Zelda's prancing finally lead her to a window sill, where she flung open the hatch. The warm breeze filled her hair as she took in the scent through her regal nose. The day was perfect to be outside. Zelda looked down upon the kingdom. Where should she visit?</span></div></div>",
            "created":1482123600,
            "id":2252143,
            "title":"Leave the room and look for fun elsewhere..."
        },
        "113212221221221":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Of course! He princess has nothing to hide.",
                "Perhaps a more flattering sense of clothing would be choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She looked down upon herself, her thick body bursting out her tiny bikini. 'Was it suitable for a princess to be seen by her subjects like this?' She wondered.</span></div></span></div>",
            "created":1492318800,
            "id":2306130,
            "title":"The town!"
        },
        "1132122212212211":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Gets through her walk fine ",
                "Has trouble with a few townsfolk (male and females)",
                "Looks like the magic from the bra and panties rubbed off a bit on her"
            ],
            "content":"<div class=\"\"><div> <span>As the princess she has nothing to hide from her subjects. She decided that the bikini was suitable and walks down to the town. As she was walking her massive tits bounced about in front of her, sometimes slapping into each other and sometimes coming close to popping out of her black top. Her newly wide hips swayed from side to side with each step, her thick thighs brushing against one another as her juicy ass jiggled behind her. She was enjoying the way her new body moved as she walked.<br>\r\n<br>\r\nWhen she got into town everyone couldn’t stop starring at her, either not knowing it was zelda or couldn’t believe it was zelda.</span></div></div>",
            "created":1554440400,
            "id":2640571,
            "title":"Of course! The princess has nothing to hide."
        },
        "1132122212212212":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "A tank top and yoga pants.",
                "The sweats and low cute pink top like before."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda returns to her room and rifles through her clothes. After a while she pulls out...</span></div></span></div>",
            "created":1492405200,
            "id":2306411,
            "title":"Perhaps a more flattering sense of clothing wou..."
        },
        "11321222122122121":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Out to the town"
            ],
            "content":"<div class=\"\"><div> <span>The princess pulls on some black yoga pants, their fabrics stretching to accommodate her large lower half and become slightly see through in consequence. She also donned a white tank top, this proving to be sloghtly more difficult but she managed. The top covered her breasts but showed off a lot of her midriff.</span></div></div>",
            "created":1492405200,
            "id":2306417,
            "title":"A tank top and yoga pants."
        },
        "113212221221221211":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "The magic from thebbra and panties rubbed off on her and she grew a little more ",
                "Someone grabbed her butt "
            ],
            "content":"<div class=\"\"><div> <span>Walking down to the town the princess couldn’t but help feel the bounce of her breast and her butt jiggle with every step she took. When she got into town she kept getting “you look amazing your highness”  comments and whistles from the towns folks. “You are all to kind” Zelda responded everyone time blushing. As she walked through town she felt</span></div></div>",
            "created":1521694800,
            "id":2467658,
            "title":"Out to the town"
        },
        "1132122212212212111":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Looks for a curvy woman  to have sex with ",
                "Search’s for a place to hide"
            ],
            "content":"<div class=\"\"><div> <span>She felt the warm feeling again, her breast and butt were growing again. Her butt stretched the yoga pants as it pushed outwards but remained intact, almost complete see-through, but intact. Her breast had pulled the white top up to her breast. Her breast could be seen from under the top as they grew. “They must be a 38G now, oh what am I going to do” she said worried about her current situation </span></div></div>",
            "created":1521694800,
            "id":2467661,
            "title":"The magic from thebbra and panties rubbed off o..."
        },
        "1132122212212212112":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "A young woman",
                "A young man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda felt a sudden firm grip on her newly enhanced butt. She quickly turned around to see...</span></div></span></div>",
            "created":1529470800,
            "id":2509984,
            "title":"Someone grabbed her butt "
        },
        "11321222122122121121":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "“Oh! Princess Zelda! I didn’t realise it was you!” The girl bowed.",
                "“Someone’s looking big today...” The girl eyes Zelda seductively."
            ],
            "content":"<div class=\"\"><div> <span>There was a young woman stood with her hand on her hip. She was shorter than Zelda, with blonde hair and green keen eyes. It was obvious she had lots of makeup on as her lips were ruby red, looking kissable and plump. She had a fair set of breasts on her, which she hid under a white top, but they were small in comparison to the princesses own large set. She was also looking a little soft in her midsection, but nothing to name her as fat. The girl looked up at Zelda and said,</span></div></div>",
            "created":1529470800,
            "id":2509985,
            "title":"A young woman"
        },
        "113212221221221211211":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Kindly",
                "Harshly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda was taken aback by the girls curtsy but decided to act...</span></div></span></div>",
            "created":1529470800,
            "id":2509986,
            "title":"“Oh! Princess Zelda! I didn’t realise it wa..."
        },
        "11321222122122121122":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Yes it's Link.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was the young man Link?</span></div></span></div>",
            "created":1547010000,
            "id":2601184,
            "title":"A young man"
        },
        "113212221221222":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "The beach!",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps a seaside escape?</span></div></span></div>",
            "created":1482123600,
            "id":2252144,
            "title":"Something else"
        },
        "1132122212212221":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Sunbathe for a while. She's earned it.",
                "Go for a swim, it will be so refreshing."
            ],
            "content":"<div class=\"\"><div> <span>With a sharp snap of her fingers, and a few passing minutes, Zelda was on her way to the beaches of Hyrule with a towel in hand. After Link saved the kingdom for the umpteenth time, the princess had started to strat from her large home more frequently as she enjoyed the fresh air. But nothing beat this. Low drafts passed around her, her massive melons feeling a slight chill due to their exposure forcing her nipples to stand out like thick prongs. The winds whipped around her slim waist, her soft hands passing over her flat, but untoned stomach every so often. Her exposed ass cheeks, which stood rather far behind her, jiggled with every step, the brisk air cooling her warm skin. <br>\r\n<br>\r\nWhat Zelda came to realise, after her prolonged amount of walking time, was that her breasts and behind weren't the only things to have grown. The princess realised, due to the increase in difficulty of walking, that her hips and thighs had also changed. What were once slender legs and slim hips had turned into thick thighs that brushed against eachother with each step and gaping hips that swung from left to right to the rhythm of her walk. Brushing her brown locks out her eyes, she decided to continue onwards to the shore.<br>\r\n<br>\r\nA few minutes of strolling and Zelda's feet reached sand. She made her way to her favourite part of the beach, which was a small cove that shielded her mostly from view of the people and gave her a secluded area to swim. She placed her towel down and stretched her larger body out. What to do next?</span></div></div>",
            "created":1492318800,
            "id":2306129,
            "title":"The beach!"
        },
        "11321222122122211":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "The maid from earlier comes in ",
                "She puts on the pink set and grows again ",
                "Goes out to the town to pick up new clothes (tight clothes)"
            ],
            "content":"<div class=\"\"><div> <span>She laid down on her towel to start sunbathing. After a hour or 2 of laying there zelda got up form her spot, she had forgotten how heavy her breast were now and had s little trouble getting up. As she got up her breast jiggled a little and her ass almost snapped her bikini bottom as she got up. “Might need to get a size bigger, but not to bigger since I do enjoy the tightness of my clothes, I’ll have to see which I my bra’s still fit and which don’t and go buy some new ones” zelda told herself. With her sunbathing done she heads back to the castle and starts going through her bra’s, panties and bikinis. After a hour she finds she has 4 pairs of matching bra’s and panties that she could still get on. A black pair with pink lacing, a white pair with aqua lacing, a red pair with black lacing and finally purple lacy pair. She also found 2 other bikinis that should could get on other then just her black one, a pink one and a white one with blue lining. As she just finished going through her clothes she put the black bikini back on when...</span></div></div>",
            "created":1555477200,
            "id":2646080,
            "title":"Sunbathe for a while. She's earned it."
        },
        "1132122212212222":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "A lake",
                "Something else...!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or even another water feature?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1482123600,
            "id":2252146,
            "title":"Something else"
        },
        "11321222122122222":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "The caves!",
                "Something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hmmm... maybe she'd prefer to visit a cave?</span></div></span></div>",
            "created":1482123600,
            "id":2252147,
            "title":"Something else...!"
        },
        "113212221221222221":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "She decided to look.",
                "She decided to stay away."
            ],
            "content":"<div class=\"\"><div> <span>The princess tossed together a bag full of what she might need a strutted her way through the castle. Not many people realized, but the princess has her own secret passageway out of the Hyrule castle and into the vast cave networks that riddle Hyrule. Zelda dropped into the dark hallway and struck a flame torch, holding it before her. She took a few steps, getting acquainted to feeling the rough dirt and stone on her bare feet before setting off.<br>\r\n<br>\r\nThe princess poked around the cave systems. She was still wearing the miniature bikini but it provided great ventilation in the otherwise warm caves. Her massive tits bounced about in front of her, sometimes slapping into each other and sometimes coming close to popping out of her black top. Her newly wide hips swayed from side to side with each step, her thick thighs brushing against one another as her juicy ass jiggled behind her.<br>\r\n<br>\r\nZelda kept on, wiping her brow as the heat caught her a little. Up ahead, she heard a little commotion down on of the corners.</span></div></div>",
            "created":1492405200,
            "id":2306661,
            "title":"The caves!"
        },
        "1132122212212222211":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Magical.",
                "Dangerous."
            ],
            "content":"<div class=\"\"><div> <span>She peeped around a corner and upon doing so she could clearly see a source of light and hear a source of sound. Creeping closer, Zelda put out her torch and hid it in her bag. As she grew closer and closer, the sounds filled her pointed eleven ears. It sounded...</span></div></div>",
            "created":1492405200,
            "id":2306664,
            "title":"She decided to look."
        },
        "11321222122122222111":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Wake the great fairy.",
                "Leave the fairy to sleep, see what else she could do."
            ],
            "content":"<div class=\"\"><div> <span>Zelda stepped out and into a room cut from stone and rocks. A blue light cast over her hourglass body as pink lights darted around, each one whispering about the new arrival. She'd found a fairy fountain... and not just any fairy fountain... a great fairy fountain! The give away pool was before her, with the shrine and inscription of a voluptuous fairy behind it. Zelda wondered for a moment on what her next action should be.</span></div></div>",
            "created":1492405200,
            "id":2306672,
            "title":"Magical."
        },
        "113212221221222221111":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "The fairy was excited",
                "The fairy was mad"
            ],
            "content":"<div class=\"\"><div> <span>The princess knelt on the shrine and began the ritual. She could feel her heavy chest swaying to and fro and her large ass on the cold floor as the fairies watched her movements. <br>\r\n<br>\r\nAfter a short time a rumbling echoed, emanating from the water. Bubbles arose and finally a great form burst from under. The great fairy floated before Zelda. The fairy towered higher than anyone else, more than triple Zelda's height, but with proportions smaller than the princess. The fairy's pink locks floated down her ivy covered body, her strong nose and thick lips took in the fresh yet musty air of the caves as she saw the princess.<br>\r\n<br>\r\n\"Oh my! Whatever have we here...?\" The fairy floated down towards Zelda so she could examine the expanded woman's body. \"You're so big...\" The fairy eyed Zelda's bulging tits and ass.</span></div></div>",
            "created":1492405200,
            "id":2306677,
            "title":"Wake the great fairy."
        },
        "1132122212212222211111":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "The great fairy keeps Zelda there for a moment.",
                "The great fairy sends Zelda on her way."
            ],
            "content":"<div class=\"\"><div> <span>\"My oh my! So curvaceous.\" The great fairy commanded Zelda to stand and turn so she could admire her thick body. Zelda did as she was asked, blushing slightly as she was examined.<br>\r\n\"Hmmm...\" the great fairy thought for a moment. \"Perhaps, you would wish to be... larger?\"<br>\r\nThings held silent for a moment as Zelda thought things through. The last time had felt so good...<br>\r\n\"Yes, I wish to be bigger!\" Zelda commanded.<br>\r\n\"That's the spirit...\" the divine being chuckled at her own pun. \"I would normally require rupees... but you don't look to have anything on you, and I'm feeling charitable so...\" *SNAP*<br>\r\n<br>\r\nAs the great fairy hovered backwards and Zelda stepped back. The snap of her fingers had called smaller fairies to her side and they started to swirl around the princess, much as if they were saving her from death as she had witnessed them to do for Link. However, instead of rejuvenating her, they made her grow. Each fairy took it in turns to be absorbed into either Zelda's chest or backside, both of them swelling at a moderate pace. Her ass and tits quickly started to dig into her bikini and after a few moments, the black garment fell away from the woman. But still she continued to grow. Her breasts billowing before her, doubling in size and her ass following in suit as she grew inches by the second. More fairies continued to soak into her body but the small creatures were diminishing, swallowed by her mass.<br>\r\n<br>\r\nFinally the fairies had finished and Zelda was breathless. Her body was easily triple its previous size. Walking looked like it would be a hefty task.</span></div></div>",
            "created":1492405200,
            "id":2306685,
            "title":"The fairy was excited"
        },
        "11321222122122222111111":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Zelda says yes to mobility (she can walk).",
                "Zelda says no to mobility (she is immobile)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The great fairy asked Zelda if she would like to be mobile.</span></div></span></div>",
            "created":1530853200,
            "id":2515782,
            "title":"The great fairy keeps Zelda there for a moment."
        },
        "113212221221222221111111":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Zelda wished for a black bikini, like the one she'd entered the cave with.",
                "Zelda wished for something more, cool, to wear for the rest of her planned day."
            ],
            "content":"<div class=\"\"><div> <span>Zelda wishes to the fairy for assistance with carrying her two big treasures. The great fairy, of course, is happy to help the slightly hunched over maiden in need that was (barely still) standing in front of her; \"I will gladly make it so, princess!\" She exclamied to the princess.<br>\r\n<br>\r\nWithin moments, yellow sparkles were shot out of the great fairies' hands, aimed at the naked princess recently trippled assets. The magic swirled around her boobs and her butt, and took hold underneath her ass cheeks and on her underboob, then slowly faded from view; \"Wow!\" Zelda said, clearly relieved, as she straightened her back; \"Thanks for the lift, oh great fairy!\"<br>\r\n<br>\r\nThe very tall fairy looked at her magic having worked its magic and giggled; \"Oh, ha ha ha. It was my pleasure, princess.\" The ivy-clad woman continued; \"I've been waiting for <i>so</i> long to have a reason to use that spell, I'll have you know. It warms my heart knowing I'm helping hold up that <b>big chest</b> of yours.\" The fairy, always one for making jokes said; \"Maybe I'll finish off my work by hiding a big key for Link to find in that cleavage of yours, eh? Ha ha ha~\" She said sarcastically.<br>\r\n<br>\r\nZelda never really had a sense of humour, but she was in such a great mood now that she laughed with the fairy nonetheless.<br>\r\n<br>\r\n<br>\r\nAs Zelda waved, then turned around to make for the fairy altars' exit, the fairy intervened; \"Wait! I can't let you leave yet!\" She told the princess.<br>\r\n<br>\r\n\"Why? What more is there I could ask of you?\" Zelda said back.<br>\r\n<br>\r\n\"No, like, I <i>literally</i> can't let you leave like <u>that</u>.\" The fairy said, whilst gesturing with her finger, pointing at all of Zelda, in all of her nakedness.<br>\r\n<br>\r\n\"Oh. Oh...\" Zelda said, embarrassed at the lack of self awareness she usually posessed so much off.<br>\r\n<br>\r\n\"Your wish'll be my command, princess. And I'll even make it fit your amazing hourglass body, hun. Ha ha ha!\" The fairy told her...<br>\r\n<br>\r\n<br>\r\n<b>...; \"Now, how do you wish to be dressed?\"</b></span></div></div>",
            "created":1556686800,
            "id":2653338,
            "title":"Zelda is ready to leave the fairy fountain."
        },
        "113212221221222221112":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "She only expanded one asset.",
                "She expands both her assets."
            ],
            "content":"<div class=\"\"><div> <span>Zelda looked around at the smaller fairies, their pink glow being somewhat inticing. She reached a hand for one and as she grew close, the creature flew around her arm and hit her in the chest. A moment passed and then Zelda witnessed her breasts growing a slight amount once more.<br>\r\n<br>\r\n A devilish thought crossed her mind as she went to reach for the fairies.</span></div></div>",
            "created":1492405200,
            "id":2306687,
            "title":"Leave the fairy to sleep, see what else she cou..."
        },
        "1132122212212222211121":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Bigger boobs",
                "Bigger butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Zelda paced forwards with a predatory smile on her full lips. She was ready to pounce on her prey. But what to do with them?</span></div></span></div>",
            "created":1492405200,
            "id":2306688,
            "title":"She only expanded one asset."
        },
        "113212221221222222":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Castle time!",
                "Something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe she wants to stay at home in the castle?</span></div></span></div>",
            "created":1482123600,
            "id":2252148,
            "title":"Something else!"
        },
        "1132122212212222222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Visit link ",
                "Visit Lon Lon ranch ",
                "More destinations "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps she wants to go visit link<br>\r\n <br>\r\nOr<br>\r\n<br>\r\nPerhaps she wants to go visit Lon Lon ranch </span></div></span></div>",
            "created":1554440400,
            "id":2640567,
            "title":"Something else!"
        },
        "113212221222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "There’s a knock on her door ",
                "She continues to admire her new body ",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>Zelda goes over to her dresser and opens the draw that she keeps her bras in. Looking through for a few minutes she finds a black bra with pink lingerie and matching panties. She struggled to get them on but was determined and after a few minutes finally got them on. Her breast were spilling out of the bra while her butt cheeks were making the panties more into a tight thong.</span></div></div>",
            "created":1547010000,
            "id":2601010,
            "title":"she looks for a bra "
        },
        "11322":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "A present from Adult Link, who had found them during his travels to new lands.",
                "Zelda found them in a box hidden in her room, behind a painting of her ancestor."
            ],
            "content":"<div class=\"\"><div> <span>Zelda had somehow managed to get her hands on some shiny and colorful jewels. She was unaware of the power they held. Thoigh that would soon change...<br>\r\n<br>\r\nThe magical stones were similar in shape and design to the elemental emblems which unlocked the Temple of Time eight years ago.<br>\r\n<br>\r\nZelda, who was ever the lover of science and experiments, figured she could activate these jewels' properties by holding one up and casting a spell, 'asking it' to show her its power.<br>\r\n<br>\r\nOr perhaps, the jewels worked in another way...<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>But first... How did Zelda get these?</b></div></span></div></div>",
            "created":1596085200,
            "id":2878153,
            "title":"The magical jewels came from where?"
        },
        "113222":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Zelda takes the jewel for a second spin. Its dubbled effects tear her clothes!",
                "Just as Zelda picks up a different jewel, Link and Malon run into her room!"
            ],
            "content":"<div class=\"\"><div> <span>Princess Zelda was excited, having just found another secret hidden in home of Hyrule Castle.<br>\r\n<br>\r\nIt had been years since she last discovered something like this!<br>\r\n<br>\r\nThough that time, the hidden chamber she found was just an abandoned armory filled with swords and shields.<br>\r\n<br>\r\nBut this was different! Magical jewels which had laid hidden in her very own room all this time!<br>\r\n<br>\r\nZelda's head filled with thoughts of magical wonders, her imagination envisioning the awesome power which these might hold inside...<br>\r\n<br>\r\nAfter all, the location of the box they were stored in, a painting of a previous Zelda, must mean they held special value to that incarnation of the Triforce's devine powers.<br>\r\n<br>\r\n<br>\r\nZelda took a deep breath to calm herself and regain focus.<br>\r\n<br>\r\nShe picked up one of the jewels from the box she had placed on her table and studied it.<br>\r\n<br>\r\nIt was dark ruby red, with yellow strands of metal encircling it in complex patterns.<br>\r\n<br>\r\nThe shape of the ruby however, Zelda thought was quite odd.<br>\r\n<br>\r\nShe turned it around in her hand, getting good looks at it from all angles.<br>\r\n<br>\r\nIt was seemingly stretched out, with indets and curves that made the shape vaguely familiar to her.<br>\r\n<br>\r\n\"Does that look like an... hourglass, maybe?\" Zelda thought to herself, looking closer.<br>\r\n<br>\r\n\"But then what's with the orbs jutting out? What are those?\" Zelda mumbled quietly; \"What a strange thing... Fascinating...!\"<br>\r\n<br>\r\n<br>\r\nIt was time.<br>\r\n<br>\r\nShe held out the jewel in her hand and closed her eyes.<br>\r\n<br>\r\nShe mouthed some silent words into the room, then opened her eyes again as moments later, the magical artifact in her hand slowly got incased with glowing sparks that swirled around it.<br>\r\n<br>\r\nIn that moment, something felt off to Zelda...<br>\r\n<br>\r\n<br>\r\nShe dropped the jewel on the table and then stumbled backwards, catching herself on a nearby chair.<br>\r\n<br>\r\nSomething was warm.<br>\r\n<br>\r\nHer body was feeling tingly.<br>\r\n<br>\r\nThe shivering sensations focused themselves on very <i>*particular*</i> parts of her body.<br>\r\n<br>\r\nZelda couldn't force any words from her mouth, nor did she think to cast a counter-spell.<br>\r\n<br>\r\nAll that escaped her lips was a restrictive moan of pleasure as the power of the red ruby was revealed.<br>\r\n<br>\r\n<br>\r\nZelda's clothes felt strained almost immedietly. (She seldom wore loose-fitting clothes, even on her 'casual' days.)<br>\r\n<br>\r\nHolding herself up on the chair, Zelda had an excellent view of her bosum as it filled out her undergarments and continued swelling.<br>\r\n<br>\r\nIt felt very tight, Zelda thought, as her gaze fixated on the two 'bumps' on her gown slowly expanded outward at a steady pace.<br>\r\n<br>\r\nBut that wasn't the only tight part, she realised.<br>\r\n<br>\r\nHer sense of central-gravity felt off, and as she forced herself off of the chair so she could stand up instead, she half-expected to fall over due to her increased front-heavyness.<br>\r\n<br>\r\nBut she didn't, as she realised there was an increase in bottom-heavyness taking place behind her.<br>\r\n<br>\r\n<br>\r\nStaying balanced as best she could, Zelda visualised what she felt going on behind her.<br>\r\n<br>\r\nHer rear was straining her clothing in an unfamiliar way, with its two assets puffed up like spheres.<br>\r\n<br>\r\nThe fullness of her form shocked Zelda, realising now that her thighs and hips had widend (slightly, for now) along with it, all while her clothing somehow confining it all.<br>\r\n<br>\r\n<br>\r\nThe spells effects dissipated, as Zelda was left to explore amd marvel at its effects via her wardrobe mirror and her own two hands...<br>\r\n<br>\r\n\"Upgraded honkers...\" Zelda said, cupping herself;<br>\r\n\"And a badonkadonk that's quite attention-grabbing...\" She observed, turning herself around infront of her mirror.<br>\r\n<br>\r\n\"My, oh my. What peculiar properties.\" Zelda pondered, peering over at the proudly placed gem, shaped like a person parallel in form to Zelda at her current predicament, with its protruding posterior and promimemt chest-puppies.<br>\r\n<br>\r\n<br>\r\nZelda, though scared her clothing might break, felt like maybe using the jewel a second time.<br>\r\n<br>\r\n\"Well, well.\" Zelda announced, looking over to the painting this jewel was hidden behind;<br>\r\n\"Might this have been a hobby of your back then too, huh?\" She said with a playful laugh.</span></div></div>",
            "created":1596085200,
            "id":2878180,
            "title":"A secret passed down through generarions!"
        },
        "1132222":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "He uses a jewel that made their breasts grow huge!",
                "He uses a jewel that made their breasts and butts grow bigger!"
            ],
            "content":"<div class=\"\"><div> <span>Princess Zelda lost track of time as she was intensely focused on letting her hands rediscover all her new cruves.<br>\r\n<br>\r\nBut this moment of privacy was interupted as she heard a knock on her door.<br>\r\n<br>\r\nZelda turned around, as she heard the door open along with a familiar heroic voice asking;<br>\r\n\"Are you in there, Princess?\"<br>\r\n<br>\r\n<br>\r\nIt was Link.<br>\r\n<br>\r\nLink had regained the lost years of his childhood since defeating Ganon in a different timeline, and thus preventing Ganondorf's rise to power in this one.<br>\r\n<br>\r\nThe result was a matured Link, without the childish tendencies of his previous 'young' adult self. (Not that this new Zelda could've known.)<br>\r\n<br>\r\n<br>\r\nThe hero's stared at his old childhood friend Zelda, while still standing in the doorway.<br>\r\n<br>\r\n\"When did those breas--\" Link asked, but was interrupted by...<br>\r\n<br>\r\nMalon! Who came running into Zelda's room, excited to tell her about something;<br>\r\n\"Oh! My Princess, you must see the farm's new-- Oof!\"<br>\r\n<br>\r\nMalon didn't expect Link in the doorway, running into him, causing both of Zelda's guests to fall onto her floor.<br>\r\n<br>\r\n<br>\r\nZelda wanted to help them out, while at the same time wanting to teleport out of the room while she still could.<br>\r\n<br>\r\nBut she didn't have time for that, as Link and Malon picked themselves of the ground before Zelda could act.<br>\r\n<br>\r\n\"Oww... Well okay. Zelda I've ought to tell you about...\" Malon realised that she was looking at alot more Zelda than she remembered;<br>\r\n\"When did those breasts...\"<br>\r\n<br>\r\n\"Eh, second puberty...!\" Zelda lied, trying her best to fake a believable explanation.<br>\r\n<br>\r\n<br>\r\nMalon didn't believe it.<br>\r\n<br>\r\nSuddenly Zelda had Malon's two hands feeling around curiously ontop her boobs.<br>\r\n<br>\r\nThe tight clothing that encased them rubbed across Zelda's skin, as Malon's inquisitive hands squeezed, weighed and groped them.<br>\r\n<br>\r\nIt felt kinda Nice, Zelda thought.<br>\r\n<br>\r\n<i>Really</i> nice, actually.<br>\r\n<br>\r\nThough she wasn't gonna admit she wanted Malon's massaging hands off her massive mammaries.<br>\r\n<br>\r\n\"Don\"t... Do that...!\" Zelda moaned in weak protest.<br>\r\n<br>\r\n\"Yeah, right.\" Malon scoffed;<br>\r\n\"What's the trick? Malon asked, not hiding the jealousy in her voice.<br>\r\n<br>\r\n<br>\r\nMalon continued her hands-on interrogation.<br>\r\n<br>\r\nThough she didn't get much useful information from the panting, moaning Zelda or her erect nipples.<br>\r\n<br>\r\n<br>\r\nLink looked at the women going at it, a bit confused.<br>\r\n<br>\r\nHe came here for Malon to be granted access to the castle's royal private quarters, so she could speak to the princess about something at Lon Lon Ranch she needed to be there for.<br>\r\n<br>\r\nLink had not expected this feud of sorts to break out between the two geown up girls.<br>\r\n<br>\r\nThough he knew better than to try interrupting any argument including a raging woman.<br>\r\n<br>\r\nInstead Link carefully wandered around Zelda's spacious room.<br>\r\n<br>\r\nIt looked like he wouldn't have those other two's attention for a while it seemed.<br>\r\n<br>\r\n<br>\r\nA box of jewels on Zelda's table caught Link's attention.<br>\r\n<br>\r\nIt was filled with stones that reminded him of those he had collected long ago from the different tribes in Hyrule.<br>\r\n<br>\r\nHe was intrigued, and looked through them...<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>Link ends up casting a spell on the two women. What type of spell?</b></div></span></div></div>",
            "created":1596258000,
            "id":2879149,
            "title":"Zelda gets curious visitors. Link and Malon!"
        },
        "11322221":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Link keeps his \"master sword\" sheathed, and Zelda chooses another jewel!",
                "The two girls want Link to show them why he's called a legendary hero!"
            ],
            "content":"<div class=\"\"><div> <span>To the faded voices behind him in the room, Link leaned down towards the box atop the table.<br>\r\n<br>\r\nA few jewels lay stored there, Link plainly saw.<br>\r\n<br>\r\nCould these all be simple wearable jewelry? Link observed, wondering.<br>\r\n<br>\r\nNo... They seemed valuable, though something about them made him feel there was more to them than met the eye.<br>\r\n<br>\r\n<br>\r\nThey could be used for something, maybe? Link wanted to test the idea, and picked up a jewel.<br>\r\n<br>\r\nThe blue emeraled had patterns of yellow metal above and around its center jewel.<br>\r\n<br>\r\nOn closer inspection, Link noticed faint hylian symbols engraved along the metal patterns.<br>\r\n<br>\r\nHe tried his best to ignore the argument behind him, finding that the loud, angry words distracted his attempts to read the complicated spell instructions.<br>\r\n<br>\r\nLink held the gem close to his face and read its naughty inscription.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><span class=\"clkhaki\">sboob snamow yna dnapxe nac lewej shiT</span></div><br>\r\n<div align=\"center\"><span class=\"clkhaki\">ylbaredisnoc detsoob eb llahs yeht dna sdrow eseht keapS</span></div><br>\r\n<br>\r\n<br>\r\nMuch to her dismay, the observant princess, who was busy deflecting the farmer girls accusations, now noticed the green-clad man stood explorong her newly found secret jewels.<br>\r\n<br>\r\n\"Umm, Link...? Don't touch those!\" Zelda called out in protest, fearing that Link would find something she didn't want him to;<br>\r\n\"Though I mean, they don't do anything. They're nothing! Please refrain from using my jewelry!\"<br>\r\n<br>\r\nBut Zelda was to late.<br>\r\n<br>\r\nHe had already used it.<br>\r\n<br>\r\n<br>\r\nLink saw the magic stone he held create particles of light that hovered around itself,  then slowly floating away towards the two girls behind him.<br>\r\n<br>\r\nAs Link turned around to see where the many small lights went, he noticed them increase in speed the closer they got to Zelda and Malon's chests.<br>\r\n<br>\r\nAll the particles landed, forming a thin layer ontop the breasts of the respective girls' outfits.<br>\r\n<br>\r\nMalon now too looked at the one holding the jewel;<br>\r\n\"Link, what did you just do to us?\" She asked in a concerned voice.<br>\r\n<br>\r\n\"I'm pretty sure we'll soon find out, dear subject.\" Zelda said, already looking down at her bust.<br>\r\n<br>\r\n<br>\r\nThe mild sounds of her own anticipated breaths hit Zelda's elf-like ears as the swelling properties she'd theorised her secret gems had were revealed for her guests to see.<br>\r\n<br>\r\nHer pair of melons widened, lengthened and heightened and her dress had had enough.<br>\r\n<br>\r\nWith a popping sound Zelda's magical mounds forced opened a cleavage window for themselves to spill out of in an eye catchingly bouncy event.<br>\r\n<br>\r\n\"Hey! Why make yourself bigger again, at a time like this?!\" Said the red haired girl, who didnt yet understand that they had both spellcast.<br>\r\n<br>\r\n\"Oh really?\" Zelda responded;<br>\r\n\"It's just my clothes making them look that way.\" Zelda joked in a dismissive, sarcastic way.<br>\r\n<br>\r\n<br>\r\nBut the warm, pleasurable feeling taking effect on Malon's own boobs after Zelda said that, finally made her realise what was really going on.<br>\r\n<br>\r\nMalon grabbed on to her chest out if instinct, feeling a bit more flash being grabbed onto that she was used to.<br>\r\n<br>\r\nWhat she was grabbing onto was now also slowly growing beneath her hands as well.<br>\r\n<br>\r\n\"Oh...?! Ohh... Oooh~\" Malon moaned, squeezing them lightly.<br>\r\n<br>\r\nShe swelled past cup size, after cup large size, after cup larger sizes one after another.<br>\r\n<br>\r\n<br>\r\nLink had taken a seat on the table where he's stood, enjoying the show, curious how far it's go.<br>\r\n<br>\r\nHe saw Malon's shirt, still layered in small magic lights, swell and stretch upwards.<br>\r\n<br>\r\nIt stretched out over Malon's big orbs like a small loose top, exposing her underboobs and stomach.<br>\r\n<br>\r\nMalon grabbed her sideboob, squeezing and lifting them gently, as her hands travelled down and around her shirt's edge, then feeling the cold, exposed skin of her pale, massive underboobies.<br>\r\n<br>\r\n<br>\r\nTaking a look at the growing princess now, Link was met with yet another dream-like sight.<br>\r\n<br>\r\nExcessive amounts of skin was flowing out from what little openings existed in Zelda's incredibly tight, but tearing-resistant dress.<br>\r\n<br>\r\nDespite that descriptor, the dress had it's limits.<br>\r\n<br>\r\nThe growing tits crammed beneath it, seemed to have none.<br>\r\n<br>\r\nSmall oval-shaped tearing in Zelda's dress appeared, where bits of her chest exposed themselves bit by bit.<br>\r\n<br>\r\nThe tears increased in numbers, and slowly teared themselves larger, as the tight uni-boob shape of her dress slowly gave up.<br>\r\n<br>\r\nHer flesh spilling over her now bigger and bigger \"v-neck\", giving a glimpse of her truly astounding breast size and cleavage, in addition to the small ovals of breast flesh escaping the front and sides of Zelda's clothing.<br>\r\n<br>\r\nNot much was left to cover her chest, and the now audible straining made what would happen next clear to everyone.<br>\r\n<br>\r\n<br>\r\nMalon, Link, and a breathless Zelda watched in excitement at Zelda's tearing clothing.<br>\r\n<br>\r\nHer breasts were going to escape their confinement soon.<br>\r\n<br>\r\nThe were already more than half-way there it seemed.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nSilence hit the room, as the tearing sounds stopped, and everyone held their breath. (Aside from Zelda, whose tight chest pressed against her didn't allow any deep breaths now, even if she'd wanted to)<br>\r\n<br>\r\n<br>\r\nThe sound of snapping cloth echoed silently in the room, as the dramatic scene of Zelda's boobs lounging forwards seemed to play out in slow-motion before their eyes.<br>\r\n<br>\r\nThe two ginormous twins bounced upwards energetically, their surface area rippling from the motion.<br>\r\n<br>\r\nTheir hypnotic aura met Limk and Malon's eyes, as Zelda's heavy breathing made them sway up and down.<br>\r\n<br>\r\n<br>\r\nAfter a brief moment of peace, it again seemed like Zelda's chest couldn't be left alone by a certain jealous onlooker.<br>\r\n<br>\r\nMalon sunk her hands into Zelda's boobs and groped the furiously.<br>\r\n<br>\r\n\"No fair! You're still waaay bigger than me!\"  Malon scowled, talking directly at Zelda's boobs instead of at her.<br>\r\n<br>\r\n\"P-please cease... This... Attack...\" Zelda objected, panting heavily as her entire front was shaken around.<br>\r\n<br>\r\nMalon didn't comply with her demands.<br>\r\n<br>\r\nShe did however change the approach of her assault.<br>\r\n<br>\r\nThe moment her fingers let go of Zelda she instead pushed her boobs up against hers, walking in and closing their gap as much as possible.<br>\r\n<br>\r\n\"How do 'ya like that, princess?...\" Malon trailed off at the end;<br>\r\n\"I quite, um, like this myself... oooh...!\"<br>\r\n<br>\r\nThat distinct feeling of growth hitting their busts was not over yet, as its final wave hit them both in their now vulnerable positions.<br>\r\n<br>\r\n<br>\r\nSurges of growth made themselves known as the pushed together busts rippled simulatenously, whilst pushing the two girls apart slightly with each passing second.<br>\r\n<br>\r\n\"Confound it! Not again...! Oooohh~!\" Zelda cursed her preticament, both enjoying it and hating it at the same time<br>\r\n<br>\r\nAlthough now the ladder feeling deminished, as she could now feel the unrestricted version Malon had enjoyed, as her chest had now liberated itself from any tight confines.<br>\r\n<br>\r\n<br>\r\nMalon too grew bigger of course, and the thinly stretched cloth covering her chest was forced upwards more and more, no longer covering her boobs' lower half.<br>\r\n<br>\r\nMalon's bare nipples graced those of Zelda's and their pleasure was indescribable, the increased nerve endings pushing both girls to go wild.<br>\r\n<br>\r\n<br>\r\nBut now at the moment they least wanted it to cease, the spells effects stopped.<br>\r\n<br>\r\nSo, now an awkward silence befell the room, same as when Zelda's guests had first arrived.<br>\r\n<br>\r\nOnly now, the two girls had grown considerably larger breasts and busted their own clothing doing so, while Link's nose was bleeding from having stared to hard at these scenes infront of him.<br>\r\n<br>\r\n<br>\r\nMalon at last asked Zelda a calm and honest question;<br>\r\n\"Do you, eh, have more spells like that?\"<br>\r\n<br>\r\nZelda truthfully answered;<br>\r\n\"I don't know. But I sure would like to find out.\"<br>\r\n<br>\r\nLink was happy no one here was mad at him, but felt it necessary to add his confession;<br>\r\n\"Well excuuuse me, princess.\"<br>\r\n<br>\r\nLink's joke wasn't funny, but the three friends all laughed anyway.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>What happends next? Sexy expansion again? Or maybe some *other* sexy time?</b></div></span></div></div>",
            "created":1596549480,
            "id":2880539,
            "title":"Link's secret innermost dreams suddenly come true."
        },
        "113222211":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "submissive to Link",
                " butts get bigger "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Zelda choices another jewel this time a pink diamond which made Zelda and Malon...</span></div></span></div>",
            "created":1599334320,
            "id":2898103,
            "title":"Link keeps his \"master sword\" sheathed,..."
        },
        "1132222111":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Reader's choice.",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Zelda went over to the box of jewels once again, this time picking up a small pink diamond.<br>\r\n<br>\r\nShe held it between her thumb, middle and index fingers, twirling it around and seeing lights glisten through it.<br>\r\n<br>\r\nMany patterns of light beams revealed themselves to her as she looked at it at different angles, and Zelda was enticed by its beauty.<br>\r\n<br>\r\nBut ass he peered into the diamond from its top, the sparkling patterns from within hypnotized her, causing her to lose her grip of it and falling back onto her bed.<br>\r\n<br>\r\n<br>\r\nMalon, who stood just beside Zelda, with her quick reflexes caught the gem mid-fall.<br>\r\n<br>\r\nShe too made the \"mistake\" of looking at the pink diamonds aluring lights from its top and also getting inspelled herself!<br>\r\n<br>\r\n<br>\r\nLink noticed that Malon was stood holding the diamond, staring blankly out into space while murmuring quiet words.<br>\r\n<br>\r\nIntrigued, he grabbed the gem out from Malon's hands and looked into it himself, only for it to have no effect on him!<br>\r\n<br>\r\n(Maybe Link was immune because is a man. Or, maybe the spell had been used up for now, being intended for two people at a time.)<br>\r\n<br>\r\nBut those thoughts didn't matter now, as Link heard something odd!<br>\r\n<br>\r\n<br>\r\nIt was Zelda and Malon, whispering his name and looking at him with lustful eyes;<br>\r\n<span class=\"cgrape\"><i>\"Link... Link...~!\"</i></span><br>\r\n<br>\r\nAfter having awoken from their initial trance, they had by chance looked at Link.<br>\r\n<br>\r\nLike a classic love potion, they were now both infatuated with him.<br>\r\n<br>\r\nThough, unlike a love potion, no feelings of rivalry were seeded within the two girls.<br>\r\n<br>\r\nNeither wanted Link all to herself, happily sharing him with the other, only wanting to submit to Link.<br>\r\n<br>\r\n<br>\r\nHeart-eyed they looked at him, slowly walking closer, until Malon and Zelda literally pushed their bodies up close against Link's own;<br>\r\n<i>\"I feel like... Needing yo satisfy you.\"</i> Zelda said, in an unusually softspoken manner.<br>\r\n<br>\r\n<span class=\"cgrape\">\"Tending to your every need~! Oooah~!\"</span> Malon added, whispering and shivering in reaction to her own voice.<br>\r\n<br>\r\nThen, as both girls pressed their busom thightly against Link's chest, the both said, in unison;<br>\r\n<span class=\"chotpink\">\"Yes, great hero... Is there anything you would have us do?\"</span> The said, as their cheeks grew pinkishly red at \"daring\" to ask him.<br>\r\n<br>\r\n<span class=\"cgrape\">\"Do not hesitate to suggest any thought, for we will act upon it without hesitation~!</span> Urging Link to command them both.<br>\r\n<br>\r\n<br>\r\nIt dawned on Link the position of power he's now been granted by the jewels power.<br>\r\n<br>\r\n<div align=\"center\"><b>He thinks about it with a smirk for a while, then he responded;<br>\r\n\"Well...!\"</b></div><br>\r\n<br>\r\n</span></div></div>",
            "created":1602493260,
            "id":2919535,
            "title":"No regrets, princess Zelda..."
        },
        "11322221112":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "Strip for me",
                "Have sex with ne",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Link says” well I want both of you to...</span></div></span></div>",
            "created":1604005440,
            "id":2931392,
            "title":"Reader's choice."
        },
        "1132222112":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "As big as Malon's, of course! Our two hyper hourglass-women then have fun...!",
                "As big as Malon, and slightly bigger than that! Much to Malon's envy..."
            ],
            "content":"<div class=\"\"><div> <span>Zelda slowly rumaged through the box of jewels as Malon looked on inquisitively from behind her.<br>\r\n<br>\r\nAt Malon's suggestion, Zelda picked out a small pink diamond for them both to use next.<br>\r\n<br>\r\nMalon was so eager to start, that she grabbed it out from Zelda's hands!<br>\r\n<br>\r\nThen, as if sensing her intentions, the jewel reacted onto, and only onto, Malon.<br>\r\n<br>\r\n<br>\r\nA glowing aura sharing the shame shade of pink as the diamond Malon still held in her hand encompassed her butt.<br>\r\n<br>\r\nThe magic took effect, and as the aura's started to shine more intensely, Malon couldn't did not restrain her celebratory victory chanting.<br>\r\n<br>\r\n<i>\"Yes...! Yes..! Yes...!\"</i> Malon said in quick succession; \"I feel it in my body...! It's... getting... bigger...~\"<br>\r\n<br>\r\n<br>\r\nMalon's butt clung tighter to her pants than the already did, and the contour of her two big cheeks became very obvious.<br>\r\n<br>\r\nThough Malon couldn't see the same sights the other two could, she still reveled in it all the same, happy that her proudest asset was getting boosted like this.<br>\r\n<br>\r\nTo feel it better as it steadily swelled, Malon placed her hands on her ass's sides.<br>\r\n<br>\r\nIndeed. It was widening. Much to her delight.<br>\r\n<br>\r\n<br>\r\nNo downsides existed, so Malon took action and rubbed her ass together gently, letting out unhindered groans of happiness;<br>\r\n<i>\"Mmm...~ Mmm...~ Ahhh~!\"</i><br>\r\n<br>\r\n<br>\r\nThe pace her butt expanded at was steady, but Malon had in the time since using the jewel, spaced out from reality, going inside her own head and thoughts.<br>\r\n<br>\r\nBut soon something happened that woke her up from her idyllic fantasies for a moment.<br>\r\n<br>\r\nMalons pants nor underwear could not contain the amount of ass she was now packing for much longer.<br>\r\n<br>\r\nThough surprisingly enough (or unsurprisingly enough) Malon paid no heed to this coming breakage of clothing, putting her ass's required room for size-increase-age highest among her priorities!<br>\r\n<br>\r\n<br>\r\nMalon's now triple-sized, huge pair of thick orbs strained against a hopelessly stubborn pair of brown trousers.<br>\r\n<br>\r\nUntil her pants, at last were defeated, and its seams and stitches simultaeous bursting apart, her pants' upper portion was split in two, revealing the pale, skin coloured prize hidden beneath.<br>\r\n<br>\r\nHovering magnificently against her hips along to her thighs, Malon's smooth, unimaginably large ass was shown off in its full glory, only topped off by the bright pink panties stretched thinly over its top, cutting deeper into the grand canyon they were covering.<br>\r\n<br>\r\n<br>\r\nA fleeting moment of stunned awe befell Malon's onlookers as the lost sense of time marvelling at Malon's perfect bottom.<br>\r\n<br>\r\nMalon too occupied herself, making the minutes fly by in her own, subtly pleasurable ways.<br>\r\n<br>\r\nButt all good things do eventually come to an end...<br>\r\n<br>\r\n<br>\r\nA now four-times sized ass sat attached to Malon, complementing her form, paired with her massive, bare milky breasts.<br>\r\n<br>\r\nThe panties Malon wore by way of lucky coincidence, was strained to the point of obsurdity, holding on for dear-life and sitting tightly against Malon's form.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nNow... as the spell effect \"wore off\" on Malon, it was now in actuality taking hold on Zelda for a round two of ass expansion.<br>\r\n<br>\r\nLink and Zelda in this moment still were gazing open-mouthed in awe of 'Mount Malon' placed feet from their faces, Link's \"compass\" rigidly pointing towards 'booty' as always.<br>\r\n<br>\r\nThough now slowly it dawned on Zelda a familiar pink aura near her own hips appeared, illuminating and now doing things to her.<br>\r\n<br>\r\nThings she very much liked.<br>\r\n<br>\r\n<b>*Whisle*</b><br>\r\n<br>\r\nZelda whistled to get both her guests' attention.<br>\r\n<br>\r\n\"Link...\" Zelda out her palm on Link's face, turning his head around and gesturing him to look down at her ass, glowing with magic before 'the show' starts.<br>\r\n<br>\r\nHe let out a affirmingly happy response to the obvious event soon at hand.<br>\r\n<br>\r\nMalon also picked up on this, turning herself around (with some difficulty) to see Zelda's half of the pink diamond's blessing.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><b>How big does Zelda's butt get?</b></div></span></div></div>",
            "created":1602543900,
            "id":2920055,
            "title":"Why lie about liking big butts? I cannot."
        },
        "11323":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "He makes a stop at Lon Lon Ranch before he arrives at Zelda's living quarters.",
                "Arriving at Zelda's room, he meets the princess & pours purple dust on her body."
            ],
            "content":"<div class=\"\"><div> <span>Link was riding across Hyrule Field on Epona, hungry for adventure as always..<br>\r\nTo satiate his adventurous appatite and craving for exploring he eventually dismounted Epona when arriving at one of many cliffs that surrounded the vast plain.<br>\r\nLink had seen a suspicious silluette peeking over the horizon and wanted to investiagte.<br>\r\nHe managed to work his way up the steep cliff, pulling himself over the rocky edge and finding himself again on solid ground.<br>\r\nHe scanned the landscape for this mysterious \"structure\" he'd caught a glimpse of earlier that day. Almost immidietly he saw that there indeed was some some kind of structure a small walking distance from where he stood.<br>\r\n<br>\r\nLink made his way to the brown and grey hill of stone, clearly a man-made structure.<br>\r\nWalking closer toward it and upon closer inspection he noticed what looked like a simplistic temple entrance sculpted from the stones that made up the rest of the structure. No one had been up here for a long time, Link thought. For how long had this place been hidden up here?<br>\r\nIn front of this entrance lay a collapsed pillar featuring a Gerudo-insignia, clearly heavy and bomb resistant. Yet it was no match for Link's Golden Gauntlets.<br>\r\nHe grabbed the huge pillar, pulling it out of the ground and threw it behind him in one continous motion.<br>\r\nAt last the pathway into the mysterious location was cleared.<br>\r\nLink noticed the familiar sight of a grotto hole in the center of the hollow outside structure, and he hopped down without hesitation.<br>\r\n<br>\r\n<br>\r\nIt was a fairy fountain.<br>\r\nAfter Link awoke the great fairy by his usual means she did not have the appearance Link assumed a Great Fairy would have had.<br>\r\nIn a flash of light the tall figure emerged from the fountain waters, accompanied by a playful giggle.<br>\r\n<br>\r\nThis fairy shared some aspects with her many 'sisters' that lived across Hyrule; the shadowy eyelids, brightly coloured lips, long curly hair and being clothed in nothing but ivy.<br>\r\nBut it was obvious to Link that she was unlike the other great fairies he had met in his travels this far, as illustrated by her impressively sized assets.<br>\r\nRocking hips wider than her shoulders, wide thighs and a pair of round plump breasts bigger than her head.<br>\r\n<br>\r\nLink felt a sudden rigidness in his trousers at the sight if her, but kept focused nontheless.<br>\r\nThe fairy looked down at Hyrule's legendary hero, placing one hand on her mouth and again giggling.<br>\r\n<br>\r\n<i>\"Was it you who awoke my from my slumber, you handsome hunk of a man?\"</i> The great fairy said flirtatiously; <i>\"I haven't been called upon in what must be over a hundred years! But you look like someone capable of spreading my blessings across Hyrule, O great hero!\"</i><br>\r\n<br>\r\nLink felt himself unable to decline this request of hers, as the fairy surveyed the green clad warrior and looking into his eyes.<br>\r\n<br>\r\n<i>\"That look on your face is one I recognize immidietly.\"</i> She said in a sedective tone; \"It may have been an eternity since last I helped a man on a quest, but I'm very familiar with the intents of the plans your making in your head.\"<br>\r\n<br>\r\nLink was taken by surprise by her statement. Was it just a lucky guess that she'd known his head was filled with thoughts of boobs and butts?<br>\r\n<br>\r\nThe well-endowed fairy's voice echoes across her fountain as she blessed the hero in front of her;<br>\r\n<br>\r\n <i>\"O great hero of Hyrule... I can sense your devious desires.<br>\r\n Allow me you aid you in your horniness!\"</i><br>\r\n<br>\r\nShe placed her hands together and blew a magic gust of air onto Link.<br>\r\nLink noticed his new items in his inventory now. Four new bottles that were filled with differently coloured powder.<br>\r\n<br>\r\n<i> \"To make hyrule a more bountiful place...<br>\r\n Use my Purple dust, Green dust and Yellow dust...<br>\r\n Lastly, my blue powder... Use that on yourself if the moment is right.\"</i><br>\r\n<br>\r\n<br>\r\nLink held one of his new bottles up. There was a purple sand-like powder inside that glimmered as he swirled the bottle in his hand.<br>\r\n <br>\r\nAs he concentrated on the bottles' contents, the fairy leaned in towards him.<br>\r\nShe whispered to him in her previous soft voice; <i>\"You just need to sprinkle a little bit and my magic'll do the rest~\"</i> She giggled; <i>\"Just look.\"</i><br>\r\n<br>\r\nShe again hovered up to the centre of her fountain, gesturing to Link to look closely, sending him a playful wink.<br>\r\nLink saw how she began twirling slowly in the air, letting him see more of what she was packing from new angles.<br>\r\nHis eyes widened as he noticed the curve from her spine and outward behind her.<br>\r\nA second later her twirling motion gave him a full view of the fairy's two perfectly shaped ass cheeks, rivaling their frontside cousines in size.<br>\r\nThe fairy heard Links gasps of awe as he himself clearly enjoyed her show, and in response she gave her ass a gentle slap, letting its ocean of ripples further delight him.<br>\r\n<br>\r\nIn moments her twirling turned into spinning as yellow sparks emmited around her, after which she just as fast hovered still in the air.<br>\r\nNow that she had again charged up her magic she was ready for a display of her powers.<br>\r\nAgain, her voice echoed;<br>\r\n<br>\r\n <i>\"Gaze upon these melons of mine, O great hero of Hyrule...\"</i><br>\r\n<br>\r\nLink heard a magical 'fooof' sound after the fairy had spoken as he looked deep into the fairy's cleavage, marveling at her breasts as was commanded.<br>\r\nA quiet moan escaped the fairy's lips as her spell took effect on herself as she mumbled to herself; <i>\"Oh, this is the best part... Having growing tits is the best...!\"</i><br>\r\nPurple magic swirled around her before going into her breasts and rear, a faint purple and white glow emanating from her assets as the spell took effect.<br>\r\nLink beheld the breast expansion, feeling his eyes dampen with tears of joy in a moment of epiphany and increased pants tightness.<br>\r\n<br>\r\nThe chest of the great fairy swelled as her purple magic encased it, making it grow in subtle surges of growth, causing an up-and-down wobble and jiggling.<br>\r\nShe put her hands behind her head and leaned her body out, shaking her boobs around. They smacked against each other, wobbled and continued swelling all the same.<br>\r\n<br>\r\nTo give a display to Link of her purple spell's additional effect she turned around mid-air, glancing at Link over her shoulder.<br>\r\nIt was obvious to Link that her magic made both the breasts and ass of a woman grow, as he felt his daze pulled in by the glow across the fast area covered by the fairy's ass.<br>\r\nLink stared at her ass as it inflated in size, slowly filling itself upwards, sideways and outwards.<br>\r\nFrom where Link stood, the two orbs that topped her legs made a heart shape when viewed together with the great fairy's closed together legs. Fascinating.<br>\r\n<br>\r\n<br>\r\nThe glow faded from her curvaceous points and she turned back to look at Link.<br>\r\n<i>\"Mmm, being this big feels so good~\"</i> She said to him, groping her boobs as she spoke.<br>\r\nLink looked at the fairy's great pair of boobs and her ass, which he could now see even the fairy was facing forwards.<br>\r\nThey'd both been swelling up for a fair amount of time, and the size change was very noticable to Link.<br>\r\n<i>\"Like what you see, honey?\"</i> The fairy said; <i>\"I'm afraid to say that this demonstration was partly an illusion and a temporary change. But rest assured that my powers are very real.\"</i><br>\r\nShe again looked Link in the eyes; <i>\"Oh, but I see you've already got a plan for when you go out that that you want to get to without delay.\"</i> She closed her eyes with a wide smile and tilted her head, then said; <i>\"Then I won't have you waiting around down here in this cave. Go out there now and make them grow!\"</i><br>\r\n<br>\r\nLink had a clear goal in mind, and he knew where he'd be headed as soon as he left.<br>\r\nAs he turned to leave the grotto and return to the surface above he heard the fairy's parting words of wisdom in her echoing voice;<br>\r\n<br>\r\n <i>\"Return again to this fountain if your resources are depleted...<br>\r\n These sands around my fountain are imbued with my blessings...<br>\r\n Scoop it up and carry it with you any way you wish...\"</i><br>\r\n<br>\r\n<br>\r\nLink made sure he'd brought the bottles with him, as he climbed down from the cliffs meeting up with Epona again.<br>\r\n<b>He mounted his trusty steed making haste to Hyrule castle.</b></span></div></div>",
            "created":1580274000,
            "id":2780099,
            "title":"Bottled fairy magic is used on Zelda."
        },
        "113232":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Zelda decides to change clothes, letting Link advice her on outfits.",
                "Link pours green dust on Zelda which makes...!"
            ],
            "content":"<div class=\"\"><div> <span>Link rode on Epona across Hyrule field, passing Lon Lon Ranch, going across castle town bridge, speeding through the busy Castle town streets and going up to Hyrule castle.<br>\r\nHe hopped of Epona, rushing through the gardens to get into the castle.<br>\r\nLink entered the halls of the castle and calmed himself down a little, thinking that the guards might not like seeing people run in halls.<br>\r\nHe didn't want to be stopped and questioned, so excited as he was, he went through some doors and climbed a set of stairs at a brisk pace.<br>\r\nHe saw the door to Zelda's door and realized how long it had been while since she'd seen her last.<br>\r\nAfter some slight nervousness amidst his many arousing thoughts he knocked to see if the princess would answer.<br>\r\n<br>\r\nLink heard a soft voice on the other side say; 'Come in', and so Link opened the door to see Zelda sitting relaxed on a stool combing her long yellow hear whilst looking in a mirror.<br>\r\nThe princess turned her head, and was then clearly surprised to see Link enter her chambers; \"Oh, Link! Why are you here?\" Zelda asked, for a moment forgetting Link's lack of inclination to giving verbal responses.<br>\r\nAfter a silent moment of seeing Link standing in her doorway she instead called for him to come sit on another chair in the room.<br>\r\nLink obliged, taking care to silently close the door behind him as he entered Zelda's room, before going to take a seat.<br>\r\n<br>\r\nA moment later Zelda put her comb aside, standing up to give a formal greeting to her guest.<br>\r\nZelda wore her usual white and pink dress with the triforce emblem, along with golden jewelry on her chest, but without the pair of shoulder pieces Link usually saw her wearing, reavealing more of her arms.<br>\r\n<br>\r\n<br>\r\nWhen Zelda again asked Link about why he was visiting, he pulled out the purple dust-filled bottle from his inventory letting Zelda take a look.<br>\r\nZelda was well-versed in magic spells and devine blessings. She could guess this was a powder of magical nature, yet it wasn't like anything she'd encountered before, nor did it correspond with anything she remembered reading about in the castle library.<br>\r\n<br>\r\nExcited and very intrigued, Zelda urged for Link to show of what sort of magic this bottle contained.<br>\r\nLink smiled deviously, happily obliging as he opened the lid and started pouring.<br>\r\n<br>\r\nAs the purple, sparkling powder fell from the bottle it guided itself to Zelda's body, incirling her body in a glimmering swirl of sparkles.<br>\r\nA moment later, Link heard that magical 'foooof' again as the spell took effect and the magic absorbed itself into Zelda at very certain locations.<br>\r\nAs Link expected, Zelda's boobs and badonkadonk were encased in a faint white-purple glow<br>\r\n<br>\r\n<i>\"Umm... Link...?\"</i> Zelda cautioned; <i>\"Is what I think is happening actually happening?\"</i><br>\r\nThen, before she knew it, Zelda was groping her chest as it suddenly jutted out from her dress a bit more than normal.<br>\r\nLink looked on happily as his quest for sexy expansion was completed. Now for the reward of watching happen.<br>\r\n<br>\r\nZelda cupped her chest-puppies through her dress, feeling that they had blown past a couple of cup-sizes and were now already quite a handful, as she had secretly wanted for a long time.<br>\r\nThis chest-groping of hers was disrupted at feeling of a certain undergarment growing ever tighter around Zelda's ass.<br>\r\nShe carefully guided her hands to her backside, going for a light squeeze.<br>\r\nZelda tried supressing the moaning that ensued as her fingers sunk in to her now expanding ass mass.<br>\r\n<br>\r\nLink had thought that the dress Zelda always wore had made her butt look big. Yet now it was looking bigger in the litteral sense as well, as an unmistakable butt cheek-shaped impression rose up under her robes, forming tightly around the fabric.<br>\r\nIn Zelda's slight distraction she again looked forward and downward to see that her boobs hadn't been slowing down either.<br>\r\nZelda was grateful that this magic it seemed, had clothing expand along with whatever was underneath.<br>\r\n<br>\r\n<i>\"Link...\"</i> Zelda tried to speak, now heavily panting; <i>\"Could you, um... My boobs are--\"</i><br>\r\nBefore she could finish Link was holding up the two perky mountains in his gloves, both of them now the size of average watermelons.<br>\r\nTouching the still white-glowing area that covered Zeldas clothing and skin was strangely cold, in a soothing way that made Link feel a bit... 'tired?' He couldn't really put his finger on it, but it was calming in a way.<br>\r\n<br>\r\n<i>\"Link... They feel heavy...\"</i> Zelda whispered; <i>\"But also, they aren't heavy. I think?\"</i> She tried describing to Link how the growth felt; <i>\"They're great, soft and warm. I love my boobs now more than ever before...\"</i><br>\r\nShe let her right hand slide down her waist and sized-up hip then back around to grasp at her expanded rear; <i>\"My ass as well, though~ Mmm~ Ah~!\"</i> Zelda yelped as she had squezeed down on her right buttock.<br>\r\n<i>\"Will you love my body, Link, as I do?\"</i> She asked him with glimmering eyes.<br>\r\n<br>\r\nHer growth spurt was slowing down and had almost stopped, as Link leaned in and nussled his head in Zelda's busom.<br>\r\nHe rested his head in between the big orbs Zelda now carried on her chest. A pair of warm, very soft orbs. Perky and healthy, soothing and welcoming.<br>\r\nLink could feel himself almost falling asleep as he rested upon Zelda's boobs, Zelda's hands sending gentle waves throughout them with her hands. 'They were sooo jiggly' Link thought.<br>\r\n<br>\r\n<br>\r\nFeeling he had relished in the moment for long enough, Link stood up again, now able to survey the fully changed Zelda.<br>\r\nTaking a step back, it was a bit hard to fully see Zelda's curves in their full glory through her slightly poofy clothing. Her jewelry that had lay over her cleavage before was now buried within it.<br>\r\nBut her hourglass figure was definite. By far the most voluptous female form Link had seen in all of Hyrule.<br>\r\nHer boobs were about the size of her head, if not bigger, with her hips curving out a fair bit, as she had an ass comparatively larger than her boobs.<br>\r\n<br>\r\n\"I'd say your experiment was a success, Link.\" Zelda said seductively; \"You're great at loving my boobs. So how about you bury face in my ass later, hmm?\"<br>\r\nLink could tell she was probably; 'just joking about that. Unless...?'<br>\r\n<br>\r\n<br>\r\n<b>What does Link and Zelda do next...?<br>\r\n</b></span></div></div>",
            "created":1580274000,
            "id":2780166,
            "title":"Link makes Zelda's assets expand using fairy dust!"
        },
        "1132322":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Zelda and her body now obeyed Link's telepathic commands for a while.",
                "Zeldas could command her body to grow at will for a while."
            ],
            "content":"<div class=\"\"><div> <span>Link opened the bottle containing the green fairy dust and poured out its contents while standing close to Zelda.<br>\r\nBefore long a green swirl circled Zelda, as a strand of particles went up and down Zelda from head to toe in circles, as it then faded.<br>\r\n<br>\r\nA 'fooeeff'-ish sound rand out in Zelda's room as the spell took effect, and a green glow with faint magic smoke was emminating from Zeldas eyes...<br>\r\n<br>\r\n</span></div></div>",
            "created":1580274000,
            "id":2780175,
            "title":"The power of green fairy powder is...?"
        },
        "1133":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Natural growth ",
                "Magic ",
                "More methods of growth "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she grow naturally bigger or is magic used to increase her assets </span></div></span></div>",
            "created":1527570000,
            "id":2500211,
            "title":"More methods "
        },
        "12":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Butt",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow?</span></div></span></div>",
            "created":1370667600,
            "id":1607086,
            "title":"Midna"
        },
        "121":{
            "author_id":"eneris",
            "author_name":"Giant Kid",
            "choices":[
                "Twili Form",
                "Imp Form"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Exactly, What form will Midna be?<br>\r\nwill she be in her Twili form?<br>\r\nwill she be in her Imp form?</span></div></span></div>",
            "created":1370926800,
            "id":1609255,
            "title":"What From she will be?"
        },
        "1211":{
            "choices":[
                "Curse",
                "Potion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Final question: what causes the Princess of Twilight to get much more top-heavy?</span></div></span></div>",
            "created":1418360400,
            "id":1901434,
            "title":"Twili Form"
        },
        "12111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "The Twilight Realm.",
                "Hyrule."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where did the curse come from?</span></div></span></div>",
            "created":1474174800,
            "id":2211555,
            "title":"Where was the curse?"
        },
        "12113":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a relic of some sort?</span></div></span></div>",
            "created":1463029200,
            "id":2146674,
            "title":"Relics of change."
        },
        "1212":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A curse.",
                "An item.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, what causes the change?</span></div></span></div>",
            "created":1404104400,
            "id":1820300,
            "title":"The change."
        },
        "122":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "True Form",
                "Imp Form"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In what form will she grow?</span></div></span></div>",
            "created":1379912400,
            "id":1668224,
            "title":"Butt"
        },
        "1221":{
            "choices":[
                "Curse",
                "Potion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So the Twilight Princess is going to get a bigger butt. Now how exactly does this happen?</span></div></span></div>",
            "created":1415682000,
            "id":1885078,
            "title":"True Form"
        },
        "12211":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Keep going ",
                "Speed it up grandpa"
            ],
            "content":"<div class=\"\"><div> <span>Midna was walking around town at night when she tripped over a ancient artifact. She picked it up and wondered what it said with ancient letters carved into stone so Midna decided to go to the local bar and get a drink and see what it said. When outside the bar she saw a sign that said no imps allowed. Midna huffed and changed to her true form and walked in as she walked in the bar everyone started to stare at Midna as some of her cleavage showed her ass wasn’t that big but her boobs were a bra size of H which was massive and everyone gocked at it however Midna loved the attention and flirted with some of the guys however this would make her expand she saw the man standing behind the bar as she flirted with him. “Hey their pumpkin how are you doing” Midna said. Her ass started growing as she sat down and her boobs jiggled as she plopped down her ass was aproching  (here is a cliffhangers)</span></div></div>",
            "created":1580533200,
            "id":2781388,
            "title":"Curse"
        },
        "122111":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Keep going",
                "Something different "
            ],
            "content":"<div class=\"\"><div> <span>The man was not fazed by this. The bartender asked. What can I get you? Midna replied. How about a bottle of red wine handsome. Midna ass was getting bigger looking like two basketballs as her panties were showing on display for everyone some men were looking at her ass growing in front of them she felt a little off but didn’t notice she kept flirting are you one for kissing she asks the bartender replies no I am just here to serve alcohol her ass now the size of Ballons fully blown up getting close to beachball size Midna’s panties started to squeeze her hips after Midna left with her bottle of wine and beachball size ass she completely forgot about the ancient artifact.</span></div></div>",
            "created":1581483600,
            "id":2786553,
            "title":"Beachballs "
        },
        "1221111":{
            "author_id":"bulnaref",
            "author_name":"Bulnaref",
            "choices":[
                "Escape castletown",
                "Find zelda and link"
            ],
            "content":"<div class=\"\"><div> <span>As Midna was about to leave with her wine, she had one problem. Her behind had gotten so large that she could barely fit through the door frame. Struggling to get through the door, she finally realized that this whole time, her caboose had been rapidly growing. \"By the gods, how could this happen?!?!\" she said to herself. With several more pushes and pulls she managed to free herself but not without falling face first onto the cold hard ground. Unfortunately the wine shattered upon impact, but she had bigger problems than that right now. Struggling to get on her feet, she looks at her behind and thinks to herself \"What could have done this?\" She realizes that the artifact she had picked up must have had a curse placed upon it. to confirm her fears, she raised her hand and gave her rear the hardest smack she could muster. She feels horrified when she see's the fat of her ass ripple and jiggle as if it had been hit by Terminas moon. Upon closer inspection she also realizes that her assets are slowly continuing to fill out. With this realization, she decided that the best course of action is to...</span></div></div>",
            "created":1590037200,
            "id":2839049,
            "title":"Gets stuck in the door"
        },
        "12213":{
            "author_id":"aarsmith19",
            "author_name":"Wizkid",
            "choices":[
                "Yes, cast away ",
                "No, something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Could it be a spell she found</span></div></span></div>",
            "created":1571115600,
            "id":2733144,
            "title":"A special spell"
        },
        "1222":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "The Fused Shadows have more than one use.",
                "A curse.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, how does this happen?</span></div></span></div>",
            "created":1428123600,
            "id":1958550,
            "title":"A secret treasure."
        },
        "123":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "True Form",
                "Imp Form"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In what form will she grow?</span></div></span></div>",
            "created":1379912400,
            "id":1668222,
            "title":"Both"
        },
        "1231":{
            "author_id":"bellylover25",
            "author_name":"Caleb",
            "choices":[
                "KEEP GOING!",
                "Stops to admire her new girth",
                "Falls to sleep"
            ],
            "content":"<div class=\"\"><div> <span>Midna was up and walking around when she saw something on the floor it was a old book which it's title read, Interesting Spells. Midna picked it up off the ground and walked away with it back at her castle she transformed to her True form and sat down on her chair and opened the book. Midna read through until something caught her eye a spell called the Hourglass spell. Midna couldn't just not try it so she just tried it out she read the spell and she could feel a weird feeling at her chest Midna looked down to see her boobs growing they were from a C-cup to a E-cup and then her ass started to grow along with her thighs and hips her ass was pushing a lot against her robes that you could see the whole outline of her ass.</span></div></div>",
            "created":1572325200,
            "id":2739731,
            "title":"True Form"
        },
        "12311":{
            "author_id":"bellylover25",
            "author_name":"Caleb",
            "choices":[
                "Midna goes to find link to take him on a date",
                "Goes to the store to by a new bra"
            ],
            "content":"<div class=\"\"><div> <span>Midna said the spell again and felt a tingling sensation and her E sized cups turned to H cups and her hips started growing again with her thighs and ass her robes barely covering her ass making showing her legs and revealing part of her panties Midna was loving it she wanted to keep going so she read the spell again and her boobs were starting to grow again which turned from awesome H cups to amazing KK cups now showing her bra that was really tight and then her ass,hips and thighs grew again her panties were fully showing her panties ready to explode Midna jiggled her boobs a bit and jiggled her ass she wanted bigger Midna once again said the spell from KK cups to P cups which exploded her bra showing her nipples her ass was growing the chair breaking underneath her. Midna's painties some how still holding on and Midna was somewhat satisfied she looked in the mirror to see her big tits and ass.</span></div></div>",
            "created":1573448400,
            "id":2745340,
            "title":"KEEP GOING!"
        },
        "123112":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Keep Going ",
                "Next Chapter end it"
            ],
            "content":"<div class=\"\"><div> <span>Midna tried to find another bra to fit but none of her bras fit not even her bikini tops fit. Midna decided to get more bras bigger and her size and panties and some bikinis and maybe some other clothes. She went to her drawer to look for rupees and found 400 rupees but that wasn’t enough Midna needed more rupees so she went to collect more rupees. When Midna was out looking for rupees people could help but stare and her Hourglass Figure with her nipples out and her ass and boobs jiggling with every movement as Midna continued for her search she came across a man that said he would pay Midna 1000 rupees for a grab at her boobs Midna said yes but only for the rupees. (Cliffhanger again)</span></div></div>",
            "created":1584766800,
            "id":2804765,
            "title":"Goes to the store to by a new bra"
        },
        "12312":{
            "author_id":"aarsmith19",
            "author_name":"Wizkid",
            "choices":[
                "Go to sleep and see what happens next",
                "Cast the spell again"
            ],
            "content":"<div class=\"\"><div> <span>She looked down and saw the lovely mounds on her chest and she decided to go over to a mirror and admire herself. She moved her breasts around to see that she isn't under an illusion and she turned her hips to see (and feel) her massive pillow shaped ass.<br>\r\n\"Damn if I had these curves I'm pretty sure Wolfie would faint.\" She said while grabbing and wiggling her bits.<br>\r\n\"Hmmmmm, what should I do next.\"</span></div></div>",
            "created":1573362000,
            "id":2745031,
            "title":"Admiring the new \"features\" "
        },
        "12313":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Midna fumbles the spell, and accidentally casts a different one on Link instead!",
                "Midna's spell finishes. She and Link look on in amazement. What an odd reunion!"
            ],
            "content":"<div class=\"\"><div> <span>Midna slowly awoke, lazily opening her heavy eyelids while rolling around under the covers.<br>\r\n<br>\r\nShe felt well rested and invigorated.<br>\r\n<br>\r\nBut she realised in her waking moments that things weren't quite how they usually are in her when waking up in her castle chambers.<br>\r\n<br>\r\nThis wasn't her bed.<br>\r\n<br>\r\nThis wasn't her room.<br>\r\n<br>\r\nShe noticed her bust continued outward more than usual, and...<br>\r\n<br>\r\nMidna felt around with one hand on her side; \"Has, my butt grown too...?\" Midna asked herself growzily.<br>\r\n<br>\r\n<br>\r\nIt was then that she started remembering what happened yesterday.<br>\r\n<br>\r\nThe strange book...<br>\r\n<br>\r\nSitting down whilst reading it.<br>\r\n<br>\r\nFinding that hourglass spell and saying the words...<br>\r\n<br>\r\n<br>\r\n\"The book!\" Midna got out of bed.<br>\r\n<br>\r\n\"Where's the book?\" She looked around in the wooden moss walls, decorated with shelves picture frames and chests; \"Where am I? Is this... Hyrule?<br>\r\n<br>\r\nMidna hadn't returned to the realm of her adventure with Link from a year ago now.<br>\r\n<br>\r\nNot since she shattered the mirror that allowed entry here from the Twight Realm where she lived.<br>\r\n<br>\r\n<br>\r\nMidna started to recognize the room she was in.<br>\r\n<br>\r\nThis was Link's house!<br>\r\n<br>\r\nThe dark basement, the ladders, the round window and the soup pot!<br>\r\n<br>\r\nMidna of course remembered it all.<br>\r\n<br>\r\nMidna realized she might actually be able to meet Link again soon, which exited her.<br>\r\n<br>\r\n<br>\r\n\"Ah, there you are!\" Midna saw her mysterious book of interesting spells laying on a chair next to Link's bed, and picked it up.<br>\r\n<br>\r\nShe instictively flipped to the section of expansion spells, scanning for the section she had used last time.<br>\r\n<br>\r\n<br>\r\nThere it was, right where she had left it; the Hourglass spell.<br>\r\n<br>\r\nMidna noticed a conveniently placed large mirror hanging next to her, as her next course of action became obvious with nothing else on her mind.<br>\r\n<br>\r\nShe admired how her clothes clung to her current form, hoping to make it a bit tighter again.<br>\r\n<br>\r\n\"Time to fill out these curves some more, hmm?\" Midna said holding up the book and looking at the spell.<br>\r\n<br>\r\n<br>\r\n<b><div align=\"center\">As Midna started chanting the spell, the door opens behind her and Link enters!</div></b></span></div></div>",
            "created":1599291840,
            "id":2897849,
            "title":"Midna reawakes in Link's house spell book in hand!"
        },
        "123132":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "A mild amount larger! It doesn't take too long.",
                "A large amount larger! It takes a fair bit of time."
            ],
            "content":"<div class=\"\"><div> <span>Link walked in, noticing a curvaceous female figure stood in front of his living room mirror.<br>\r\n<br>\r\nShe looked vaguely familiar from this angle, though Link couldn't recall ever meeting a girl whose robes clung skin-tight around her butt.<br>\r\n<br>\r\nMidna turned around in reaction to the sound of Link's door closing behind him.<br>\r\n<br>\r\nThe final word of her spell left her lips as she turned to face Link, looking him in the eyes with an awkward and embarrased stare.<br>\r\n<br>\r\nLink's eyes however instinctively looked elsewhere, landing at the sight of Midna's two large... Distractions...<br>\r\n<br>\r\nLink then remembered definitively having seen those two orbs before, a year ago now.<br>\r\n<br>\r\n\"What an unexpected way for an old companion to come visit me.\" He thought.<br>\r\n<br>\r\n<br>\r\nBut the moment of innocent reunion was cut short, as Midna's large two sets of distractions (front and back) coincidentally started to expand in that very same moment.<br>\r\n<br>\r\n<div align=\"center\"><b>Choose by how much!{/b</b></div></span></div></div>",
            "created":1599293520,
            "id":2897863,
            "title":"How strong was the spell?"
        },
        "1231321":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Midna has a change of outift, followed by a change of scenery.",
                "Midna has change of ass size, followed by a change of outfit."
            ],
            "content":"<div class=\"\"><div> <span>The black and pale blue patterned skin of Midna's body started glowing mildly around the areas where the spell took effect.<br>\r\n<br>\r\nShe felt an enjoyably warm sensation imminate within her hips, while feeling her robes straining against her now ever-widening sides.<br>\r\n<br>\r\nAs her hips and butt grew, the red-haired Twili queen grabbed onto her busom, feeling her royal pair of bazongas fill up in her hands.<br>\r\n<br>\r\nMidna's fingers grazed the sensitive skin of her now melon-sized breasts, sending shivers of pleasure throughout her body.<br>\r\n<br>\r\n<br>\r\nLink looked on at the show unfolding before him curious, but nontheless delighted.<br>\r\n<br>\r\nMidna's strange 'greeting ceremony' was a real wonder to behold he thought, unaware that Midna hadn't planned on being observed.<br>\r\n<br>\r\nThough there wasn't any time for Link to ask his bodacious guest any questions yet.<br>\r\n<br>\r\n<br>\r\nWith a dramatic sound, the robes cover Midna's behind began to tear, barely able to encase the huge rear swelling up beneath it.<br>\r\n<br>\r\nMidna turned to see her reflection in the mirror from the side.<br>\r\n<br>\r\nThe curve outward her ass caused had gotten even larger now than when she glanced at it a short moment ago.<br>\r\n<br>\r\nPlacing her hands on her cheeks, Midna felt they were quite a force to reckoned with, gently stroking down and tapping one side.<br>\r\n<br>\r\nIt'd sure be able to turn the head of any and all males she walked passed now, if Link's intense and shocked staring was any indication of things.<br>\r\n<br>\r\n<br>\r\nWith a last surge of growth, Midna's tits ballooned out while her ass pulled out as well, all in clear view of Midna's mirror.<br>\r\n<br>\r\n\"Mmhm, look at that!\" Midna teased, admiring the changes; \"D'aww... My dress got a bit torn during the process...\" She lamented, seeing the big tear at her rump with a peek at the, now also strained, black patterned underwear she was wearing.<br>\r\n<br>\r\nShe turned again, still looking at her mirror reflection; \"Well, I can't complain about this rack I'm packin'!\" Midna admired, bouncing and massaging her boobs for a bit.<br>\r\n<br>\r\n<br>\r\nThe distracing pleasures of lifting her heavy funbags up and down was however halted, as the inter-dimensional hyper-busty queen remembered the elephant in the room.<br>\r\n<br>\r\nThe reincarnarion of the hero, Link, hadn't taken a a single step since walking in on her book ritual, still stood at his doorway not having said a word.<br>\r\n<br>\r\nMidna felt her witty instincts from their past adventure return to her, looking at Link and telling him; \"What? Say something! Am I so beautiful that you've no words left?\"<br>\r\n<br>\r\n<br>\r\nLink smiled and laughed.<br>\r\n<br>\r\nHe ran towards Midna and hugged her, overwhelmed with joy at being able to meet her again.<br>\r\n<br>\r\nMidna didn't expect this resoonse from Link, but felt compelled to hug him back in return.<br>\r\n<br>\r\nIt was an unorthodox hug, as Link pressed his body close to Midna's to reach around her, with Link being smothered slightly by his voluptuous friend, seeming not to mind.<br>\r\n<br>\r\n<br>\r\nBut Midna soon found out that Link actually minded her form, appriciating it greatly, as his hands slid down her shoulders, her waist and hips, landing ontop her huge ass and them pushing her closer toward him.<br>\r\n<br>\r\nMidna had briefly forgot the changed size of her certain body during their heartfelt hug, but felt relieved whwn she realised that Link still liked her for who she was.<br>\r\n<br>\r\n<br>\r\nAnd like her for who she was he did, as the hero of twilight got handsy all over the half-dress beauty.<br>\r\n<br>\r\n\"Oh ho ho, L-link. I'm glad to s-s-see you to, b-buddy.\" She said while panting, as Link rhythmic massaging of her ass made Midna moan repeatedly.<br>\r\n<br>\r\nIt felt good, and Midna couldn't get enough.<br>\r\n<br>\r\nWith her hugging grip, she pushed Link closer towards her, his face sinking into her busom in the process.<br>\r\n<br>\r\nThe dark blonde-haired hero said nothing (big shocker), and knew too simply increase the speed of his kneading.<br>\r\n<br>\r\n<br>\r\nMidna's heavy breathing reached its crescendo, as she let out a prolonged pleasured moan, falling to her knees and letting Link out of her grasp. <br>\r\n<br>\r\n\"Mhm, tha-a... Was great- m-my, hero.\" She priased Link between heavy breaths, recovering from the 'welcome' she'd just received.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nMidna explained her strange return after using the 'interesting spells' book and falling asleep.<br>\r\n<br>\r\nThe spell book was thorough, with many different types of spells listed in its hundred pages.<br>\r\n<br>\r\nAfter some discussion, the pair decided they had a two options of spells to use in the book now before doing anything else.<br>\r\n<br>\r\n<br>\r\nWould they use a spell to place Midna in a bigger hourglass-sized outfit?<br>\r\n<br>\r\nOr, would they make her ass expand first, in order to rip her half-torn robe off of her?</span></div></div>",
            "created":1599332040,
            "id":2898092,
            "title":"Midna gets hourglass-ier as Link watches in awe."
        },
        "12313212":{
            "author_id":"magicmaster667",
            "author_name":"MagicMaster667",
            "choices":[
                "Castle town! Midna meets Zelda again!",
                "Lake Hylia! As Link and Midna bask in the sun, another spell is used!"
            ],
            "content":"<div class=\"\"><div> <span>Link flipped through the book Midna had brought over from her dimension, searching for the appropriate category of spell effects.<br>\r\n<br>\r\nThen, he found the page he wanted, as the words 'Ways to grow asses' headlined the top of the page.<br>\r\n<br>\r\nLink showed Midna the spell instructions listed, where there also was listed suggestions for personalized creative casting.<br>\r\n<br>\r\nThere were abundant details on ways to influencing the shape, degree of firmess and correlating effect on the thighs that was desired while casting.<br>\r\n<br>\r\n<br>\r\nAfter a short discussion, Midna and Link came to an agreement on how Midna would initiate her change this time.<br>\r\n<br>\r\nMidna held the book in her hand as she read out the spell, eager to have it applied to her.<br>\r\n<br>\r\nMidna readied herself, and spoke the magical words of expansion.<br>\r\n<br>\r\n<br>\r\nThe, by now very familiar to her, feel of warmth and tinglyness returned to her thighs, ass and hips, as magic once again added to her already massive curves.<br>\r\n<br>\r\nImmedietly in the mirror in front of her, Midna could see her frame widening below her waist, as her thighs and hips arched further to her sides again, bit by bit.<br>\r\n<br>\r\nBut the main event now made itself known to the rooms' two excited onlookers, as the two large spheres wobbled rigidly in their constraints.<br>\r\n<br>\r\nMinda's two cheeks inflated more and more in size, slowly pulling away shreds of her constricting attire whilst subtly pointing upwards.<br>\r\n<br>\r\nIn a moment that made its witnesses think of it as a dramtic slow-mo movie scene, the ginormous assmounds of skin-coloured goodness burst out from its confines, wobbling with unending enthusiasm.<br>\r\n<br>\r\n<br>\r\nMidna's panties and lower dress were now a mere memory, resting as shreds on the floor, forgotten.<br>\r\n<br>\r\nLink could not take his eyes of Midna's frame.<br>\r\n<br>\r\nHer every curve and slope unlike anything he had ever thought imaginable in his mind.<br>\r\n<br>\r\nMidna was of the same mindset, enthused at what extreme hourglass like assets she possesed, her mind going wild with possibities of their utilization and how to adapt to her future day-to-day routines.<br>\r\n<br>\r\n<br>\r\nThe next spell Midna cast on herself made a busty red bikini manifested itself on her, which was suited to her extra, extra large form 'to a T'.<br>\r\n<br>\r\n<br>\r\nMidna, was eager to adventure out in the world, fill her adventurous desires and revist locations she remembered.<br>\r\n<br>\r\nThe first obstacle however came as Link showed Midna the way through his front door, shortly after her clothing change.<br>\r\n<br>\r\nMidna had grown her ass out to the point where walking through out the door made her hips get stuck to the sides of Link's doorframe, which gave the pair a chuckle at the realisation.<br>\r\n<br>\r\nBut Midna got through after she with a quick snap of her fingers teleported herself through the entryway and outside into the fresh forest air.<br>\r\n<br>\r\nLink readied up Epona, Midna made sure to pack her magic book in one of the pouches on the horses back, and a soon the pair got seated and were ready to gallop away.<br>\r\n<br>\r\n<br>\r\n<b><div align=\"center\">Where did they ride off to</div></b></span></div></div>",
            "created":1599440520,
            "id":2898689,
            "title":"Clothes are torn to shreds... Magically."
        },
        "1232":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "See what Midna is doing",
                "Continue here"
            ],
            "content":"<div class=\"\"><div> <span>A whole year passed since the day link left Ordon Village to go on a journey across hyrule along with his horse Epona. Colin had become much braver &amp; was now being trained by his father Rusi, while his mother Uli watched taking care of her year old daughter.<br>\r\n\"good son now run the drill again.\"<br>\r\nListening Colin ran it again slashing the dummy with his wooden sword impressing his father.<br>\r\n\"very good son your progressing almost as fast as link.\"<br>\r\nHearing that filled the boy with much joy as he saw link as a big brother &amp; the thought of being like him in anyway made him very happy.<br>\r\n\"do you think he'll return father.\"<br>\r\n\"I'm sure he'll come home any day.\"<br>\r\nA second later Colin saw his friend Beth running to Colin to tell not just him but his family.<br>\r\n\"everyone come quick to the ranch .\"<br>\r\n\"is something wrong?\" Asked Uli<br>\r\n\"no it's link he's home he &amp; epona are at the ranch hurry.\" She said before running back<br>\r\nUpon hearing of link's return both rusi &amp; Colin race of leaving Uli who promise to be along later with the baby.<br>\r\nOrdon Ranch<br>\r\nBack at the ranch Link was overwhelm by question from everyone in the village wanting to know where he's been for the last year, but the numerous question made it impossible. Seeing this Mayor Bo order everyone to wait until tonight for answers when they hold a party properly welcoming link &amp; epona back, agreeing everyone left say for the kids, ilia along with rusi &amp; Colin who just arrived too.<br>\r\n\"link my boy.\"<br>\r\n\"hello rusi it good to see you &amp; Colin again…I see you've become braver &amp; stronger since the last time I saw you Colin.\"<br>\r\n\"well father said that I'm old enough to learn swordplay.\"<br>\r\n\"so what have been up to Mr. hero?\"<br>\r\n\"excuse me rusi but my father asked everyone to wait until tonight for the party that he is hosting.\"<br>\r\n\"ok very well Ilia.\"<br>\r\nLeaving Colin at the ranch with the rest of the children, link decided to ask his childhood friend what she's been up to but before anyone could say a word they were all interrupted by the sudden appearance of Fado the main herder stepping out of his home.<br>\r\n\"Link is that you?\"<br>\r\n\"hey fado.\"<br>\r\n\"my boy it is great to have my favorite rancher back.\"<br>\r\n\"he's been having such a hard time that the mayor had to hire so help.\"<br>\r\n\"help?\"<br>\r\n\"oh you haven't me the new people who moved to the village.\" Said Colin<br>\r\n\"come on out guys &amp; meet Link.\"<br>\r\nStepping out first was a shot chubby man with black hair; the second was a tall slim blonde man &amp; the last a muscular man with red hair who height was in between the other two thought he was still taller than link all the same age as him. As all three hands advanced link had his eye on the red hair one that approached him first.<br>\r\n\"so you're the hero everyone around hyrule been talking about.\"<br>\r\n\" uh yeah I guess.\"<br>\r\n\"Well…it's a pleasure to meet you the name's Groose.\" He said giving Link a bear hug.\"<br>\r\n\" hey I'm calwin.\" Said the short one<br>\r\n\"stritch.\" Said the tall one<br>\r\n\"nice…to meet…all of you.\" Said link about to pass out<br>\r\n\"that's enough groose I think he has the point.\" Said Ilia<br>\r\nRealizing what he was doing groose finally freed link letting the hero catch his breath.<br>\r\n\"sorry I tend to overdo it when I meet new friends…\"<br>\r\nStill catching his breath link noticed groose pulling ilia into a loving embrace to which she returned much to link's &amp; even epona's surprise. The children all noticed link's shock &amp; wanted talk to him about what he saw but quickly brushed it off.<br>\r\n\"well we better get ready for tonight c'mon epona let's get you cleaned.\"<br>\r\n\"that's okay link I can get her ready for you while you head to the bathhouse.\"<br>\r\nIlia tried to lead epona away but the mare refused to move showing signs of concern for link but a soft look from him convinced her to leave with ilia. With them gone Groose &amp; the others went back to work leaving link &amp; the children alone.<br>\r\n\"link are you ok?\" asked Colin<br>\r\n\"does he treat her well?\"<br>\r\n\"very well.\" Replied Beth<br>\r\n\"then …I'm ok.\" He said racing off to his house.<br>\r\nRacing back to his house link was very surprise to see his home was still in great shape guessing that ilia had something to do with that. Once inside link gathered everything all he needed for the bath house including his ordon clothes to prepare for tonight.<br>\r\n\"I better take a nap before heading to the bath house.\"<br>\r\nLaying down link quickly close his eye trying to get some rest but a sudden sound caused him wake up but not in his room inside a room that was completely black. Drawing his sword &amp; shield link was ready for battle, sensing someone behind him link turned to face his opponent but to his shock he finds not an enemy but a friend an imp from his past.<br>\r\n\"Midna!?\"<br>\r\n\"hello link.\"<br>\r\n\"what are doing here &amp; why are you still an imp I thought zant's curse was broken.\"<br>\r\n\"does this form disturb you I am I that ugly in this form that you no longer care for me.\"<br>\r\n\"I never said that.\"<br>\r\n\"then you do find me attractive in this form &amp; you do still love me.\"<br>\r\n\"of course I do your beautiful no matter what you look like &amp; my feelings for you is what pushed me to spend a year trying to see you again.\"<br>\r\n\"it was a waste oh link why can't you understand that I am of the twilight realm &amp; you are from the light realm we cannot be together. She said placing her hand on his cheek.<br>\r\nIn response link place his hand on her cheek before asking her to look into his eyes &amp; say that again if she truly meant it. Unable to say it midna &amp; link both found themselves moving in on each other their lips about to meet.<br>\r\n\"link…I…I…lo.\"<br>\r\n\"OH Link.\"<br>\r\nUpon hearing his name called shocked him out of his dream &amp; back to reality causing him to fall out of his bed. Jumping to his feet he was ready to yell at the one who ruined his dream but quickly held his voice when he realized it was Uli reminding him about the party later.<br>\r\n\"oh dear are those the clothes you wore for the whole year?\"<br>\r\n\"yes.\"<br>\r\n\"seem they've been put through quite the adventure why not let me clean &amp; mend them for you.\"<br>\r\n\"ok thank you uli.\"<br>\r\n\"it is my pleasure dear after your finished with your bath drop them off at home on your way to the party.\"<br>\r\nWith that she left off to prepare for the party herself while link went back inside, sitting on his bed link began to lament about almost kissing Midna in his dream &amp; how when she touched his cheek it felt so real. Reaching into his bag link pulled out what used to be the Shadow Crystal a gift left behind by midna. Thanks to the triforce of courage still embedded in his left hand the dark magic was purified &amp; absorbed into him allowing to be able to transform into a wolf at will as well as giving him heightened wolf like senses in his Hylian form along with communicating with animals. Rendering it nothing more than a souvenir but there still some problem such as his new instincts could take control at times, as he gazed up the stone a thought ran though him mind.<br>\r\n\"I wonder what you're dreaming about midna.\"<br>\r\nGazing upon link's home from a distance as he watched the hero leaves was a golden figure in the form of wolf with one red eye watching with sadness for the last member of his blood line who's been hiding his pain well for a long time.<br>\r\n\"my descendent, my child, heir to all my secrets I know your pain all too well &amp; I will not allow that pain to lead to your end as it did to mine…something must be done.\"<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668226,
            "title":"Imp Form"
        },
        "12321":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Slight flash back",
                "Continue straight on"
            ],
            "content":"<div class=\"\"><div> <span>Sitting on her throne midna jump awake after having a dream about still being an imp &amp; link telling her how beautiful she was not to mention how close they came to kissing.<br>\r\n\" it's been so quiet &amp; peaceful this past year…I miss being with link.\"<br>\r\nSince her return to the throne midna &amp; her people have enjoyed peace but over the year her people became less reliant on her to protect them now that zant &amp; ganon are gone. Leaving her yeaning for adventure like the one she had with link despite the circumstances that brought her to him it was a blessing despite the way she treated link at first it was through him that her view on the light dwellers changed resulting in her developing feeling for due. Due to feeling it could never work out she destroyed the only thing connecting their worlds leaving behind not just the hero who saved her kingdom but the man who won her heart.<br>\r\n\"I give anything to feel his touch for real again.\" She said rubbing her cheek where he touched her in her dream<br>\r\n\"Anything?\" said a voice from no where<br>\r\nOrdon Village <br>\r\nMaking his way to the party link noticed ilia walking with groose, his friends &amp; epona walking towards him. Link could see that epona wasn't happy; Ilia had woven different roses into her mane, unknown to everyone except link epona didn't like roses.<br>\r\n\"here's epona doesn't she look wonderful?\"<br>\r\n\"uh yeah looks great.\"<br>\r\n\"she's a bright one your horse almost like know what we're talking about.\" Said groose<br>\r\nBoth strich &amp; calwin broke into laughter commenting about no animal is that smart no matter how well train. Offended epona was about kick them both but link quietly calmed her followed by ilia telling her not to be bothered by them as they left leaving link &amp; epona alone.<br>\r\n\"those two are fools.\" Said epona to link<br>\r\n\"they just don't know you like I do…by the way are you ok with you mane like that I know you're not fond of roses.\"<br>\r\n\"no but ilia work hard so I will bare with it tonight.\"<br>\r\nAfter dropping all his adventure gear link &amp; epona made their way to the party which took off the moment they arrived. With everyone gathered link begin to tell everyone about his adventure enthralling everyone about the dangers &amp; people he saved.<br>\r\n\"that was amazing but what were you questing for.\" Said Beth<br>\r\n\"let's just say I was looking something very important.\"<br>\r\n\"did you find it.\"<br>\r\n\"no but I'll keep looking.\" He said happily<br>\r\nAfter the story all of the children went to play with epona who was more than happy to give rides to them.<br>\r\nWanting to test link's progress as a knight Rusi challenged him to a duel while the other looked on, at first it appeared that they were evenly matched until link began showing off sword skills that no one seen before while becoming aggressive winning the duel. Surprising everyone mainly Rusi who knew that those moves were from an ancient style that has not been seen for centuries.<br>\r\n\"where did he learn those moves?\" thought rusi<br>\r\nEarlier in Twilight palace<br>\r\nUpon hearing the voice midna became ready for battle as she looked for the intruder.<br>\r\n\" peace child I am a friend from the past.\"<br>\r\n\"then show yourself.\"<br>\r\n\"very well…look behind you.\"<br>\r\nTuring around she found a man standing in ancient gold hyrule armor fashion after a wolf, midna became shocked when she saw the man's face as it looked just like link. For a few second her mood lifted but the second she saw the differences such as the eye patch &amp;that he looked slightly older.<br>\r\n\"who are you!?\"<br>\r\n\"do you not remember the spirit who taught the hero to seek power through courage.\"<br>\r\n\"how are you here &amp; why do you look so much like link.\"<br>\r\n\"my spirit has been set free now I am no longer bound to hyrule…&amp; I am able to take the form of the man I once was.\"<br>\r\n\"that does not explain the way you look.\"<br>\r\n\"the hero &amp; I share many things…face, name &amp; blood.\"<br>\r\n\"I see.\" said midna being very surprise<br>\r\n\"now are you willing to listen?\"<br>\r\nLater in ordon village<br>\r\nThe party was over everyone had gone to bed to prepare for the next day, as link lay awake he found himself unable to sleep. Unable to get midna out his head, she was the motivation of his journey searching for a way to see her again but failed now home still longing for the princess he loves.<br>\r\n\"I need to go for a walk…on second thought\"<br>\r\nSuddenly link's eyes began to glow as white symbol appeared on his forehead as he grew fangs, his hand &amp; feet began to grow claws while turning into paws. Black &amp; white fur began to overtake his whole body until he had become a full blooded wolf but with the mind of link still in control.<br>\r\n\"why walk when I can run.\"<br>\r\nDashing out of his window link made his way north to the ordon forest, running through the forest help clear link's mind as the full moon light beamed down on him. After a while of running link became very thirsty deciding to quench it at the ordon spring, reaching the spring link wasted no time drinking from it.<br>\r\n\"wow you've really taken to this wolf thing.\"<br>\r\nHearing a voice link gritted his teeth ready to fight whoever it was but upon seeing who it was all he could say was…<br>\r\n\"midna.\"<br>\r\n\"hello Link.\" Replied the imp<br>\r\n<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668228,
            "title":"See what Midna is doing"
        },
        "123211":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Something happens (1)",
                "Something happens (2)"
            ],
            "content":"<div class=\"\"><div> <span>Earlier in Twilight palace<br>\r\n\"Fine!\"<br>\r\n\"I know your heart longs for the boy.\"<br>\r\n\" how do you know that?\"<br>\r\n\"because his heart longs for you my child.\"<br>\r\n\"he does?\"<br>\r\n\"since he freed me from my regret I have watched over him…now I fear he may make the same mistake I made centuries ago.\"<br>\r\n\"mistake?\"<br>\r\n\" long ago in my search for a lost friend I poured most of my efforts into so much that I wasted my life &amp; created the regret that had me bound to hyrule…now I fear he is making.\"<br>\r\n\" he's searching for me?\"<br>\r\n\"that is why I need your help… I need you to return to hyrule…\"<br>\r\n\"I cannot unlike you I am not a spirit &amp; I destroyed the only way a physical being can travel trough between realms.\"<br>\r\n\"there are other way in &amp; out of the twilight realm.\"<br>\r\n\"even so I cannot survive in the light realm zant's curse was the only thing that allowed me to survive despite still being vulnerable to the spirit's light until Zelda gave me full protection from the light.\"<br>\r\n\"which is why I brought this.\"<br>\r\nThe hero then pulled out a mask &amp; gave it to midna upon examining it to her surprise it looked just the imp form zant had cursed her with minus the headdress.<br>\r\n\"is this some kind of joke!?\"<br>\r\nGiving a full explanation the hero explained that after the spell placed on midna was broken upon Ganon's death bits of the spell still remained &amp; was collected &amp; turned into a mask by him. Then taken to each of the light spirits who used their powers to balance out the dark magic by creating a protection spell then taken to Zelda who place on it improvements that would help midna live a normal life in hyrule.<br>\r\n\"why wait till now to give this to me?\"<br>\r\n\"I spent a year making sure that it was safe for you so that you &amp; him could be together… the mask will allow you into the light realm fully protected though you will be in imp form.\"<br>\r\n\"how are we suppose be together with me as an imp he could never love an imp.\"<br>\r\n\"isn't that his choice.\"<br>\r\n\"these other improvements?\"<br>\r\n\"that's for you to find out but I will say this the mask cannot be removed by anyone but you &amp; once remove you instantly will be transported back to the twilight realm for good…good luck child.\"<br>\r\nSuddenly the hero was gone leaving midna with the mask, as midna looked at the mask her heart &amp; mind were telling her to different things. Her mind was telling her get rid of it sighting she could never have a life with link with her as an imp but her heart was telling her different that link loves her no matter her appearance &amp; that her connection to link was very strong . Finally midna gave into her heart &amp; placed on the mask while saying.<br>\r\n\"let's just see where this will lead us.\"<br>\r\nOrdon Spring<br>\r\nUpon seeing midna the surprise was so strong that link lost focus returning to his Hylian form, to midna shock link had nothing on but underwear. There was nothing but silence until link found the courage to speak.<br>\r\n\"midna you're here &amp; why are you an imp again.\"<br>\r\n\"let's just say that this was the only way that I can see you… so that I can tell…\"<br>\r\n\"tell me?\"<br>\r\n\" to give up on us being together.\"<br>\r\n\" why would I do that?\"<br>\r\n\" I know you spent a year looking for a way into my realm …it was a waste oh link why can't you understand that I am of the twilight realm &amp; you are from the light realm we cannot be together.\" She said placing her hand on his cheek<br>\r\n\" you know you said the same thing in a dream I had earlier today.\"<br>\r\n\" a dream.\" She thought<br>\r\n\"now listen to me I knew that when I started my search a year ago that I might just be chasing a dream but that wasn't going to stop me I didn't care how long it was going to take I was going to keep searching…\"<br>\r\n\"why waste all that time in for me…I was so selfish to you when we met.\"<br>\r\n\"but you changed midna you became bent on not just saving your realm but mine too something I took to heart.\"<br>\r\n\"even if we could be together the only way I can stay is like this.\"<br>\r\n\" I don't care about your appearance.\"<br>\r\n\"but I do you deserve a beautiful love not an ugly imp.\" She said tearfully<br>\r\n\"you're not ugly to me you never were I never thought that, whether you look like this or your true form I love you for you.\"<br>\r\nLeaning in to finally kiss her midna found herself being drawn in as she began moving in to kiss him back. What was left of her doubt was still trying to get her stop but it was too late. The feeling felt wonderful like the thing that was missing in both their live was found. Slowly breaking away midna fully accepted that she wanted to stay with link but she still wish she had more to offer to hero physically.<br>\r\n\" I wish I had a better body .\" She thought<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668229,
            "title":"Slight flash back"
        },
        "1232111":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Things continue...",
                "Something interuptes them"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly midna felt a strange sensation causing to break away much to link's concern but had no time to voice any when he noticed that midna had somehow became a little taller. Midna herself was also shock realizing that she discovered the improvement the hero told her, the ability to adjust her physical form.<br>\r\n\" maybe I can combine the best parts of both my forms to create a new Hylian form.\" She thought<br>\r\nTesting out her new ability midna made herself even taller equaling ilia in height but stopping a head shorter than link's. Link was still in shock unable to figure out what was happening, midna was enjoying her new ability she now a more Hylian/twili like body but kept her impish curves &amp; her highly attractive round ass.<br>\r\n\"this is amazing …what do you think link?\"<br>\r\n\"I…I…\"<br>\r\n\"You're cute when you get like this….to bad I'm not done.\"<br>\r\n\"You're not?\"<br>\r\n\"are these big enough to please.\"<br>\r\nLink watched in awe as midna's breasts began growing larger until they were big enough to rival telma's, she also grow her rear larger to match her breasts, which during there growth midna had allowed her nipples to show revealing that they were the same color as the markings on her arms &amp; legs. Finish with her transformation midna realized that she was no longer a full imp, not full twili ether something in between her curse &amp; true form a hybrid. Pressing new body against link rubbing her chest against his while she asked him.<br>\r\n\"what do you think of the new me.\" She said swaying her tits<br>\r\n\"how did you do that?\"<br>\r\n\"it's a secret to everyone.\"<br>\r\n</span></div></div>",
            "created":1379912400,
            "id":1668233,
            "title":"Something happens (1)"
        },
        "12321111":{
            "author_id":"stormfox97",
            "author_name":"SilverFix",
            "choices":[
                "Something stops them",
                "They make it to links house"
            ],
            "content":"<div class=\"\"><div> <span>Midna wrapped her arms around link pressing her now big breasts into link. She then looked up at link frowned and then giggled to herself and backed away from link. ‘I don't like the fact that I'am so small when ever I'am with you.’ She puts her hands on her hips and link looks down at minda as see starts to rise and grow right in front of him. Soon they were at eyelevel with eachother, but not for long as minda continued to grow the braied in her pony tail come undone. As she starts growing link starts to see as the now is a head taller then link she starting getting more toned and muscler if just a little right now. Minda giggles to herself and flexs and toned arm. ‘I just added a little magic to my bodys muscles.’ As link reached eyelevel with midnas clevage he sees that her breasts starts expanding faster then the rest of her body growing so large they have no rival in all of hyrule. ‘Oo link what about this.’ She turns around showing her muscle-bound back and widing hips and growing ass turning them into two giant meat cushions with hips as wide as her shoulders. Minda's breasts are now a little bigger then her head. No one in the world came close to minda's new curvy body. She stopped growing when the top of links head barely reached the bottom of minda's breasts even with boots on and with a pony tail all the way down to her huge ass. She started giggling. ‘Your the small one now little link, come here.’ She says looking down at link shes 8feet now a real from imp to amazon with abs and a toned body. She leans down and smothers link with her huge breasts and pushs him to the ground. Still smothing him she takes her tits away from him and sits on him with her massive ass spreading her legs showing her womanhood, but all link could think about how heavy she was and the fact her breast where so big link could not see her face from where he was, but from mindas giggling he could tell she had huge grin. ‘What about we continue this at your house.’ She says standing up leading the way. Link followed all the time watching her swaying hips and bouncing breasts so interest he didn't notice her towering figure stop making him bump into her making him fall on the ground. Minda looked back and giggle and sits on link again but this time nearly smothing him with her butt cheecks. ‘I guess I'am to big to have you carry me any more, Now let's go I'am horny.</span></div></div>",
            "created":1464066000,
            "id":2153343,
            "title":"Link's new sexy ruler"
        },
        "12321112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A friend.",
                "A foe."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly, the duo heard a noise nearby; they were not alone! It was...</span></div></span></div>",
            "created":1407819600,
            "id":1840540,
            "title":"Visitors!"
        },
        "123211121":{
            "author_id":"linkcool200",
            "author_name":"linkcool200",
            "choices":[
                "Ilia",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What friend?</span></div></span></div>",
            "created":1416373200,
            "id":1889653,
            "title":"A friend."
        },
        "123211122":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Bokoblin.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sadly, the figure that had been sitting in the bushes was far from friendly. It was a...</span></div></span></div>",
            "created":1437368400,
            "id":2010228,
            "title":"Ah, crap!"
        },
        "13":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Breasts",
                "Butt",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she grow?</span></div></span></div>",
            "created":1370667600,
            "id":1607087,
            "title":"Fi"
        },
        "131":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "He uses it",
                "It isn't worth the risk"
            ],
            "content":"<div class=\"\"><div> <span>Link took a step back, panting as he raised his shield. He glanced over it to look at the horde of Chuchus in front of him, seeing the creatures were staring back. It was not a group of ordinary slimes however that was slowly wobbling into his direction: Unlike the common types the young hero had encountered during his journey these Chuchus weren't green, red or yellow. They were pink.<br>\r\n<br>\r\nOne more time Link stormed forward. With a loud battle cry he jumped at one of the gelatinous beasts, slicing it up in the middle. Like any usual Chuchu it split into two, and the separated masses transformed into two smaller individuals. But despite their red, yellow and green conspecifics the two new monsters didn't try to reunite. Instead, the pink substance of their bodies began to shake and vibrate. Before Link's eyes the two lumps of slime began to swell at a rapid pace until both had grown to the size of a regular Chuchu. Desperately Link repeatedly struck the monsters with his sword, splitting them into smaller and smaller portions. But no matter how small he cut them, each clump would slowly grow back to its original size. Producing more and more enemies like this Link soon found himself hopelessly outnumbered. Grunting he was about to strike again, when he heard something behind him. Quickly he jumped aside, just in time to avoid getting hit by a Chuchu that had sneaked up from behind. Immediately the young hero guarded himself with his shield again, taking a rough look at the number of enemies. When the battle had started it had only been a single Chuchu, and now at least twenty of the pink creatures stared at him with their dull smiles.<br>\r\n<br>\r\nHis sword suddenly began to glow, which signalized Link Fi had something to say. Since he was running out of ideas he decided to summon her. Making a flip in the air the sword spirit jumped out from the tip of the blade, hovering a few feet in front of Link. The transcendental figure looked as ethereal and otherworldly as always with her iron mask and the two different-colored cloaks that replaced her arms. Only her short form-fitting dress as well as her stockings revealed her to be of feminine gender, her decent curves showing through the clothes. In the middle of her chest a blue crystal was embodied into the fabric of her dress, the gem looking like it was a part of her body (which was probably the case). \"This is a pink Chuchu\", Fi told Link with her echoing, analyzing voice. \"To be honest, I have never heard of this species before. It seems a special component in its body allows it to duplicate its cells at an even faster rate than the usual Chuchus, making it virtually impossible to defeat with a sword. I suggest the use of a different strategy.\" And then the spirit vanished back into the blade. Link rolled his eyes.<br>\r\n<br>\r\nThe Chuchus steadily drew closer, the nearest getting ready to jump at him. In a last attempt to fight them Link raised his sword towards the sky. After a few seconds a gleam began to wander from the hilt to the tip of his blade. As the light reached the top the whole sword shined brightly, being full of sacred power. With a mighty battle cry Link swung his sword forward, releasing a vertical energy beam from it. The beam circled towards one of the slimy creatures and cut it in the middle, right between its bulging eyes. Instead of splitting in two the Chuchu suddenly glowed in a bright light. Like on command all others around it began to glow as well, freezing in their motions. Link raised his shield again, preparing himself for whatever was about to come. But to his relief the slimes didn't attack or grow further, but all dissolved simultaneously, flowing to a gelatinous mass that vanished into the ground.<br>\r\n<br>\r\nLink sighed, and put his sword and shield on his back. As he looked at the empty field in front of him he raised an eye-brow: From the remnants of the Chuchu he had hit with the beam a Jelly Blob had formed. Instead of being light-blue like all other Jelly Blobs however, this one was pink like the slime itself. What was even stranger though was that as Link came closer to it, his sword suddenly began to vibrate. As if on cue Fi jumped out of the blade, floating between her master and the blob. \"A report, master\", she informed him. \"I respond a reaction from the sword towards the unusually coloured Jelly Blob. It would appear that it is somehow corresponding to the sacred power inside the blade. I calculate the chances that the sharpness of the sword will increase upon contact with the blob at 85%. I suggest you to rub it over the blade.\" Link had no idea how Fi could feel that the blade would improve if he rubbed some slime over it, but just shrugged it off. She was the spirit of the sword, after all – maybe she had just a feeling for it. <br>\r\n</span></div></div>",
            "created":1371099600,
            "id":1610444,
            "title":"Breasts"
        },
        "1312":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "He gets jumped by more enemies.",
                "Fi comes out of the sword... But she's different.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Link shrugged off Fi's advice. She had been completely worthless before- why bother to start listening to her now? He had just started to walk away when suddenly...</span></div></span></div>",
            "created":1404709200,
            "id":1824198,
            "title":"Forget about it!"
        },
        "13121":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "More Moblins.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just then, Link was attacked yet again. His aggressors were...</span></div></span></div>",
            "created":1406091600,
            "id":1832428,
            "title":"Ambush!"
        },
        "131212":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Twilight demons.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who attacked Link?</span></div></span></div>",
            "created":1406610000,
            "id":1835266,
            "title":"Another aggressor."
        },
        "13123":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Link found some treasure.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened next?</span></div></span></div>",
            "created":1432098000,
            "id":1980543,
            "title":"What's going on?"
        },
        "132":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Magic.",
                "Science.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Fi get a bigger butt?</span></div></span></div>",
            "created":1405400400,
            "id":1828011,
            "title":"Junk in the trunk."
        },
        "1321":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Yes.",
                "No.",
                "Sort of..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Master Sword had something to do with this?</span></div></span></div>",
            "created":1408597200,
            "id":1844987,
            "title":"Let me guess..."
        },
        "13211":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A trip to the blacksmith.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what caused the Master Sword to change Fi?</span></div></span></div>",
            "created":1434344400,
            "id":1992964,
            "title":"How original!"
        },
        "132111":{
            "author_id":"sawe88",
            "author_name":"Sawe88",
            "choices":[
                "Fi's Butt expands Over Time",
                "It's Just Bigger the Next time she Exits the Sword"
            ],
            "content":"<div class=\"\"><div> <span>\"Master, I've noted that you are only using me with one hand. I recommend looking into extending my grip so you may use both arms for better force during a swing\" <br>\r\n<br>\r\n<b><i>Cut to Link at the Skyloft Bazar</i></b><br>\r\n<br>\r\n          Link spoke to Gonzo the blacksmith about getting a longer grip on the master sword. \"Link, I've known you for some time and I can say you've come to the right man for the job\" Link handed the sword to Gonzo and asked him to be very careful to not do anything to the blade. \"Wasn't planning on even touching the blade, by the looks of it I wouldn't be able to do anything to it though, that's a strange metal I have never seen before, but the grip seems weak enough I could just replace it.\" Link clarified he simply wanted the grip to be extended, and requested that Gonzo kept the grip's style the same. \"Sure thing buddy, after you got my little robot back up and running I feel like I owe you.<br>\r\n<br>\r\nGonzo carefully took off the grip of the sword and replaced it with one of a similar design but the grip was long enough for Link to use both of his hands. \"Here you go pal, don't forget to be careful down below you hear? Don't want my work being wasted.\"</span></div></div>",
            "created":1521867600,
            "id":2469151,
            "title":"A trip to the blacksmith."
        },
        "133":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Push the button again",
                "See if he can't enjoy him self"
            ],
            "content":"<div class=\"\"><div> <span>It had been by pure accident that Link noticed it. The tiny, yellow jewel in the center of the completed Master Sword's hilt was actually a button. He wondered if it was alright for him to press it.<br>\r\n<br>\r\n\"Master? What're you doing?\"<br>\r\n<br>\r\nLink looked upward to see the spirit of said sword staring back at him. This strangely beautiful otherworldly being, Fi, had been his companion ever since he started his great journey to save the world, and she was the one he could rely on with almost all of his questions. He showed her the sword, and pointed at the button. Fi floated in a little closer to get a better look.<br>\r\n<br>\r\n\"Master, I must say that I have never seen this device on the Master Sword before. It is a complete mystery to me as to what would take place were the button to be activated. If you wish, you may try it, but be warned that there is a 50% chance that something may go horribly awry. Please take heed, Master. I will not argue against whatever decision you plan to make.\"<br>\r\n<br>\r\nAfter having taken careful consideration regarding Fi's information, or rather her lack of information, Link decided to go for it. He gently pressed his finger against the yellow button. For a moment, nothing happened.<br>\r\nSuddenly, before Link even realized what had happened, the length of the blade itself increased. It grew out by several inches, and it felt a little heavier to lift than before. Link stared at his own sword in bewilderment before Fi's voice finally drove him out of his gaze and onto her. He was even more surprised by what he saw.<br>\r\n\"Master...I believe that that button you pressed did not only change the sword's form, but my form as well.\"<br>\r\n<br>\r\nFi's breasts had, like the Master Sword, grown by several inches as well. Her once non-existent cleavage had instantaneously swelled outward into a pair of bouncing, round tits. They would have filled almost any woman of Skyloft with seething envy. At what looked like j-cup they were almost as large as pumpkins, and having had worked part-time at the Lumpy Pumpkin before, Link was well aware of just how large some of them could grow. Her hovering up and down caused the breasts to be caught in a constant jiggle. The young man had already stared at Fi's massive mammaries for nearly a full minute before catching himself.<br>\r\n\"Master, I hate to ask this of you, but I believe something must be done to fix this condition. Attempt to press the button again. There is a 59% chance that it will revert this process. I do not think I can remain afloat for too long with breasts this heavy.\"<br>\r\n</span></div></div>",
            "created":1370667600,
            "id":1607097,
            "title":"The Master Sword's Hidden Button"
        },
        "1331":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "He pushes the button again",
                "He cant resist, hes going for her"
            ],
            "content":"<div class=\"\"><div> <span>Link nodded.  He pressed the button on the Master Sword again. This time the hilt of the sword grew longer in Link's hands. Fi looked down at herself her legs lengthened and became much thicker and much more toned. Rips and holes were littered all over the surface of her cross-stitch leggings as her legs and hips followed suit. Fi, contradicting her usual quiet and composed nature, let out a tiny moan as what looked like her womanhood became more prominent at her crouch. However, Fi tried her best to retain some of her dignity by completely ignoring this particular issue.<br>\r\n<br>\r\n\"M-Master...I implore you once more to press the button again. I am confident that another press may be able to revert these changes. There is nothing else that can be altered to the Master Sword now. Please hurry, for I fear I may fall soon. There is a 60% chance that everything will return to normal.\" All the while Link was trying to ignore the fact that his tights had become tighter.<br>\r\n</span></div></div>",
            "created":1370667600,
            "id":1607143,
            "title":"Push the button again"
        },
        "13311":{
            "author_id":"bubad",
            "author_name":"L.wood",
            "choices":[
                "Fi begins to have feeling that she should have",
                "Link can't take it any more and pounces on her"
            ],
            "content":"<div class=\"\"><div> <span>Link, who was beginning to doubt some of the sword spirit's predictions, still obliged himself to follow her request. He pressed the button a third time, and now the wing-like adornments on the sword's sides sprouted outward and took on a more realistic shape and appearance. Link quickly whipped his head up towards Fi to witness her next transformation. Fi's entire body began to tremble violently all over, which also prompted her breasts jiggle even more. Link's eyes bulged to the size of dinner plates as his partner's bum started to inflate, like balloons.<br>\r\n<br>\r\nFi looked over her shoulder to see her butt had expanded now in response to this third alteration. The rips and holes that littered all over the surface of her cross-stitch leggings as her legs and hips grew even larger, allowing Link to see a lot of fi’s “skin”. Her flat butt was a pair of perfectly-round spheres, large and heavy, bouncing nearly as much as her breasts as she struggled to keep herself in mid-air. Her dress was forcefully pushed up all the way due to the size of her ass, allowing the meaty cheeks to be seen in full-view by her master.<br>\r\n<br>\r\nLink then watched as Fi began to alter ever so slightly. First off, she formed actual eyes that while still completely blue where large and full of life. Then her cape became half its original length while arms sprouted from her shoulders, captivated by them she lifted them up to her face to examine them.  While this was happening Link notices the final change, Fi’s mouth began to chance and began to reseeded until she had an actual tongue and throat, with her lips becoming slightly more plump. Over all her face had gain a very sultry look to it that was making Link very hard…<br>\r\n</span></div></div>",
            "created":1370667600,
            "id":1607151,
            "title":"He pushes the button AGAIN"
        },
        "133111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Feelings of free will.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of feelings is she getting?</span></div></span></div>",
            "created":1413176400,
            "id":1870860,
            "title":"New feelings."
        },
        "1331111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "She takes the Master Sword.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Fi was suddenly thinking for herself- why should she serve Link? She had her own mind, so there was no need to be a slave. This is why...</span></div></span></div>",
            "created":1498971600,
            "id":2346007,
            "title":"Free Fi!"
        },
        "13311112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Fi escape the enslavement of the Master Sword?</span></div></span></div>",
            "created":1505624400,
            "id":2387235,
            "title":"Freedom for Fi."
        },
        "1331112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are they feelings of lust?</span></div></span></div>",
            "created":1467694800,
            "id":2175815,
            "title":"Lust?"
        },
        "13311121":{
            "author_id":"pandaman304",
            "author_name":"OreoPanda034",
            "choices":[
                "Pounce like a cat.",
                "Patience"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes, but does she pounce Link in her lust.  Or does she control herself and wait.</span></div></span></div>",
            "created":1485925200,
            "id":2272080,
            "title":"Yes."
        },
        "133111212":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "Press it again.\"",
                "Refrain from pressing.\""
            ],
            "content":"<div class=\"\"><div> <span>Fi continued to float slightly, although she was mere inches from the ground. Her thickened body bobbed up and down. Her breasts jiggled furiously due to a lack of bra and Fi's nipples started to harden from what she could only assume to be arousal. Her new hands travelled down her body, investigating. Her blue palms travelled around her newly wide hips to hold her thick ass cheeks. They easily filled her hands as she touched her exposed skin, and as she probed more, she could feel that they stuck out rather far.<br>\r\n<br>\r\n\"Maaaaaater...\" Her new vocal cords were a problem for her. Fi cleared her throat and tried again.<br>\r\n\"Master... I suggest you...</span></div></div>",
            "created":1492405200,
            "id":2306517,
            "title":"Patience"
        },
        "1331112122":{
            "author_id":"tiredhands",
            "author_name":"Tired Hands",
            "choices":[
                "She felt satisfied... for now",
                "She needed more"
            ],
            "content":"<div class=\"\"><div> <span>“Master... I suggest you refrain from pressing the button again as this effect could worsen.”<br>\r\nLink nods in response and sheathes his much larger sword. He looked at Fi, who was fondling her impressive rack with her new hands. She began to gain curiosity as her one of her hands traveled towards her protruding nipples. As her fingertips graced her sensitive areloa, Fi shivered and recoiled from the newfound pleasure, which sent visible ripples over her fleshy body. Growing more daring, she pinched her hard nipple, eliciting a surprised moan of pleasure. Her other hand join in now, each one roughly playing with the two large orbs that Fi had been given, starting to create a very erotic display for her watching master.<br>\r\n<br>\r\nThen, Fi felt a strange feeling. One she hadn’t felt before. She tugged on her nipples once more and let out a small yelp before the insides of her thick thighs got suddenly doused with a spurt of liquids from her new formed womanhood. A deep blush fell over Fi’s cheeks, turning them a dark shade of purple as she looked up at Link once more.</span></div></div>",
            "created":1529470800,
            "id":2510055,
            "title":"Refrain from pressing.\""
        }
    },
    "info":{
        "author_id":"bubad",
        "author_name":"L.wood",
        "brief_description":"My favorite Zelda characters grow sexier!",
        "created":1370707800,
        "description":"<td align=\"left\" class=\"norm\">Here are my favorite Zelda women <br>\r\n<br>\r\nRules:<br>\r\n1) great spelling<br>\r\n2) no foot fetish<br>\r\n3) no male growth<br>\r\n4) no women death<br>\r\n5) no weight gain<br>\r\n6) slightly realistic growth rates<br>\r\n<br>\r\nPlease Add</td>",
        "id":1937494,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604005440,
        "modified":1604005440,
        "pretty_title":"Zelda women sexy expansion"
    }
}