{
    "chapters":{
        "1":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Scott Allen",
                "Donald Mason",
                "Stephen Williams",
                "Shane Tutty",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First of all, who are you?</span></div></span></div>",
            "created":1312002000,
            "id":1158388,
            "title":"The ancestry of the myths"
        },
        "11":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Griffin",
                "[Write & I will rename]",
                "[Write & I will rename]",
                "[Write & I will rename]",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Name: Scott Allen<br>\r\nGender: <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/male.png\" alt=\"*Male*\" title=\"Male\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nAge: 16<br>\r\nSpecial Skills: First Aid<br>\r\nHistory:<br>\r\nScott is a social outcast with an iron will. As soon as he wants something, he will work towards it &amp; overcome any challenges. His determination can lead him to being hotheaded if someone is in the way. He has little friends but is the best person to talk to when you need cheering up.<br>\r\n<br>\r\nInterests: Video Games, Sports.<br>\r\nFears: Bugs<br>\r\n<br>\r\n<br>\r\nNow, what is his ancestry?</span></div></div>",
            "created":1312088400,
            "id":1158395,
            "title":"Scott Allen"
        },
        "111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "A van pulls up & people try to grab you",
                "Two men approach you",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You were just walking through town. You had little friends so you didn't have anywhere to go except home. You had heard several stories from your grandma that the family ancestry is based off griffins. But you didn't beleive her. You would look alot different if your family had been griffins. You had just arrived near the park when...</span></div></div>",
            "created":1312088400,
            "id":1158403,
            "title":"Griffin"
        },
        "1111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "You are captured",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>You see a speeding van coming towards you. It stopped right near you. The two people come out &amp; try to grab you. You avoided them. <i>Why are they trying to grab me? </i>you thought. You then ran into the park &amp; they were chasing you. You saw several people looking at you as you went past with them following. You soon arrived at a soccer field. You noticed a soccer ball in the middle. You picked it up &amp; turned towards them. You then kicked the soccer ball at one of  them &amp; knocked them out. You then continued running &amp; soon left the park. You then went into a nearby alleyway. You soon arrived at a dead end. The pursuer stopped not too far away. \"Nowhere to run, myth,\" he said evilly.</span></div></div>",
            "created":1312088400,
            "id":1158410,
            "title":"A van pulls up & people try to grab you"
        },
        "11111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Strapped to a chair in an Interrogation room.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span><i>Why did he just call me a myth,</i> you thought. He then ran up to you &amp; kicked you in the face. This caused you to stagger back into the wall. He then got out a needle &amp; injected you. You felt like you had no energy in you. You struggled to stand up. You soon were on your knees &amp; then you passed out as your head hit the ground. When you wake up, you looked around.</span></div></div>",
            "created":1312088400,
            "id":1158413,
            "title":"You are captured"
        },
        "111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Something blocks your escape & you are both forced to go to the roof",
                "You both make it out"
            ],
            "content":"<div class=\"\"><div> <span>You look around &amp; notice you are in a dark room. You also feel like you are being restrained by some leather straps. \"Hello,\" you said looking around, \"Is anybody there?\" \"H-hello?\" you heard a voice say a bit scared. \"Who's there,\" you replied very alert. \"M-my names Donald,\" you heard the voice reply, \"Who are you?\" \"I am Scott. Where are we?\" you asked him. \"I-I don't know,\" he replied still scared, \"I was captuerd and brought here.\" \"Really,\" you said trying to break your restraints, \"Me too.\" You then saw some lights turn on &amp; two men soon entered. The men looked at you with a look of disgust. \"You myths are greedy &amp; viscious creatures aren't you?\" \"What are you talking about?\" Donald asked. \"What do you mean?\" you asked continuing to try &amp; destroy your restraints. \"Don't play dumb with us!\" one of the men shouted. \"We know what you both are,\" the other said. \"There must be a mistake. We're human,\" Donald replied. \"We have no clue whats going on,\" you said noticing your restraints are close to breaking. \"You really don't know?\" one of the men said evilly. You then broke out of your restraints &amp; started to help Donald out of his. \"What do you think your doing your little brat!\" one of the men said running at you. You then stopped trying to free Donald &amp; sucker punched him as he came at you. He then fell to the floor. You heard Donald get up &amp; grab something. \"We have to get out of this mad hole,\" you said getting into a fighting stance. \"You don't have to tell me twice,\" Donald replied. The man looked scared.</span></div></div>",
            "created":1312174800,
            "id":1159101,
            "title":"Strapped to a chair in an Interrogation room."
        },
        "1111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "A room with a wounded scientist",
                "The roof"
            ],
            "content":"<div class=\"\"><div> <span>The man then ran out the room in fear. \"Come on we have to go,\" you said to Donald as you ran out the room. He followed. You were a little bit down the hall when you heard the comms saying, \"Warning power overload. Warning power overload.\" Then there was an explosion near you &amp; Donald that forced you both into the wall. You saw that the roof had collapsed at the end of the hall. This blocked your escape. \"We are going to have to go to the roof,\" Donald said. You both then ran up the nearby stairs.</span></div></div>",
            "created":1312174800,
            "id":1159461,
            "title":"WARNING: Power Overload"
        },
        "11111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "The explanation",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You &amp; Donald soon make it up the stairs &amp; saw that you were in a badly damaged room. It looked like there had been several explosions here. You also saw a badly wounded scientist staring at both of you. There was also an unharmed computer in the corner of the room. You also noticed a first aid kit next to you. \"I will tend to the scientists wounds,\" you said to Donald as you picked up the first aid kit. \"I will see if I can find out about where we are on that computer,\" Donald said as he ran over to the computer. When you got to the scientist he tried to get away. \"Stay away from me, freak,\" the scientist said. \"We don't know whats happening,\" you said to him. He soon grabbed his arm in pain. \"Let me take a look,\" you said kneeling down. You grabbed his arm &amp; it appeared to have a fracture. \"We need something solid,\" you said looking around. You then saw a magazine on a nearby table. You then grabbed it &amp; carefully wrapped it around his broken arm. You then gabbed a sling from the first aid kit &amp; wrapped it around his neck &amp; arm. \"That should help,\" you said to the scientist. \"You pathetic myths,\" he said. \"Stop calling me that!\" you yelled at him, \"We don't know what is going on. Can you please tell us.\" He just looked at you then at Donald. \"You both don't know what you are?\" he said. You just nodded. \"Well ok I will tell you,\" he said, \"Call your friend over.\" \"Hey Donald,\" you called out, \"This scientist is going to give us an explanation.\"</span></div></div>",
            "created":1312174800,
            "id":1159467,
            "title":"A room with a wounded scientist"
        },
        "111111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>\"So have yous heard any stories from your grandparents?\" the scientist said. You then thought about your grandma. She told you that you were a griffin. \"It can't be,\" you muttered. \"Well yous are both mythical creatures,\" the scientist said. \"Let me guess,\" you said, \"I am a griffin.\" He nodded. \"Am I a werewolf?\" Donald asked. The scientist nodded. \"Do you both know about the stereotypes for your creatures?\" the scientist said. You thought about it. You had only seen pictures of them. The front half is of them are an eagle &amp; the back half is a lion. But you do remember one. In it the griffin, the griffin ate the horses &amp; men that came close to its nest. <i>Oh gee</i>, you thought. You looked down. <i>Will I have control if I am in my griffin form</i>, you thought. \"Yep, you myths are savage creatures,\" the scientist said evilly.</span></div></div>",
            "created":1312261200,
            "id":1159825,
            "title":"The explanation"
        },
        "1111111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "Yes. He still has full control.",
                "No. He is starting to go savage."
            ],
            "content":"<div class=\"\"><div> <span>\"Ok so if I’m a werewolf, riddle me this,\" Donald said \"Wouldn’t the full moon force trigger the transformation?\" \"Ha ha, yes it would,\" the scientist chuckles, \"Man you sure are a stupid myth I’ll give you that.\" \"I believe I’m not the fool here doc, you are,\" Donald said to him, \"If I am a savage creature like you said, then I would wake up with blood on my hands after every full moon.\" \"W-well… that’s irrelevant!\" the scientist shouts. \"Oh is it really,\" Donald said, \"Then how about a demonstration.\" <i>What is he doing!? </i>you thought,<i> If he does not have control, he would rip anything apart</i>. You noticed the scientist was very scared. \"Scott you know first aid. Do you know the body’s weak points?\" Donald asked. “I know some of them why?” you asked. Donald then gave you a cattle prod. \"Take this and stand back,” Donald said, “If I show sign’s of savage behaviour, I want you to stop me.” “No you can’t possibly be thinking?” the scientist said in fear. You noticed Donald is starting to be immersed in a dark blue flame. “Well doc let’s see if your words have any truth,” Donald said as he was completely emerged. The flames vanish and you can see that Donald is now a werewolf, but does he have control?</span></div></div>",
            "created":1312261200,
            "id":1159855,
            "title":"continue"
        },
        "11111111111":{
            "author_id":"unleashmaximum",
            "author_name":"MightyWolf",
            "choices":[
                "A nearby door is breached & some commandos come in",
                "\"We have to get out of here.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You still there Donald?\" you asked holding the cattle prod at the ready. \"Get away from me you beast,\" the scientist said while backing up. \"Yes I am still here,\" Donald said ignoring the scientist. \"This is scientist Jason Smith,\" the scientist was saying into a phone, \"I am requesting that the Silver Nobles be called in.\" \"What are you doing!\" you said while snatching the phone. \"I am calling in the Silver Nobles to tame this beast,\" the scientist said glaring at Donald. \"Who are the Silver Nobles?\" Donald asked while walking towards the scientist. The scientist then looked down &amp; said, \"A special task group of commandos.\"</span></div></div>",
            "created":1312347600,
            "id":1160718,
            "title":"Yes. He still has full control."
        },
        "11112":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Chase after them!",
                "Continue on your way home. "
            ],
            "content":"<div class=\"\"><div> <span>The man starts toward you, and you brave for him to grab you.., or worse. But he doesn't ever reach you. There is a sound that you can't identify, you are hit by a great gust of air, and the man disappears. It takes you a minute to realize that he was grabbed by something from behind, and whatever it was lifted into the air and disappeared from view. You can no longer see or hear the man or whatever took him, but you know the direction they went. </span></div></div>",
            "created":1418706000,
            "id":1903661,
            "title":"Something happens"
        },
        "111121":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "-A girl, about your age. ",
                "-A massive griffon. "
            ],
            "content":"<div class=\"\"><div> <span>You realize there is no way you can just forget about this and act like it never happened. You race out of the alleyway, rounding the corner to face in the direction you saw the man's unknown assailant go. Sure enough, you are able to just barely glimpse a massive, winged shape as it drops down into another alley not far from where you are. You run toward it, but as you get closer, you realize that you are not the only one chasing after whatever you saw. A man runs into the alley just before you get to it. He hasn't seen you. You notice a van very similar to the one that went after you parked just slightly down the street. Taking care not to be seen by either the man or whatever you are following, you peer down the alley to see the man running at-</span></div></div>",
            "created":1418771580,
            "id":1903666,
            "title":"Chase after them!"
        },
        "1112":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Agree to go with them. ",
                "Politely refuse. ",
                "Run. "
            ],
            "content":"<div class=\"\"><div> <span>Two men stepped out seemingly from nowhere- they were dressed sharply in black suits. One was tall and thin, with a narrow face and squinty eyes. The other was tall as well, although less so. This second one had very broad shoulders, and you would not have been surprised if he turned out to be very muscular underneath his suit. The thin man nodded at you and spoke in a hushed tone. <br>\r\n<br>\r\n\"Are you Mr. Allen?\"<br>\r\n<br>\r\nYou consider responding sarcastically, or maybe even outright lying, but you suspect that this man knows the truth and was only asking out of a sense of formality. So you respond honestly. <br>\r\n<br>\r\n\"Yes, I am.\"<br>\r\n<br>\r\nAs you expected, the man seems unsurprised. He flashes a business card at you, but it is so fast that you don't have a chance to actually read it before the man goes on. <br>\r\n<br>\r\n\"I am Mr. Hyde, and my associate here is Jones. Please, come with us.\"<br>\r\n<br>\r\nYou are not sure you trust these men. </span></div></div>",
            "created":1418706000,
            "id":1903658,
            "title":"Two men approach you"
        },
        "11123":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Run. ",
                "Stay put. "
            ],
            "content":"<div class=\"\"><div> <span>You paid attention to those 'stranger danger' videos, and you can tell when it's time to duck out of a bad place. You spin around on your heel and shoot off in the opposite direction. When you've gone far enough to feel safe glancing behind yourself, you learn that they don't seem to be following you any longer. You whip around a corner and lean against the wall, breathing heavily. <br>\r\n<br>\r\nYou have time to catch your breath before you hear footsteps approaching you. How do you you respond?</span></div></div>",
            "created":1424495520,
            "id":1937732,
            "title":"Run. "
        },
        "111232":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Go with her. ",
                "Talk back. "
            ],
            "content":"<div class=\"\"><div> <span>You are reasonably sure that the men couldn't have followed you this far. And anyway, you are tired of running  you decide to wait and see what happens. <br>\r\n<br>\r\nA figure rounds the corner. It takes you a monument to process, but this person is not one of the men you saw earlier. She is a blonde woman in a sharp black suit with a pair of angular glasses pushed up the bridge of her nose. She looks at you in a way that seems almost disinterested when she speaks to you. <br>\r\n<br>\r\n\"Mr. Allen. That was quite interesting, but the time for games is over. Please come with me.\"<br>\r\n<br>\r\nYou are starting to become irritated. </span></div></div>",
            "created":1424496120,
            "id":1937735,
            "title":"Stay put. "
        },
        "1112322":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Leave. ",
                "Go with her. "
            ],
            "content":"<div class=\"\"><div> <span>You decide to be forthright with this woman. <br>\r\n<br>\r\n\"I don't know who you are, but I am not going with some stranger who showed up out of nowhere.\"<br>\r\n<br>\r\nYou think you see the hint of a smile tugging at her lips. <br>\r\n<br>\r\n\"I am Lythia. There will be people chasing after you soon. You will be safer with me than without.\"<br>\r\n<br>\r\nYou are not convinced. <br>\r\n<br>\r\n\"From where I am standing, you look awfully sketchy. So uh, I'd rather leave now, if it's all the same to you.\"<br>\r\n<br>\r\nYou're half prepared for Lythia to pull out a knife, but instead she steps to the side. <br>\r\n<br>\r\n\"If that is your decision, I will not argue. Still, by this time tomorrow, you may well wish you had come with me.\"<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1424496780,
            "id":1937736,
            "title":"Talk back. "
        },
        "112":{
            "author_id":"moutaineer",
            "author_name":"HungryWolf",
            "choices":[
                "Large Grey Wolf",
                "Large Black Wolf",
                "Large White Wolf"
            ],
            "content":"<div class=\"\"><div> <span>Your secret origion that you had never even thought about it is a thought to be exstinct species of Wolf that grows till they are as big as a horse! You never even gave it a thought till earlier this morning: You went through your origanal daily order of takinga shower eating a quick breakfast and driving to your School of torture. How you hated school could be compared with you being gifted a Volkswagon Bug wile your younger brother got a convertible  Corvet. And he wouldnt even be able to drive! Thats the hatred you expierienced. But since you really wanted a good collage you kept yourself up all night for extra credit crap. <br>\r\nAfter your day of torture as you were driving home, you saw a nice looking completly black van a few cars behind you. You foolishly made it no attention but went along and pulled into the driveway of your parents condo.<br>\r\n\"Mom! Dad! im home!\"you souted at the walls. no answer. You walked in the kitchen to grab a snack and noticed a strange not on the island. \"Hi honey. went for groeceories be back soon love you.\" You read a loud. Hmmmpphh mom never talks that way...Or leave notes for that matter. But you headed this secound warning no attentioneither and proceeded to play call of duty instead. After mowing down zombies for a few minutes there was a hard nock on the door. \"Yeah? who is it?\" you shouted engulfed in your game.<br>\r\n\"Goverment officails!\" the gruff voice shouted. \"Now open this damn door!!\" <br>\r\nNow they had your attention. You quickly run to the door and yank it open to be met with the barrel of a shotgun. \"Y-yes h-how can i help you officor?\" you mumble to the shotgun.<br>\r\n\"You can stick your hands in the air and walk to the chair.\" he replied. You were all to ready to obey the gruff voice. Once he and several others where in the room surrounding you, a couple sniggering at your high score. \"Why are you guys here?\" you ask friendly enough. \"We came here looking for a Myth ya seen one?\" the same gruff voice asked.<br>\r\n\"Whats a Myth? you mean like centaurs and medusas? or dragon type Myths?\"<br>\r\n\"Stop playing with us!\"Another shouted.<br>\r\n\"Honestly i dont know!\" You pleaded.<br>\r\n\"Fine. They are mythica animals that can look like humans but can change on there own thoughts.\"<br>\r\nyou chuckle slightly. \"Sounds pretty stupid to me.\" you chuckle to the room.<br>\r\n\"Fine pretty boy.\"Another said from the doorway.\"But this meter says your what we want.\"<br>\r\n\"What!?\" you exclaim. \"I cant turn into anything!\" But the room refuses to believe you.<br>\r\n\"Sure pretty boy, sure. We all believe you. right boys?\" said the man in the door.<br>\r\nthey all mumble there assent but with a certian sarcastic tone. \"To prove it we will let you get back to what you were doing and forget all about this. OK?\"<br>\r\n\"OK.\" you mumble watching his every move.<br>\r\nthey left soon after without a word. Leaving you with thoughts of what you actually are...</span></div></div>",
            "created":1327294800,
            "id":1263900,
            "title":"Big Bad Determinded Wolf"
        },
        "12":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Werewolf.",
                "[Write & I will rename]",
                "[Write & I will rename]",
                "[Write & I will rename]",
                "More."
            ],
            "content":"<div class=\"\"><div> <span>Name: Donald Mason<br>\r\nGender: Male<br>\r\nAge: 17<br>\r\nSpecial Skills: Computer savvy<br>\r\nHistory:<br>\r\nDonald is what some would call invisible. He rarely speaks to people he doesn’t know and he isn‘t one to draw attention to him self. However to his few friends he completely flips and he is a good friend to have. He doesn’t think to highly of him self, even when positive things are said of him. <br>\r\n<br>\r\nInterests: Video Games, Animals.<br>\r\nFears: Snakes.<br>\r\n<br>\r\nNow, what is his ancestry? </span></div></div>",
            "created":1312088400,
            "id":1158434,
            "title":"Donald Mason"
        },
        "121":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A van pulls up and people try to take you.",
                "Two strangers walk up to you.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>You walk home just lost in deep thought. Your friends weren’t available so you really had little to do. You recall the stories that your Grandpa told you about your family having lycanthropy in there blood line. However you really didn’t believe it. If you were a Werewolf then you would have known by now. You decide to walk though the park when…</span></div></div>",
            "created":1312088400,
            "id":1158443,
            "title":"Werewolf."
        },
        "1211":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "They get you.",
                "Something happens."
            ],
            "content":"<div class=\"\"><div> <span>You see a Black van stop near you and two men come out. They try to grab you but you slip away and start  running. “What did I do?” you think as you try to lose them. You push yourself as hard as you can as you keep on running trying to create as much distance as you can. However you soon run out of energy and you quickly try to hide under the bridge. You then hear foot steps above you. “You think you can hide from us you stupid myth.” one of the men says. Then…</span></div></div>",
            "created":1312088400,
            "id":1158451,
            "title":"A van pulls up and people try to take you."
        },
        "12111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "You are strapped to a chair.",
                "other."
            ],
            "content":"<div class=\"\"><div> <span>“<i>Why did he call me a myth</i>?” you wonder. You see one of the men come under after you. You try to kick him but he grabs your foot and he pushes you to your back. He then grabs a needle and sticks it in your arm. You try getting up but you feel as if all your energy has been sucked out of you. You try to get up but you soon black out with a thud. You wake up and you then see…</span></div></div>",
            "created":1312088400,
            "id":1158454,
            "title":"They get you."
        },
        "121111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Something blocks your escape and the only way out is up.",
                "You both get out."
            ],
            "content":"<div class=\"\"><div> <span>When you open your eyes and you see your in a dark room. You try to move but you are being restrained by leather straps. “Hello.” you hear a voice in the darkness “Is anybody there?” “H-hello?” you say feeling a bit afraid. “Who’s there?” you here the voice say sounding very alert. “M-my name is Donald.” you reply “Who are you?” “I am Scott. Where are we?” the voice asks you. “I-I don’t know.” you replied still felling scared “I was captured and brought here.” “Really.” you hear him say followed by the sound of struggling “Me too.” Just then you see some lights come on and you see two men step in. The men look at the two of you in disgust. \"You myths are greedy and vicious creatures aren't you?\" One of the men snarls at the two of you. \"What are you talking about?\" you ask. \"What do you mean?\" Scott asks continuing to struggle and weaken his restraints. \"Don't play dumb with us!\" one of the men shouts. \"We know what you both are.\" the other man says. \"There must be a mistake. We're human,\" you reply. \"We have no clue what’s going on,\" Scott says. \"You really don't know?\" one of the men said evilly. You then see Scott brake out of his restraints and started to help you out of your’s. \"What do you think your doing your little brat!\" one of the men shouts running at Scott. Scott then stopped trying to free you for a moment and sucker punches him as he came at him causing the man to fall to the floor. You manage to get the rest of the way out of your restraints and you grab a cattle prod that was hanging on the wall. \"We have to get out of this mad hole.\" Scott says getting into a fighting stance. \"You don't have to tell me twice,\" you reply holding the cattle prod up. The man looks at the two of you scared. Then…</span></div></div>",
            "created":1312174800,
            "id":1159113,
            "title":"You are strapped to a chair."
        },
        "1211111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A room with a wounded scientist",
                "You make it to the roof."
            ],
            "content":"<div class=\"\"><div> <span>The man then runs out of the room in fear. “Come on we have to go.” Scott says to you as the two of you run out of the room. As you run down the hall you hear all the intercoms saying “Warning power overload. Warning power overload.” Then an explosion goes off sending you and Scott into a wall and you see the roof collapsing at the end of the hall blocking your escape route. “We are going to have to go to the roof.” you say. You both run up the nearby stairs. Then…<br>\r\n</span></div></div>",
            "created":1312174800,
            "id":1159464,
            "title":"Overload."
        },
        "12111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "The explanation.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>You and Scott make it up the stairs and you see a room that has been badly damaged. By the looks of it several explosions have gone off in here. You also notice a badly wounded scientist and a unharmed computer. “I will tend to the scientists wounds.” Scott says as grabs a first aid kit off of a table. “I will see if I can find out where we are on that computer.” you say as you make your way to the computer. As you try breaking in to the computer, you can here the scientist trying his best to get away from Scott. Soon your into the computer and you try to get an idea of where your at using GPS. You don’t find any thing to useful except that the nearest town is west about 40 miles away. You look back and you notice that Scott has gotten the scientist’s arm into a make shift sling. “That should help.” Scott says. \"You pathetic myths.\" The scientist says. \"Stop calling me that!\" Scott yelled at him, \"We don't know what is going on. Can you please tell us.\" The scientist just looked at Scott and then at you. \"You both don't know what you are?\" the scientist asks. Both you and Scott just nodded. \"Well ok I will tell you.\" he said \"Call your friend over.\" \"Hey Donald,\" Scott calls out \"This scientist is going to give us an explanation.\"</span></div></div>",
            "created":1312174800,
            "id":1159567,
            "title":"A room with a wounded scientist"
        },
        "121111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>“So have you heard any stories from your grandparents?” the scientist asks you and Scott. You immediately thought back to your grandpa. He said that you had lycanthropy in your blood. “Are you serious” you mumble to your self. “Well your are both mythical creatures.” the scientist says. “Let me guess.” Scott says “I am a griffin.” the scientist nods. “Am I a werewolf?” You ask. The scientist nods again. “Do you both know the stereotypes for your creatures?” the scientist asks. You think back to every werewolf cliché you could think of. They where a humanoid wolf like creature and they are blood thirsty and rip apart any thing in there path.  “Oh man that’s bad.” you think to yourself “What if I can’t control myself when I’m transformed. I can’t live with myself knowing I killed someone.” “Yep you myths are savage creatures.” the scientist says evilly. Then…</span></div></div>",
            "created":1312261200,
            "id":1159835,
            "title":"The explanation."
        },
        "1211111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "Yes, you are still in control.",
                "No, you don’t have any control."
            ],
            "content":"<div class=\"\"><div> <span>You then had a thought as you point your finger to the air. “Ok so if I’m a werewolf, riddle me this.” you say “Wouldn’t the full moon force trigger the transformation?” “Ha ha, Yes it would.” the scientist chuckles “Man you sure are a stupid myth I’ll give you that.” “I believe I’m not the fool here doc, you are.” you say to him “If I am a savage creature like you said, then I would wake up with blood on my hands after every full moon.” “W-well… that’s irrelevant!” the scientist shouts. “Oh is it really.” you say “Then how about a demonstration.” Scott looks at you with confusion and the scientist looks at you in fear. “Scott you know first aid.” you ask him “Do you know the body’s weak points?” “I know some of them why?” Scott asks. You hand him the cattle prod. “Take this and stand back.” you say “If I show sign’s of savage behave your I want you to stop me.” “No you can’t possibly be thinking?” the scientist says in fear. You focus your thoughts on a werewolf form and you notice your body is starting to be immersed in a dark blue flame. “Well doc let’s see if your words have any truth.” you say as you are completely emerged. The flames vanish and you can see that you are now a werewolf, but do you have control?</span></div></div>",
            "created":1312261200,
            "id":1159839,
            "title":"Your theory"
        },
        "12111111111":{
            "author_id":"aurawolf",
            "author_name":"AuraWolf",
            "choices":[
                "A nearby door is breached and some commandos come in",
                "“We have to get out of here.”"
            ],
            "content":"<div class=\"\"><div> <span>“You still there Donald?” Scott asks having the cattle prod ready. You glance at your body getting an idea of how you look. “Get away for me you beast!” the scientist shouts backing up. “Yes I am still here.” you say calmly Ignoring what the scientist said. \"This is scientist Jason Smith.\" You look and you see the scientist is saying something into a phone \"I am requesting that the Silver Nobles be called in.\" \"What are you doing!\" Scott says while grabbing  the phone away from him. \"I am calling in the Silver Nobles to tame this beast.\" the scientist replied glaring at you. “Well that was cold” you think. \"Who are the Silver Nobles?\" you ask as you walk towards the scientist “A special task group of commandos” the scientist says looking down. Your ear’s twitch as you hear something coming. Then…</span></div></div>",
            "created":1312434000,
            "id":1161105,
            "title":"Yes, you are still in control."
        },
        "12111111112":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Scott is able to restrain you. ",
                "You overpower Scott and get away. "
            ],
            "content":"<div class=\"\"><div> <span>You realized you were taking a gamble of course, but you liked your odd. And besides, you trusted Scott to handle things if they got out of hand. You were unable to move for a moment, as your thoughts raced wildly. You had transformed into a werewolf, and it seemed as if the world changed along with you. You could distinctly smell the twinfigures in front of you, and you could pick up on the danger in the air as if it were electricity. You turned your attention to the scientist, and slowly began to process that fact this scientist is your <i>enemy</i>. He was working with the people who had captured you and trapped you. He couldn't be trusted!<br>\r\n<br>\r\nEvery instinct in your body told you that this scientist was a threat, and as you regained the ability to move normally, you realized that you would have to fight him in order to get out of here. You were bigger than him now, you were sure you could take him out. And so you lunged for him. You pinned him to the ground and raised a massive paw above him when you felt a sharp pain in your leg. You snarled and spun around to see that Scott had prodded you. He shouted something, but you could tell what it was. You decided that was just as well. If he was going to attack you, then you would just have to leave him behind. You had to get out of here, and you weren't going to let anyone stop you. You made a dash for the door and Scott through himself into your path. It seemed you would have to fight past him. </span></div></div>",
            "created":1418953680,
            "id":1904515,
            "title":"No, you don’t have any control."
        },
        "121111111122":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "Several men appear and capture you, holding you until you change back. ",
                "You escape into the city. "
            ],
            "content":"<div class=\"\"><div> <span>Scott's prod is painful, but you are bigger and stronger than he is and you know it. One strike with your paws is enough to leave three deep scratches across his chest, and a second strike throws him across the room. You run out of the room, and drop to all fours as you race through the hallways. You don't know if Scott will be okay, and right now, you don't care. Your only thought is getting out of this maze of a building. </span></div></div>",
            "created":1418953980,
            "id":1904519,
            "title":"You overpower Scott and get away. "
        },
        "1211111111221":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "He claims that Scott is dead. ",
                "He claims that Scott has been captured. "
            ],
            "content":"<div class=\"\"><div> <span>You round a corner, still running at top speed. You've found yourself in a long hallway with many doors, and you cover the distance easily enough. However, when you're nearly at the end of the hallway, four men step out from around the corner. They all leap at you at once, two of them on your back and one on either side. You snap at the one on your right, wounding him seriously before you feel a sharp pinch between your shoulders and everything goes black. <br>\r\n<br>\r\nWhen you wake up, you have returned to your human form. You've been moved to a different room than before, and you are now behind some steel bars, as if you are in a cell. There is dried blood on your hands and under your nails. You remember rhat you attacked Scott, and start to feel panic rising in your chest. You get up and grasp the bars to lean out and get a look at what is beyond them, but you gasp and jump back when you realize they are electrified. <br>\r\n<br>\r\nIt is some time later when a figure appears outside your cell. When he starts to speak, you realize he is the scientist from earlier, and a nasty bruise has formed around his eye. His arm is in a sling, but all things considered, he seems to have made it out all right. He speaks before you do. <br>\r\n<br>\r\n\"I told you, didn't I, myth? Your kind is violent and savage. You would even turn on your own ally.\"<br>\r\n<br>\r\nThat gets you to lean forward and respond. \"Scott! Where is he?\"<br>\r\n<br>\r\nThe scientist smiles maliciously. </span></div></div>",
            "created":1418956380,
            "id":1904529,
            "title":"Several men appear and capture you, holding you..."
        },
        "12111112":{
            "author_id":"coremist",
            "author_name":"Core",
            "choices":[
                "You were right, and you can safely climb down the fire escape. ",
                "You were wrong, and the roof collapses underneath you. "
            ],
            "content":"<div class=\"\"><div> <span>The two of you scramble up the stairs, racing against the collapsing building. You make it to the roof, but it's clear the building, overall, in very bad shape. You aren't actually sure how long the roof will hold. Scott looks down at the ground below, the city just as you left it, and turns to face you. <br>\r\n<br>\r\n\"So what was the plan again?\" Scott poses a rather good question to you. In response, you point to an area of the roof that hasn't shown any structural damage. Then you explain. <br>\r\n<br>\r\n\"If the problems were caused by a computer overload, the only the area that housed the computer will be in any danger. If we stay over there, we should be safe.\" Though you manage to speak as if you know what you're doing, you aren't actually all that sure. If the structure of the building is damaged enough, it will all come down. Still, it's the only plan you've got. </span></div></div>",
            "created":1418952840,
            "id":1904512,
            "title":"You make it to the roof."
        },
        "13":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Minotaur",
                " [Write & I will rename]",
                " [Write & I will rename]",
                " [Write & I will rename]",
                " [Write & I will rename]"
            ],
            "content":"<div class=\"\"><div> <span>Name: Stephen Williams<br>\r\nGender: Male<br>\r\nAge: 17<br>\r\nSpecial Skills: Paintball Expert<br>\r\nHistory: Even though he lacks friends, he bounds to make new ones. Hot headed at times he can be a handful when he looses his temper, maybe this is why he lacks friends, perhapse he needs one to keep his temper in check.<br>\r\n<br>\r\nInterests: Video games, music, animals<br>\r\nFears: High places<br>\r\n<br>\r\nNow, what is his ancestry?</span></div></div>",
            "created":1312088400,
            "id":1158804,
            "title":"Stephen Williams"
        },
        "131":{
            "author_id":"bufflover",
            "author_name":"Jurrasic Pursuit",
            "choices":[
                "A van pulls up and people try to grab you.",
                "You are drawn into an alley by a voice.",
                "Your clothes begin to get tighter and tighter and tighter."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walk down the road to your house. Your Grandad said you had the blood and DNA of a Bull in you but you never belived him .He said you could grow up to 20 ft tall, resist bullets and knives and crush cars wirh your bare hands.  Suddenly...</span></div></span></div>",
            "created":1354338000,
            "id":1479395,
            "title":"Minotaur"
        },
        "1311":{
            "author_id":"labcoat",
            "author_name":"Commodore Ryan",
            "choices":[
                "Talk to Granddad, see if he knows anything about what happened",
                "Go to bed and shrug it off",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The conversation this morning dominated your thoughts all day, distracting you from your classes, but you still couldn't get what he mentioned out of your head. Your grandfather was old and probably senile, so he probably had no idea what he was even saying. A minotaur, really? How is that even possible? You weren't Greek, your father wasn't a bull, and most importantly: minotaurs don't exist. Still, you couldn't help but wonder why you kept ruminating over this nonsense conversation so much. <br>\r\n<br>\r\nYou had been walking back from classes, and without practice to go to or friends to hang out with, you only real course of action was to head back home. Something in the corner of your eye knocked you from your thoughts: a large, black van, which you realized had been following you since you left the high school. It was so stereotypical it was almost funny. The van suddenly swerved, rapidly making a u-turn into the parking lot you were walking through, causing its tires to squeal and numerous honks from nearby drivers. The van's driver didn't seem to care, though, as it continued barreling towards you. You take this opportunity to book it; you have no idea why the wannabe CIA is chasing you, and you honestly don't want to find out. <br>\r\n<br>\r\nAs you run into a nearby alleyway, you hear the van come to a screeching halt, and quickly look behind you. Four people with heavy gear and weapons you don't recognize jump out of the van, clearly intent on pursuing you. As you face forward, you hear one of your hunters shout \"don't let him get away!\" and you attempt to pick up your pace, hoping to have enough of a lead to lose them somewhere along the line. They wouldn't want to reveal themselves by chasing a poor, innocent teen through a shopping district, right?<br>\r\n<br>\r\nApparently not. As you make your way out of the alleyways, you hurriedly turn into the first store you see, diving underneath the front windowpane and praying you are out of sight. <br>\r\n<br>\r\nThe shopkeeper gives you a quizzical look and starts to ask what you are doing, before noticing the armed men running past the large display window. He pauses, then gestures his head back, signaling you to head into the store's back room. You just barely make it inside and manage to close the door before one of the faux Secret Service members starts interrogating the shopkeeper. You place your ear to the door and try to listen in. <br>\r\n<br>\r\n\"Hey there, welcome to -\" smirking, the shopkeeper sarcastically tries to introduce the store with his usual sales pitch before being interrupted. <br>\r\n\"Have you seen a teenager running through here? Male, young adult, Caucasian, short brown hair, wearing high school dress code: a gray polo, and black dress pants.\" The agent's voice was completely monotone, but still imposing and demanding.<br>\r\n\"That might just be the most generic description I've ever heard. You pro'ly just described half the kids in town. Do ya mind being a little more descriptive? Was he armed? 'Cause you clearly are.\" The shopkeeper continues smirking, his tone still deadpan, but a touch more serious. <br>\r\n\"Sir, if you aren't willing to cooperate-\"<br>\r\n\"You'll what? Arrest me? Who are you working with anyway? I don't see a badge, and I highly doubt you have a warrant.\" The store owner's face changed completely: he was now glaring at the agent and spoke sharply. The agent deeply inhaled and quickly exhaled through his nostrils. Realizing that the owner wasn't willing to be agreeable, he decided arguing with the old man would be completely fruitless. <br>\r\n\"Thank you, sir. I'll be on my way,\" he said acerbically, clearly unsatisfied with the encounter.<br>\r\n<br>\r\n\"You're clear, kid,\" he whispered, keeping his eyes on the agent the entire time as he left the shop. Crawling out of the backroom, the owner looked at you with a scrutinizing glare, as you did the same, finally taking in the chance to observe where you ended up. The shopkeeper was an older man, likely in his mid-fifties, tall as well as muscular, he looked like he was more fitting in the army than running a store. Looking around, you finally notice that you were in a glass and pottery store, and are somewhat surprised nothing was damaged in the whole ordeal. \"You know what he was doing?\" You turn your attention back towards the shopkeeper, vehemently shaking your head side-to-side. \"Ya lyin' to me?\" You continue shaking your head. He sighs, then begins talking again. \"I ain't a fan of teenagers, but I'm even less a fan of the feds, and he looked way too dangerous to be chasing some kid around.\" You breathe a sigh of relief. He begins to walk out of the back of the store and mentions to you that it'd probably be safer to wait here for a while, until they've completely cleared out, before going back to tend the wares.<br>\r\n<br>\r\nAfter waiting a few hours, you finally figure it's safe enough to head home. Before you leave the store, you grab a business card, which reads: \"The Kiln. Handmade glassware and pottery. Hector T., owner.\" You stick it in your wallet before quickly sprinting through the shopping district towards your house, carefully watching to see if you're being followed again.<br>\r\n<br>\r\nYou finally arrive back at home, exhausted and confused, and decide to...</span></div></div>",
            "created":1463721660,
            "id":2150856,
            "title":"Half-bull in a pottery shop"
        },
        "13111":{
            "author_id":"labcoat",
            "author_name":"Commodore Ryan",
            "choices":[
                "Plop down on your bed, it's been that kind of day",
                "Examine the brass ring"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Granddad, are you still up?\" you whispered, knocking gently on his door. \"Something happened and I think you might know what's going on.\" You felt vulnerable, and you hated it. You were an athlete, and a good one at that; fast, a bit strong, and a good aim. There was no reason you should ever feel weak. Yet here you were, waiting outside your grandfather's room, after nearly having been hunted down with no explanation, having the slight notion that his ridiculous story might actually be true. <br>\r\n\"I am, Stephen. What's the issue?\" You sigh. On one hand, you have absolutely no idea how to explain what happened to you without it sounding completely absurd. On the other, it's your grandfather who mentioned the whole minotaur thing, so there's a vague hope has some insight into what happened.<br>\r\nYou slowly open the door and look around. It's not a large bedroom by any means, but it's sizeable enough. Granddad is sitting on his bed, a book on his lap he was reading with the light from the lamp on the nightstand. You take a deep breath and explain everything that happened. Watching his face as you describe your ordeal, you notice his expression quickly change from puzzlement to dread. You hear him curse under his breath before looking up at you, a look of pity in his eyes. <br>\r\n\"I'm so, so sorry Stephen. I was hoping you might be able to avoid all this, but I guess I was wrong.\" The confused look on your face told Granddad how little you knew.<br>\r\n<br>\r\n\"A long, long time ago, our family was cursed. Every few generations, the firstborn son would be not fully a man, also an animal, specifically a bull.\" You stand there completely dazed. You're hearing what he's saying, but you're not quite comprehending it. Curses? Bull men? This goes against every single thing you know about reality. \"That's why I'm not, but I know so much about it. My brother Simon, your grand-uncle was. I saw him change, I saw what he could do, and it was incredible.\"  You listen but are more concerned with who the stranger-danger posse in the black van was. \"The Knights. They fancy themselves as dragon slayers, making their goal to completely eradicate any monster that looks like a man.\" He emphasizes the last part oddly, obviously mocking their mantra. \"They weren't all that scary when I was younger and helping my brother, but I guess they must've been able to commandeer modern technology into their hunting regime.\" He pauses, sighing wistfully and shaking his head softly before continuing. \"That's how Simon died. Not a car accident, but the Knights finally finding him.\" He looks as if he as more to say, but is unable to speak the words. You let the silence linger for a bit, giving your grandfather a moment to collect himself.<br>\r\n<br>\r\nAfter a while, you mention that while this all sounds awful, being hunted for your life for something you had no choice over, but are confused because earlier he sounded so enthusiastic about it. \"Because part of it is! You can do astounding things, amazing feats of strength and power.\" He was almost awestruck, obviously recalling what he had seen years ago. \"But I didn't know the Knights were even more dangerous. I had hoped that they just...went away. Gave up and moved on with their lives or some such nonsense.\" You roll your eyes. That was naive, and honestly a bit stupid of him. <br>\r\n<br>\r\n\"Here, I guess it's time for me to give you this, then.\" He says, tossing the blankets off his lap and getting up to look in the nightstand drawer. Shuffling around a bit, he pulls out a small, partially transparent bag, within which you can see a small brass ring. \"It'll help you control your powers, letting you decide when to change. I'm not quite sure how it works, unfortunately,\" he mentions, placing the small bag in your hands, clasping his own around yours. \"Listen to me,\" his voice completely serious. \"These people want nothing more to see you dead and your head over their fireplace, but I believe - no, I know - that you have the strength, the power, to destroy any enemy that comes in your path.\" You nod as he takes his hands away, utterly unsure of how to respond. <br>\r\n<br>\r\nAs you head to your room down the hall, you...</span></div></div>",
            "created":1463722620,
            "id":2150858,
            "title":"History Lesson"
        },
        "132":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Before we begin, this version of Stephen Williams is not only 19 years old, but he and his 2 brothers, Andrew and Alex are Identical triplets and sole heirs to the Hydra bottling company, famous for the sports drink of the same name. The three brothers always got along, they never fought and always helped each other even in the toughest of times. The one thing they do not know is Hydra isn't just the company name, but it's what they are but kept secret by their parents.<br>\r\n<br>\r\nIn other words, they have the ability to merge and transform into a hydra, a dragon-like creature with three heads.</span></div></div>",
            "created":1333170000,
            "id":1307047,
            "title":" [Write & I will rename]"
        },
        "1321":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Gassed and ended up in some secret base",
                "Home safely"
            ],
            "content":"<div class=\"\"><div> <span>It's take your sons to work day over at Hydra bottling. With me and my brothers Alex and Andrew graduated college, Dad along with Uncle Martin and Billy are in the private theater watching our entry for the Super Bowl commercials. It features a runner, training for the olympics running down the street and into the park, where a bottle of our famous Hydra sports drink, when he takes a swig he slowly transforms and in the end, a hydra slams down the bottle where the caption says Hydra sports drink, it's powerfully refreshing. As the lights came back on, Dad, uncle Martin and uncle Billy were discussing the commerical.<br>\r\n<br>\r\nDad: \"What do you think, shall we use it?\"<br>\r\n<br>\r\nMartin: \"I don't know, it could scare the children.\"<br>\r\n<br>\r\nBilly: \"Maybe we should, it's costed $34,000,000,000.00 just to make it just for the special effects.\"<br>\r\n<br>\r\nMartin: (shrugs) \"Fine let's use it.\"<br>\r\n<br>\r\nDad: \"Boys, soon all this will be yours,  we're a growing company so make sure that you will continue running the family business.\"<br>\r\n<br>\r\nAlex: \"Wow, all this is ours?\"<br>\r\n<br>\r\nAndrew: \"I have some flavor ideas.\"<br>\r\n<br>\r\nYou: \"This is well worth the 4 years in college.\"<br>\r\n<br>\r\nWe all toured the building greeting all of the employees and watch the assembly line making the products, and had a sensible lunch.  At 3:00 we went to the parking lot where the company car is waiting for me, Alex and Andrew. <br>\r\n<br>\r\nDad: \"Glad you could make it to work, I'll see you all later.\"<br>\r\n<br>\r\nAlex, Andrew and I went into the car and we ended up.,,</span></div></div>",
            "created":1333342800,
            "id":1307727,
            "title":"The Williams trio"
        },
        "13211":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "The man explains about the Silver Knights",
                "He doesn't have a clue"
            ],
            "content":"<div class=\"\"><div> <span>As the car pulls out, Andrew was discussing flavor ideas to Alex and I.<br>\r\n<br>\r\nAlex: \"Bubblegum? Oh come on Andrew. Do you really think they would drink a bubblegum flavored sports drink?\"<br>\r\n<br>\r\nAndrew \"Okay, forget bubblegum. I believe cherry flavored is better.\"<br>\r\n<br>\r\nYou: \"A lot better flavor I believe but...\"<br>\r\n<br>\r\nI look out the window and see something is wrong.<br>\r\n<br>\r\nAlex: \"What's wrong Steve?\"<br>\r\n<br>\r\nYou: \"This is not the way home. Where are we going?\"<br>\r\n<br>\r\nAlex and Andrew just shrugs.<br>\r\n<br>\r\nI knocked on the driver's window \"Hey! this isn't the way home!\"<br>\r\n<br>\r\nNo response from the driver but somehow you feel drowsy, you noticed green gas coming in from the vents and pretty soon Alex fell asleep, then Andrew and you began to fall asleep \"What is going...(yawn) on?\"<br>\r\n<br>\r\nYou woke up and you find yourself strapped to a chair with your two brothers on each side in the same situation. A man in a uniform in front of you.<br>\r\n<br>\r\nMan: \"Well well, glad you three is finally awake, now you better talk.\"<br>\r\n<br>\r\nYou: \"Okey, who hired you? PepsiCo? Coca Cola? or some other company with a sports drink?\"<br>\r\n<br>\r\nMan: \"What makes you think I was hired by them?\"<br>\r\n<br>\r\nAlex: \"Spies from competitors are always after the secret ingrediant in our sports drink.\"<br>\r\n<br>\r\nAndrew: \"We are not telling you what the secret ingrediant is.\"<br>\r\n<br>\r\nMan: \"Listen up myth, I'm not interested in your sports drink or whatever secret ingrediant it has. Only you three.\"<br>\r\n<br>\r\nAll three of you: \"Myth?\"<br>\r\n<br>\r\nMan: \"You three are the the most dangrous myth on record, a Hydra.\"<br>\r\n<br>\r\nYou: \"A Hydra?\"<br>\r\n<br>\r\nAll three of you laugh.<br>\r\n<br>\r\nAlex: \"Oh come on. Because it's the company name, do you think we're a hydra?\"<br>\r\n<br>\r\nAndrew: \"What make you think of making such a rediculous accusation?\"</span></div></div>",
            "created":1333342800,
            "id":1308267,
            "title":"Gassed and ended up in some secret base"
        },
        "132111":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "You won",
                "You lost"
            ],
            "content":"<div class=\"\"><div> <span>Man: \"You dare question the Silver Knights?\"<br>\r\n<br>\r\nYou: \"What are the Silver Knights?\"<br>\r\n<br>\r\nMan: \"We are an elete milatant group, our sworn duty is to hunt down and exterminate disgusting myths like you three.\"<br>\r\n<br>\r\nAlex: \"You said hunt down and exterminate?\"<br>\r\n<br>\r\nAndrew: \"Your going to kill us, what did we ever do to you?\"<br>\r\n<br>\r\nMan: \"You were born.\"<br>\r\n<br>\r\nAn officer of the higher rank came in \"Corporal Marras, why arn't these three in seperate cells?\"<br>\r\n<br>\r\nMarras: \"Sir?\"<br>\r\n<br>\r\nOfficer: \"Do you have any idea what happens if these three touch each other?\"<br>\r\n<br>\r\nMarras releases Alex and Andrew, and begins to lead them out of the cell only both of them touch you, with strange results.<br>\r\n<br>\r\nOfficer \"You idiot! You made them touch each other. Now we're in trouble?\"<br>\r\n<br>\r\nAlex and Andrew starts to merge with you. their bodies entering yours rusulting the 3 of you looking like a 3 headed man, but it doesn't end there. Your now massive body begins to grow and scales start to show.<br>\r\n<br>\r\nYou(middle head) \"What is happening to us?\"<br>\r\n<br>\r\nAlll three necks start to stretch out. Your hands begin to transform into repillian paws as well as your legs.<br>\r\n<br>\r\nAlex:(left head): \"I believe we're transforming.\"<br>\r\n<br>\r\nAndrew(right head): \"Into a Hydra.\"<br>\r\n<br>\r\nMarris and the Officer leaves the cell sense your body is almost as big as the cell.<br>\r\n<br>\r\nYour heads transform, your teeth becomes razor sharp fangs, your ears shrink to nearly nothing as your mouth and noses transform into repillian muzzles, horns grow from your heads. <br>\r\n<br>\r\nOfficer \"Now look what you did Marris, now we got a Hydra to deal with.\"<br>\r\n<br>\r\nThe officer hits the alarm switch, soon the area is filled with soldiers.<br>\r\n<br>\r\nYou(middle head): \"Shall we take these guys down?\"<br>\r\n<br>\r\nBoth Alex and Andew's head looks at you \"Let's do it!\" They said smiling.<br>\r\n<br>\r\n</span></div></div>",
            "created":1333515600,
            "id":1309554,
            "title":"Silver Knights"
        },
        "1321112":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "ARE STILL ALIVE!!?",
                "are all dead"
            ],
            "content":"<div class=\"\"><div> <span>The Silver Knight soldiers almost 2 dozen of them surround us each of them armed with some serious firepower.<br>\r\n<br>\r\nOfficer: Make a move, we dare you.<br>\r\n<br>\r\nAndrew: I bet one stream of our firebreath, and these guys with go up like matchsticks.<br>\r\n<br>\r\nAlex: We are not a dragon Andrew, more of a giant serpant, but if we're truly are the Lernaean Hydra we have an attack that could be equilly effective.<br>\r\n<br>\r\nYou: What is it.<br>\r\n<br>\r\nAlex: Just follow my lead.<br>\r\n<br>\r\nAlex starts breathing out a yellow gas, you and Andrew follow suit. the combined gas soon fills the room which soon overcame the sodiers, you hear the comms saying, \"Warning power overload. Warning power overload.\" Then there was a series pf explosions nearby.<br>\r\n<br>\r\nAndew: We must've shorted out the bases filtration system, what did we breath out?<br>\r\n<br>\r\nAlex: Poisoned breath<br>\r\n<br>\r\nYou: I kind of feel sorry for the Silver Knight.<br>\r\n<br>\r\nAlex: They are trying to kill us and you feel sorry for them?<br>\r\n<br>\r\nAndrew: Better them then us.<br>\r\n<br>\r\nStephen: Never mind then, what else can we do.<br>\r\n<br>\r\nAndrew: I heard if you lob off a Hydra's head, two more will grow back.<br>\r\n<br>\r\nAlex: Let's not try that, at least not tonight, soon as the gas is gone, let's just blow this popstand.<br>\r\n<br>\r\nYou and Andrew: Agreed.<br>\r\n<br>\r\nSoon the poisoned gas wears out and they find the Silver Knight soldiers...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1341637200,
            "id":1373458,
            "title":"Gassed up ready to go"
        },
        "13211121":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "Rescued at the last minute",
                "You all die"
            ],
            "content":"<div class=\"\"><div> <span>Soon the poisoned gas wears out and they find the Silver Knight soldiers are still alive, and wearing resporators.<br>\r\n<br>\r\nSoldier 1: Do you really think we fall for that? Nice try, but we're prepared for all your tricks.<br>\r\n<br>\r\nOfficer: You are more trouble then your worth, it's about time we get rid of you. Perminently.<br>\r\n<br>\r\nSoldier 2:(swings his sword around) I say, off with his heads!<br>\r\n<br>\r\nOfficer: Really? Haven't you ever read the 12 labors of Hercules? Chop one and two more witll grow back.<br>\r\n<br>\r\nSoldier 1: I have an idea, he'll make a good guinea pig for that experimental machine we have in the dungeon.<br>\r\n<br>\r\nOfficer: Oh yeah, the thriple death. Men?<br>\r\n<br>\r\nSoon the soldiers shot us with a barrage of tranquizer darts causing us to fall asleep, as we woke up we're strapped to a platform, our legs bound to shackles on the side and 2 clamps on each of our necks. I can only look up and see a huge disk about the size of a manhole cover over my head, attached to a pully system with two more over Alex and Andrew.<br>\r\n<br>\r\nOfficer: I see your finally awake, good.<br>\r\n<br>\r\nYou: What is this horrible-looking device?<br>\r\n<br>\r\nOffocer: It's a new invention we're testing, and you get to test it out.<br>\r\n<br>\r\nAndew: I don't like this.<br>\r\n<br>\r\nAlex: I can't move!<br>\r\n<br>\r\nOfficer: See that panel on the wall?<br>\r\n<br>\r\nHe points to the control panel next to a door.<br>\r\n<br>\r\nOfficer: Once I press the button, it'll realease the counter-weight causing the three pistons to go up and once the spring on the counter-weight is stretched, the three pistons will drop down squashing your heads like grapes, and no more Hydra.<br>\r\n<br>\r\nAn officer rushes in the room<br>\r\n<br>\r\nSoldier: Commander hurry! One of the myths is running rampant through the base!<br>\r\n<br>\r\nThe officer heads towards the panel and presses the button causing the machine to start<br>\r\n<br>\r\nOfficer: Have to go, wish I could stay for the results but an emergancy came up.<br>\r\n<br>\r\nThe officer and the soldier runs out of the room.<br>\r\n<br>\r\nAlex: GET US OFF THIS THING!<br>\r\n<br>\r\nAndrew: I'M TRYING BUT i CAN'T MOVE A MUSCLE!<br>\r\n<br>\r\nYou: IN CASE WE CAN'T MAKE IT, IT'S NICE SPENDING TIME WITH YOU TWO!<br>\r\n<br>\r\nAndew: THERE'S STILL TIME TO GET OFF, BUT...<br>\r\n<br>\r\nYou all noticed the three disks are almost to the top<br>\r\n<br>\r\nYou, Alex and Andrew: HELP!!!<br>\r\n</span></div></div>",
            "created":1341896400,
            "id":1375895,
            "title":"Ended up as guinea pigs. For a death machine."
        },
        "132111211":{
            "author_id":"hertzman",
            "author_name":"Hertzman",
            "choices":[
                "I don't care right now, I just want to go home.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You all closed your eyes to expect a fatal headache from the lethal machine but suddenly you hear the disks stopped just above you, you looked and see a dragon holding up the weights, it's head holding yours while it's hands holds up Alex and Andrew's and with a sweep of it's tailblade, it freed you from the shackles. Sensing the oppotunaty you get off the machine where the dragon lets the 3 weights go and it hits the base of the machine with an audible *clang*. You looked again and see the dragon is nowhere to be found.<br>\r\n<br>\r\nAlex: That was too close.<br>\r\n<br>\r\nAndrew: Who was that dragon?</span></div></div>",
            "created":1352782800,
            "id":1467476,
            "title":"Rescued"
        },
        "14":{
            "choices":[
                "Dragon",
                " [Write & I will rename]",
                " [Write & I will rename]",
                " [Write & I will rename]",
                "More Choices"
            ],
            "content":"<div class=\"\"><div> <span>Name: Shane Tutty<br>\r\nGender: Male<br>\r\nAge: 15<br>\r\nHistory:<br>\r\nNot many friends but kind to the few he has.He remains quiet most of the time,but has no problem speaking his mind when he needs to.<br>\r\nInterests:Animals,Video games<br>\r\nDislikes:Heights<br>\r\n<br>\r\nWhat is his Ancestory.</span></div></div>",
            "created":1312347600,
            "id":1160816,
            "title":"Shane Tutty"
        },
        "141":{
            "choices":[
                "Strapped up in an interrogation room",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Shane was sitting at home playing video games, the rest of his family were gone to visit relatives. In the game his character was attempting to kill a dragon with a bow and arrow, although the objective of the game he was not too fond of slaying dragons, actually he found them interesting.<br>\r\nSuddenly there was a knock on the door, Shane found it odd because they rarely had visitors to the house, this was mostly due to the house being located on a mountainous region. Shane opened the door to see noone there, he walked out and looked around. Out of nowhere he felt a stinging sensation in his neck, he felt his neck to find what looked like a tranquiliser dart. He then felt drowsy and collapsed onto the ground.<br>\r\nAs he lay on the ground a man came into his view. \"You`re mine now Myth!\" the man said. Shane then blacked out completely. Where does he wake up.</span></div></div>",
            "created":1341378000,
            "id":1371927,
            "title":"Dragon"
        },
        "1411":{
            "choices":[
                "Rampage ensues",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Shane woke up feeling very confused and slightly groggy, he noticed that he was tied up. His arms were shackled behind him, his feet were cuffed to the floor and there was a kind of muzzle on his face.<br>\r\n\"Ah, you`re finally awake\" a voice said as a man in knights armor walked out from the shadows. Shane couldnt say anything because of the muzzle on his mouth. The knight said \"Ah yes, sorry about the muzzle, but you dragons are unpredictable when it comes to using an array of breath attacks\" Shane had a confused look on his face which made the knight chuckle  \"You dont know, do you? Alright let me fill you in, you my friend are a mythical creature or myth for short, your ancestors were myths who could shapeshift into humans, and as each descendent was born into human care they eventually became unaware of the power they held within themselves and many lived their lives never finding out.\"<br>\r\nHe took the cuffs and shackles off of Shane, then removed the muzzle. He said \"Now I dont care much for the regime around here, but if an accident were to occur where a myth were to escape and take out a large number of our soldiers, then the survivors may get some perks\" <br>\r\nShane looks at him and says \"Why should I help you\" \"Because Im helping you\" He replied. Shane thinks for a moment and then nods. \"This will only hurt slightly\" the knight says as he takes out a vile and injects it into Shane. Shane feels woozy and says \"What did you do?\" The knight replies \"Dont worry, this will just speed up your transformation\" The knight steps back as the transformation begins.<br>\r\nShanes eyes change to reptillian eyes then his body begins to grow and his bones begin to shift. A tail grows from his spine. Spines grew out all along his back town to his tail. His legs shift and he falls onto all fours, claws grow out from his hands and feet. His face lengthens and his teeth become razor sharp, two horns grow from the back of his head. Two leathery wings grow out of his back and flap weakly.<br>\r\nBefore the knight was a ten ft tall, fifteen ft long pale skinned dragon, then right infront of the knights eyes, red scales grew out all over the dragons body, the underbelly was yellow. The knight then left the room. Giving the knight a five minute headstart, Shane readied himself to break through the door.</span></div></div>",
            "created":1341896400,
            "id":1375832,
            "title":"Dawn of the Dragon"
        },
        "14111":{
            "choices":[
                "Rescue",
                "There is nothing  he can do"
            ],
            "content":"<div class=\"\"><div> <span>Since the door was now too small, Shane decided to charge it. He ran through it and debris was sent flying. A silver knight was a few feet from the door, when he saw the dragon he began to run, Shane quickly shot a fireball at him. He then went down the hallway, destroying things and attacking knights along the way, he came to a room with some pretty high tech equipment, without a second thought he incinerated it all.<br>\r\nHe then came to what looked like a dungeon, and saw plenty of others just like him, kidnapped and locked up. He found all the cage controls, and crushed them with his claw, and all the doors sprung open, and all the captives, all teens ran out, they thanked him and they all ran for an exit.<br>\r\nShane walked by a room and he saw a hydra strapped down with its heads about to be crushed.</span></div></div>",
            "created":1352782800,
            "id":1466870,
            "title":"Rampage ensues"
        },
        "141111":{
            "choices":[
                "At home",
                "Next"
            ],
            "content":"<div class=\"\"><div> <span>He bursts into the room, and when the device was about to crush them, he caught one in each hand, and the middle one he used his head to hold it up. He then used his tail blade to slash all of the hydras metal strappings, he then jumps back, and the device crushes nothing. [Edit Shane is now nineteen, and attends college] He then incinerates a wall, and the room is filled with cool night air. Shane goes through the hole and takes off without saying anything to the hydra.</span></div></div>",
            "created":1352782800,
            "id":1466874,
            "title":"Rescue"
        },
        "1412":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Yes",
                "Yes, but there is another dragon in the cave...",
                "Someplace different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about he woke up in the mountains inside a cave?</span></div></span></div>",
            "created":1371704400,
            "id":1614153,
            "title":"Other"
        },
        "14122":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was that dragon male or female?</span></div></span></div>",
            "created":1371704400,
            "id":1614155,
            "title":"Yes, but there is another dragon in the cave..."
        },
        "15":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "[Free character slot]",
                "[Free character slot]",
                "[Free character slot]",
                "[Free character slot]",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what is your name?<br>\r\n<br>\r\nEDIT: I have freed up these slots ^_^</span></div></span></div>",
            "created":1323147600,
            "id":1235612,
            "title":"More names"
        },
        "151":{
            "choices":[
                "Begin",
                "{Free Character Slot}",
                "{Free Character Slot}"
            ],
            "content":"<div class=\"\"><div> <span>Name: Elisabeth Vandom<br>\r\nGender:  <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/female.png\" alt=\"*Female*\" title=\"Female\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nAge:25<br>\r\nSpecial Skills: Photographic Memory, Acrobatics<br>\r\nHistory:<br>\r\nElisabeth is a literature teacher at a high school in New York. Normally a quiet bookworm, Elisabeth has been having dreams telling her the secrets of the mythical ancestry but has yet to know what it means. All her life she has been reading stories about fantasy and mythology so she can identify any mythical creature. However, lately she's been feeling strange and it won't be long until she discovers her true nature.<br>\r\n<br>\r\nInterests: Mythology and Fantasy Novels<br>\r\nFears: Heights (Ironically)<br>\r\nAncestry: Gargoyle</span></div></div>",
            "created":1407474000,
            "id":1839029,
            "title":"Elisabeth Vandom"
        },
        "152":{
            "choices":[
                "Begin",
                "new character",
                "new character"
            ],
            "content":"<div class=\"\"><div> <span>Name: Daren Von Drakemore<br>\r\nGender: <img style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/male.png\" alt=\"*Male*\" title=\"Male\" border=\"0\" width=\"15\" height=\"15\"><br>\r\nAge: 25<br>\r\nSpecial Skills: Brute strength, Intellect, Night vision<br>\r\nHistory:<br>\r\nAfter graduating from college he became a well known actor and wrestler. His handsome features cause many young ladies to fall head over heels for him. In most films that he's in he either plays the role of a hero or villain in fantasy, medieval, or sci-fi settings. He is currently dating Laurel Mc'King, however Laurel is secretly the head of an organization known as the Silver Knights and has only been dating Daren as a cover-up in order to find a family of dragons who have been living in Arlonton for generations. Usually her technology would of worked but Daren's great-great grandfather protected the family by combining technology and magic to create a pendant that throws off the Silver Knights high tech tracker. Daren has been told that he is gifted from his parents, but he does not know what they meant. He was going to ask them, but they moved to an isolated retreat in the mountains, where the rest of Daren's family is located. Lately he's been having nightmares of Laurel trying to hunt him and murder his family.<br>\r\n<br>\r\nInterests: Video games, Working out, Scifi, Fantasy, and mythological books and films.<br>\r\nFears: Abandonment and betrayal, Dying an early death<br>\r\nAncestry: Dragon</span></div></div>",
            "created":1418360400,
            "id":1901332,
            "title":"Daren Von Drakemore"
        },
        "1521":{
            "choices":[
                "The filming goes uninterrupted",
                "The filming is interrupted when Daren randomly transforms",
                "Daren transforms, but the actors improvise thinking it to be a special effect"
            ],
            "content":"<div class=\"\"><div> <span>It was another day in the mountain city of Arlongton. Our story begins with a man named Daren Von Drakemore. Daren had been out of college for almost two years and already he was landing huge roles in many new movies slated for 2120. One of those movies was based on a video game series known as Fire Emblem. Ages ago another series was inspired by Fire Emblem, but it was based in a world that is almost the reality that Daren lives in now minus ufos or alternate dimensions. Daren was getting ready for his next movie called Fantasia: Rise of the Dragons. Fantasia was said to be an upcoming video game series that takes place in the far future, where a couple of knights discover a civilization of dragons. His girlfriend Laurel Mc'King is an out of town actress who just recently moved to the area and had been dating Daren for a month.<br>\r\n<br>\r\n\"There that should do it. I hope this makes me look like a young king who just recently ascended the throne?\" Daren said to himself as he was putting on a futuristic suit that had a unique dragon pattern on it.<br>\r\n<br>\r\nDaren's phone starts ringing.<br>\r\n<br>\r\n\"Daren are you ready? The director is eager to start filming and he wants to do your scene first.\"<br>\r\n<br>\r\n\"I'm coming Laurel. I was just putting on my costume.\"<br>\r\n<br>\r\n\"See you soon sweetie.\"<br>\r\n<br>\r\nDaren hung up. He was glad that his girlfriend was checking in on him, but with the strange nightmares he's been having of getting killed by the very woman he loved was the most terrifying moment he experienced. As he drove his hoverbike to the set he was greeted by his best friend Merlin Warcraft, the man who's directing the movie.<br>\r\n<br>\r\n\"Daren, I thought you were going to be late. I need you for this first scene. You recently became the king of Fanatasia and you are at war with an organization known as the Silver Knights. Your subjects have also found a lost civilization of dragons and are inquiring on what action you plan to take.\"<br>\r\n<br>\r\n\"Silver Knights? Didn't they exist a long time ago when knights used to fight off creatures of myth such as dragons, fairies and other monsters?\"<br>\r\n<br>\r\n\"That's what Laurel told me. It was her idea to add such a twist. There's no time for that now. I need you to get into character right now.\"<br>\r\n<br>\r\nDaren gets ready for his first scene.</span></div></div>",
            "created":1418706000,
            "id":1903603,
            "title":"Go Forth Brave Hero"
        },
        "15213":{
            "choices":[
                "Merlin who says that he's an actual wizard",
                "Laurel who starts attacking him"
            ],
            "content":"<div class=\"\"><div> <span>The filming was going great until Merlin had Daren and the actors who were suppose to be his loyal knights got to the 1st ruins scene.<br>\r\n<br>\r\n\"M'lord this is the ruins that we found about the ancient civilization. \" Said one of the knights.<br>\r\n<br>\r\n\"I see Sir Oswald.  My family has been said to have a connection with dragons since ancient times.\" Daren said as he acted out his lines.<br>\r\n<br>\r\nDaren them proceeds to picknow up a mystical goblet. When he does so his transformation is triggered. <br>\r\n<br>\r\n\"Your Majesty, a pair of wings just sprouted from your back!\" Said Richard as he improvised.<br>\r\n<br>\r\nDaren then looks at his coworker noting the odd deviation in the script. Heven then notices scales appearing on his body.<br>\r\n<br>\r\n\"What's going on?\" Daren asked out of panic.<br>\r\n<br>\r\n\"You were right m'lord. Your family must of blessed with dragon heritage. \" Oswald responded thinking that this was part of the movie.<br>\r\n<br>\r\nLaurel, however saw this differently. She was furious that her boyfriend turned out to be what she was hunting. The camera then pans over to Laurel as she gathers the Silver Knights. <br>\r\n<br>\r\n\"For too long we have been hunting these foul creatures.  Let's behead this king so all of humanity can live like nothing happened. \"<br>\r\n<br>\r\n\"Cut! That was better than planned.  Great work as always from our best actors. The next scene will feature Daren talking to the wizard. \" Merlin said as he put on a wizard's robe.<br>\r\n<br>\r\nDaren gives a sigh of relief.  He then tries to revert back to normal.  He manages to do so, but his costume was altered into red and gold armor, the same colors as his scalessay in his dragon form.<br>\r\n<br>\r\n<i>I'm glad that's over.  At least nobody freaked out.</i><br>\r\n<br>\r\nHe then hears a knock on the door.<br>\r\n<br>\r\n\"Come in!\"<br>\r\n<br>\r\nDaren sees ...</span></div></div>",
            "created":1418966760,
            "id":1904609,
            "title":"Dragon King"
        },
        "153":{
            "author_id":"medic123",
            "author_name":"medic12345678",
            "choices":[
                "hells yeah",
                "reader name",
                "reader name"
            ],
            "content":"<div class=\"\"><div> <span>Name:Ame Sky<br>\r\nGender:???<br>\r\nAge:12<br>\r\nSpeed:???<br>\r\nStrength:???(insanely strong)<br>\r\nIntel:???<br>\r\nSpecial Skills: Hard to beat, Inhuman reaction time, hard to predict, adaptation to pretty much everything<br>\r\nHistory:Not much for talking, because he lost his parents in a fire at age 5, and when he tried to go and find them he got burned, blown up, stabbed, and fell out of a 10 story window leaving a everlasting scar on him.<br>\r\n<br>\r\nInterest:video games, tv, and fighting gangs<br>\r\nFears: Losing his little sister, Changing into his demon form in public<br>\r\nAncestry: Demon</span></div></div>",
            "created":1490208840,
            "id":2293548,
            "title":"Profile"
        },
        "154":{
            "author_id":"sonicfan001",
            "author_name":"Sonicfan001",
            "choices":[
                "Yes, bring on Kamen Rider Myth.",
                "no, what's a Kamen Rider?"
            ],
            "content":"<div class=\"\"><div> <span>Name: Jake Brake<br>\r\nGender: male <br>\r\nAge: 15.<br>\r\nHistory:<br>\r\nis known for being a nerd, only has a few friends but they all know about his true form,  knows about his ancestry and works with his Myth-friendly school to defeat the Silver Knights with the powers of Kamen Rider Myth<br>\r\n<br>\r\nInterests: books<br>\r\nFears being captured by the Silver Knights<br>\r\n<br>\r\nSpecies: Werewolf</span></div></div>",
            "created":1510411560,
            "id":2413738,
            "title":"Jake Brake"
        },
        "155":{
            "author_id":"inside",
            "author_name":"Mr.person",
            "choices":[
                "Free choice",
                "Free choice",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then this?</span></div></span></div>",
            "created":1510711620,
            "id":2415342,
            "title":"Other"
        },
        "1551":{
            "author_id":"inside",
            "author_name":"Mr.person",
            "choices":[
                "Let's go!",
                "No"
            ],
            "content":"<div class=\"\"><div> <span> Name: Koizumi Miku<br>\r\n<br>\r\n Gender: female <br>\r\n<br>\r\n Age:23<br>\r\n<br>\r\n History: Miku comes from wealthy Japanese family who don't mind lending money to people but uses every trick under her sleeves to make the debtor pay the money back with high interest. She discovered her mythical ancestory through her grandmother back in Tokyo.<br>\r\n<br>\r\n Likes: money, seeing the debtor in pain<br>\r\n<br>\r\nHates: hypocrites and debtors not paying off debts </span></div></div>",
            "created":1510712100,
            "id":2415346,
            "title":"Free choice"
        }
    },
    "info":{
        "author_id":"unleashmaximum",
        "author_name":"MightyWolf",
        "brief_description":"An ancestral ability to transform between a mythical creatures & human.",
        "created":1312086960,
        "description":"<td align=\"left\" class=\"norm\">Long ago in medieval times, there were mythical creatures living in harmony with humans. They traded &amp; coexisted together. Mythical creatures then started to gain abilities to transform into humans as well. But there was a confrontation between the humans &amp; the mythical creatures. The humans started getting greedy &amp; stealing treasures from all the myths. The myths then started to retaliate &amp; attack the human settlements. Humans started to be determined to wipe out all the myths so that they will no longer be hunted by the myths. Some myths started hiding in their human forms to survive.<br>\r\n<br>\r\nIn modern day, mythical creatures still exist but are hiding in their human forms. There is also an anti-myth group known as the Silver Knights. They use high tech devices to locate &amp; exterminate myth creatures. Some myth creatures are not aware of what they are due to being raised in human societies.</td>",
        "id":1797949,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1510712100,
        "modified":1510712100,
        "pretty_title":"The Mythical Secrets"
    }
}