{
    "chapters":{
        "1":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Henry is shrunk and 1\" tall and hears his shrunken phone ring",
                "Henry is shrunk and 6\" tall and hears his unshrunken phone ring",
                "Henry is shrunk and 1/2\" tall and hears his unshrunken phone ring",
                "Henry is shrunk and 1/4\" tall and hears his shrunken phone ring",
                "Henry is shrunk and 3\" tall and hears his unshrunken phone ring"
            ],
            "content":"<div class=\"\"><div> <span>George Boone walked into the lab where his brother works. He was dressed in a pair of running shorts, a sweat-stained T-shirt and his extremely well-worn sneakers. He had just finished a rough practice with the lacrosse team he coached for the college. Not so many years ago, he had been the star of the same school's lacrosse team. After he got a degree and graduated, his old coach accepted a new job and the school was more than happy to hire a former star player as the new coach.<br>\r\n<br>\r\n<br>\r\nGeorge, who stood six foot and four inches, looked around the lab, which was evidently empty, except for a strange machine surrounded by a clutter of parts and tools. The entire setting looked like a process interrupted. <br>\r\n<br>\r\nHe had texted ahead to inform his brother he wanted to stop by to take him out to eat. Although they were far different in looks and temperament, they had a good relationship. George had even helped pull strings to get Henry the post as a graduate research assistant. They hadn't seen each other in about a week. During a brief phone call, Henry had said he had made an amazing discovery that he would be ready to share soon.<br>\r\n<br>\r\nGeorge looked around, somewhat irritated, to find the lab empty with no sign of his brother. While he waited, he moved closer to the confusing assembly of cables, wires and other equipment that trailed toward a complex control panel. From the ceiling near the center of the room descended a strange-looking dome. Some exposed wires and cables dangled from the dome, too. <br>\r\n<br>\r\nHe figured it was better that his brother had the brains. Looking around at the confusing mess, he realized he wouldn't know where to begin to assemble whatever the strange device might be.<br>\r\n<br>\r\nWhile he continued to wait, he noticed something tiny and pale scurrying among some of the haphazardly discarded tools. He walked closer and reached for a screwdriver, which the tiny creature had sprinted toward to avoid his approach.<br>\r\n<br>\r\nWhen he picked up the screwdriver, however, he no longer saw the strange little bug. He stretched out his hand and put the tool down on a nearby table, failing to see the tiny form that dropped from the screwdriver and fell to the tabletop.<br>\r\n<br>\r\nHe decided he had waited long enough and pulled out his phone to call his brother. Somewhere nearby, but totally unheard by George, a phone rang. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1327899600,
            "id":1268656,
            "title":"George"
        },
        "11":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "jerks off",
                "yells for help",
                "waves",
                "runs",
                "falls to his knees"
            ],
            "content":"<div class=\"\"><div> <span>Henry, only 1\" tall, looked up at his enormous brother.<br>\r\n<br>\r\nWhy had he kept the details of his discovery so close to the vest? Not a soul knew that he had found Dr. Eric Braysen's amazing experiment, namely a fully functional shrink ray.<br>\r\n<br>\r\nHe had told George that he was close to a real breakthrough, but he had never shared the nature of the experiment.<br>\r\n<br>\r\nHenry found it difficult to discuss because the capacity of the machine greatly excited him. He had always been fascinated with size.<br>\r\n<br>\r\nNow, the reasons came flooding back to him. Although the giant above him was his own brother, he forgot that and just lost himself in the size and power of the huge creature.<br>\r\n<br>\r\nHis hand dropped down to his crotch. But, before he got started, he heard a phone ring. His phone, which apparently had been shrunk along with him.<br>\r\n<br>\r\n</span></div></div>",
            "created":1327899600,
            "id":1268658,
            "title":"Henry is shrunk and 1\" tall"
        },
        "111":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Who doesn't notice him",
                "Who notices him",
                "who notices a bug"
            ],
            "content":"<div class=\"\"><div> <span>When George first showed up, Henry rejoiced. He would be saved from the folly of his ill-advised test of the of Dr. Braysen's technology.<br>\r\n<br>\r\nAs he watched his gigantic brother walk through the lab, however, Henry felt a tingling excitement. He felt like a bit of a voyeur, and also realized that the size difference between them now served as a source for arousal.<br>\r\n<br>\r\nHe should have had more immediate concerns, but he shoved them aside and started jerking to the sight of his enormous older brother looming over a lab somehow diminished by his gigantic presence.</span></div></div>",
            "created":1327899600,
            "id":1268661,
            "title":"jerks off"
        },
        "1113":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomps",
                "Looks first",
                "Stomps and misses"
            ],
            "content":"<div class=\"\"><div> <span>Henry finished jerking by shooting a load of cum all over his stomach and abs.<br>\r\n<br>\r\nThe orgasm left him off his balance, overloaded by the intensity of it.<br>\r\n<br>\r\nSo, when he heard George's huge voice, he wasn't exactly prepared.<br>\r\n<br>\r\n\"Filthy bug!\"<br>\r\n<br>\r\nGeorge raised his sneaker. </span></div></div>",
            "created":1348981200,
            "id":1437703,
            "title":"who notices a bug"
        },
        "11131":{
            "author_id":"small1",
            "author_name":"Small1",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"George! No! It's me! Henry!\"<br>\r\n<br>\r\nThe huge shoe stomped down on the bug-sized sibling.<br>\r\n<br>\r\n\"Ugh,\" George complained. \"Awful bug. Guess it got what it deserved.\"<br>\r\n</span></div></span></div>",
            "created":1348981200,
            "id":1437704,
            "title":"Stomps"
        },
        "11132":{
            "author_id":"small1",
            "author_name":"Small1",
            "content":"<div class=\"\"><div> <span>\"George, it's me, Henry!\"<br>\r\n<br>\r\nHe looks down and grimaces.<br>\r\n<br>\r\n\"Disgusting!\"<br>\r\n<br>\r\n\"No. Wait... I am not...\"<br>\r\n<br>\r\nGeorge's shoe drops and ends the entire misadventure in an instant.<br>\r\n</span></div></div>",
            "created":1351400400,
            "id":1455296,
            "title":"Looks first"
        },
        "11133":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Get Help",
                "Try to Gain Access to the Shrink Ray"
            ],
            "content":"<div class=\"\"><div> <span>\"Filthy bug!\"<br>\r\n<br>\r\nHis brother's two simple words rang in Henry's brain as his eyes gazed at the sneaker that his brother so effortlessly lifted off the floor. The shadow from the huge shoe could have eclipsed a city block. The shadow slowly extended across the floor toward George's bug-sized sibling.<br>\r\n<br>\r\nHenry turned and fled from the ominous shadow, racing as fast as his legs, now no thicker than a piece of thread, could carry him. His recently exploded cock still leaked the last of the cum from the orgasm he had achieved comparing himself to the unbelievable change in scale between himself and his older brother.<br>\r\n<br>\r\nWhen the shoe dropped back onto the floor, Henry heard the thunderous impact only an instant before the shockwave of displaced air ripped into him. The shrunken man screamed like a banshee as he was tossed like a piece of flotsam across the tiles.<br>\r\n<br>\r\nGeorge grunted in aggravation having missed the scurrying insect. He had lost sight of and interest in the insect. He continued walking toward the door of his brother's lab.<br>\r\n<br>\r\nTiny Henry tried to stand, but his head spun. He sank back into a crouching position and screamed hoarsely. \"George, don't go!\" Henry pleaded. \"I need help!\"<br>\r\n<br>\r\nHis brother opened the door and exited. Henry defied the dizziness from his near miss and ran across the floor, only to watch as the monolithic door settled into its frame with a thunderous crash. In despair, he came to a halt, gazing up at the impossible door.<br>\r\n<br>\r\nHe was alone, smaller than a bug, and lost on the floor of his laboratory. He had only himself to blame. He had let himself get detoured by the overwhelming experience of jerking off in the presence of a titan.<br>\r\n<br>\r\nNow he needed to get serious and...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1484949720,
            "id":2266651,
            "title":"Ignored"
        },
        "111331":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Custodian Demario Garcia arrives to clean the lab",
                "Dr. Dixon and Tim arrive together"
            ],
            "content":"<div class=\"\"><div> <span>Facing facts, Henry realized he would need help to regain his size.<br>\r\n<br>\r\nHis brother's reaction had taught him a valuable lesson. Due to his much diminished state, it would be far too easy for a normal person, seeing only smallness and movement, to mistake him for a bug, a mere insect daring to share the same universe.<br>\r\n<br>\r\nThe naked speck's dick twitched a little at the memory of his gigantic brother's shoe dropping from the sky in an attempt, coming much too close for success for comfort, at stomping him like a bug.<br>\r\n<br>\r\n\"That's what I am to him now,\" Henry realized bleakly.<br>\r\n<br>\r\nHe considered his options. When in the laboratory, he existed in a rather reclusive manner. Nevertheless, he came into contact with various people during his daily routine. <br>\r\n<br>\r\nAt some point, the custodian would make his rounds, cleaning offices and labs throughout the building.<br>\r\n<br>\r\nOn the other side of the door, and at the other end of what would now be an enormous corridor, Dr. Dan Dixon occupied an office. He could try to gain the attention of the theoretical physicist, who would be a likely candidate to help him.<br>\r\n<br>\r\nHis friend, Tim, usually paid a visit or two every day. Could he count on Tim's usual schedule to help him extricate himself from his dilemma?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1489429200,
            "id":2289080,
            "title":"Seeking Assistance"
        },
        "112":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George sees a bug",
                "George sees nothing",
                "Henry climbs George's shoe lace"
            ],
            "content":"<div class=\"\"><div> <span>He answered the ringing phone, but the line was static. He saw from his screen that it was his own brother calling him.<br>\r\n<br>\r\n\"George. it's me! Henry! I'm down here! On the floor!\"<br>\r\n<br>\r\nHe ran toward his brother's gigantic shoe. He kept his phone held tightly in one hand. <br>\r\n<br>\r\nAs he ran, he tried to analyze his thoughts. Henry remained flabbergasted by his discovery that the forgotten technology in Dr. Braysen's former laboratory made shrinking possible.<br>\r\n<br>\r\nWhat worried him, as he tried to attract his huge sibling's attention, was whether the technology could also restore him to his normal size.</span></div></div>",
            "created":1330232400,
            "id":1285040,
            "title":"yells for help"
        },
        "113":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Mistakes him for a bug",
                "Recognizes him",
                "Wants a closer look"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He waved his thin arms over his head.<br>\r\n<br>\r\n\"George!\" Henry yelled in a weak, squeaky voice. \"It's me! The device was a shrink ray!\"<br>\r\n<br>\r\nGeorge saw and automatically...</span></div></span></div>",
            "created":1351486800,
            "id":1456038,
            "title":"waves"
        },
        "114":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "One Small Step for George...",
                "....One Big Step for Henry",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>He runs berserkly across the floor, terrified of his brother's enormous shoes.<br>\r\n<br>\r\n\"George!\" Henry managed to scream. \"Down here. Please, don't step on me!\"<br>\r\n<br>\r\nHe needed his brother's help to reverse the ray's effects, but he needed first to make sure he didn't get stomped like a bug.</span></div></div>",
            "created":1357189200,
            "id":1501166,
            "title":"runs"
        },
        "115":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George hears him",
                "George sees him",
                "George does not see or hear him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He was now completely clear on the capability of the long-forgotten device invented by Dr. Braysen.<br>\r\n<br>\r\nOn his knees, Henry yelled up at his unsuspecting giant brother.<br>\r\n<br>\r\n\"George. Help me!\"</span></div></span></div>",
            "created":1360552560,
            "id":1529518,
            "title":"falls to his knees"
        },
        "12":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Henry keeps hiding",
                "Henry yells for help",
                "George notices something",
                "Phone rings",
                "George's cell phone rings"
            ],
            "content":"<div class=\"\"><div> <span>Henry, hiding beneath the wide column of a chair leg, stared up at his brother from the lowly status of six inches tall that had been the result of his foolish and impulsive test of the technology he had uncovered in Dr. Braysen's mothballed laboratory.</span></div></div>",
            "created":1330232400,
            "id":1284588,
            "title":"Henry is shrunk and 6\" tall"
        },
        "122":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George hears... and helps",
                "George hears... and doesn't help",
                "George doesn't hear in time"
            ],
            "content":"<div class=\"\"><div> <span>\"George, help me!\"<br>\r\n<br>\r\nHis voice sounded so thin and shrill.<br>\r\n<br>\r\nHe blurted out the story of his unauthorized test of the old technology he had uncovered in Braysen's closed laboratory.<br>\r\n<br>\r\n\"I didn't know what it could do,\" he admitted as he finished his tirade and waited for some sort of response from an enormous sibling.</span></div></div>",
            "created":1348981200,
            "id":1437697,
            "title":"Henry yells for help"
        },
        "1221":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Punishes him",
                "Spanks him",
                "Cages him"
            ],
            "content":"<div class=\"\"><div> <span>George is distraught to see Henry so little and helpless. He listened to him pour out his story, but found his mood changing as he learned some details.<br>\r\n<br>\r\n\"You conducted a test on yourself!\"<br>\r\n<br>\r\n\"Yes, but that's not the point,\" Henry squeaked. \"If—\"<br>\r\n<br>\r\n\"If you were one of my players, I'd punish you for being so reckless...\"<br>\r\n<br>\r\n\"Punish?\" Henry asked, confused.<br>\r\n<br>\r\n</span></div></div>",
            "created":1351832400,
            "id":1459039,
            "title":"George hears... and helps"
        },
        "1222":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Slammed his foot down to rattle him",
                "Grabbed him in his fist",
                "Dropped a jar on top of him"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm down here!\" <br>\r\n<br>\r\nGeorge heard the squeaky voice, and looked down to see his naked brother, now six inches tall.<br>\r\n<br>\r\n\"Down where?\"<br>\r\n<br>\r\nLooking up at his huge brother, Henry felt a moment of panic when his gigantic sibling shifted his feet.<br>\r\n<br>\r\n\"I'm down here, George! Hey, don't step on me!\" Henry shouted. \"Don't—\"<br>\r\n<br>\r\n\"What happened to you?\"<br>\r\n<br>\r\n\"I've shrunk!\"<br>\r\n<br>\r\nGeorge smirked. \"Henry? Is that really you?\"<br>\r\n<br>\r\nHenry tried to cover himself as best he could as he yelled up at George to confirm his identity. \"You've got to help me!\"<br>\r\n<br>\r\n\"Don't panic,\" George said, unable to conceal his smirk. \"So you're a little short—\"<br>\r\n<br>\r\nHenry glared up at George. \"You going to help me?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1348981200,
            "id":1437698,
            "title":"George hears... and doesn't help"
        },
        "12222":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George leaves Henry in his office during the practice session",
                "George stashes Henry in his locker during practice"
            ],
            "content":"<div class=\"\"><div> <span>Henry squirmed uncomfortably after his huge brother wrapped his fist around him and lifted him from the floor.<br>\r\n<br>\r\n\"Take me over to that control panel,\" Henry gasped through clinched teeth.<br>\r\n<br>\r\n\"No time for that,\" George said. \"I've got to get to my practice. We can come back later.\"<br>\r\n<br>\r\n\"No!\" Henry protested. \"Just leave me here, and I will keep working...\"<br>\r\n<br>\r\n\"No way I can leave you here like this,\" George said with unwavering protective feelings. \"I mean, anything could happen to you.\"<br>\r\n<br>\r\nHenry hadn't thought of that. Now, with it made very clear, he shuddered. \"Yea, guess you're right,\" he said.</span></div></div>",
            "created":1478104260,
            "id":2231733,
            "title":"Grabbed him in his fist"
        },
        "123":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "It looks familiar",
                "It's calling his name",
                "It's a naked, little man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Little Henry stepped into the open and called out for help.<br>\r\n<br>\r\nGeorge noticed something small and squeaky.<br>\r\n<br>\r\nHe frowned until he also noticed that the tiny creature looked shockingly familiar.</span></div></span></div>",
            "created":1360526940,
            "id":1529130,
            "title":"George notices something"
        },
        "1232":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George tried to adjust his grasp",
                "Henry rides in George's shirt pocket",
                "George takes Henry to his office "
            ],
            "content":"<div class=\"\"><div> <span>\"George! It's me!\" Henry shouted, taken aback by the now enormous difference in their respective sizes.<br>\r\n<br>\r\nGeorge, hearing the feeble shouts, took another step forward, panicking his shrunken sibling.<br>\r\n<br>\r\n\"George, look out. Don't step on me! Don't!\"<br>\r\n<br>\r\nGeorge forced himself to a rigid halt. \"Henry?\"<br>\r\n<br>\r\nHenry breathed a sigh of relief. \"Yes, it's me!\" He poured out a tumble of words, incoherently trying to quickly get George up to speed on the situation.<br>\r\n<br>\r\nGeorge grasped most of the explanation. \"The machine looks like it took quite a hit,\" he said. \"Let's just get you somewhere safe.\"<br>\r\n<br>\r\n\"No, I need to...\" Henry started, but George suddenly grabbed him and crushed the breath from his body. \"George, you're squeezing me...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1491249960,
            "id":2299198,
            "title":"Calling his Name"
        },
        "13":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Demaris the janitor walks in",
                "George starts walking",
                "George sees a bug",
                "George leaves",
                "George looks for him"
            ],
            "content":"<div class=\"\"><div> <span>Henry, only half an inch tall, gazes up at his huge brother when he heard his phone ring somewhere far overhead.<br>\r\n<br>\r\nHe scrambled to his feet. If only he had been standing near the ringing phone, surely his brother would have seen him and helped him solve his dilemma after the accident with the forgotten shrink-ray he had found in Braysen's mothballed laboratory.<br>\r\n<br>\r\nEverything leading up to his ill-advised test of the forgotten device rushed back to the forefront of his thoughts, rivaled only by one overwhelming objective.<br>\r\n<br>\r\nHe needed to get help if he was ever to regain his normal size!</span></div></div>",
            "created":1327899600,
            "id":1268662,
            "title":"Henry is shrunk and 1/2\" tall"
        },
        "131":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomps you",
                "Sweep you up",
                "Captures you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Demaris walks in</span></div></span></div>",
            "created":1357362000,
            "id":1502348,
            "title":"Demaris the janitor walks in"
        },
        "132":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomps you",
                "Sees you",
                "Teases you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Walks into the room and,,,</span></div></span></div>",
            "created":1357362000,
            "id":1502349,
            "title":"George starts walking"
        },
        "133":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Raises his shoe to stomp",
                "Grabs a newspaper to swat",
                "Finds a can of bug spray"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh, damn, a bug,\" George says and...</span></div></span></div>",
            "created":1327899600,
            "id":1268665,
            "title":"George sees a bug"
        },
        "1332":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Misses",
                "Connects",
                "Merely brushes you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Rolls up a nearby newspaper.<br>\r\n<br>\r\nWith good aim, he swats at  the bug he hasn't recognize as his own brother.</span></div></span></div>",
            "created":1342760400,
            "id":1384122,
            "title":"Grabs a newspaper to swat"
        },
        "13321":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "To the floor",
                "His lap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He missed, but the impact sent you falling off the table.</span></div></span></div>",
            "created":1352005200,
            "id":1460628,
            "title":"Misses"
        },
        "13322":{
            "author_id":"small1",
            "author_name":"Small1",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No, wait!\" Henry screamed. \"It's me, your...\"<br>\r\n<br>\r\nWHAP!<br>\r\n<br>\r\nHe's smashed beneath yesterday's news.</span></div></span></div>",
            "created":1356498000,
            "id":1494779,
            "title":"Connects"
        },
        "1333":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Good aim",
                "Poor aim",
                "The can's empty"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>George hates messes, so he opts to spray the bug with RAID.</span></div></span></div>",
            "created":1342242000,
            "id":1378420,
            "title":"Finds a can of bug spray"
        },
        "13331":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Lethal dose",
                "Surviving the chemical attack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Henry saw the huge canister in his brother's massive hand.<br>\r\n<br>\r\n\"George, don't!\"<br>\r\n<br>\r\nGeorge sprayed a toxic fog all over the tiny bug, then watched it drop to the floor and start writhing in agony.</span></div></span></div>",
            "created":1348981200,
            "id":1437700,
            "title":"Good aim"
        },
        "133311":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Writhe a bit more",
                "Choke a bit more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choking and gagging, Henry felt his body convulse.<br>\r\n<br>\r\n\"George...please,\" Henry whispered.<br>\r\n<br>\r\nThe tiny man heard the giant grunt. Did he hear him?<br>\r\n<br>\r\nNope. He blasted Henry with another spray of the toxin. </span></div></span></div>",
            "created":1351400400,
            "id":1455295,
            "title":"Lethal dose"
        },
        "13332":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Spray again",
                "Spies a fly swatter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>George sprayed the RAID, but he doused the wall, nowhere close to his shrunken brother.</span></div></span></div>",
            "created":1356930000,
            "id":1498759,
            "title":"Poor aim"
        },
        "13333":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Slams the can down on you",
                "He bashes you with the can"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He shakes the can.<br>\r\n<br>\r\n\"Damn,\" he said. \"It's empty.\"<br>\r\n<br>\r\nHenry dares to feel relieved, until...</span></div></span></div>",
            "created":1351400400,
            "id":1455294,
            "title":"The can's empty"
        },
        "133331":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Flattened",
                "Squished"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Still...<br>\r\n<br>\r\nGeorge slammed the can down, right atop his bug-sized sibling.</span></div></span></div>",
            "created":1356930000,
            "id":1498760,
            "title":"Slams the can down on you"
        },
        "1333311":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Put can back on the shelf",
                "Flattened Henry falls off the bottom of the can"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Henry felt enormous pressure, and his tiny body flattened out to paper-thin thickness, but he survived.<br>\r\n<br>\r\nBut, when his brother lifted the can, he was stuck to the bottom.</span></div></span></div>",
            "created":1356930000,
            "id":1498762,
            "title":"Flattened"
        },
        "13333111":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Someone else lifts the can",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He placed can back on the shelf, which kept the malleable shrunken sibling from re-forming with the weight pressed atop him.</span></div></span></div>",
            "created":1356930000,
            "id":1498763,
            "title":"Put can back on the shelf"
        },
        "133331111":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "It's Demario",
                "It's Tim Tanner"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After an indeterminate time, someone lifts the can...</span></div></span></div>",
            "created":1360526100,
            "id":1529119,
            "title":"Someone else lifts the can"
        },
        "134":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "He stomps and squishes Henry",
                "Henry gets stomped and stuck in his tread",
                "He almost stomps Henry"
            ],
            "content":"<div class=\"\"><div> <span>Henry positioned himself between George and the door.<br>\r\n<br>\r\n\"George!\" Henry yelled at his huge brother. \"Help!\"<br>\r\n<br>\r\nThe enormous sneakers covering George's feet moved.<br>\r\n<br>\r\nShockingly quickly, the sneakers stomped on the floor with loud, explosive booms making Henry want to curl into a fetal position and wait for the nightmare to end.</span></div></div>",
            "created":1357362000,
            "id":1502351,
            "title":"George leaves"
        },
        "14":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "His brother George looks closer",
                "George leaves, but Tim arrives to the lab",
                "Trevor and Ivan come to the lab",
                "Demario arrives to clean the lab, find George present",
                "Don inspects the lab"
            ],
            "content":"<div class=\"\"><div> <span>Henry awoke to the sound of loud explosions, distant but coming closer.<br>\r\n<br>\r\nSuddenly, as his eyes snap into focus, he screamed.<br>\r\n<br>\r\nLooming over him, overwhelming the laboratory with his sheer size and power, stood his brother, transformed into some unreal giant.<br>\r\n<br>\r\nHenry flashed back on his actions. Discovering Braysen's machine. Discovering its capability. Submitting himself, on a whim he now regrets, as a test subject.<br>\r\n<br>\r\nWhen it's over, Henry was only a quarter-inch tall, smaller than some bugs. <br>\r\n<br>\r\nAnd now, his huge brother is in the lab, calling his name, coming closer. <br>\r\n<br>\r\nTiny Henry scurried among the scattered tools he had left on the floor. When George stretched out a huge hand, the tiny man ducked for cover. His brother's giant hand scooped up a screwdriver, but at the same time collected his tiny, unseen sibling.<br>\r\n<br>\r\nWhen he placed the screwdriver on a tabletop, he didn't notice the tiny form that fell off nearby.<br>\r\n<br>\r\nHenry groaned, battered and bruised by the encounter with his brother's enormous fingers. He was now so tiny and insignificant, his brother hadn't even noticed him.<br>\r\n<br>\r\nEven worse. he had lost his shrunken phone during his fall. <br>\r\n<br>\r\n\"I've got to get his attention!\" </span></div></div>",
            "created":1336539600,
            "id":1333044,
            "title":"Henry gets bug-sized"
        },
        "141":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Jerk off",
                "Jerk off and then look for help",
                "Jerk off and get spotted"
            ],
            "content":"<div class=\"\"><div> <span>Henry had always thought of his brother as a handsome man. Now, his brother's muscular strength and good looks were increased on an exponential scale.<br>\r\n<br>\r\n\"He looks so sexy, but he's my brother...\"<br>\r\n<br>\r\nHe can't help himself. He needed to attract George's attention, but he let his desires get in the way.</span></div></div>",
            "created":1351400400,
            "id":1455298,
            "title":"His brother George comes to the lab"
        },
        "142":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Tim calls out his name",
                "Tim stomps across the floor",
                "Tim is talking on his phone"
            ],
            "content":"<div class=\"\"><div> <span>To his dismay, Tim Tanner suddenly entered the lab. A fellow grad student, Tim was 23 and, if anything, slightly more nerdish in appearance and behavior than Henry. <br>\r\n<br>\r\nOf course, now he looked absolutely huge and all-powerful, hardly attributes normally associated with a science nerd.<br>\r\n<br>\r\nTim was his friend, but now he almost didn't look like a fellow human.<br>\r\n<br>\r\nHe saw his brother and Tim exchange words, but then George moved toward the exit.<br>\r\n<br>\r\n\"No! Don't leave!\" Henry shrieked in a voice lost in the colossal laboratory's vastness.<br>\r\n<br>\r\nHenry, finally coming to his senses, realized that, even if he hadn't been able to reach George for help, Tim might be able to save him from his costly mistake of testing technology without a clear understanding of its capabilities.<br>\r\n<br>\r\n\"Tim!\" Henry screamed. He darted across the tabletop in Tim's direction. \"Down here! On the table! It's me!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1351746000,
            "id":1458072,
            "title":"His friend Tim comes to the lab"
        },
        "144":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Demario is near-sighted",
                "Demario hates bugs",
                "Demario is wearing head phones as he cleans"
            ],
            "content":"<div class=\"\"><div> <span>For the past half hour, ever since finding himself unexpectedly shrunk by Braysen's dusty, old device, the tiny grad student had been trying to think of a way out of his predicament. He had even survived a close call at the hands, literally, of his brother.<br>\r\n<br>\r\nGeorge was getting ready to leave the lab, not hearing his brother's frantic but indiscernible squeaks. <br>\r\n<br>\r\nThen, as on cue, the hot Latino janitor arrived to clean the lab. The two men passed each other with just a cursory acknowledgment. Henry's heart sank as his brother left the laboratory. But, now his attention focused on Demario. He knew that he always did a thorough job with his cleaning duties.That should mean he might pay enough attention to details to notice a tiny man.<br>\r\n<br>\r\n\"Oh, thank god,\" Henry said, thinking he was saved and completely unaware of pertinent facts.</span></div></div>",
            "created":1356930000,
            "id":1498765,
            "title":"Demario arrives to clean the lab"
        },
        "1442":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Exterminate them",
                "Stomp them",
                "Crush them"
            ],
            "content":"<div class=\"\"><div> <span>\"I was just leaving,\" George said. \"If you see my brother, let him know I was looking for him.\"<br>\r\n<br>\r\nFrom the tabletop, tiny Henry continue to shout and wave. \"No! Don't leave!\"<br>\r\n<br>\r\nDemario nodded. \"Will do.\"<br>\r\n<br>\r\nHenry watched with unease as his brother departed, leaving him alone and shrunken with a giant, unaware janitor on the move in the lab.<br>\r\n<br>\r\nWhat he doesn't know is that Demario loathes bugs of any kind.<br>\r\n<br>\r\nInsects just get under his skin, making him want to...</span></div></div>",
            "created":1360526160,
            "id":1529121,
            "title":"Demario hates bugs"
        },
        "14423":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Demario sees him and reacts badly",
                "Demario sees him and recognizes him"
            ],
            "content":"<div class=\"\"><div> <span>From the tabletop, tiny Henry tried to develop a plan on the fly.<br>\r\n<br>\r\nHe had been freaking out ever since the accident with the shrinking ray, which meant he needed to use his brain to get out of his dilemma.<br>\r\n<br>\r\nHe'd been so excited when he realized that the technology he'd unearthed in Doctor Braysen's old laboratory was a working shrink ray. He'd thrown caution to the winds, however, and was now paying the price for being relaxed with protocols and the rules.<br>\r\n<br>\r\nHe had meant to shrink himself to about three feet tall and then grow himself back to full size. Something had gone wrong — he suspected a malfunctioning capacitor. He should have been more cautious. After all, the parts in Braysen's marvelous invention were 15 years old.<br>\r\n<br>\r\nIf he could regain his size, he would be able to announce the most astonishing technological leap since the moon landing.<br>\r\n<br>\r\nDemario scanned the room. He wouldn't need to spend much time in this lab. Empty a few trash cans and he could be on his way.<br>\r\n<br>\r\nHe reached for a trash can near a cluttered desk, lifting it effortlessly with one hand, disposing of the scrap paper and other trash held within it.<br>\r\n<br>\r\nHe hadn't noticed the tiny speck on the tabletop, waving at him and shouting in a voice that was far beneath the squeak of a puny bug. <br>\r\n<br>\r\nHenry rushed toward the edge of the tabletop when he saw Demario's upper half disappear as he stooped to empty a trash can that looked bigger than a sports arena. <br>\r\n<br>\r\n\"Help! Look down!\" The tiny man shouted. \"Please, see me!\"</span></div></div>",
            "created":1479499500,
            "id":2238757,
            "title":"Mistakes Were Made"
        },
        "15":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Runs",
                "Screams",
                "Waves",
                "Hides",
                "Thinks of a next move"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>On the floor, an astonished three-inch-tall Henry gazes up at his brother and... </span></div></span></div>",
            "created":1342242000,
            "id":1378418,
            "title":"Henry is shrunk and 3\" tall"
        },
        "151":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "George sees him",
                "George doesn't see him",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Seeing his brother so huge, Henry could only run in panic.</span></div></span></div>",
            "created":1342760400,
            "id":1384112,
            "title":"Runs"
        },
        "152":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Right shoe",
                "Left Shoe",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He took one look at his huge brother and screamed in terror. </span></div></span></div>",
            "created":1351746000,
            "id":1458073,
            "title":"Screams"
        },
        "153":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomp first, questions later",
                "Questions first, then stomp",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Henry waved and, to his relief, attracted George's attention.<br>\r\n<br>\r\nUnfortunately, George wanted to stomp him. </span></div></span></div>",
            "created":1351832400,
            "id":1459037,
            "title":"Waves"
        },
        "1531":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Try again",
                "George hears him",
                "George recognizes him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>George stomped his foot down with a thunderous impact, but this three-inch-tall brother managed to evade the oncoming shoe.<br>\r\n<br>\r\n\"George! Are you fucking crazy? It's me!\"<br>\r\n</span></div></span></div>",
            "created":1356930000,
            "id":1498756,
            "title":"Stomp first, questions later"
        },
        "15311":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomped",
                "Interrupted"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Damn!\" George bellowed. \"Missed.\"<br>\r\n<br>\r\nHe raised the foot again, just as his fleeing brother tripped and sprawled onto the floor.<br>\r\n<br>\r\nHe turned over in time to see the shoe falling toward him.</span></div></span></div>",
            "created":1356930000,
            "id":1498758,
            "title":"Try again"
        },
        "153112":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Demaris the janitor",
                "A rugby player"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Someone else walks in.</span></div></span></div>",
            "created":1357448400,
            "id":1503341,
            "title":"Interrupted"
        },
        "1531122":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "6'6\"",
                "5'5\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How tall is he?</span></div></span></div>",
            "created":1357448400,
            "id":1503344,
            "title":"A rugby player"
        },
        "15311221":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "16",
                "18"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>God! He's huge!<br>\r\n<br>\r\nAt least six feet tall.<br>\r\n<br>\r\nAnd those shoes must be size...</span></div></span></div>",
            "created":1357448400,
            "id":1503347,
            "title":"6'6\""
        },
        "153112212":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Stomp stuff",
                "Have them worshipped"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Rugby player is proud of his size 18 feet.<br>\r\n<br>\r\nHe loves to...</span></div></span></div>",
            "created":1357448400,
            "id":1503349,
            "title":"18"
        },
        "1531122121":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Meet the Exterminator",
                "Hide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He loves to stomp bugs.<br>\r\n<br>\r\nFriends and teammates call him the \"Exterminator.\"<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1357448400,
            "id":1503357,
            "title":"Stomp stuff"
        },
        "15311221212":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Bug",
                "Wise little man"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would be better to seek help, but he cowers and hides like a... </span></div></span></div>",
            "created":1357508520,
            "id":1503358,
            "title":"Hide"
        },
        "153112212121":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "And prepares to stomp",
                "Takes a closer look"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Takes cover beneath a candy wrapper someone dropped on the floor.<br>\r\n<br>\r\nUnfortunately, the muscle-bound rugby player notices the crinkly wrapper...</span></div></span></div>",
            "created":1360526400,
            "id":1529124,
            "title":"Bug"
        },
        "1531122121212":{
            "author_id":"thulithomas",
            "author_name":"ThuliThomas",
            "choices":[
                "Henry survives"
            ],
            "content":"<div class=\"\"><div> <span>Henry runs from the wrapper as the rugby player kicks it. It flies away and he spots Henry sprinting. He thinksaid he has seen a bug but Henry dives under a lab station corner.<br>\r\n<br>\r\n\"There is a bug in here\", the rugby player grumbles. <br>\r\n<br>\r\n\"I know\", George replies. \"If you see it just kill it.\"<br>\r\n<br>\r\nThe rugby player nods and walks over to a desk. He drops his bag on a desk and walks over to George. Henry follows but keeps under the lab station. They are standing right next to one another but Henry can't see anything above their ankles. A shirt suddenly falls to the ground. It is George's. Another drops and it was the rugby players. Henry pops his head out to see the two making out. Henry keeps walking into the open shocked at what he is seeing. The rugby player looks down and notices Henry.<br>\r\n<br>\r\n\"Guess we found that bug\", he grumbles. He lifts his Nike running shoes over the dumbfounded Henry and slams them down before he even realises the danger. Henry's body crunches under the rugby players body. George and the rugby player stomp and crush Henry further into the ground as they make out. They both look at the flattened body and mumble, \"got what he deserved. \"<br>\r\n</span></div></div>",
            "created":1485885840,
            "id":2271682,
            "title":"Takes a closer look"
        },
        "15311221212121":{
            "author_id":"thulithomas",
            "author_name":"ThuliThomas",
            "choices":[
                "Demario figure the story out",
                "Henry escapes"
            ],
            "content":"<div class=\"\"><div> <span>Henry feels disorientated as all his senses are dead. Suddenly he feels his body peeling off the floor. He feels his sight return as his face returns to its normal shape. He recovers to the point he can stand but shivers at the memory of the pain he just endured. He looks around and it is clear that he is still 3 inches tall.<br>\r\n<br>\r\n\"What's this?\" a voice booms from behind.<br>\r\n<br>\r\nHenry swings around to see Demario but he isn't looking at Henry. He is investigating a blob of white liquid and the few cockroaches around it. Henry only notices Demario's true physical stature and strength now. Demario is in a vest and is effortlessly carrying a huge box filled with metal science equipment. Demario's huge muscles are truly shown and Henry stares in awe. Demario is still investigating the scene but raises his timberland work boot. He slams it down on the cockroaches and the white liquid mixing them into a gel. He laughs and continues to walk with the cockroaches stuck to his shoe. Henry runs but slips in his attempt to flee. Demario is right in front of him. He is cleaning a desk and has his boot resting on a stool. The bodies of the cockroaches hang from the treads like carpets on a rail. Slime drips from their bodies and the treads. The other boot is clean but before Henry can register the danger Demario slams his clean boot on Henry. Demario twists his foot in joy. Henry on the other hand feels pain on a new level but the pungent odor of Demario's feet seems to distract him. Demario pulls off his boot and takes a small jar. He slides the crushed body of Henry into the jar and mumbles. \"This is a different one.\"<br>\r\nHe throws the jar into his bag as Henry's body begins to heal.</span></div></div>",
            "created":1485955080,
            "id":2272011,
            "title":"Henry survives"
        },
        "1531122122":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "No reason he would not like that",
                "A first time for everything"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Have his feet worshipped.<br>\r\n<br>\r\nHe's never had a 3-inch-tall man worship his feet, but there's...</span></div></span></div>",
            "created":1360526340,
            "id":1529123,
            "title":"Have them worshipped"
        },
        "154":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "He needs George's help",
                "He should try to climb to the desktop",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He ran beneath the desk, safe from his brother's careless stomping feet. <br>\r\n<br>\r\nBut, he realized...</span></div></span></div>",
            "created":1360526040,
            "id":1529118,
            "title":"Hides"
        }
    },
    "info":{
        "author_id":"small1",
        "author_name":"Small1",
        "brief_description":"Fifteen years later, the shrink ray is ready to shrink again!",
        "created":1255284000,
        "description":"<td align=\"left\" class=\"norm\">Fifteen years ago...<br>\r\n<br>\r\nA promising scientist by the name of Eric Braysen disappeared, without a trace. What no one knew was that he had invented and tested the world's first shrink ray, a device for reducing the size of any object.<br>\r\n<br>\r\nMore than a decade later...<br>\r\n<br>\r\nA young grad student is about to re-discover the shrink ray, causing a new sequence of events.<br>\r\n<br>\r\nWhen the capability of the device in Eric Braysen's former laboratory is discovered, who will test the shrink ray?<br>\r\n<br>\r\nWho will shrink this time?<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\nHenry Boone is a 24-year-old graduate student helping to dismantle the experimental equipment in a laboratory that once belonged to missing scientist Eric Braysen.<br>\r\n<br>\r\nGeorge Boone is Henry's 29-year-old brother and a coach for the college lacrosse team. He is a typical jock and a former star for the team he now coaches.<br>\r\n<br>\r\nTim Tanner is a fellow grad student. He is 23 and slightly more nerdish in appearance and behavior than Henry. They are friends, but Tim has always been jealous of his friend.<br>\r\n<br>\r\nProfessor Don Dixon. He is 33 years old and Eric Braysen's former lab assistant. His opinion is that the lab should be dismantled and no questions asked.<br>\r\n<br>\r\nTrevor Hughes is a 20-year-old star of the lacrosse team with all the jock mentality of arrogance, domination and attitude implied.<br>\r\n<br>\r\nIvan Grant is a rising 19-year-old star on the lacrosse team.<br>\r\n<br>\r\nDemario Garcia is a 25-year-old custodian employed in the science building, bitter after learning rumors of job layoffs because of budget cuts.<br>\r\n......<br>\r\n<br>\r\nHelpful advice: Additions are welcome, but I don't like one-sentence additions. If you add, try for an entry of at least six to eight sentences. I will edit additions on occasion and although I hate to delete, I may not feel the need to keep one-sentence additions.<br>\r\n</td>",
        "id":1607409,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101740.jpg",
        "last_full_update":1558425300,
        "modified":1558425300,
        "pretty_title":"Testing the Shrink Ray, Again"
    }
}