{
    "chapters":{
        "1":{
            "author_id":"izzytento",
            "author_name":"drp123",
            "choices":[
                "Chico",
                "Chica",
                "Sorpresa (Podria pasar cualquier cosa)"
            ],
            "content":"<div class=\"\"><div> <span>Han abierto en tu ciudad un salón recreativo nuevo!<br>\r\nvas para ver que hay allí y para tu sorpresa ves una maquina de realidad virtual de digimon.<br>\r\ncomo siempre te ha gustado tanto, vas y la pruebas, al ponerte en la maquina te sale un mensaje<br>\r\n<br>\r\n\"¿Quien eres tu?\"</span></div></div>",
            "created":1368311040,
            "id":1588047,
            "title":"Inicio"
        },
        "13":{
            "author_id":"izzytento",
            "author_name":"drp123",
            "choices":[
                "Que bien quiero ser como tu! ",
                "Por favor!! no quiero ser como tu, piedad!",
                "Estupido, es solo un juego, crees que me engañaras?!"
            ],
            "content":"<div class=\"\"><div> <span>Al ver esa pregunta pulsa la tecla \"aleatorio\". <br>\r\nde golpe, todo desvanece y se ve usted enfrente de un espejo, pero algo no va bien... <br>\r\n¡Estas desnudo!<br>\r\n<br>\r\nbuscando algo con que cubrirte aparece Tai Yagami, un chico de 11 años, pelo marrón café, una camiseta azul con estrellas en los hombros, pantalones marrón y cortos, botas anchas y calcetines largos, de piel algo morena pero lo que mas llama la atención son sus gafas encima la cabeza.<br>\r\n<br>\r\n-Me alegra que me hayas elegido, seras yo... - Dijo Tai. Entonces usted ve como poco a poco se contrae hasta la altura de tai, empieza a crecer el pelo, y su piel se vuelve mas morena, te estas volviendo Tai!!!<br>\r\n<br>\r\n-Te pensabas que era un juego? hace rato que no estas en tu mundo, has entrado en la maquina - al decir eso, se asusta e intenta quitar el casco para salir de la partida pero ve que es verdad, no lo lleva, ha entrado dentro del juego...<br>\r\n<br>\r\nentonces al ver la situación se acerca a Tai y le dice:</span></div></div>",
            "created":1368311880,
            "id":1588051,
            "title":"Tai Yagami se presenta!"
        }
    },
    "info":{
        "author_id":"izzytento",
        "author_name":"drp123",
        "brief_description":"Te adentras en un juego de realidad aumentada donde puede pasar cualquier cosa!!",
        "created":1368310920,
        "description":"<td align=\"left\" class=\"norm\">Vas a embarcarte dentro de un juego de realidad virtual, te pondrás el casco y te empezarán a aparecer opciones y situaciones.<br>\r\n<br>\r\n<b>NORMAS</b><br>\r\n-no puede morir el personaje,  es un juego<br>\r\n-todo esta permitido<br>\r\n-puede pasar cualquier cosa</td>",
        "id":1932991,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1368378900,
        "modified":1368378900,
        "pretty_title":"Juego de transformaciones digimon"
    }
}