{
    "chapters":{
        "1":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "File One",
                "File Two",
                "File Three",
                "File Four",
                "File Five"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Please choose which file to load</span></div></span></div>",
            "created":1352955600,
            "id":1468749,
            "title":"Loading Screen"
        },
        "11":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Kanto! The Original Region!",
                "Johto! The Second Generation Region!",
                "Hoenn! The Third Gen Region!",
                "Sinnoh! The Fourth Region!",
                "Unova! The Newest Region!"
            ],
            "content":"<div class=\"\"><div> <span>Hi! You are about to embark on an epic journey through a world filled with mysterious creatures called Pokemon! In this journey you will travel across the land where you will meet new people, make new friends, and face unexpected challenges!  Now first off, where will your journey begin?</span></div></div>",
            "created":1352955600,
            "id":1468759,
            "title":"File One"
        },
        "111":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468767,
            "title":"Kanto! The Original Region!"
        },
        "1111":{
            "choices":[
                "Bulbasaur",
                "Squirtle",
                "Charmander"
            ],
            "content":"<div class=\"\"><div> <span>I walked outside of my house on the day after my thirteenth birthday. My name was Alan, I recently turned thirteen.<br>\r\n<br>\r\nI walked to Professor Oak's Lab, and it was dark inside. \"Hey, what are you doing?\" a girl asked. I turned around to see Daisy Oak, older sister of Blue Oak, a boy who started his adventure a month ago, with his rival Red.<br>\r\n<br>\r\n\"Were you thinking of sneaking into the lab?\" She asked. She was wearing a white lab coat, much like her grandfather, the Professor.<br>\r\n<br>\r\nShe was nineteen years old, so I had to show her at least some respect. \"No Ms. Oak, I was just looking in, see it was my birthday-\" I was cut off by Daisy then smiling. \"Oh, so you're a new Trainer I'm guessing?\" She asked. \"Yeah.\" I said. \"Well my Grandpa is out today, and I have the keys, so I guess I can give you you're first Pokemon.\" Daisy said. \"Great!\" I said, clapping my hands together.<br>\r\n<br>\r\nShe opened the door to the lab, and turned on the lights. \"Come this way.\" She said, leading me to a table with three Pokeballs on it. \"This is Bulbasaur.\" Daisy said, picking up a Pokeball with a sticker labled \"Bulbasaur\" on it, then the same with a Pokeball labled \"Squirtle\" and a third labled \"Charmander\".<br>\r\n<br>\r\n\"So, now you have the run downs of each Pokemon, which would you like as your starter?\"</span></div></div>",
            "created":1353214800,
            "id":1470525,
            "title":"Alan, another Pallet Town Adventurer!"
        },
        "11113":{
            "choices":[
                "Charmander listens and use Scratch to deflect against Tackle",
                "Charmander lets itself get attacked, but then instead of Scratch, uses Ember"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll pick Charmander.\" I said, picking up the Pokeball containing Charmander, and peeling off the sticker.<br>\r\n<br>\r\n\"Why don't you go ahead and call it out right now?\" Daisy asked, smiling. \"Sure.\" I said. \"Charmander! Come on out!\"<br>\r\n<br>\r\nCharmander flashed onto the cold floor of the lab, and looked around. \"Charmander, meet you're trainer, Alan.\" Daisy said, kneeing down, so Charmander is around to her waist. I did the same and bent down, smiling at Charmander.<br>\r\n<br>\r\n\"Why not practice in a battle against my Eevee?\" Daisy asked. \"Sure.\" I said.<br>\r\n<br>\r\nDaisy led me to a battlefield upstairs, and called out her little Eevee. \"Charmander, let's fight.\" I said. Charmander simply blew embers, and seemed to ignore the intiative. \"Eevee, let's use Tackle!\" Daisy said.<br>\r\n<br>\r\n\"Charmander, let's use Scratch!\" I said.</span></div></div>",
            "created":1353293700,
            "id":1470688,
            "title":"Charmander the Feisty"
        },
        "111132":{
            "choices":[
                "A Childhood Friend, Green, arrives",
                "A New Rival, Daniel, arrives"
            ],
            "content":"<div class=\"\"><div> <span>Charmander scoffed at Me, obviously meaning \"I'm gonna ignore you.\", and letting Eevee attack it, sending it to my feet. Charmander got up onto it's feet, and dashed into the air, using Ember.<br>\r\n<br>\r\nEmbers rained on Eevee, damaging it, and for an extra effect, burning it. \"Eevee, let's use Tackle!\" Daisy said. \"Charmander, let's do Scratch this time.\" I said, but Charmander only ignored me. He instead did Ember once more, and damaged Eevee further, before it could lay a paw on him. \"This is looking bad. Alright Eevee, let's go for a more special offense. Shadow Ball!\" Daisy said. Eevee shot a purple ball towards the way of Charmander.<br>\r\n<br>\r\n\"Charmander, since you obviously are gonna use Ember for a while,\" I began. \"Why don't we use Ember to break their Shadow Ball!\" Charmander finally smiled at this, and blew Embers into the Shadow Ball, making it explode into dust, and then using it again to put the last hit onto Eevee, making it faint.<br>\r\n<br>\r\n\"Great Job Eevee. You did you're best.\" Daisy said, returning Eevee to her Pokeball. \"Great job Charmander!\" I said, as my Charmander jumped onto my shoulder. \"I see, you're just like Red.\" Daisy acknowledged. \"What?\" I asked. \"When he first got his Pikachu, it was disobedient to him too. They quickly became friends after the practice battle.\" Daisy explained.</span></div></div>",
            "created":1353329220,
            "id":1470900,
            "title":"A Fiery First Battle!"
        },
        "1111321":{
            "choices":[
                "Onto Route 1, An Adventure Awaits! (R)",
                "Onto Route 1, An Adventure Awaits!"
            ],
            "content":"<div class=\"\"><div> <span>Just as I was about to leave the lab, Green, a childhood friend of mine, arrives, and bumps into me. \"Sorry.\" She said gently, helping me off the ground. \"It's okay.\" I said, accepting her help. \"Oh Green, you arrived.\" Daisy said. \"Yeah, sorry I'm late, you know I'm a serious sleeper, then I wake up with bedhead, and I have to spend like, thirty minutes doing my hair-\" Green realized she was rambling, and quickly stopped. \"I see you picked Charmander, Alan.\" Green said.<br>\r\n<br>\r\n\"Now, because of knowing you have Charmander, I know which of remaining starters to choose.\" Green said. \"Oh great.\" I said. She ran over to the table, and picked up the Pokeball, and peeled off the sticker, which said \"Squirtle\"<br>\r\n<br>\r\n\"So Green, now that my Eevee has rested a bit, why not have a practice battle to get acquainted with Squirtle?\" Daisy asked. \"No, me and Squirtle will get along just fine.\" Green said, sending out Squirtle.<br>\r\n<br>\r\nSquirtle looked shy, and he hid behind Daisy's leg. \"Don't worry Squirtle, that girl is your new Trainer.\" Daisy said, ushering Squirtle over to Green. Charmander was much taller than Squirtle, as Charmander was the first born of the three, Bulbasaur the second, and Squirtle the third. Squirtle slowly came out from behind Daisy's left leg, and slowly stepped over to Green's foot.<br>\r\n<br>\r\nGreen bended down, so she was eye to eye with Squirtle. She gave a gentle smile, and Squirtle smiled back, quickly realizing this was a nice girl, and jumping onto the right shoulder of her sleeveless, black leather tank top.<br>\r\n<br>\r\nSquirtle rubbed it's head on Green's neck, showing they were now friends. Green stood up, and grabbed my arm as we left the lab.<br>\r\n<br>\r\n\"So, Alan. How about we become rivals, but we travel together?\" Green asked, taking both of my hands. \"Sure, I guess.\" I said. Charmander smiled at Squirtle, as if they were saying \"Glad to become rivals!\"</span></div></div>",
            "created":1353365580,
            "id":1471225,
            "title":"Friends to Rivals"
        },
        "11113211":{
            "choices":[
                "Spotting of Team Rocket! (R)",
                "Spotting of Team Rocket!"
            ],
            "content":"<div class=\"\"><div> <span>I and Green stepped onto Route 1, and felt the cold wind blowing on our shoulders. \"Who knew excitement for adventure would arise just by taking a mere step onto a route?\" Green asked me, smiling. \"Yeah,\" I said. \"Hey, since we ARE rivals and all, maybe we should have a battle?\" \"Hmm, sure!\" Green answered, smiling at me. \"I know the perfect part of the route!\"<br>\r\n<br>\r\nGreen took my arm, and led me through a patch of tall grass, leading to a ledge heading up a cliff, with a circular grass clearing. \"This place should be good, right?\" Green asked, giving me her cutest smile.<br>\r\n<br>\r\n\"Yeah, it's perfect.\" I said. We walked to either edges of the circular field, and called our Pokemon to the field from our shoulders. Charmander jumped to the field, and Squirtle rolled to the field using it's shell.<br>\r\n<br>\r\n\"Charmander, since we're battling a water-type this time, we can't just go crazy with Fire Attacks, we need to find a medium point.\" I said. Charmander smiled at me, and gave me the thumbs up sign. \"Squirtle, let's just craze out with our Water Attacks!\" Green said.<br>\r\n<br>\r\n\"Charmander, let's start off with Scratch!\" I said. Charmander jumped, turning it's left and right paws into short claw-like spears, and scratched continuously at Squirtle. \"Squirtle, push him back with Water Gun!\" Green said. \"Charmander, dodge and Scratch from above!\" I said. Charmander launched into the air, landed on the back of Squirtle's shell, and scratched at the back of it's head.<br>\r\n<br>\r\n\"Rapid Spin to throw Charmander off!\" Green said. Squirtle spun at a high speed, and threw Charmander into a tree. \"Charmander, let's use Ember!\" I said. \"Squirtle, Water Gun!\" Green said.<br>\r\n<br>\r\nThe two moves collided, and and a fog of smoke tore upon Route 1.<br>\r\n<br>\r\n(\"Now use Scratch!!\")<br>\r\n<br>\r\nWhen the fog cleared, Charmander was still standing, but Squirtle had been knocked out. \"But Squirtle was fine before the fog, how did he faint?\" Green asked. \"That's easy, under the fog, I had commanded Charmander to use Scratch, and that was an easy knockout.\" I answered. Green returned Squirtle to his Pokeball, and came over, and slapped me across the face.<br>\r\n<br>\r\n\"That was a cheap move Alan!\" She shouted in my face. She then planted a kiss on my cheek, \"But a Smart one nontheless.\" She then said.<br>\r\n<br>\r\nShe walked alongside me as we continued onto the Pokemon Center in Viridian City</span></div></div>",
            "created":1353416280,
            "id":1471625,
            "title":"Onto Route 1, An Adventure Awaits!"
        },
        "111132111":{
            "choices":[
                "Continue on through Viridian Forest (R)",
                "Continue on through Viridian Forest"
            ],
            "content":"<div class=\"\"><div> <span>After buisness in Viridian City was finished (Healing our Pokemon, buying Potions and other items)<br>\r\n<br>\r\n\"So, Alan.\" Green said, \"Do you think I should catch a Pokemon in Viridian Forest?\"<br>\r\n<br>\r\n\"Well there are many extravagent Pokemon in the forest. I feel like I want to catch a Pikachu. I'm sure everyone would get along.\" I said. \"But, there are reports there's been a spotting of Bulbasaur in the forest.\"<br>\r\n<br>\r\n\"Really? Wasn't that one of the Starter Pokemon back at the lab?\" Green asked. \"Yeah, though they're still quite rare to find.\" I said.<br>\r\n<br>\r\nWe entered the Forest, when something very fast flew by our faces. \"What in god's name was that?\" I yelled. \"I don't know.\" Green said, before we were pushed out of the way by thugs in black outfits with both a red \"R\" on the front and back of their suit.<br>\r\n<br>\r\n\"So, now that that's over with.\" I said, helping Green up, but she came to close to me, and we accidentally kissed eachother on the lips.<br>\r\n<br>\r\nIt was amazingly held for at least a minute, but then Green broke the kiss. \"Ugh, sorry about that, Alan.\" Green says, blushing. \"No, it was okay.\" I said, breaking my own medium blush.</span></div></div>",
            "created":1353503100,
            "id":1472344,
            "title":"The Kiss"
        },
        "1111321111":{
            "choices":[
                "Fighting and Catching Pikachu (R)",
                "Fighting and Catching Pikachu"
            ],
            "content":"<div class=\"\"><div> <span>As she and I continued through the forest, fighting off Bug Catchers and Wild Pokemon, I had been thinking about what happened before. The kiss that accidentally happened. I couldn't get it off my mind.<br>\r\n<br>\r\n\"Hey Green, what's that?\" I asked, as we came across flashes of white and yellow light. \"I don't know.\" Green asked. We snuck around the trees, and saw two Pikachu. One with a flat ended tail, and another with a curve ended tail.<br>\r\n<br>\r\n\"Aww, they're so cute.\" Green said. \"Maybe I should catch one?\" I asked. \"Sure, I'll get one too.\" Green said. \"Charmander!\" I said. \"Squirtle!\" Green said.</span></div></div>",
            "created":1353518400,
            "id":1472438,
            "title":"Finding Pikachu!"
        },
        "112":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468768,
            "title":"Johto! The Second Generation Region!"
        },
        "113":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468770,
            "title":"Hoenn! The Third Gen Region!"
        },
        "114":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468771,
            "title":"Sinnoh! The Fourth Region!"
        },
        "1141":{
            "choices":[
                "T-shirt,shorts,scarf,hat and tennies",
                "Hoodie,and jeans and boots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah so your a boy well then lets begin.<br>\r\n <br>\r\nyou are sleeping soundly when you are rudely awoken by a starly flying in your window \"starly!!\" it cherped<br>\r\n <br>\r\nyou go to you dresser and pull out a</span></div></span></div>",
            "created":1409842200,
            "id":1852295,
            "title":"Boy "
        },
        "11411":{
            "choices":[
                "the day you go with the professer to catch pokemon",
                "the day you go out with your neighbor into the routes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After your dressed your mom calls from downstairs \"Honey are you up yet todays a big day.\"<br>\r\n<br>\r\nThen you relise today is </span></div></span></div>",
            "created":1409842560,
            "id":1852300,
            "title":"Big day."
        },
        "114111":{
            "choices":[
                "14",
                "18"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I forgot to ask befor you start your adventure. How old are you?</span></div></span></div>",
            "created":1409843160,
            "id":1852306,
            "title":"But first"
        },
        "11412":{
            "choices":[
                "the day you go with professer to catch pokemon",
                "the day you go out with your nieghbor into Sinnoh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After your dressed your mom calls from downstairs \"Honey are you up yet todays a big day.\"<br>\r\n <br>\r\nThen you relise today is </span></div></span></div>",
            "created":1409843460,
            "id":1852311,
            "title":"Big day"
        },
        "114122":{
            "choices":[
                "your friend a girl named ??? (you decide)",
                "your friend a guy named ??? (you decide)"
            ],
            "content":"<div class=\"\"><div> <span>As you rush out the door your stopped by your mom \"Alex before you leave take this.\" Your mom hands you a package \"Thanks i'll open it later.\" <br>\r\nYou knock on the door of your neighbors house you too are the best of friends couldn't be closer even if you tried. As your mind trails of the door opens<br>\r\nyou see<br>\r\n</span></div></div>",
            "created":1409844240,
            "id":1852318,
            "title":"the day you go out with your nieghbor into Sinnoh"
        },
        "1142":{
            "author_id":"mouse108",
            "author_name":"Dark Queen",
            "choices":[
                "t-shirt, skirt and normal undie (bra/panties)",
                "t-shirt skirt unusaul undies (diaper/pull up)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ah so your a girl well then lets begin.<br>\r\n<br>\r\nyou are sleeping soundly when you are rudely awoken by a pidgey flying in your window \"pi pidgey!!\" it cherped<br>\r\n<br>\r\nyou go to you dresser and pull out a </span></div></span></div>",
            "created":1399068780,
            "id":1790442,
            "title":"Girl"
        },
        "115":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468772,
            "title":"Unova! The Newest Region!"
        },
        "12":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Kanto! The Original Region!",
                "Johto! The Second Generation Region!",
                "Hoenn! The Third Gen Region!",
                "Sinnoh! The Fourth Region!",
                "Unova! The Newest Region!"
            ],
            "content":"<div class=\"\"><div> <span>Hi! You are about to embark on an epic journey through a world filled with mysterious creatures called Pokemon! In this journey you will travel across the land where you will meet new people, make new friends, and face unexpected challenges!  Now first off, where will your journey begin?</span></div></div>",
            "created":1352955600,
            "id":1468761,
            "title":"File Two"
        },
        "121":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468779,
            "title":"Kanto! The Original Region!"
        },
        "1211":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Wild Pokemon Encounter!",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span><i>Bzzzzz! Bzzzzz! Bzzzzz!</i><br>\r\n<br>\r\nA hand reached over and smacked the snooze button on the alarm clock accidentally knocking it to the ground. The alarm clock hit the carpeted floor with a thud, but was undamaged. Moments later the alarm clock was lifted off the floor by an invisible force and was set back on the dresser next to the bed. Sixteen year old Alexander yawned deeply as he slowly sat up, still in a sleepy, groggy state.<br>\r\n<br>\r\n\"Thanks Grace.\" He said, half yawning and stretched his arms up into the air.<br>\r\n<br>\r\n\"Ralts! Ralts!\" A cheerful voice chanted.<br>\r\n<br>\r\nA small, white Pokemon walked into his room with a smile on its face.<br>\r\n<br>\r\n\"Ralts! Ralts!\" The Ralts continued to say cheerfully, almost as if it was saying 'Good Morning!'<br>\r\n<br>\r\nAlexander smiled, still half asleep as he slid out from underneath the covers. He moved to the edge of the bed and placed his feet on the floor. Grace moved over to him and used her psychic powers to lift herself onto the bed. She gently patted him on the shoulder with her short arms. Alexander looked over to her and smiled as she smiled back at him. He remembered the first day he found Ralts. About ten years ago, Alex and his parents were on a vacation cruise that went from Vermillion City in Kanto to Lilycove City in Hoenn for a few hours and then back to Vermillion. Once they arrived back in Vermillion, Alex had discovered the lost and scared Ralts; He tried to help her and Ralts, using her psychic powers to sense Alex's good nature, clung to him for protection and began crying. Alex showed his parents the lost Ralts and they agreed to let him keep her. And her she was now. Over the years, they became the best of friends.<br>\r\n<br>\r\n\"ALEXANDER KYLE PARKER!\" A female voice shouted out.<br>\r\n<br>\r\n\"Uh oh....\" Alex tensed up.<br>\r\n<br>\r\nThat was his mom that called him and she only said his full name when he had done something wrong! A woman appeared at the door to Alex's room. She appeared to be in her late thirties.<br>\r\n<br>\r\n\"Alex,  you need to get ready. I will not having you being late on your big day!\" His mother said.<br>\r\n<br>\r\nAlexander ran his hands through his medium length black hair. A habit of his for when he was nervous. <br>\r\n<br>\r\n\"Thats right.....Today is the day I get my Trainer Card from Professor Oak!\" He suddenly remembered.<br>\r\n<br>\r\n\"Thats right. Go shower and get dressed. Grace and I will pack everything that you need.\" He mother said.<br>\r\n<br>\r\n\"Yes Ma'am!\" Alex dashed off of the bad. <br>\r\n<br>\r\nHe quickly grabbed a change of clothes and ran into the shower.<br>\r\n<br>\r\n............................................................................ ...................................................<br>\r\n<br>\r\nAlex was set and ready to go. He wore a black shirt with a red vest over it, dark blue jeans, and red and black tennis shoes. He also wore a black beret hat with a red Pokeball outline printed on the front. His mom looked him over, adjusting his vest and hat before looking satisfied.<br>\r\n<br>\r\n\"There!\" She smiled. \"You look handsome!\"<br>\r\n<br>\r\n\"Thanks mom.....\" He sighed a bit.<br>\r\n<br>\r\nGrace came up to him with his black and white backpack floating next to her.<br>\r\n<br>\r\n\"Thanks.\" He said to her as she handed it to him.<br>\r\n<br>\r\nHe slipped his arms into the straps and put the backpack on. He looked over to his mom, who was smiling, but also seemed to be tearing up a bit. <br>\r\n<br>\r\n\"Mom....\" Alex started to say.<br>\r\n<br>\r\n\"I wish your dad was here to see this.\" His mother started. \"He would be so happy and sad to see you leaving.\"<br>\r\n<br>\r\nAlex frowned a bit.<br>\r\n<br>\r\n\"Mom....I'll be okay.\" He said.<br>\r\n<br>\r\n\"I know you will.\" She said. \"Especially with Grace with you.\"<br>\r\n<br>\r\nAlex was about to object, but his mom stopped him.<br>\r\n<br>\r\n\"Alexander Kyle Parker!\" She said. \"Grace wants to go with you and I want her to go with you, we will not take no for an answer!\"<br>\r\n<br>\r\nAlex, who was caught off guard, looked over at Grace. She smiled and nodded, agree with his mother.<br>\r\n<br>\r\n\"Okay.\" Alex said. \"It'll be great to have her along.\"<br>\r\n<br>\r\nGrace went over to Alex and hugged his leg.<br>\r\n<br>\r\n\"Okay you two.\" His mother said. \"You're running out of time as it is. No son of mine will be late on one of the most important days of his life.\"<br>\r\n<br>\r\nShe started pushing them towards the door.<br>\r\n<br>\r\n\"Good bye honey! I'll miss you! Come back to see your mother soon!\" She said as she pushed them out of the house and shut the door.<br>\r\n<br>\r\nAlex smiled a bit.<br>\r\n<br>\r\n\"Come on Grace! Lets get going!\" He said.<br>\r\n<br>\r\n............................................................................ ..........<br>\r\n<br>\r\nAlex and Grace arrived at Professor Oak's lab. They slowly walked up to the door and Alex knocked. The door was open a few seconds later by an older man in a lab coat.<br>\r\n<br>\r\n\"Ah!\" The man smiled. \"You must be Alex Parker.\"<br>\r\n<br>\r\n\"Yes sir, Professor.\" Alex replied.<br>\r\n<br>\r\n\"You're the first one to arrive.\" Professor Oak said. \"Come on in.\"<br>\r\n<br>\r\nAlex and Grace walked into the lab and followed the Professor to a hi tech looking room with a device in the middle. Three Pokeballs were in the device.<br>\r\n<br>\r\n\"Lets get right to it.\" Oak said. \"Here is your Pokedex\" <br>\r\n<br>\r\nThe Professor handed Alex a black device that looked a lot like a cell phone. The device had a small screen with a red 'Pokeball' dial underneath it.<br>\r\n<br>\r\n\"The Pokedex will automatically record data on Pokemon you've seen or caught. It also functions as your Trainer Card.\" The Professor said.<br>\r\n<br>\r\n\"Thank your Professor.\" Alex said as he slipped the Pokedex into his pocket.<br>\r\n<br>\r\nThe Professor to a quick look at Grace.<br>\r\n<br>\r\n\"I see you already have a Pokemon and a rare one at that!\" Oak said. \"Ralts are rare around here. According to the Pokemon League rules, you are still allowed to pick a starter if you wish to.\"<br>\r\n<br>\r\n\"No Thank you, Professor.\" Alex replied. \"I already have a Pokemon. Give it to another beginning Pokemon Trainer that doesn't have a Pokemon.\"<br>\r\n<br>\r\n\"Alright then.\" Oak nodded. \"Well you're all set for your journey.\"<br>\r\n<br>\r\n\"Thank you again Professor\" Alex waved as he and Grace heading out of lab.<br>\r\n<br>\r\n\"No problem.\" The Professor called out. \"Best of luck to you, Alex.<br>\r\n<br>\r\n............................................................................ ..............................<br>\r\n<br>\r\n\"Well, there's the path to Route 1, Grace.\" Alex said as he looked forward down the path surrounded by trees. \"Lets take our first steps together.\" He said as he looked down at the Pokemon, with a smile on his face.<br>\r\n<br>\r\nGrace looked up at him, a smile on her face, and nodded.<br>\r\n<br>\r\n\"Alright.\" He said. \"1...2...3...\"<br>\r\n<br>\r\nHe and Grace started down Route 1 side by side.</span></div></div>",
            "created":1371362880,
            "id":1611780,
            "title":"Alexander! The rookie trainer of Pallet!"
        },
        "122":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468778,
            "title":"Johto! The Second Generation Region!"
        },
        "1221":{
            "choices":[
                "Left",
                "Right"
            ],
            "content":"<div class=\"\"><div> <span>           Left. Right. Left. Right. Stone. Twig. Left. Pidgey flew to the right. Step. Step. Step. Must keep going. Can not stop now. They will find me. They will catch me. I have to move faster. But my legs won't let me. If I quit they will get me. Left. right. Forward. My name, Talon, is almost a curse in every known town. I am hunted everywhere I go. I am safe nowhere. Must keep moving. My family is gone. my life, ruined. Because of one person. And I will have my revenge. Someday. But as for today... Left. Right. Left. Right. Stop. Look around. Two paths. one left. other right. must choose. which one?</span></div></div>",
            "created":1353284520,
            "id":1470590,
            "title":"Talon"
        },
        "123":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468775,
            "title":"Hoenn! The Third Gen Region!"
        },
        "124":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468774,
            "title":"Sinnoh! The Fourth Region!"
        },
        "125":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468773,
            "title":"Unova! The Newest Region!"
        },
        "13":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Kanto! The Original Region!",
                "Johto! The Second Generation Region!",
                "Hoenn! The Third Gen Region!",
                "Sinnoh! The Fourth Region!",
                "Unova! The Newest Region!"
            ],
            "content":"<div class=\"\"><div> <span>Hi! You are about to embark on an epic journey through a world filled with mysterious creatures called Pokemon! In this journey you will travel across the land where you will meet new people, make new friends, and face unexpected challenges!  Now first off, where will your journey begin?</span></div></div>",
            "created":1352955600,
            "id":1468762,
            "title":"File Three"
        },
        "131":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468784,
            "title":"Kanto! The Original Region!"
        },
        "132":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468781,
            "title":"Johto! The Second Generation Region!"
        },
        "133":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468780,
            "title":"Hoenn! The Third Gen Region!"
        },
        "134":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468782,
            "title":"Sinnoh! The Fourth Region!"
        },
        "135":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468783,
            "title":"Unova! The Newest Region!"
        },
        "14":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Kanto! The Original Region!",
                "Johto! The Second Generation Region!",
                "Hoenn! The Third Gen Region!",
                "Sinnoh! The Fourth Region!",
                "Unova! The Newest Region!"
            ],
            "content":"<div class=\"\"><div> <span>Hi! You are about to embark on an epic journey through a world filled with mysterious creatures called Pokemon! In this journey you will travel across the land where you will meet new people, make new friends, and face unexpected challenges!  Now first off, where will your journey begin?</span></div></div>",
            "created":1352955600,
            "id":1468764,
            "title":"File Four"
        },
        "141":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468791,
            "title":"Kanto! The Original Region!"
        },
        "1412":{
            "choices":[
                "Firestone",
                "Waterstone",
                "Thunderstone"
            ],
            "content":"<div class=\"\"><div> <span>           I was walking down a small path, just wandering aimlessly. Bird pokemon flew from tree to tree, bugs went on in search of food, other larger pokemon moved through the forest, only audible to those with the keenest ears. I walked on, not a care in the world. My partner, the only creature to ever care about me, followed at a distance, staying away at my request. I didnt want anything to dsturb the precious peace of that moment, one I knew would not last. My left foot hit a medium rock, turnng it over and stirring up dust. Suddenly, I saw a glimmer of something in front of me. i bent down, my hand skimming over the dround. the light source, the stone I kicked, was no ordinary stone. it was a...</span></div></div>",
            "created":1353214800,
            "id":1470506,
            "title":"Girl"
        },
        "142":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468789,
            "title":"Johto! The Second Generation Region!"
        },
        "143":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468788,
            "title":"Hoenn! The Third Gen Region!"
        },
        "144":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468787,
            "title":"Sinnoh! The Fourth Region!"
        },
        "145":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468785,
            "title":"Unova! The Newest Region!"
        },
        "15":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Kanto! The Original Region!",
                "Johto! The Second Generation Region!",
                "Hoenn! The Third Gen Region!",
                "Sinnoh! The Fourth Region!",
                "Unova! The Newest Region!"
            ],
            "content":"<div class=\"\"><div> <span>Hi! You are about to embark on an epic journey through a world filled with mysterious creatures called Pokemon! In this journey you will travel across the land where you will meet new people, make new friends, and face unexpected challenges!  Now first off, where will your journey begin?</span></div></div>",
            "created":1352955600,
            "id":1468765,
            "title":"File Five"
        },
        "151":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468793,
            "title":"Kanto! The Original Region!"
        },
        "152":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468794,
            "title":"Johto! The Second Generation Region!"
        },
        "1521":{
            "choices":[
                "Damion follows Kris, hoping for a battle",
                "Damion follows Kris, and punches her in the face, acting as it's revenge",
                "Damion has Franziska use a powerful move on Kris"
            ],
            "content":"<div class=\"\"><div> <span>Damion woke up that morning, the morning that would change his life, maybe forever. He got out of bed and got dressed, and walked downstairs, and saw a note on the fridge, a note from his mother.<br>\r\n<br>\r\n<i>Dear Damion,<br>\r\nSorry that I'm not here the moment you leave, I'm probably doing my requested filling-in for Nurse Joy at the Blackthorn City Pokemon Contest. With this letter, if you look to the left on the counter, you will see a Pokeball. Inside that Pokeball is Franziska, the most recent child of my Espeon. I've already taken in the courtesy of evolving her to an Espeon, so I'm sure she will be beneficial to your journey.<br>\r\nWith Love, Mom.</i><br>\r\n<br>\r\n\"Come on out Franziska!\" Damion said, letting out the Eeveelution he'd be using as his very first Pokemon. \"Espi!\" the Espeon cried in happiness, pouncing on Damion.<br>\r\n<br>\r\n\"You're a riley one, aren't you?\" Damion said. He walked out of the house with Franziska, greeted by the refreshing spring breeze of New Bark Town. \"Hey dork!\" Kris Elm, the town bully said, pushing Damion down. \"Kris, I'm not in the mood.\" Damion said, as he got up off his butt. \"Espi?\" Franziska asked in a questionable manner.<br>\r\n<br>\r\n\"That's Miss Krystal Elm to you! Dweeb.\" Kris said, leaving. \"At least I have a Pokemon that will fight for me.\"<br>\r\n</span></div></div>",
            "created":1358294160,
            "id":1509384,
            "title":"Brand New Beginning"
        },
        "153":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468795,
            "title":"Hoenn! The Third Gen Region!"
        },
        "154":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468796,
            "title":"Sinnoh! The Fourth Region!"
        },
        "155":{
            "author_id":"blazing210",
            "author_name":"Blaze",
            "choices":[
                "Boy ",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Uhhhh....Nope I can't quite tell. Help me out here. Are you a boy or a girl?</span></div></span></div>",
            "created":1352955600,
            "id":1468797,
            "title":"Unova! The Newest Region!"
        }
    },
    "info":{
        "author_id":"blazing210",
        "author_name":"Blaze",
        "brief_description":"Follow your character as you embark on a Pokemon journey where you make all the choices!",
        "created":1353038880,
        "description":"<td align=\"left\" class=\"norm\">You're about embark on an incredible journey through the Pokemon world! You'll make all the choices, included your character's gender, charcter's name, character's appearance, and the region traveled. Due to story reason I would like for all the main characters to have a universal age between fifteen and seventeen, anything that says otherwise will be altered or deleted.<br>\r\n<br>\r\nRules:<br>\r\nPlease nothing too adult. This story was rated 13+, but now it is 18+ so I've given you a bit of freedom.<br>\r\nDon't go overboard with the cuss words.<br>\r\nPlease make additions at least a paragraph long and have decent grammar. I know we aren't all perfect, but any additions that don't meet the criteria will be deleted.<br>\r\nRomance is allowed.This is an adventure story and what would an adventure be without a little romance. Once again, the story is 18+ so you have a bit more freedome.<br>\r\nCharacters can be killed off just no killing off the main character. Don't get too gory when describing death scenes.<br>\r\nNothing else too weird.<br>\r\nBesides that any else goes.<br>\r\nOnce the story gets going I'll started adding to the story daily.<br>\r\nEnjoy!</td>",
        "id":1903771,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1409844240,
        "modified":1409844240,
        "pretty_title":"Pokemon: The Interactive Adventure"
    }
}