{
    "chapters":{
        "1":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "New character.",
                "New character.",
                "New character.",
                "New character.",
                "New character."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nMy name is Li Hercules. My mother was from Atlantis and my father was from Utopia. We all now reside in the kingdom of Olympus. I was always very strong for my age; even as a child I could wield my father's double headed war hammer with ease. He gave it to me as a gift upon being accepted to Ares Academy. It was the most highly acclaimed school that trains young witches and mad scientists to fight the many different monsters left behind by the terrible war between the two great powers. Well, despite what history tells us, I truly believed that it was a war of three great powers. I have met many 'normal' humans who could easily hold their own in a fight against the monsters we call remnants.<br>\r\n<br>\r\nWhat was more exciting was that I was accepted two years early due to a flawless victory in the final exam tournaments in my previous school of Spartan Academy on the island of Crete. This was a great honor in the eyes of my professors and fellow students. It was also a great responsibility. I reminded myself to stay focused when attending classes and try to stay calm in battle. I did not wish to force those who put me here to reconsider their decision; that would be a disgrace. No pressure, right?<br>\r\n<br>\r\nI looked out the window of the airship carrying my fellow students and I at the mountains below that most all became active volcanoes during the terrible war. I then looked ahead and saw Ares Academy for the first time. The architects who designed it used the ancient Greek temples as their inspiration. Every aspect of it looked as if the ancient city of Rome had returned to its previous golden age but with a modern twist including a Colosseum where the tournaments were to take place.<br>\r\n<br>\r\n\"It's magnificent.\" Whispering, I muttered.<br>\r\n<br>\r\n\"It certainly is.\" Remarked a voice behind me.<br>\r\n<br>\r\nI turned to find...<br>\r\n </span></div></div>",
            "created":1459659600,
            "id":2127118,
            "title":"Li Hercules"
        },
        "11":{
            "author_id":"kittee",
            "author_name":"Kittiara",
            "choices":[
                "Introduce another character",
                "Interact with Kim"
            ],
            "content":"<div class=\"\"><div> <span><b>Kim Meridian POV</b><br>\r\n<br>\r\n<b>Introduction:</b> Kim Meridian was born and raised in Olympus. Having grown up the child of two powerful magical warriors, she is under a lot of pressure to live up to their expectations. Instead, she is shy, and awkward, and she yearns for lasting peace. She feels that it might be best to reach out to the monsters, to try and understand them. Because of her doubts, she is afraid to unleash her magical potential. Now that she is sixteen years old, however, she has to choose her path in life.<br>\r\n<br>\r\n~~~<br>\r\n<br>\r\nI don't know why I spoke out. I guess it was the relief of having found another new student. When the boy turned around, though, I looked down at my hands. They were clutching a small bag of my belongings.<br>\r\n<br>\r\nI have never been forward. Both my mother and father have an overbearing presence, each of them a genius in their own right. My father is of French heritage, my mother British. Of course, both of those once great nations have been destroyed. I only know them through stories. <br>\r\n<br>\r\nRealising something more might be expected of me, I said, \"Hi.\" And that was all I could manage.<br>\r\n<br>\r\n<i>Great start, Kim. No introduction, no questions, just \"Hi\". If Mom were here, she'd give me that look. The one of complete and utter disappointment. The one I should be used to by now...</i></span></div></div>",
            "created":1459659600,
            "id":2127341,
            "title":"Kim Meridian"
        },
        "112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Arriving at Ares Academy.",
                "continue.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nI bowed slightly to the girl who had approached us and noticed she had mysterious crystal colored eyes that shimmered like real diamonds. It was an extremely rare trait, one that almost literally screamed powerful magic user. That with her doll like frame and near perfectly tan skin, she bared a strong presence though I somehow doubted she knew that.<br>\r\n<br>\r\n\"Hi.\" Smiling, I replied. \"I am Li. Li Hercules. This is Azuma and Diana Logy.\"<br>\r\n<br>\r\n\"Kim. Kim Meridian.\" Bowing slightly, Kim said. \"S-Sorry for the intrusion.\"<br>\r\n<br>\r\n\"There's nothing to be sorry about, Kim.\" Politely, Diana said. \"Ares Academy is literally the hardest school to get accepted to. We are all under a lot of pressure due to high expectations from our family, friends, and former professors.\" She smiled. \"Look at me; I'm a normal, one of the very first to ever be accepted there. Talk about pressure.\"<br>\r\n<br>\r\nKim smiled slightly as if relieved. \"I'm hoping to make my family proud.\"<br>\r\n<br>\r\n\"We all are, Kim.\" Calmly, Azuma said. \"I too come from a long line of powerful warriors. Still our best is all that can be expected of us.\" Her face turned serious. \"Fear not the future and dwell not in the past; it will only distract you from the present and before you know it, the present will become the past.\"<br>\r\n</span></div></div>",
            "created":1459746000,
            "id":2127468,
            "title":"Interact with Kim"
        },
        "1122":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Arrival at Ares Academy.",
                "A professor approaches us.",
                "continue."
            ],
            "content":"<div class=\"\"><div> <span>\"How did you know my name?\" Curious, Azuma inquired.<br>\r\n<br>\r\nI smiled, pointing at her blouse. \"Your name tag, of course.\"<br>\r\n<br>\r\nAzuma blushed slightly. She was a rather odd looking girl, one or two years older than me. Hanging from her hip was a katana style sword that looked as if it had seen a lot of action in its time. The color of the sword did not exactly match the rest of her outfit but I was not a fashion expert so I did not make mention of it. From her pale skin to her long flowing blue locks that kissed her hips, her overall appearance was unique to say the least. She was barefooted but had anklets on her legs; I guessed she was a dancer.<br>\r\n<br>\r\nShe kept a neutral expression as she eyed us; he yellow eyes looking everyone, especially me up and down. She tapped her elaborate lance on the floor once before tilting her head, and then saying \"Mhm.\"<br>\r\n<br>\r\nMy eyes widen slightly, realizing she was waiting for me to speak. \"I hail from Olympus.\"<br>\r\n<br>\r\nThe girl nods then takes my hand and shakes it, her skin is really soft. \"I hail from Babylon.\"<br>\r\n<br>\r\n\"Do you have a monster that you control then?\" Curious, I asked.<br>\r\n<br>\r\nAzuma nodded. \"Yes, it's a dragon of sorts. I can summon him at will.\"<br>\r\n<br>\r\n\"A dragon? Impressive, how were you able to tame it?\" I inquire with some awe, most beasts are the simple sorts. A dragon is a rarity these days.<br>\r\n<br>\r\n\"It was a rampaging monster, but I used my skills to tame it. As you might have guessed by my attire I am a dancer, I am a witch as well. I used the pair in conjunction to convince it to change it's ways and follow my beck and call. My parents were so pleased by my actions that I requested I travel here.\" Azuma states, her expression still neutral.<br>\r\n<br>\r\nI smiled politely. \"That's awesome Azuma, I'm sure you'll do great. I'm kinda of a new addition here, I got moved ahead due to my abilities and talents. I hope I can live up to them.\"<br>\r\n<br>\r\nAzuma let out a little smile, for a dancer she's not very expressive. Though that might just be due to being in her element. \"Thank you Li.\" she says after it, something about Azuma just seems odd though. But I can't put my finger on it, then again I've just met her.<br>\r\n<br>\r\n\"I'm glad to hear I'm not the only student to be skipped ahead.\" Calmly, a Diana said.<br>\r\n<br>\r\nAzuma, Kim, and I turned to Diana, curious. She was a short young girl with shoulder length auburn hair and green eyes. She wore bluejeans overalls with a long sleeve pink shirt and a red scarf hanging loosely around her neck. On her feet were heavy black boots with steel armor on the toes. She also wore black finger-less gloves. Standing next to her was a large wolf with glowing blue eyes. At first, I believed it to be a small remnant Lupus or werewolf. However, upon seeing metal under a recent slash injury, I realized that it was a robot.<br>\r\n<br>\r\n\"I'm Diana 'techno' Logy.\" With a slight bow, the girl said. \"I hail from Utopia.\" She motioned to the robot dog. \"This is Husky; my best friend and partner since I was a little girl.\" She giggled. \"My father built him to protect me and I have been modifying him ever since.\"<br>\r\n<br>\r\n\"I see...\" Calmly, Azuma said. \"Are you a mad scientist then?\"<br>\r\n<br>\r\nDiana shook her head. \"I'm a normal.\" Smiling, she said. \"Don't underestimate me, though. I won top prize in the final exam tournaments in my kingdom over many witches and mad scientists alike.\" She smiled. \"I was told that I am a natural fighter and a fine inventor at an early age.\"<br>\r\n<br>\r\n\"I hope you do well.\" Smiling, I said.<br>\r\n<br>\r\n\"May we all do.\" Smiling in return, Azuma said. \"For the preservation of our world.\"<br>\r\n<br>\r\nDiana, Kim, and I smiled in return.<br>\r\n</span></div></div>",
            "created":1459746000,
            "id":2127693,
            "title":"Introductions. (credit to deus001)"
        },
        "12":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Another person joins in.",
                "Skip to the entrance ceremony.",
                "Your Choice",
                "Your Choice",
                "Your Choice."
            ],
            "content":"<div class=\"\"><div> <span>Li Hercules POV<br>\r\n<br>\r\nNow in my vision was a rather odd looking girl, she was probably two years or one year older than me. At her hip was a sword that looked like a katana, but it looked broken. The blade was chopped at the halfway point with a pointed tip on it, it certainly looked like a worn out sword to be certain. The colour of the blade was in sharp contrast to the rest of the woman's looks. From the pale white colour of her skin to the long flowing blue locks of hair that easily went past her hips, her outfit was peculiar to say the least. She was barefooted but had anklets on her legs, was she some kind of dancer?<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://image.noelshack.com/fichiers/2015/18/1430374407-artworks-fire-emblem-if-3ds.jpg\" target=\"_blank\">http://image.noelshack.com/fichiers/2015...</a><br>\r\n<br>\r\nShe looked at me with a neutral expression, her yellow eyes looking me up and down. The girl taps her elaborate lance on the ground once before tilting her head, and then saying \"Mhm.\"<br>\r\n<br>\r\nMy eyes widen slightly and I cough politely, it seems she's waiting for me to start the ball rolling. \"Are you um, one of the new students here?\" <br>\r\n<br>\r\nThe girl nods, I think she wants me to introduce myself. I offer a hand and say \"I'm Li, Li Hercules from Olympus. Who are you?\"<br>\r\n<br>\r\nShe shakes my hand with the one that's not holding the lance, her skin is really soft. \"I'm Azuma, I hail from Babylon.\"<br>\r\n<br>\r\nBabylon huh? I thought so, given the attire that she is wearing. Light and easy to see. Her hair is just so elaborate, wait a minute if she's from Babylon then.....<br>\r\n<br>\r\n\"Do you have a monster that you control then?\" I ask.<br>\r\n<br>\r\nAzuma nods and says \"Yes, it's a dragon of sorts. I can summon him at will.\"<br>\r\n<br>\r\n\"A dragon? Impressive, how were you able to tame it?\" I inquire with some awe, most beasts are the simple sorts. A dragon is a rarity these days.<br>\r\n<br>\r\n\"It was a rampaging monster, but I used my skills to tame it. As you might have guessed by my attire I am a dancer, I am a witch as well. I used the pair in conjunction to convince it to change it's ways and follow my beck and call. My parents were so pleased by my actions that I requested I travel here.\" Azuma states, her expression still neutral.<br>\r\n<br>\r\nWow. A dancer? Well she certainly looked exotic, even the lance she was using looked fancy. \"That's awesome Azuma, I'm sure you'll do great. I'm kinda of a new addition here, I got moved ahead due to my abilities and talents. I hope I can live up to them.\"<br>\r\n<br>\r\nAzuma lets out a little smile, for a dancer she's not very expressive. Though that might just be due to being in her element. \"Thank you Li.\" she says after it, something about Azuma just seems odd though. But I can't put my finger on it, then again I've just met her.</span></div></div>",
            "created":1459659600,
            "id":2127203,
            "title":"An enigmatic girl....."
        },
        "121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Arriving at Ares Academy.",
                "Your choice.",
                "continue."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\n\"I'm glad to hear I'm not the only student to be skipped ahead.\" Calmly, a feminine voice said.<br>\r\n<br>\r\nAzuma and I turned to find a short young girl with shoulder length auburn hair and green eyes. She wore bluejeans overalls with a long sleeve pink shirt and a red scarf hanging loosely around her neck. On her feet were heavy black boots with steel armor on the toes. She also wore black finger-less gloves. Standing next to her was a large wolf with glowing blue eyes. At first, I believed it to be a small remnant Lupus or werewolf. However, upon seeing metal under a recent slash injury, I realized that it was a robot.<br>\r\n<br>\r\n\"I'm Diana 'techno' Logy.\" With a slight bow, the girl said. \"I hail from Utopia.\" She motioned to the robot dog. \"This is Husky; my best friend and partner since I was a little girl.\" She giggled. \"My father built him to protect me and I have been modifying him ever since.\"<br>\r\n<br>\r\n\"I see...\" Calmly, Azuma said. \"Are you a mad scientist then?\"<br>\r\n<br>\r\nDiana shook her head. \"I'm a normal.\" Smiling, she said. \"Don't underestimate me, though. I won top prize in the final exam tournaments in my kingdom over many witches and mad scientists alike.\" She smiled. \"I was told that I am a natural fighter and a fine inventor at an early age.\"<br>\r\n<br>\r\n\"I hope you do well.\" Smiling, I said.<br>\r\n<br>\r\n\"May we all do.\" Smiling in return, Azuma said. \"For the preservation of our world.\"<br>\r\n<br>\r\nDiana and I smiled in return.<br>\r\n</span></div></div>",
            "created":1459659600,
            "id":2127297,
            "title":"Another person joins in."
        },
        "1211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "At administration.",
                "Zeus gives a short speech.",
                "continue."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nUpon landing at Ares academy, Azuma, Diana and I walked out onto one of the many roads leading towards the administration building just beyond the landing docks. I saw several ships arriving from all five kingdoms with people from all walks of life. Only I also took notice of an airship that seemed to stand apart from the others with a kingdom symbol I never saw before. Azuma seemed to recognize it judging from her slight wince and look of disapproval.<br>\r\n<br>\r\n\"You know the kingdom that airship hails from?\"  Curious, I asked.<br>\r\n<br>\r\nAzuma shook her head. \"That ship is from the newly formed mad science collective.\"  Stress in her voice, she said. \"The old order was run by a psychotic madman known as Xenon Erratic. He was mostly to blame for the start of the war and was executed for his part in it.\"<br>\r\n<br>\r\n\"What do you know of this new collective?\" Darkly curious, Diana demanded.<br>\r\n<br>\r\n\"Not much other than a brief background.\" Sighing, Azuma admitted. \"The family was originally witch born; the Morgana family. Only they married into the mad science collective as part of the peace process and became the Moray family. As a new 'royal' family, very little is known about them.\"<br>\r\n<br>\r\nA muscular man in a strange military uniform walked out of the airship and called out to the people in a loud booming voice. \"Announcing his royal highness, Prince Devlin Moray!\"<br>\r\n<br>\r\nI turned to the ship to see a boy no older than myself walking out of the ship. He was wearing an English style gentleman's suit with knee high riding boots, leather elbow length riding gloves, a top hat and a cane with a huge diamond at the top. The coat tails of his suit were unusually long and moved about as if they had a life of their own. He wore round dark glasses over his eyes and walked in a nonchalant manner that showed little concern over the stares of others.<br>\r\n<br>\r\n\"Thank you, Esquire.\" Calmly, he said. \"However, I am not attending this academy to establish myself as a figure of authority but to prove myself a force for peace on this world.\"<br>\r\n<br>\r\nEsquire bowed respectfully. \"Of course, my prince.\" Quickly, he said.<br>\r\n<br>\r\nDevlin chuckled. \"Relax, old friend. You are attending this academy as well; here we are equals.\"<br>\r\n<br>\r\n\"That's unusual.\" Giggling, Diana commented. \"A prince having to live as equals with 'commoners'?\"<br>\r\n<br>\r\nShe jumped, a slight scream escaping her lips as Devlin suddenly appeared in front of them. Husky was between her and Devlin in the next second, giving a low growl of warning. Devlin smiled and began to gently stroke the robot wolf under its chin. It seemed to calm him for the moment.<br>\r\n<br>\r\n\"I apologize if I startled you.\" Grinning slightly, he said. \"My power is elemental/weather based; I'm still working on using it with subtlety. I am hoping professor Alpha Zeus can help me with that as he possesses the same type of power.\" He then turned to Diana. \"My title of prince holds little weight in these times, dear lady. That and this academy was not built for common people but for the extraordinary, the powerful, those who can evoke change we hope for the better.\"<br>\r\n<br>\r\nDiana smiled. \"I stand corrected.\"<br>\r\n<br>\r\nIntroductions were made and we all walked together towards the administration building where Professor Alpha Zeus was expected to give a short speech before dorm rooms were assigned.<br>\r\n</span></div></div>",
            "created":1460091600,
            "id":2129790,
            "title":"Arriving at Ares Academy."
        },
        "12112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Inside the boy's dorm.",
                "The next morning.",
                "continue."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nProfessor Alpha Zeus was a tall and insanely muscular man in a black business suit wielding a staff that oddly looked like a lightning bolt. He was clean shaven with longish greying black hair and glowing white eyes that seemed to pierce into anyone he gazed at. He raised his staff slightly then touched the concrete floor making a thunderous boom which shook everyone into silence.<br>\r\n<br>\r\n\"Welcome, students to Ares Academy.\" In a booming voice he calmly said. \"You were all accepted here this year for one reason only; you are the best of the best throughout Nero Earth. We have summoned the best professors and veteran warriors to help mold you into even greater guardians.\"<br>\r\n<br>\r\nThree women, triplets, walked up to the mike. They were all professionally dressed only one carried a gold staff while the second had a silver staff and the third carried a staff of bronze. The gold woman spoke first. \"Greetings, I am Alia Siren. The woman of silver is Beta Siren and the woman of bronze is Trina Siren; we are the head teachers of this academy.\"<br>\r\n<br>\r\n\"Nothing you do or say will go unnoticed.\" Darkly, Beta Siren said. \"Good students will be rewarded while poor students will be punished. Do not test us, you will fail.\"<br>\r\n<br>\r\n\"Our door is always open to anyone who wishes to speak about a problem.\" Kindly, Trina said. \"We are here to make you better guardians... failure to defend yourself or others can and will lead to death.\"<br>\r\n<br>\r\n\"Your initiation trials begin tomorrow at sunrise.\" Serious, Zeus announced. \"Be ready; we will be watching every step you take.\"<br>\r\n<br>\r\nHe then raised his staff and brought it down hard. There was a thunderous boom and a flash and then they were gone, no where to be seen.\"<br>\r\n<br>\r\nI looked about to find several teachers pointing to two buildings in the distance and followed the line the boys were making to see an odd figure in the distance.  He was short with dark brown hair and narrow bright glowing blue eyes. I did not see his face but I saw that he was wearing a worn leather jacket with what appeared to be ancient Japanese symbols. I took a step towards the figure to get a closer look only he vanished as if he were a mere illusion. Zeus had said that he had summoned veteran warriors to the school; I wondered if the one I saw was one of them.<br>\r\n<br>\r\nThen a strong man's voice broke my chin of thought. \"Li!\"<br>\r\n<br>\r\nI turned to see a boy slightly older than I in a prefect uniform. \"I'm coming.\" Sighing, I muttered. \"I was just taking in the sights.\"<br>\r\n<br>\r\n\"You will have time for that after the initiation trials.\" Strictly, the prefect said. \"Follow this path you your dorm and get some sleep. Believe me, you will need it!\"<br>\r\n <br>\r\n</span></div></div>",
            "created":1460264400,
            "id":2130766,
            "title":"Zeus gives a short speech."
        },
        "121122":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Li Hercules with his war hammer.",
                "Diana Logy with her robot wolf.",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span><b>Azuma's POV</b><br>\r\n<br>\r\nI woke up the following morning feeling unusually rested and energized. It was almost as if I had months to rest and build my strength after the long journey from Babylon to Olympus. I heard Aqua purring near me and I opened my eyes only to find I was no longer in the girls dorm of the school!<br>\r\n<br>\r\n\"Aqua, what happened?!\" Startled, I asked.<br>\r\n<br>\r\nI got a mental image on a bright flash in the girl's dorm followed by the dragon catching me in mid air after I reappeared above the city ruins outside the Olympus walls. Aqua communicated through mental images, scents, and the color of her scales which change to show her emotions.<br>\r\n<br>\r\n\"We were all teleported here?\" Worried, I asked.<br>\r\n<br>\r\nAqua snorted, giving a firm nod. He understood me perfectly through he responded in his own way, one which I learned to understand. I looked around and spotted my cypher, what used to be called a cellphone, and noticed I had a message waiting from the head master, Alpha Zeus. I activated the message and a hologram of Zeus appeared in front of us.<br>\r\n<br>\r\n\"Greetings, student and welcome to your initiation trial.\" Calmly, he said. \"You and all of the other first year students have been teleported into the walls of this ruins city.\"<br>\r\n<br>\r\n\"This is bad.\" Worried and annoyed, I muttered. \"The remnant monsters are sure to know we are here in the city with a teleport that size!\"<br>\r\n<br>\r\n\"Your mission is simple.\" Remaining calm, Zeus said. \"You must find three other first year students and return to Ares Academy alive. You must find or make your own way through the walls of Olympus without any remnant monsters following.\" He frowned. \"Do not hesitate to kill any monster you encounter or you will be killed. Good luck.\"<br>\r\n<br>\r\nThe hologram then vanished and I turned to Aqua. \"Well, it looks like we need to save some lives before breakfast, old friend.\" Sighing, I said.<br>\r\n<br>\r\nAqua gave a short snort that sounded like a sigh causing me to smile. \"Let's get this done.\"<br>\r\n<br>\r\nBefore we could even start, we heard a loud crash followed by a Kangobra, or a Kangaroo/cobra monster flying through a gaping hole in the wall into the far wall from us with a sick thud! It slid to the floor leaving a trail of green blood on the wall where it had hit. I looked out the hole to find a lone warrior standing in the street.<br>\r\n<br>\r\nI recognized this warrior. It was...<br>\r\n</span></div></div>",
            "created":1460437200,
            "id":2131954,
            "title":"A cruel initiation."
        },
        "1211221":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "The search begins.",
                "Follow a new character.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nThe Kangobra had caught me by surprise but one hit from  Thor, my war hammer, send it flying into a gaping hole in one of the abandoned buildings where I heard it slam into the wall with a satisfying crunch. \"Boom, you're dead.\" Grinning, I said.<br>\r\n<br>\r\nThen a familiar voice yelled out, \"Hey! Watch it!\"<br>\r\n<br>\r\nI looked up and saw Azuma looking down at me with a rather annoyed look on her face with her dragon, Aqua looking down at me as well. Apparently, the gaping hole lead to a rather huge room, likely an old parking garage. I blushed slightly, rubbing the back of my neck to massage away my embarrassment.<br>\r\n<br>\r\n\"Um... Sorry about that!\" With a nervous grin, I said. \"At least we have some breakfast now.\"<br>\r\n<br>\r\nAzuma looked at me as if she were about to be sick. \"You eat remnant monsters?!\" Distaste in her voice, she asked. \"That's disgusting!\"<br>\r\n<br>\r\n\"I was raised to get my meal where ever I can.\" Serious, I said. \"The meat of a Kangobra is filled with more nutrients than any cow you can slaughter. That and the poison of its cobra tail will kill most remnant monsters in seconds. I keep a vial of it to put on Thor when I face a powerful enemy such as an undead warrior or super zombie.\"<br>\r\n<br>\r\nAzuma looked at me for a moment then smiled. \"Oh; you call your weapon Thor.\" She leaped down from the hole with Aqua following. \"We have no time to eat, though. We must find the others and get them back to Olympus.\"<br>\r\n<br>\r\n\"We need to find two others and get back to Olympus.\" Firmly, I countered. \"Look, I want to save as many lives as we can too but small groups have a better chance of making it back alive. We find two others, take them back then search for more.\"<br>\r\n<br>\r\nAzuma nodded. \"Agreed.\"<br>\r\n</span></div></div>",
            "created":1460523600,
            "id":2132492,
            "title":"Li Hercules with his war hammer."
        },
        "12112211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Another warrior attacks the Hawk wolves.",
                "We fight the hawk wolf pack.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nAzuma and I began our search from the rooftops of the buildings with Aqua flying above to offer support when needed. We both kept our ears and eyes open for any other students and for remnant monsters that could literally spring up from anywhere.<br>\r\n<br>\r\n\"It won't be easy finding anyone in an abandoned city this size.\" Frowning, I said. \"It was sheer luck that you and I found each other.\"<br>\r\n<br>\r\n\"Don't be so dramatic.\" Smiling slightly, Azuma said. \"We just need to listen for sounds of battle. The others are bound to encounter the remnant monsters just as we did.\"<br>\r\n<br>\r\nAs if on cue, the sounds of battle exploded in a near by street. I leaped off the roof I was on, sailing across the wide alley onto the next roof! Azuma was right behind, launching herself into the air with a graceful leap on a spout of water around her bare feet! \"Wow...\" Seeing her land, I muttered.<br>\r\n<br>\r\nAzuma grinned then pointed down at the adjoining street. We looked down to find Diana Logy fighting a pack of Hawk wolves with her robot wolf, Husky at her side. She bared a pair of metallic claws on bracelets which she used to slash at the Hawk wolves along with a light but razor sharp sword. Still, the two were greatly out numbered and they both looked to be injured.<br>\r\n<br>\r\n\"We need to get down there!\" Leaping up onto the ledge, I yelled. \"They need help!\"<br>\r\n<br>\r\nAzuma nodded. \"Agreed!\"<br>\r\n<br>\r\nI leaped from the roof with Thor raised high, giving a battle cry!<br>\r\n</span></div></div>",
            "created":1465421520,
            "id":2161067,
            "title":"The search begins."
        },
        "121122112":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Azuma's POV<br>\r\n<br>\r\nI'm in battle once again, I'm no stranger to the way of war. Since I could walk I recall holding a lance in my hands, my dance steps were taught with this weapon in my hand. Even before I met Aqua, my parents are rich. Nobles if you will, my role as a dancer was to entertain those who would meet us. But those routines were also to teach me how to gracefully fight against those who would stand to harm me, a spin without the lance was used later when I had it to deflect attacks rather than block them. <br>\r\n<br>\r\nIn my lands it's custom that those who are to fight are to have a beast of some sort to aid them in battle, Aqua was the one I got. Not because it was given to me, but rather because I tamed him. It was thanks to my magic abilities, moreso my ability to produce water from thin air regardless of how thin it is. I can of course use other spells. Aqua was given his name because I tamed him by giving him water, he hadn't drank for days.<br>\r\n<br>\r\nI leap from the roof alongside Li, though I descend more slowly and gracefully. Using my magic to aid in my fall, one of the hawk wolves sees me and wastes no time in trying to charge at me. Leaping into the air, only to be grabbed in mid air by Aqua who flew in and grabbed it with his talons. He then proceeded to lift it into his mouth and took a killing bite out of it.<br>\r\n<br>\r\nMentally I give my thanks and land on the ground, the pavement solid under my bare feet. My lance spinning around in my hands as I gracefully enter my stance, no sooner do I prepare myself does one of the monster's come running towards me. I perform a move in response, using a burst of water above myself as I did earlier. My body moves upside down as I do this, and on instinct I stab my lance downwards. The hawk wolf is stabbed straight through the head, one simple impalement right on the head. I use another burst of water to continue flipping myself up through the air, on cue Aqua flies under me.<br>\r\n<br>\r\nI get mounted onto Aqua, from here I can take to the skies. Above I ready my lance, and fling it from my higher position. It impales a beast that was about to strike Li from behind, he quickly turns and looks at it before shouting his thanks. He is skilled in combat, no question. But he lacks experience, he is younger than me I recall.<br>\r\n<br>\r\nEventually the last of the pack decide to cut and run, I land with Aqua and dismount. A pat on the head and Aqua vanishes in a puff of blue fog, I've used my magic to dismiss him back to where he stays at the academy. He can come back in a moment's notice though. \"Are you hurt Ms Diana?\" I inquire.<br>\r\n<br>\r\nShe gives a relieved sigh and pets her robot wolf before nodding \"A few scrapes, nothing else though. Thanks for the save Azuma and Li, let's stick together then yeah?\"<br>\r\n<br>\r\nLi nods and replies with \"Sounds wise, I'll take point. Let's keep moving while these things are licking their wounds.\" I can't argue with that logic, Li has a good grasp of the situation. I move to grab my lance and follow behind.</span></div></div>",
            "created":1465658400,
            "id":2162465,
            "title":"We fight the hawk wolf pack."
        },
        "1211221121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "We follow river Odin to Leviathan's lair.",
                "We enter the catacombs.",
                "Devlin teleports us into the city."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\n\"Hawk wolves are a persistent danger.\" Serious, I explained. \"When a pack is diminished by an enemy, like us, they seek out and either join or take over another pack to regain their strength in numbers.\"<br>\r\n<br>\r\n\"So, if you don't kill the entire pack...\" Worried, Diana said.<br>\r\n<br>\r\n\"They will attack you immediately if you meet them again.\" Darkly, I said. \"That is what makes them one of the most feared remnant monsters on Nero Earth.\"<br>\r\n<br>\r\n\"We still need one other member in our group.\" Keeping watch, Azuma said. \"We can enter Olympus through the river that feeds the city's water supply.\"<br>\r\n<br>\r\n\"The catacombs would be a better route.\" Serious, Diana countered. \"They are a huge maze of underground tunnels the normal population used to plan and execute their attacks during the terrible war.\"<br>\r\n<br>\r\n\"I heard they go on for thousands of kilometers, linking every major city in what was once called Europe.\" Serious, I said. \"I doubt they are all still sealed from the outside though.\" I sighed. \"They are no doubt teeming with Remnant monsters.\"<br>\r\n<br>\r\n\"No, they are quite secure.\" Startling us, a new voice said.<br>\r\n<br>\r\nI whipped around to find a tall, dark teenager. He sported an eighteenth century gentleman's suit with unusually long coat tails that moved about on their own as if they have a mind of their own. He was wearing knee high riding boots, a top hat covering his raven black hair, and carried a silver tipped cane with a large diamond. His eyes were hidden behind round shining glasses.<br>\r\n<br>\r\n\"Who are you?!\" Annoyed to be caught off guard, I demanded.<br>\r\n<br>\r\nThe young man responded with a toothy, almost sinister grin. \"I am... Prince Devlin Moray of the new mad scientist collective.\" Bowing slightly, he said. \"I too am a student at Ares Academy so please do not bow before me.\" He gave a mad chuckle before adding, \"I have no yet earned that privilege.\"<br>\r\n<br>\r\nI grunted. I knew that a new mad science collective and witch coven were created after the war but no one knew who was at the top or what either of their intentions were. Devlin's mere presence made me feel rather uneasy. \"May I assume you wish to join our group?\" Softly, I asked.<br>\r\n<br>\r\n\"That is the point of this deadly challenge.\" Smiling, Devlin said. \"The new river, Odin is the most direct path into Olympus but it requires you dive into the bottomless lake named Leviathan's lair.\" He smiled again. \"Although the catacombs are secure, they are home to small bands of insane normals who are convinced the war is still raging on as well as a few trapped mad scientists and witches who are just as unstable as the normals.\"<br>\r\n<br>\r\n\"What do you suggest then?\" Raising an eyebrow, Azuma inquired.<br>\r\n<br>\r\nDevlin flashed his toothy grin. \"I can teleport us all back into the city.\" Simply, he said. \"This way, no monsters can follow.\"<br>\r\n<br>\r\nI had to admit that I had no idea as to how to enter the city just yet. It was not because I knew of no way, it was that we could not allow any remnant monsters to follow us in. I turned to the others who all took a vote as to how to enter the city...<br>\r\n</span></div></div>",
            "created":1466969520,
            "id":2171177,
            "title":"Continue"
        },
        "12112211211":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Li's POV<br>\r\n<br>\r\nI've had a think on it, the direct route might be the best course of action. After all we know where it'll take us, for the most part. Bottomless lake aside. The catacombs are too risky, yes they're secure. But will be tight and have crazy people wandering about that would make things too unpredictable. Devlin sounds confident that his teleporter could work, but what if monsters attacked us at the last second. They'd most likely be taken with us, but an idea comes to mind for me regarding the direct route.<br>\r\n<br>\r\n\"Hey Azuma?\" I say.<br>\r\n<br>\r\nThe blue haired dancer blinks at me and gives a \"Hm.\" noise to ask what I'm wanting from her.<br>\r\n<br>\r\n\"You can manipulate water can't you? With your magic?\" I ask.<br>\r\n<br>\r\nAzuma nods and says \"Well in theory anyone with magic could, though I do know how to use it quite a bit yes. It's done with my routines as a dancer. Why do you ask Li?\"<br>\r\n<br>\r\nI get an idea, and snap my fingers. I say \"We could use that to go through the bottomless lake.\"<br>\r\n<br>\r\nDiana then says \"But I hear it's called Leviathan's lair for a reason. Myth has it there's a giant monster there that eats people who go in there.\"<br>\r\n<br>\r\n\"Perhaps, what are we getting at here Li?\" Devlin asks.<br>\r\n<br>\r\n\"Azuma could take us through that lake and directly into Olympus, using her water control to form an air bubble around us as we go through the water. Least that was what I was thinking, it's the most direct route.\" I say.<br>\r\n<br>\r\nThe dancer is silent, thinking this through. I know I'm putting a bit of a challenge on her petite shoulders, though Azuma nods and says \"It's possible, I've never done something like that before. Though I can manipulate water very well, what your asking with regards to the air bubble though seems quite difficult.\"<br>\r\n<br>\r\n\"I have something that should help, if we are to indeed submerge ourselves in the water then here. Each of you take one of these.\" Devlin states, he digs into one of his pockets and pulls out a small device for each of us. \"These are rebreathers made by me, they can last for a few hours provided they aren't damaged.\"<br>\r\n<br>\r\n\"Your prepared. Gotta like that. Good thing you don't need to breathe do you dear.\" Diana mutters with a smirk before petting her beast.<br>\r\n<br>\r\nI put my weapon over my shoulder and say \"Right then, let's get moving.\"<br>\r\n<br>\r\n\"I've already calculated the optimum route, this way.\" Devlin says as he points to a nearby alley, well I guess we'll need to trust him. Azuma has a neutral expression as usual, Diana simply nods to me. Before long Devlin takes us out to a nearby bunch of trees, we trudge through them. Azuma mutters that she might have stepped in something, well your asking for it if your going about barefoot I guess.<br>\r\n<br>\r\nRegardless we arrive at the Leviathan's lair, the lake is huge! Bigger than any body of water I saw back home, Azuma walks ahead and closes her eyes. The pendant she's wearing glows slightly. A few seconds later she says \"It's truly bottomless, I can't detect any sort of earth at the bottom. This could perhaps even go to the core of this planet.\"<br>\r\n<br>\r\n\"Leave that for science to figure out Ms Azuma. Now let's apply our rebreathers, we can also communicate verbally. Though that does consume more oxygen of course, the way through to Odin will be straight ahead. No doubt several depths below.\" Devlin says as he readies his device, we all take the cue and I step ahead.<br>\r\n<br>\r\n\"Right then, everyone remember their swimming lessons?\" I remark, using a bit of humour to lighten the mood.<br>\r\n<br>\r\n\"Of course. Husky can paddle underwater pretty good too.\" Diana says with a little laugh.<br>\r\n<br>\r\nWith that, we prepare for whatever may lurk below.......</span></div></div>",
            "created":1470604140,
            "id":2192489,
            "title":"We follow river Odin to Leviathan's lair."
        },
        "121122112111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "We lure the hawk wolves to the lake.",
                "The monster attacks the pack on his own.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li's POV</b><br>\r\n<br>\r\nThe water within Leviathan's lair was murky, almost completely black. Fortunately, Husky's eyes shot out a powerful but harmless light to illuminate the way. Devlin's coat tails also emitted a strong light to help us see better. There were caves literally everywhere, each leading to parts unknown, making our trip back to Olympus that much more difficult.<br>\r\n<br>\r\n\"Perfect!\" Sarcastically, I muttered. \"Which way, do we go?\"<br>\r\n<br>\r\nAzuma hushed me silent and pointed down. Following her gaze, I gulped seeing a huge pair of red eyes staring at our group. A loud growl reach our ears before a massive tentacle shot out, hitting us all! We all cried out in surprise as the blow threw us out of the lake and onto the marshy shore, including Husky before we heard what sounded like a raspy laugh. Aqua appeared beside Azuma taking a defensive stance only Azuma held her back with her hand. \"I'm okay, Aqua.\" Catching her breath, she said.<br>\r\n<br>\r\n\"What the hell?!\" Annoyed, I demanded.<br>\r\n<br>\r\nA strange creature broke the surface of the water. It looked like a cross between an octopus and a crab! It laughed again, revealing a huge mouth full of rotating teeth before diving below the surface. Annoyed, I turned to Devlin who was laughing as well at this point. \"Leviathan wants to play!\" Amused, he said. \"We will have to be extra quiet to sneak passed him.\"<br>\r\n<br>\r\n\"You know this creature?!\" Stunned, Diana asked.<br>\r\n<br>\r\n\"Of course.\" Smiling, Devlin replied. \"Leviathan was created to protect Olympus from remnant monsters from the sea as the caves along the side lead to it.\"<br>\r\n<br>\r\n\"Why did it not eat us?\" Darkly curious, Azuma asked.<br>\r\n<br>\r\nDevlin chuckled. \"Leviathan will not eat such tiny morsels such as us.\" Grinning, he said. \"He prefers a full meal to snacking.\" <br>\r\n<br>\r\nAqua snorted at the comment. \"Easy, now.\" Cooed Azuma. She turned to Devlin. \"So, we just need to slip passed him and he'll leave us alone?<br>\r\n<br>\r\nDevlin nodded. \"I noticed that all the caves are clearly marked as to where they go.\" Turning serious, he said. \"We just need to pay attention and swim down the right cave to reach Olympus.\"<br>\r\n<br>\r\n\"Perhaps we can distract the playful Leviathan.\" After a thought, Diana said.<br>\r\n<br>\r\n\"What do you suggest?\" Curious, Devlin asked.<br>\r\n<br>\r\nDiana smiled, motioning to a pack of Hawk wolves moving in their direction. \"Giving him something else to play with.\"<br>\r\n<br>\r\nDevlin gave a toothy grin. \"What a capital idea.\"<br>\r\n</span></div></div>",
            "created":1473027360,
            "id":2206093,
            "title":"A playful monster."
        },
        "1211221121111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "The catacombs under the city.",
                "An old city below Olympus.",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><div> <span><i>Li's POV</i><br>\r\n<br>\r\n\"I want everyone to be ready to move fast.\" Serious, I said. \"I'm going to stampede the hawk wolves into the lake so the monster will be kept busy for a moment.\"<br>\r\n<br>\r\n\"Exactly how are you going to do that?\" Raising an eyebrow, Aqua inquired.<br>\r\n<br>\r\nI smiled. \"Just watch and be ready.\"<br>\r\n<br>\r\nWith that, I gave the handle of my double headed war hammer a twist and pulled it apart, revealing a sturdy chain before throwing the two ends away from me with a grunt of effort. The two hammers flew through the trees much like a ghost, damaging nothing. I then quickly grabbed the chain and yanked the hammers towards the flock of hawk wolves. The hammers remained ghost like until they met each other just over the flock with a thunderous clang! Lightning sparked everywhere, creating another deafening clap of thunder, sending the flock running in a blind panic! Everyone jumped to the side as the flock ran right into the lake, away from the sound of my hammers colliding. Sure enough, the monster surfaced and began to attack the flock with a satisfying roar! I pulled the hammers back to me and reconnected the two ends before turning to Aqua, smiling.<br>\r\n<br>\r\n\"My weapon doubles as war hammer nun-chucks.\" Calmly, I explained. \"Only it has a magical property; they become non-corporeal when moving at something that is not my intended target.\"<br>\r\n<br>\r\nDevlin gave a sinister smile. \"Which means, if you miss, you don't accidentally strike an ally.\" Bemused, he said. \"What an interesting feature.\"<br>\r\n<br>\r\n\"We best save the conversation for later.\" Motioning us forward, Aqua said. \"Leviathan will make short work of that hawk wolf flock.\"<br>\r\n<br>\r\nWe all nodded in agreement and quickly dived into the lake using Aqua's air bubbles and Devlin's devices to reach the needed tunnel. It took us nearly ten minutes to reach the opposite end of the tunnel but we made it within the walls of Olympus. Only we found ourselves in....<br>\r\n </span></div></div>",
            "created":1484306940,
            "id":2262997,
            "title":"We lure the hawk wolves to the lake."
        },
        "12112211211112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "We are met by bandits.",
                "We reach the elevator unchallenged.",
                "We meet an ancient master."
            ],
            "content":"<div class=\"\"><div> <span><b>(Li's POV)</b><br>\r\n<br>\r\nWe found ourselves in a massive underground city. The buildings, although perfectly preserved were left in ruins. \"This is the original city of Berlin before the great war.\" Serious, Devlin said. \"The German scientists created a massive force field to protect the city only it became buried under the tons of volcanic ash during the time of fire.\"<br>\r\n<br>\r\n\"I read about that in the history texts.\" Frowning, I said. \"The war shook the earth to the point that previously extinct volcanoes became active again, completely changing the landscape.\"<br>\r\n<br>\r\n\"The entire ring of fire became unstable.\" Darkly, Devlin corrected. \"It changed the landscape of the entire planet; millions of people perished. If it were not for the normal humans stepping in by taking on both sides, the entire world could have become lifeless.\"<br>\r\n<br>\r\nAzuma nodded. \"That is why the witches and mad scientists are now responsible for rebuilding the world they destroyed in their war.\" Serious, she said. She looked about and added, \"I must say that I am impressed the force field is still active after all this time.\"<br>\r\n<br>\r\n\"The force field failed decades ago.\" Calmly, Devlin said. \"The ash and rock dome is simply thick and solid enough to support the city above.\"<br>\r\n<br>\r\n\"So how do we get up there?\" Wincing, Diana asked.<br>\r\n<br>\r\n\"There is an elevator that leads from the city center to Olympus.\" Serious, Azuma said. \"It was created to allow archaeologists to study the city.\"<br>\r\n<br>\r\n\"That is true.\" Softly, Devlin said. \"However, we must be careful going there.\"<br>\r\n<br>\r\n\"Remnant monsters?\" Curious, I asked.<br>\r\n<br>\r\nDevlin shook his head. \"People who refused to bow to the 'new world order' optioned to live in these underground cities.\" Darkly, Devin explained. \"They do not like uninvited guests.\"<br>\r\n<br>\r\n\"Kingdom leaders call them 'old world fanatics'.\" Frowning, Diana said. \"I have come to know them as bandits; those who steal what they need or want.\"<br>\r\n<br>\r\n\"Then I suggest we get moving before we are discovered unprepared.\" Motioning forward. I said. \"The sooner we make it into Olympus, the sooner we can focus on saving the others.\"<br>\r\n<br>\r\nEveryone nodded in agreement and we began our long walk into the center of the ruined city.<br>\r\n</span></div></div>",
            "created":1510420800,
            "id":2413805,
            "title":"An old city below Olympus."
        },
        "121122112111123":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "continue.",
                "continue.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nBefore we could take our third step, the man I had spotted earlier stepped into view from a nearby ally and stared us down.  He was short with dark brown hair and narrow bright glowing blue eyes. His face was windburned with a deep scar along his left cheek. He was wearing a worn leather jacket with what appeared to be ancient Japanese symbols. \"It is unwise to enter Old City without permission, young ones.\" Sternly, he said. \"It is fortunate that I was observing you.\"<br>\r\n<br>\r\nI was slightly taken back by the man's voice. It had an odd echo to it; as if he here two people talking at once. \"We are not exactly pushovers, sir.\" Patiently, I countered. \"Also, it was the fastest route from our previous position.\"<br>\r\n<br>\r\n\"Faster does not equal wiser, child.\" Serious, the man scolded. He let out a low sigh. \"But what is done is done. I will lead you down the safest path to the service elevator.\"<br>\r\n<br>\r\n\"Thank you, sir.\" Solemnly, Azuma said.<br>\r\n<br>\r\n\"The name is Professor Ry Carlton.\" Serious, the man said. \"Just Ry will do, however.\"<br>\r\n<br>\r\nHe then silently began to walk with us following close behind. \"He lied about his name.\" Whispering carefully, Diana said. \"I wonder why?\"<br>\r\n<br>\r\n\"The veterans of the old war are immortal.\" Whispering in kind, Devlin replied. \"Few people are aware of this; they change their names to keep it that way.\"<br>\r\n<br>\r\n\"I changed my name to avoid immortal enemies.\" Startling us, Ry said. \"It is not for my protection but for yours; my enemies will go after all that is dear to me just to hit a nerve.\"<br>\r\n<br>\r\n\"We did not mean to speak behind your back, professor.\" Wincing, Diana said.<br>\r\n<br>\r\nRy grunted. \"I'm used to it.\" Calmly, he replied. \"You don't live as long as I without gaining a thick skin against such petty annoyances.\" He paused and we stopped in turn. \"Immortality comes at a heavy price, students; I advise you not to seek it.\"<br>\r\n<br>\r\nThat sent a shiver down our spines as professor Ry then continued to lead us through the narrow streets of the city. I tried desperately to ignore the growing feeling that we were being watched from all sides. I felt tempted to quicken my step but managed to hold it back as Ry seemed to take his dear sweet time.<br>\r\n<br>\r\n\"Move as if you have lived here all your lives.\" Darkly, Ry cautioned. \"Do not look around and do not quicken your pace. The people here are extremely paranoid but they will not bother strangers so long as they do not linger and do not offer any sign of hostility or panic.\"<br>\r\n<br>\r\nSilently, slowly, we all walked through the streets of the old city to the service elevator where two guards were standing at attention. They saluted Ry who saluted back before leading us in. We thanked the professor for his help then rode the elevator back into Olympus.<br>\r\n</span></div></div>",
            "created":1517155740,
            "id":2445939,
            "title":"We meet an ancient master."
        },
        "1211221121111231":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "We accept the offer.",
                "We have questions first.",
                "We politely decline.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li's POV</b><br>\r\n<br>\r\nThe elevator was a flat platform that was surrounded by a three foot gate lifted like a giant crane to the surface. As we rode it up, I saw a large number of armed people rushing out of the shadows in a clear attempt to ambush Professor Ry from all sides! There was no time to think, I leaped from the rising platform with Thor at the ready! As I landed, Diana Logy leaped down on the back of Husky who growled a warning at the attackers. Azuma was right behind her with Aqua standing firmly at her side and Devlin appeared with a dim flash displaying a large glowing and sparkling sphere over his left hand.<br>\r\n<br>\r\n\"You may back away with no dishonor.\" Serious, Azuma commanded. \"We do not seek conflict, merely safe passage.\"<br>\r\n<br>\r\n\"Your passage was guaranteed safe until you interfered.\" Darkly, one of the cloaked men said. \"We return your offer; go to your precious city of Olympus.\"<br>\r\n<br>\r\n\"We will leave with our professor.\" Standing my ground, I said. \"Whatever quarrel you have with him will have to wait.\"<br>\r\n<br>\r\n\"Also, there are better ways to settle things than a twenty to one fight.\" Frowning, Diana added. \"There is no honor in your approach.\"<br>\r\n<br>\r\n\"Leave now or be forced to flee.\" Frowning, Devlin commanded. \"Many lives depend upon our success during these trails.\"<br>\r\n<br>\r\n\"As such, know that we will not hold back.\" Firmly, I said.<br>\r\n<br>\r\n\"Okay, I've seen enough.\" Surprising us, Ry said. \"Everyone stand down.\"<br>\r\n<br>\r\nThe shrouded men lowered their weapons and pulled back their hoods. They were all no older than us! I turned to Ry, my eyes demanding an explanation. Ry merely shrugged, a small grin on his face. \"Everyone's test has two phases.\" Calmly, he explained. \"You survived phase one and now you passed phase two.\"<br>\r\n<br>\r\n\"I am professor Light.\" Stepping forward, a tall and muscular man said. \"You are in the presence of the founders of New Starmage Academy.\"<br>\r\n<br>\r\nMy jaw dropped. I had read about Starmage Academy in the ancient texts. They were the ones responsible for training the normal population in how to fight witches and mad scientists with their own powerful general science which eventually ended the war. I had thought the academy was destroyed just before the signing of the peace treaty; I had no clue they built a new one.<br>\r\n<br>\r\n\"Those who prove themselves worthy are invited to train at New Starmage on Scotland Island.\" Serious, Ry explained. \"We have watched you all throughout the trials that brought you to Olympus and your test that brought you to the underground city of old Europe.\"<br>\r\n<br>\r\n\"It is a once in a life time offer.\" Serious, Light said. \"Consider this carefully.\"<br>\r\n<br>\r\nWe all turned to each other, curious...<br>\r\n</span></div></div>",
            "created":1538951580,
            "id":2560582,
            "title":"Welcome to New Starmage."
        },
        "12112212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "another character.",
                "a remnant monster.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Nina's POV</b><br>\r\n<br>\r\nThe name is Nina Aztec. I hail from El Dorado; yes it is a city of gold. Not that gold is worth much in these desperate times. I am a six and a half foot Amazon warrior; one you do not wish to cross!<br>\r\n<br>\r\nI wear hip high leather armored boots with three and a half inch heals that carry a spike in each for stab kicks when needed. The boots bend at the knees with a long metal spike so I can knee someone or something and stab them for good measure. I wear an armored full torso corset that covers everything from the crotch to my bust. It's not very comfortable but it does its job. I also wear shoulder length leather armored gloves with spikes at the elbows for quick attacks just like my knees. Finally, I wear a cape and cowl that can make me invisible for a time.<br>\r\n<br>\r\nMy weapon is magical staff that doubles as an energy bow that fires energy bolts and a sniper rifle that fires bullets loaded with various potions of my design. As for my appearance, I have green eyes and long flowing lavender hair. Yes, that is its natural color; many strange things happened after the terrible war, thanks to the accursed mad scientists and their lust for conquest!<br>\r\n<br>\r\nI sighed and looked up from my diary to see the ruined city of Helike, named after the ancient city of Greece that was lost to a tsunami. \"How fitting this city fell to a wave of remnant monsters, flooding it with the blood of its residents.\" Frowning, I muttered. \"It now rests as a dark reminder to protect ones boarders at all times.\"<br>\r\n<br>\r\nI had entered the city of Helike with the hopes of entering Olympus and Ares Academy without notice. Only I saw that the academy was holding its initiation trails early this year. I saw it as a good opportunity to recruit a small team for my mission. \"I need to choose carefully.\" Darkly, I said to myself. \"I need magic users who I can control and keep loyal.\" I frowned deeply. \"If Lady Medusa is right and the mad scientists are rebuilding their Colossal collective, it could mean the complete annihilation of Nero Earth!\"<br>\r\n<br>\r\nI could not allow that to happen! The world was plunged into Hell due to the last war and we are still trying to dig out of it by destroying the monsters left from it to multiply and over run the planet.<br>\r\n<br>\r\n\"Let's see who I run into first.\"<br>\r\n<br>\r\nNina runs into...<br>\r\n</span></div></div>",
            "created":1460610000,
            "id":2133041,
            "title":"Follow a new character."
        },
        "121122121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Join Cire and decide later.",
                "Walk away, find someone else.",
                "Risk telling Cire of my mission."
            ],
            "content":"<div class=\"\"><div> <span><b>Nina's POV</b><br>\r\n<br>\r\nI turned the first corner to find a young slender girl with long sand blond hair wearing black knee high boots, military style cargo pants, a long sleeve camouflage style shirt with a matching vest over it. She was wielding broadsword that had a gun handle for a hilt and two barrels on either side of it. It was a gun-sword, the largest I had ever seen. The barrels were as large as a twelve gauge shotgun with a straight clip within the sword guard that undoubtedly held several kinetic rounds.<br>\r\n<br>\r\nAs the girl turned, inwardly gasped and blushed slightly. Who I thought was a girl was instead a long haired boy with fiery hazel eyes and a windburned face. He expertly swung his sword into a Wolf-hawk or a winged wolf and pulled the trigger, firing both barrels into it. The monster did not have the chance to yelp; it was dead instantly and the gunshot echoed against the empty buildings.<br>\r\n<br>\r\nThe boy let out a high pitched sigh then turned in my direction. \"You can come out now.\" In a near feminine voice, he said. \"That was the last one; this pack is dead.\"<br>\r\n<br>\r\nI stepped forward, eyeing the boy and found several dead wolf-hawks in the street where he stood. The boy knew how to fight, there was no doubting that only I was not sure if he was who I was looking for in a team for my mission. Bowing slightly, spoke. \"I'm Nina. I hail from El Dorado.\"<br>\r\n<br>\r\nThe boy sheathed his gun-sword behind his back. \"The name is Cire; Cire Apache.\" In an unusually high voice, he said. \"I hail from the Great Lakes territory.\" He frowned. \"You should keep you guard up, especially in the death lands outside of the kingdoms.\"<br>\r\n<br>\r\nThe Great Lakes territory was a part of what used to be known as the United States. During the terrible war, the states broke free from the union and formed their own minor kingdoms.<br>\r\n<br>\r\nI smiled slightly and sarcastically replied. \"Yes, madam sir.\"<br>\r\n<br>\r\n\"So you know I'm a boarder gender.\" Frowning deeply, Cire said. \"A person who can be either male or female at will.\"<br>\r\n<br>\r\nI did not know that but I nodded to keep the ball rolling. Boarder gender people was the result of too many gender transformations in one bloodline. People began being born between male and female with the power to transform into either or at will. These people were seen as oddities but often used as infiltrators during the terrible war.<br>\r\n<br>\r\n\"I prefer to be slightly in between, as I was born, and let any fool who comes across me to guess.\" Smiling slightly, Cire said.<br>\r\n<br>\r\n\"Are you a magic or mad science user?\" Curious, I asked.<br>\r\n<br>\r\nCire grunted. \"Magic is a science and science is a magic.\" Flatly, he said. \"I can use both but I prefer to stick to magic; my reasons for that are my own.\" He then turned from me and added, \"Either come with me and help find two other students or get lost.\"<br>\r\n<br>\r\nI frowned at that. The boy had an attitude; still, he had skills I could use in my mission.<br>\r\n<br>\r\nI finally decided to...<br>\r\n</span></div></div>",
            "created":1460915760,
            "id":2134616,
            "title":"A boarder gender."
        },
        "1211221211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "West",
                "East",
                "South"
            ],
            "content":"<div class=\"\"><div> <span><b>Nina's POV</b><br>\r\n<br>\r\nI decided to join Cire and decide what to do later. He/she had skills I could use only I would have to do something about his/her attitude. \"I'll join with you but understand this, Cire.\" Sharply, I said. \"I am the one in command of this little group.\"<br>\r\n<br>\r\nCire chuckled. \"That is not for you or I to determine, Nina.\" Amused. \"He said. \"Zeus assigns the leader of each group and if you want to challenge him, you are a bigger fool than I gave you credit for.\"<br>\r\n<br>\r\nI frowned at that. Alpha Zeus was the mightiest warrior of all Nero Earth and one of the last great mad scientists from the terrible war. However, he was also getting old; he was not my concern. The mission was to find the new mad science collective and stop it from getting any larger than it has already become with an equally powerful coven.<br>\r\n<br>\r\n\"I would never dream of challenging one of the last great mad scientists.\" Serious, I said. \"At least not alone; that would be suicide.\"<br>\r\n<br>\r\nCire smiled. \"You have spunk, Nina.\" Softly, he said. \"Don't let your ego blind you of your limits. That will get you killed.\"<br>\r\n<br>\r\nCire and I then moved on, looking for other students in the ruins of the Helike. It was not an easy task as the city was vast and there were places to hide literally everywhere. What unnerved me was that the remnant monsters did not seem to be flooding the streets as I had thought they did since they over ran the city years ago.<br>\r\n<br>\r\n\"The Remnant monsters in this area normally remain underground in the old subway tunnels and subterranean parking garages during the day to avoid the heat.\" Softly, Cire said. \"I made certain to study them before coming here.\"<br>\r\n<br>\r\n\"So these monsters are nocturnal.\" Looking at the sun, I said. \"That gives us plenty of time.\"<br>\r\n<br>\r\n\"Unless we disturb a nest of them.\" Serious, Cire said. \"The pack I ran into came up to investigate the mass teleport before I could start my search.\"<br>\r\n<br>\r\nI strained my ears and heard the sounds of battle in three different directions. Cire had apparently heard them as well. \"Well, you want to be the leader.\" Sarcastically, he said. \"Which way should we go?\"<br>\r\n<br>\r\nI looked to the West, towards Olympus, to the east that lead to volcanoes, and south towards the dead-land deserts. I decided the best route to take was...<br>\r\n</span></div></div>",
            "created":1461461520,
            "id":2138315,
            "title":"Join Cire and decide later."
        },
        "12112212111":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "A fourth member joins soon.",
                "Nina encounters Li."
            ],
            "content":"<div class=\"\"><div> <span>Nina's POV<br>\r\n<br>\r\n\"The West seems like the ideal course of action. Plus we may run into other students who can ally with us.\" I mutter, moving a strand of my lavender hair out the way as I heft my weapon over my shoulder. I'm moving there now, if Cire follows me then that's it's choice. Sure enough Cire follows, perhaps to at least have someone watching the back. Can't blame em, regardless I carry on. We walk without a word.<br>\r\n<br>\r\nCire probably can tell that I'm not going to respond well to any sort of snark from him, well his skills are useful but I'll need to keep a tab on him. I'll only aid him so long as it benefits my mission, I don't do favours. Only investments. Before long though we hear a very loud crashing noise from the buildings ahead of us, instantly we're at the ready.<br>\r\n<br>\r\n\"What do you reckon that was?\" Cire mutters once the noise subsides.<br>\r\n<br>\r\nI make to reply, only we hear a loud roar followed by several others and other crashing noises. Seems like there's a fight going on.<br>\r\n<br>\r\n\"Let's investigate, worst case we run for it.\" I say. Cire grunts in the affirmative and we make to the source of the noise, it's in some kind of street. Several monsters are laid out and in the centre is a massive.....being. That's the only way I can really describe it.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://img3.wikia.nocookie.net/__cb20090610130134/shadowhearts/images/9/95/Vastitas.jpg\" target=\"_blank\">http://img3.wikia.nocookie.net/__cb20090...</a><br>\r\n<br>\r\nThe figure turns to look at us, time slows down as me and Cire prepare to fight. It takes one calm, nonchalant forward step towards us. I'm out to fire at it with my magical staff, only it's engulfed in a brief white light. And reveals a young man standing before us.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://judgement-ring.com/wp-content/uploads/2012/01/Yuri-Hyuga-Shadow-Hearts-Covenant-Outfit2-505x1024.jpg\" target=\"_blank\">http://judgement-ring.com/wp-content/upl...</a><br>\r\n<br>\r\n\"Careful where you point that thing lady.\" he says in a gruff tone.<br>\r\n<br>\r\n\"What the hell was that?\" Cire says, I'll admit I've not seen anything like what this young man has done.<br>\r\n<br>\r\n\"That's the power of a Haronien. Name's Bosara Remi by the way. Who are you pair?\" he says as he leans on a nearby lamppost and scoffs at the monsters destroyed around him, Bosara digs into his satchel on his hips and pulls out a cigarette and lighter.<br>\r\n<br>\r\nA Haronien?! I heard tales of those growing up with my fellows. Apparently they were people that could fuse with the souls of slain monsters and transform into beings similar to them, but I thought they all perished far before the great war that destroyed this place. <br>\r\n<br>\r\nNevertheless I play it nice, I set down my weapon and smirk. It's a seductive one, after all something I learned was to use the gifts I was blessed with. Why else do I dress the way I do? \"My name's Nina, this is Cire. We're trying to form a team, perhaps you'd lend your rare power to our cause?\" I say as I fiddle with my hair.<br>\r\n<br>\r\nCire simply smirks and says \"Maybe you should actually be in animal protection, aren't you very rare?\"<br>\r\n<br>\r\nBosara stands upright, takes a drag out of his cigarette and says \"Well I figured better use this power for good, otherwise it won't matter where I am. C'mon no point in standing around.\" he throws his cigarette to the side and cracks his neck.<br>\r\n<br>\r\nI don't know this person, is his power even magical? Regardless it would certainly be useful in case of danger. I wink at him and make to lead in front, swaying my hips as I do so.</span></div></div>",
            "created":1471126800,
            "id":2195501,
            "title":"West"
        },
        "121122121111":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Bosara's POV<br>\r\n<br>\r\nI'm looking at the pair that I've just encountered, Cire's got a cheeky attitude. Which I'm fine with. Nina? Tch, Boobs McGee strutting like she rules the roost. Give me a break. Well I checked out the eye candy, can't help it I'm a guy. Still there's strength in numbers. I don't trust Nina, but I'll stick with them for now. Sides if it turns out evil's happening I can step in and stop it.<br>\r\n<br>\r\nWhy am I doing that?<br>\r\n<br>\r\nOddly enough, it's because I hear a voice in my head. It's telling me stuff, it can be vague but I get the general gist of what it's saying. One time I tried to ignore it and not do what it told me, it just played static in my head till I shouted for it to stop. Still it's been true about what it wants, and the folks I help do benefit me. Usually letting me spend the night on the sofa, but I can't stick around cause the voice says I need to be elsewhere.<br>\r\n<br>\r\nSpeaking of that. I hear a low droning noise, I've come to associate that with the voice following.<br>\r\n<br>\r\n<span class=\"cblue\">\"Tru....not.....laven.....hair.....witch......eek.....blue...... danc.....fro.....the.....ands......\"</span><br>\r\n<br>\r\nI make sure not to let my expression betray me, many times I've gotten looks from folks when it kicked in. So from what I heard on that it's telling me to be wary of the woman in this group, well I'm stuck with her now. Blue? Lavender? What about traffic lights? Oh yeah there's a set of them knackered right above me, whole world's gone to shit.<br>\r\n<br>\r\nStill I guess I can do something about it, being that I can transform into various monster forms. Fight fire with bigger fire, plus I'm good without it. Taught myself martial arts with a pair of knuckle dusters, I was raised at this orphanage. Owner of it made sure that the kids when they grew up could throw a punch at least.<br>\r\n<br>\r\n\"We're still heading in the right direction yeah?\" I say, as much of a wanderer as I am sometimes I have problems with directions.<br>\r\n<br>\r\n\"Of course. Witches have a knack for these things.\" Nina says with confidence. Oh nice.<br>\r\n<br>\r\n\"So, that power of your Bosara. How does that work exactly?\" Cire says in an interested tone.<br>\r\n<br>\r\nThat's not the first time I was asked that, won't be the last. Wish I had a dollar for everytime.<br>\r\n<br>\r\nBefore I can open my mouth though a woman comes out of a nearby alley way.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://i0.kym-cdn.com/photos/images/original/001/011/412/22e.jpg\" target=\"_blank\">http://i0.kym-cdn.com/photos/images/orig...</a><br>\r\n<br>\r\n\"W-Woah!!\" She yells out, she's ran right into me from the side. I rapidly blink before looking at her, she's probably up to my solar plexus. Kinda cute too, still......<br>\r\n<br>\r\n\"Damn lady. Watch where your going.\" I grumbled scratching the back of my head.<br>\r\n<br>\r\nIn response the girl bows deeply and looks up at me flustered \"Oh I'm so sorry! I just woke up and I was told to find people, a-and there was these monsters. I-I gave the slip though.\"<br>\r\n<br>\r\nNina turns to look at the woman, this chick is probably mid to late teens. I'd say 17. Nina says \"Are you a maid of sorts? Your outfit's an indicator of it.\"<br>\r\n<br>\r\n\"No shit Sherlock.\" Cire says, Nina looks at him. But I turn to look at this new woman.<br>\r\n<br>\r\n\"Y-yes. My name's Valeria. I-I'm a witch from Olympus. Yeah I'm a maid, from a long line of them.\" Valeria says with another small bow.<br>\r\n<br>\r\nNina has a look of interest and sets down her weapon. \"Oh I think I've heard about your line. The sacred carers. Each woman that's been born of them has been trained in the ways of stewardship and magic, as well as the art of assassination. To protect those who they serve.\" she explains.<br>\r\n<br>\r\nValeria nods and says \"Uh yeah, I was....sent here to this academy. If I graduate I'll be a certified sacred carer, of course I wasn't expecting to b-be thrown into the middle of a hellish landscape though.\"<br>\r\n<br>\r\n\"For a trained assassin your kinda skittish.\" Cire says with a smirk.<br>\r\n<br>\r\n\"Well I.....was trained as one yes, but it's to protect those who I serve. C-Can I stay with you lot? I'll fight better that way when I'm a team I think.\" Valeria says, she motions to her dress. And sure enough my sight detects various daggers and shurikens concealed in the folds of her black dress and skirt and heels.<br>\r\n<br>\r\nI shrug and say to Nina \"Your choice. I suggest she sticks with us, maybe pay for the ruffling of my shirt here.\"<br>\r\n<br>\r\nAfter saying this Valeria quickly pulls out a duster via use of her magic and promptly begins dusting me. \"I apologise! Hold it I'll have it right in a jiff.\"<br>\r\n<br>\r\n\"Woah! Easy, only joking.\" I state.<br>\r\n<br>\r\nNina chuckles before saying \"I'm all for it, if she's as good as she claims she'll have no trouble holding her own. Quickly now, our foes will gather while we wait.\" and she sways ahead of us. Cire walks on while smiling at me.<br>\r\n<br>\r\nI look at Valeria, who blushes slightly at me before motioning for me to go first. Giving a shrug I move with them.</span></div></div>",
            "created":1473024540,
            "id":2206075,
            "title":"A fourth member joins soon."
        },
        "1211221211111":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Bosara's POV<br>\r\n<br>\r\nValeria looks like a little tart than anything resembling an assassin, though she has the weapons that are typical of the trade. How do I know? Well I've faced my fair share of people who want to knife me in my sleep, like I said I wander all around and get into trouble. Though they usually fail more often than not, namely because I know martial arts and can transform into monsters. I follow the group that I'm with now, to be honest I'm not sure I trust any of them cept probably Valeria. Maybe it's just me, maybe it's Nina. She just doesn't seem like she has anything good planned, she has nice tits at least.<br>\r\n<br>\r\nI kick a stone with my right leg, I've made a new resolution to quit smoking. I'm pretty sure this school won't allow me to smoke, it's gonna be a bitch to go through withdraw symptoms. I'll need to do whatever I can to take my mind off of it, this voice in my head better make this whole work pay off. <br>\r\n<br>\r\nSuddenly though I hear a rustling noise from behind us, my head jerks up and on reaction I get my spiked knuckle dusters on my hands. Nina and the rest of our team get ready, we turn to face the source of the noise. From the ground we see claws digging themselves out of the road, and some real ugly fuckers are showing up.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://fireemblemwiki.org/w/images/c/c1/Generic_portrait_dark_knight_risen_female_fe13.png\" target=\"_blank\">http://fireemblemwiki.org/w/images/c/c1/...</a><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://vignette4.wikia.nocookie.net/fireemblem/images/4/4c/RisenChieffe13.png/revision/latest?cb=20141028150246\" target=\"_blank\">http://vignette4.wikia.nocookie.net/fire...</a><br>\r\n<br>\r\n\"Wahhhh!!!\" Valeria yells, promptly moving to stand behind me. There she goes, if this is an act she must be a pretty damn good actor. Pretty sure part of your job is to protect your wards, so protect your team!<br>\r\n<br>\r\nThere's about 10 as far as I can see, so maybe I shouldn't go saying that just yet. Deaders we call them, leftovers from the great war way back. See legend goes a necromancer decided to use the bodies of the dead to keep waging war, sounds good right? Well when the fighting's done then what? Just leave em it seems.<br>\r\n<br>\r\nThey're stupid, but they're tough. They can tear skin off you in a second if you let them, cause they don't feel fear they don't think twice about getting in. Suddenly the problem I have is big, I rely on punching things. Oh wait, I can morph into monster forms.<br>\r\n<br>\r\nNina suddenly launched a fireball, the heat of it I can feel from my left ear. I don't bother to turn around and curse at her, no point. I get my knuckle dusters ready and close my eyes, searching through the depths of my soul. As I have done many times to awaken the power within me, the forms that I can take appear in shards of glass.<br>\r\n<br>\r\nI select the nearest one.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://lparchive.org/Shadow-Hearts-Covenant/Update%2006/72-006_61.jpg\" target=\"_blank\">http://lparchive.org/Shadow-Hearts-Coven...</a><br>\r\n<br>\r\n<span class=\"cbrown\">\"I am Vastitas! I am that which has skin as hard as Earth, use Gaia's wrath to protect yourself and crush those who have strayed from the path!\"</span> the form shouts at me, instantly I feel stone cover my body. A bestial roar emerges from my mouth as I leap into the air, bringing my fists down onto the nearest deader. Smashing it's head into complete mush, spraying viscera and gore amongst the ruined pavements. Another one to my left is grabbed by me, followed by me driving my right fist into it's gut and then tossing it to the side.<br>\r\n<br>\r\nValeria leaps high, throwing daggers at the feet of the monsters too far for me to engage up close. Then suddenly explosions are seen, must have been rigged on her knifes. Nina rushes past me and swings her weapon with a sadistic grin on her lips. My mind is focusing on the combat, I need to stay focused. My transformations come with a down side, my mental state is still technically human. My body however isn't, and the former can't handle the latter. <br>\r\n<br>\r\nSo staying too long in my monster forms results in me going berserk, but I've gotten used to it. I can last up to half an hour before I really need to go back to being normal, the last time well.....I don't talk about it.<br>\r\n<br>\r\nCire joins the scrap, saying something or another. Again I don't focus on it, only on crushing these monsters using my power. This is one form I can go into, there's others. Some I can do, others I don't. The voice in my head tells me when I get them.<br>\r\n<br>\r\nEventually the deaders are all gone, all over the place still though. In parts that is, I shut my eyes. Feeling a flash of light before I look down, seeing my usual arms. Giving a huff I lightly crack the neck before saying \"I hate fighting chumps.\"<br>\r\n<br>\r\n\"Oh? Still they should have felt honoured to be able to face your transformed self Bosara.\" Nina says, flicking her lavender hair with a hand that trails down to her chest.<br>\r\n<br>\r\n\"We should get going guys, Valeria's explosions might attract more of those things.\" Cire mutters, Valeria looks sheepish and stands a bit closer to me.<br>\r\n<br>\r\nSaying nothing I put my knuckle dusters away and start walking away from the chaos I just helped make, seems like fighting is all I'm really good at. But if I can help make this place better then I will, otherwise that voice will shout me till I snap my own neck.</span></div></div>",
            "created":1481751060,
            "id":2249919,
            "title":"A little warmup....."
        },
        "13":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "continue talking",
                "entrance to the academy",
                "bump into someone else",
                "continue",
                "your choice"
            ],
            "content":"<div class=\"\"><div> <span><b>Blake Mars POV</b><br>\r\n<br>\r\nMy name is Blake Mars, someone that in this messed up world would consider 'normal', and to say that my life so far is uninteresting is an extreme understatement. I currently live in Atlantis, though before that, I was on exchange in what was the east coast of Australia. Something that I never would had done if I knew what was to come. I may look like a typical seventeen year old girl, but I have a dark secret. Several in fact. The first is that I am older than the seventeen years I appear to be since I can vaguely remember the start of the war. I'm not too sure how old I was back then, but what I can remember was that during the early days, I was injected with something. Not sure what that cloaked figure was trying to do, or even why as there were plenty of already unpleasant and dangerous wildlife he or she could had experimented on, but the results were that it seemed to stop my physical aging at the late teens and it also turned me into a girl.<br>\r\n<br>\r\nI spent years trying to survive the horrors (someone had the 'smart' idea of mutating a kangaroo with some type of snake along with other constructs to fight, then counter-fight that monstrosity and though my changes made me nearly indestructible, I still could feel pain), and even longer dealing with the changes to myself. I eventually found myself on Atlantis after it appeared rescuing me and a few other survivors about ten years ago, and since then, I tried to keep a low profile. Which proved impossible. While my true age and past was kept hidden, even from the other survivors, the fact I haven't aged a day has made me a curiosity. Which is why, along with several other reasons why I came here. I muttered something regarding the architecture, which was a mistake as it drew attention to myself.<br>\r\n<br>\r\nA boy came up to me almost immediately, an started eyeing me, much to my annoyance. \"Okay. I get the message\" the boy said as he saw my distasteful look. <br>\r\n<br>\r\n\"Sorry. I'm just tired\" I said. \"Blake Mars.\"<br>\r\n<br>\r\n\"Li Hercules. Seen anything like this?\" the boy asked, in awe.<br>\r\n<br>\r\n\"A long time ago\" I said, not wanting to go into details. <br>\r\n<br>\r\n\"Hey, that's that?\" Li asked, as he noticed the antique pistol hat was strapped to my hip. It was of course, heavily modified.<br>\r\n<br>\r\n\"This is Deimos\" I said.<br>\r\n<br>\r\nLi gave a slight laugh. \"Mars and Deimos. Cute\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1459746000,
            "id":2127764,
            "title":"New character."
        },
        "131":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Professor Chan.",
                "Professor Alpha Zeus.",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span><b>Blake Mars POV</b><br>\r\n<br>\r\nI chuckled in return. \"Li Hercules; Li is a Chinese name that means powerful. Hercules was a famous anti hero of Greek Mythology who was said to have immeasurable strength.\" I grinned. \"I hope your name does not match your ego.\"<br>\r\n<br>\r\nI was pushing the boy's buttons on purpose to see how he would react. If he were to get angry, then he did indeed had an ego to match. That would make him a boy to watch carefully. Instead, to my slight surprise, he blushed deeply, flashing a rather goofy but cute nervous grin.<br>\r\n<br>\r\n\"Ego is the inner betrayer.\" Almost timidly, he said. \"I learned that the hard way my first day at Spartan Academy with Professor Chan. He seems blind but you would not know that sparing with him; he knows where you are at all times no matter how careful you are.\"<br>\r\n<br>\r\nI nodded, remembering Chan. I had only met him once but he was not a person you would easily forget. When we briefly met, I had just found some time of peace. Still, I could not block out the memories of my shattered past. Chan sat down next to me and asked what was troubling me. Of course, I replied with, \"Nothing. Go away.\"<br>\r\n<br>\r\n\"I will not.\" Calmly, Chan said. \"I am Chan Koy from the isle of Scott. I am a teacher at Spartan Academy in Olympus.\"<br>\r\n<br>\r\n\"What do you want?\" Glumly, I demanded.<br>\r\n<br>\r\nChan smiled and said, \"Worry not of the future and dwell not in the past. They will only distract you from the present time to stand in.\"<br>\r\n<br>\r\n\"What is that supposed to mean?\" Looking at the blind teacher, I asked.<br>\r\n<br>\r\nChan lifted his blindfold, revealing two brightly glowing blue eyes. There was a power behind them that forced even me to quiver in fright. Upon placing the blindfold back into position, Chan said, \"When distracted, the present will become the past before you decide to act upon it.\"<br>\r\n<br>\r\nReturning my mind to the present, I smiled at Li. \"I'm glad to see you remember and heed the lessons of your experiences.\"<br>\r\n<br>\r\nLi smiled. \"I got the beating of my life that day because I allowed my ego to control my decisions.\" Blushing, Li said. \"I took that lesson to heart and here I am, attending Ares Academy two years early.\"<br>\r\n<br>\r\nI nodded and smiled. \"I am sure Professor Chan would be proud of you.\"<br>\r\n<br>\r\n\"He is indeed.\" Came a calm male voice.<br>\r\n<br>\r\nWe turned to find...<br>\r\n</span></div></div>",
            "created":1459746000,
            "id":2127808,
            "title":"continue talking"
        },
        "1311":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Zeus gives a short speech.",
                "Zeus urges all to their dorms.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nProfessor Chan approached us with the aid of a cane. He was a tall muscular man in a black business suit with a red sash covering his eyes, tied behind his head. His cane was unusually large; I suspected it hid a large sword or was able to change into something else.<br>\r\n<br>\r\n\"Good morning, students.\" In a nonchalant manner, he said. \"Welcome to Ares Academy. I will be your zero-light combat instructor; you will learn to fight in pitch darkness before you graduate.\"<br>\r\n<br>\r\nZero light was a new phenomenon; an effect of the terrible war. Different parts of the world experience times of complete darkness due to low hanging clouds of dark magic or psychotic fog. Anyone caught in these clouds or fog face untold dangers. Those who do not how to fight them are rarely seen or heard from again and those who do return are never the same. Our world was facing dark times even so long after the terrible war had ended. The remnant monsters were just one of the many dangers we faced in this new world.<br>\r\n<br>\r\n\"It is good to see you again, Professor Chan.\" Bowing, I said. \"I must admit, I am surprised you transferred to Ares Academy to teach.\"<br>\r\n<br>\r\n\"I teach at many schools, Li.\" Bowing back, Chan said. \"I was asked to come to Ares as we have many promising students this year including a few normals who have surprised us all.\"<br>\r\n<br>\r\n\"Normal people are being accepted to Ares Academy?\" Surprised, Blake asked. \"They must truly be impressive fighters.\"<br>\r\n<br>\r\n\"A warrior does not necessarily require magic or super science to defeat an enemy, Blake.\" Politely, Chan said. \"Do not forget; it was an army of normal people who forced the end of the terrible war.\"<br>\r\n<br>\r\n\"You did not strike me as a historian.\" Bemused, Blake said.<br>\r\n<br>\r\nChan smiled. \"I did not strike myself as one either.\" Honestly, he replied. \"However, history and experience are the hardest of all teachers.\"<br>\r\n<br>\r\nBlake nodded. \"They both test you first, then teach.\"<br>\r\n<br>\r\n\"The school has separate dorms for the girls and boys.\" Changing the subject, Chan said. \"The Hebe building is for the boys and the Artemis building is for the girls.\" He smiled slightly. \"I do not recommend any boy attempting to sneak into the girl's dorm, you will not like the results.\"<br>\r\n<br>\r\n\"Um... I thought most people were immune to transgender transformations.\" Wincing, I said.<br>\r\n<br>\r\nBlake giggled slightly as Chan smiled. \"Some are.\" Cryptically, he said. \"However, anyone who enters the building set for one gender will automatically find themselves wearing <i>all</i> the appropriate attire.\"<br>\r\n<br>\r\n\"Very few know if they are immune or not.\" Amused, Blake said.<br>\r\n<br>\r\nProfessor Chan's grin turned sinister. \"Those who are not immune to transformations will get an extra surprise that will last until graduation.\" Calmly, he said. \"So everyone must ask themselves, is such an invasion of privacy worth the risk of a possible permanent gender reassignment?\"<br>\r\n<br>\r\nA number of boys on the airship gulped, including myself. Then Chan added, \"The safe guard works both ways, ladies. Don't get any ideas of raiding the boy's dorm unless you wish to take the risk of being one of the boys until graduation.\"<br>\r\n<br>\r\nAs his words sank in, the airship came down to a landing at in front of the school where a tall powerful man was waiting with the aid of a lighting bolt shaped cane. With him were three identically dressed women with the exception of three different colored uniforms. As I walked out into the morning sun, I recognized the man as the headmaster of Ares Academy, Professor Alpha Zeus. The man tapped his cane onto the ground, making a deafening thunder like sound. It got everyone's attention immediately!<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1459832400,
            "id":2128209,
            "title":"Professor Chan."
        },
        "13111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "continue.",
                "Your choice.",
                "Skip to the initiations."
            ],
            "content":"<div class=\"\"><div> <span>\"Students, welcome to Ares Academy.\" Calmly, he said. His voice was deep and booming through the microphone. \"You have all been chosen to attend this year because you each possess great promise and impressive skills.\" He motioned to Professor Chan. \"We have recruited the finest teachers from all of Nero Earth to mold you into even greater warriors and teams that we hope will be worthy of legend.\"<br>\r\n<br>\r\nHe took a step back as one of the triplet women took over the microphone. \"Students, I am Alia Siren. To my left is Beta Siren and to my right is Trina Siren.\" Serious, she said. \"We are the head teachers of this academy; nothing any of you do or say will go unnoticed. Do not test us, you will fail.\"<br>\r\n<br>\r\nBeta stepped forward taking the microphone. \"Good deeds will be rewarded with good merits.\" Calmly, she said. \"Grand or epic deeds will win you equally grand or epic perks.\" She then frowned. \"The same applies to the opposite.\"<br>\r\n<br>\r\nFinally Trina took the microphone. \"You will all be randomly tested with situations you may encounter in the field at random times.\" Darkly, she said. \"If you succeed, you will re rewarded. If you fail... you will be hurt or worse; this is not a world for the weak and this school follows that example.\"<br>\r\n<br>\r\nZeus then took back the microphone. \"Knowledge and experience is only useful if you live to use it.\" Coldly, he said. \"You must make use of all that you are, not just parts of who you are to survive. You are here to learn how to make it all work in harmony.\" He paused then stated, \"Your initiation exam begins tomorrow at sunrise... Be ready, students.\"<br>\r\n<br>\r\nWith that, he and the triplets walked away while other professors began to lead students to their respective dorms.<br>\r\n</span></div></div>",
            "created":1459918800,
            "id":2128655,
            "title":"Zeus gives a short speech."
        },
        "131111":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Azuma meets Li following this dance.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span>Li Hercules POV<br>\r\n<br>\r\nI've gotten pretty much everything unpacked now, I didn't bring much aside from my clothes and my weapon. In spite of the elaborate weapon that I wield me and my folks don't have much, but my Mother said sometimes it's for the best. I sigh as I sit on my bed, I'm honestly prepared to call it a night. It was a long travel from where I'm from, big day tomorrow after all. I don't know what will happen, I'll face a lot of monsters. That much I can tell.<br>\r\n<br>\r\nOddly though I hear noises from outside in my dorm, guys are moving out in droves. That's odd, shouldn't we all be winding down? <br>\r\n<br>\r\n\"What's going on?\" I ask the nearest guy.<br>\r\n<br>\r\n\"Dude don't you know? Azuma's performing for us all before the night is out! She's a really good signer, people travelled to Babylon just to hear her perform. C'mon!\" with that he heads out the door.<br>\r\n<br>\r\nIs Azuma really that popular? From what I heard Babylon's got a lot of sand around it, now exactly the best to travel through in these times. What the heck I might as well go, maybe Azuma will notice me there. I get my shoes on and head out, I'm just following the crowd. It looks like we're all going to where Zeus had performed his speech not too long ago, we all proceed to take seats. <br>\r\n<br>\r\nI managed to get a good middle row one, right in the centre. There's a hubbub of chatter all over the place.<br>\r\n<br>\r\n\"I heard this girl tamed a dragon!\" one voice I overhear says.<br>\r\n<br>\r\n\"I saw her earlier, she didn't really seem that expressive.\"<br>\r\n<br>\r\nTo be honest I sorta thought that too. But then suddenly a spotlight appears on the stage, and emerging through a curtain is Azuma. Dressed in her usual outfit only minus her lance, she walks calmly to the middle of the stage. Her expression neutral as she scans the crowd, but Azuma makes eye contact with me. And a little smile graces her lips.<br>\r\n<br>\r\nThen the music begins to play, and then I hear her sing.......<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=fBFWOEdxd_c\" target=\"_blank\">https://www.youtube.com/watch?v=fBFWOEdx...</a><br>\r\n<br>\r\n<b>In the White Light.......A hand reaches through......A double edged blade cuts your heart in two.....</b><br>\r\n<br>\r\nWow......so.....beautiful. Azuma goes through some dancing motions as she sings, and using her magic trails of water flow from her hands as she performs. As she spins Azuma actually makes water fly above us, coating the ceiling above with an ethereal blue glow. Which earns loud cheers from us all, following the changing of the top back to normal the stage was then covered in darkness. <br>\r\n<br>\r\nA snap of the fingers was heard from the stage, and the lights went back on. With Azuma now wearing a dark purple version of her outfit, must have been changed with magic quickly. She now has a see through veil over her mouth as well.<br>\r\n<br>\r\n<b>Embrace the dark........You call a home.....Gaze upon an empty white throne!</b><br>\r\n<br>\r\nThis dance that she's doing now is far more passionate, the use of her water magic is there too. The crowd is cheering even louder, I'm doing the same now too. Wow, I can really see why Azuma is a very noted figure of Babylon. Her magic and moves are all well performed, the ethereal water she conjures is swirled around us before flying upwards and flowing all around Azuma in slow motion. <br>\r\n<br>\r\nAfter another minute of this Azuma concludes her dance, ending in a very elegant bow. We all give a very loud round of applause to which she rises up and removes her veil to give a very wide grin. It changes to a warm smile when her gaze falls to me though, and I can't help but give a little chuckle before returning it. </span></div></div>",
            "created":1467389640,
            "id":2173647,
            "title":"Sing with me~"
        },
        "131112":{
            "author_id":"deus001",
            "author_name":"deus001",
            "choices":[
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Li Hercules POV<br>\r\n<br>\r\nWell that's it then, I'm a member of this school now. To be honest it's still a bit surreal that I'm here, seems like just yesterday I was wondering if I'd be coming here in a few years only to find that I'm here now. I got set up at my dorm, I've got my own room. I dumped my stuff there, but I'm feeling a bit restless. Maybe it's just my nerves acting up on me, we've been given free time now and curfew's not till a bit. There's a nice lake not too far from the school, taken care of and everything. The sun's already set, black night now. But there's a couple of hours left, so I feel content to simply wander there.<br>\r\n<br>\r\nI head down the path to the lake, cobbled stones with some lampposts to light the way. The path gives way to a wooden sort of dock, there's a few signs saying not to feed the fish and that the water's deep and so on. As I make way to it though I realise that I'm not alone, in the far off part of the lake is Azuma. Still dressed as she usually is, her bare legs dipping into the water. She's looking into the water, at her own reflection with a sense of hidden awe on her face.<br>\r\n<br>\r\nThe next thing I know she begins hovering, no doubt using magic to propel herself upwards. Azuma then stops, her feet staying on the top of the water but doesn't go downwards. She holds the elaborate lance in her hands, it doesn't seem like she's noticed me yet. But then all of a sudden I hear a loud roar from behind me and the noise of a heavy thud, I quickly turn around and a sort of dragon monster right in front of me!<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://static1.gamespot.com/uploads/screen_kubrick/1512/15120939/3001756-gsthumb_corrinbayonetta2.jpg\" target=\"_blank\">http://static1.gamespot.com/uploads/scre...</a><br>\r\n<br>\r\nI fall down, though I'm not falling into the water thankfully. Shit, I don't have my weapon on me. I left it at the dorm, the monster roars at me again and lifts it's front legs up but then.......<br>\r\n<br>\r\n\"Aqua! Heel!\" Azuma's elegant voice shouts above the din, the monster pauses and then stands normally. Before simply lying on it's belly and huffing at me. I turn around to see Azuma walking across the lake's waters, nearly gliding over the surface of it. <br>\r\n<br>\r\nShe does that head tilt of hers again, letting some of her long blue locks of hair go to the front of her head. A second later Azuma speaks with \"Li, I didn't notice you. Aqua was summoned by me to become accustomed to his new home, as am I.\"<br>\r\n<br>\r\nI cough politely, after a brief pause I say \"I saw you had a look of wonder on you when you waded into the lake, is it because of where you are from?\"<br>\r\n<br>\r\nAzuma nods and replies with \"Babylon is surrounded by the desert, the sands help ward off intruders. But it obviously limits water, it's why I am highly praised there. For I can use my magic to produce water from thin air, but a lake is something I've never been present to.\"<br>\r\n<br>\r\nAs if to prove her ability Azuma traces her lance's tip in the air, it glows and water traces along it before dropping into the lake. \"Woah.....that's incredible Azuma, do you incorporate it into your dancing?\" I inquire.<br>\r\n<br>\r\nThe girl responds with \"Yes, it helped me tame Aqua. He hadn't partaken of water in ages, I gave him his name as a fitting thing for him. I apologize Li, but I think I will retire for tonight. Aqua, vanish.....\" Azuma stands to the creature's head and placed her hand on it's forehead.<br>\r\n<br>\r\nIn response the dragon purrs, before slowly fading away in a pure white light into her hand. The dancer gives me a small smile before walking up the path, I figured I'd go with her. Least till we have to part ways.<br>\r\n<br>\r\n\"Are you worried about the trails that will come Azuma?\" I ask as we go back up the path.<br>\r\n<br>\r\n\"Of course, but I'm confident in my abilities and Aqua. What of you Li?\" she responds, Azuma didn't seem the least bit concerned. Then again she's not really emotive, but if she were in her element I strongly believe she would be.<br>\r\n<br>\r\n\"Same here, I can handle myself in most situations. But still......ack there's no point thinking about it. Better just go and get some rest. I'm going this way, Azuma your over there correct?\" I say as I point to one road that the path splits into.<br>\r\n<br>\r\nAzuma nods and gives a small bow before saying \"Indeed, goodnight Li.\" with that the dancer departs, though I catch the briefest smile on her face as she turns. Was it a trick of the light? Nah couldn't be, but it's something to remember at least.</span></div></div>",
            "created":1460178000,
            "id":2130315,
            "title":"Your choice."
        },
        "1311121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Follow another student waking up.",
                "I find Diana.",
                "Azuma finds me."
            ],
            "content":"<div class=\"\"><div> <span><b>Li Hercules POV</b><br>\r\n<br>\r\nThe following morning, I woke up feeling refreshed and energized. Only, to my surprise and horror, I was no longer in the boy's dorm or Ares Academy! I was in a small room somewhere in the city ruins about ten miles outside the walls of the Olympus kingdom! I knew this because I could see the kingdom just beyond the old city walls!  I frantically looked about and was relieved to find Thor, my double headed war-hammer lying next to me. I spotted my cypher, what used to be called a cellphone, next to Thor and picked it up. I had a message waiting; it was from Alpha Zeus, the headmaster. I pressed the play button and a hologram of Zeus appeared standing before me.<br>\r\n<br>\r\n\"Greetings, student.\" Calmly, Zeus said. \"You and every last other new student was transported into the walls of this city outside of the kingdom for your initiation test.\"<br>\r\n<br>\r\n\"Great!\" Huffing, I muttered. \"What kind of test is this?!\"<br>\r\n<br>\r\n\"You task is simple; find three other students and return them to the kingdom alive.\" Calmly, Zeus continued. \"You must find your own way in without allowing any remnant monsters to follow. Do not hesitate to kill the monsters you encounter or you will be killed.\"<br>\r\n<br>\r\nThe hologram then vanished. \"That is just perfect!\" Annoyed, I said. \"I didn't even get my first cup of ale and I have to fight monsters to find three other students and take them back to Olympus!\"<br>\r\n<br>\r\nI was particularly grumpy without my first cup of ale as it helped sooth my nerves for the day ahead. Still, I understood the meaning behind the test. Before the kingdoms were built, in the times just after the war, no one slept well and often had to search for comrades or loved ones in the morning as they were stolen in the night by the remnant monsters.<br>\r\n<br>\r\n\"Well, I better get started.\" Taking Thor into my hand, I said. \"I just hope Blake, Azuma and Diana are okay out there; maybe we'll meet each other during my search.\"<br>\r\n<br>\r\nI knew of Diana through rumors at Spartan Academy, she was one of the first normal humans to be accepted to Ares Academy with a robot wolf her father had built for her. Azuma I briefly met while getting on the airship transport. She seemed nice but very quiet. Placing my thoughts aside, I walked to a gaping hole in the wall to the ruins of the city. It was an eerily quiet morning which placed me upon my guard. There was no doubt the remnants knew there were humans in the city and were on the hunt for us. It was only a matter of time before I would encounter one of them.<br>\r\n<br>\r\nI leaped out of the room onto the street and scanned the area for any other students...<br>\r\n</span></div></div>",
            "created":1460178000,
            "id":2130352,
            "title":"Continue"
        }
    },
    "info":{
        "author_id":"scilock",
        "author_name":"Scifiwizard",
        "brief_description":"Become a young witch or mad scientist training to protect the world!",
        "created":1459703400,
        "description":"<td align=\"left\" class=\"norm\"><b>Background:</b><br>\r\n<br>\r\nOn a world known as Nero Earth, there was a vicious war between witches and mad scientists that devastated the entire world. Monsters were made by the powers of both supernatural and super science. The general public at large fought back and eventually won, ending the war. Only civilization as we know it was left in ruin and chaos.<br>\r\n<br>\r\nOne century after the war, civilization rose again into five great kingdoms in a much changed world. The five great kingdoms were:<br>\r\n<br>\r\n<b>Olympus in New-Europe.</b><br>\r\n<br>\r\nOlympus rests in the high mountains of Eastern Europe. It is surrounded and protected by active volcanoes that now rumble out of control. There is an equal split of magical and technological warriors.<br>\r\n<br>\r\n<b>Atlantis in Oceania </b> <br>\r\n<br>\r\nAtlantis is a 'glass' domed kingdom that rests on an artificial island that can vanish and appear anywhere on or below the seven oceans of Nero Earth. It primarily rests in the North Atlantic. Their warriors rely heavy on technology but they have a few magical warriors.<br>\r\n<br>\r\n<b>El Dorado in the Amazon Jungle.</b><br>\r\n<br>\r\nEl Dorado rests in the Amazon Jungle. It is protected by the dense jungle and the monsters that reside there. Their warriors rely heavily upon magic but they have a few technological warriors.<br>\r\n<br>\r\n<b>Babylon in the Great Deserts</b><br>\r\n<br>\r\nBabylon rests in the great deserts of the Middle East. It is protected by the desert and the monsters who reside there. It's people work to regain control of the monsters left behind by the terrible war. Some of their efforts have paid off but it is considered a futile task by many in the other kingdoms. Still, they are greatly respected for their accomplishments. Their magical and technological warriors each have one 'tamed' monster working along side them.<br>\r\n<br>\r\n<b>Utopia of Soviet</b><br>\r\n<br>\r\nUtopia rests in the great cold expanse of what was once known as Siberia. It is a tropical oasis that should not exist in such hostile conditions but it does. It is protected by the barren. This kingdom is a technological magic realm that believes technology fused with magic is the key to protecting the peace. Their warriors have weapons that use both magic and mad science.<br>\r\n<br>\r\n<br>\r\nStory:<br>\r\n<br>\r\nThis story focuses on the Olympus kingdom where the head master of <b>Ares Academy</b> is named <b>Professor Alpha Zeus.</b> The head teacher is named <b>Alia Siren</b>; she is one of a set of triplets. Her two sisters are also teachers, <b>Beta Siren</b> and <b>Trina Siren</b>. (reference to the three sirens or masters of fate in Greek Mythology.)<br>\r\n<br>\r\nThe first character introduced is named <b>Li Hercules</b>. (Li is Chinese in origin meaning strength) This boy of fourteen had a European mother and a Chinese father. He is polite but has a hot temper and is not afraid of a fight. He carries a double headed war-hammer as a weapon which can fire bolts of electricity on one end and magical blasts on the other on top of being a heavy blunt instrument. He possesses incredible strength and endurance but he is only average when it comes to speed.<br>\r\n<br>\r\n<b>Rules:</b><br>\r\n<br>\r\n1. You may create and play any character of yours or other person's design. Follow the above example to introduce any new character. This character my come from any of the five kingdoms listed above or even a new kingdom. Use the above kingdom descriptions as an example to introduce the new kingdom. If this character plays out well, I will add the new kingdom to the list.<br>\r\n<br>\r\n2. Do not kill off any character without a good reason! Make the death of a warrior have meaning!<br>\r\n<br>\r\n3. When playing any character start the chapter using the following opening line:<br>\r\n<b>(Character's name) POV</b><br>\r\n<br>\r\n4. All chapters are in the first person (I, me, myself, etc.) See rule 3.<br>\r\n<br>\r\n5. Be descriptive but not graphic regardless of the content of any given chapter. Any entry that qualifies as graphic or offensive will be deleted without notice!<br>\r\n<br>\r\n6. You may create any monster of magic or technological origin. However, try to be original when naming them. Examples: <b>1. Undead warrior:</b> A technological monster made from the remnants of corpses. (Frankenstein's monster <b>2. Super Zombie:</b> A seven foot zombie with magical weapons from the war.<br>\r\n   <br>\r\n7. If you have any questions <b>please</b> do not hesitate to email me and ask!<br>\r\n<br>\r\nHave fun!<br>\r\n </td>",
        "id":2080204,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1538951580,
        "modified":1538951580,
        "pretty_title":"Nero Earth"
    }
}