{
    "chapters":{
        "1":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Accept your fate and become Marisa’s apprentice.",
                "Start crying, and Marisa decides you'll be able to cope better if you’re younger",
                "Lash out at Marisa, causing her to shrink you in self-defence.",
                "Admit you don’t want to be a witch, so she decides you’d make a better familiar.",
                "Don’t do anything. The magic is too powerful for you and transforms you further."
            ],
            "content":"<div class=\"\"><div> <span>The place seems every sort of eccentric to you, but so far all your other options for employment had already been filled by someone more qualified. You need the money, too. Your parents decided that, having recently graduated from college, you no longer needed their help paying your bills. It’s not like you haven’t tried to get jobs before, but the small town you lived in could barely support itself with the economic troubles of recent years. No, this is your last chance to keep yourself financially sound, no matter how strange the place may be.<br>\r\n<br>\r\nStepping inside doesn’t help assuage your unease, however. The first thing you notice is that there are no costumes, unless you count the dark robes hanging on a small coatrack in the corner, or the strange tribal masks decorating the back wall. Next thing to hit you is the smell, a strange mix of scents from the dust, the odd colored bottles and candles on a nearby shelf, and the animals caged up in back. It’s not exactly unpleasant, though, simply different, like being in a foreign country.<br>\r\n<br>\r\n“I’ll be right with you,” a woman’s voice says, drawing your attention to the actual people within the shop. There are only a few. One, an old woman, is wearing a large coat made of feathers that makes her look like some sort of owl. She smiles at you when she notices you looking at her, reminding you of an elderly neighbor you had when you were younger, a neighbor you’re sure you remember your parents saying passed away. <br>\r\n<br>\r\nShe’s not the one who spoke to you, though. The voice you heard was more youthful, clearly belonging to the young woman in back who was busy talking with a middle-aged man dressed in a dark suit. You can’t make out what they’re saying, but they both look pretty serious about it. The woman looks to be about your age, perhaps a few years older. Her hair is naturally red, but about half-way to her shoulders the red stops and becomes black. Dying it like that seems odd to you, but perhaps she just hasn’t had the time to dye the rest of it. Regardless, it doesn’t make her any the less attractive, and if she works here, that would certainly improve your opinion of this job.<br>\r\n<br>\r\nSoon enough, the man departs, walking past you and out the door without even a glance. The girl looks flustered, even upset as she glares at his back with one of those looks you’re sure could kill. Still, she rubs her temples a little and puts on a smile, walking over to you. “Welcome to Eve’s Hollow. I haven’t seen you in here before; is there anything I could help you find?”<br>\r\n<br>\r\nYou shake your head, smiling as politely as you can. “I’m actually here about the job position. I saw you were hiring online.”<br>\r\n<br>\r\nShe smiles widely, nodding enthusiastically. “Of course, of course! I should’ve known. You don’t know how much of a relief this is. It’s been difficult running this shop on my own, and I was worried that those Harry Potter books had made kids more interested in learning magic at some fancy school rather than good old-fashioned one-on-one apprenticing.” She walks around to the other side of the checkout, searching under the counter for something. <br>\r\n<br>\r\nYou’re a bit worried about how strictly she’s sticking to this whole “Witch’s Apprentice” thing, but you remind yourself that you don’t have many options. There is one thing you find curious, though. “You run this whole store on your own?” It seems hard to believe with how young she is. “Does that make you Eve?”<br>\r\n<br>\r\n“No no,” she replies, coming up with a small stack of papers which she lays in front of you. “Eve was my grandmother. I’m Marisa, Marisa Tanner.”<br>\r\n<br>\r\n“David Selim,” you offer, leaning on the counter to get a better look at the papers. It all looks like the standard array of contracts for a new employee.<br>\r\n<br>\r\n“Nice to meet you, David. I don’t think we’ll have any issues, but I’d still like to ask you a few questions. For starters, what sorts of magic have you dabbled in?” Not even a smirk as she says this. Could she be serious? <br>\r\n<br>\r\nYou hope not, but you’d better just play along. “I’m afraid I don’t have any magic. I was hoping that, uh… I could learn on the job.” You’re not sure you sounded entirely convincing, but at least you’re trying. It wasn’t like you needed to convince her you believed it, only that you were willing to go along with it.<br>\r\n<br>\r\nShe seems quite surprised, though, looking up at you with a frown. “You’re a non? That… makes things more difficult.” Biting her lower lip, she glances around at the store. “I could really use an apprentice, though. So… How would you feel if I gave you some of my magic? I can’t guarantee what will happen, since magic like that tends to come at a price.”<br>\r\n<br>\r\nRaising an eyebrow, you wonder how long she’s had to do this that she can say stuff like that with a straight face. “You can’t just… teach me the magic or whatever? I have the time to study a couple of books in my off time.”<br>\r\n<br>\r\nMarisa shakes her head. “Haven’t done your research very well, have you. I hate to take a wannabe like you, but I’m kind of desperate here. Look, a witch’s magic isn’t something that can just be taught. You have to be born with the potential. If you don’t have it, that means I need to give it to you. Are you willing to take that risk?”<br>\r\n<br>\r\nYou’re getting a bad vibe from this, but magic doesn’t actually exist, so what danger are you really in? Besides, you literally need this job. Still, you hesitate a moment before nodding. “Alright fine. Just tell me what I need to do.”<br>\r\n<br>\r\nSeveral signatures later, with the store closed for the night, you find yourself sitting in an empty back room. It’s been a boring wait, with the shop owner saying she needed to prepare the components of the spell. You’re starting to think that she’s serious about this magic stuff, which means she’s crazy, and that could mean any number of bad things for you.<br>\r\n<br>\r\nSoon enough, she emerges, holding a rope and some really old book. She hands you one end of the rope, which to your displeasure is soaked in something you don’t want to identify. She holds onto the other end as she opens the book, starting to read out of it. You can’t tell what language it is, though it seems vaguely Scandinavian. You do think you hear her name and your own a couple times. <br>\r\n<br>\r\nWhen she finishes reading, she closes her eyes, and a moment later you feel a warmth in your hand. It’s not painful but it does feel uncomfortable, and it’s traveling up your arm. You try to let go of the rope, but your body won’t respond. You’re completely immobile as the warmth travels to your chest and spreads out in all directions from there. You feel sick and dizzy, but also excited and even a little aroused. Still, you’d do anything to escape this torment. Was it really magic, or was the rope laced with some sort of poison?<br>\r\n<br>\r\nYou’re not sure how long you sit there in agony, but the next thing you know Marisa is standing over you. You jump, pushing her away. “Don’t touch me, you bi-” You stop, eyes wide. That wasn’t your voice. You look down at yourself quickly. Your clothes are baggy, but it’s hard to miss the two small bumps pushing your shirt out. “What... What happened to me?” you ask weakly, slipping your hand into your pants to make sure. You feel the smooth skin and hair down, until you reach the edge of a slit, gasping a little and quickly pulling your hand back out, face bright red.<br>\r\n<br>\r\nThe shop owner smirks lightly. “You’re a girl, what’s it look like happened? Seems that a witch’s magic is more tied to genetics than I thought. When I gave you a bit of my spark, it apparently needed to change you to become more like me.” She holds up a mirror, and it takes you a moment to realize it’s your reflection. You’re definitely a girl, with a lean face and soft eyes. Though your eye color has remained brown, your hair is red like hers, and your face is littered with freckles to match.<br>\r\n<br>\r\nFor a moment, you don’t say anything, just watching your reflection open and close her mouth uselessly. It looks like magic is real after all, and your life just got ruined by it. “T-Turn me back!” you shout suddenly on the edge of tears.<br>\r\n<br>\r\nShe shakes her head, and you can see the pity in her eyes. “Sorry, David, it’s not that simple. You’re magic now, and that magic apparently needs you to be female. There’s no way to remove magic from someone. Besides... you knew there were risks here. You wanted to learn magic, right? Seems like a good trade. I’ve been a woman for a long time, and I certainly don’t think there’s anything wrong with it.”<br>\r\n<br>\r\nYou look up at her uncertainly, feeling a mix of emotions. Anger, hopelessness, fear, despair. Eventually, one emotion overpowers the others and you...</span></div></div>",
            "created":1330146000,
            "id":1283941,
            "title":"Help Wanted"
        },
        "11":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Stay with Marisa.",
                "Stay with Marisa's empolyee.",
                "Go back to living with Lauren, using Marisa's compatibility spell.",
                "Live with Lauren, but without using the compatibility spell.",
                "Try to find a place to live on your own."
            ],
            "content":"<div class=\"\"><div> <span>With careful determination, fighting back the instinct to cry or much worse, you nod slowly. Not like you're accepting her insane logic, rather as an acceptance of your current fate. Chances are it will be over by morning and you can go back to being a bum not making nearly enough money to pay his own bills. \"Okay, Marisa.\" You say, looking into her eyes and nodding again. \"I really need this job.\" Of course that isn't your reason, not really. No job, no matter how well paying, would be worth your manhood. But if you play along, hopefully she won't do anything permanent to you while this is effecting your mind. \"What should I do about housing, though? I live with my girlfriend... somehow I doubt I could trick Lauren into thinking I'm still David.\"<br>\r\n<br>\r\nMarisa bites her lip for a moment, pondering this. Eventually she offers her hand down to you, and you take it, getting unsteadily to your feet. If this is a trip, it's by far the most realistic one you have ever had. You feel slightly more top-heavy than you remember, and your slim legs ending in wide hips make it very clear why that might be. \"I'll think of something, David. But either way, you're going to need a familiar to be my apprentice. Why don't we go into the shop and pick one out for you, okay?\" You don't much like this idea, but Marisa takes your hand and drags you through the doorway and the thick hanging beads into the shop proper. You blush a little at her grip- being changed into a woman has evidently done nothing to how attractive she looks. That is encouraging to you if nothing else - if you still think she's attractive, then this can't be real! The animals are, though. You remember seeing them, remember walking through the shelves of little cages while you waited for the shop to close down, looking at each and every one of the little critters. Either Marisa has an exotic animal permit or she's doing this illegally, which you suspect is the case considering what she's already done to you. Anything small enough to be lifted in two hands is here. Dogs and cats of course, but other things too. Ferrets, fish, birds. You see a kangaroo, which catches your attention. You could've sworn you saw the tentacle of an octopus in one of the tanks, but when you look again only a boring goldfish is floating there.<br>\r\n<br>\r\n\"Pick one, David.\" You look at each cage, and you can see an intricate little sticker with a name, sex, and age for each animal, along with the species. However crazy this situation might be, you've always liked animals. Maybe you could get a cool pet out of this whole debacle! You scan the shelves, looking at all of the animals here for sale. The first thing you notice is that the years don't add up at all. Your eyes fall first on a fairly young-looking ferret who's name is apparently \"Tommy\", but whose age is listed as 31! You don‘t know much about ferrets, but you're pretty sure that they don't like that long. How on earth could that goldfish be 60? You're positive goldfish don't live that long! In light of the insanity of everything else though, you ignore that fact and look over all the choices open to you. Eventually you decide to gesture at the little red Cardinal in a birdcage with several duller specimens, reading the tag as you do so.<br>\r\n<br>\r\n\"I like him... Justin? 12, Male…\"<br>\r\n<br>\r\nMarisa nods, reaching down to her pocket and drawing out a heavy-looking keyring, selecting one and sliding it into the cage. \"Now the rest of you behave. She glowers at the other birds, which all retreat a few paces along their various perches. \"If you try to fly out and do anything funny, I'll make you into slugs. If you think it‘s hard to be picked as a bird, just you wait until you've been a slug. Have you /ever/ see anyone come in with a slug familiar?\" She swings the cage open wide. you expect her words to do all of nothing to the assembled crowd. Birds might be able to be trained, but you always heard it was huge tropical birds and massive birds-of-prey that could be taught to obey. Not pigeons and bluejays and other little things. But they held still, even as Justin hopped tentatively forward a few paces towards the exit, seemingly afraid to do anything. At an encouraging gesture from Marisa, he fluttered lightly out and onto her finger.<br>\r\n<br>\r\n\"He's a scrawny little thing, isn't he?\" You observe, looking the little bird over. He's clearly young, and looks a little bedraggled. He‘s got a subtle cuteness there, like a dirty little kid.<br>\r\n<br>\r\n\"You should've seen him when I found him. I've never seen a worse-off child. Apparently he had an older sister once, but I never could find her. Living alone in /our/ city, stealing food and sleeping anywhere he wouldn't be yelled at. I kept seeing him... when winter came, I absolutely had to do something. Justin's one of my favorites: He'll make a great familiar.\" She extended her hand to you, finger outstretched with the little bird perched on it. You extend your hand almost reflexively, even if you are still turning over the details of the story in your head.<br>\r\n<br>\r\nReality does not wait for you to finish, though. The effect of contact with the bird is immediate. You feel something strange and inexplicable coursing through you, as though the bird had been made of ice, dripping cool fluid all over your arm. Only the fluid is inside you, and the cool travels rapidly through your body. It's the strangest sensation; as the fluid spreads it seems to be taking your body with it. You feel yourself stretching and shrinking at the same time, as though parts of you are dissolving and the rest of you is stretching to make up the difference. You shrink about eight inches in height, but almost more in other ways. You go from a well-endowed, wide-hipped young woman to more of a scrawny build, not unlike the bird. Your chest feels much lighter as the cool sensation starts to fade. The only thing that has grown more pronounced is your hair, which seems redder than ever. To add insult to injury, your now thin build is too slim to hold up your shorts and boxers, which slip off your girlish frame without much resistance. You've still got wide hips, but a smaller body in general just doesn't have the bulk to hold them up.<br>\r\n<br>\r\nYou reach down to snatch them back up as quickly as you possibly can, holding your shorts up with one hand as Justin lands on the other, looking up curiously at your face. Of course, that isn‘t before you caught a good look at yourself, little red bush and all. Marisa giggles, which does nothing to comfort you, though you admit you're glad there aren't any boys around. None except the bird, who watches you with frighteningly blue eyes that are far more intelligent than any bird should be. Of course, what catches you most off-guard are his words. \"Sorry, David!\" It sounds just like birdsong, but the presence in your mind, a presence you hadn't noticed until that exact moment, supplies the words. What's even stranger is the feeling of holding him, which feels much more like holding one of your hands with another than holding a bird in yours. As though you were feeling what /he/ felt, as well as you. \"I hope we can still be friends! I'll be a good familiar! The others even told me what I‘m apposed to do! I’m a quick learner! I'll be the best familiar you ever got!\"<br>\r\n<br>\r\nYour mouth falls open, and you stare speechless at the bird. For too long it seems, because the bird flutters off your hand and lands back on Marisa's, where you feel more than hear him chirp up to her. \"She hates me! She won't let me be her familiar! She's gonna stuff me and and and andandand\" Marisa reaches over with her other hand and closes the little bird's beak gently.<br>\r\n<br>\r\n\"Be quiet Justin! She's just adjusting to the change. Connecting with you changed her- just give her a minute. I‘m sure she doesn't hate you. RIIIIGHT?\" There's a meaningful glance from Marisa in your direction then, like that which would be given in the presence of a small child on the verge of going into hysterics, keying in another adult whose words might prevent or provoke what was to come.<br>\r\n<br>\r\nIn some way you can't explain, Justin's discomfort is quickly becoming your own, and it is more and more difficult to answer calmly. You do, though. \"O-of course!\" You manage to say with more enthusiasm than you feel. \"I just didn't expect I would... what happened, Marisa?\"<br>\r\n<br>\r\nMarisa looks relieved as the bird relaxes. \"When you and your familiar are connected, it changes you.\" She held onto her black highlights for a moment, as if showing them to you. You don't really understand what she means, but listen anyway as she continues. \"You became a little more like Justin, and he became a little more like you. That's okay... fewer of my customers should think we're sisters now that you look so different.\" You want to object, just as you wanted to object the moment this awful situation left the realm of reality and solidly entered the domain of insanity. But you don't get the chance, because she continues on. \"I have a few ideas about where you could live. One of my employees is looking for a roommate. He's a little... different... but he would love to split the cost with you. Either that, or I could give you a compatibility spell, and you could just keep living where you are. It would change things around you to match the way they are now, but the changes wouldn't extend more than a mile or so.\"<br>\r\n<br>\r\nThis isn't fair! So much is going on that you can't even think straight! You want to break down and curl up in a corner, not make all sorts of decisions! In the end though, you speak up and say that you would like to...</span></div></div>",
            "created":1347731340,
            "id":1428004,
            "title":"Accepting Your Fate, or at Least Your Trip"
        },
        "112":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A teenaged naga.",
                "A mature drider.",
                "A young anthro chipmunk."
            ],
            "content":"<div class=\"\"><div> <span>\"I'll... I'll...\" You're so overwhelmed that your mind jumps almost immediately to the option Marisa first suggested. More and more of the evidence seems to suggest that what you are experiencing is actually real, and not induced by drugs. Some last vestige of your common sense tells you that the way you are most likely to survive this is if you have someone to help you who is more on your level than Marisa. You don't particularly relish the idea of asking Marisa to live with /her/. She was the one who did this to you! But her employee, whoever he is, he can't be that bad, right? \"I'll... I wouldn't mind living with whoever it is that works for you. But... what about... everything? Clothes and stuff? I...\" You glance down at your hand, where you're holding your shorts and boxers from slipping off again. \"I don't even know how to shop for women‘s clothes.\"<br>\r\n<br>\r\nMarisa grins at that, almost from ear to ear. \"If you let me pick your clothes, I'll pay for 'em myself. We get to go shopping!\" She giggles, though she quickly regains her composure. \"As for right now - some of my old things should fit you okay. I'll bring you over to Gauge's apartment, and we can park real quick at my house. It shouldn't take long for me to find those old boxes...\"<br>\r\n<br>\r\nThat whole process is so quick that you almost don't realize it is happening around you. One minute you're standing there in the shop holding a talking bird, and the next... you're waiting in the passenger seat of Marisa's car, having a lengthy conversation with Justin. \"So what does a familiar /do/ exactly?\" You ask him rather bluntly, watching the little bird perched atop the dashboard.<br>\r\n<br>\r\nJustin answered quickly, as he always did. Quick was essential to the very nature of this animal; there was nothing he did that wasn't almost blurry fast. Yet somehow, it did not give you difficulty to watch him. You felt his movements like they were your own, so you always knew where to look and for how long. \"Lotsa stuff!\" He answered cheerfully, fluttering closer to you. Subconsciously you put your hand out, extending your index finger for him to use as a perch, which he does. \"I'm... kinda new at all this magic stuff, but I'll try to remember what the other familiars taught me.\" He paused a moment, thinking intently. Whatever other advantages he might have, deep thought obviously did not come easy to him. You knew this because it was becoming harder for you - it took more effort to consider anything for more than a fraction of a second. You wanted to just settle on the answer and  be done with  it. He does struggle through it this time though, and eventually answers. \"We help with magic mostly. I'll help you focus and stuff. Plus, in case you haven't noticed, I‘m a bird now.\" He says this proudly, somehow smiling at you, and spreading his wings for emphasis. You can't help but smile back at this, thinking of the child this used to be. \"I can fly! I can be in places you're not. I can look for things for you, or... or...\" He lowers his wings. \"I know there's other stuff, but I can't remember!\"<br>\r\n<br>\r\nYou smile, reaching out and stroking the little bird's head gently. \"Relax Justin. I'm new at this too. We can learn together.\" The bird smiles back, chirping musically and entirely without meaning. You want to learn more about this Justin, but before you have the chance to ask, Marisa returns with a huge plastic tub of neatly folded clothes, which she crams into the trunk before getting back into the driver's seat and speeding off. It's getting late, and the stress of all that has happened is exhausting. You manage to pay attention long enough to hear her say \"I already called ahead; Gauge isn't home now, but he's fine with you moving in with him. He told me to let you in and he would-\" That's it; you don't hear anything more before dropping completely unconscious.<br>\r\n<br>\r\nYou are roused quickly though, or so it seems. The car's parked now, outside what seems like an ordinary apartment complex. You can't say you recognize \"Arcadia Estates\", but it looks far nicer than where you had been living. Your eyes search immediately for Justin, though as you stand you feel him nestled gently between your legs, and you lift him gently into one hand as you get up, not wanting to wake him. He stirs a little in your hands, but doesn't wake up; you can still /feel/ how asleep he is, and it's making it difficult for you to stay awake. \"Almost there.\" You hear Marisa prompt you, pushing you gently up the stairs into the building. The first thing you notice is an absurd little construction on either side of a main hallway, four levels of little doors and little stairs and ramps connecting them all, each door maybe eight inches tall, some even smaller. \"He's in apartment J\". You hear Marisa explain, gesturing to a door on the third floor. \"Hand me your familiar. We'll put him in through here.\" You obey, too groggy to really even attempt to understand what is going on around you. Marisa opens the door, and sets the bird down on something soft in the tiny room beneath, though you don't get a good look at it, closing the door behind her.<br>\r\n<br>\r\nYou feel Marisa take your hand then, leading you along the hallway to an elevator. The doors open, and you step inside. Interestingly enough, you notice that there are buttons for each apartment, which seems a little strange to you. She presses the J and the elevator doors close. Gauge will be here in the morning, you can catch a ride with him to work. I expect he will just pay for you to use the bus. Either way.\" The doors open directly into the apartment, and Marisa shoves you off, gesturing to the box of clothes sitting near the door. \"We'll go shopping after work tomorrow - we always close early on saturday. See you tomorrow!\" The doors close behind her, leaving you alone.<br>\r\n<br>\r\nYou don't get ten steps before making it to the couch, where you close your eyes and curl up into a weak ball. You subconsciously wish Justin was here, feeling a little lonely without him, but you're too weak to worry about that now. Unconsciousness comes, and, with it, dreamless sleep.<br>\r\n<br>\r\nThe next morning, the first thing to spring to your notice is a voice, distinctly male, and a hand gently prodding you awake. You slowly open your eyes, and jerk away in shock, because the person waking you is...</span></div></div>",
            "created":1348341780,
            "id":1432871,
            "title":"Choosing to Live with a Coworker"
        },
        "1121":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Have breakfast and get to know Gauge better, worrying about showering later.",
                "Take your time in the bathroom so you can fully inspect your new body.",
                "Rush to get to the store so you can work on finding a way back to normal."
            ],
            "content":"<div class=\"\"><div> <span>Your first instinct is to recoil, pulling your legs close to your chest, looking up with horror at the monster \"standing\" beside you. He would look like a teenager; if it weren't for the long snake-tail he had instead of legs, he might've just been another kid a few years younger than you. But that tail made him huge! Brown and black scales like a garter-snake shone brightly in the light of the sun from several skylights. Far from doing anything threatening, the naga had an apron as his only clothing, which made him look almost comical. He looked more than a little afraid at your expression, pulling away from you almost as fast as you withdrew from him. \"Sorry!\" He frowned, looking almost embarrassed. \"I... just wanted to ask if you wanted any cinnamon rolls, that was all. I can't eat the whole tube myself.\" He gestured back into the kitchen, at a tray of prepackaged cinnamon rolls drizzled in delicious-looking icing.<br>\r\n<br>\r\nYour breathing and heartbeat are still rapid, and you can't take your eyes off his tail. \"Y-you're...\" Is the first thing you squeak out, pointing rather rudely.<br>\r\n<br>\r\nThe naga frowns a little at your reaction, though he doesn't seem particularly surprised. \"Marisa said you were a non, but you smelled so magical I thought she must have made a mistake.\" He shrugged. \"I'm a naga. That means part snake, part person.\" He gestured to each half as he spoke, as though it were the most obvious thing in the world. \"Pygmy naga, technically.\" He said that last with notable disdain, as though he thought it almost unworthy of mention. \"But pygmies are the best species of naga there is. We have a proud history.\" He puffed his chest out, which made him look almost cute with the apron and all. Wait... cute? You recoil inwardly at that thought. He's... you're a man, dammit! \"A proud history that doesn't involve enslaving anyone else. We have lived in peace with all the fae species and even with humans, despite what /they/ did to us...\"<br>\r\n<br>\r\n\"What does pygmy mean?\" You ask the question that's on the forefront of your mind before you say anything else, unable to resist the desire to learn about this detail. Something about this whole housing arrangement seems /off/ to you. Something wasn't quite right.<br>\r\n<br>\r\nHe blushes a little, turning away and slithering back into the kitchen. He answers when he's facing away from you, so you can‘t see his expression. \"It means we're… small. But respectably-sized! We're many times larger than even the Greater Specters, with. all their 'ancient wisdom' and crap.\"<br>\r\n<br>\r\n\"But...\" you stand up, holding up your shorts with one hand and following him into the kitchen. \"You're not small. You look at least... fifteen feet long?\" You shrug. \"Big. No pygmy for sure.\"<br>\r\n<br>\r\nThe naga turns around, raising his eyebrows. \"You aren't serious, are you? You can't really think I've gotten any bigger. You know that's the first rule of magic, right? Matter can‘t be created. Big things can get smaller, but smaller things stay small. Then he smiled. \"Just look at your familiar over there.\" He gestured through the kitchen, which appeared to occupy the center of the apartment. You move past him, stepping gingerly over his tail to get around him and take a look. Once you're over into the other half of the room, you see... a bird the size of a horse, with bright red feathers, resting gently on the ground with his legs curled below his body. You recognize him at once, despite how huge he is, so big you could climb right on his back if you wanted. He seems to almost sense your eyes, because he immediately jumps to his feet, causing him to stand several feet taller than you. This would have frightened you had it been just any animal, but you can feel the motion as though it was your own. Even if that glistening beak is inches from your face, it doesn't scare you. The idea of Justin hurting you is as absurd as the idea of your arm randomly grabbing your neck and choking yourself.<br>\r\n<br>\r\n\"Hi David! You're looking small today!\" He bounced up and down a few times on those thin legs of his. \"Did you sleep good? I did! I'm ready to do all kinda cool stuff! We get to start learning magic today!\" You reach out and up with your free hand, stroking his head not unlike a rider showing affection for their horse, though you know he is nothing of the sort. Of course, thinking of how small Justin really is... must mean that you're… You stagger backward, letting go of your shorts. They don't fall, mercifully, though this is hardly the first thing on your mind as you drop to your knees. This is too much, it's all too much! Being changed into a woman, a familiar as big as you are, snake-boy... was the reality you knew merely a dream? Couldn't you just go back to the way things were? Be a bum... Justin dropped to the ground beside you as best as he could, rubbing his head against your body in a way that was probably meant to be affectionate. \"We're stuck David, both of us... all you can do is learn to love it. It was really hard learning to be a bird. I... I'm still not the best at it. But it's better than being a boy.\" He sounded as much like he was trying to convince himself as though he was trying to convince you, which would make sense since the both of you were really one person. \"So we can learn together. We're partners in crime! The magic musketeers!\"<br>\r\n<br>\r\n\"I've got to ask.\" Comes the naga's voice, and you look up to see him \"standing\" not far away, watching you two. \"Can you actually understand the bird?\"<br>\r\n<br>\r\n\"Justin.\" You correct almost reflexively, looking up at him. \"His name is Justin. You can't?\"<br>\r\n<br>\r\nHe shook his head. \"No magic, no translation. But I forgot to introduce myself!\" He moved a little closer, reaching down to you and smiling. \"I'm Gauge\" You meet his eyes and feel your cheeks go red - you're so confused and embarrassed and shy that you follow your instincts and reach out, taking his hand. He tugs you confidently to your feet, though not nearly hard enough to hurt you. You sway for a moment, before holding yourself steady on his shoulder. He's so strong, so firm compared to you, and bigger too. You're slight and petite, while he is well-built, like some sort of model. It's not fair! Marisa was still looking attractive back in the store! \"Marisa told me your name was Day, right?\" He waits just long enough for you to nod before going on. \"Well Day, why don't you get dressed, and take a shower and stuff...\" He gestured towards a hallway. \"/Justin/ and I will enjoy these cinnamon rolls while we wait. But hurry; I have to open the shop at 9, and that is only two hours from now. Don't take /too/ long.\"<br>\r\n<br>\r\nYou think about this for just a moment before deciding you will...</span></div></div>",
            "created":1348344720,
            "id":1432908,
            "title":"Your New Roomate's a Snake"
        },
        "114":{
            "author_id":"drayelliott",
            "author_name":"DRayElliott",
            "choices":[
                "says she believes you",
                "tells the two crazies to get out",
                "screams for help"
            ],
            "content":"<div class=\"\"><div> <span>\"I...I'd like to try convincing Lauren of who I am. It might help me accept and feel better about the changes if someone I knew from before also knew.\" Marisa stands in silent thought for so long, that you think she's going to refuse outright. Then, to your surprise, she agrees. \"But I'll need to come with you. We can't just have a non go around knowing about witches and all without taking some precautions.\" \"Precautions?\" you ask nervously. It's hard to fault you for being jumpy when she says something like that, given all that's already happened to you. \"Like what?\" \"I'll just cast a spell that will make her very disinclined to talk. Basically, it'll force her not to reveal us. She'll just do something like laugh if anyone suggests that magic is real.\"<br>\r\n<br>\r\n\"It won't force her to do things against her will?\" \"No, it'll just keep her from spilling the beans.\" You consider that for a bit, then say, \"Okay, as long as you know what you're doing, and as long as there are NO side effects.\" \"There won't be. It's a very simple spell, virtually impossible to screw up.\" It's that \"virtually\" that has you worried. \"Okay,\" you say. \"Might as well get this over with.\" You both go out and get in Marisa's car, an older but well-maintained Honda Civic. \"Where's your broomstick?\" you ask with a little laugh. Marisa grins. \"We only ride those on All Hallows Eve,\" she says with a snicker.<br>\r\n<br>\r\n\"Do you turn your skin green and wear pointy hats, too?\" You have to admit: you're starting to relax and adjust to your new circumstances. Maybe being a girl won't be so bad, after all. \"Um, Marisa?\" \"Yes?\" \"Uh, never mind. Maybe later.\" She gives you a slightly puzzled look before turning her attention back to the road. How could you explain to her what was going through your head just then? You could barely parse your thoughts yourself. Perhaps once you've had a little more time go by, you could explain that you've now begun to grow so accustomed to the idea of being a girl that you want to know if she could improve your bustline a bit.<br>\r\n<br>\r\nYou see your apartment approaching in the distance. As you get closer, you suddenly get more and more apprehensive about how difficult Lauren is going to be to convince that you're David, and not some crazy chick. And if you do, how is she going to react when she finds out she now has a girlfriend instead of a boyfriend?. \"Do you know any simple, harmless spells that can convince Lauren that magic is real?\" you ask. \"Yes. In fact, I was just thinking of the most effective ones to use,\" she said with a small smile. That smile makes your nervousness ratchet up a bit more. When you pull up to the building, you see Lauren's crappy Yugo sitting in its slot. At least you don't have to wait for her to come home, you think. You get out your key and open your door. \"David? Is that you?\" you hear Lauren call out from the kitchen.<br>\r\n<br>\r\nYou gesture to Marisa, who takes your hint. \"Excuse me, are you Lauren?\" she says. Lauren walks out into the room. \"Who the hell are you two? How did you get in here?\" You take a deep breath, before saying, \"I think you might want to sit down for this conversation.\" She complies, and you begin telling your tale. When you reach the end of it, you hope she believes you, although, god knows, YOU sometimes still can't believe it. Lauren takes a deep breath and...</span></div></div>",
            "created":1377942960,
            "id":1654859,
            "title":"Living with Lauren"
        },
        "12":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Go with your girly instinct and choose a cute white bunny.",
                "Try to be more boyish by choosing an awesome red and black snake.",
                "Just stick with the cliche and get a black kitten.",
                "Are inexplicably drawn to a black-footed ferret watching you.",
                "Are too overwhelmed, asking to decide later."
            ],
            "content":"<div class=\"\"><div> <span>You've never felt so overwhelmed in your life. Just then, it feels like every little thing bothers you, pressing in on the weight of the sheer awfulness of your situation. So much for some sort of Halloween store; there's no doubt in your mind that magic is real. There cannot be any imagining what you feel: the pressure of breasts on fabric and the distinct absence of anything between your legs. There is no way not to think about what that absence means: David is gone. None of the people you know would recognize you. They certainly wouldn't believe you're the same attractive redhead as the ordinary and distinctly male brunette you were until a few minutes ago. What would your girlfriend say?<br>\r\n<br>\r\nShe's the last straw. Thinking about Lauren and the life you can't have again is enough to crush your will and leave you crying like a helpless child. You've never cried before in public, and at first you don't even know what's happening. But something warm is streaming down your face, and you're sobbing softly into... Marisa's shoulder. Strangely, the woman did not even seem to mind, wrapping her arms around you in the way you've sometimes seen women do. Is this what it's like to freely express emotions with someone else? \"Shh... Relax, David,\" comes her voice, soothing in your ears. \"I know it's a lot to take in. I don't expect you to be used to it in a few minutes.\" You're not sure what it is about being comforted by this woman that's a total stranger to you, but you really do feel better. The world really is feeling a little less scary in those big arms. It's so easy not to think of anything. The weight of your unsupported breasts isn't even bothering you anymore. It's partially that thought that makes you open your eyes. Partially it's the rush of fabric down your legs as jeans and boxers slide down to your ankles. The first thing you see as your eyes open is that you're looking /up/ at Marisa's breasts. How on Earth did you get so small? The next thing you feel is the chill of exposed legs. Looking down, you realize with newly renewed horror what happened to your pants. The change into a woman brought a dramatic slimming to your waistline, even as your hips widened enough to hold up your baggy pants.<br>\r\n<br>\r\nBaggy is an understatement now as you look down at the tents your legs have somehow become entangled in, struggling to escape for a moment. The pants seem less yielding than your legs though, because you jump trying to escape... and suddenly the air is rushing past you, and you land on your rump, with a painful smack of skin on linoleum. There's nothing for it: you don't even try to resist the tears this time and sob freely. The pitiful squeaks you hear are at least an octave higher than they were before, which only makes you cry louder, as though the volume could somehow hide the reality for you.<br>\r\n<br>\r\nAs before, you are not left to your own devices long. You feel warm, strong hands under both your shoulders, lifting you gently to your feet. The huge T-shirt you're still wearing comes sliding off, and for a moment you're completely naked, crying with eyes closed, far too afraid to look. Then you hear the voice again, Marisa sounding as comfortable and gentle as any person can. \"Put your arms up, dear.\" You obey without question, though the tears haven't stopped. They don't even as you feel thick fabric sliding down your thin body. It feels like a hug as the soft cloth drops down to the level of your ankles. That's when the tears stop, and you open your eyes. Your old clothes are all piled up on the floor around you, your body wrapped tightly in a small version of the robes you saw for sale earlier, the cloth dancing gently around your ankles. \"Well?\" Marisa asks, watching your face with obvious concern. \"Is that better? I'm sorry that's all I have that will fit you... but if it makes you feel any better, they're the robes I wore as an apprentice. All sorts of little charms in there from when I was your age...\"<br>\r\n<br>\r\n\"But... I'm not supposed to be this young!\" You finally manage to squeak, wiping the tears from your face with the back of one black sleeve.<br>\r\n<br>\r\n\"I hadn't planned on it either, David,\" she answers, handing you a pair of matching black slippers which you find yourself pulling onto your feet, sitting down on the ground as you do it. \"But you weren't responding well. Not really a surprise from a non like you, nothing to be ashamed of. But... eleven is the youngest an apprentice is allowed to be. I really think being able to start over will help you. I wish I could say you hadn't hit puberty yet, but... from this side, by the time you've my age being a woman should be the most natural thing in the world to you.\"<br>\r\n<br>\r\nYou want to argue, but somehow the words all choke together in your head, and all that escapes your lips is a frightened squeak. Marisa takes you by the shoulder and marches you from the room, and for some reason your legs move in order, and you walk, stopping only when Marisa does, in front of a shelf heavy laden with cages and tanks. Every pet animal you've ever seen is arranged here, along with many more that you are pretty sure aren't legal to own. The cages tower over you at your new height, though the arm around your shoulder is enough to keep you from panicking for now. \"I know just how to cheer up my little apprentice... her first familiar. Go ahead and pick one... but choose carefully. Familiars change us as much as we change them.\"<br>\r\n<br>\r\nStomach tying itself in knots, you look up at Marisa one last time before your eyes find the cages and you...</span></div></div>",
            "created":1330146000,
            "id":1283944,
            "title":"My Little Apprentice"
        },
        "124":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "The Japanese cottage.",
                "A different castle that's covered in vines, with a large garden in front.",
                "A building that looks more like a small factory than a house."
            ],
            "content":"<div class=\"\"><div> <span>You aren't terribly sure how you ended up over here. Weren't you applying for a job so that you could be more self-sufficient? Now... somehow... you're a little ginger apprentice to a witch you had thought was pretty attractive until not long ago. You still do, but in looking at her, you can't really remember /why/ you think she's hot. Something to do with... the color of her hair? No, that can't be right, you've got red hair too. Could it be... that was it! You remember just how thin and shapely she was, the contrast of her round breasts and thin waist had been what got you this far. \"Don't look at me!\" Marisa abruptly scolds, not seeming to notice /what/ you were looking at, as she tilts your head gently back to face the cages. \"We've got to get home eventually. I don't want you to rush, but I do want you to /do/ something. You won't find the answer on my blouse!\"<br>\r\n<br>\r\nThe pressure brings your wandering, terrified mind careening back to Earth, landing with an awful crash in your head. Your eyes wander the cages, and again they settle on that pair of huge blue eyes and the brown-furred-face behind it. \"That's Tommy,\" Marisa offered helpfully from beside you, bending down to her knees and reaching towards the cage. The ferret inside bolts backward, curling up and shivering in a corner. \"He was a real troublemaker. One of those nerds, I guess you'd call him. He somehow figured out to look for magic here. We let him poke around until he found something... then I had no choice. He could make a good familiar... Would you like to hold him? He doesn't bite...\"<br>\r\n<br>\r\nYou think on that a moment, nodding before the connections fully meet up in your head, and you realize what she said. This ferret... and probably all the other animals here... used to be /human/?! You want to protest, to argue that actually you don't need a familiar and actually you'd rather she take you to your parents... but all that comes out of your mouth is another frightened squeak. She just gives you a pat, before lifting the ferret gently into the air by the scruff. You put out your hands without meaning to, and catch the shivering mammal. You both visibly relax at once, as though mere physical contact had settled your emotions. The ferret stops shivering and uncurls, standing up against your chest so it can get a good look at your face. You look back, into big /human/ eyes, blue and expressive.<br>\r\n<br>\r\n\"Hi,\" the ferret squeaks. \"I'm Tommy.\" You don't realize it, but the ferret is getting smaller in your arms. Not a lot, but enough you subconsciously raise your arms so it stays in the same place relative to your face. You do notice the light tingling on your skin, which deepens a little as you... \"Eeeep!\" Your body shoots up four whole inches, though you don't gain a pound. Still, when you look down, you find the robes suddenly hang several inches too high.<br>\r\n<br>\r\n\"Really?\" Marisa speaks up from beside you, sounding equal parts shocked and annoyed. \"That's... No way you bonded with him that fast. Even Terah and I didn't... Arms up, David. Set the ferret down; I don't think he'll go anywhere.\" You obey both commands without thinking, and she's right. The animal waits patiently by your ankles as Marisa lifts your robe back off, then turns you a little to face a changing room off to one side, marching you in. There's a full-body mirror waiting for you, and in it, you can see you're the same girl, only... stretched a little. You look way thin, as thin as a little girl can be and still look healthy. You still look like a natural human being, but only barely. Your body's lit up with freckles too, a thousand little splotches concentrated around your eyes and by each hand and foot. The rest of your skin is as bleached-white as it was before, with only a few stray marks.<br>\r\n<br>\r\n\"Sorry!\" The ferret squeaks. He makes a gesture, and you extend one of your now-longer legs towards him without knowing why. He scampers up your body with tiny claws which prick but don't hurt. He climbs up onto your shoulder, resting there as you both look into the mirror. He's a much younger animal than the one you first held, young enough to hold in one hand. His eyes have changed too: they're brown, like yours. \"You just felt so good, so I connected with you! Sorry! I didn't mean to make you grow... but I think you look better this way! More... longer?\" You smile in spite of yourself, patting the little ferret even as Marisa returns with a bigger robe.<br>\r\n<br>\r\n\"You won't be able to wear mine until I find the time to make it bigger,\" she said, glancing once at you. \"But I think this is fine... you two make a good match. Never thought I'd have such a /tall/ sister though. When you're a few years older...\" She helped you get dressed, slipping the robe on over you. It slides down easily and billows about your twig-like body like a dress, no longer conforming to the young curves of your body. But it fits now, too. \"Told you your familiar would change you. You better not end up a troublemaker like him though, David.\" She looked stern. \"A witch has the right to punish her apprentice.\" She smiled then, taking your hand and leading you back into the shop. Then out into the deserted parking lot to her waiting car. \"We're not far from home, don't worry.\" She starts up the vehicle and takes it out onto the road. You sit beside her, feeling small but not as much shorter than she is as you were before. You sit quietly, your legs pressed together nervously. You hate going without underclothes... the robe is rough, and your chest already feels sore from rubbing onto it. To say nothing of how cold your legs feel, and how cold your new-made opening feels. At that thought though, Tommy vanishes into your robes and curls up on your lap. That makes you feel much warmer, and his soft fur is much better than the cloth on your more sensitive parts.<br>\r\n<br>\r\n\"Well, we're here!\" You look up suddenly, at the bizarre street. There are only a few houses, with no connection at all. One looks like a huge medeval castle, another a quaint Japanese cottage, and everything in-between. \"Now... by law, an apprentice that's a minor has to move in and live with with someone else until they turn eighteen.\" She seems somewhat frustrated by this as she mutters, \"Child labor laws,\" before smiling again. \"My family's done all these people a favor... they all owe us, and they'd love to have my ferrety little sister live with them. They're all pretty eccentric, but... very nice. They'll all treat you different, but... you'll still be my apprentice. Pick a house! I'll take you in to meet your new family. Just... not the castle. That's where I live.\"<br>\r\n<br>\r\nYou ponder on that a moment, looking at all the different homes on the street, each one from a different part of the world. Eventually you reach up and timidly gesture towards...</span></div></div>",
            "created":1331010000,
            "id":1290075,
            "title":"Tommy"
        },
        "1243":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Agree to live with her. You don't want to risk it with someone else.",
                "Refuse. After what she's done to you so far, you'd rather not live with her.",
                "Suddenly break down, getting out of the car and running as far as you can."
            ],
            "content":"<div class=\"\"><div> <span>You subconsciously unbuckle your seatbelt, climbing to sit on your knees on the seat, which gives you a considerable height boost. Not quite hight enough to be at your old size, but close. There's a squeak as you move, and Tommy scampers back up your torso to rest on your shoulder. You know it should probably bother you this animal that used to be human (and still is a /boy/) is climbing all over your body, but it doesn't, and you don't let the thought linger long. \"That one looks cool.\" You gesture to a building that looks more like a factory than a house, complete with towering smokestacks belching multicolored smoke. You saw those, and your first thought was that they looked tall, like you. \"Who lives there?\"<br>\r\n<br>\r\nMarisa seems somewhat skeptical of that particular dwelling, though. \"I... I'm not so sure about Dr. Dalihman. He's indebted enough he would probably take you, but... his daughters are /really/ smart. They'd probably play with you in a way you wouldn't like. She frowned a little deeper, then cleared her throat. \"Alright. Let's hope nobody fromt he child labor department is listening... and you look enough like a sister that maybe that's just what you can be!\" She smiled. \"What do you think, David? Wanna risk the law and just live with me? You won't have any siblings, but I promise you'd prefer that to Dr. Dalihman's twins.\"<br>\r\n<br>\r\nYou consider that a moment before looking over to Marisa and...</span></div></div>",
            "created":1331874000,
            "id":1295828,
            "title":"Er... Wait... On Second Thought..."
        },
        "12431":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Stay here and talk with Tommy while you take stock of your situation.",
                "Go and explore the castle."
            ],
            "content":"<div class=\"\"><div> <span>You nod without hesitating. Marisa might have ruined your life with a transformation, making it impossible for you to ever be David again. At the same time, though, she seemed as shocked as you were and did everything she could to help. Making you younger... you had not wanted, but now you can't even remember /why/ you didn't want it. You feel much calmer now than you were before. All those classes and friends and appointments you had as David still bother you if you think about them, but seem to fade away when you don't. It's much more fun to think of the castle and living with the woman that feels far more like a sister than anything else.<br>\r\n<br>\r\nShe smiles at your reaction, patting you gently on the head with one hand before pulling across the drawbridge of the smaller castle, raising it behind her with a click of the garage door opener on the roof of the car. You're in a daze as you're led inside, past an entirely period medieval great hall with an absurd-looking kitchen of modern appliances set up at the far end. Up a huge spiral staircase you go, past a long hallway filled with portraits of Marisa's relatives. She has a story for every one... and almost all of them seem to be women. You wonder who all the fathers are and why they aren't pictured here, but... you're much too nervous to ask. Near the end of the hall is Marisa's portrait, which like all the others is a tasteful artistic nude. In her case, she's leaning sideways against an apple tree, with a big black cat in the foreground between you and her thighs. Her breasts are exposed, but you almost don't notice. It's only the similarities in color between her nipples and the apples hanging next to them that attracts your eyes. Then you remember you're looking at her /naked/, and you blush, your knees buckling together to try and... you're not sure really. You don't get to be flustered for long, because it seems you've got a portrait here already. How you could you have no idea, but there you are on the swing you saw outside, grinning energetically as you zoom upward. You whimper at how much of you is exposed: way more than Marisa.<br>\r\n<br>\r\n\"It's no fair! I'm not really your sister!\" You protest, looking away from the little round painting and up at your guardian, though not far. \"It's not okay to have everyone naked like this! It's... It's... weird!\"<br>\r\n<br>\r\n\"It's an old family tradition,\" Marisa explained, as though that settled the issue. \"And if you're not my sister, I dunno who is. You look just like me... you've got a spark of /my/ magic in you. That means we're related far more than blood ever could if you ask me.\" She hurries you on past the end of the hallway, through a huge set of double doors. It's a royal bedroom of exquisite luxury, though modern objects are juxtaposed at random. The solar is filled with college-looking textbooks and a laptop, there's a plasma TV mounted about the fireplace... but you don't stay. There are stairs in here, and up them you're led to a hallway of smaller bedrooms.<br>\r\n<br>\r\n\"For the ladies-in-waiting,\" explained Marisa as she opens one of the doors. It looks... like the room of a modern tweenage girl, pink and yellow in great abundance. The bed's covered in various plushies, the walls in posters of Justin Bieber and the like. There's a shelf and a desk too, stocked with old-looking books and other supplies, which look musty and boring compared to the rest of the room.\" This will be your room while you're under eighteen. Once you're an adult, you /could/ move out... but you don't have to pay rent with me, so I bet you won't.\" Marisa leads you to a dresser, opening it and pulling out a soft green nightgown. She holds it to her face for a moment, grinning. \"This used to be mine too, when I was your age. It'll be a little high on you, but... that doesn't really matter with a nightgown. And here...\" Another drawer, and she draws out a soft green pair of panties and a training bra clearly meant for girls your age without anything to actually support. \"Do you want my help getting read for bed? There's an awful lot of magic in here... I could show you some of it!\"<br>\r\n<br>\r\nBefore you realize what you're doing, your familiar climbs the rest of the way onto your head and squeaks to Marisa. The strangest thing is that the ferret talks in your voice, not his, and you find yourself agreeing with him... you... right away. \"We want time to recover please! We can put ourselves to bed...\"<br>\r\n<br>\r\nMarisa frowned, then shrugged. \"Alright, David.\" She hugs you one last time. \"Don't stay up too late! It's your first day as my apprentice... running a magic shop is hard work! Don't think you won't have to help just because you're little!\" Then she departs, and the door clicks closed behind her. You're left alone then, except for the soft brown eyes of your familiar, who jumps down onto the bed atop the panties to look up at you expectantly. At last you're on your own. You have this whole room to explore, maybe even the whole castle. Of course, that's not the only thing you could do. After a moment of consideration, you decide to...</span></div></div>",
            "created":1331874000,
            "id":1295841,
            "title":"Mi Castle es Tu Castle"
        },
        "124311":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Turn part-way into a ferret like Tommy.",
                "Are compelled to go to sleep, where you have very strange dreams."
            ],
            "content":"<div class=\"\"><div> <span>You sit down gently beside the clothes that Marisa laid out for you, sighing. Tommy looks up with a smile, rising to his hind-paws in the way that small animals sometimes do. You can't help but relax in his company, even though your clothes feel rough and uncomfortable on your body. Seeming to hear that thought, the ferret squeaks, \"Take 'em off then!\" He gestures to the clothes he's standing on. \"These feel soft! You know when you hurt, /I/ feel it too, right?\"<br>\r\n<br>\r\nOf course, you don't want to do that. Take off your clothes? You're naked under there, and if you're not dressed, you'll be forced to see exactly what you really look like. See how gone your old life really is. Of course you can't deny how painful wearing just the robe is becoming; it's not like you can stop yourself from being a girl just by not looking. You stand back up, squirming out of the huge cloak and letting it fall to your bare ankles. You look down compulsively, hoping against hope that your old body will have returned. It hasn't. You're thin, with pasty pale skin splotched with freckles. You're too young to be mature, your hips still thing, though your breasts are a little bigger than flat. You move one hand down your side, feeling the strange body, getting to know what you look like. You feel your thin legs, then back up to where the come together -- and open again. You know what a mature vagina feels like, but you've never felt one like this before, or one that caused strange feelings to jolt up your body at the touch of your own fingers. What sort of feelings /are/ those? You know you should know, but... Somehow your memories of being naked with Lauren just don't make sense to you anymore. What were you /thinking/?<br>\r\n<br>\r\nDeciding not to dwell on the bizarre memory of what you did with your girlfriend, you reach out and pull the panties on without thinking. The soft fabric is much kinder on your skin than the cloak was, that's for sure. The bra you leave, not quite comfortable wearing something like that yet. You lift up the semitransparent nightgown, holding it in front of you for a long time before doing anything. \"It's just cloth!\" Squeaks a little ferret-voice from beside you, and you stick your tongue out without realizing why. You lift the gown over your arms and let it slide down your body. It feels like smoke as it slides down your thin frame, feeling wonderful on skin, stopping just above your knees. Not that you notice at the time... because to your horror, you feel a strange sensation flowing from the cloth into your body! Anger at Marisa floods your mind, but that doesn't help you. Before you can react, the magic of the nightgown has taken effect, and you...</span></div></div>",
            "created":1333083600,
            "id":1305655,
            "title":"Changing Clothes"
        },
        "1243111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Run out and find Marisa to get her to change you back.",
                "Investigate all the really neat things in the room, especially the shiny stuff."
            ],
            "content":"<div class=\"\"><div> <span>You feel a strange rush of wind blow up your dress, spreading it wide for a few seconds and lifting it like a tent. Then it passes, and you look down at yourself. At first you think that perhaps you overreacted and there was nothing wrong after all. You think so, until you feel the way the back of your nightgown is forced up by your tail, and the way it moves as you twist it like any other limb. What's worse is that as you look down, you find this isn't the only change to have come upon you. Your feet look like nothing human, and you're standing on them like digigrade paws, which indeed they are. Dark fur follows them up toward your knees, changing into tan before it fades just below your thighs. A similar thing has happened with your hands you soon discover, which is altogether more frightening considering how much dexterity your fingers have lost. \"I wonder, can we...\" You feel strange then, like a tug as some immaterial connection grabs you by the nose and tugs you abruptly to the ground. You fall onto your hands, subconsciously arching your back and landing exactly like Tommy is no standing. With a grin, the little ferret hops down off the bed and looks at you with a smile. \"David looks like me now, yay!\"<br>\r\n<br>\r\nAs you look into the mirror, you realize he's exactly right; you stand comfortably on four paws, back arched and long body held exactly like the cross of a ferret and a little girl that you are. When you stand up again, your paws come in, held subconsciously to you chest exactly as little Tommy does when he stands up. \"I...\" You begin, squeaking faintly when you realize that in your reflection your face has changed too. You've got whiskers, and your ears ride high in your bright... brown... hair, twitching every now and then or turning to face a sudden noise. It's a strange thing, so strange in fact that for a moment you aren't sure what you'll do next. Then, with mixed emotions, you look down at Tommy and decide to...</span></div></div>",
            "created":1335589200,
            "id":1324193,
            "title":"Getting Closer with Your Familiar"
        },
        "12431111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Go back to Marisa's room. She has to show up sometime.",
                "Head outside. Tommy's right, if Marisa won't help you, maybe someone else will."
            ],
            "content":"<div class=\"\"><div> <span>You are not having this. No, this is the last straw. Being changed into a woman was hard enough. Being made into a little girl was even harder. Having to leave behind all of your old life... but changing into an animal? That was too much. Tears streak from your eyes at the altogether natural reaction to a situation like this. Your new self doesn't feel nearly so bad about the tears - they're part of being human! But whatever is left of David wipes them onto a sleeve, then turns for the door, bolting out into the castle. \"Marisa!\" You squeal, little Tommy at your heels. You pass into her bedroom, catching the stairs at a sprint. But Marisa's bedroom is empty. With a few more tears, your face jumps from door to door until you settle on the one back into the hall. Out into the hall you go, only losing momentum as you pass Marisa's portrait.<br>\r\n<br>\r\nSure enough, there she is, though you're positive that apple didn't have a bite out of it last time you saw it. There's something wicked in that expression, something that says, \"I could help you, but I'm hiding so you can figure things out on your own.\" You take the rest of the hallway at a walk, having to focus to stop yourself from falling onto four paws. \"We should talk to our neighbors!\" Tommy offers helpfully as you end up back in the great hall. You don't answer at first, far too busy examining a shiny silver fork that has caught your attention. You look once around at the vast expanse of the castle, once to the great big main doors, then back to Tommy. There's obviously only one solution here. You...</span></div></div>",
            "created":1338267600,
            "id":1347355,
            "title":"Trying to Find Marisa"
        },
        "124311112":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "The vent seems to be getting bigger.",
                "The smoke enhances the spells cast on you, making you younger and a full ferret."
            ],
            "content":"<div class=\"\"><div> <span>Being cramped up in here is too much - you've got to get out. You don't care if you're a part-animal little girl wearing only a transparent nightgown and a pair of panties! Just now, it's all you can think about to want /desperately/ to talk to somebody who isn't Marisa. Maybe one of her neighbors will take pity on you and help you escape. Of course, it has yet to occur to you simply to take the nightgown /off/, but... you're only a kid! Give yourself a break! You mostly follow your nose to a way out: a huge window with a drop of several stories to the floor below. That would've terrified a little girl, but not a little girl with a tail and four paws with sharp claws. Over the side of the window you go, climbing down the rough stone wall as though you were walking down a hill. Tommy follows, and in almost not time you are on the castle lawn, looking out at all the neighbors' houses. Just as it did the first time, the factory really jumps out at you. If anything, the glinting metal and multicolored smoke is more of an attractor than anything else.<br>\r\n<br>\r\n\"What do you think, Tommy?\" He nods, and you half-run, half-scamper towards it. The driveway vanishes into a huge garage at the base of the factory. There was a fence, but your eyes caught on a ditch in one section of the fence. Tight squeeze for an adult, but not for a little girl, least of all one that was part ferret. You slide easily under and out again into the factory grounds, looking for a door. The only thing close is a huge exhaust belching purple smoke in occasional bursts. You're not sure what that might do, but... you're far too desperate to let that stop you. Up the vent you go, climbing up the smooth metal. There's almost no light, and little Tommy shelters himself against your body. You are not so lucky, however, and before long you realize that...</span></div></div>",
            "created":1340686800,
            "id":1367473,
            "title":"Slipping Out to the Factory"
        },
        "1243111122":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Press forward! Obviously these people have the power to help.",
                "Turn around. That smoke couldn't make things worse, right?"
            ],
            "content":"<div class=\"\"><div> <span>As you're scampering down the tunnel, you pass through a fork in the pipe and away from all the funny-colored smoke. Unfortunately, the damage is done. By the time you get there, you realize something is very, very wrong. The first thing you notice is that the feel of the dress around your body is completely gone. Looking yourself over in the gloom, you discover to your horror the only clothes you have left are a soft leather collar in the same shade as the nightgown, along with a little pink bracelet around one of your hindpaws, with the same floral pattern as the panties had. It's only /after/ that that you realize the fur has spread over your whole body, and the only trace of your human appearance that's left is your eyes.<br>\r\n<br>\r\nYou turn to Tommy, who you realize to your utter shock is about twice your size. You look and smell very much alike, and out of instinct you press your side to his. You're an animal! You can't help the instinct to cry. He does his best to soothe you, licking away the tears and waiting patiently for you to recover enough to listen. \"David... maybe we better go back. Marisa's good! She'll fix you! If you want her too... You're still a witch! Witches do magic while they're transformed into animals all the time! Once a witch, always a witch! That's why you had to stay a girl, remember?\"<br>\r\n<br>\r\nTommy might have your best interests at heart, but that idea doesn't even tempt you. You don't want to be a woman... or a girl... or a ferret! But he might be right about turning back. You think about that a moment, then...</span></div></div>",
            "created":1341637200,
            "id":1373381,
            "title":"Tommy's New Sister"
        },
        "12431111221":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Test subject.",
                "Gift."
            ],
            "content":"<div class=\"\"><div> <span>You aren't about to give up that easy! So what if this has only made things worse so far... There's no way everybody with magical talents is going to be as reckless with your body as Marisa has been so far. No way! Once you explain yourself, they'll take pity and... would it be too much to ask to be back to normal? You don't know. But at least to be a boy - any boy - would be better than be a little girl... or worse, a little /ferret/. The fact that you were a girl ferret just didn't seem to matter quite as much when seen in that light. You don't even think about how you know how to make the body work. It just works. \"Let's keep going, Tommy. Those twins will help us, I just know it! Maybe they can make you human again, too! Wouldn't you like that?\"<br>\r\n<br>\r\nTommy looks down at you with an almost parental expression before licking your face affectionately. The gesture would make absolutely no sense if you'd been human, but for a ferret, it was like a gentle pat on the head. It was a \"You're adorable, but you don't make any sense.\" He proceeded to explain, though you were only half-listening by then. \"Witch once is witch forever. Familiar is 'til one of us dies, too. Until I die. And if you die, I'll probably die too. I could be human, but I'd still be your familiar even if I was. Most witches don't like that, but I've seen a few come into the store over the years with human familiars. Usually family born without a spark. Most witches are way too old-fashioned to /give/ power like Marisa did to you. She's waaaay nicer than most.\"<br>\r\n<br>\r\nBeing a young ferret means you lack the attention-span to really have a sustained conversation like this, but Tommy is interesting enough that you stop bouncing up and down as he talks, looking up into his face. \"How do you know all that?\" You ask in a squeak, which you realize at that moment is how you two have been talking. Of course you couldn't speak English! He seems to understand okay.<br>\r\n<br>\r\n\"Because I was human once, duh!\" He explains, as though that was enough. He seems to realize that it isn't after a moment and adds, \"I'm from a magical family... but magic usually skips the boys, and it skipped me. I came to Marisa, she didn't kidnap me or anything. I wanted to be magic like my sisters... and not to wither away to dust before they were college-age. Now I can! Through you...\" He licked you again, pulling you close for another moment.<br>\r\n<br>\r\nYou really don't know how to take that, not for several long moments as you consider the history of your companion. More than that, you think about what it might be like to have a human familiar. You make a mental note to ask Marisa about it in the future. In the meantime, you decide it's time to move on. You're getting really anxious in such a huge, metallic space.<br>\r\n<br>\r\n\"I wanna talk about this more!\" You squeak up at him. \"But not now, kay? I want to be a person again, so I can 'member it all.\" You don't even notice your little verbal slips as you resume your scurrying, managing to make it a good few minutes before you reach a vent in the ceiling. You're leaning over to inspect it when Tommy climbs atop the grate beside you. There's a gut-wrenching crack, and the gate swings down, sending the both of you tumbling down. You scream pitifully as you tumble through the air, and you are helpless to identify up or down as you fall down, down, down...<br>\r\n<br>\r\nYou land with a splash, and gulp down several mouthfuls of soapy water instead of air. You might've choked, except that a pair of huge hands wraps abruptly around you. You're too scared to try to react, and your coughs take in as much water as they put out... until the hands lift you gently to her chest, resting your head over her shoulder and patting your back several times. You feel bare, wet skin, but you don't care, closing your eyes and whimpering. You're crying in sheer terror, though your body doesn't seem to be able to cry for real. It's a long time before you are coherent enough to hear what the girl that's holding you is saying. \"I've got the little witch, I'm sure of it! See her collar... it's a spell.\" Your eyes open slowly, and you look up into her face. She looks about... twelve, her skin scary pale, and her hair bright black, cascading down her back, though most of it is stuck to her. She holds you with a hand under each of your shoulders.<br>\r\n<br>\r\n\"Okay, so what?\" Asks an identical voice from behind you... You can feel her holding you too. Tommy's in her hands, held the exact same way, though he is squirming to try and escape in a way you have no energy to attempt.<br>\r\n<br>\r\nThe girl holding you hesitates for a moment, then replies you would make a great...</span></div></div>",
            "created":1341637200,
            "id":1373428,
            "title":"A Sudden Bath with the Twins"
        },
        "124311112211":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "You turn into a stuffed animal.",
                "You pass out."
            ],
            "content":"<div class=\"\"><div> <span>\"Just look at her.\" She turns you around in the air so her companion can look you all over. \"She's got more magic than anyone we've played with in awhile. Imagine all the fun we could have with someone with so much power. Their body could do all sorts of things that would kill someone weaker.\" There was a smile from the girl on the other end of the bath, a smile that makes your heart drop right out of your body.<br>\r\n<br>\r\n\"Please...\" You squeak faintly, somehow knowing that they will be able to understand you. \"I just want to be human again... I did something wrong... now I'm a ferret. I'm supposed to be a girl! Er... a human! I'm supposed to be a human! Can't you use your powers to change me back?\"<br>\r\n<br>\r\nThe girl holding you nods. \"We will. When we've played. We play with all our new neighbors. I take it you're Marisa's new apprentice?\" You nod, and try to speak again, but she cuts you off. \"Nope! No more of that. Play with us, or we won't change you back.\" That shuts you up. Although the fact that you don't have any choice in the matter probably has a great deal more to do with it than your desire fo them to help you. You're now thankful Marisa took you in instead of sending you to live here. You weren't sure what being a \"test subject\" involved, but you were pretty confident it was something you didn't want to do.<br>\r\n<br>\r\n\"I'll send her familiar home. We don't need him.\" Her sister agreed, and murmured something. Tommy vanished in flash. You felt your gut wretch for a moment... then relax. Whatever happened to him, he was okay. Just gone. Instinct is telling you to squirm and escape, to try and run, but your will is strong enough to resist that temptation. You have no desire to find out what they might do to you if you made them unhappy.<br>\r\n<br>\r\nBoth girls climb from the water and take turns holding you as the other dries off and climbs into colorful pink, innocent pajamas. The way the first girl holds you is almost loving as they walk you out of the room with the bathtub and along a long hallway with industrial placards and warning signs all over the walls. You try not to notice the fact you can't read them anymore, even though they're clearly printed in English. They reach a door with some pink lettering on it and step inside with you. You inhale in wonder and awe as you see all the testtubes, the bubbling little Bunsen burners and tanks of chemicals. And then right beside it all, two little beds, totally normal. It's a strange thing... but then, everything about these magic users is strange and has been since the moment you stumbled into this impossible life. \"Do you think she will still be able to move if we make her something inanimate?\" One sister asks, startling you from your thoughts.<br>\r\n<br>\r\n\"I dunno,\" the other girl replies with a shrug. \"But she should probably stay alive either way.\" Probably? That was it! You start squirming violently in the girl's arms, so violently that for one glorious moment, you almost escape. You do escape her arms, leaping onto the counter and knocking over a little rack of testtubes. Unfortunately, they spill all over you, causing a harsh stinging-sensation and your body to go instantly limp as...</span></div></div>",
            "created":1342846800,
            "id":1384835,
            "title":"Subjective"
        },
        "1243111122111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A nice hot shower.",
                "The car."
            ],
            "content":"<div class=\"\"><div> <span>It's an almost indescribable feeling as the numbness spreads throughout your body, flowing from the splotches where you touched the strange substance. It doesn't hurt; as a matter of fact, you aren't sure you are capable of feeling pain anymore. As the sensation flows, your whole body goes rigid, then starts to deflate. All your insides - your organs and blood and all of that - feels like water, draining away with a cool sensation, and leaving you flat for a moment. Until you fill up again, your empty body stuffed with cotton. Puffed back up, you stand on your feet on the counter, looking out though plastic eyes at the two standing over you. No, looking isn't the right word, because you can see in all directions. But... you can only see the girls, really. Their shapes are all you can make out. It's the most bizarre sensation, because you can't really see their clothes, but you can see them... does being inanimate mean you can only see living things? You try to scream, to move, to jump, anything! But... you can't. All you can do is stand their stupidly and smile as one of them reach down and picks you up. You’re helpless as they talk, passing you back and forth and talking. Time is a blur to you like this... suddenly it's light outside, and you're on a shelf, watching life go by as the girls and others pass you with whatever it is they're doing. You try to call out to them, but nothing happens. One day is exactly as the next, and you can't even count exactly how many go by. You want to protest, you do! To insist they change you back as they promised, but rarely do they even so much as look at you again. It feels like only days have passed, but you have seen light and dark so many times you tell yourself it must be much more than that.<br>\r\n<br>\r\nThis is your life - for how long you can't tell; standing on the shelf and watching the world go by. But it does not persist forever. One night you're alone, as always, drifting into that trancelike state you are always in when there aren't any people around, and there is nothing at all in the world but you. You feel something grab hold of you with sharp teeth, which you can only tell are sharp with your sight because you can't really feel them. The shape is familiar, as it's very much like you- It's Tommy! You recognize that shape anywhere, and not just because he looks so much like you. Tommy says something you can't understand, then pushes you down off the edge of the shelf onto the floor, where you bounce a few times and skid to a halt. A few moments later he's there with you, dragging you along by his teeth. You must be getting filthy, but you don‘t care. After all this time, somebody came for you! You had half-expected somebody would find you eventually. Didn't Marisa want her apprentice back?<br>\r\n<br>\r\nTommy darts through the halls, seeming to know where he's going, until he arrives at a couch. It's a challenge for him to lift you up onto it towards the open window, but he manages, holding you in his teeth and darting up by aid of his claws. Then out into the night you go, flung into the dark. The fall doesn't bother you, or the dirty landing in the garden- Tommy knows what he's doing, and you trust him to get you out. He grabs onto you again a few seconds later, and drags you somewhere through the night- it's impossible for you to tell where. But soon enough you get there, and it goes from dark to light again. For the first time in as long as you can remember, you start to feel cold. A numb, pins-and-needles feeling starts in your paws, and spreads throughout your body as the world seems to shrink around you. Until, with a cough and a splutter, you spit out a mouthful of cotton, and you can breathe again. You're wearing that same green dress you were all that time ago, and your tail and ears have remained like Tommy's, along with your feet, but otherwise you're human again, soaking wetland filthy. You feel a pair of big arms embrace you, and you take hold without thinking, crying into Marisa's warm, dry form. \"David... you're safe now. Don't worry... the twins won't get you again.\"<br>\r\n<br>\r\nYou don‘t resist as Marisa stands, and lifts you up with her. It's not difficult for her - you weren't a big girl /before/ wearing the dress, and with it you're practically skin and bones, tall and stretched in ways humans usually aren't. But with one eye open, you can see Marisa is taking you to...</span></div></div>",
            "created":1343970000,
            "id":1396725,
            "title":"Forgotten Toy"
        },
        "12431111221111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Nodding. How could you say no after he saved you?",
                "Shaking your head. Your life is complicated enough as it is."
            ],
            "content":"<div class=\"\"><div> <span>You don't resist as you're carried down the hall and into a room where you can already hear hot water falling. With Tommy close by again, you can feel his movements as though they were your own, and he stays close, hopping and bouncing and running between Marisa's legs to stay close. His emotions are open to you too, and above all else he has no intention of letting you out of his sight again. He's too afraid, too possessive. He's had a very hard time without you, but his little heart is beating so fast with excitement at having located you at last that you begin to fear for /his/ health. When you reach the shower, Marisa sets you down, and you sway a little on your legs. \"Arms up.\" As the dress comes off, you feel your body settle down into its normal shape. Bones settle with a cracking sound as you become your usual height, bare toes replacing black-furred paws. You take care of the rest, and she moves a little hamper beside you for the wet clothes. She gestures to the shower. \"Get in. We can talk once you've had a good wash and a good night's sleep.\"<br>\r\n<br>\r\nThere's no argument from you, and you climb in, Tommy sliding in behind you right as Marisa closes the glass door. You‘re too weak to go very far, and you collapse onto your rump in the hot water. Tommy rushes over to comfort you, and you hold him to your chest like, well... you‘d rather not think about it. \"I looked all over for you, David! But that stupid factory changes insides all the time! I had to wait until the room you were in existed again! And Marisa tried talking to the guy who lives there, but his daughters lied about you being there, and he supported them, so she couldn't come in to look. But I found you!\" He sounded proud, and you had no reason to put an end to that. He deserved to be proud about saving you.<br>\r\n<br>\r\n\"Thanks, Tommy.\" You say, rubbing his head with your hand. His snakelike body goes limp in your arms as you do that, and that makes you smile faintly. It‘s so wonderful to be alive again. To be able to move again. \"I owe you big time.\"<br>\r\n<br>\r\nTommy's ears perk up, and he looks up at you with a grin. \"Do you... owe me enough to let me be human some of the time?\" He grins mischievously. \"I've been thinking about that conversation we had since you were gone. If I was a person... I could really make things easier on you. We could split the work Marisa has for you at her shop, for instance. Marisa said it's up to you - but she's got this collar I could wear that would make me human whenever I put it on.\"<br>\r\n<br>\r\nYou think about Tommy's request as you sit under the hot water, enjoying the feelings assaulting your body. Wonderful, glorious feelings. You don't even care about being a girl, not right now. Granted you don't really know how to process hot water seeping gently inside you through a place you've never felt before but that's hardly your first concern after what you've just felt. You consider Tommy's request before...</span></div></div>",
            "created":1344056400,
            "id":1397587,
            "title":"Recovering"
        },
        "124311112211111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Looking through Tommy's eyes as he explores.",
                "Sitting in a field next to a little girl who looks a lot like you."
            ],
            "content":"<div class=\"\"><div> <span>You nod without a second thought. After all that Tommy has done for you, how could you possibly tell him no? After being a stuffed animal for as long as you were, you would have felt awful to take some of his freedom away. Or to deny him of some freedom he might have, as the case might be. Besides, he makes a very good point. If he was human too, he could take care of some of your work so that you could have more time to relax! \"Of course, Tommy. After rescuing me, you can have whatever you want. I‘ll ask Marisa tonight.\"<br>\r\n<br>\r\nTommy squirms and squeaks and bounces up and down in excitement. You sit motionless as Tommy exhausts his energy running about the shower, climbing up and down and over and around you, waiting until he collapses panting into your lap. You scoop him back up, holding him again, and closing your eyes. You wish you could just go to sleep now - after however long you've gone without being able to sleep. \"Tommy, how long have I been gone? I know that aging doesn't work the same for me anymore, so I‘m not worried about that, but... Please tell me it hasn't been too long.\"<br>\r\n<br>\r\nThe ferret looks up at you with a frown, averting his eyes. \"Well...\" He clearly did not want to answer. But with your persistence, he is unable to deny you. \"Maybe... about six months?\" He props his forepaws up on your chest. \"Don't worry, David! Marisa hasn't replaced you! She never gave up on you - cuz I was still alive! She really cares about you - you're her little sister after all!\" At that exact moment, you hear her voice from outside.<br>\r\n<br>\r\n\"David, are you okay in there? We've got to get you to bed - your first day at work is tomorrow!\" You slowly get to your feet, making an effort with the soap for a few moments before turning off the water and making your way to the door. The instant you open it, you're practically swallowed in a massive towel, which covers you on all sides in sweet, glorious warmth. The towel moves quickly around you as Marisa dries you off. Six months ago you might have got defensive about it and insisted on taking care of yourself, but just now you don't care. In moments you're dry, and Marisa helps you climb into thick, warm pajamas. \"There we are, David. After what you've been through, I think you need to sleep with me. We need time to catch up. Is that okay?\"<br>\r\n<br>\r\nYou stay quiet, nodding timidly and keeping your eyes on the floor. You don't want to admit it, but your experience, however brief it /felt/ has left some deep impacts on you. More than anything else, you do NOT want to be alone. When you're alone, you stop mattering! Objects don't matter when nobody is around to see you! That's why the time seemed to pass so fast! You were just a dust-collector for the longest time. Nobody ever played with you, or made you feel loved, or anything. Without meaning to, you reach up and take Marisa's hand tightly in yours.<br>\r\n<br>\r\nMarisa glances down at you, looking at your expression, before stopping. She drops to her knees, and at that moment you realize you've somehow already walked into her bedroom and were standing beside the massive four-poster bed. She lifts you below each arm, setting you down on the side of the bed. \"There we go, David. Nice and safe. I know you've... had a hard time. You need a good night's sleep. Inanimate memories like those will fade, I promise. You've had a hard time, but it will get easier.\" You nod feebly, laying down against. the huge pile of pillows. Marisa turns out the light and gets in with you, sliding the covers over you both. The warmth and heat of her presence is perhaps the most wonderful thing you have felt all day, quickly settling you down to rest. You vaguely remember wrapping your arms around her body, clinging tightly to her - then you‘re unconscious.<br>\r\n<br>\r\nThe next thing you know, you‘re sitting up, bright light streaming down around you. Only you‘re not on a bed anymore! Everything has changed all around you! As your eyes adjust to the light, you realize you are...</span></div></div>",
            "created":1344056400,
            "id":1397608,
            "title":"A Promise and Some Rest"
        },
        "1243111122112":{
            "author_id":"hilt200",
            "author_name":"Chaos Theory",
            "choices":[
                "piece of clothing",
                "a Doll "
            ],
            "content":"<div class=\"\"><div> <span>A heavy fog clouds your mind making you stumble for moment before you collapse passing out.<br>\r\nWhen you come to, you can hear the twins bickering but I even when you shake of the last of the sleep<br>\r\nfrom your mind you can't make out what they are arguing about. You need to get away before the twins<br>\r\nnotice your awake. You try to get up and escape but can't move your body it would respond to your mental <br>\r\nscreams to move and your heart drops as the faces of the twins enter your field of vision, something is wrong<br>\r\nthey seem much larger than before.<br>\r\n<br>\r\nOne of them reached down plucking you up, as you are lifted up you catch a glimpse of yourself and are shocked to<br>\r\nsee a__________,<br>\r\n<br>\r\n\"There is only one of her so lets take turns playing with and experimenting on her\" one of twin says and you see the other nod.</span></div></div>",
            "created":1369075380,
            "id":1593656,
            "title":"You pass out."
        },
        "1243112":{
            "author_id":"griffemon",
            "author_name":"Griffemon",
            "choices":[
                "When you wake up all memories of your life before your transformation disappear",
                "When you wake up you realize Marisa must have done something to you."
            ],
            "content":"<div class=\"\"><div> <span>Begin to feel very drowsy. You realize that the nightgown must be a type of magic sleeping aid or something. So you just lie down on your bed and fall asleep. But then you begin to have very strange dreams. You have dreams in which you were born as Marisa's sister and not as David. The dream takes you through an entire life in which you were born and raised a witch. The dream ended with you falling asleep.<br>\r\n</span></div></div>",
            "created":1358671980,
            "id":1512104,
            "title":"Are compelled to go to sleep, where you have ve..."
        },
        "12431122":{
            "author_id":"griffemon",
            "author_name":"Griffemon",
            "choices":[
                "\"nothing sis, why would I do anything to you?\"  (reality change)",
                "\"I thought it would be easier for you to adapt if you knew how to act\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When you see her you ask \"what did you do to me with that nightgown?\" and she answers....</span></div></span></div>",
            "created":1358672280,
            "id":1512107,
            "title":"When you wake up you realize Marisa must have d..."
        },
        "13":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Try to sleep and hope it's all a dream.",
                "Use your flexible body to climb out of the jar and escape.",
                "Notice a pair of animal eyes staring at you from the darkness.",
                "Hear a quiet voice behind you.",
                "Discover that this jar isn't completely clean."
            ],
            "content":"<div class=\"\"><div> <span>You don't know what comes over you. After all, you've never really been an angry person before. Could it be something to do with being a redhead? You'd heard stories from some of your more sexually-active friends about the fiery-temperament of those with fiery hair. You never really believed them, but now... it's impossible to quell the feeling of rage that builds up inside you, surging like a fire as you look up at that face that yours now looks so much like. She's ruined your life... forever! You heard her... you're going to be a stupid girl as long as you live! You sure do feel the part, every bit as real as your initial feel suggested. This anger combines with panic and you do the only thing than an angry body wants to do: you attack her. Reaching over onto the desk, you lift the lamp free, and swing it with all the force you can muster at the witch. The glass shade shatters against her head, sending her stumbling backward, knocking over the computer monitor which explodes with a shower of sparks.<br>\r\n<br>\r\nMarisa swears loudly, rolling over as you pull your arm back for a second swing. Then she meets your eyes, livid with anger of her own, and says another few words in that same unintelligible language. The effect on you is immediate. The lamp falls from your hands even as you feel wind rushing past you, blowing your hair around your face and causing a brief but disturbing chill between your legs. It does not last though, and soon you are thoroughly trapped in the dark. A second later you hear an ear-splitting crash from beside you as something huge hits the floor, shaking the very earth beneath you with its awesome bulk. The shock is enough to knock you from your feet, just as a veritable ocean of cloth comes cascading down atop you, and you realize to your horror you're suddenly naked. What has the witch done this time? You struggle and squirm in the dark for what feels like several good minutes, still too angry to be truly rational and think of what the witch might have actually done to you. It seems you've just begun to struggle towards some faint source of light when the whole thing shakes around you again, with a horrifyingly loud sound of rustling cloth.<br>\r\n<br>\r\nIf that sound was horrible, then it seemed for you the horrors had only just begun. You feel something take hold of you, something monstrous. The thing is soft and yielding and warm, but huge, wrapping several long organs around the width of your body and tugging you forcefully from the pile of something, squeezing you so forcefully you find the breath crushed from your lungs. What you see next only deepens your panic, as bright light returns and you are blinded for a fraction of a second, air rushing past you anew and your head swimming from how fast you are moved through the air. When your eyes finally clear, you're looking down at a huge, pale thumb, which is pressed forcefully to your abdomen, attached to the arm of an extremely pissed-off looking Marisa. This is a Marisa of absolute cosmic scales though, and at once all your anger melts away to fear. The huge hand wrapped around your legs holds you so firm your newly-made vagina is screaming in silent agony at being so harshly compressed, to say nothing of your middle. In an instant, Marisa brings you zooming to her face, holding you only what seems a few feet away from an eye almost as big as your head, bright green and angry. \"I spent so much fucking energy on you, David,\" she spat, and indeed hot saliva did fly in little gobs, coating your bare chest. Under the circumstances though that was hardly your first concern. \"Why the hell did you have to attack me?\" She does not give you the time to answer. \"I wish I didn't need an apprentice so badly. Mother always warned me never to mess with nons. This is where it gets me.\"<br>\r\n<br>\r\nThere was something else in her other hand. The whole world tilts as you're shoved roughly into a cool opening. Actually, a freezing opening. You slide backward on something ice cold and fall for what feels like forever, landing sprawled on your back. What's worse is this chamber does not seem to be large enough for you to stretch out in; your legs have caught on the freezing walls as you fell, so the first thing you see as you open your stunned eyes is the body of a redhead that could've been Marisa's younger sister, shapely body angled upward and legs spread towards the sky.<br>\r\n<br>\r\nAs you collect yourself from the brief fall, you quickly realize how cold this surface is against your unprotected skin, and you hastily struggle to your feet. It's difficult with the size of whatever you're in, but you quickly learn just how flexible this newfound body really is for how easily you can pull those long feminine legs under you and climb into a standing position. Your feet feel ice cold almost at once, but it's loads better than your whole body being cold. Thus recovered from your fall, you find yourself looking and feeling around. You're standing in something glass and round, about three feet in diameter from your perspective and twice your height. You can walk a few steps, but that's it... you can't lay down or relax. The room is made of transparent glass thicker than any you've ever seen. It's only as you see fingers on the outside of the glass you realize where you are: Marisa is holding you in a jar.<br>\r\n<br>\r\n\"I think you need some time to cool off,\" you hear her voice say as she sets you down on her desk. \"We'll talk in the morning, once you spend one cold night here thinking about your future.\" You call out to protest, but she doesn't seem to hear, turning to leave the office without a backward glance. There's a soft flick and you're plunged into almost total darkness as the light clicks off. Well, except for something square with orange light coming through it, seemingly miles away. A window? You wait in silence to be sure she won't be coming back. It's only when it feels like an hour's past, when you're finally adjusted to the dim moonlight and you're sure she isn't coming back that you...</span></div></div>",
            "created":1330146000,
            "id":1283945,
            "title":"A Little Retribution"
        },
        "133":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Confused",
                "Sympathetic",
                "Upset"
            ],
            "content":"<div class=\"\"><div> <span>It's the most terrifying thing you've ever seen, a glint of bright green from somewhere in the room, which is so far away to your small eyes you can't even focus on it. For a long time you see the eyes watching you, which is scary enough to you. How tall are you... three inches? Here you are, standing naked in a five-inch jar /without/ a lid. You're pretty sure Marisa left you on her desk, but what if those little eyes you see manage to find a way up here? You watch them for what feels like an hour, faint green shimmer just outside of your ability to focus. Eventually the cold of the glass combined with emotional and physical exhaustion gets to you, and you sit down, pulling your knees close to your chest and wrapping your arms around them. It's a comfortable enough position: putting your legs close together does make your stupid slit not feel nearly so cold, and resting on the skin of your legs feels way better on your breasts than being unsupported in empty, cold air.<br>\r\n<br>\r\nThere's a slight bump then, as your whole world jerks just slightly. You stand up, looking around... then you scream. Your vision is filled with a black blur, glinting in the orange glow of streetlight from outside. It was a tomcat, standing well above the height of the jar. Abruptly the opening filled with a huge feline face, the unmistakeable owners of the eyes you had been seeing. The cat sniffed energetically, then licked its lips. Your legs give out from under you and you drop to your knees, whimpering and crying and screaming all at once. Then a huge black paw slide down into the jar, claws retracted. It's a good thing your bladder wasn't full... because you probably would've wet yourself in terror as it tilts the jar over. You land with a thump on glass, bumping your head hard. You're momentarily disoriented, stunned as you're slid out onto the desk, looking up at the dinosaur-sized feline utterly without defense. \"Please!\" You shield your face with your arms. \"Don't hurt me!\" You force yourself to open your eyes, looking up at the cat's face. Amazed, you can see he suddenly looks...</span></div></div>",
            "created":1330923600,
            "id":1289795,
            "title":"Bad Luck"
        },
        "1331":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Tell him the truth about what happened.",
                "Try to convince him that Marisa attacked you unprovoked.",
                "Refuse his help."
            ],
            "content":"<div class=\"\"><div> <span>The cat tilts his head to one side, in obvious feline confusion. He sniffs at you once, pink nose leaning in towards you, filling your vision for several long moments. The muzzle is of terrifying size... but it remains closed, those frighteningly huge teeth shielded from your view. The warm breath from its nose wafts gently down your body, warming you a little. If you weren't so afraid, it might have been a pleasant sensation. But it didn't last, and the cat pulled away. \"You look a lot like her.\" It was a male voice, a voice of elegant English that somehow emerged from a feline mouth. It was a strange thing indeed to see; all the stranger for the body it emerged from. \"Smell exactly like her, too.\" The cat looked up with an inquisitive glance. \"Are you the new apprentice?\" A smile, remarkably human in form. \"A little small to stock shelves, don't you think?\"<br>\r\n<br>\r\nYou frown at that, feeling a little indignant, before looking down and seeing your bare freckly breasts and covering them with both hands. That's a strange sensation in itself... cradling warm sensitive breasts that somehow, unmistakably /belong to you/. \"Marisa shrunk me!\" You insist, your voice high and feminine and utterly unfamiliar to you, but out it comes anyways. You're not sure you could talk loudly enough for someone so far away to hear you, but the car seems to. \"I didn't expect... Magic is not supposed to be real!\"<br>\r\n<br>\r\nThe cat laughed at that, if cats could laugh. It was clearly throughly amused. With a bump that lifted you for a second off the desk, the feline lay down on its belly, head resting on his forepaws in the way cats sometime did. The enormous monster looked almost regal to you, all glistening fur and bright green eyes. \"Are you sure she didn't mean to make you a familiar? Nons... Did you do anything to frighten Marisa? If this is some sort of misunderstanding, I could help you straighten it out.\"<br>\r\n<br>\r\nLooking up at the huge cat, you consider your options, then...</span></div></div>",
            "created":1331874000,
            "id":1295821,
            "title":"A Chat with a Cat"
        },
        "13312":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Turns you into an anthromorphic mouse.",
                "Turns you into an inanimate cat toy."
            ],
            "content":"<div class=\"\"><div> <span>You look up at the huge cat, shivering in the cold, before a strange thought pops into your head and you follow it without really considering the consequences. \"I'm not sure if it was really a misunderstanding,\" you start at first, as though you were going to be honest about it all. Then you continue. \"She just attacked me!\" You exclaim, making a big, exaggerated gesture with your arms to show just how much of a shock it was to you. You're pretty sure you do a good job, because it seems from the cat's reply that he's been convinced. Of course, you can't really tell for sure; you're no expert at reading feline emotions.<br>\r\n<br>\r\n\"Marisa attacked you... without you doing anything first to provoke her? Interesting, very interesting...\" He grins then, leaning close so you can see his huge teeth. You're a little taken aback by this, leaning away subconsciously. \"Did I... no, I don't believe I did. I'm so sorry for being so rude. My name is Terah; I am Marisa's familiar. I know you're a non... or you were, so I don't expect you to know this. But I see all that Marisa sees and feel all that she feels.\" He narrows his eyes then, an unmistakably human expression. \"You hurt us. You think I wouldn't feel that?\"<br>\r\n<br>\r\nUh oh. Your heart is pounding now as you look up at the huge feline, realizing without doubt you are utterly in his power. Lying to him was probably not a good idea. Of course, now it's too late. You're almost too afraid to formulate a response. Before you can, though, the cat goes on. \"Another thing you probably don't know about familiars: we can use our master's magic if they let us. Clearly being small wasn't punishment enough.\"<br>\r\n<br>\r\nYou want to protest, but the cat is far too fast. He stands back up, fixes his eyes on you, and...</span></div></div>",
            "created":1333083600,
            "id":1305679,
            "title":"Little White Lie"
        },
        "133121":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A young ferret wandering the store.",
                "What smells like food coming from a nearby hole in the wall."
            ],
            "content":"<div class=\"\"><div> <span>You feel heat spread across your body from your head down, as though you had just been splashed with hot water. It burns, but not much. The heat brings up a strange sensation from within, like hair sprouting all over your body. As you look down, that is exactly what happens. Hair springs up, a short white fuzz whose only thin patch is square between your legs. That's not the worst of it either. With a sensation like being pulled, your skin right about your butt falls gently down, lengthening into a long tail whose tip drags on the ground behind you, twitching gently along with your thoughts. Your face burns too, which is equal parts infuriating and terrifying as your ears climb up the side of your head, stretching huge and flat and rounded. You squeak in terror as your face lengthens out into a little muzzle, your teeth growing huge in the way of rodents. Your hair is still bright red, contrasting absurdly with the white fur now covering your body. Of course, with the muzzle comes the smells, and with the smells comes... terror. Never in your life have you felt such animal fear before. It's almost maddening as it floods your mind. You don't know what you're doing or how to stop; you just obey, turning and pelting off down the desk away from the cat. You don't even think of where you're going or whether he is following, so you are caught totally unprepared when you find...</span></div></div>",
            "created":1335589200,
            "id":1324119,
            "title":"Mousey Little Girl"
        },
        "1331212":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A male rat that's part human like you are.",
                "Marisa, as small as you are but with large wings coming out of her back."
            ],
            "content":"<div class=\"\"><div> <span>You're not sure if it's the opening in the wall promising shelter or the smell of something delicious, but you go for it as fast as your legs will carry you. All four of your legs, as it happens. You hear pounding paws behind you as you run, but you don't look back to see how close the cat is coming. You know that the instant you do, your heart is going to sieze with fear, and you won't be able to do anything but stare. The hole is within reach, so you dive with all your might, sliding in just seconds ahead of a huge black paw, claws reaching as the cat struggles desperately to reach you. You land on your back, so you get a perfectly good view as you slide away backward, too afraid to really understand his words. \"No, stop!\" He shouts. \"It's not safe in there... if you get hurt, Marisa will kill me!\" You don't hear any of that, though. Instinct has you completely, and your fear says where that smell is coming from is where you need to /not/ be. So you get to your feet and scamper off towards the smell of food and away from the smell of danger.<br>\r\n<br>\r\nSome time passes; you couldn't say how much. But next you know, you're walking casually through the dark, following your nose towards the thing you smelled. Sure enough, there it is. You can barely make it out - a huge hunk of cheese resting on a plastic platform. You can't say why anyone would have left this here, but... the gurgling of your stomach is quite clear about one thing: you aren't gonna waste this opportunity and leave it for somebody else to find. Fortunately for you, though, you aren't alone here in the dark between the walls. Because just as you are reaching for it, you feel something grab you and twist you around. Abruptly, you're standing face-to-face with...</span></div></div>",
            "created":1338267600,
            "id":1347340,
            "title":"Following Your Nose"
        },
        "13312121":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Abruptly hug him, so relieved to see someone normal and close to your size.",
                "Push him away, saying you'll only tell him anything in exchange for food."
            ],
            "content":"<div class=\"\"><div> <span>There's a little furry face glaring at you, his nose long and black and his eyes high and round like yours. He is wearing only fur, which you admit smells wonderful in a way you simply cannot explain, except that it makes you glad you are too. He has a long candle in his other hand, and a worried, frustrated look on his face. \"Idiot!\" He yells, his voice angry, but more /for/ you than /at/ you. \"Are you trying to get yourself killed? There's not much of our family left, we...\" His eyes widen as the light of the candle shines on your body. He is strong-looking, well-built with gray fur, a full two feet taller than you are. Your white fur isn't just different, it's strikingly clean in a way that he is not. The message seems clear to him. \"You're not... even a rat!\" He reaches down, releasing your wrist to slide his hand down your front. By any human standards, touching like that would be absolutely wrong, but... his hand on your tail feels almost welcome after the chaos and confusion of the day. \"Did you just get transformed? Which means... you weren't born a rat! Are... Are you really from the outside?\" He lets go of your tail, though one strong hand returns to your back. The message is clear: you aren't running away. Your eyes look the rat up and down once in the flickering candlelight before you smile at him and...</span></div></div>",
            "created":1340686800,
            "id":1367502,
            "title":"Investigated by a Rat"
        },
        "133121211":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "\"I would love that, thank you!\"",
                "\"N-No, I... I need to find a way to... get back to normal...\""
            ],
            "content":"<div class=\"\"><div> <span>You embrace the rat, unable to resist the instinct after your last few hours of utter chaos and confusion. In /no/ way is it because he's tall, muscular and male, absolutely not. You just want to feel safe, and this newcomer seems about the safest you've been all night. He saved your life! He must have your best interests at heart! For several seconds, the rat freezes, seemingly caught completely off-guard. In the silence, you listen only to his heartbeat, enjoying the feeling of pressure on your breasts every time you inhale. You close your eyes and hide them in his chest. You have been unable to handle the pressures of this magical world for the last few hours... maybe now you won't have to! You wouldn't really mind if he never moved, and you stayed there for hours, but a few seconds was all it took.<br>\r\n<br>\r\n\"You are from the outside.\" He wrapped his free hand gently around your back, holding you just a little closer, and looking down on you. You look up, nodding at him, but finding yourself unable to anymore than squeak for him. He smells so good... this must be what middle-schoolers feel during their first crush! \"Do you have a name, mouse? I'm Saul... the rat, obviously. Second oldest of my father's sons, heir to the southern kitchens...\" Well that sounded silly. <br>\r\n<br>\r\nYou relax a little, and after a moment, manage to squeak, \"D-Daaa...\"<br>\r\n<br>\r\n\"Day? You do look bright.\" He releases you, holding the candle closer so he can see your face. \"Would you like me to take you somewhere safe, Day? Somewhere with lots of food and no traps?\" You consider that for a second, before looking back up into his face and answering...</span></div></div>",
            "created":1341637200,
            "id":1373475,
            "title":"Rodent Embrace"
        },
        "1331212111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Gets younger until she's a little baby.",
                "Becomes a large piece of cheese."
            ],
            "content":"<div class=\"\"><div> <span>You answer with downcast eyes, unable to make eye contact with him. His eyes are black like any rodent's, and they seem to look right through you in a way you can't really explain. Whatever he might look like, whatever he might smell like, the promise of somewhere safe and warm is more than interesting enough to get your attention. He smiles at your positive response, his tail twitching a little behind him. \"Good, Day. I wouldn't feel good leaving you up here by yourself, not with a cat on the loose and these traps all over the place!\"<br>\r\n<br>\r\nHis concern for you is flattering, and it makes you feel even better about leaving the only escape from these wall-caverns you know behind. He offers you his free hand, and you take it, gripping his gnarled gray paw with your delicate pink one. If feels good to not have to think about what you're doing for once, just to walk along beside him and let your mind wander. You think about how you will go about getting back to normal... if the possibility is still open to you. You wonder if you still have some of Marisa's magic. Didn't she say some of that had been transferred to you somehow? Maybe if you figure out how to use it, you could change yourself back to normal. Of course, the fact that you have no idea where to even start does a pretty good job discouraging you. A few hours ago, you didn't believe magic even existed... now here you are: a naked little mouse hiding in the walls of a witch's department store. An almost unbelievable thought, but you can't deny your memory. You are able to think freely as you walk, wandering down tunnels and crawling down shafts with ease. They all blend together to your little mouse-brain, and there is little conversation between you. The rat is always watching you, in the way that boys watch girls that they think are pretty, but you don't have the courage to ask him to stop. You're also not entirely sure you want to.<br>\r\n<br>\r\nYour thoughts do not go on forever, though, because eventually you see light blazing up ahead. \"This is where my family lives,\" he explains. \"Or where I live, anyways. The kitchens are a good place! There's lots of food... usually it's the rest of my family that visits me for food. You'll love the other females...\" He didn't sound quite so confident about that. \"Just try to agree with them if you can. They've never seen a mouse before, and I'm not sure how they'll take me bringing a female home with me.\"<br>\r\n<br>\r\nYou try to reply with something unenthusiastic, but all you manage is a little squeak again as you pass through the doorway into the lighted room. It's huge, with soft fiber on the floor and a few little Christmas-lights attached to batteries by lengths of wire. There's furniture made of wood, and the smell of food everywhere. Your mouth hangs open as it washes over you, buckteeth poking out even more than usual. \"Do you think...\" He nodded with a smile, patting you on the head.<br>\r\n<br>\r\n\"Of course, Day. I'll have-\" But he does not get the opportunity to finish. A gray from lunges out of nearby doorway, colliding with you and slamming you to the floor. She's bigger than you, just like Saul is, and her eyes are angry. Her teeth are bared against your neck as you land, hissing loudly. What happens next is so unexpected that you don't even realize it's happening. One moment you're helpless, the next your question about whether or not you have any of Marisa's magic is answered as the rat female...</span></div></div>",
            "created":1342760400,
            "id":1383931,
            "title":"Going Home with Saul"
        },
        "13312121111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "\"No! I... want to keep her... like this.\"",
                "\"Alright, I'l... t-try...\""
            ],
            "content":"<div class=\"\"><div> <span>You watch with a mixture of horror and relief as the rat who attacked you proceeds to shrink away before your eyes, quickly changing from a serious threat to a little, insignificant infant. Had she not been attacking you you might have been horrified, but under the circumstances you're more happy to be safe than worried about her well-being. Like you she's stark naked, so there's nothing but primitive wooden jewelry that falls limply off her body and onto the ground. The change comes so rapidly that you aren't able to watch her large breasts go flat, or her feminine proportions rapidly shrink into childishness. One minute she has you pinned, the next... her fur is as smooth and clean as yours is and you have to catch her to prevent her from rolling off your belly. You could not say where the instinct comes from, but it comes, and you scoop her deftly into your arms right as she starts to roll. Her eyes are wide with shock and confusion - not adult at all. They're totally innocent, childish, and helpless. The rat who attacked you is gone, and a baby has been left behind in her place.<br>\r\n<br>\r\nNot knowing what else to do, you sit up, holding the baby against your chest as anyone would hold a baby. The whole room is staring at you, in horror and amazement and shock and everything in-between. Saul is the first to speak, though, dropping down to his knees so that he can get a good look at what happened. \"What did you do to Kelly, Day?\" He asked, not peremptory, but worried. Could you really blame him? Even if she had attacked you, he obviously cared about this female, which you understood to be one of perhaps many of his mates. Was it really a surprise to you that he genuinely cared for her just as he had cared for you? \"I was going to get her off of you! She was just defending her territory! It's a natural reaction to having a strange new female come in with my scent all over her...\" He looked a little scared as he looked at you, which hurt you more than Kelly had.<br>\r\n<br>\r\nYou look back indignantly, but something in you feels... dulled, softened by this little baby. You can't tell why, until you look down. She's not just a baby - Kelly has changed into a mouse. Her fur is white like yours, that's why she's so soft! And her eyes... they're just like yours, not black like they had been! Her tail's soft and pink and... she's yours! But how is that even possible? \"I didn't... it just... happened.\" You squeak, rocking back and forth to shush the little mouse, who had began to fuss as she sensed all the attention.<br>\r\n<br>\r\n\"Change her back!\" Saul protests, not firmly, but clearly not a mere request. \"Whatever you did... undo it.\"<br>\r\n<br>\r\nCould you do that? You remember that feeling that filled you when you got attacked. You could probably make /something/ happen. But will you? Making up your mind, you look up to Saul and tell him...</span></div></div>",
            "created":1343624400,
            "id":1393548,
            "title":"Making a Baby"
        },
        "133121211111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "My bed with me.",
                "The nursery."
            ],
            "content":"<div class=\"\"><div> <span>There is silence in the little room for some time, as all eyes are on you and the brand new baby. You can't be sure if the expressions you see are fear or anger or worry or... in some of the smaller females, relief. That look is enough to renew your courage, and you state it more firmly to Saul. \"I... I know you want her back, and that's a good thing to want, but... it doesn't work nearly as well when it comes to always performing the same way. Sometimes it does stupid stuff and I don't really know why. If I try to change her back, I have no idea what might happen.\" You thrust out the little baby so that he can see, turning her around so that the whole assembled room can get a good look at her. She yawns adorably at that precise moment, which you can't say hurts your case any. \"Do you'really want to risk hurting her? Poor innocent little... Kelly.\" You remember the name then, and supply. Saul thinks this over, and while he does, you marvel over your remarkable burst of bravery. Where you got the courage to say so much so boldly you don't know, but maybe you're starting to adjust to this whole being a mousegirl thing. To think that just a few hours earlier you were naked and alone in a little jar, and now here you are, comparatively safe. Little Kelly returns to your arms, where you feel best about her being to begin with. Not like you don't trust these rats to treat her right... heck, until recently, she was a rat herself! It's instinct, you can't help it. Speaking of instinct, is that slight swelling to your breasts... there's no way that's what you think it is. But if this really is a baby, then...<br>\r\n<br>\r\nYou shudder involuntarily at the thought right as Saul looks seriously at you to reply. \"Okay, Day... that makes a lot of sense. I don't want you to try until you are sure that you can change her back. But I don't t want to wait for her to grow up, either! You can fix her, I know you can. Even it it takes you a few weeks, or a few days... you'll get it all straight eventually, I know you will. That's what witches do, they always get what they want. You do want to help me, right... to give me might mate back? I know she was mean to you, but Kelly really was a nice rat. She never hurt anyone...\" Based on the expressions of Saul's other mates though, that's clearly not quite true. Heck, a few of them have pretty visible scars to indicate that they have been abused by someone, and somehow you don't think Saul is capable of treating his mates that way. He seems so... Oblivious. Whatever else he might be. Like wonderful, good looking, strong, brave... he seems a little oblivious.<br>\r\n<br>\r\nYou nod after a little while. You don't much like the idea of giving up the baby EVER, but when you think about it you realize that is probably the instinct talking. This isn't your baby, this is a mean Rat that tried to attack you! Why should you care what happens to you? As much as what is left of your intelligent mind says this though, it is not nearly loud enough to stop you from changing your mind about her. Whatever else happens, you are keeping the baby as long as you can. This revelation that you still have magic is interesting, but... more than anything else at this point you really just want to get some sleep!<br>\r\n<br>\r\n\"Is there a bed somewhere, Saul? I'm... I would love to practice, but right now I'm tired, and the baby's already asleep.\" Indeed, the little one stirs a little in your arms but remains firmly unconscious as you stand there. You've always liked that about her... Kelly is the best baby you've ever had. Although... what on Earth are you thinking? You've bever had a baby! This one surely isn't yours! But... you don't try to take the words back, once they are out of your mouth, you leave the issue alone. \"Somewhere for the baby too would be... no.\" You hold her a little tighter to your chest.<br>\r\n<br>\r\nSaul thinks about this for a moment, before nodding reluctantly. \"Sure, Day. You can sleep in...\"</span></div></div>",
            "created":1344920400,
            "id":1404604,
            "title":"Adopting Kelly"
        },
        "1331212111112":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "\"Why?\"",
                "\"How?\""
            ],
            "content":"<div class=\"\"><div> <span>He gestures to one of the nearby rats, one of the smaller ones with several scars steps forward, lowering her head respectfully to Saul. \"Gene, could you show her the way? You're the only one who is using the nursery.\" She nodded, and he looked back to you. \"Make magic your first priority, alright Day? I really really want my mate back. Practice and practice until you're ready. I will ask each day to see what you've learned.\" Pause. \"Gene, take her. And get her supper while you're doing that.\"<br>\r\n<br>\r\nThe little rat nodded obediently, moving over to you and taking hold of one of your arms. Up close, you could tell without even looking that she was a mother- the smell was all over her. She was much smaller than some of the others, probably younger too, so her getting close didn't frighten you the way it had when Kelly had attacked. She wasn't all that different from a mouse really, aside from her harsher features and her fur. \"Please come with me.\" She squeaked timidly, despite being a few inches taller than you were. Without another look back, you turn and follow her from the room. There was a steep stairwell to climb, a stairwell that was more like a ladder made with cardboard and other scavenged bits and pieces of refuse. It was pitch black, but that didn't bother you the way it should have, not with her scent so strong and close by. The dark was part of your world! Mice were in the dark most of their lives! Then again... you weren't a mouse, not really! Had you completely forgotten your hopes of being human? Being normal-sized, even? You hadn't abandoned yourself to a rodentine existence forever... had you?<br>\r\n<br>\r\nThe nursery wasn't that far, and it was not long at all of walking through the dark that you reached a low, brightly lit, warm room. There's a warm breeze blowing through the room towards you, and a bright green LED showing through the steel ceiling. The walls and floor were soft though, and it was unmistakable what this room was supposed to be. It was colorful, soft, and full of homemade baby toys of various shapes and sizes, made with bits of trash like the tabs from soda cans and reflective bits of plastic, with the edges sanded smooth to avoid hurting little bodies. There were several cribs, and several more \"beds\", though each one was clearly made for several individuals to share. \"Here...\" Said a small voice from beside you, leading you to one of the closer cribs. There were three little rats asleep inside, barely old enough to have fur. \"Shawn, Rex, and Lilly.\" She explained proudly. \"You can put Kelly in with them if you like. She would get too cold if you put her on her own.\"<br>\r\n<br>\r\n\"Will they... hurt her?\" You can't help the question, despite how unlikely it se ms. But rats are bigger and stronger than mice! You don‘t want her getting hurt!<br>\r\n<br>\r\nOf course, Gene looks at you like you're crazy. \"They're babies. What are they going to do?\" She reached towards Kelly, and for one reason or another, you let her take the child, which she holds gently to her chest for a moment, looking her over for a moment before setting her gently into the crib with the others. You watch closely, but sure enough, the others hardly even seem to notice her. One of them nudges a little closer to her, and Gene adjusts the blanket so that it covers all four of them together. \"There.\" She turned away, facing you again. \"Now...\" All her nervous shyness was gone now. \"I saw what you did, I know you're a witch. You have to help me escape with you.\"<br>\r\n<br>\r\nYou look back at the rat, mind reeling over her words. You imagine Saul, the little Kelly asleep in the Crib, and answer...<br>\r\n</span></div></div>",
            "created":1345870800,
            "id":1413158,
            "title":"The Nursery"
        },
        "13312121111121":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "To agree. You'll be able to escape that much quicker with someone to help.",
                "To ask Saul for permission to take her with you. Gene is his, after all."
            ],
            "content":"<div class=\"\"><div> <span>More than anything else, there is one question in your head, a question you absolutely cannot ignore. \"Why?\" You ask, watching Gene to see any physical signs of what her answer might he. She looks absolutely indignant at your confusion, and seems almost unsure if your question is even serious. When it’s clear that you are, she speaks very slowly. “Have you not seen the way we live in here? We’re so small, so vulnerable. The witch who lives in the house outside is always trying to kill us. She's got this cat...\" She shivers all over. \"I don't want to get out of her house. I want to get out of being...\" She gestures down at herself. \"Like this! Small! I know that your magic could do it. I’m willing to let you test it on me until you get it right... I know you're new at it. Else, I would have seen you in the witch‘s shop before, and I haven't.\" She took your hands, pleading. \"Please! I know you can do it... you can practice on me, and when you figure it out, you can change yourself back too! That's a fair deal, isn’t it? Saul's okay, but I want to be free! You can get both of us out, with my help! I know more about the way around in here than anyone. I could get us into the storage room to practice where even the cat won't see us! And because we’re practicing, that should make Saul happy so he will leave us alone... until we can escape!\" She paused only briefly, letting go of your hands. \"Well? what do you say?\"<br>\r\n<br>\r\nYou don’t have long to consider this offer, but after what time for thought you have, you decide...</span></div></div>",
            "created":1348346760,
            "id":1432924,
            "title":"A Plea for Freedom"
        },
        "1333":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "\"I'll do anything you want, just... h-help me...\"",
                "\"I want to go home!\"",
                "\"I don't care what I did, I don't... I don't deserve this.\""
            ],
            "content":"<div class=\"\"><div> <span>The look on the cat's face does little to comfort you, but it does confuse you. He's clearly upset about something, but his expression seems almost human. It certainly isn't the predatory look you'd expect from a cat looking at something which might as well be a mouse for all you could do to fight him. While he's clearly angered, there's something restrained about it, tempered as only someone old and wise could do. He lowers his head, hissing softly. \"You hurt Marisa, hurt me... I should make you hurt just as much.\" You were surprised that the cat could talk at all, but it was almost more surprising that his voice had an old English accent to it, like royalty. His hot breath washes over you, surprisingly nice on your exposed body, but hardly something you enjoy under the circumstances. \"There's a reason she didn't just get rid of you, though. She does need an apprentice, and she's quite desperate after searching for so long. That unfortunately means I'm not allowed to damage you.\" You want to be relieved by this statement, but seeing his claws flex nearby makes that difficult.<br>\r\n<br>\r\n\"P-Please...\" you manage to squeak out, trying to avoid looking at anything sharp on the cat's body, a difficult task. You're not sure where to go from that weak plea. The cat hasn't backed away at all, still hunched over you, powerful muscles twitching under his dark fur. You lower your head, looking down at your female body with its modest curves. It's hardly your first concern, but it does reinforce just how defenseless you feel, tiny and naked in an unfamiliar body. There must be something you can say to help your situation. Without looking up, you mutter, \"I... I...\"</span></div></div>",
            "created":1351366980,
            "id":1454787,
            "title":"Bad Karma"
        },
        "13332":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Marisa standing over you.",
                "Your girlfriend's coat hanging on a rack above you."
            ],
            "content":"<div class=\"\"><div> <span>You do your best to hold back the tears after your outburst. You feel like such a child for saying it, too, but you really are just that scared and want things to go back to normal. The cat seems like it backs off a little, based on the creaking of the wood and absence of the hot air washing over you. You dare a glance upward and see that he's sitting straight upright, pondering you quite seriously. You try to speak again, wanting to say more to convince him. \"Alright,\" he says simply, cutting you off before you can even start. <br>\r\n<br>\r\nYou look hopeful for a moment, then, without warning, his head lunges at you. There isn't even time to react as his warm, wet tongue is pressed to the front of your body. The rough surface easily sticks to you as you're brought rapidly into the cat's mouth. You scream and flail, but you're far too weak to make a difference. After a minute, you realize you're not being eaten and start to calm down. Instead of being brought entirely into his mouth, your legs are hanging outside, with his mouth holding you firmly around your waist and teeth gently keeping you in place. Where his teeth are touching, you do feel a little sore, but you realize this is more because of your thrashing than him trying to hurt you. \"Wh-What are you doing?\" you finally get up the courage to ask, but of course he can't answer you with his otherwise busy.<br>\r\n<br>\r\nYou feel movement suddenly, a cool wind blowing awkwardly over your rear. There's a brief pause a few minutes later, and then suddenly your legs are freezing in what you assume to be the cool nighttime air. You would worry about frostbite, but as the cat keeps moving, his breathing becomes more rapid, warm air from his nose keeping your lower parts warm, if not as humidly hot as the half inside the mouth. At this point your upper body is completely covered in moisture, and the saliva seems to be building up more and more. You wonder nervously just how good you taste... and how much self-control this cat has.<br>\r\n<br>\r\nThankfully, the trip doesn't last much longer. You're more than a little disoriented by the time you're unceremoniously spat out on the ground. It's difficult to tell where you are at this size, but as you look around, you quickly see...</span></div></div>",
            "created":1353783600,
            "id":1474395,
            "title":"Getting Mouth-Delivered"
        },
        "133322":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "The shadow of Lauren's body, clutching tightly to your pillow.",
                "That the bed looks empty."
            ],
            "content":"<div class=\"\"><div> <span>It's hard not to notice the pink coat hanging impossibly high above you, the same coat you got for Lauren's birthday two years ago. You stand up quickly, panicked. As much as you care about your girlfriend and want to be somewhere safe, letting her see you like this would be... beyond humiliating. \"W-Why did you bring me here?\" You ask the cat, though you have a feeling you already know the answer.<br>\r\n<br>\r\n\"You asked to go home,\" he answered without a thought, grooming himself with his tongue and barely looking up when he had to speak. \"Your address was on the form you filled out when Marisa hired you.\" You're about to speak up, to explain that you when you said that, you meant being turned back the way you were before going home. He doesn't give you the chance, ears perking up suddenly and not even paying any real attention to you. \"Marisa needs me for something. We'll be back tomorrow to pick you up for work, assuming you don't try to hurt us again.\" Then he was gone without any drama. No smoke, no flash of light, no smile staying behind a second longer; he just suddenly wasn't there anymore.<br>\r\n<br>\r\nYou turn fearfully, looking out at your small apartment that's anything but right now. Everything is so impossibly large and distant, your vision unable to focus on very much at once. There's an overwhelming urge to breakdown and cry as fear washes over you. You swallow your sobs for the moment, though, aware of how dangerous it is to be in the middle of the floor right in front of the door. You force yourself to walk, looking for someplace safe to hide. It's a difficult walk; normally undetectable air currents brush against your body, chilling your naked and saliva-soaked body. Your nipples seem harder and perkier than you ever remember Lauren's being, even though you're considerably less endowed than she is. Even idle thoughts like that don't distract you from how absolutely tired and freezing you are. They do make you think of Lauren, though. Was she worried when you didn't come back last night? Either way, she's probably asleep in your bed by now. Worried, you decide you should probably check on her. It's an even longer trek to the bedroom, but you motivate yourself by knowing that you'll be able to find clothes on the floor that'll keep you warm and comfortable while you sleep. Neither you or Lauren were very good about using your laundry baskets.<br>\r\n<br>\r\nFinally reaching the closed the door, you're relieved to see that there's plenty of space underneath to crawl inside. Once there, you have to blink a little, your eyes adjusting to darker room, the closed window preventing the light of the city outside from streaming in. As your vision adjusts, you look up to the bed and see...</span></div></div>",
            "created":1356204480,
            "id":1492853,
            "title":"There's No Place Like Home"
        },
        "14":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "To be a hawk.",
                "To be an ermine.",
                "To be a house-cat. ",
                "To be a python.",
                "To be a red fox."
            ],
            "content":"<div class=\"\"><div> <span>“I thought it was a gag!” you bemoan to her. “Magic isn't real! Or, er, it is but... it wasn't!” You sit there clutching your knees and rocking ever so slightly, all the while thinking that of all the impossible predicaments you could have gotten yourself into, this was probably the most embarrassing. You might have grown tentacles, or had your skin dyed permanently pink, or been cursed to forever stink like a goat. If anything like that had been the case you wouldn't be so terrified of the idea of showing yourself to your friends and family. Your masculinity was always so important to you, and more importantly who would believe that it was you, David? You might even get into trouble with the law for want of a valid ID! “This was supposed to be a... I thought it was a costume shop! You were crazy, or... and I tried everywhere else! I just needed a freakin' job!”<br>\r\n<br>\r\nMarisa meanwhile is looking quite disappointed herself; her eyes are tightly shut and she clutches her forehead forcefully with her palm, slowly shaking her head left and right. “Damn!” he hisses, seeming to be speaking to no-one in particular. Suddenly she starts gesturing wildly with her arms and gazing up towards the ceiling. “This! This!” she continues “This is what I get for advertising in the paper. Yeah! Fine! Brilliant!” For a moment she almost seems a little unhinged, but then she quickly calms down and speaks to you in a very serious tone. “Well, I'm sorry.” she says, sounding at least a little genuine. “You're stuck. There's nothing I can do to make you a boy again. Maybe you should accept it and take the job anyway. I promise you'll like it after a while.”<br>\r\n<br>\r\n“Are you serious?!” you hiss back at her in terrified, angry bewilderment. “Nothing? There's nothing?! I-I-I can't live like this! I can't SHOW myself to anyone like this!”<br>\r\n<br>\r\n“And that was part of the contract!” Marisa cuts in. “You READ it... right?” She quiets for a moment as if expecting you to answer. Finally you manage to squeak in a sheepish tone “No... not really...” For an instant your own idiocy mildly amuses even you, you can't help crack a faint, ironical, pained smile for a split second. Marisa turns her head to look away for a moment in obvious exasperation, then quickly turns back. “Well, I said there was nothing I could do to make you a boy again. What I DIDN'T say is there was nothing I could do at all. If you don't want to be my apprentice, fine, but you'll still have to live and work HERE, you don't have a choice anymore. And don't give me that look this is as much your stupid fault as mine. But... look...”<br>\r\n<br>\r\nShe kneels down so that your faces are at a level. She looks you straight in the eyes, concern and sympathy evident in her own. “Think about this for a while, but there is a way to make it less noticeable.  I can tell that's what's bothering you.” She gives you a quick disgusted look that tells you whatever exactly it is she understands, it kind of makes her want to punch you in the face. “The magic is still fresh and formless inside you, you could become anything at this point with a little prompting. Whatever you become you'd still be a girl... version of it, but in a lot of animals gender is hard to tell. And familiars are almost as valuable as apprentices.”<br>\r\n<br>\r\n“W-what? A-animals?” you stutter, feeling as if you'd tuned out for a moment and lost something.<br>\r\n<br>\r\n“Yes.” she says. “You can't ever have your old life back, and I'm sorry about that I really am, but you're going to have to pull your weight somehow. If you don't want to have to adjust to life... like this, like the way you are now, then you can change even more. I can change you so much that you being a girl won't seem to matter at all, and you'll have a new life. It'll be much more interesting than whatever you were doing before, I promise. You'll... still be female, but... what do you think about a female hawk, or a cat, or a stoat?” Marisa seems to be becoming progressively exuberant as she lists her first three choices off, sounding almost dreamy, perhaps even envious. “It's much less responsibility than an apprenticeship, though... it's also more of a sacrifice. No popping out to go to the store, no independence, no speaking to non magi.” She adds derisively “You've got issues by the way, if this is what you actually want.” <br>\r\n<br>\r\nA long time seems to pass before you manage an answer. It takes a while for the young witch's words to really sink in. You try to weigh the decision in your mind. More specifically you try to think of as many reasons as you can to stay human. But what you always end up coming back to is the feeling that those heavy masses on your chest don't belong there, they feel almost like tumors or parasites; you continue to try your best not to touch or even look at them. Dimly you understand that it's something you'll get used to, but the unnatural alien sensations are too immediate to ignore.<br>\r\n<br>\r\n“Anything but this...” your voice croaks out. Once again Marisa sighs in tired exasperation. “I REALLY hope you learn to stop saying things like that soon.” she says, shaking her head. <br>\r\n<br>\r\n“Will I stay who I am?” you ask? “Will I forget?”<br>\r\n<br>\r\n“Your mind will be suspended on a foundation of pure magic.” she responds poetically. “If anything you might actually get smarter, or I hope so anyway.” She smiles. She seemed to be about to continue when you suddenly interrupt with one last question. “Will I just be cooped up in here for the rest of my life?”<br>\r\n<br>\r\n“Er-no...” Marisa replies. “At first, maybe, until you get used to it, but if you're well behaved I can let you out into the backyard occasionally. Anyway, if this is what you want, I only really know five transformation spells. You could be a red-tailed hawk and fly all on your own... you could be an ermine, a house-cat (the classic), a python...  you know, the snake... or, a red fox.”<br>\r\n<br>\r\n\"This is what I want,\" you confirm after a moment, before choosing...</span></div></div>",
            "created":1338267600,
            "id":1347619,
            "title":"Looking for an Alternative... Any Alternative"
        },
        "144":{
            "author_id":"snakeboy89",
            "author_name":"Michael Bianchi",
            "choices":[
                "You try to get used to your new form.",
                "You are hungry, time to eat."
            ],
            "content":"<div class=\"\"><div> <span>You think for a moment and then you say,\" I want to be a python. It's an amazing animal and it's also strong.\". <br>\r\n<br>\r\nMarisa looked at you and asked, \"Are you sure about that? I mean, once I change you, you can never turn back. You think for a moment and say, \"Yeah, that's what I want to be.\" Marisa nodded and slowly you turn into a python and you estimate the length at 18 feet at least.</span></div></div>",
            "created":1393526700,
            "id":1752246,
            "title":"To be a python."
        },
        "15":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "It's focused on your legs.",
                "It's focused on your back.",
                "It's focused on the base of your spine and your ears.",
                "It's focused all over your skin.",
                "You can't pinpoint anywhere, it's throughout your whole body."
            ],
            "content":"<div class=\"\"><div> <span>You sit there for an indeterminate period of time, lost in the waves of your own emotions. You didn't want this! You didn't want anything close to this! Magic wasn't supposed to be real, that was one of the hard truths of growing up. Here you were, though, a girl very much like the one standing over you. No one would know who you were now. Your friends would treat you like any attractive woman around their age, hitting on you and betting on who would be the first to get to first base. For once, you realize how much of a jerk you could be, though you don't dwell on this realization.<br>\r\n<br>\r\nLooking up at Marisa, your eyes are starting to tear up. It seems she's about to say something, but you don't hear it as you're overcome with another feeling of intense warmth. <i>What's she doing now?</i> you wonder in your agony, though forcing a glance you see that she has an expression of shock on her face. Apparently even she doesn't know what's going on, which does nothing to reassure you. Despite the discomfort throughout your whole body, it seems the warmth is especially focused in certain areas. You concentrate as hard as you can, trying to determine what's changing.</span></div></div>",
            "created":1330232400,
            "id":1284626,
            "title":"Not Again"
        },
        "151":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A long tail covered in scales. You're a naga.",
                "A scaled tail with a fin at the end. You've become a mermaid.",
                "Four. You're some kind of taur."
            ],
            "content":"<div class=\"\"><div> <span>You can feel the uncomfortable warmth focused in your legs and around your waist. It's an especially odd sensation between your legs with your new organ, which is why you quickly try to avoid thinking about what's happening to you. It works for the most part, until you feel an oddly cool sensation on your hips. You open your eyes weakly, barely able to make out the shape of Marisa close to you, quickly sliding off your pants and boxers. You want to protest, want to fight her off and prevent her from embarrassing you further, but you don't have the strength. As your legs are exposed to the open air, the sensation only gets stronger and it's too much for you to take. You black out again.<br>\r\n<br>\r\nWaking up, you realize you've somehow ended up sideways on the hard linoleum floor. As you regain your senses, the memories of what happened come flooding back to you. You can already feel the slight pressure on the side of your breast, so you're already sure it wasn't a dream. Remembering what happened before you passed out, you quickly look down to your legs. What you see makes you wish you were still unconscious. Your legs have become...</span></div></div>",
            "created":1330232400,
            "id":1284645,
            "title":"Below the Belt"
        },
        "1511":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "You obey Marisa and stay where you are for the night.",
                "You lunge and attack her.",
                "You hesitate too long before attacking, and Marisa is able to defend herself."
            ],
            "content":"<div class=\"\"><div> <span>You can see now why Marisa had taken off your pants before your legs had changed. The long crimson and black tail would've completely torn them apart, and likely hurt you in the process. You wonder where Marisa could've gone. Did she really just abandon you in this cold office like this? That f- A soft cry of pain reverberates through your body, and you realize you were instinctively using your tail to squeeze a soft source of warmth beneath it. While it does feel good having your tail wrapped around the warmth, you have a pretty good idea of what it is. You don't have much practice using a long snake tail in place of legs, but you do your best to loosen your hold and slide off of it.<br>\r\n<br>\r\nAs soon as she can, Marisa climbs out from under you in a hurry, gasping for breath. \"Finally!\" she exhales, leaning against a wall well away from you. Once she's caught her breath, she looks at you angrily, but you can taste fear more than rage. Wait, taste? You hadn't even realized it at the time, but you had flicked your tongue out and been able to... taste her emotions in the air? You run your tongue around your mouth as you think about it, soon discovering you also have two long fangs. \"You couldn't have woken up any sooner?\" she shouts, bringing you out of your thoughts.<br>\r\n<br>\r\n\"What are you yelling at me for?\" You hiss at her defensively, showing your fangs. As soon as you realize what you're doing, though, you cover your mouth, face going red in embarrassment. Still, you can't help feeling a little satisfied at the way she looks, losing a little of her edge.<br>\r\n<br>\r\n\"Just... Just calm down, David. I don't know what happened, but we'll get this all sorted out.\" She stands up slowly, eyes never leaving you. You lower your hand to get another taste of the air, finding it even fuller of whatever smell is telling you she's scared. \"I know someone who has more experience with nagas. They might be able to help. It's late, though, so they probably won't be able to arrive until tomorrow. I need you to stay here for the night, okay?\" <br>\r\n<br>\r\nAs she opens the door out of the office, there's a rush of air, bringing with it the musty scent of the store room, but also tastes of the outside. You don't want to be cooped up in some tiny room all night, especially not at the request of this witch that turned you into this snake-girl freak. On the other hand, without Marisa's help, you'll be stuck like this forever. You don't have much time to decide, but in the end...</span></div></div>",
            "created":1331010000,
            "id":1290068,
            "title":"Cold Blooded"
        },
        "15111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Marisa's expert: another naga!",
                "That you're in an artificial environment in a lab of some sort."
            ],
            "content":"<div class=\"\"><div> <span>You don't like it, but cooperating is probably the only way you'll have a chance of getting back to normal. Or at least human again. With a sigh, you lean against your own tail, watching Marisa pack her stuff up and talk on her cell phone with someone. The sound of her footsteps makes it impossible to hear what she's saying, so you just follow her with your eyes, gaze lazy but never losing track of her. After a few minutes, though, you get bored, closing your eyes and thinking about how you could've been spending the night complaining about you not being able to find a job to your girlfriend.<br>\r\n<br>\r\nYou look up again when you hear the footsteps get closer. Marisa freezes as soon as you lock your eyes on her. \"I, uh... I managed to get in touch with my friend...\" You saw she was holding something behind her back, but couldn't tell what. \"Said he would be on the next flight he could get.\" You nod weakly, not really in the mood to talk. She frowns, swallowing hard before walking the rest of the way to you. As she gets within immediate striking distance, she walks a little slower. You're beginning to understand why she smells so afraid. This close, you can see that you would be nearly twice her size if you had human legs. With your tail, you must seem like a monster. You don't really feel sorry for her though, not after what's happened to you. You briefly wonder if her fear tastes as good as it smells, but dismiss the thought. You've already decided to let her help you. \"Will you be alright here, alone? I know snakes don't like the cold much. I've got the heater cranked up, but without a sunlamp...\" She put her hand on your tail, feeling the scales with a terrified curiosity. You turn away, but don't shy away from her touch. Even if it's not much, the warmth of her flesh is still nice. \"Anyways, at least you'll probably sleep okay. I suggest you get it, too. We want you in prime condition for tomorrow.\"<br>\r\n<br>\r\nShe hurries back to the door way and you glance at her. \"Just don't expect me to be any happier about this tomorrow,\" you hiss. \"This is still your fault, no matter how much you do to fix it. If I end up stuck this way...\" You bare your fangs one last time, smirking at the squeak Marisa makes. She nods fearfully before closing the door and darting away. Left in the dark and cold, you curl up around Marisa's desk, cracking one of the legs as you get comfortable. Before you even realize it, you're asleep against your own coils.<br>\r\n<br>\r\n\"Alright, David, time to get up.\" Marisa's voice is the first thing in your awareness, vibrating through your whole body as you struggle to open your eyes. You've never felt so tired before in your whole life. When you finally get your eyes open, you see...</span></div></div>",
            "created":1331874000,
            "id":1295877,
            "title":"Watching Marisa"
        },
        "151111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Stay with Marisa.",
                "Go with Arik."
            ],
            "content":"<div class=\"\"><div> <span>The first thing you notice are his eyes, colored amber with a slit of a pupil. You know you've never seen eyes like that on a person before, and yet they look better than anything your memory can conjure up as \"normal.\" You quickly realize that this isn't Marisa, though. Not only because of the well-toned male physique visible through his tight black shirt, but also the fact he's standing over you, something you remember quite clearly that Marisa was unable to do. You move back quickly, looking around until you spot Marisa standing off to one side, glancing between you and the newcomer nervously. \"D-David,\" she says tentatively, \"I'd like you to meet Arik. He's a... well, naga expert, obviously. Er... Arik, this is my apprentice David.<br>\r\n<br>\r\n\"Interesting,\" the male naga says, drawing your attention off of Marisa again. You weren't sure why, but she didn't feel nearly as important as the man. You try to get a better look at him as he speaks. His hair is a charcoal gray, matching the patternless scales of his tail. As he's nearly half a size larger than you are, his tail stretches out into the store and ends past where you can see. \"I don't think I've ever seen a naga move that fast while as cold as you are. I hope that isn't because you wanted to get away from me.\" He smirked, showing his fangs. They were longer than yours, for sure. Quite impressive, in fact.<br>\r\n<br>\r\n\"N-No,\" you respond hastily, still trying to get a grip on your situation. \"I just... was expecting to see Marisa, and... not... someone so big... and snakey...\" You look away, embarrassed at your inability to speak properly.<br>\r\n<br>\r\n\"Easily flustered, though,\" he said in disappointment, reaching a hand toward you and gently taking your chin with two fingers, tilting your head back to look at him. You think about pushing him away, but decide it wouldn't be your best idea. You're starting to understand how Marisa felt around you last night, staring up at those beautifully cold eyes which looked right through you. \"I guess that's to be expected when you were toothless just yesterday, and a human at that. Still, I was hoping for better. I thought even human magic-users had standards.\" You could see Marisa mouth something vulgar at this, and you likely would've smiled at it were you not in your current situation. \"You haven't even bothered to do anything with your clothes.\"<br>\r\n<br>\r\nLooking down in confusion, you realize with a blush what he's talking about. Despite feeling smaller compared to the male, your shirt is stretched tight, torn in several places. Without even asking, he tugs on one of these tears, ripping it the rest of the way so that the shirt slides right off. Your face goes completely red, and you wrap your arms around your chest as fast as you can. That alone is a strange sensation. Your breasts aren't the most pronounced (you could've sworn they were larger when you had first become a girl though), but they're plenty sensitive. \"H-Hey!\" you shout at him, forcing yourself to speak in more than a fearful squeak. \"You can't just rip my clothes off like that! Haven't nagas ever heard of decency?\"<br>\r\n<br>\r\nHe sighs in annoyance, clearly having his patience tried. \"Unlike humans, we believe in clothing that actually serves a purpose, which yours clearly wasn't. If it really bothers you that much...\" He reached into a satchel he had at his side, pulling out a black bundle of cloth and holding it out to you. \"Here, this is the sort of thing we wear when necessary. It should help warm you up, too.\"<br>\r\n<br>\r\nYou hesitate a moment, trying to figure out the best way to take it while limiting how much you expose yourself. Not getting any the more patient with you, the man takes your wrist and pulls your arm away from your body, forcefully placing the clothing into your hand. You thank him hastily before turning away and examining the clothes. In reality, it's only one piece of clothing, a shirt that looks smaller than the one that just got ripped off. It does seem slightly elastic, though, and you don't have any other options available to you. To your surprise, it slides on easily, though the sensation is strange. It isn't just the feeling of fabric sliding over your chest that makes it odd, but the whole shirt feels somewhat damp. You do your best to ignore it, though, especially since the shirt does seem to be fitting quite well. In fact, despite how small it looked, it comfortably goes all the way down to your scales, though it does expose your shoulders, but that's hardly your first concern. Even better, the long-sleeve shirt makes you feel amazingly warm, pushing away the last bit of your grogginess.<br>\r\n<br>\r\nYou turn back around to face Arik, smiling. \"Wow, this shirt re-\" You barely have time to see him drawing close before his lips are pressed against yours. You try to pull away, but you're pressed against the desk you curled around last night, which is now creaking at the additional pressure. Beginning to panic, you do everything to can to push the male naga off, but he's considerably stronger and knows how to use his body better. Getting desperate, you reflexively bite his lip as hard as you can, feeling your fangs sink in and the odd sensation of venom flowing through them.<br>\r\n<br>\r\nThis seems to do it, as he pulls back at once. You wipe your mouth thoroughly, stomach fluttering in what you're sure must be some naga equivalent of nausea. You glare up at him, expecting to see him suffering from your venom. Instead, you see him smirking, licking his lips. \"Excellent. For a minute there, I thought you were going to make me work for a taste of your venom. Not that I would've minded: you're plenty attractive, but we don't exactly have the time right now, and I doubt Marisa here would appreciate us destroying her stuff.\" Mouth hanging open, you glance at Marisa, who's looking down uncomfortably. She looks a lot more pathetic than she did when you first met her. \"It would seem I'm pretty lucky,\" the male continues. \"Your venom's quite potent. If you weren't so unfocused, I might not have been able to resist its effects.\"<br>\r\n<br>\r\nAs much as you want hit him for what he did to you, this intrigues you too much. \"What effects?\" you ask skeptically. \"And if it was so dangerous, wouldn't it have been better to use some non-intimate way to extract it?\"<br>\r\n<br>\r\nHe shrugs. \"Perhaps, but none of the other ways would be terribly pleasant for you. Biting into strange objects that actively suck out venom. Trust me, you're much better off. Besides, I figured you wouldn't be too strong for me to resist. I was right, too, even if I underestimated the natural strength of your venom. It definitely took some effort to resist changing.\" Seeing your confused face, he sighs, his impatience showing once again. \"Like with humans, some naga are able to perform magic. Our magic doesn't involve fancy words and symbolic objects, though. Venomous naga are the \"witches\" and what-not of our species. An experienced naga can bite down on someone and, with focus, direct their venom to perform a certain magical effect. Since you inherited your magic from Marisa, it seems you also inherited her affinity for transformation.\"<br>\r\n<br>\r\nThis is a lot for you to take in. Your venom is magic? And it can transform people? You can't help but think about trying it on Marisa, but you'd rather turn back to normal. \"Wait, if... if Marisa's specialty is transformation... why couldn't she have just changed me back last night?\"<br>\r\n<br>\r\n\"Because human magic doesn't work on naga.\" He grinned proudly, glancing back at the witch. \"Or most of it doesn't, but Marisa's never been much good at making potions.\" She glares at him, but doesn't make a sound to object. \"Like any good naga, though, I could easily mix something together if you wanted to return to being Marisa's apprentice.\" You begin to nod, more for the chance at returning to humanity than being an apprentice, but he interrupts. \"However, before you make your decision, I want to inform you of the alternative. You see, venom as powerful as yours could help me greatly in my work. I would need more than you could give to me now, so I'd like to invite you to come back to Germany with me as my apprentice instead. As I'm sure you've already noticed, naga are superior in many ways. It might take some time getting used to, but I assure you it will be worth it.\"<br>\r\n<br>\r\n\"Hey!\" Marisa shouted, finally getting the courage to approach. \"That wasn't the deal, Arik! She signed up to be my apprentice; you can't just come and take her away because she's more gifted than you realized.\"<br>\r\n<br>\r\n\"I'm not taking anyone,\" he responded calmly before turning back to you. \"I'm simply offering David here a better choice for her future. It's ultimately up to her. What do you think, David?\"</span></div></div>",
            "created":1334898000,
            "id":1319631,
            "title":"First Hand Experience"
        },
        "1511112":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Your tail start to split. You're becoming human again.",
                "The room just continue to grow. You're shrinking down to the size of a snake!"
            ],
            "content":"<div class=\"\"><div> <span>You look between the two, trying to determine the lesser of two evils here. Normally, you would've stuck with what was familiar, but at the moment /you/ weren't even all that familiar. Did you really want to go with Arik and just completely leave your human life behind? You suppose even staying with Marisa wouldn't really let you go back to it, though. How could you? Even becoming human again, you were still stuck as a girl. You didn't feel nearly as weak and vulnerable as a naga, though. Maybe staying one wouldn't be so bad. Besides, Arik seemed much more competent than Marisa, if not... entirely professional. At least you showed him, you think think to yourself, remembering what it felt like to bite into his lip. You briefly wonder what it would've felt like if he had bit you instead, his venom flowing through your blood and making whatever sort of magic he did...<br>\r\n<br>\r\nYou rub your eyes, wondering why Nagas seem to have such short attention spans. All the same, you're fairly confident about your decision. \"I think that I'd rather stay with someone who won't accidentally transform me,\" you say, adding a hiss in Marisa's direction. \"I assume Europe isn't too cold this time of year?\"<br>\r\n<br>\r\nHe smirks lightly. \"You mean summer? No, not especially. I'm glad you're not letting your pride cloud your judgement. Well, Marisa? You've heard what she wants. Will you let your apprentice study under me instead?\" The witch looks frustrated, but agrees begrudgingly. \"Excellent!\" Arik continues. \"Are there any belongings you need to get, David? We need to get to the airport as soon as possible, but we should have time for you to grab anything.\"<br>\r\n<br>\r\nYou shake your head, sighing a little. \"No, Sir. Nothing important enough to bring.\" On your budget, you hadn't been able to afford many luxuries, and all your practical belongings wouldn't do you much good in your current form.<br>\r\n<br>\r\n\"Very well,\" he responds, pulling out two small bottles from a bag he had put down next to him. The glass was colored green, so you couldn't actually tell what color the liquid was. It didn't seem to move with the same consistency as water, though. He handed one of the bottles to you, which you take uncertainly. \"It's a potion. Took a mix of six different venoms to get the right effect out of it. I should be able to cut that down with your help.\"<br>\r\n<br>\r\nThis information causes you to frown, looking straight up at Arik's cold eyes. You almost lose your ability to speak as you feel that same strage nausea. You sure hope you'll get used to him enough that just looking at him doesn't make you woozy. You manage to regain your composure, though it takes another look at the bottle to remember what you wanted to say. \"It's... transformation magic, then?\" This was exactly what you didn't want! \"Is this really necessary?\"<br>\r\n<br>\r\nHe sighs impatiently, but moves closer and puts a hand on your tail reassuringly. \"You were a venomless human, right? So you should be able to tell me how often you see a naga out in public.\" You open your mouth to respond, but don't bother, looking away in embarrassment. \"I know it's an inconvenience, but that's just the unfortunate world we live in. It's a shame more humans aren't as open minded as you are.\"<br>\r\n<br>\r\nYou find yourself nodding in agreement without being sure why. A week ago, you would've been right there among those people who were too \"close-minded\" about naga. \"It must be difficult, having to disguise yourself whenever you go out.\"<br>\r\n<br>\r\n\"Don't start crying over the plight of the naga now,\" he says with a light chuckle. \"We're the ones who decide to stay in hiding, despite what the Sandof Council likes to think.\" He seems to tell that there's a question on your lips, because he puts a finger to them before you can ask it. \"That's a story for another time, David. We hardly have the time right now.\" He pulls back, drinking the potion that he kept for himself. Seeing you hesitate, he adds, \"Its effects are temporary, so there's no danger regardless.\"<br>\r\n<br>\r\nNodding, you take a deep breath, then drink the contents of the small glass bottle. It doesn't taste like anything in particular, but it feels like drinking an entire teaspoon of the flemmy saliva that sometimes builds up at the back of your throat. It's so slimy and oily... you swallow before you can experience any more. At first, nothing seems to happen. After a few minutes, you notice that Arik looks a little smaller. Less than a minute after that, you realize you're also getting smaller. You quickly realize what's happening as you see...</span></div></div>",
            "created":1339131600,
            "id":1355693,
            "title":"A Quick Drink Before You Go"
        },
        "15111122":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A small travel suitcase.",
                "A specialized box for shipping exotic animals."
            ],
            "content":"<div class=\"\"><div> <span>You hiss at Arik, tossing the bottle away and folding your arms. \"You could've mentioned that this was what you were going to do. I thought you were going to make us human or something. How does this make it easier to get back to your home?\"<br>\r\n<br>\r\nHe turns, looking like he isn't going to answer you. \"Trust me, this is more economical. I don't have time to explain, though. Stay here.\" He leaves out the office door, easily able to fit two thicknesses of his tail through the door side-by-side.<br>\r\n<br>\r\nYou think about disobeying, but you've already lost a foot and a half by the time he's out the door. In fact, you're shrinking much more rapidly than he was. You hope he'll teach you how to resist this stuff like he can. In no more than two minutes, you're about the size of a viper before the world seems to stabilize. Thankfully, the shirt Arik gave you has shrunk with you. You're not even thinking about that, though, still upset about how everyone's been treating you recently. You freeze suddenly as you feel a huge vibration shoot through you, then another and another in rapid succession, each getting more violent. By the time the barrage ends, your senses are so shaken that you're completely disoriented, the echos pounding in your head. Even as you look up at Marisa, now standing over you, your eyes can't focus on her massive form, so you just lay there pitifully, unable to cope with so many terrifying new sensations.<br>\r\n<br>\r\nAs you notice the giant hand coming down towards you, you regain some of your awareness, holding yourself up and hissing at it. She hesitates, drawing it back a little. Satisfied, you relax, closing your mouth again. Then, faster than you can process, you're scooped up into her hand, fingers wrapped around your body and preventing you from biting her. She tries to get you to settle down, but you're not listening to what she's saying. What calms you is more physical. Your tail wraps around her wrist instinctively, the heat and stability settling you down enough that she's confident enough to release you. With your head clear, you manage to resist biting her, instead just laying on your stomach in her palm.<br>\r\n<br>\r\nTo your surprise, Marisa starts rubbing your back with her thumb. It feels nice, despite the awkward pressure it puts on your chest. \"David, are you sure you want to do this? As you can see, nagas aren't the most... forthcoming with information. You've only been a witch for a day. You really want to go off with someone who would have no problems taking advantage of your ignorance?\"<br>\r\n<br>\r\n\"You mean like not telling me that he's going to ruin my life by changing me into some she-snake?\" you reply indignantly, your words starting to hiss on the S's.<br>\r\n<br>\r\n\"I didn't know!\" She sighs, running a finger down the side of your tail in a way that feels nicer than you would ever admit. \"I never meant for things to get out of control like this, David. I just... wanted an apprentice. I can understand why you want to leave, but please be carful around Arik. It might seem like he cares about you, but its your venom that's valuable. And if you change your mind, I'd be happy to take you back on as my apprentice.\"<br>\r\n<br>\r\nYou don't respond right away, thinking about her warnings. \"We'll see,\" you reply stubbornly. \"This is one of the first choices anyone has actually given me recently, so I'm not going to refuse it.\"<br>\r\n<br>\r\nMarisa looks like she's going to continue, but someone walks into the room. It's a younger girl, about 15 or 16, with black hair and blue eyes so pale that they were almost gray. Arik was wrapped around her neck, and she was holding...</span></div></div>",
            "created":1340773200,
            "id":1368098,
            "title":"Viper-Sized"
        },
        "151111222":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "You take off your shirt and sleep the rest of the trip.",
                "You refuse! He's already seen you naked enough as it is."
            ],
            "content":"<div class=\"\"><div> <span>\"Wh-What's that for?\" You stutter nervously, tightening your grip on Marisa's wrist as the new girl steps forward. As she does, you can get a better look at the box. It seems to be some sort of disposable plastic, with several small holes. It's clear from the writing on the side (\"Venomous Snakes,\" \"Handle With Care\") that this is how your new teacher intends for the two of you to travel, and what you can make out of a shipping label on the top indicates it won't exactly be first class. \"You're mailing us all the way to Germany?\" You shout. He must be completely insane. And since when could dangerous animals be shipped like a Christmas gift?<br>\r\n<br>\r\nYou can see him sigh all the way from here, as he slides down the girl's arm to stand on top of the box. \"Not exactly, hatchling.\" You hiss at this title, but just get a confident grin in response. Whatever you were going to say in protest is lost as you realize that it's more trouble than it's really worth. \"Now, what we use is a service which specifically transports wild animals over seas. It's usually used by human nons to carry zoo animals and whatnot, but a few witches started using it as a cover to ferry less mundane creatures around. It's not exactly the height of luxury, but they're fast and inconspicuous.\" The girl set the container down on the desk, and Arik slid off it and onto the wooden surface as she opened up it. \"Marisa, if you'd please put my new apprentice inside. We don't want to be late for the next flight out.\"<br>\r\n<br>\r\nMarisa hesitates, but nods, taking one last look at you. You avoid looking back, those green eyes far too unnerving at the size they are. Suddenly you feel her lips touching gently against the back of your head. You freeze instinctually, but can't help blushing from the gesture. \"Good luck, David,\" she whispers, far quieter for you than she probably intended with how little impact her breath of a sentence had on the air. Still you had heard it, and you appreciated the sentiment. With nothing else to say between you, she lowered her hand into the box, letting you slide off on your own.<br>\r\n<br>\r\nBefore you have a chance to consolidate your tail underneath you, Arik climbs inside the box with you. It's strange feeling the weight of his tail on top of yours in several places, but not as uncomfortable as you would've thought. As the girl closes the box with the sound of plastic seals, you maneuver your way to one of the air holes, looking out at Marisa one last time. You hope this wasn't a mistake.<br>\r\n<br>\r\nIt's several more minutes of being jostled around before Arik's assistant settles down somewhere to wait for the people picking them up. In the interim, you've learned that the girl is named Amelia and she's Arik's servant, part of some isolated village of nons that serves nagas because of some ancient tradition-agreement-thing. You still aren't clear on the details, but aren't sure you're comfortable with the idea of a group of humans who sound very much like slaves to this more powerful species. \"Your species, your power,\" a nagging thought reminds you, though you do what you can to ignore it. At any rate, she doesn't speak English, so it's not like you'd be able to ask her about it. <br>\r\n<br>\r\nYou continue to chat idly about what things will be like for you now, though Arik seems unwilling to give you a straight answer. Eventually you give up and wait quietly until you feel the rumble of a large truck. You vaguely see Amelia stand up as a gruff male voice addresses her. You don't hear her say anything, but moments later the box is being lifted up again, and noticeably less carefully put somewhere with very little light streaming through the openings. You notice the extreem temperature difference at once, the cold seeming to sap your energy, even as a harsh rumbling starts all around you, making you nervous. As you look toward Arik, you see him pulling off his skin-tight black shirt. \"What... What are you doing?\" You ask in shock, even as your eyes run over his fit torso, the sight making you feel a little (what you continue to tell yourself is) sick in the pit of your stomach.<br>\r\n<br>\r\nHe looks at you dully, barely awake enough to give you that smirk you hate so much. \"The warmth of the potion in this shirt will keep me awake if I leave it on. Spending the half-day it will take up to get there asleep will make the time pass quickly. I'd suggest you do the same... unless there's something you think we could do to pass the time.\"</span></div></div>",
            "created":1358621820,
            "id":1511663,
            "title":"Not Exactly First Class"
        },
        "1512":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Is a mermaid too, floating in the water next to you.",
                "Is huge! You're floating in a fish tank on one of her shelves of pets.",
                "Is standing above you, on the edge of the pool you're in."
            ],
            "content":"<div class=\"\"><div> <span>\"What... What happened?\" you mutter as you look down to where your legs used to be. Instead, a slightly reflective beige and red tail occupies their place. The thin fins at the end and coming off the sides form that familiar shape of a fish tail as seen on many depictions of mermaids. You try to move your legs anyways, and only cause the tail to flop a little uselessly. So not only are you a girl now, you're a fish too. Wonderful.<br>\r\n<br>\r\n\"I'm not entirely sure...\" you hear Marisa say in response. She's sitting on the floor next to you, a variety of old books spread out around her. You try to peek into them, and aside from some diagrams of plants and unusual shapes, you can't understand anything. \"I performed the spell exactly like the book said. There definitely wasn't a part about you turning into a fish. My only theory so far is that your body couldn't handle my magic, so it made you something that could. Why that would be a mermaid, I can't tell you. I suppose if one of us had a distant ancestor that was a merfolk...\" She waves her hands in the air, shrugging. \"It's all just speculation, really.\"<br>\r\n<br>\r\n\"I don't care why!\" you snap, your fin coming down hard on the floor. \"Just fucking fix it!\" Marisa looks taken aback, and even you are a little surprised by your outburst. You've never really had a short temper before, though under the circumstances you suppose it's not entirely unreasonable to be upset. Still, you feel more irritable than usual, probably because you feel absolutely miserable. Tired, hot, thirsty, heavy. You frown a little, wondering about this last feeling. Just how much does that tail weigh? Even your breasts, as modest as they may be, feel heavy hanging off to side. You whimper softly and turn to lay on your back.<br>\r\n<br>\r\nA moment later, you feel a tickle on your face, opening your eyes to see Marisa leaning over you. \"Are you alright?\" she asks, looking almost scared. \"David, answer me!\" You wonder why she's suddenly so concerned when she wasn't less than a minute ago.<br>\r\n<br>\r\n\"Fine,\" you mutter, coughing a little with the dryness of your throat. \"Just a little... sick. Probably just getting used to all that magic you forced into me.\"<br>\r\n<br>\r\nYou feel a cool hand on your forehead that all too quickly leaves. \"David! You're practically on fire! That's not fine or even a little sick. There's something serious wrong with...\" Her eyes widened as you began to close yours again. \"Shit! Shit shit shit! How could be such an idiot? You're a fish, you need water!\"<br>\r\n<br>\r\nIt takes more effort to speak this time, but you manage to murmur something. \"But I can... still breathe... air...\"<br>\r\n<br>\r\nYou feel her hair move around your face, probably making some sort of gesture. \"Yes, but that doesn't make you a land animal. Your whole body's drying up. We need to get you into some water immediately, hold on.\" You feel her icy hands on your shoulders as she speaks in that otherworldly language for a moment.<br>\r\n<br>\r\nThe next thing you know, you're weightless somewhere that feels a little cool but much more comfortable than where you were before. As you open your eyes to look down at yourself, you quickly realize you're floating in water. You panic, holding your breath for a moment before remembering that you're a mermaid now. Taking a deep breath experimentally, you marvel at how you don't feel your chest move. Instead, you feel an odd sensation in the sides of your neck. Bringing a finger to it, you slide the digit across the little folds of skin that you conclude to be your new gills. This was so weird! At least you don't feel sick anymore. Being in the water felt great, and you can't help doing a little flip experimentally. With the water rushing past you, you realize that you've lost your shirt. <br>\r\n<br>\r\n\"Looks like you're feeling better. That's good. Wouldn't want my apprentice dying on me, even if she is a fish now.\" You quickly cover your chest and look up, searching for Marisa. She...</span></div></div>",
            "created":1330491600,
            "id":1286716,
            "title":"Fish Out of Water"
        },
        "15122":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Friendly little goldfish, about your size with bright yellow scales.",
                "Angry-looking black koi, at least twice as big as you."
            ],
            "content":"<div class=\"\"><div> <span>If you had been standing on dry land, you probably would've fallen back on your rear end in surprise. Floating as you were, all that happened was a quarter of a flip before righting yourself. Marisa's face looked terrifying. From the top of her head to her chin must have been as long as six times the length of your whole body. Not to mention the effect of seeing her distorted through the semi-reflective glass. You swim forward a little, braving the monster in front of you to reach out and touch the glass, touch the reflection you'd rather not see. Marisa smiles weakly, probably trying to look compassionate, though it's hard to tell at this scale. \"Sorry, David. I had to act fast and this was the first place I could think of to put you. Don't worry, though, none of the other fish in there are predators, so you'll be safe... even if I did accidentally make you smaller than all of them.\" Your eyes widen as you hear this, but she just shrugs it off. \"Like I said, I was in a hurry. I'm just glad I got you into some water in time.\"<br>\r\n<br>\r\nYou glare at her angrily. Her magic has been making your life more and more miserable and she doesn't even seem to care! You open your mouth to protest, but find you can't speak. Try as you might, you just can't force the words out of your body. All your anger fizzles in your silence, turned into frustration and panic.<br>\r\n<br>\r\nMarisa seems to realize what you're trying to do, leaning closer worriedly. \"David, calm... calm down! You won't be able to talk while you're underwater, no mermaid can. There's no air to move through your voice box. Just relax, okay?\"<br>\r\n<br>\r\nYou do relax somewhat at hearing you aren't completely mute. Still, you can't just float here silently while she watches you like you're a goldfish. As fast as you can get your tail to move you, you swim up to the surface. You're a little disappointed to find that the tank isn't open, only a small sliver of air between the water and the black covering. \"You can't just keep me here!\" you yell, head pressed to the ceiling as you bang on the glass. \"Make me big again, put me in a pool or something!\"<br>\r\n<br>\r\nShe shakes her head. At least she can hear you, though! \"Sorry, that would be way too risky. You might get discovered. This way I can keep an eye on you, and you're so small you can hide from anyone else who might be looking. No, I might've put you in there in desperation, but I still think it's the best plan.\" You start to object again, but she doesn't seem to be listening anymore, checking her watch. \"Look, it's getting late. I'll check on you tomorrow morning, and I promise I'll spend my free time trying to figure out what happened. For now, just relax. Being able to just float underwater with no responsibilities sounds like a vacation to me.\" Faster than seemed possible, she was gone. You suspected she was still in the shop, but it was difficult to see too far outside the tank with your reflection in the way.<br>\r\n<br>\r\nSighing hopelessly, just let yourself sink back into the water. Even for such a short period of time, breathing air had made your throat sore, so it was a relief to go back to using your gills. At least that was one nice thing about all this. What wasn't nice was looking out at the rest of the tank. Despite knowing it was all fake plastic, the strange objects and plants littered about were quite imposing to you, not to mention the size of the tank itself. Just how small were you? Lost in thought, you don't notice something nearby until you feel something bump into your back. Letting out a soundless scream, you turn around to face whoever touched you. It's a...</span></div></div>",
            "created":1331874000,
            "id":1295914,
            "title":"Little Fish, No Pond"
        },
        "151221":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A large and unfriendly-looking octopus waiting for you.",
                "An air bubble above you, with strange noises and lights coming from it."
            ],
            "content":"<div class=\"\"><div> <span>You think about swimming away. The fish is barely as big as you are, but that still makes it the biggest fish you've ever seen. Except... you don't actually feel afraid of it. It's just a fish, after all, and not even something dangerous like a shark. You do feel a little uneasy realizing that it's just a common goldfish, which gives you a pretty clear idea of just how small you are. Small enough to put you in a plastic bag and give you away at the fair, you imagine with a shiver. You know that won't happen, though! Marisa said she would fix this, and why would she bother lying about that now?<br>\r\n<br>\r\n\"Er... Excuse me?\" You freeze as you hear the voice of a young teenager, seemingly coming from the goldfish in front of you. That's impossible, though... isn't it? \"Are you alright? You shouted really loud when I touched you... and now you're really quiet... Did... Did I hurt you? I didn't mean to!\" For a moment, you think you see a distressed expression on his face, instead of the usual blank look goldfish usually had. <br>\r\n<br>\r\nSomething he said draws your attention more, though. He had heard you scream, even though you hadn't actually been able to? You frown at this, working your brain as hard as you can, not realizing as you start swimming in a little circle. After a minute you stop, turning to face the goldfish. \"You can understand me?\" you mouth, watching him hopefully.<br>\r\n<br>\r\nHe just stares back, looking confused. \"Of course I can! I dunno why you're so surprised. Can't all mermaids talk to fish? That's how they work in all the books and movies and stuff! Maybe it's not true for real ones. I've never actually met a real one before! So maybe we can only talk because I'm a... a family, no... a familiar! We can all talk to each other, and sometimes people! If they listen... You'll listen, though, because you're a mermaid! You're really pretty, too...\"<br>\r\n<br>\r\nYou were already underprepared for how much talking he was going to do, but what he says last you really hadn't expected. With how light you felt underwater, you had almost been able to forget that you were a girl. Hearing this complement, though, the truth comes back to you: not only are you female now, but you're naked. Blushing, you quickly cover your chest, so suddenly that it sends a light jolt of pleasure through your body. You feel a tingling from around where your tail connects to the rest of your body, but manage to resist investigating further. You realize that the goldfish is staring at you, so you look away, muttering, \"So, what is it you wanted me to listen to?\"<br>\r\n<br>\r\nThe fish frowned, looking like he was trying hard to remember. \"Er... Oh! Me and the others, we all used to be human! That woman changed us into fish!\" Your eyes widen a little at this discovery, though you're hardly surprised after everything the witch has done to you. \"My name's Evan, by the way. Everyone calls me Splash, though. You can too, if you want! What can I call you?\"<br>\r\n<br>\r\n\"I'm David,\" you tell him, then instantly regret it. This was embarrassing enough without people knowing you were a boy before. \"Er... I mean... It's not really that, I just...\"<br>\r\n<br>\r\nThe goldfish giggles, making you go silent. \"I'm gonna call you Coral, cuz your skin keeps turning red.\" You're not sure you understand this logic, but you don't argue. Having a silly fish name is far less embarrassing than the alternative, and it's only temporary, right? \"You're lucky I found you. One of the others might've given you a name that's less pretty. I'm really lucky too. No one else has ever found a newbie that's a mermaid!\" You're still not sure what he's talking about, so you just nod along. It's not like you'll need to really know any of this stuff once Marisa gets you out of here. \"Oh! That reminds me! I need to take you to the boss, Coral. It's part of the rules. If I don't, we'll /both/ get in trouble.\"<br>\r\n<br>\r\nBoss? Now you're really confused. What sort of fish tank has a boss. Before you can ask any questions, though, Evan is already swimming off. Not wanting to be left behind, you follow as quickly as you can, discovering that you're actually faster than the goldfish. He takes you to a large plastic rock, which likely would've looked big even if you were normal size. There's an opening, with plastic seaweed covering it. Easy enough to get through, but difficult to see through. You feel the goldfish push you gently. \"The boss is in there. I, uh... can't go in with you, though.\" You suspect this is a lie, but don't call him on it. It doesn't make you feel any better about meeting this boss, but... you're not some little goldfish, not really. You're human, with human strength and bravery and... all that other stuff you're sure you have somewhere.<br>\r\n<br>\r\nAfter several deep \"breaths\", you finally swim through the plants. On the other side, you see...</span></div></div>",
            "created":1333083600,
            "id":1305933,
            "title":"Friendly Splash"
        },
        "1512211":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Let Alexander be your familiar.",
                "Refuse his offer."
            ],
            "content":"<div class=\"\"><div> <span>You have to do a double-take, your eyes still adjusting to the dim interior of the plastic shelter. Sure enough, though, you can make out the movement of tentacles all around you, extending from a large mass slumped against the opposite wall. Its eyes appeared to be larger than your whole body, and they were clearly glaring at you. With a shiver, you start swimming backwards, wanting to get out of there as soon as you could. As you near the seaweed-covered opening, however, you instead bump into something soft and somewhat sticky that twitches as you make contact. Your eyes widen, but before you can swim away, the appendage wraps itself tightly around your waist, squeezing your midsection uncomfortably. Despite your struggling, you find yourself moving toward the head of the octopus.<br>\r\n<br>\r\n\"Well well... What sort of delicious morsel has Splash brought to me...\" The voice you hear is male, but it sounds ragged and creaky, like it's the oldest thing you've ever heard. You spend less time thinking about what he sounds like than what he actually said, though, pounding on the tentacle to try and get it to let you go. \"Don't bother, little mermaid,\" the ancient voice said. \"I've eaten fiercer fish than you, and they only gave me a couple scars. Just calm down... what was it Splash named you? Coral? What a pretty little name for such a pretty little pet.\"<br>\r\n<br>\r\nThis catches your attention, as you stop your useless struggles to look at him in confusion. \"How... How did you know what Splash called me? We were on the other side of the tank, and he sure didn't tell you...\"<br>\r\n<br>\r\nYou're almost positive that the octopus is smirking, despite thankfully not being able to see any sort of mouth. \"I know a lot of things, Coral. Not only who you are... but what you were.\" With this remark, you feel the tip of the tentacle slide against a slit in your scales, causing you to shiver as your face turns red. \"I'd feel sorry for you, but I'm sure you look much better this way. I'm sure you're just as delicious, regardless.\"<br>\r\n<br>\r\nYou panic once again, shouting at him as you struggle to get free. \"What... What are you doing? Who are you? I... I though Marisa said there weren't any predators in here! Please don't! Please don't!\" <br>\r\n<br>\r\n\"Ug, how I wish you were actually talking so I could shut you up. I'm not going to eat you unless you make me, as tempting as you're already making it. Now stop moving and maybe I'll answer some of your questions.\" He gives you an \"encouraging\" squeeze, and you stop, looking at him fearfully but also curiously. \"Good girl, Coral. Now, let me introduce myself, properly. My name is Alexander Coriander Lalonde. I was made into a familiar by Marisa's mother long before you were born. The damn witch... Regardless, I've since learned to use the tank's magic for my own purposes. You see, these cages are enchanted so that if any nons look at them, they won't notice any fish acting weird. It took some doing, but I managed to cloak myself in a modification of that magic. If her daughter ever knew about me, she's more or less forgotten by now.\" Again, you feel like he's smirking, despite no view of his mouth. \"You're not too fond of the younger witch, are you, Coral?\"<br>\r\n<br>\r\nNodding, you frown. \"She turned me into a mermaid then threw me into a tank like a goldfish. Yeah, she's not one of my favorite people right now.\"<br>\r\n<br>\r\n\"Then may I make a suggestion? If you made me your familiar, we would both be stronger for it. We could escape and I bet I'd be able to help turn you back into what you're supposed to be.\"<br>\r\n<br>\r\nYou think on this a moment. Marisa definitely didn't give you the same chills this octopus does, but he actually seems like he wants to help you, whatever his alterer motives are. You quickly decide to...</span></div></div>",
            "created":1336712400,
            "id":1334983,
            "title":"Meeting the Boss"
        },
        "15122111":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "\"Take you with me.\"",
                "\"Make it so Marisa won't even know you're here.\""
            ],
            "content":"<div class=\"\"><div> <span>You nod weakly, a little afraid of refusing, not only worried you'll be passing up your only chance to escape, but also afraid of what Alexander might do to you if you don't say yes. \"Al-Alright, I'll let you be my companion. Are there... any magic words I need to say, or...?\"<br>\r\n<br>\r\nHe seems to let out a sigh. \"No no, nothing so convoluted. I just need you to open up your mind and your magic to me so that we can become connected. It's perfectly painless, and I assure you, you'll probably even feel better after it.\" You're not so certain, but you do your best to close your eyes and relax, trying not to resist any sort of outside force. Soon enough, you feel your body become more at ease in his grip. \"Yes... Just like that...\" When you open your eyes, you realize more than just that is happening, though. He's gotten smaller... younger, you realize. As for you... you watch in shock as your tail starts splitting, again and again until there are eight long tentacles extending from your lower body.<br>\r\n<br>\r\n\"What... What happened? Now I'm an octopus? You didn't say that was going to happen!\" You try to fold your arms, but somehow get confused with all the other appendages you have now, causing a couple of your tentacles to flail a bit.<br>\r\n<br>\r\nHe pushed himself up off the floor, much more mobile now that he was considerably younger. \"I didn't think it was relevant under the circumstances, but mermaid witches become a reflection of the species they take as their familiar.\" He pushes you aside, finally letting go of you. \"Mmm... Feels so good to have some real power again. And I can feel that Tanner spark. Should make this really simple.\" He glances at you. \"So much potential. Glad you didn't have the chance to become a real witch, or else you might have actually been able to cause some trouble.\"<br>\r\n<br>\r\nYou're about to ask what he means when he suddenly darts out of the hut. You feel sick to your stomach unlike anything you've felt before. Some sort of sign of how bad a mistake you made? You try to follow him, but it takes you several minutes to figure out how to use your tentacles to propel yourself. All the while, you keep getting odd feelings in your stomach. When you do finally make it out, you look all around to see if you can find the octopus, but he's nowhere in your range. At least... until you notice a face peering in at you from the outside, a male face. You now realize why you felt sick. That was him using your magic to change back into a human.<br>\r\n<br>\r\n\"Well, Coral, I have to thank you for so generously allowing yourself to become /my/ familiar. I never would've been able to free myself without your help. I have a little problem, though. You see, I have access to all your magic as long as you're alive, but... if Marisa finds out what happened, she might be able to break our connection. We don't want that, now do we? That's why I'm going to...\"</span></div></div>",
            "created":1343192400,
            "id":1389055,
            "title":"Familiar's Familiar?"
        },
        "153":{
            "author_id":"magiccat",
            "author_name":"MagicCat",
            "choices":[
                "\"You need to stay here, so I can figure this out and change you back to a human\"",
                "\"Wood Elves go for high prices in the magical black market, you'll make me rich\"",
                "\"I've always wanted to study a Wood Elf, and I can't just give up this chance\""
            ],
            "content":"<div class=\"\"><div> <span>As you sit there, you start to feel the warmth once again, although this time, only around your ears and in the base of your spine.  You start to feel a sharp poking at the base of your back, almost as if something is poking out from inside of you.  You attempt to look back, but the pain is simply too much, and you keel over in pain, crying out as something shoots out of your back.  Suddenly, you feel like your ears are being stretched out, and as your ear is stretched, you find yourself hearing more and more, and somehow being able to hear things that seem too distant to be audible.<br>\r\n<br>\r\nYou reach a hand up to one of your ears, and it feels normal, until you reach the top, where you feel a pointy tip, like an Elf's ears.  You reach back to scratch the area in your back where you experienced pain, and realize something has grown in the spot.  You look back, only to see a tail sticking out of your back, just above your feminine ass.  The tail stiffens up and sticks out straight, like a surprised dog's tail, and you realize you can control it.  You fiddle around for a bit before getting the hang of it, and for a moment forget about your predicament in your curiosity. <br>\r\n<br>\r\nHowever, the moment vanishes as Marisa hands you a mirror, and looking into it you notice that you look like one of the elves from Lord of the Rings.  On the bright side, your athletic build seems to match the one they had in the series, and you feel healthier than ever before, and like you could sprint for miles.  You look up at Marisa, and she explains that you've become a Wood Elf, a common creature in the magical world, that often disguises itself as a monkey to avoid being discovered by humans.<br>\r\n<br>\r\nYou get distracted in playing with your tail again, and don't notice as Marisa chants another spell, much more confidently this time, as if she knows what she's doing much better than before.  Suddenly, a cage appears around you, and you attempt to slip through the bars, but are knocked on your back by an electric shock.  You look up at Marisa and ask why she would trap you, and she responds quickly.</span></div></div>",
            "created":1585709100,
            "id":2811304,
            "title":"It's focused on the base of your spine and ..."
        },
        "155":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A strawberry bush.",
                "A venus flytrap.",
                "A sunflower."
            ],
            "content":"<div class=\"\"><div> <span>You try with all your might to try and localize where the feeling of warmth and change is most focused, but what‘s perhaps the most horrifying of all is that it has no center: Your whole body is the focus. You find yourself less and less able to move, as the pain and shock courses through your body. You fall over like a fish out of water, closing your eyes against the changes you can start to feel, but are powerless to stop. You can‘t even open your mouth to protest, and all you can see are Marisa's legs as she leans over to try to get a good look at you. Whatever is happening to you, there's no stopping it now. Your feet and ankles have gone numb, and the feeling is spreading upward towards your knees. You can‘t see what's going on there, but you hear Marisa's gasp, and you know whatever it is can‘t be good.<br>\r\n<br>\r\nThat theory is confirmed as you struggle with all your night to make your body do something, and you manage to twitch enough to look over at your legs, which have vanished into your clothes. Of course... that feeling is universal as the entire room is growing all around you. It feels like going down in an elevator, except that everything else stays the same size as you shrink. It begins to become so rapid that the room vanishes entirely in the blanket of your rough shirt, and you are able to see no more. \"H-help!\" You croak, though you're so quiet you would not be at all surprised if Marisa could not hear you. Thankfully, you do not wait for long. A hand reaches into the shirt, and you find yourself lifted, her fingers wrapping gently around your arms and holding you suspended. You close your eyes, whimpering loudly as you swing freely over empty air, and you feel the air wrap around you in l0,000 places you didn't even know that you had. Then you're set down on some sort of dirt, and you can feel yourself sinking into the surface. It’s a wonderful feeling. You reach down, down, down as far as you can go, spreading yourself and holding yourself there as securely as you can. It's only at this point that you open your eyes, looking down to see that you're now standing in a huge clay pot. Of course being naked doesn't help anything, and your face goes bright red as you're confronted with the totally unconcealed reality of your new sex, protruding generously from your body. You can now see that the freckles go all the way down to your knees... but they're dark green instead of tan now. Your whole body has changed a light shade of green, except for the intimate bits, which are significantly darker. Of course this is hardly your first concern at the moment... you've been changed into a plant!<br>\r\n<br>\r\nMarisa seems to sense your distress, because she holds you up to her face, which causes you to cower as you look into her massive green eyes. \"David?\" You manage to nod to show you can understand her, though you can‘t say where the will to do it comes from. \"Don't worry! It wasn't supposed to do this! I can fix it... somehow!\" She walks over to a nearby mirror, twisting your whole world around so you can get a good look at yourself. To your utter astonishment, you have become...</span></div></div>",
            "created":1343538000,
            "id":1392692,
            "title":"Going Green"
        },
        "1551":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Beside the register in the light from the window.",
                "On the front stoop of her house.",
                "In the garden of one of her friends."
            ],
            "content":"<div class=\"\"><div> <span>You look into the mirror with huge eyes, trying to understand exactly what you have become. Your body is at the center of a healthy strawberry plant, with three stems of which you are the center and tallest, about eight inches tall. Your human body vanishes into the ground just below your knees, and you feel roots beneath, twisting and turning their way through most of the pot, even poking their way a little out of the little ventilation hole. There are two smaller stems that emerge from the dirt, which to your amazement look exactly like you; except that they are younger and smaller, and growing sideways. Emerging from your human bodies at random are numerous smaller twigs and little shoots covered with numerous smaller leaves, growing every which way, though none grow out higher than your waist. Some of the branches have little buds, and many have small pink flowers. Your hair is the one part of you that has stayed exactly the same, an even brighter red than all the flowers. One of your younger copies moves, looking up at you; you suddenly realize that you can see your adult self, blossoms and all, and one of your younger versions too. Somehow, you now have three bodies. One is an adult, one about thirteen, and one about eight, but all are girls and all three are absolutely terrified. You try to talk, looking up at Marisa and squeaking in fear and frustration, and all three bodies squeak in unison, though some are higher-pitched than others. \"Change me back! Change me back change me back change me back!\" The longer you yell the more out of sync all three of your little bodies become, until they're all speaking independently. You aren't sure if it's the magic or merely your mind gradually adjusting to the new perspective, but you can start to tell the difference between each one. Three sets of arms. Three pairs of eyes. Three different hairstyles, each longer than the last. All three twisted together with little dresses of thin branches. Well... in the shortest body's case, she's up to her shoulders in the branches from your bigger two bodies, though she doesn't seem to mind that at all. Or... you don't seem to mind it. You still can't quite figure out if you're one person or three. Maybe both?<br>\r\n<br>\r\n\"I will!\" Marisa insists, though there is a tone of distinct doubt in her voice. You don't like that tone at all, particularly hearing it three different times, almost in unison. That is going to get really distracting. \"Look,David, if I could just wave my arms and undo the spell I would! But it's not so simple as that. The spell that changed you gave you magic... remember, that‘s what we were trying to do! Magic can't be un-given. Once you have it, you have it for life. Spells that transfer the Spark like that are all permanent, including the one I used on you. But... it wasn't supposed to make you a bush, so maybe I can just eliminate the side-effects!\" She grinned, trying to look optimistic. \"But... in the meantime. I can't hold you until I figure it out. Where will you get enough sun...\" She thinks for a moment, before deciding to leave you...</span></div></div>",
            "created":1343538000,
            "id":1392707,
            "title":"Drawing the \"Berry\" Short Straw"
        },
        "15511":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "A young naga teenager is opening up shop for the morning.",
                "Another young witch has come with gardening tools to help you."
            ],
            "content":"<div class=\"\"><div> <span>\"I've got an idea!\" She carries you back into the front room, a motion that‘s so fast all three of your little heads get vertigo, and you can't really tell up from down as long as she keeps moving. When she finally settles down, you're sitting beside a plastic rectangle a few inches shorter than you in your pot, though it's at least twice as wide. A register... You're sitting by the checkout counter. Your biggest body, the one that you can concentrate on the easiest, is facing directly out. The youngest body is facing out towards the window, and the middle body is facing back behind the counter. How that‘s possible when a few of your bodies were facing in before you can't tell, but the fact that your dirt has been agitated might be some clue to you. Marisa is standing in front of the register with her jacket on and a backpack over her shoulder, and is in the middle of talking to you as though you had just been having a conversation. \"-the window is the first place in the shop to get hit by the sun. This way you will be able to meet my clients. Maybe one of them can help you. If not... I'm going to get some fertilizer to help you grow big enough to use the register. Don't think that just because my spell may've not worked quite as we expected means that you get a free ride around here! Even plants have to work when Witches are involved.<br>\r\n<br>\r\nYou want to reply, to argue, to ask how in the world things have changed so fast, but by the time you've collected all your thoughts... and there are many more than usual... she's gone and you're alone in the shop. \"Well, this sucks,\" your oldest body says, looking down and running a finger down her front, stopping at the \"dress\" of tiny strawberry shoots.<br>\r\n<br>\r\n\"It could be worse,\" a small voice reminds you, echoing off the glass before you hear it. You realize you just said those words, but at the same time, you don't feel quite the same emotions as the small version of you does, even though you can see your own bigger reflection through her eyes. Exactly how does that work? How can you be somebody and not be them? That question will have to wait, you suppose.<br>\r\n<br>\r\n\"Look, can I just rest? It's cold in here. The night will go faster if I sleep.\" That was the teenage voice, whom you can't help but agree with completely. The morning comes, though you don't remember any sleeping. The instant you stopped talking to yourself though, the time just started to blur together. The next moment, someone was unlocking the door and coming inside. But to your horror, you realize it isn't Marisa. Instead, it's one of her employees...</span></div></div>",
            "created":1343538000,
            "id":1392721,
            "title":"Waiting by the Window"
        },
        "155112":{
            "author_id":"psiana",
            "author_name":"Psiana",
            "choices":[
                "Marisa opening up the shop.",
                "A part-time employee of the shop coming in to get things ready for the day."
            ],
            "content":"<div class=\"\"><div> <span>You look up with your biggest set of eyes. She looks very different than Marisa. She's younger, with red chides and bright green eyes. She's got a freckly face like Marisa, but not nearly as dense as the other witch's face is. She is wearing a pair of overalls and a plain white tank top and is carrying a little bag of gardening tools. She looks friendly, but so very big! Looking up at her with your biggest body is very disorienting and seeing her reflection in the window with smaller eyes is even worse. Still, the girl doesn't seem to mind your presence there. As a matter of fact, she has eyes only for you. She can't be older than thirteen, and her expression is not unlike a child eager to try something for the first time. \"Well look at you, little Berry,\" she says, smiling down at you. \"Marisa said a spell had gone wrong. I can see that she was right. Now… you don't have any idea what your magical abilities might be, would you? Marisa is sure that you still have some, and I agree.<br>\r\n<br>\r\nShe pulled on a pair of thin gardening gloves. \"You don't mind if I take a look at you, do you…\" She pauses for a moment. \"What's your name, Berry?\"<br>\r\n<br>\r\n\"I'm not a berry,\" you say, though you don't say it with much enthusiasm \"I’m David.\" You fold your arms across your chest, though you don't feel self-conscious about being \"naked\" so much as about being entirely in the power of this small, feeble child. She does look friendly, though. There's something about her that puts you at ease. At least until she moves closer, towering over you.<br>\r\n<br>\r\n“David. Well David, you're a common strawberry plant. Subtropical and temperate, semiannual. Very popular, very sweet. By the looks of you, you're probably gonna fruit all year round, if there was anything in here to pollinate you. You don't feel... magical, at all?\" At a shake of one of your heads (a proud accomplishment), she reaches in with a pair of small clippers and trims off one of your leaves. It hurts sharply, but the pain fades almost at once. You still glare at her. That hurt, and she didn't even ask! The girl puts the leaf in her mouth, working it around for a moment and entirely ignoring your displeasure. \"I don't taste any magic. It's probably in the fruit.\" She frowns, spitting the leaf on the ground. \"Okay David, I’m going to have to trim you. You’re too dense, and you won’t grow well this way. I promised Marisa I'd have you a foot high in three months. This means we’re both going to make sacrifices.\" She seems almost too eager as she takes a little pot of dirt out of the tool bag, along with a small shovel. The more tools she removes the more fearful you begin to be. What exactly is she going to do? \"Don't worry: I’ve been gardening my whole life. I know what I'm doing.\"<br>\r\n<br>\r\nWhat comes next is the most horrible sensation you've ever felt since walking into this shop. The witch removes many of your branches, which grow in an unruly leafy mess all through the plant. She thins you out, each snip feeling slightly more painful than the last. That is not the worst of it, though. Each pain feels like getting a chunk of hair ripped out... by then she takes her little shovel, digging around the small, teenage you. She barely has time to protest... all three of you are screaming... and she slices through the roots, removing her main stem. You feel a jerk at your insides, and for a second it feels like you can't breathe. The pain is so intense that for a minute you blackout entirely. When your senses return, you’re looking through the eyes of the child at the horrible scene. Your biggest, oldest body has been cut away completely and is lying dead on the ground like trash. The pot next to you has the teenage version of you in it, a single terrified-looking stem whimpering and crying. You’ve been cut back to a single young sapling with short red hair, a sapling with a few small branches coming out of your sides and further down your stem, but no more. There is less soil now, so your toes vanish into the ground, which gives the illusion that you are bigger than you are. Your toes are white instead of green though, and you know they used to be a part of the roots. Strangely, you don’t feel pain anymore. As a matter of fact, you feel strength flowing into you from below. You're only one small, young stem now, with almost all the roots of the whole plant. There's something different about the soil too, as though you can see little sparkles of light every now and again. Something has been mixed into the soil, and it tastes so good  you almost can’t feel the soreness in almost every part of your body where parts were trimmed.<br>\r\n<br>\r\n\"There!\" The girl seems satisfied, and she leaves a moment, muttering something about getting a trash bag for all the mess she's made. This leaves you with a few moments to look into the eyes of your older copy, the girl looking so scared you can’t help but pity her. Somehow both of you know she is going to leave and you are staying - you wonder briefly how you might feel it you were being taken away to live with this crazy plant-witch. You reach out, leaning with all your might, and take her hand for a moment. No words are spoken, but strength is passed all the same. You are too weak to speak from all the cutting, but your eyes speak message enough. \"Good luck,\" they say. “I won't forget you.\" You're too young to have offered advice if you could. Everything seems so much more complicated than it was, everything harder for your little brain to wrap its way around. You hope removing two of your stems didn't take away two-thirds of your intelligence.<br>\r\n<br>\r\nThe witch comes back to clean up all the David trimmings, sweeping them into a trash bag and muttering to you as she works. \"I've used my special fertilizer. It should keep you growing much faster than normal. I'll have to come in to trim you every week or so, but otherwise you should be a foot and a half in three months. Big enough to use a register.\" She grins, tossing the trimmings into the trash and picking up the other pot. Your grip with the other David is broken, and you can see her crying silently. \"Cya, David. I’ll be hack to check on you next week.\" And she’s gone, leaving you alone in the shop again.<br>\r\n<br>\r\nThe next person you see is...</span></div></div>",
            "created":1358269140,
            "id":1509192,
            "title":"Just a Few Little Cuts"
        }
    },
    "info":{
        "author_id":"psiana",
        "author_name":"Psiana",
        "brief_description":"An average college graduate just looking for cash but the job has a surprising requirement",
        "created":1330195920,
        "description":"<td align=\"left\" class=\"norm\">This is a story about magic and transformation. The reader takes on the role of a college graduate looking for work. His work takes him to a magic shop, and eventually on a crazy transformation-laden journey as he's recruited as a witch's apprentice. This alone causes one unalterable transformation from male to female, which the character must then learn to cope with while facing further mishaps.<br>\r\n<br>\r\nThis description may seem a little lacking, but I encourage you to read the story proper. Most of the chapters posted by myself should be of what I consider high quality, with what I hope is an interesting spin on this genre.<br>\r\n<br>\r\nAs for rules, I'm fairly tolerant of most things. The only strict rule is that the character can't be turned back into a male. All other transformations she may encounter can be altered as fits the story. That's the other more loosely defined rule. Please keep the story making sense. No sudden unexplained shifts in character, or completely ridiculous events happening, please. One final thing, though it's not really a rule, is that I'm making this in collaboration with a friend of mine who doesn't have access to a computer, so I will be reserving pages while they work on their chapter, adding it when I receive it.<br>\r\n<br>\r\nOther than that, I hope you enjoy the story and possibly even contribute!<br>\r\n<br>\r\nAlso, because the character limits were giving me trouble, the first part of the story is posted here:<br>\r\n<br>\r\n<br>\r\nThe sun is near setting as you approach the last stop on your job search. Looking up at the quaint wooden sign engraved with “Eve’s Hollow” in fanciful cursive lettering, you can’t help but wonder how a place like this could stay in business when so many of the stores around it had already closed down. After all, how much business could they have as a shop for costumes and Halloween decorations? As far as that particular niche of the market, though, they certainly seem to have it cornered. Despite being part of the local strip mall, the store had appeared run down for as long as you can remember, even when the stores around it were still in business. The door’s made of rough wood, and has various charms hanging from it, the windows are impossible to see through because of dust, and strange plants and mushrooms grow from the cracks between the building and the sidewalk. They really went all out with what they were good at, you suppose. <br>\r\n<br>\r\nEven the wanted ad you had found online was in theme. “Wanted: Witch’s Apprentice. All proficiencies accepted. In addition to training, duties include working the register, identifying and shelving potion ingredients, feeding the familiars, helping customers find the appropriate spell book for their needs. Knowledge in operating 21st century technology a must. Flexible hours. Compensation for time available in payment of choice.”<br>\r\n</td>",
        "id":1850624,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1585709100,
        "modified":1585709100,
        "pretty_title":"Witch's Apprentice"
    }
}