{
    "chapters":{
        "1":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "She wakes up in the morning, with no changes, yet",
                "She wakes up with an extra-hundred pounds!"
            ],
            "content":"<div class=\"\"><div> <span>Samantha Gerber walked home from a party, smiling at the thought of her conquests.<br>\r\n<br>\r\nShe smiled as she remembered when wide-loud Sally tried to ask Jason out, when Samantha walked up. The brunette then rubbed the redhead's belly, and it started to jiggle for a good five seconds. Crying, she ran out.<br>\r\n<br>\r\nLittle did Samantha notice the same girl in the bushes, with a  tranquilizer gun.<br>\r\n<br>\r\n\"Ow!\" yelled Rachel that second, and reached down to find that some pervert had fired a dart at her ass! <br>\r\n<br>\r\nGod! There were freaks in this world! Still, she didn't feel tired, and since she wasn't exactly of sound mind after a few bottles of booze, she wasn't too worried.<br>\r\n<br>\r\nShe  eventually got home, and went to bed</span></div></div>",
            "created":1086238800,
            "id":201581,
            "title":"After a night on the town..."
        },
        "11":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Investigate further",
                "Time for breakfeast",
                "Time for school",
                "Time to go shopping"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha woke up. She figuered the dart was a dream.<br>\r\n<br>\r\nShe then her normal routine, taking a shower, getting dressed. However, as she put on her jeans, they seemed a little tight. Her butt was a littler larger it seemed...\t</span></div></span></div>",
            "created":1086325200,
            "id":201686,
            "title":"Woke up this morning"
        },
        "111":{
            "author_name":"Lydia",
            "choices":[
                "Fake being sick... Mommy will understand!",
                "Go to school and just try her little hardest"
            ],
            "content":"<div class=\"\"><div> <span>Samantha shook her head and said to herself, \"This is just not right.\"<br>\r\n<br>\r\nWith her pants bearly fitting, she walked over to her bathroom scale and took her weight.<br>\r\n<br>\r\n\"A hundred and twelve?!\"she shrieked, \"I've gained almost like... five pounds! Oh, God, why do you test me so?\"<br>\r\n<br>\r\nShe walked back to her bedroom, pounding her feet along the way. How could this sort of thing happen to her? She had enough trouble as it was with boys and girls always being so jealous of her, but now this? After a minute or two of self pity, she changed into a pair of fashionable jogging pants and her boyfriends letterman jacket.<br>\r\n<br>\r\n\"God, I look terrible! I can't go to school like this? Whatever shall I do?\" she asked herself.<br>\r\n<br>\r\nOh, whatever shall she do?</span></div></div>",
            "created":1106370000,
            "id":233264,
            "title":"Why do bad things happen to such good people?"
        },
        "1111":{
            "author_id":"yankeesd26",
            "author_name":"Bigguy25",
            "choices":[
                "She's hungry and wants to eat",
                "she realizes she gained more weight"
            ],
            "content":"<div class=\"\"><div> <span>Sam asks her mom to stay home and her mom asked why and she responded \" I gained to much weight to go out into public.\" <br>\r\n\"Fine you can stay home for 2 days but thats it\" Her mom said<br>\r\n\"Thanks so much mom.\"<br>\r\nafter that whole talk with her mom she was gaining weight without anyone noticeing. Her Breast were larger, her ass was wider, her belly was starting to peak out just a little bit and her arms and thighs were jiggling.<br>\r\n</span></div></div>",
            "created":1128402000,
            "id":276606,
            "title":"Mom says ok"
        },
        "11111":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Go live with her aunt and uncle on the farm",
                "Tell her friends that she had a strange illness"
            ],
            "content":"<div class=\"\"><div> <span>Sam stayed at home for two days.  Her weight gain bothered her but she was hungry all the time.  She tried eating the stuff that was healthy but somehow everytime she opened the refrigerator, it was for ice cream or the leftover lasagna that she wouldn't ouch two days ago.  She was definitly fatter.  She had to borrow clothes from her mother.<br>\r\nShe was near hysterics after two days.  Her weight was up 20 pounds and her trim body was starting to look well rounded.<br>\r\n\"I can't go to school and let people see me like this.\" Sam sobbed.  <br>\r\nSam's mother had mixed feelings. Sam had always been so cocky about her body.  She flaunted it before here friends and the high school jocks.  She was always so careful about what she ate and how she dressed.  She watched her daughter sobbing uncontrollably and at the same time shoveling enough food down her throat to feed a starving village. What was going on?\" she wondered.<br>\r\n\"I can't have anybody see me like this.\" Sam sobbed between bites.  \"You have to help me.  I don't have anything to wear and I can't go back to school like this.\"<br>\r\n<br>\r\n\"I'll talk to your father.  Maybe he can think of something.\" <br>\r\nSam's mother left Sam with mixed feelings.  Maybe her husband would know what to do.<br>\r\nLater after her mom and dad had thought about the options they presented Sam with two choices</span></div></div>",
            "created":1274223720,
            "id":885325,
            "title":"She's hungry and wants to eat"
        },
        "111111":{
            "author_id":"sackboyno1",
            "author_name":"sackboyno1",
            "choices":[
                "Go to the restaurant.",
                "Go to the farm."
            ],
            "content":"<div class=\"\"><div> <span>Sam agreed with the first option and her mum and dad sent her to the farm,luckily it was only a short distance away so she decided to walk there to burn off a few calories.As she reached the farm she saw a new \"all you can eat\" restaurant across the street.She decided to...</span></div></div>",
            "created":1283792880,
            "id":951219,
            "title":"Go live with her aunt and uncle on the farm"
        },
        "1111111":{
            "author_id":"sackboyno1",
            "author_name":"sackboyno1",
            "choices":[
                "She likes this feeling.",
                "She doesn't like this feeling."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh I suppose a quick bite wont hurt\"Exclaimed Sam.She stepped through the big double doors and stared at the banquet of food.There were French fries,chicken nuggets,hamburgers,hot dogs,cakes,buns and any other fattening food you could possibly think of.She ammediatly sat down and stuffed her face with the fat dripping food....<br>\r\nAbout 1 or 2 hours later a waitress came and asked whether she was alright or not.Sam answered \"Yes I'm fine,but I was shot with a tranquillizer gun\"The waitress pointed towards a medical clinic that was also situated in the building.Sam rushed over(well walked quickly)over to the clinic and sat down next to the doctor.She explained what had happened to the doctor,then he brought out a scanner and put it over her ass.. The scanner read: width 43\" size HUGE and then in small letters at the bottom of the screen NO CHEMICALS DETECTED.The doctor told her that there were no chemicals and Sam replied \"so all this weight gain was just me\" The doctor had a blank expression on his face (not knowing that she had put on weight)\"well sorry doctor ive got to go,bye!\" Sam headed out to the farm but just before she knocked on the door,She looked down and noticed her button had popped of,then she pulled up her shirt and her belly flopped out and jiggled a bit...</span></div></div>",
            "created":1283794860,
            "id":951230,
            "title":"Go to the restaurant."
        },
        "112":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Investigate further",
                "Go to school"
            ],
            "content":"<div class=\"\"><div> <span>Samantha headed down to the kitchen.<br>\r\n<br>\r\nHmmm, mom was cooking pancakes. She then thought, when did I care about that? She shrugged and started to dig in.<br>\r\n<br>\r\nHer little seven-year old brother came down, and looked her stomach.<br>\r\n<br>\r\n\"Samantha's getting fat!\" he announced.<br>\r\n<br>\r\n\"Shut up, twerp!\" she angrily yelled at him. Still, her stomach was a little less flat than yesterday.<br>\r\n</span></div></div>",
            "created":1086325200,
            "id":201721,
            "title":"Breakfeast"
        },
        "1121":{
            "author_name":"Merlin",
            "choices":[
                "\"You're gorgeous. Wanna go out for a drink?\"",
                "\"I don't mind if you're stupid enough to think a fat pig like you ca"
            ],
            "content":"<div class=\"\"><div> <span>Hurt by her brother's words, she hurried upstairs to check how much weight she had really gained. She stood on the scales and screamed. She had put on twenty pounds since the night before! She was just about to complain of stomach pains and bury herself in her bed when she heard footsteps in the hall. Expecting nobody other than her brother or parents, she stepped out to see. And nearly burst into tears. Standing on the landing, leaning against a radiator and looking extremely cool, was her older sister's friend William - otherwise known as Rachel's Biggest Crush. His black hair was flicked back from his forehead and a few strands hung over his piercing blue eyes. He raised his eyebrows, clearly surprised to see her so much larger.<br>\r\n<br>\r\n\"Hi...\" she stammered, blushing a deep shade of pink. William shrugged and said,</span></div></div>",
            "created":1106370000,
            "id":233246,
            "title":"Noooooo! He can't see me like this!"
        },
        "11211":{
            "author_name":"Merlin",
            "choices":[
                "\"No way! You're hideous!\"",
                "\"'Course! You're beautiful!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Really?\" She was too shocked for any other words, but William looked serious.</span></div></span></div>",
            "created":1106370000,
            "id":233247,
            "title":"Honestly?"
        },
        "112111":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She goes to school and gets totally embarrased because of her weight and gas pro",
                "she runs away"
            ],
            "content":"<div class=\"\"><div> <span>\"Psyce!\" he shouted.<br>\r\n<br>\r\n\"I can't be seen with a fat cow like you! I mean look at you. Look at that gut.\"<br>\r\n<br>\r\nHe grabs her gut and shakes it.<br>\r\n<br>\r\n\"And look at those thunder thighs of yours.\"<br>\r\n<br>\r\nSam suddenly realized her thighs were rubbing together. She absentmindely grabbed her fat ass and shook and slapped her thighs. He laughed more and poked her belly. This caused her to grab her stomach she rolled the fat around in her hands. He laughed more. He poked her again this time she farted.<br>\r\n<br>\r\n\"Woah stinky.\"<br>\r\n<br>\r\nHe waved his hand infront of his nose as she farted again. She couldn't stand the smell and neither could he. <br>\r\n<br>\r\n\"See you later fatty. And to think you used to be hot. You've really let yourself go.\"<br>\r\n<br>\r\nSam cried and farted. Then her mother screams down that it is time to go to school.</span></div></div>",
            "created":1144558800,
            "id":311835,
            "title":"PYSCHE!!!!!"
        },
        "1121111":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "ran into one of her friends",
                "waddled off to Gym Class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam waddled off to school and hoped no one would notice her. None of her clothes fit and her fat was bulging out everywhere.<br>\r\n<br>\r\nShe nervously walked around the cafateria and.....</span></div></span></div>",
            "created":1167282000,
            "id":369045,
            "title":"Like a cow to the slaughter"
        },
        "112112":{
            "author_id":"jacknife78",
            "author_name":"Jacknife78",
            "choices":[
                "\"Anything for my lovely leviathan\"",
                "\"No way freak, I just wanted to see how fat I could make you\""
            ],
            "content":"<div class=\"\"><div> <span>          \"Of course.  I think you are the most beautiful girl in the world.\"  he says with love in his eyers.  \"There's a new chinese buffet in town that accually seves alchohol too.  Why don't we go and check it out.\"<br>\r\n<br>\r\n          Samantha follows him to his car.  She has to move the seat back a notch to fit inside.  When they arrive at the buffet, William leads her to a booth near the buffet table.   He tells her to sit down while he brings her a plate.<br>\r\n<br>\r\n          \"He is so romantic\" Samantha whispers dreamily.  William comes back with a huge helping of food and a pint of beer.  He only brought a glass of water back for himself.  When she is done, William already has another plate waiting for her.  After 6 helpings, Samantha is feeling bloated and tipsy and tries to get up.  But after devouring that much food, she is stuck.  <br>\r\n<br>\r\n          Samantha asks William to help her out and he says...</span></div></div>",
            "created":1157691600,
            "id":345406,
            "title":"Buffet and Beer"
        },
        "1121121":{
            "choices":[
                "She is crestfallen and enlists William's aid in making amends",
                "She justifies her rudeness and vows revenge, aliensating Willlkiam"
            ],
            "content":"<div class=\"\"><div> <span>William graciously helped Samantha up and took  her to the bench outside the restaurant.  There she waited while he went to fetch the car.<br>\r\n<br>\r\n\"Thank you for the delicious meal\" she said to William, \"and for serving me. I just don't know where that appetite came from.  I should have stopped much earlier, but it was all sooo good.\"<br>\r\n<br>\r\n\"My pleasure,\" said William. \"You are looking sensational these days!\"<br>\r\n<br>\r\n\"I'm confused, actually. What I am is twenty pounds heavier overnight!\" she replied.<br>\r\n<br>\r\nWilliam paused.  He'd heard rumors about a weight gain ray but thought it was just nonsense.<br>\r\n<br>\r\n\"Hmm.\" he said.  \"Tell me, did you say or do anything to anyone because of their weight recently?\"<br>\r\n<br>\r\n\"Why,\" she asked, suddenly remembering her rudeness of the day before.<br>\r\n<br>\r\nI heard a rumor about some of the bigger girls getting a secret weapon to use against divas who they feel harass them.  I don't know any details, but I sure hope you didn't tick anyone off.\"<br>\r\n<br>\r\n\"well,there was one incident, but . ..\"</span></div></div>",
            "created":1168146000,
            "id":371660,
            "title":"Light Begins to Dawn"
        },
        "11211211":{
            "choices":[
                "The gueriila chance contact and teach BBW realities",
                "The guerillas refuse contact and call for concreate actions."
            ],
            "content":"<div class=\"\"><div> <span>\"If such a secret weapon exists I would not blame them for using it,\" she said. \"I've felt sorta guilty about some of  my own trash talking, but its what my crowd does to keep the upper hand.  I haven't thought it right. Maybe now this and some other forms of bullying can be stopped!<br>\r\n<br>\r\n\"How so?\" William asked.<br>\r\n<br>\r\n\"If the ringleaders could be shut up, all the followers would too,\" she replied. \"How can I confirm that they have this weapon?\"<br>\r\n<br>\r\n\"They would have to surface - which would for them be pretty dangerous.  But I could try to get them to send you a disguised email.\"<br>\r\n<br>\r\n\"OK - do it!\" she exclaimed<br>\r\n<br>\r\nWilliam puts out the word, with the result that:<br>\r\n<br>\r\n</span></div></div>",
            "created":1168146000,
            "id":371665,
            "title":"A little flexibility."
        },
        "1122":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Gym",
                "English"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha got into her car, and started to drive to school.<br>\r\n<br>\r\nWhen she got there, she noticed her arms were a little more doughy than before. <br>\r\n<br>\r\nOkay, this is weird. But still, she had to go to first period...</span></div></span></div>",
            "created":1086498000,
            "id":201909,
            "title":"To school I go"
        },
        "11221":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Work out harder!",
                "You can't let people see you like this!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She went into the locker room, and got dressed. When she was naked, though, another girl giggled. <br>\r\n<br>\r\nShe looked down, and her gut was very much bigger, the rest of her well. Not fat, no, but certainly chunky!</span></div></span></div>",
            "created":1086498000,
            "id":202027,
            "title":"Gym"
        },
        "112211":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Ignore her",
                "Insult her back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha left the locker room and went into the gym.<br>\r\n<br>\r\nOne girl, Diana, a blond girl who was very fit and a rival of yours, looked at you and snickered.<br>\r\n<br>\r\n\"I see you're not letting a diet control your life\"</span></div></span></div>",
            "created":1086584400,
            "id":202204,
            "title":"Insulted"
        },
        "1122111":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Countinue running",
                "Take a breather"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha ignored Diana, and soon it was time to warm-up. <br>\r\n<br>\r\nThey started by running across the gym, and though she normally did it with ease, this time she had to stop and catch her breath half way there.</span></div></span></div>",
            "created":1086843600,
            "id":202466,
            "title":"Running"
        },
        "11221111":{
            "author_id":"tyrakk",
            "author_name":"tyrak",
            "choices":[
                "Go the nurse's office",
                "Countinue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After a couple of seconds, Samantha started running again, but she was slower. Ultimately, the class had to wait about 15 seconds for her to finish.<br>\r\n<br>\r\nWhen she got there, Diana had a smug look on her face.</span></div></span></div>",
            "created":1086930000,
            "id":202806,
            "title":"Still running"
        },
        "112211111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Hurry towards the nurses office, fast!"
            ],
            "content":"<div class=\"\"><div> <span>She went to the nurse's office, and felt her thighs rubbing together as she walked to the nurse's office.<br>\r\n<br>\r\n'What the?'  She though . . . 'this has never happened before!'  Her thighs were touching and rubbing now, making a sound against her jeans.  Her butt began to sway as she walked, and her paced was slowed.  She noticed her bra was feeling tighter than ever, and felt around her back area, where the bra strap was.  She felt a thick roll of fat, dropping down her back, and couldn't believe it!<br>\r\n<br>\r\n'I've never been this overweight!'  She tried to hurry to get the nurses office, but her legs were beginning to feel like thick weights, harder and harder to lift off the ground!</span></div></div>",
            "created":1087880400,
            "id":204266,
            "title":"Drastic Changes . . ."
        },
        "1122111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Tell the nurse you need to go home",
                "Tell the nurse you're blimping up!"
            ],
            "content":"<div class=\"\"><div> <span>She finally got to the nurses office, but realized her hips felt much wider than before!  When she tried to walk through the door, her butt bumped up against the sides of the doorway, and she had a little trouble moving through the doorway.  She entered, after much discomfort, and talked to the nurse.</span></div></div>",
            "created":1087880400,
            "id":204267,
            "title":"Hips"
        },
        "11221111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "It was that person with the blimping dart!",
                "It was a school bus ready to take her home!"
            ],
            "content":"<div class=\"\"><div> <span>She told the nurse she had to go home, and reluctantly, the nurse let her.  She hurried out the doorway this time, knowing now that she was blimping up.  At this rate, she wouldn't fit through the door by the time her Mom got here, so she waited outside.<br>\r\n<br>\r\nBut her Mom didn't pick her up . . .</span></div></div>",
            "created":1087880400,
            "id":204268,
            "title":"Picked up!"
        },
        "112211111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Contiune . . ."
            ],
            "content":"<div class=\"\"><div> <span>She realized it at once, and ran out to the car.<br>\r\n<br>\r\n\"Whats happening to me-\" She stopped herself in mid sentence.  He was a handsome stud, muscular, well-built, but a stranger!  Definently hot-and staring right at her.<br>\r\n<br>\r\n\"Ahhhh, yes, the blimping dart.  I am very sorry my dear, it was an accident.\"<br>\r\n<br>\r\n\"What?\"  She asked.<br>\r\n<br>\r\n\"You see, my little brother got a hold of my things.  It blimps people up to whatever size dart you fire at the person.  It cases them to gain anywhere for 15-5,000 pounds.  Depending on the dart, that is.\"<br>\r\n<br>\r\nShe began to sniffle.  \"I don't want to be fat!\"<br>\r\n<br>\r\n\"Now, honey, never fear!  I have a dart that reverses the blimping dart-and I can make you whatever size you want!  You might be sexier, and skinnier than before you got hit with the blimping dart, if, that is what you want.\"<br>\r\n<br>\r\nShe got excited.  \"So, are you saying that I get to be monstrously fat-and then mounstrously sexy, all after this?\"<br>\r\n<br>\r\nHe nodded.  \"Yes.  You will be able to choose your weight after you blimp up-but only after!  You see, I need to see how much you blimp up, and then use a specified dart to un-blimp you.  Understand?\"<br>\r\n<br>\r\nShe nodded.  \"But I'm growing so fast!  I must already be 300 pounds!\"<br>\r\n<br>\r\nHe nodded.  \"Yes, yes, you must be.  Come though, my car can fit your body for the next hour or so, while I take you to my apartment.  That way, no one will see you as you blimp, and you will never be embarrassed about this incident.  No one, except your gym class, will really know.\"<br>\r\n<br>\r\nShe nodded, and got inside the car.<br>\r\n<br>\r\n</span></div></div>",
            "created":1087880400,
            "id":204272,
            "title":"Explanations . . ."
        },
        "1122111111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Rip off your clothes and see how fat you're REALLY gotten!",
                "Cry.  He might feel sorry for you."
            ],
            "content":"<div class=\"\"><div> <span>She looked at herself through the rear view mirror, as she entered the car, and gasped!<br>\r\n<br>\r\nHer body was covered in fat. She threw off her sweater, and looked in disbelief. Her thighs we're at least three feet around! Her butt jiggled tremendously whenever she moved. Her face was flustered and reddish, with puffed out cheeks and a triple chin. Her belly had seven rolls, and love handles that poured over her side. Her breasts had inflated tremendously, they we're huge, and were sprawled out almost vertically against her massive stomach, which stretched out a couple feet in front of her. Her belly button was an inch deep, and her arms were equally portioned.</span></div></div>",
            "created":1087880400,
            "id":204275,
            "title":"Realization"
        },
        "11221111111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Contiune .. ."
            ],
            "content":"<div class=\"\"><div> <span>She went inside the van, and took off her clothes.<br>\r\n<br>\r\n\"Oh my god!!!  I AM SO FAT!!!!\"<br>\r\n<br>\r\nThe hunk just stared at her, and drove to an empty parking lot.<br>\r\n<br>\r\n\"I've never anyone get this big before . . . it couldn't have been the dart!\"<br>\r\n<br>\r\n\"What??!!!??\"  She yelled!<br>\r\n<br>\r\n\"People never gain that much weight so fast.  Usually it's just 10-20 pounds a day . . . not the almost 600 you've gained; you're almost 800 pounds by the looks of things.\"  He got out of his seat and sat beside her, her white fatty flesh looking unreal compared to his tan, sculoted body.<br>\r\n<br>\r\n\"I'm sorry . . . but it was not the dart.  Unless . . . wait!  Oh, no, this is bad!\"<br>\r\n<br>\r\n\"What?\"  She asked.<br>\r\n<br>\r\n\"Well . . . I have this other dart.  I just invented it . .  because well, I might tell you later.  It causes the person to gain weight-and keep it for the rest of their lives!  You can only get fatter from then on-never lose weight! I invented it, to, well, stop world hungur. Those straving people, lose the weight as quickly as they gain it.  The dart is like a shot almost, but with tons of chemicals.  It completly off-sets your metabolism.\"<br>\r\n<br>\r\nHe sighed after this explanation, and looked into her eyes.  She realized she was naked, and covered her waist and below with pants, after putting her bra on again.  But her pants ripped almost as soon as she put them on, and the bra flew off instantly.<br>\r\n<br>\r\nSobbing, she cried, and burried her now 6 chins!  He looked at her, and put his hand on her flabby shoulder.<br>\r\n<br>\r\n\"Never worry my dear . . . I'll take care of you untill I can find a cure.  I'll just have to reverse your metabolism a bit . . . but, oh, this is bad.\"  He sighed, and buried his head as well.</span></div></div>",
            "created":1087880400,
            "id":204277,
            "title":"Bad News"
        },
        "112211111111111":{
            "author_name":"calculatorfreakCG",
            "choices":[
                "Go home with him."
            ],
            "content":"<div class=\"\"><div> <span>She looked at his tan, muscular body, and was immensly turned on by him; he was truly a very hot young guy.  Probably around 25-27, which a handsome face and great bod.  <br>\r\n<br>\r\nHe was going to take care of her . . . would it really be that bad?<br>\r\n<br>\r\nShe lifted her fat white palm, and set it on his shoulder.  He felt it instantly-seeing the palm probably weighed 20 pounds alone.  He looked at her, and noticed she had probably just gained another 300 pounds since the last time he looked at her.  Her butt was now firmly planted in the seat, and it looked stuck!<br>\r\n<br>\r\n\"Oh my, are you stuck in that seat?\"<br>\r\n<br>\r\nShe nodded, and asked him to help her out.<br>\r\n<br>\r\nHe pushed her out of the seat with all his might, and she was getting hot as he pushed her flesh up and down, up and down.  Finally, he got her out of the seat, and was now holding some of her massive rolls in his arms.<br>\r\n<br>\r\n\"You're a very handsome man, my dear fellow.  And I forgive you.  Under one condition.\"<br>\r\n<br>\r\nHe smiled at the compliment, making him look like a sexy model.  \"Yes, what condition?\"<br>\r\n<br>\r\n\"That you take care of me untill you find a cure to get me looking like a sexy model with another dart.\"<br>\r\n<br>\r\nHe got back in the seat, and smiled.  \"Can do!\"</span></div></div>",
            "created":1087880400,
            "id":204279,
            "title":"Forgiven"
        },
        "1122111111111111":{
            "author_name":"Oni",
            "choices":[
                "Can I have something to eat?",
                "somthing else"
            ],
            "content":"<div class=\"\"><div> <span>He led her up some stairs with extreme deficalty and they walked into his home. He lived in a huge mansion. He led her into her room and she plopped down onto the bed. It was only a short walk from the car to her room, but she was now very tired. She was also still gaining, and he could tell. She leaned back onto the bed and asked.</span></div></div>",
            "created":1106370000,
            "id":233243,
            "title":"The Mansion"
        },
        "11221111111111111":{
            "author_name":"Tiny Book Buff",
            "choices":[
                "She's hungry again",
                "She's become too fat and broke the bed"
            ],
            "content":"<div class=\"\"><div> <span>He got her situated on the center of the bed and she said,<br>\r\n<br>\r\n“I’m hungry, could you get me something to eat?”<br>\r\n<br>\r\n“Sure I can, I’ll be right back.” said the man.<br>\r\n<br>\r\nHe left the room and walked into the kitchen, he started to fix a tiny meal consisting of a sandwich and a glass of water.  When he walked back into the room where she was, she had gained almost 200 more pounds!  He got next to the bed and gave her the food.  After a couple minutes she said,<br>\r\n<br>\r\n“Can you feed it to me please, I can’t move my arms anymore.”<br>\r\n<br>\r\n“Of course I can, Just open your mouth.” he said.<br>\r\n<br>\r\nShe obeyed and he put part of the sandwich in her mouth and she ravenously bit off a piece and swallowed it almost immediately.  He pushed more and more of the sandwich into her mouth and she downed it just as quickly.  He wondered why she had such a big appetite, but then it hit him.  <br>\r\n<br>\r\n“That dart must have given her an increased appetite as well, oh well.  Nothing to do now except to feed her until I find a cure, whenever that is.”<br>\r\n<br>\r\nBy the time he was done feeding her the sandwich and giving her the glass of milk, she had ballooned up by another 300 pounds, causing her fat to nearly push him off the bed.  <br>\r\n<br>\r\n“More, More, More!” she shouted.  “Get me more food, I’m starving!”<br>\r\n<br>\r\n“Don’t tell me she even gains more weight when she eats!  What was in that dart anyway?!” he said to himself.<br>\r\n<br>\r\nHe went back to the kitchen and filled an entire wheeling cart full of all types of food hoping to fill her up so he could have some time to research a cure.  Because if all he was doing was feeding her, he would never get a cure!  He brought the cart back and began shoving all sorts of foods into her gaping maw.  Anything he put in her mouth was gone in a matter of seconds.  Within about 30 minutes she had sucked down all the food and gained about 600 pounds, pushing her total to well over 2,500 pounds!  Her fat poured over every side of the bed now and all over the floor for about a foot, and she was still getting fatter!  He got next to her and asked,<br>\r\n<br>\r\n“Are you full yet?”<br>\r\n<br>\r\n“Yes sir, I am.  Thank you so much!” she said happily.<br>\r\n<br>\r\n“Good.  I’m going to go work on a cure for this dart now.  Okay?” he said.<br>\r\n<br>\r\n“Okay, I’ll wait here.” she said as she dozed off to sleep.<br>\r\n<br>\r\n<br>\r\nHe walked down to his office and began to research what was in the dart to try and find a cure for it.  However, his research was short-lived, as his silence was interrupted by...</span></div></div>",
            "created":1107234000,
            "id":234728,
            "title":"Getting Bigger"
        },
        "112211111111111111":{
            "author_name":"Magi_Man",
            "choices":[
                "She softly began to snore.",
                "She started getting much fatter!"
            ],
            "content":"<div class=\"\"><div> <span>Rachel began shouting,<br>\r\n<br>\r\n\"I'm hungry, I'm hungry.  Please give me food!\"<br>\r\n<br>\r\n\"Oh my God!  When is she going to be full?\" Her keeper said as he looked around his lab.<br>\r\n<br>\r\nHe figured that he could find some type of other dart to put her to sleep.  He looked around for a bit and found a mass of darts.  They were in the same place as the sedative darts, but none of them were labeled.<br>\r\n<br>\r\n\"Wonderful!\"  He said to himself.  \"Oh well, they're in the exact same place.  Nobody else could have stirred them up so they have to be the right ones.\"<br>\r\n<br>\r\nHe figured he would need a lot of darts for her huge size, so he grabbed a handful of darts, and rushed upstairs to deliver them.  When he arrived, Rachel's fat was flowing over almost half the room.  She was completely unrecognizeable as a human being, the fat had turned her into a giant quivering sac of blubber!<br>\r\n<br>\r\n\"Oh Lord!\"  Her keeper said.  \"I hope this works!\"<br>\r\n<br>\r\n\"I need food!\"  Rachel demanded.<br>\r\n<br>\r\nAs she finished the sentence he said to himself,<br>\r\n<br>\r\n\"I hope this works!\"<br>\r\n<br>\r\nHe took all the darts out of his pocket and tossed them onto her blanket of fat that covered the floor.  All 5 of them fell, punctured her skin, and emptied their contents into her giant body.  As she felt the pricks of the darts, her body did its best to jerk, but merely rippled her sea of fat.<br>\r\n<br>\r\n\"I hope those were the right darts.  If they weren't she could fatten to more than 30,000 pounds!  I don't know what I'd do with her then!  Her keeper said.<br>\r\n<br>\r\nHe waited with stagnant suspense in the air until something happened. <br>\r\n<br>\r\nWhat was it? </span></div></div>",
            "created":1115960400,
            "id":250219,
            "title":"Making A Guess"
        },
        "1122111111111111111":{
            "author_name":"Magi_Man",
            "choices":[
                "One of his friends",
                "A cop investigating Rachel's disappearance"
            ],
            "content":"<div class=\"\"><div> <span>Rachel began to softly snore, meaning the darts were correct.<br>\r\n<br>\r\n\"Thank Heavens!\"  Said the man.  \"I can't knew those darts had to be the right ones!\"<br>\r\n<br>\r\nHe noticed also that despite her huge size, Rachel had stopped getting fatter.  <br>\r\n<br>\r\n\"She must have finally reached the 5,000 pound limit of that dart.\"  He said softly.<br>\r\n<br>\r\nWhile she was sleeping he went back down the hall to his lab and tried finding a cure for whatever that dart consisted of.  Mixing different things, chemicals and compounds, nothing worked.  He could make the fattening dart easily, but the compound that the components formed was far too complex to breakdown it seemed.  Everything he tried seemed to enhance the weight gain effect, and that was the last thing he needed!  Over hours of grueling research he decided to go to sleep for the night.  However, right before he went to sleep there was a knock at the door.<br>\r\n<br>\r\nWho was it?</span></div></div>",
            "created":1116133200,
            "id":250530,
            "title":"Temporary Solution"
        },
        "1122111111111111112":{
            "author_id":"fathinata2",
            "author_name":"FatLeaf",
            "choices":[
                "Covers the whole room",
                "Breaks through the house and she keeps growing"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately the darts that he used were the wrong ones and her body starts exploding with fat, he tried to escape but was soon then squashed by her growing massive belly<br>\r\n<br>\r\nRachel could only watch in panic and somewhat starts to like feeling so big and fat as her growing body...</span></div></div>",
            "created":1340312520,
            "id":1364182,
            "title":"She started getting much fatter!"
        },
        "112211111111111112":{
            "author_name":"Baby-baby",
            "choices":[
                "Get ready for a fart",
                "She's gonna BLOW!...up of course..."
            ],
            "content":"<div class=\"\"><div> <span>He hears a loud BOOM! And suddenly the roof starts to crumble and fall. He ducked underneath his work bench as the big flubberly Samantha fell ontop of his experiments. \"I'm so sorry!\" she said sobbing, \"I didn't mean to...\" Samantha stops dead in the tracks when she starts to feel a little woozy...</span></div></div>",
            "created":1107320400,
            "id":234881,
            "title":"BOOM!"
        },
        "1122111111111111122":{
            "author_id":"fathinata2",
            "author_name":"FatLeaf",
            "choices":[
                "she keeps growing",
                "it stops after a while"
            ],
            "content":"<div class=\"\"><div> <span>her fat blubbery body suddenly started to expand like crazy \"what the how is this happening?\" she cried as she kept getting bigger and fatter each second her belly was covering half of the house she became so fat that she destroyed the house what happens does she keep growing or does it stop?</span></div></div>",
            "created":1215387000,
            "id":552475,
            "title":"she explodes with fat"
        },
        "112211111112":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "The bus ride",
                "She decides to waddle home"
            ],
            "content":"<div class=\"\"><div> <span>By the time she was allowed to leave the bus had come to take her home.<br>\r\n<br>\r\nShe had gotten much bigger. Her gut popped out of her shirt and hung down she had love handles and a muffin top.<br>\r\n<br>\r\nHer once sleek face was replaced with a double chin.<br>\r\n<br>\r\nShe hoped no one would see her.</span></div></div>",
            "created":1153026000,
            "id":331738,
            "title":"The bus"
        },
        "11221111112":{
            "author_id":"cyberstar",
            "author_name":"Cybershift",
            "choices":[
                "Call the Authorities!",
                "She needs a Doctor DAMMIT!"
            ],
            "content":"<div class=\"\"><div> <span>\"Nurse, please you've got to help me, Ever since I woke up this morning I've been getting fatter!\" Sam wails as she waddles in feeling her thighs squish through the door. The nurse looks up and at her and says \"Oh my... what happened? Just yesterday you were this sweet little girl, now you're... you're...\" she stammered \"I'm FAT!\" Sam Wailed starting to feel tears welling \"I need... I need help... OH!\" Saw cries feeling her clothes tighten more as she continues to swell up looking like shes a sausage in her clothes. \"I don't... I don't know what to do... I've never seen anything like it, who do I call for help? What if its contagious? Or I cause it to increase the rate of growth??\"<br>\r\n<br>\r\nThe nurse not sure how to help poor Sam's swelling, is conflicted between Calling a hospital or calling the government and CDC</span></div></div>",
            "created":1282601880,
            "id":942270,
            "title":"Tell the nurse you're blimping up!"
        },
        "112211112":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She Oinks and hopes everyone will leave her alone",
                "She tries to run away."
            ],
            "content":"<div class=\"\"><div> <span>Diana was laughing as she came over and poked Samantha in her stomach which peaked out from under her shirt. Diana grabbed a roll of tummy fat and laughed some more.<br>\r\n<br>\r\n\"Man Sam. You've really let yourself go. Look at you this goes beyond jelly belly.\"<br>\r\n<br>\r\nShe rolled the fat in her hand before letting it drop and watching it jiggle.<br>\r\n<br>\r\n\"I mean look at you. You used to be like a model. Now your a total fat ass.\"<br>\r\n<br>\r\nNext they had to do situps. To her fear, Sam was paired up with Diana. As she sat down and started doing situps her stomach formed three large fat rolls. This of course caused Diana to laugh again.<br>\r\n<br>\r\n\"Come on FATTYY! Move that gut of yours.\"<br>\r\n<br>\r\nAfter Gym it was timed to get changed again. This time Samantha had a lot more trouble getting her pants over her growing thighs, which now rubbed together. After she got her shirt on she realized her belly hung fully out and over the waist of her jeans. She was about to cry when Diana came up from behind her. She grabbed her fat tummy and shook it furiously.<br>\r\n<br>\r\n\"Look at you Sam. Look at this fat! Your a pig. Come on piggy. Oink! Oink for us!\"<br>\r\n<br>\r\n\"Hell No Diana!\" screamed Sam.<br>\r\n<br>\r\nBy this time the rest of the girls had gathered around and were laughing as they took turns poking her belly remebering the snotty thin bitch that used to make fun of fat girls. Diana led the charge of name calling and she continued to slap her belly and ass causing the girls to laugh more as they jiggled.<br>\r\n<br>\r\n\"Come on Piggy. You're the one who let yourself go. You let yourself get fat. So Oink. Oink like the pig you've become.\"</span></div></div>",
            "created":1144386000,
            "id":311401,
            "title":"Gym class from hell!"
        },
        "1122111122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "She reached her next class",
                "She is confronted by the girl from the party"
            ],
            "content":"<div class=\"\"><div> <span>Sam ran as fast as her newly fattened body would let her. She cried as more laughs and insults followed.<br>\r\n<br>\r\nHer thighs were rubbing together now and she was starting to waddle. Her gut and loved handle were pouring over her pants forming a rather unflaterring muffin top.<br>\r\n<br>\r\nShe waddled on until...</span></div></div>",
            "created":1153026000,
            "id":331750,
            "title":"Escape"
        },
        "1122112":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "a week of dieting pasted Sam loose a few pounds ( not much)",
                "week of dieting it doesnt work past sam gained 30 pounds"
            ],
            "content":"<div class=\"\"><div> <span>Bitch you mad i got curves &amp; you dont. Your noting but skin &amp; bones. said sam. As she walked away left diana in shock. Diana is right though i am getting a bit chunky. Sam thought as she grabbed at Her newly forming muffin top. gaw I cant let myself go. I need to diet thought sam.</span></div></div>",
            "created":1291537320,
            "id":1008693,
            "title":"Insult her back"
        },
        "11221122":{
            "author_id":"spuffyromy",
            "author_name":"spuffyromy",
            "choices":[
                "I give up I'm not going to fight it any more",
                "Think I'll try something different"
            ],
            "content":"<div class=\"\"><div> <span>A week later<br>\r\n<br>\r\nDiana Was step on the scale all week she tried to diet but it seemed like no mater what she ate she gained weight.<br>\r\nDiana looked at the scale holy crap I gained 30 pounds Diana yelled out loud.<br>\r\nDiana looked at herself in the mirror next to the bairhroom scale.<br>\r\nDiana saw her breasts were a good cup an a half bigger and spilling out of her bra.<br>\r\nHer belly rested on the waistband of her panties her tighes touched together.<br>\r\nHer hips were getting wide and padded Diana turned to the side.<br>\r\n Her butt was geting huge each cheek was slowly starting to look beach ball sized.<br>\r\n This dieting thing just ts working Diana thinks pulling on her sweats and heading back to her room.<br>\r\nDieana sits on her bed and says</span></div></div>",
            "created":1340121480,
            "id":1362885,
            "title":"week of dieting it doesnt work past sam gained ..."
        },
        "11222":{
            "choices":[
                "Her pants split",
                "The chair broke"
            ],
            "content":"<div class=\"\"><div> <span>English class was the first class of the day even though she was safe from the embarassment from having gym class not many noticed her sudden gain in weight, it wasn't horribly noticable yet.<br>\r\n<br>\r\nShe had shrugged it off despite some whispers from some people as she entered the classroom.<br>\r\n<br>\r\nWhen she sat down the chair slightly groaned with her weight, it had almost seemed like it was going to break but it didn't, she sighed as she knew this day was probably going to get worse.<br>\r\n<br>\r\nHowever within a few short moments...</span></div></div>",
            "created":1157432400,
            "id":344804,
            "title":"English class"
        },
        "112221":{
            "choices":[
                "Go home",
                "Go to a tailors perhaps"
            ],
            "content":"<div class=\"\"><div> <span>As she waited for the class to end with some boredom on her face she waited and it finally ended, but when she got up her pants sort of split, luckily no one in class noticed until she walked out into the hallway and everyone started laughing at her.<br>\r\n<br>\r\n\"What's so funny?\"<br>\r\n<br>\r\n\"We can see your underwear...\" A student laughed as she poked her belly.<br>\r\n<br>\r\nShe was being pointed and laughed at and she didn't know what to do now...</span></div></div>",
            "created":1157432400,
            "id":344811,
            "title":"Split"
        },
        "1122212":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "plus sized pink spandex stretch pants",
                "food stained male sweatpants."
            ],
            "content":"<div class=\"\"><div> <span>Sam knew there was no tailor near by so she went to the office to get new pants.<br>\r\n<br>\r\n<br>\r\nShe tried on several pairs but was frightened when none seemed to fit her.<br>\r\n<br>\r\nFinally she found something that fit her.<br>\r\n<br>\r\n</span></div></div>",
            "created":1157432400,
            "id":344812,
            "title":"Looking for pants that fit."
        },
        "11222122":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "Math",
                "Lunch"
            ],
            "content":"<div class=\"\"><div> <span>Sam put on the only pants they had and blushed red when she looked in the mirror.<br>\r\n<br>\r\nThe sweatpants were covered in grease and other food stains. They made her look like a huge slob. Sam waddled out of the office and headed off to her next period, feeling like her pants were already getting tight.<br>\r\n<br>\r\nHe next class was...</span></div></div>",
            "created":1167282000,
            "id":369043,
            "title":"Greasy sweats."
        },
        "112222":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "Samantha has a hard time getting up.",
                "Samantha goes to the nurse."
            ],
            "content":"<div class=\"\"><div> <span>Samantha nestled her wider butt in the back arms of the chair as she tried to find a comfortable new position to house her rear. As she shifted and nudged around she heard a slight squeak. Nothing really though.<br>\r\n<br>\r\nAs her teacher’s lecture grew dreary she felt her jeans grow ever-so tighter. It was hardly noticeable but when your jeans are small to start off with it was! Samantha moved around in the small confines of her chair and suddenly…<br>\r\n<br>\r\nBAM!<br>\r\n<br>\r\nThe chair completely collapses from under her. The four legs shattered and the seat breaks right in half. The back on the chair shot across the room and all that was left was a pleasantly plump Samantha lying on the floor. She rubbed her head from all the pain as she looked around her vision was blurred and she could hardly see anything.<br>\r\n<br>\r\nBut she could certainly hear the laughs from her class mates…<br>\r\n</span></div></div>",
            "created":1173145260,
            "id":387158,
            "title":"Till I Collapse..."
        },
        "1122222":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "300lbs...",
                "200lbs..."
            ],
            "content":"<div class=\"\"><div> <span>Ten minutes of struggle and Samantha found herself being weighed in the nurse’s office. “Will my mom have to pay for the desk?” Samantha asked as she took off her shoes.<br>\r\n<br>\r\nNurse Molly shook her head. “Oh no dear, weight isn’t an issue. But the school does like to know how much their students weigh.” Molly said gesturing to the scale.<br>\r\n<br>\r\nSamantha headed over and she placed her cold feet on the colder metal of the scale. She looked down at the dial as it ran rapidly around the numbers of the scale. The needle looked more like a devil’s pitchfork than anything else.<br>\r\n<br>\r\nThe dial whizzed past 90, zoomed right over 110 and slowed down around 130 but it wasn’t over yet…<br>\r\n<br>\r\nSamantha bit her lip as time seemed to go extra slow as the needle began to come to a full stop. The nurse recorded the weight on her clipboard.<br>\r\n<br>\r\n“Samantha, it seems like you’ve really sprouted…” The Nurse said trying to now be disrespectful.<br>\r\n<br>\r\nSamantha looked down at the pitchfork and muttered… <br>\r\n</span></div></div>",
            "created":1173145740,
            "id":387161,
            "title":"Devil's Pitchfork"
        },
        "12":{
            "choices":[
                "hate the extra weight",
                "want more weight"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then Rachel woke up and went to take her morning shower she looked in the mirror and saw herself 100 lbs. heavier does she</span></div></span></div>",
            "created":1097298000,
            "id":219623,
            "title":"Waking up Big"
        },
        "121":{
            "author_name":"Merlin",
            "choices":[
                "She buries herself under her duvet and stays at home",
                "She goes to school and is mocked terrifically"
            ],
            "content":"<div class=\"\"><div> <span>She burst into tears and called for her mother, who ran to see her and gasped. The weight had mostly been added to her stomach and face, both of which had ballooned up to triple their original size. She wept at the sight of her several chins wobbling when she spoke.</span></div></div>",
            "created":1106370000,
            "id":233244,
            "title":"Wobble wobble"
        },
        "1211":{
            "choices":[
                "Get something to eat",
                "Check your mothers closet for something to wear"
            ],
            "content":"<div class=\"\"><div> <span>Rachel waddled to her room; hid under the duvet and stayed home of course, she was too embarassed to go to school that day, so embarassed that she couldn't face the outside world.<br>\r\n<br>\r\nThis was definately a problem, she knew the world was a doublestandard for image, woman strived to be thin, all the guys at the highschool she attended liked girls who were thin and sexy.<br>\r\n<br>\r\nShe didn't really have many clothes that would fit her due to her sudden weight problem as she thought and colaborated on what she should do...<br>\r\n</span></div></div>",
            "created":1157259600,
            "id":344319,
            "title":"Hide under the sheets"
        },
        "12111":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "eats them all",
                "Enters a reality where she has always been fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Samantha waddled into the Kitchen and opened up the cabnits. She spotted a box of twinkies and considered eating them.<br>\r\n<br>\r\nShe...</span></div></span></div>",
            "created":1157432400,
            "id":344784,
            "title":"Bigger Size=Bigger Hunger"
        },
        "121111":{
            "choices":[
                "A talk show talking about fat people",
                "A horrible movie"
            ],
            "content":"<div class=\"\"><div> <span>Samantha had stuffed her fat face with the twinkies, she was depressed, and she had many reasons to be, with her current body she figured she wouldn't be able to get a boyfriend and it would take her forever to lose the weight.<br>\r\n<br>\r\nAfter she ate the twinkies she had decided to stay home and watch TV after clicking through some channels she had found...</span></div></div>",
            "created":1157432400,
            "id":344792,
            "title":"Twinkie Eater"
        },
        "1211111":{
            "author_id":"sorab4p",
            "author_name":"SoraB4P",
            "choices":[
                "She was shocked to find herself two times her original size!",
                "She found herself still eating behind the mirror."
            ],
            "content":"<div class=\"\"><div> <span>Samantha flicked onto the channels, of course, landing herself on a news report about how people were stating the health risks behind being fat, which made the girl whimper and cry into her pillow, she sniffled and whimpered, trying her best to contain her flowing emotions. Samantha looks up to the TV, and turns it to another channel, getting up from the couch and comfort eating. She hated the fact that she gained so much weight, but what else was there to distract her, yet not insult her at the same time? So, Samantha ate, trying to hide the fact that she was depressed from herself. She lets out a loud burp, sniffling as she slumped over into the bathroom, hoping that she didn't look that different.</span></div></div>",
            "created":1441661820,
            "id":2031309,
            "title":"Irony, Thy Name Is Extra Large Samantha!"
        },
        "1211112":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "A",
                "B"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam sees a horrible movie on the TV and after stuffing her face with greasy potato chips she dozes off.<br>\r\n<br>\r\nSam...<br>\r\n<br>\r\nA: wakes up in a reality in which she has always been fat<br>\r\n<br>\r\nB: Dreams she has always been fat.</span></div></span></div>",
            "created":1157432400,
            "id":344793,
            "title":"Dozing off"
        },
        "12111121":{
            "author_id":"insanekid123",
            "author_name":"crawlincreeper",
            "choices":[
                "attempt to work it off",
                "give in and stuff yourself"
            ],
            "content":"<div class=\"\"><div> <span>          You wake up what seems like a few hours later in a house that feels slightly different, the doors and halls wider, the kitchen much larger, and all the pictures showing the slow progression of you from a thin little girl to a massive teen slob who only really cared about food and sex. With a grunt you lift yourself off the couch and slowly waddle to the most recent, your eighteenth birthday party picture. All of your old friends were no longer in it, replaced by the fattest kids at your school, ranging from three hundred to six hundred pounds, with you looking at around five hundred. Your pictures of you as a thin popular princess have been replaced with photos of you and your friends eating, and LARPing.<br>\r\n<br>\r\n          You waddle to the bathroom in a panic, jiggling all the way. As you stare into the mirror the first thing you notice is how little this alternate you cared about hygiene, greasy hair, hairy legs, and a smell so powerful even you noticed it all gave that away. Then you noticed your skin, more pale than you had ever been, due to the long days and nights of gaming with the shades closed. Finally you noticed what most people did first, your size, you had gained mostly in the ass, though the breasts and belly certainly were not left out. You reached out and grabbed your belly, shaking it once to see how long the jiggle would last, thirty seconds, before you had rock hard abs and now you have a gut the when shook once jiggled for thirty seconds.<br>\r\n<br>\r\nYou decide to...</span></div></div>",
            "created":1392251880,
            "id":1744809,
            "title":"The new you"
        },
        "121111212":{
            "choices":[
                "Your friends were all there, ready to stuff you more. ",
                "There was a note for you on the kitchen counter."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, I give up! Tasty foods, here I come!\" You rush to the cafeteria and start binging on all the foods. Nobody stops you, and you just keep going at it. Other people eventually join in on the feasting, but you've already wiped out most of the food, gaining 240 pounds (740 total) <br>\r\n<br>\r\nYou left for home, waddling very slowly, with a giant slice of cake in your hand. But as you arrive home, sand enter the door, you notice that...</span></div></div>",
            "created":1410626040,
            "id":1856348,
            "title":"give in and stuff yourself"
        },
        "121112":{
            "author_id":"sorab4p",
            "author_name":"SoraB4P",
            "choices":[
                "\"Then we'll just have to feed you like when you were a child~\"",
                "\"Then I can eat all of it after you eat your portion~\""
            ],
            "content":"<div class=\"\"><div> <span>(I realize there may or may not be confusion on everyone's part due to a typo in the first chapter, so I'm going with Samantha)<br>\r\n<br>\r\nSamantha grabs the twinkies, slowly opening the box when she felt something grab her from behind. She screamed, getting pulled back into the fridge, which somehow swallowed her fat body whole. After tumbling and screaming for what felt like ages, she landed on her bed, panting, the fat body she had wobbled and shook. She looked around, her room was a mess! Uneaten foods, wrappers, and clothes that had food spots all over them! Samantha was revolting at her own room, as she attempted to waddle out. She comes across her mother, cooking food for her daughter.<br>\r\n<br>\r\n\"Oh honey~\" Cooed the woman in her mid thirties, \"I didn't think you'd be up so early!\"<br>\r\n<br>\r\nThe mother walked over and kissed Samantha on the cheek, as Samantha pushes back a bit.<br>\r\n<br>\r\n\"Wh...what's going on?\" Samantha asked her mother, \"Why are you not angry at me? Why are you not wondering why I'm so fat? Why are you so damn nice to me right now?!\"<br>\r\n<br>\r\n\"You said it yourself, you told me you weren't feeling well last night after someone darted your rear end!\" The mother stated, patting Samantha's stomach.<br>\r\n<br>\r\nAs she went back to cooking, Samantha gasped, there was something so...odd about being pat on the stomach. Samantha couldn't tell what kind of emotion she should be feeling! Samantha grunts as she sits down, still depressed from her gaining. She gasped, however, seeing that her mother had a large breakfast set out for her.<br>\r\n<br>\r\n\"Mom, what the fuck?!\" She stated, \"I can't eat all of this!\"<br>\r\n<br>\r\nThe mother giggled before saying,</span></div></div>",
            "created":1441663200,
            "id":2031329,
            "title":"The Alternate Dimension"
        },
        "12112":{
            "author_id":"boywithpen",
            "author_name":"boywithpen",
            "choices":[
                "Go out",
                "Stay inside."
            ],
            "content":"<div class=\"\"><div> <span>She felt terribly silly as you looked through your mother’s clothes to see something stylish that would fit you. The latter part was unfortunately easy.  Some of her mom’s clothes were surprisingly comfy and form fitting but none were in the style she desired.<br>\r\n<br>\r\nActually most of the clothes, in her opinion, made her look terribly huge and bloated. Which she was, but she wasn’t about to advertise the fact that she had gained over 100 pounds over night. At this rate by the end of the week she will be a blob!<br>\r\n<br>\r\nShe tried to hide her shame by picking out a mere pair of sweats pants and a small form fitting top that barley covered her belly button. <br>\r\n<br>\r\nShe looked over at the mirror and checked out her new face. It was very fat, soft and extremely plump. She had a small double chin, and her cheeks made her look like a chipmunk. Even her lips were fatter!<br>\r\n</span></div></div>",
            "created":1173146460,
            "id":387164,
            "title":"Mom's old Clothes"
        },
        "1212":{
            "choices":[
                "Eat the fried chicken drizzled in scrumtious gravy!",
                "Eat the dog shit sandwich and drink warm pig piss!"
            ],
            "content":"<div class=\"\"><div> <span>She goes to school, and everyone is chanting:<br>\r\n<br>\r\n\"Fatass-Fatass! Go eat shit you fatass-fatass! Go eat-\"<br>\r\n<br>\r\n\"Just shut the fuck up you pig bastards! I don't care if I'm fucking fat so I'm gonna go to the cafeteria and gobble down ALL the fucking lunches, so why don't you and your mothers get a little pop diddy doodle cunt lip crazy, eh? Maybe you could all gain some fucking weight, too, after getting pregnant!\"<br>\r\n<br>\r\nShe goes to the cafeteria but has a lot of choices. Does she:</span></div></div>",
            "created":1144904400,
            "id":312783,
            "title":"Cuss Girl"
        },
        "12121":{
            "choices":[
                "She asks the lunch lady to get her some more",
                "She goes behind the counter and helps herself to everything"
            ],
            "content":"<div class=\"\"><div> <span>She quickly waddles to the cafeteria, completely devastated because of her classmates rudeness and insensativity. \"GIVE ME SOME FRIED CHICKEN WITH GRAVY... NOW!!!\" She screamed at the slightly overweight cafeteria server. The startled woman slowly puts a small piece of chicken on a plate. \"LOOK AT ME, DO YOU THINK THAT TINY PIECE IS ENOUGH FOR A FAT ASS LIKE ME? PILE IT ON!!!\" she screeched. The terrified lunch lady started piling on some chicken, \"That's more like it,\" the chubby girl smiled. The lunch lady starts covering the chicken in gravy. Rachel started drooling, and she felt her stomach rumble in anticipation for the greasy meal. She wolfed the entire thing down in a matter of seconds. She still wasn't satisfied, she needed more. Much more. <br>\r\n<br>\r\nSo...</span></div></div>",
            "created":1165035600,
            "id":363017,
            "title":"Hungry, much?"
        },
        "121212":{
            "choices":[
                "she finished all the food",
                "the principal walked in"
            ],
            "content":"<div class=\"\"><div> <span>She goes behind the counter and tells the weak lunch lady to leave her alone. Reluctantly, the lunch lady walks into the back. Rachel goes crazy. She starts shoveling everything into her hungry mouth. More greasy chiken, mashed potatoes, french fries, steak, everything she could get her greedy hands on. With each bite, she got hungrier and fatter. Her shirt ripped open, and her huge stomach spilled out, growing more and more with each mouthful. Her pants soon ripped right off, but she didn't stop. And pretty soon...</span></div></div>",
            "created":1165035600,
            "id":363018,
            "title":"MORE FOOOOD!!!!"
        }
    },
    "info":{
        "author_id":"tyrakk",
        "author_name":"tyrak",
        "brief_description":"A teenage girl starts to get bigger",
        "created":1086324420,
        "description":"<td align=\"left\" class=\"norm\">Just a basic story. A couple of rules.<br>\r\n<br>\r\n1. This isn't a kid's story, but no graphic sex or rape or nude scenes or such.<br>\r\n<br>\r\n2. I would rather this not be an FA piece.<br>\r\n<br>\r\n3. Use spell check, correct puncuation and grammer, and don't use all caps or no caps.<br>\r\n<br>\r\n</td>",
        "id":854890,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1441663200,
        "modified":1441663200,
        "pretty_title":"Weight Problem"
    }
}