{
    "chapters":{
        "1":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Walk toward Dana and try to get her attention.",
                "Go explore the store, looking for other help."
            ],
            "content":"<div class=\"\"><div> <span>You, Greg, walk out of the school building completely angry.  It is Friday the 13th and you have just gotten an F on the History test that you studied for for a total of 3 hours!!  You walk home and immediately trip, landing in a pile of mud.  You enter your house(after cleaning yourself up) and greet your mom with a kiss on her cheek.  \"Greg, I heard about your History test grade, and I am sorry, but you have to make up for it by going to the grocery store for me,\" she says as you grab a Coke.  You roll your eyes and leave right away, slamming the door behind you.\r<br>\n\r<br>\n  At the store, you are buying the usual when you spot your girlfriend, Dana, grabbing some bread.  You start walking toward her when suddenly a white light goes off, completely blinding you.  When everything clears, you see Dana, only she is towering above you!!  You look around and find yourself to be at least 2 inches tall.  You duck behind an aisle shelf.  Come one think...what do you do?\r<br>\n\r<br>\n</span></div></div>",
            "created":994482000,
            "id":62320,
            "title":"The Day Begins."
        },
        "11":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "heel on a woman's high heel pump.",
                "a giant broom leaning against the shelves."
            ],
            "content":"<div class=\"\"><div> <span>You clear your head and start walking toward Dana as she continues to shop.  You stop at her shopping cart and call to her, but sadly, she doesn't hear you.  You cover your ears as Dana asks, \"Mom, is there anything else you need?\"  The thing you need is attention and soon because Dana is starting to walk off away from you.  You start running toward Dana, trying to keep up, but suddenly you collide with something solid.  When you wake up, you discover that you have run into a...</span></div></div>",
            "created":994568400,
            "id":62460,
            "title":"Trying to keep up."
        },
        "111":{
            "author_name":"O Homonúculo",
            "choices":[
                "You know her.",
                "She's a stranger."
            ],
            "content":"<div class=\"\"><div> <span>   You hit against an enormous column, then you noticed that's the hell of an enormous black pump. There's an enormous arch before it, you pass underneath the high heel shoe. And then the other. That's when you see towering above you, a skyscrapper sized pretty woman, on her thirties, with a dark hair, all tied and wrapped around under her head. There's an enormous package right by her side rested on the floor. \r<br>\n   She's at the balcony, paying for the groceries.\r<br>\n  Then she looks down and spot you on the floor.</span></div></div>",
            "created":994568400,
            "id":62477,
            "title":"The woman at the groceries"
        },
        "1111":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Ask her to take you home to your Mom.",
                "Ask her to take you to her house where she will take care of you."
            ],
            "content":"<div class=\"\"><div> <span>You look up at the face of Mrs. Wellington, your next door neighbor.  You think to yourself--&gt; maybe she can give me a ride home.  You call up to her, but she is so busy looking for her credit card that she doesn't even hear your small voice.  Suddenly the credit card falls and lands next to you.  The credit card looks like a huge billboard.  She bends down to get it and immediately sees you.  She stares at you in surprise, then lifts you off the floor.  \"Greg, what happened?\" she asks.  You tell her the whole story, then you sit on her hand in disbelief.  \"Greg, I will be gentle to you and I will take care of you, but tell me, what do you want me to do?\" she asks you.\r<br>\nWell, what do you want to do?</span></div></div>",
            "created":996469200,
            "id":66547,
            "title":"It's Your Next Door Neighbor, Mrs. Willington."
        },
        "11111":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Climb down Mrs. Wellington's dress, and escape.",
                "Stay in the pocket of her dress."
            ],
            "content":"<div class=\"\"><div> <span>Mrs. Wellington is a nice woman and she is offering to take care of you, but you would rather want to see your mom because the last time you saw your mom was at home before coming to the store.  So, you look up and tell Mrs. Wellington to bring you home.  She nods her head and smiles and places you in the pocket of her dress.  As you sit in her pocket, you wonder what you should say to your mom...you could say a white light shrunk you, or you could say a mad scientist ran into the store and used a shrinking ray gun to shrink you...but the question is, will your mom believe you in either excuse you give her.<br>\r\n<br>\r\n<br>\r\nFinally, after the long car ride in Mrs. Wellington's dress pocket, your next door neighbor arrives at your house, but now you are nervous...you can wait and escape, that way you can think things out, or you can go inside to see your mom, what will u do?</span></div></div>",
            "created":1024117200,
            "id":106930,
            "title":"I want to go home."
        },
        "111111":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Mrs. Wellington's giant pump.",
                "A box brought in by UPS that Mrs. Wellington ordered."
            ],
            "content":"<div class=\"\"><div> <span>You know that your neighbor will just keep you here forever and probably never tell your mom of what happened to you.  So you climb down your sweet neighbor's dress and begin running toward the door.  But obstacles stand in your way: towering furniture, Mrs. Wellington's purse, some crumbs near the sofa; all that is in your way as you enter the giant living room.<br>\r\n<br>\r\nWithout hesitation, you begin running past every obstacle in the room, but one more obstacle gets in your way...oh no its...</span></div></div>",
            "created":1027832400,
            "id":114110,
            "title":"Obstacles."
        },
        "111112":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "tell your mother that this was your sister's fault!",
                "tell your mother the truth.  Mothers love their sons who don't lie."
            ],
            "content":"<div class=\"\"><div> <span>Staying perfectly still in Mrs. Wellington's dress pocket, you ponder your mom's reaction again: Maybe she'll be okay with it, after all at least you're not dead.  Then again, she'll do what most parents do: say this incident is all your fault, when really it was a white light's fault!<br>\r\n<br>\r\nStill, you listen as Mrs. Wellington makes her way to the front door of your house and rings the doorbell.  During the wait for the front door to open, you get an idea: Of course! You can get back at your sister Kim!  You recall she did distract you while you studied for your History test, and didn't even stop, so you can get her back by saying it was her fault that you shrunk to 2 inches tall.<br>\r\n<br>\r\n<br>\r\nYour mother opens the front door and Mrs. Wellington walks in.  You have finally decided on what you will do when she takes you out to show you to your mother.  You...</span></div></div>",
            "created":1202713800,
            "id":496900,
            "title":"Pocket Time"
        },
        "11112":{
            "author_name":"me,myself",
            "choices":[
                "Rub her feet",
                "Someone knocks at the door"
            ],
            "content":"<div class=\"\"><div> <span>She takes you to her house and sets you on the table. \"Your mom isn't home until tomorrow morning, right? Well you can stay here til tomorrow, ok? I'm sure some doctors will be able to help.\" She comes over and picks you up in her colossal hand. She sits on the couch and places you on her knee. \"What now?\"You say. She looks down at you and smiles.\"Agh im so sore from all that walking.\"\r<br>\nYou think to  yourself and then say\"Well since you're taking care of me I can rub them for you!\"YOu see a huge smile spread accross her face. She sits you down on her foot.\r<br>\nWell, go ahead.</span></div></div>",
            "created":1013058000,
            "id":91469,
            "title":"At home"
        },
        "111121":{
            "choices":[
                "She picks you up and puts you on her toes.",
                "She holds you in her hand."
            ],
            "content":"<div class=\"\"><div> <span>She sets you on top of her right foot and<br>\r\nreclines on the couch.  You are as tall as<br>\r\nher big toe far above your head.  You rub<br>\r\nup and down on the arch of her foot and<br>\r\nshe wiggles her huge toes.  You take off your<br>\r\nshirt, shoes &amp; socks, leaving your shorts on,<br>\r\nand run and jump into foot.  You rub down with<br>\r\nyour whole body and feel her laughter.</span></div></div>",
            "created":1058590800,
            "id":166438,
            "title":"Rubdown"
        },
        "111122":{
            "author_id":"shrinkingguine",
            "author_name":"Nogleachwanjj",
            "choices":[
                "Bedroom",
                "Living room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly there is a knock on the door it is your mom asking if she had seen you mrs Wilmington lies saying no I haven't and tell her to check your girlfriends house then mrs Wilmington bring you to her</span></div></span></div>",
            "created":1403550000,
            "id":1816493,
            "title":"Someone knocks at the door"
        },
        "1111221":{
            "author_id":"julieshrink",
            "author_name":"julieshrink",
            "choices":[
                "Not now, I have other plans",
                "Sure, I'll help you "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In bedroom Sr wilmington lies on bed, she puts her foot in and says, massage, you begin massaging the xule was strong, the more you resist, when finished, you exhausted, said, now comes, you must help me. Mr. wilmington looks weird, and says</span></div></span></div>",
            "created":1407202680,
            "id":1837522,
            "title":"Bedroom"
        },
        "1112":{
            "author_id":"littletoy",
            "author_name":"littletoy",
            "choices":[
                "Escape from the bag before she reaches her car",
                "Wait to see your destination"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, my! What is that? It looks like...It can't be-\" she gasps.\r<br>\n\r<br>\nYou've never seen her before, and can only hope you won't be harmed as she reaches for you. Her huge fingers engulf your tiny body.\r<br>\n\r<br>\n\"H-\" is all you get off before she silences you.\r<br>\n\r<br>\n\"Shhhhh!-don't say a word! I'll take you out of here.\" And she quickly drops you in her bag or groceries. This makes you angry as you scramble for footing among the vegetables and canned goods. You find safety clinging to the end of a lumber sized celery stalk.\r<br>\n\r<br>\nYou see her smiling down at you as she lightly swings the bag from side to side. You aren't sure what action to take.</span></div></div>",
            "created":994568400,
            "id":62510,
            "title":"Heeeeey Lady!"
        },
        "11121":{
            "author_id":"littletoy",
            "author_name":"littletoy",
            "choices":[
                "Run for cover under the nearest car.",
                "Head toward the store front and wait for Dana"
            ],
            "content":"<div class=\"\"><div> <span>You decide its now or never. You don't want to end up captive of some strange lady. YOu climp up the edge of the plastic bag and grab on to her dress, hoping she doesn't notice. \r<br>\n\r<br>\nAs she's walking you shimmy down her dress, then grab hold of her stocking and quickly slide down to the ground. The giant woman walks on to her car, oblivious to the fact that you've escaped her.\r<br>\n\r<br>\nYou are now in the middle of the paved parking lot of the supermarket. What do you do?</span></div></div>",
            "created":994654800,
            "id":62513,
            "title":"Bag check"
        },
        "111211":{
            "author_id":"tommiles5015",
            "author_name":"Barnabas Nightmare",
            "choices":[
                "Climb Mrs. Markovski.",
                "Commit suicide."
            ],
            "content":"<div class=\"\"><div> <span>You run to the nearest car. After you had done that, you decided to take a rest in front of a extremely huge tire. Unaware, the owner of the car had come back after putting her bags in the car. She was a big-boned blonde-haired manish woman who was also near-sighted and had a bad case of acne. She had started her car, which had gotten you attention because of your new size, was the sound of sonic booms. You turn and see in the sight of you horror, the tire was moving towards you. You run and turn as fast as you can, and with dumb luck, you survive. You walking in depression until you hit your face on the heel of a woman who was standing next to a tall, muscular man. You look up and suddenly a beacon of hope appears on your face. The man and woman is non other than the parents of your girlfriend, Dana.<br>\r\n<br>\r\n\"Dana, get your seat-belt on,\" said Dana's father. \"Okay, Daddy,\" said Dana, who got into the car while her parents put the bags in the back of their car. Meanwhile, you are screaming while being the size of an ant. You scream, \"Hey, Mr. and Mrs. Markovski, I'm down here!!!!!! Mrs. Markovski, I'm right down here next to you!!!!!\". Yet to them it was nothing. <br>\r\n<br>\r\n\"Okay, let's go, darling,\" said Dana's father. \"Yes dear, let's go home,\" said Dana's mother. You heard this and scream:\"NOOOOOO!!!!!\".<br>\r\n<br>\r\nWhat do you now? Try to climb Mrs. Markovski's shoe/feet. Or commit suicide?</span></div></div>",
            "created":1410622620,
            "id":1856331,
            "title":"Almost Flatten as a Pancake."
        },
        "111212":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "still in Dana's purse.",
                "On the counter...you were sleep walking again."
            ],
            "content":"<div class=\"\"><div> <span>You run back to the store and spot Dana heading to the checkout counter.  If you don't get her attention now, you will be stuck at the store.  Quickly you rush toward her sneaker and shout up to her, but she is so busy looking for her money, that she doesn't even hear you.  You immediately notice that Dana's purse is in your reach.  You get into it and hold onto Dana's lipstick case as she lifts it up and places it on her shoulder.  You hear her grab her groceries and fall asleep as she starts walking home, which by the way isn't far from the store.  When you wake up...you find yourself...where?</span></div></div>",
            "created":994827600,
            "id":63301,
            "title":"In Dana's purse."
        },
        "1112121":{
            "author_id":"littletoy",
            "author_name":"littletoy",
            "choices":[
                "Wait for Dana to open the purse and see you",
                "Climb up out of the purse for a look-see"
            ],
            "content":"<div class=\"\"><div> <span>You awake still in Dana's giant purse. Her personal effects are all around you. You are laying on a giant folded up Burger King napkin. Far above you a thin crack of light from the top of the purse is the only hint of the outside world.\r<br>\n\r<br>\nYOu notice that the purse has stopped swaying and is now stationary. You wonder if Dana arrived home and put the purse down on a counter top.\r<br>\n\r<br>\nYou decide to...\r<br>\n</span></div></div>",
            "created":995173200,
            "id":63973,
            "title":"Dana's home"
        },
        "11121211":{
            "choices":[
                "Puts you inside her shoe",
                "Dana has second thoughts."
            ],
            "content":"<div class=\"\"><div> <span>You decide just to stay put in the purse for now and wait. After a couple of minutes you see light shining in your face, Followed by a giant hand reaching in for you! You are not sure what to do, but you really have no choice as it plucks you by the shirt from and out of the purse. You are lifted face to face with Your giant girlfriend Dana, She smiles at you, And you smile back nervously at her.<br>\r\n<br>\r\n\"You know, Ive actually always wanted my own tiny man to play with.\" She says to you.<br>\r\n<br>\r\n\"I dont know if thats such a good idea right now!\" You squeek back at her. She just laughs back at you, Her warm breath hitting you like a wind storm and causes you to sway. You start getting a bad feeling about this.<br>\r\n<br>\r\n\"I got an idea.\" Dana says.<br>\r\n<br>\r\nYou swallow hard realizing this is not good at all...</span></div></div>",
            "created":1029387600,
            "id":116612,
            "title":"Dana's little Guy!"
        },
        "111212112":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Dana, she forgot her purse.",
                "Dana's mom,coming in to vacuum Dana's room."
            ],
            "content":"<div class=\"\"><div> <span>Dana's hand gets near you until suddenly she stops and begins to cry.  \"Wait, what am I doing?\" she asks herself as she looks down at you.  Dana realizes you're her boyfriend and not some toy to play with for her own pleasure.  Dana gently takes you in her hand and carries you up to her room.  You get comfy in her hand and cry a little because you almost became a toy.  Dana sets you on her bedside table.  \"Well, Greg, I have to run to the shopping mall.\"  \"I'm meeting up with Ashley and Jennifer to some shopping,\" she tells you as you sit on the table looking at her.  You nod your head and lay down on the table.  Dana leaves the door open a bit in case you get bored.  A few minutes go by and you hear footsteps.  You look from the table to see someone coming! It's...</span></div></div>",
            "created":1054270800,
            "id":159735,
            "title":"Saved."
        },
        "1112121121":{
            "choices":[
                "\"Yes,\" you nod.",
                "\"No,\" you play innocently."
            ],
            "content":"<div class=\"\"><div> <span>Dana had left her purse nearby on the table.  Each approaching footstep doubled the pounding in your chest and switched your thoughts from worry, to hope, to fear, to desperation.  You couldn't be separated from Dana again; she was your only protector.<br>\r\n<br>\r\nSkipping the standing phase, you leap into sprint.  Her purse is overturned and unzipped before you, a great, gaping cavern with metal stalagtites hanging down and stalagmites reaching up squarely.  Dana's humming invaded the room and your ears, an oblivious song to the air.  You crawl into the purse hastily, a careless dive which results in a bleeding palm.<br>\r\n<br>\r\nBefore you can even feel pain in your hand, Dana stands and lifts the purse, you are flung over a make-up kit and onto a pack of tissues suddenly.  Your weight increases; the purse is swinging around Dana's shoulder swiftly.  Settled, you tear off a strip of tissue and wrap it around your bleeding hand.<br>\r\n<br>\r\n\"Greg,\" Dana calls abruptly. \"You didn't run off already?\" The purse rocks and jerks as it impacts something beyond the cavern walls.  You hear Dana shuffling about, moving papers, and pillows, and you think a lamp may have been slid around, but soon enough light pervaded your secret cave.  Dana is looking down and scanning the purse, you try to hide yourself and your cut hand.  \"Oh, Greg,\" smiled Dana with relief.  \"Come on now.  Were you trying to stow away in my purse again?\"</span></div></div>",
            "created":1075525200,
            "id":186869,
            "title":"Forgotten"
        },
        "11121211211":{
            "choices":[
                "You look away in sadness.",
                "You turn and plead to her."
            ],
            "content":"<div class=\"\"><div> <span>You nod skyward, focusing more attention in concealing your red bandaged hand.  You look away defeated and wrap more tissue around your hand, packing it tighter around the soaked paper.<br>\r\n<br>\r\n\t\"Tsk tsk.\" Fingers dig under you anda hand shovels you from your lowly position for an ascent to the gods, or in this case, your girlfriend of goddess proportions.  You cower in her palm.<br>\r\n<br>\r\n\tA gentle breeeze blows over you, \"Look at me Greg.\"  You turn your head to meet Dana's soft lips.  You were acquainted with them many times before, but the warmness, pressure, and fluid feel now caress your whole body like never before.  It's an exhileration unlike any other, a first kiss with the young, nervous tension replaced with a comforting passion in crimson lipstick.  The contact is only momentary, but the touch remains on your skin, along with hints of deep red lip prints on your cheek and shirt. \"I have to go now,\" She pauses, a brief smile washes over her tingling lips. \"You understand.\"</span></div></div>",
            "created":1075525200,
            "id":186870,
            "title":"The Stowaway"
        },
        "11121212":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Climb out and get Dana's mom's attention.",
                "Stay...she might hurt you."
            ],
            "content":"<div class=\"\"><div> <span>It is getting kinda hot in Dana's purse.  She is probably upstairs doing homework, so you decide to climb out and explore.  As you grab hold of the top of the purse, you hear a door opening.  You look over the opening and see a beautiful woman, in her late thirties, with brown hair and blue eyes.  She is wearing a blue business suit, clear nylons, and a pair of blue medium heel pumps.  She lets Dana know she is home and then decides to pour herself a cup of coffee.  Well what should u do?  Maybe you could get Dana's mom's attention...</span></div></div>",
            "created":1000357200,
            "id":74122,
            "title":"The Mother enters the Kitchen."
        },
        "111212121":{
            "choices":[
                "Dana's mom decides to risk being late, and kindly takes you back home.",
                "Dana's mom decides to bring you to her workplace...a top-secret lab facility."
            ],
            "content":"<div class=\"\"><div> <span>  You jump up and down, waving your arms over head, and shouting at the top of your tiny lungs.  And, just as you're about to give up hope, she notices you!<br>\r\n<br>\r\n  Naturally, she gasps in astonishment.   <br>\r\n<br>\r\n   \"Greg?  Is that really you?\"  <br>\r\n<br>\r\n   \"Yes, ma'am,\" you reply.  Whereupon, you proceed to explain what happened to you a the store.  Dana's mother shakes her head, still only half-believing her eyes.   You then ask her if she will bring you home, so your own mother can see for herself what happened.<br>\r\n<br>\r\n   \"I don't know, Greg.  I'm going to be barely on time for work as it is.\" </span></div></div>",
            "created":1213769400,
            "id":545577,
            "title":"Climb out and get Dana's mom's attention."
        },
        "1112121212":{
            "choices":[
                "The two of you arrive at Generic Labs without incident.",
                "Dana's mom gets into a traffic jam, delaying the trip."
            ],
            "content":"<div class=\"\"><div> <span>  Since the death of her husband, Dana's mother has been seeking a second part-time job.   And, she explains that the one she just interviewed for, downtown, ran a little long.<br>\r\n<br>\r\n   \"So, I just barely have time to make it to the one I've got at Generic Labs!\"<br>\r\n<br>\r\n   You perk up at this information:  \"You work for a laboratory?\"<br>\r\n<br>\r\n    She laughs:  \"Well, yes.  But, only as a glorified secretary!\"<br>\r\n<br>\r\n    \"Still, you must know some of the scientists who work there.  Couldn't you introduce me to one of them?\"<br>\r\n<br>\r\n    Dana's mom taps on her chin with her left index finger, then she looks at her wristwatch.  <br>\r\n<br>\r\n    \"Very well!  Let's go.\"<br>\r\n<br>\r\n     Whereupon, she hastily puts you in her purse.  Muttering something about an apologetic explanation for Dana via cellphone. </span></div></div>",
            "created":1213770360,
            "id":545583,
            "title":"Dana's mom decides to bring you to her work..."
        },
        "11121212121":{
            "choices":[
                "The voice belongs to Dana's mom's immediate boss. ",
                "The voice belongs to Genevieve Ericson, herself."
            ],
            "content":"<div class=\"\"><div> <span>   You remain in Dana's mom's purse for about fifteen minutes or so.   During that interim, the stuff in the purse is jostled around for each pot hole that gets driven over.  That stops for a few moments, as you finally feel the car slow down.<br>\r\n<br>\r\n   You then hear the opening and closing of a car door.  In between which, the stuff in Dana's mother's purse begins to move around again.  Indicating that she is walking into the building where she works.  <br>\r\n<br>\r\n   Sure enough; when you are finally withdrawn from the purse, you see that you're on top of a metallic gray desk in an off-white,  plush-walled cubicle.  And, Dana's mom is smiling down at you.<br>\r\n<br>\r\n   \"Welcome to Generic Labs.  Are you all right?\"<br>\r\n<br>\r\n   You nod, adding:  \"Why is it called 'generic,' though?  Doesn't that mean 'ordinary?' \"<br>\r\n<br>\r\n   Dana's mom laughs:  \"Actually, it's a pun.   A play on words!   This place is owned by a very wealthy businesswoman named Genevieve Ericson.   And, the research done here isn't restricted to just one field of science.  Hence, 'generic' (which is the opposite of 'specific' ). \"<br>\r\n<br>\r\n   Suddenly, a very gruff voice speaks up from behind Dana's mother, addressing her by her last name.<br>\r\n<br>\r\n   \"Would you kindly explain what you're doing, when you're supposed to be catching up on your paperwork from yesterday?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1214434320,
            "id":548426,
            "title":"The two of you arrive at Generic Labs without i..."
        },
        "111212121212":{
            "choices":[
                "\"Let's go meet the head of my R & D Department.\" ",
                "\"Why don't I give you a guided tour...starting with my office?\""
            ],
            "content":"<div class=\"\"><div> <span>  Dana's mom turns around, and you stare in amazement at a woman even taller than her!<br>\r\n<br>\r\n  That woman introduces you to Genevieve Ericson, who is equally astounded (at least, for a minute or two) at the sight of you.   <br>\r\n  <br>\r\n  You note how slender she is (she used to be a supermodel).  And, how sexy her business suit--white blouse beneath khaki blazer with matching skirt and high-heels--makes her look.   But, her most initimidating feature is her face.  Beautiful, yet stern.  With long, reddish-orange hair (the kind alternately known as both \"carrot-top\" and \"strawberry blonde\"), and hypnotic green eyes.<br>\r\n<br>\r\n   \"So, you want to know if we can help you,hmmm?\" Ms. Ericson summarizes, when Dana's mom has finished explaining.  She then smiles and picks you up in her own enormous right hand.</span></div></div>",
            "created":1217360700,
            "id":562659,
            "title":"The voice belongs to Genevieve Ericson, herself."
        },
        "1112122":{
            "author_id":"tommiles5015",
            "author_name":"Barnabas Nightmare",
            "choices":[
                "Wake up, it's all a dream.",
                "Spider takes you away forever."
            ],
            "content":"<div class=\"\"><div> <span>You were now a big jackass. How could you let Dana Markovski go like that? You were almost home free, then you had to start sleep walking, again. What's worse the store is closed for the night. That's right, the store IS closed until tomorrow, which is hours from now. Then you began to say, \"It couldn't get any worser than this, right?\".<br>\r\n<br>\r\nWrong, because not only are you locked in for the night, but there's also a Black Widow spider that had spotted you and is now coming towards you. You turned and in a facial expression of horror, you see the spider and you began to ran. Ran as fast as you can until you reached the edge of the counter with the black spider right behind you. You decided to jump off the counter and suddenly smack head first into the store's floor, yet somehow you don't die, but you feel extreme pain. Suddenly, you turned your head and in another facial expression of horror, another Black Widow spider appears out of nowhere and also come towards you as well. You decided to run as fast as you can, again. You keep running until you see a web made by a brown fiddleback spider, which then you get caught in. <br>\r\n<br>\r\n\"Help!!!!! Help!!!!!!! Somebody for the Love of God, help me!!!!!!!,\" you scream, but nobody can heard you especially when the brown fiddleback spider is right on top of you. It's mouth is bitting your face off, yet nothing is happening to you except the extremely painful sensation you're feeling right now. You are crying, but it's not doing anything to help you so you drift off into darkness.<br>\r\n<br>\r\nWhat happened?</span></div></div>",
            "created":1410625500,
            "id":1856346,
            "title":"The Night of the Living Spiders."
        },
        "11122":{
            "choices":[
                "Bang on the glass wall and demand your freedom.",
                "Eat some of the cookie crumbs."
            ],
            "content":"<div class=\"\"><div> <span>You decide to wait and see where she takes you.\r<br>\n\r<br>\nShe carries the bag with you inside to her car.  Her giant smiling face peers down at you from the top of the bag as she checks up on you.\r<br>\n\r<br>\nEventually she arrives at her home and takes you out of the bag and places you on the dining room table. \"Please lady you have to help me. I need to try to get a hold of my family,\" you tell her. \"Don't worry little one. You're safe with me. I don't know where you came from but I'm going to take good care of you. Obviously your last owners were a little careless with you,\" she says. \"Please mam I'm not a toy or a pet; I'm a real person like you.\" She laughs at your statement and reaches down and grabs you in her hand. \"You are too small to be a real person. You are mine now and I'm never going to let you go. Let's see...this will have to do for now,\" she says as she reaches for an empty cookie glass cookie jar and drops you inside. </span></div></div>",
            "created":995259600,
            "id":64196,
            "title":"The Lady Takes you Home"
        },
        "111221":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Escape the house.  Her crying may be a fake.",
                "Walk over to her and get her attention."
            ],
            "content":"<div class=\"\"><div> <span>You're not too happy about being placed in a jar, so you immediately start pounding on the glass.  Suddenly the glass begins to crack...you hit a little too hard.  You can see the woman in the living room reading a magazine...so you decide to bang one more time.  Suddenly you create a hole in the jar, allowing you to escape.  You make it out of the jar and quickly climb down the counter and into a nearby mousehole.  You smile to see the woman return and scream to see that you have escaped.  Then you notice she is crying...saying that you looked so cute, blah blah.  Well what do you want to do?</span></div></div>",
            "created":996901200,
            "id":67606,
            "title":"What Luck!"
        },
        "1112211":{
            "author_name":"John_Smith",
            "choices":[
                "Try and fit under the front door",
                "Try and get down the garbage shoot"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see she's deeply upset but you don't care. You want to escape. You dont wan't to linger around in the mousehole for two long, the habitant may not welcome visitors.\r<br>\n\r<br>\nWhat's your escape route?.</span></div></span></div>",
            "created":997333200,
            "id":68515,
            "title":"What way?"
        },
        "11122111":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Go to the woman and hitch a ride.",
                "Take the long walk home."
            ],
            "content":"<div class=\"\"><div> <span>You quickly run to the front door of the woman's home and try to squeeze under it.  Amazingly you are able to get under it and appear outside! Yes your free.  Now you need to get back to your mom.  You could walk but that could take days, so you wonder what mode of transportation you want to take.  Suddenly a woman with brown hair, wearing a blue business suit with a medium skirt and a pair of black high heel pumps appears.  She is waiting for the local bus.  Maybe you could hitch a ride on her and take the bus home, or you could just walk and see how long it takes you to get home.</span></div></div>",
            "created":999752400,
            "id":73185,
            "title":"Freedom."
        },
        "111221112":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "On a girl's rollerblades.",
                "In the backyard of your neighbor's house, Mrs. Caroline."
            ],
            "content":"<div class=\"\"><div> <span>If you get on the bus, you will be surrounded by feet and accidentally get stepped on.  So you decide to make the long trek from this woman's house to your house.  As you start walking, you wonder: Is there something that will make this day great?  Suddenly, you spot something that will get you home faster.  None other than a grasshopper.  It is just sitting there.  Quickly you run to it and jump on its back, and in no time your journey to your home picks up speed as the grasshopper hops ahead.  Suddenly you fall and land...</span></div></div>",
            "created":1010811600,
            "id":88505,
            "title":"The Journey Begins."
        },
        "1112211122":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "She stands up and begins to walk away.",
                "A doll belonging to a 13 year old girl drops in front of you."
            ],
            "content":"<div class=\"\"><div> <span>You go flying off the grasshopper hoping to land somewhere less dangerous.  You land in huge blades<br>\r\nof grass.  Gasp! It's someone's yard, but sorry it's not yours. Why?  Cause the house that is a mile away belongs to your next door neighbor, Mrs. Caroline.  Darn you landed in the wrong yard!<br>\r\nWell the best idea would be to get to the back door which could take days..until you spot Mrs. Caroline herself.  She is looking for something in the grass.  You are standing next to it: her wedding ring!  If you can get it to her before she leaves and get her attention, then everything will be all right.  Quickly you grab the ring and charge toward Mrs. Caroline.  Suddenly...</span></div></div>",
            "created":1032930000,
            "id":122486,
            "title":"Backyard Adventure"
        },
        "11122111222":{
            "choices":[
                "You look back at what nearly squashed you.",
                "You run away as fast as you can."
            ],
            "content":"<div class=\"\"><div> <span>Above the peaks of grass, Mrs. Caroline's face frowns.  Resolute in hopelessness, she ends her search oblivious the tiny courier with her lost ring nearby.  She stands; you halt at the sheer size of the towering woman, and merely watch as she scans the grass for any glimmer of gold.  You swear she sees you standing below her, but only for a moment, then she turns and walks away.  You step forward, dragging the ring as she disappears over the high grass.<br>\r\n<br>\r\n\"Mrs. Caroline!\" you call out too late. \"Mrs!\" You push by green pillars and stumble over tiny pebbles.  The heavy ring makes progress slow, but youfocus on returning the ring.  A quiver in the grass around you; a wind blows.  The sway of the grass is much more animated from your new viewpoint, and it beats on your head and shoulders lightly.<br>\r\n<br>\r\nA great, white comet crashes into the soil and bounces in front of you.  The ring falls from your grasp; you drop to the ground.  Along with your heartbeat, you feel another rhythmic quake through your whole body, the whole world is shaking.  From beneath your shaking arms, you uncover your head and get to your feet and run away from the impact site.</span></div></div>",
            "created":1075611600,
            "id":187107,
            "title":"Sudden Impact"
        },
        "111221112221":{
            "choices":[
                "\"My name's Amanda.\"",
                "\"My name's Hannah.\""
            ],
            "content":"<div class=\"\"><div> <span>A shadow swallows your tiny strides; unable to escape, you slide to a stop.  You see the comet now as a large skull. \"Jack,\" you say, recognizing it as the grinning face of Jack Skellington.  As you study the plush face of the doll, you suddenly realize the owner of the shadow is standing over it.  You can see two skyscraping legs and a pair of green shorts high above you.  You see a young, bulging bust in black and a shining golden veil of hair draping down from a heavenly face.  Undoubtably, she stares down at you with wide open eyes and mouth.<br>\r\n<br>\r\n\"Oh, my god!\" she squeals, her face instantaneously in the grass beside you. \"Oh, my god!\" she bursts.  She had kicked away her doll so she could lie down in the grass to see you.  Her face is young and full of youthful glee as she stares at you; her long blonde hair flows into the grass.  She supports her awe heavy chin with her large hands and still smiles. \"Oh, my god.\" she says again, \"Who, what, oh, my god!\"  She laughs at herself, a beautiful sound that floods your senses.  Drowning in her as much as she drowns with you, you can only stand there and watch her reaction with a smile. \"Who are you!?\" she exclaims.<br>\r\n<br>\r\nWith your heart beating in your throat, you manage to choke out, \"I'm Greg!\" You shout, fearing she won't hear you otherwise.<br>\r\n<br>\r\n\"Oh, my god!\" she immediately shouts, her mouth dropping another story in awe.  You cover your ears; she smiles uncontrollably. \"Where did you come from? How did you get here? I can't believe you talk! I want to keep you!\" Her words are a single sentence streaming incoherently into your ears.  She suddenly sits back up and grabs her doll, but never takes her eyes off you.<br>\r\n<br>\r\nYou see she hasn't looked away, but you see the ring shining from a mound of dirt between her bare feet.  You look up at her, \"Here! Look here!\" you wave your hand and hop over to the half buried ring, her eyes following you and white teeth exposed and smiling the whole time.  You dig the ring from the loose soil and show it to the girl, \"Here!\"<br>\r\n<br>\r\n\"For me?\" she giggles, taking the ring, along with you, into her hand, \"And we just met!\" Her playful wit was enchanting in the open air.  She looked closely at it, \"Where did this come from, Little Greg?\"<br>\r\n<br>\r\n\"It's Mrs. Caroline's!\" You say, \"She was looking for it earlier!\"<br>\r\n<br>\r\nA flash of shock drops over her face.  'Her expressions are so animated,' you remark silently to yourself. \"Aunt Carol was looking for this!  And you found it Little Greg!  She'll be so happy!\" She bounces and you tumbled in her hand. \"Come on! Let's go give it to her.\" As she turns around she closes her fingers gently over you, but takes only a step before reopening them.</span></div></div>",
            "created":1075611600,
            "id":187127,
            "title":"Little Greg"
        },
        "111221112222":{
            "choices":[
                "You drift off to sleep as you try to calm.",
                "You begin a trek to the house."
            ],
            "content":"<div class=\"\"><div> <span>The grass waves as you say goodbye to the ring and find a safe distance from the huge object that crashed down.  Lungs pound in deep bursts.  Heart explodes and implodes with each beat.  A four minute mile within the confines of the Mrs. Caroline's backyard leads you to gnarled walls of brown bark.  You scramble over the rough mound and look back once you are safely behind it.<br>\r\n<br>\r\nA dark form huddles in the grass; you see a hand take up a small doll.  Short, black hair covers a young girl's face as she studies something in the dirt.  She takes the ring you dropped; holding it in her open hand, she runs off to the house.  Her tall, thin legs kicking high as she jogged.  You sink back behind the brown root to think and regain your breath.  Relaxation is a state that doesn't find you easily in the shade.  A rapid stream of thoughts carries you away whenever you feel at ease.</span></div></div>",
            "created":1075611600,
            "id":187111,
            "title":"Out of Breath"
        },
        "1112212":{
            "choices":[
                "stay were you are to waite for another oppurtonity ",
                "try to risk it all"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go and crawl to her shoulder to get her attention and she quickly grabs you and throws in one of her shoes lying next to the couch. <br>\r\nShe laughs at you as you watch in despair. She tells you to stay put or risk being stepped on. </span></div></span></div>",
            "created":1374808140,
            "id":1634314,
            "title":"Walk over to her and get her attention."
        },
        "12":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Get on her shoe and start climbing.",
                "Stay where you are."
            ],
            "content":"<div class=\"\"><div> <span>You decide to try to get Dana's attention later as you walk around trying to find other help.  As you enter the Dairy aisle, you spot a woman with brown hair.  She is wearing a black dress, a pair of black nylons, and black high heel pumps.  Her cart is next to you.  You climb onto the bottom part of the shopping cart and hold on as she moves on, looking for other things to buy.  She then stops at the meat section.  Her shoes are right next to you.  Do you want to get on them and climb up her to get to her purse? or do you want to just stay there and see where else she goes?</span></div></div>",
            "created":994482000,
            "id":62322,
            "title":"A ride on a shopping cart."
        },
        "121":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "At the woman's home in her purse.",
                "On the woman's hand."
            ],
            "content":"<div class=\"\"><div> <span>You get on the woman's shoe and try calling to her, but unfortunately, she is too busy buying what she needs.  You decide to start climbing the woman to reach her purse.  When you reach her waist, she begins walking, causing you to hold on for dear life.  She finally stops, allowing you to continue climbing.  You're getting very tired, but you make it into her purse and fall asleep.  When you wake up, you find yourself where?</span></div></div>",
            "created":995086800,
            "id":63789,
            "title":"Climbing the Woman."
        },
        "1212":{
            "author_id":"writerfan",
            "author_name":"WritingFan",
            "choices":[
                "Stay with Carol.",
                "Politely ask her to take you home."
            ],
            "content":"<div class=\"\"><div> <span>You wake up to find yourself on a smooth surface.  There are giant objects around you.  To your left is a black purse and to your right is a towering grocery bag.  You prepare to look behind you and when you do, you see a giant woman smiling at you.\r<br>\n\" Oh good, you are awake.  Don't be afraid, I won't hurt you, \" the woman says as she places you on the counter.  The woman explains to you where she found you, then tells you her name which is Carol.  Carol ask for your address and you give it to her.\r<br>\n\r<br>\n \"That is a bit far away from here.  Tell you what, why don't you stay with me.\"  \"I will take care of you.\"  Do you want this woman to take care of you, or do you want her to drive you back home.  What will it be?</span></div></div>",
            "created":1007614800,
            "id":83815,
            "title":"Meeting Carol."
        },
        "122":{
            "choices":[
                "The cart is moving and you aren't able to hop off safely with the rolling wh",
                "You arrive at check-out and stop.  Dana's nearby so you leap off the cart!"
            ],
            "content":"<div class=\"\"><div> <span>Your cart ride doesn't have the service you expected.  It's cold and shakes and squeaks, but at least the groceries above your head give you shade and cover from most eyes around.<br>\r\n<br>\r\nYou look around and see the aisle move slowly by.  You know the direction you're moving under power of the two gigantic legs behind you.  Had this woman wanted to go to the canned fruit aisle she would have made a left, the snack aisle a left, but no, she goes straight.<br>\r\n<br>\r\n\"Check out,\" you say startled by the briefness of the ride.  \"Oh, no.\"  Do I really want to go home with this woman?  I mean, Hell, I... wait!  Those shoes!  Those long black, baggy pants!  \"Dana!\"</span></div></div>",
            "created":1073883600,
            "id":184748,
            "title":"Check-Out Time"
        },
        "1222":{
            "choices":[
                "You let go off Dana's laces and venture out to her toes to see if this is yo",
                "You stay firmly attached to Dana's laces, determined to go home with your gi"
            ],
            "content":"<div class=\"\"><div> <span>The cart stops in the line and you leap from your rest under it.  You dash over the dirty tile floor, dodging a cart wheel and the woman's tapping feet.<br>\r\n<br>\r\nMuch to your luck, Dana came to the same line for checkout.  \"Dana!\" you shout up to her from far, far below, never ceasing your running.  You jump up to her shoe and hang on for the great love of life.<br>\r\n<br>\r\nYou climb carefully over the white rubber onto her black shoe, the laces offering more than ample support as she started to walk forward.<br>\r\n<br>\r\n\"Hey, Mom,\" Dana said in her happy, giddy voice from high above, \"I'm just going to go say 'hi' to a friend!  Be right back!\"<br>\r\n<br>\r\nDana skips and bounds her way along the check-out lanes and gives you quite the ride in the process.   Her large, flared pants envelope over you with each swing of her leg.  They come to rest over you as she stops.<br>\r\n<br>\r\n\"Hi, Julie!\" you hear Dana's voice say through the thick material surrounding you.<br>\r\n<br>\r\nJulie?  The same Julie from athletic club?  You wonder if this could be the same strong, pretty girl you knew from athletic club the year before.  Certainly your school had no shortage of Julie's, but your mind only connects this one's face to the name!  It had to be!  </span></div></div>",
            "created":1073883600,
            "id":184750,
            "title":"Oh, Thank Dana!"
        },
        "12221":{
            "author_id":"pily1",
            "author_name":"Pily1",
            "choices":[
                "Takes a bath",
                "Goes to bed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>IT'S THAT JULIE!!!!<br>\r\nYou jump on her shoes and inch your way up to her breasts.<br>\r\nYou feel a jolt as you get stuck there<br>\r\nWhen Julie gets home,she</span></div></span></div>",
            "created":1328933400,
            "id":1274584,
            "title":"You let go off Dana's laces and venture out..."
        },
        "122211":{
            "author_id":"pily1",
            "author_name":"Pily1",
            "choices":[
                "Wiggle and hope she notices",
                "Go to sleep"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You scream as the soap is applied,and you are about to pass out when she dries herself off.<br>\r\nShe then goes and watches TV not knowing you are jammed in her breasts.<br>\r\nYou decide to....</span></div></span></div>",
            "created":1328933520,
            "id":1274587,
            "title":"Bathtime!"
        },
        "1222111":{
            "author_id":"pily1",
            "author_name":"Pily1",
            "choices":[
                "Wait",
                "Sleep"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><font class=\"size5\" style=\"\"><span class=\"clred\">F</span>A<span class=\"cborange\"></span>I<span class=\"cbgreen\"></span>L<span class=\"cindigo\"></span></font></span></div></span></div>",
            "created":1328933640,
            "id":1274589,
            "title":"Wiggle"
        },
        "12222":{
            "choices":[
                "You open your eyes with a firm grasp on her shoelaces.",
                "You open your eyes with a searing sensation beneath you."
            ],
            "content":"<div class=\"\"><div> <span>Whether it was the pretty, blonde Julie you knew or not, you are not about to let go of those wondrous laces of your gigantic girlfriend now!  The girls conduct their conversation as teen girls do.  You overhear something about them meeting later, but you're unsure just what it was.<br>\r\n<br>\r\n\"Gotta go!\" Dana says and bounces back to her mother quickyl.<br>\r\n<br>\r\nHer steps become slower and your relax, the gentle bobbing of her shoes and swishing of her pants a soothing rhythm in this sudden confusion of events.  You feel safe, secure, protected by the girl you once protected.<br>\r\n<br>\r\nThe temperature rises very quickly all around you.  You feel your head dizzying in these sudden waves of heat emanating from somewhere around Dana's feet.  You recall how the sun had baked your bare neck earlier and not much time could have passed since you suddenly found yourself with the perspective of a mouse.<br>\r\n<br>\r\nYou peer as far over Dana's shoe as your grasp and black pant tent will allow and see a rocky black floor below.  You're being carried across the sun scorched parking lot.  The heat swells with each pounding step bouncing you up and down.<br>\r\n<br>\r\nYou'd be surprised how you don't feel nauseous, but your head spins in a distorted blur too much to concentrate.  All you know can feel is the sweat rolling over your body and your grasp, weakening rapidly.<br>\r\n<br>\r\nA blackness clouds your vision partially, but it fades.  You crawl forward, stumbling through your own heat exhaustion.  You close your eyes and reach for a higher lace to hold on to.  All goes black.<br>\r\n<br>\r\n</span></div></div>",
            "created":1073883600,
            "id":184779,
            "title":"Not Going Anywhere!"
        },
        "122221":{
            "choices":[
                "You stay on her shoe where it's safe for the ride.",
                "You climb off and explore within the safety of the car."
            ],
            "content":"<div class=\"\"><div> <span>\"What!?\" you open your eyes startled. \"Where!?\" you squirm about, constricted and confused.  You calm and feel about your tied down body.  You feel that familiar nylon texture holding you down.  You must have crawled under her criss-crossed laces before blacking out.<br>\r\n<br>\r\nYou notice she's no longer moving, and you hear music and voices from above.  You gingerly slide out from beneath your snug nylon net and see what must be a square, grey carpet far below Dana's shoe.<br>\r\n<br>\r\n\"Ah,\" you sigh, \"the car.\"</span></div></div>",
            "created":1073883600,
            "id":184780,
            "title":"Tied Down"
        },
        "1222211":{
            "author_id":"pily1",
            "author_name":"Pily1",
            "choices":[
                "In her shoe",
                "Tied to her ankle bracelet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go into Dana's shoe and wedge yourself between her giant toes.<br>\r\nYou pass out and you are.....</span></div></span></div>",
            "created":1328933220,
            "id":1274581,
            "title":"Pebble....O_o"
        },
        "1222212":{
            "choices":[
                "You head around her shoes to ascend the center console.",
                "You ascend the seat above you to meet your mighty girlfriend."
            ],
            "content":"<div class=\"\"><div> <span>Confident you're safe inside the car, and rather weary of straddling Dana's shoe for dear life, you gently guide your way over Dana's show and drop somewhere beside her heel.  You feel the rough carpet awash with sand grains and almost wished you hadn't moved.<br>\r\n<br>\r\nYou look ahead and see the brake pedals. \"Dana's driving!\" You say shocked and a bit frightened, remembering a time when you took her driving which almost resulted in a rapid ride to the emergency room.<br>\r\n<br>\r\n\"Nice,\" you admire her smooth improvements and barely notice the sudden jerks even at your small, vulnerable stature.</span></div></div>",
            "created":1073883600,
            "id":184782,
            "title":"Down for a Ride"
        },
        "12222122":{
            "choices":[
                "You squeeze behind her to explore.",
                "You approach her and attempt to scale her thighs."
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" you say decisively, \"What am i waiting for?\"  You turn and look up at the great leather perch over your head.  Sure, perhaps oversure, you can reach it, you jump up.  You hand contacts the warm lip, but fingers fail and you roll down the incline, directly under Dana's raised left foot \"Woah!\" you exclaim, rolling out of the way, expecting her shoe to come down on you any second.<br>\r\n<br>\r\nYou try once again scaling the seat, this time utilizing the nearby door frame to push off of. \"Yes,\" you struggle but succeed in pulling your small body to the seat's pleasantly warm cushion.  There Dana's clothed cushion sat a good twenty feet away.  You pause.<br>\r\n<br>\r\nYou crane your neck upward and scan your mighty mega girlfriend for the first time from your new perspective. \"Woah...\" falls from your gaping mouth in solid awe.</span></div></div>",
            "created":1073883600,
            "id":184785,
            "title":"The Leather Ledge and the Warm Rooftop"
        },
        "122221221":{
            "choices":[
                "You take a metal pin from her pocket.",
                "You press onward into Dana's shadow and ignore the pins."
            ],
            "content":"<div class=\"\"><div> <span>While the sight of your once small, delicate girlfriend towering fifteen stories above you is awe inspiring of a wet dream, you feel your stomach writhe in emptiness, and no beautiful sight could change that.<br>\r\n<br>\r\nDana was oblivious to your prescence and you would rather keep it that way. \"At least while she's driving...\" you murmur to yourself, as if anyone around would hear your tiny voice above the radio rock and their own conversations about a new color dress, or shoes, or wallpaper, or maybe it was shoes, you're not sure.  You're more intent on sliding behind Dana's bottom as she leans forward, focused on her driving duties.<br>\r\n<br>\r\nA row of safety pins fastened on Dana's pocket catches your attention.  Dana once described them as \"cute\", due no doubt to their small size, but you find them now as large as swords.  \"Could I?\"</span></div></div>",
            "created":1073883600,
            "id":184788,
            "title":"Awe Inspiring of a Wet Dream"
        },
        "1222212212":{
            "author_id":"wiilink100",
            "author_name":"wiilink100",
            "choices":[
                "Completly naked",
                "Asleep on her bed."
            ],
            "content":"<div class=\"\"><div> <span>You get farther and farther into the shadow. Starting to get wedged against the seat and your giantesses pants. Just as you feel you're in a safe spot and you start to calm down. Dana shifts a little crushing you inbetween her and the seat. Its a situation you woudl be able to get used to because of where you are with Dana, butt it sucks because you're getting crused agaisnt the seat. \"I guess I can't complain, its something I always wanted.\" You think to yourself trying to ignore the pain of being sat on. You assume you black out again because the next thing you know there less weight on you and there is more of a fabric feel on your back. As you come to you figure out that you stuck to Dana's pants. Which have now been thrown on the floor in her room. You squirm out from under them and see Dana...</span></div></div>",
            "created":1373027220,
            "id":1622875,
            "title":"Home"
        }
    },
    "info":{
        "author_id":"writerfan",
        "author_name":"WritingFan",
        "brief_description":"A boy is shrunk to 2 inches tall on Friday the 13th.",
        "created":994558020,
        "description":"<td align=\"left\" class=\"norm\">Your name is Greg, you have a girlfriend named Dana, and you live with your mom, Janet, and your 15 year old sister, Kim.  It is Friday the 13th, and you have had a rough day at school.  Your mom tells you to go to the grocery store and get a few things.  At the store, you are blinded by a white light and shrunk to a height of 2 inches tall.  Your adventure starts here.  No gay stuff, no toilet stuff, no sex scenes.  Rate please thanks and add chapters if you READ.</td>",
        "id":187424,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1568351880,
        "modified":1568351880,
        "pretty_title":"My Worst Day Ever"
    }
}