{
    "chapters":{
        "1":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Rihanna",
                "Katy Perry",
                "Mila Kunis",
                "Beyonce",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>At 3ft tall you never exactly had a normal life. Unlike most dwarfs you had the physical structure of a normal person. You stopped growing at about 3 or 4 years old and were pretty much an outcast. Your family thought something was wrong with you and once you reached 13, they disowned you out of shame. Screw them. But you did need them for food, drinks, shelter, love, care, etc. Also you never really had friends as people were rather embarrassed to be seen around you. Overall you kinda hated life, no one to be with in your life. At least you had some money from your account to fall back on.<br>\r\n<br>\r\nA few years later you were pretty much the same as a few years before. Still desperate, but now you were on the edge. You had no money now as you couldn't get a job. No one would hire you. You were then walking down the road, feeling completely down, when a black limousine pulled over beside you. The driver got out and opened the door for the person inside. You saw a high heeled foot step out, and you then saw who it was. It was the female celebrity...</span></div></div>",
            "created":1341723600,
            "id":1374362,
            "title":"Limo Of Possibilities"
        },
        "11":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Gentle",
                "Dominant"
            ],
            "content":"<div class=\"\"><div> <span>Rihanna! Wow, of all people you weren't expecting it to be the Barbadian megastar Rihanna, who compared to you really was quite mega. She got out of the limo looking massive as always <a rel=\"nofollow\" href=\"http://www.flickr.com/photos/40466689@N05/7517683416/in/photostream\" target=\"_blank\">http://www.flickr.com/photos/40466689@N0...</a> and was walking towards you. You looked up at her in awe, both amazed by her beauty and intimidated by her height. You only barely reached the top of those insanely long legs. \"Hello there, you seem down. Are you OK?\" It seemed Rihanna was actually concerned how you were. \"No, I have no money, no family, no friends, no job, nothing. But I won't bother you though with my problems.\" You just realized the depths of your despair and were beginning to get a bit teary. However this proved Rihanna did indeed care about your feelings.<br>\r\n<br>\r\nRihanna bent down and gave you a warm embrace. It had been so long since you had a hug from anyone and you started to cry into Rihanna shoulder. \"There there, it's okay. How about you come live with me? All the food you want, drinks and you can sleep in with me. What do you say?\" she asked you with a gentle smile. This was one incredible opportunity out of nowhere. You stopped crying. \"Yes please Rihanna. I'll be good in return.\" Rihanna smiled again and gave you a wink. \"Alright then, let's go home.\" That said Rihanna lifted you with little effort like a baby and got into the limo with you sitting on her lap. It felt nice being held by Rihanna who was stroking your head. You fell asleep for a bit in her arms and it was one great nap.<br>\r\n<br>\r\nHow would Rihanna be to you?</span></div></div>",
            "created":1341723600,
            "id":1374394,
            "title":"Barbadian Queen"
        },
        "111":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "You wake up first.",
                "Rihanna wakes up first.",
                "You wake up at the same time, looking into each others' eyes."
            ],
            "content":"<div class=\"\"><div> <span>Rihanna had gotten out of the limo with you still in her arms snug and asleep. She held you in her arms and was singing a lullaby to you as she got into the house and up the stairs into her bedroom. In your sleep you could faintly hear her beautiful voice singing softly to you. It sounded lovely. It was rather late so she tucked you into the bed and kissed you goodnight before getting into the bed herself. Rihanna then wrapped her arm around you which felt nice now that for once in your life you felt like you were loved. And of all people it was this caramel vision. That night you had the best sleep you had ever had and you would rightfully expect more of those in the future.</span></div></div>",
            "created":1341810000,
            "id":1375283,
            "title":"A Loving Carer"
        },
        "1113":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "You and Rihanna consummate your new relationship.",
                "You and Rihanna go out in public.",
                "You and Rihanna have breakfast together."
            ],
            "content":"<div class=\"\"><div> <span>It was like the most romantic scene from a movie, where the main characters from the movie realize that it has to be true love. But this wasn't a movie, and the day before, this isn't how you had envisioned waking up. Not in a comfy bed, not in a clean bed, and most of all, not waking up to the beautiful goddess Rihanna. It was precisely 12 noon, and the two of you woke up looking into each others eyes. You stared into her hazel eyes, hypnotized, and she looked into your eyes aswell with a soft smile. She moved gradually closer to you, wrapping herself around you in a seductive way and you two began to passionately kiss. After what seemed like forever, not like you're complaining Rihanna gave an amazing suggestion. \"I got an idea. How about we be boyfriend and girlfriend?\" she asked with a smile. It was one of sweetness and one that wanted you to say yes.<br>\r\n<br>\r\nHow could you you refuse? She was a perfect goddess and also you daren't say no to her after all she's done. It was a case of both wanting to beyond desire and having to or risk disappointment. \"Of course Ri-Ri, I'll be your boyfriend.\" Rihanna smiled at you and gave you a hug that covered all of you. It felt wonderful.</span></div></div>",
            "created":1342062300,
            "id":1376673,
            "title":"Romance Defined"
        },
        "11131":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "You both have a quick nap.",
                "Rihanna takes you shopping."
            ],
            "content":"<div class=\"\"><div> <span>Rihanna gently picked you up and laid you down on her torso and whispered seductively to you. \"Let's consummate this new relationship, what do you say?\" The question made your eyes widen as well as your smile. \"Yes please Ri-Ri!\" you said slowly going downwards on her until your rock-hard dick was directly positioned on her waiting pussy. Surprisingly the night before she bought some condoms for your size. She must have been planning this. You had no complaints though. Why would you? You suddenly got a bit nervous. You never had sex before. And she did. Thoughts ran through your head: What if Rihanna wasn't satisfied? Would your size make it less enjoyable for her? How would you feel afterwards? You had to say something. \"Would my size make it less enjoyable for you Ri-Ri?\" Rihanna looked, surprised but understanding. \"Of course not. Size doesn't matter for me. Just do your thing, you'll be good. Trust me.\" You did trust her, and you were once again comforted by her.<br>\r\n<br>\r\nYou got to it. Wow. You were having sex with Rihanna who by now was absolutely moaning in sheer pleasure. At least you were good at it. You continued to ride her until eventually she had a multitude of orgasms. Her smile of pleasure was obvious and she held you tightly as she writhed in pleasure. After a good while she loosened her grip and held you more gently. She stroked your head, aware that you like it. \"That was honestly the best sex I ever had. You're one really good little fella.\" Rihanna said to you with a smile. \"That's great. I enjoyed myself a ton too.\" She was glad you both felt great. You then started to embrace each other warmly and were so happy about it all.</span></div></div>",
            "created":1344304560,
            "id":1399088,
            "title":"Euphoria"
        },
        "15":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Kim Kardashian",
                "Michelle Keegan",
                "Jessica Alba",
                "Mariah Carey",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could it be?</span></div></span></div>",
            "created":1341723600,
            "id":1374369,
            "title":"More Candidates"
        },
        "155":{
            "author_id":"destinydueler",
            "author_name":"destinydueler",
            "choices":[
                "Taylor Swift",
                "Lucy Hale",
                "Another"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Taylor Swift or Lucy Hale?</span></div></span></div>",
            "created":1433769360,
            "id":1989458,
            "title":"Someone else"
        },
        "1553":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "yes",
                "no",
                "yes and with Gwendoline Christie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Daisy Ridley?</span></div></span></div>",
            "created":1450729380,
            "id":2077638,
            "title":"Daisy Ridley"
        },
        "15532":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Iggy Azalea</span></div></span></div>",
            "created":1450731480,
            "id":2077659,
            "title":"no"
        },
        "155322":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kourtney Kardashian</span></div></span></div>",
            "created":1450731540,
            "id":2077661,
            "title":"No"
        },
        "1553222":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Khloe Kardashian</span></div></span></div>",
            "created":1450731600,
            "id":2077662,
            "title":"No"
        },
        "15532222":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kendall Jenner</span></div></span></div>",
            "created":1450731600,
            "id":2077663,
            "title":"No"
        },
        "155322222":{
            "author_id":"maner",
            "author_name":"Lolol man",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kylie Jenner</span></div></span></div>",
            "created":1450731660,
            "id":2077665,
            "title":"No"
        },
        "1553222222":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Yaaaaa",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ariana Grande</span></div></span></div>",
            "created":1472795340,
            "id":2204941,
            "title":"No"
        },
        "15532222222":{
            "author_id":"speedy1242",
            "author_name":"speedy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Conor smulders</span></div></span></div>",
            "created":1500793440,
            "id":2357989,
            "title":"Nope"
        },
        "155322222222":{
            "author_id":"speedy1242",
            "author_name":"speedy",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Victoria justice </span></div></span></div>",
            "created":1500793440,
            "id":2357990,
            "title":"No"
        },
        "1553222222222":{
            "author_id":"spongebob1234",
            "author_name":"Trisha",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Betty White</span></div></span></div>",
            "created":1502216280,
            "id":2366645,
            "title":"No"
        },
        "15532222222222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Emma Watson",
                "Maisey Williams",
                "Millie Bobby Brown"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about...</span></div></span></div>",
            "created":1523911500,
            "id":2480492,
            "title":"no"
        },
        "155322222222223":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "Slave auction",
                "Beggar on street"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she come to posses you?</span></div></span></div>",
            "created":1523953560,
            "id":2480670,
            "title":"Millie Bobby Brown yes"
        }
    },
    "info":{
        "author_id":"jdtd7197",
        "author_name":"jdtd7197",
        "brief_description":"At 3ft tall you have nothing until a female celebrity takes you in.",
        "created":1341795240,
        "description":"<td align=\"left\" class=\"norm\">You're a normally formed young guy, only you're 3ft tall. At some point a female celebrity finds you and takes you in.<br>\r\nThey can be either gentle or dominant.<br>\r\n<br>\r\nSome notes:<br>\r\n- NO other males<br>\r\n- Gentle refers to a caring, loving owner and possibly with benefits.<br>\r\n- Dominant means she likes to rule over you and enjoys displaying her power, such as walking you with a leash. Benefits may still apply. It doesn't mean a mean owner.<br>\r\n- For dominant and gentle NO beatings. A once-off smacking is OK but nothing much.<br>\r\n- NO killing off either character.<br>\r\n- NO nonsensical chapters. Allow them to at least make some sense.<br>\r\n- Punctuation a necessity and paragraph structure recommended. If no paragraphs at least make it a good read and making sense.<br>\r\n- Nothing graphic<br>\r\n- One celeb per story, unless they're sisters.<br>\r\n- Only female celebs<br>\r\n- Just because you start off at dominant doesn't mean it must stay that way. She can have a change of heart and become gentle. THIS DOES NOT APPLY WITH GENTLE THOUGH, ONLY DOMINANT.<br>\r\n<br>\r\nHave fun and enjoy!</td>",
        "id":1878457,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1523953560,
        "modified":1523953560,
        "pretty_title":"A Female Celebrity As Your Owner"
    }
}