{
    "chapters":{
        "1":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "One of your family members",
                "Dean",
                "Lauren",
                "Brock",
                "Silena"
            ],
            "content":"<div class=\"\"><div> <span>It's Saturday. <br>\r\nYou don't have a job. You don't have a girlfriend. <br>\r\nSo you go online to the iTunes App Store and look for something new. <br>\r\n<br>\r\nYou look under the Featured stuff, and you see an app called Swapp!. It's free, so you figure what the hell. <br>\r\n<br>\r\nWhen you open the app, and read the user guide, you don't believe a single word of it. <br>\r\n<br>\r\nStill, being able to swap bodies and stuff, that could be pretty cool. So you decide that you should try it out on...</span></div></div>",
            "created":1334120400,
            "id":1313632,
            "title":"Chapter One"
        },
        "11":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Your mom reading a book",
                "Your dad watching the Lakers game",
                "Your sister Gwen painting her fingernails",
                "Your sister Lily watching Degrassi",
                "Your sister Shelby watching Phineus and Ferb"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go to the living room and find...</span></div></span></div>",
            "created":1334120400,
            "id":1313635,
            "title":"One of your family members"
        },
        "111":{
            "author_id":"yoshikingll",
            "author_name":"GoneToTheDogs",
            "choices":[
                "You decide to go for something simple first, so you switch Hair",
                "You decide to try something big, so you take your mother's entire wardrobe",
                "You decide on something gigantic, so you take your mother's interests"
            ],
            "content":"<div class=\"\"><div> <span>In the living room, you find your mother sitting there, reading a book.<br>\r\n<br>\r\n\"This could be fun...\" you started to say, so you brought up the app and hit the scan, putting your mother up on the screen.<br>\r\n<br>\r\n\"Hmmm... now what to swap...\"<br>\r\n<br>\r\nYou could go for something simple... but why not go all in?</span></div></div>",
            "created":1347944400,
            "id":1430414,
            "title":"Your mom reading a book"
        },
        "1111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping with mom",
                "Find a new target",
                "Stay like this for a while"
            ],
            "content":"<div class=\"\"><div> <span>After you pressed the button a bright flash appeared, and then your scalp started tingling, and your hair grew out with more volume and turned lighter, until you had your mothers light brown shoulder lenght hair.<br>\r\n<br>\r\nYou stared at your mother with your previously owned cleancut dark brown hair.<br>\r\n<br>\r\n\"Het mom, do you notice anything new about me?\" You asked<br>\r\n<br>\r\n\" not really, why?\"<br>\r\n<br>\r\n\"Did you notice my hair?\"<br>\r\n<br>\r\n\" it looks wonderful as always Blake, now im going to keep reading if you dont mind\"<br>\r\n<br>\r\n\"Awesome!\" You say to yourself</span></div></div>",
            "created":1420693200,
            "id":1915111,
            "title":"You decide to go for something simple first, so..."
        },
        "11111":{
            "author_id":"deathwizerd",
            "author_name":"Kenashcorp",
            "choices":[
                "Get your mother's amazing body",
                "or keep swapping small"
            ],
            "content":"<div class=\"\"><div> <span>You look over the menu for other things to swap when you come across a certain button labeled \"swap all\". That got you thinking &lt;maybe... My mom is really hot and she wouldn't know anyway... But wouldn't it be a little weird?&gt;<br>\r\nyou keep thinking and decide on two options</span></div></div>",
            "created":1448773200,
            "id":2068260,
            "title":"Big or baby steps?"
        },
        "111111":{
            "author_id":"joeislolz",
            "author_name":"Joe",
            "choices":[
                "Swap lives",
                "Swap clothes"
            ],
            "content":"<div class=\"\"><div> <span>You activate the swapp app and then you slowly start to change. First, your feet start to grow more smooth and feminine. Then your legs became longer and they were shaved as well. Then, your penis begsn to suck into your body, cuaseing some extreme pain, and then out came your mom's vagina. Your chest began to look just like your mothers shape. Then you started to develop your moms amazing boobs. Finally, your face started to change and look exactly like your mothers. You look back at where your mom was sitting and see your body! You see your body wearing your mothers clothes, then you realize that you are still wearing your clothes on you mothers body, which was no big deal. You then asked your mom, in your mothers voice, \"hey mom, do you fell any different?\" . surprisingly, she said, in your voivce \"no honey i fell fine\" and she kept reading her (or his) book. You look back ay the app and see that you can either swap your lifes or swap clothes. What did you choose?</span></div></div>",
            "created":1451019600,
            "id":2079418,
            "title":"Get your mother's amazing body"
        },
        "1111111":{
            "author_id":"tjdrgo27",
            "author_name":"tir",
            "choices":[
                "You go to your mom's friend house and enjoy ",
                "You stripped yourself and enjoy your new womenhood"
            ],
            "content":"<div class=\"\"><div> <span>You figure out that being your mom would give you complete control over the family and you wont have to worry about school or anything anymore. When you push the \"swap lifes\" button, a flash of light hits you. You then wake up in your mothers bed. You check your moms (now your) phone and you see that its a monday and its time for your old body (now your son) to go to school. You go wake him up, and he doesnt seem to notice or remember anything about being a mother, and you dont notice or remember anything about being his son. You let your old body leave for school, then you have the house to yourself. You look at the mirror and smile <br>\r\nAnd you know that this body is yours and you can do anything you want. </span></div></div>",
            "created":1548855300,
            "id":2609737,
            "title":"Swap lives"
        },
        "11111111":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You change into 'your' male clothes and go",
                "You go to Shiela dressed as you are",
                "You change just your outer clothes, leaving mom's underwear",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>With your Mom gone you decided to get dressed.  You were wearing the pajamas you were wearing last night.  Even though you had your mother's body you still were wearing your own clothes.  Looking through the drawers in your mom's bedroom you realized that they contained boys clothing.  In all the excitement you forgot to swap clothes with your mother.  You knew that the master bedroom was your bedroom.  It looked the same as when it was mom's, the only difference (besides you being in it) was the clothes in the drawers.<br>\r\n<br>\r\nYou knew mom was at school and you had the entire house to yourself.  You went into your old room and looked around.  It was just as you had left it.  Then you looked through the drawers and saw your mom's apparel.  She had your body and your life, the life of a sixteen year old boy, but she still wore bras and panties and the alike.<br>\r\n<br>\r\nYou could swap with her, but instead you decided to just try on her clothes.  You stripped off your PJs and briefs and let them drop to the ground.  Then you looked through your former underwear drawer.  You saw panties in every shade of the rainbow, but there were three dominate colors: white, black and nude.<br>\r\n<br>\r\nYou picked up a nude pair of panties.  They had been resized to your old body, but they were still clearly panties and were shaped for a woman.  You put them on.  It felt off to wear your mother's panties, even though it felt totally comfortable to wear your mother's body.  You thought it was just an idiosyncrasy of the Swapp!  Next you found a bra in the same color and put on that one.  It also had been resized, but you got it on anyway.  <br>\r\n<br>\r\nNow you had to decide what you wanted to wear.  You decided to go for it, pantyhose, a skirt and a pretty top that no boy would wear.  Something with a U neck to show off your breasts and sleeveless to show your shaved underarms.  Just as before, you still felt a little weird wearing such girly clothing, but they fit your body in some ways much better than your regular clothes.<br>\r\n<br>\r\nFinally you put on shoes with a small heel to complete the outfit.  You were deciding whether to wear makeup or not.  You were leaning against it, as you didn't know how to put it on correctly anyway when your cell rang.  It was Sheila, one of mom's friends.  She wanted you to come over for some coffee.  You accepted.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1548868800,
            "id":2609845,
            "title":"You go to your mom's friend house and enjoy "
        },
        "1111112":{
            "author_id":"joeislolz",
            "author_name":"Joe",
            "choices":[
                "Put on the linguire",
                "Swap lives"
            ],
            "content":"<div class=\"\"><div> <span>You decide that you should wear your moms clothes on your moms body, so you push the \"clothes swap\" button. Your then wearing the outfit your mom was just wearing, and she was wearing yours. Your mom, again, doesnt notice any changes. You then go to your room and see that your dresser is filled with all of your moms clothes. you find a sexy linguire. Then you start to think about swapping lifes with her completely. What happens next?</span></div></div>",
            "created":1451019600,
            "id":2079419,
            "title":"Swap clothes"
        },
        "11111122":{
            "author_id":"joeislolz",
            "author_name":"Joe",
            "content":"<div class=\"\"><div> <span>You figure out that being your mom would give you complete control over the family and you wont have to worry about school or anything anymore. When you push the \"swap lifes\" button, a flash of light hits you. You then wake up in your mothers bed. You check your moms (now your) phone and you see that its a monday and its time for your old body (now your son) to go to school. You go wake him up, and he doesnt seem to notice or remember anything about being a mother, and you dont notice or remember anything about being his son. You let your old body leave for school, then you have the house to yourself. Instead of stripping down and doing dirty things a normal 16 year old would do with a female body, you go down and start reading the book you were reading yesterday. You and your old body act like nothing ever happened</span></div></div>",
            "created":1451106000,
            "id":2079426,
            "title":"Swap lives"
        },
        "1112":{
            "author_id":"vgm765",
            "author_name":"UlitmateNeo",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure?</span></div></span></div>",
            "created":1347944400,
            "id":1430434,
            "title":"Why do people do this?"
        },
        "11121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look down, and you are wearing your moms pink top and skinny jeans, as well as shoes and makeup. Your mom was still sitting, but now wearing your CoD shirt and baggy jeans, and dirty sneakers</span></div></span></div>",
            "created":1419483600,
            "id":1907426,
            "title":"Your moms wardrobe"
        },
        "11122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about her mannerisms?</span></div></span></div>",
            "created":1420606800,
            "id":1914717,
            "title":"no"
        },
        "111221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "You finish playing and decide to swap some more",
                "You keep playing or decide to do something else"
            ],
            "content":"<div class=\"\"><div> <span>After you pressed the button a bright flash appeared, disorienting you. You then talk to your mon<br>\r\n<br>\r\n\"\"My goodness im so dizzy, did you feel that mom?\"<br>\r\n<br>\r\n\"Shhh! Quiet Blake im trying to read! Sheesh!\" Answered your mom, now slouched on the couch, still reading\"<br>\r\n<br>\r\n\"Sorry dear, i guess ill go and play with my gadgets then\" you say referring to your videogames.<br>\r\n<br>\r\nWhile walking away you notice the new sway of your hips as well as the shorter strides. Once you get to your room you sit down and cross your legs in a very ladylike manner, grab te remote for your \"gadgets\" and start playing.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1420606800,
            "id":1914888,
            "title":"Sure"
        },
        "1112211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Mom",
                "Sisters"
            ],
            "content":"<div class=\"\"><div> <span>You enter the living room, now more comfortable with the way you walk, and find your mom slouching, your sister Gwen talking on the phone with her friends, your sister Lily watching TV and your sister Shelby playing with her dolls.<br>\r\n<br>\r\n\"Now \" you say, striking a feminine pose with your hands resting on your hips, \" who should i swap with?</span></div></div>",
            "created":1420606800,
            "id":1914894,
            "title":"You finish playing and decide to swap some more"
        },
        "11122112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Gwen",
                "Lily or shelby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which sister?</span></div></span></div>",
            "created":1420606800,
            "id":1914895,
            "title":"Sisters"
        },
        "111221121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body or Clothing",
                "Life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap with Gwen?</span></div></span></div>",
            "created":1420693200,
            "id":1915101,
            "title":"Gwen"
        },
        "1112211211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Clothing?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it??</span></div></span></div>",
            "created":1420693200,
            "id":1915103,
            "title":"Body or Clothing"
        },
        "11122112111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yeah",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about hair?</span></div></span></div>",
            "created":1420693200,
            "id":1915114,
            "title":"Body"
        },
        "111221121111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Swap with someone else",
                "Stay like this for a while"
            ],
            "content":"<div class=\"\"><div> <span>After the flash, you felt your head tingle, and your hair started to grow out, all the way to your mid-back, before turning golden blonde and with natural curls. Your sister now had your dark brown clean cut.<br>\r\n<br>\r\nYou walked away swaying your hips and flipping your hair, like your mom always does</span></div></div>",
            "created":1420693200,
            "id":1915140,
            "title":"Yeah"
        },
        "111221121112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yeah",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about mouth (incluiding voice)?</span></div></span></div>",
            "created":1420693200,
            "id":1915115,
            "title":"Something else"
        },
        "1112211211121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping with her",
                "Swap with someone else"
            ],
            "content":"<div class=\"\"><div> <span>After the flash, you felt your body tingle, and after that, you licked your liñs, and tasted cherry lipstick, you then called out to Gwen with your new soprano voice<br>\r\n<br>\r\n\"Hey gwen??\"<br>\r\n<br>\r\n\"What is it dillweed?\" She answered in your lower voice<br>\r\n<br>\r\n\"Oh, nothing\"</span></div></div>",
            "created":1420693200,
            "id":1915145,
            "title":"Yeah"
        },
        "1112211211122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Oh yeah",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about breasts?</span></div></span></div>",
            "created":1420693200,
            "id":1915116,
            "title":"Something else"
        },
        "11122112111222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Face",
                "Butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time to decide</span></div></span></div>",
            "created":1420693200,
            "id":1915117,
            "title":"Something else"
        },
        "11122112112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Everything",
                "Makeup, footwear and accesories"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What clothes?</span></div></span></div>",
            "created":1420693200,
            "id":1915106,
            "title":"Clothing?"
        },
        "1112211212":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Name",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What aspect in life?</span></div></span></div>",
            "created":1420693200,
            "id":1915119,
            "title":"Life"
        },
        "11122112121":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "Take your sister",
                "Complain to Mom",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You thought it would be funny to swap names with one of your sisters.  You didn't care which, it would be the first one you saw.  As luck would have it, Gwen comes into your room.  Usually you would be annoyed but not this time.  You quickly use the app to swap names and see what she wants.<br>\r\n<br>\r\n\"Hey,\" she says, \"I need you to drive me somewhere.\"<br>\r\n<br>\r\nShe didn't use your name.  This made sense since there was only the two of you there.  But you wanted to see if this worked so you said \"BLAKE,\" emphasizing your name.  \"where do you want to go?\"  Normally you wouldn't want to take her, but you had to.  You had just gotten your license and if you didn't drive your sisters everywhere (to help out your mom) then you wouldn't get the car when you wanted it.<br>\r\n<br>\r\n\"I'm babysitting for Bobby in fifteen minutes I need a ride and mom can't take me.\"  Bobby was a toddler that Gwen babysat sometimes.  He lived a little over a mile away.  You supposed that Gwen could walk it.<br>\r\n<br>\r\n</span></div></div>",
            "created":1516683600,
            "id":2444123,
            "title":"Name"
        },
        "111221121211":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You return home",
                "You go to the mall",
                "You go to get soemthign to eat"
            ],
            "content":"<div class=\"\"><div> <span>You rode quietly towards Bobby's house.  Gwen (whose name is now Blake) was listening to the radio.  You were deep in thought so you didn't argue when she changed the station to something she liked.  On the way you thought you could use your swap app not only to swap you but any two people.  You thought it would be really funny if Gwen the babysitter would be the one with the diaper and Bobby the toddler would be the one in the panties.  You would try that.<br>\r\n<br>\r\nSoon you got to the house and Gwen got out, you followed her.  \"Gwen! where are you going?\" she asked.<br>\r\n<br>\r\n\"I'm coming with you.\" you told her.<br>\r\n<br>\r\n\"Why, I can make it from here.\"<br>\r\n<br>\r\nThinking of an excuse you said.  \"I need a glass of water.  I have something in my throat.\"  Then you made several fake coughs.<br>\r\n<br>\r\n\"Whatever,\" she said annoyed.<br>\r\n<br>\r\nYou followed her to the door, making coughing sounds on the way.<br>\r\n<br>\r\nGwen rang the doorbell and Bobby's mother answered.  She was dressed for work in a business skirt suit.  \"Blake,\" she said referring to your sister, \"come right in.\"<br>\r\n<br>\r\nYou spoke up, \"I have something in my throat can I have some water?\" you said still coughing.<br>\r\n<br>\r\n\"Gwen of course you can.  Come in.\"  You followed her to the kitchen where she got a small glass and filled it with tap water.  Then she handed it to you.  You took a few quick gulps and thanked her for the water.  She then turned to leave.  It was at this moment that you decided to swap clothing with Bobby's mother.  You weren't sure what her name was.  You only saw her when you took Gwen over to babysit.<br>\r\n<br>\r\nIt only took a few moments before she was wearing your 'Call of Duty' t-shirt and jeans with sneakers.  Those were the clothes she would wear to her job.  You on the other hand was now wearing a skirt suit in a powder blue with a white blouse.  You could feel the bra around your chest even though you couldn't see it and the pantyhose on your legs.  You were also wearing her sensible heels and all her jewelry.  You assumed you were wearing her panties not that they felt much different than your briefs although it seemed a bit tighter.  You had no way of knowing that was the shaper she wore under her clothes to whip her lower body back into the shape it had before she had children.  You weren't sure if you were wearing her makeup until you looked into a mirror.<br>\r\n<br>\r\nDone with your water and seeing no reason to stay in the kitchen you followed Bobby's mother out.  In the living room, you saw Bobby on the floor playing with some toys and Gwen being the 'proper' babysitter engaged with his play.  You had almost forgot but your plan came back to you.  You swapped Bobby's diapers for Gwen's panties and the need to use them.  In Gwen's jeans you couldn't tell that she now wore Bobby's diapers (although they had been expanded to fit her frame).  But seeing as you were now leaving the house wearing a skirt and heels you assumed that it did work.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1516683600,
            "id":2444128,
            "title":"Take your sister"
        },
        "1112211212113":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You go to Burger King",
                "You go to Applebees",
                "Your mom phones you.  Says she wants you home."
            ],
            "content":"<div class=\"\"><div> <span>You found out how long your sister was going to be here and told her you would be back then to pick her up.  She was surprised you would be so nice, but you wanted to be back to swap your clothes with Bobby's mother.  You didn't think you would want to wear her clothes for the rest of your life.  You might change you mind, but no reason not to see Bobby's mother later in case you wanted everything put back to normal.  Not that you intended to swap Gwen back out of diapers.<br>\r\n<br>\r\nYou left the home and headed to your car.  In the car, you looked at yourself in the rear view mirror.  You were wearing makeup as you suspected.  What you didn't know until that moment was that you were wearing earrings in your ears.  This confused you since you didn't feel any pain and your ears hadn't been pierced before.<br>\r\n<br>\r\nYou didn't want to go home, you thought you should go somewhere where there was lots of people.  You could swap things with them or between them.  You decided to go to a restaurant.  That way you could sit and look around and there would be lots of people to swap with.  You started the engine of your car and grabbed the wheel.  Only then did you notice that you fingers had nail polish on them.  Yet another thing you hadn't noticed.<br>\r\n<br>\r\nWhere did you drive to?</span></div></div>",
            "created":1516683600,
            "id":2444181,
            "title":"You go to get something to eat"
        },
        "11122112121131":{
            "author_id":"itsme2",
            "author_name":"itsme",
            "choices":[
                "You enter the restaurant",
                "You chicken out and go home",
                "You make swaps from within your car"
            ],
            "content":"<div class=\"\"><div> <span>It felt different driving to Burger King.  You had never worn heels before, this effected how you stepped on the gas and break petal.  You were acutely aware of the hose on your legs and the skirt above that.  There was a pressure around your back and chest from your bra even though you didn't have any boobs that needed support.<br>\r\n<br>\r\nAt a stop light you looked down at your legs and skirt and shook your head.  In your car, you felt like you were alone.  But then you realized that you were going to go out into the public dressed as you were.  You thought no one would think anything was odd but you knew you were a man wearing women's clothing.  You were dressed from head to toe as a woman.  There wasn't any doubt of that.  Would people look at you and laugh?<br>\r\n<br>\r\nIt only took a few minutes to arrive at Burger King.</span></div></div>",
            "created":1516683600,
            "id":2444215,
            "title":"You go to Burger King"
        },
        "11122112122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Relationships</span></div></span></div>",
            "created":1420693200,
            "id":1915120,
            "title":"Something else"
        },
        "111221121221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Friends",
                "Romantic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Friendly or romantic?</span></div></span></div>",
            "created":1420693200,
            "id":1915124,
            "title":"Yes"
        },
        "1112211212212":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Swap with gwen",
                "Swap with stacy"
            ],
            "content":"<div class=\"\"><div> <span>After the flash, you heard your phone ring, you then found out it was your sisters boyfriend Brad, wo was kind of a jock. You answered.  (Remember: you still have your moms mannerisms)<br>\r\n<br>\r\n\"Hello?\" You asked while crossing your legs and sitting straight<br>\r\n<br>\r\n\"Hey honey bear\" said brad<br>\r\n<br>\r\nImmediatly after this you hung up. You walked down the stairs taking your time, and were surprised to see your sister Gwen and your girlfriend Stacy making out on the couch.<br>\r\n<br>\r\n\"Oh my\" you say to yourself \"this is hot!\"</span></div></div>",
            "created":1420693200,
            "id":1915130,
            "title":"Romantic"
        },
        "11122112122122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body or clothing",
                "Life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Body, clothing or life?</span></div></span></div>",
            "created":1420693200,
            "id":1915131,
            "title":"Swap with stacy"
        },
        "111221121221221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Clothing",
                "Body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it then?</span></div></span></div>",
            "created":1423285200,
            "id":1929105,
            "title":"Body or clothing"
        },
        "1112211212212211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "All of it!",
                "Nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you swap with her?</span></div></span></div>",
            "created":1423285200,
            "id":1929112,
            "title":"Clothing"
        },
        "11122112122122112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Top/bottom",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Top or bottom?</span></div></span></div>",
            "created":1423285200,
            "id":1929114,
            "title":"Nah"
        },
        "111221121221221121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Top",
                "Bottom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1423285200,
            "id":1929118,
            "title":"Top/bottom"
        },
        "111221121221221122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Underwear maybe...</span></div></span></div>",
            "created":1423285200,
            "id":1929115,
            "title":"Other"
        },
        "1112211212212211222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Makeup",
                "Accessories"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Makeup or accessories?</span></div></span></div>",
            "created":1423285200,
            "id":1929116,
            "title":"Time to choose"
        },
        "1112211212212212":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap hair with her?</span></div></span></div>",
            "created":1423285200,
            "id":1929106,
            "title":"Body"
        },
        "11122112122122122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap chests with her</span></div></span></div>",
            "created":1423285200,
            "id":1929107,
            "title":"No"
        },
        "111221121221221222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yeah!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap moths with her (this includes voice)</span></div></span></div>",
            "created":1423285200,
            "id":1929108,
            "title":"No"
        },
        "1112211212212212222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Butt",
                "Groin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time to choose</span></div></span></div>",
            "created":1423285200,
            "id":1929111,
            "title":"No"
        },
        "111221121221222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Name?     </span></div></span></div>",
            "created":1420693200,
            "id":1915134,
            "title":"Life"
        },
        "1112211212212222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gender? (You will only be treated as a girl, no physical change)</span></div></span></div>",
            "created":1420693200,
            "id":1915135,
            "title":"No"
        },
        "11122112122122222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Romantic (this will make you your sister's girlfriend)",
                "Friends"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Relationships?</span></div></span></div>",
            "created":1420693200,
            "id":1915138,
            "title":"No"
        },
        "111221121221222221":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Open incest",
                "Secret incest"
            ],
            "content":"<div class=\"\"><div> <span>Swapping romantic relationships with Stacy will make you her boyfriend, which would put the two of you in an incestuous relationship. In the new reality created by this swap, are the two of you openly dating, or are you keeping it a secret since incest is looked down upon?</span></div></div>",
            "created":1549036500,
            "id":2611028,
            "title":"Romantic (this will make you your sister's ..."
        },
        "1112211212212222212":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "“Hell yes!” Kiss her and take your clothes off",
                "“Better not. Someone might walk in” too weird, undo the relationship swap"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you find yourself in Gwen’s room, sitting on her bed, kissing her. Suddenly kissing your sister, despite knowing that you’d end up in a relationship with her, caught you off guard, causing you to stop kissing her for a moment.<br>\r\n<br>\r\n“What babe? Wanna have a quickie? Awesome!” She smiled as she unhooked her bra, which caused you to finally notice she didn’t have a shirt on, and one of your hands was on one of her breasts, while the other was behind her head. She was still wearing a skirt, but considering she was taking her bra off, and what she just said, you guess she won’t be wearing that skirt for long. “Let’s do it fast, mom or dad could be home any minute. We wouldn’t want anyone to right out about us after all.”<br>\r\n<br>\r\nYou watch as her bra drops, staring at her bare breasts. This was the first time you’d ever seen them. And boy were they glorious. They were even more magnificent than Stacey’s. “Well? We gonna do this or what?”</span></div></div>",
            "created":1563645840,
            "id":2689802,
            "title":"Secret incest"
        },
        "11122112122122222121":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Swap bodies with Gwen and try sex as a girl",
                "Enlighten Gwen, swap bodies with her, and try sex as a girl"
            ],
            "content":"<div class=\"\"><div> <span>“Hell yes!” This was too great an opportunity to pass up, so you immediately kiss her ferociously, taking your shirt off in the process and laying her on her back.<br>\r\n<br>\r\n“Geeze, what’s gotten into you all of a sudden?” She asked while you kissed her neck, moving your kisses down her body as you took her skirt off. “You’re usually not this vigorous, I think I like it!” You move back up and kiss her on the lips again while she undid your belt, and pulled your pants down. You stepped out of your pants while pulling her panties off. All the while the two of you continued passionately kissing each other. During all of this, you kept thinking a out how crazy this is. You never even thought about your sister in a sexual way before, even though you knew she was hot. Now, your doing things a brother and sister should NEVER do, and you’re loving every second of it. You know you shouldn’t, but you could always reverse the swap later, and no one would ever know you did naughty things with your sister. Not even your sister herself would know. What makes all of this even crazier, is the fact that you and Gwen never really got along before, but now you’re secretly DATING! You were about to enter forbidden territory, by inserting your penis into Gwen’s vagina, when she stopped you. “Wait.” You moved back a little to look into her eyes. You instantly got lost in her eyes, now seeing her in a new light. Being this close to her, you can see her eyes better than you ever have before, and can now see that they are beautiful. “Don’t forget the condom. If I got pregnant we’d be screwed.” Gwen reached between her mattresses and pulled out an unused condom.<br>\r\n<br>\r\n“Right. That would be bad.” You took the condom and began putting it on. You’re not sure it would matter if you swapped your new relationship with her away, but there was always the chance that your actions now would carry over to Stacey, making her pregnant instead of Gwen, so it was better to be safe than sorry. “Now let’s do this.” You started kissing her again, and picked up where you left off.<br>\r\n<br>\r\nA short time later, you lay on Gwen’s bed, completely spent, with her cuddling into you. “That was amazing.”<br>\r\n<br>\r\n“I couldn’t agree more, but we really should get up before someone finds us like this.” Gwen agreed.<br>\r\n<br>\r\n“Yeah, too bad.” Just then, Gwen’s phone started ringing and she grabbed it, looking at it while still cuddling in your arm.<br>\r\n<br>\r\n“Good news. Mom and Dad are going to be home late. And since Lily and Shelby are both at their friend’s for the night, which means we have the place to ourselves for a while.” She put her phone down, and kissed you on the lips. “And that means we don’t have to get up yet. Wanna go another round?”<br>\r\n<br>\r\nYou thought about her offer, you REALLY wanted to go another round. It was far better than sex with Stacey ever was. However, an idea came to your mind. What if you swapped bodies with her to try it from the other side? You always thought sex as a girl would feel better than as a guy, you just never thought you could ever try it. Now, with the swapp app, you can. And maybe you should ‘enlighten’ Gwen before you swap bodies with her. She might find it kinky and with your new relationship, the two of you are a lot closer so she would keep it a secret. So should you swap bodies with her and have sex in her body? And should you enlighten her before you do?</span></div></div>",
            "created":1563651300,
            "id":2689825,
            "title":"“Hell yes!” Kiss her and take your clothes off"
        },
        "111221121221222221212":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Furious",
                "Excited"
            ],
            "content":"<div class=\"\"><div> <span>“I have a better idea.” You grab your phone and explain the app to her, conveniently leaving out the swaps you have already made.<br>\r\n<br>\r\n“There’s no way. That’s not possible.”<br>\r\n<br>\r\n“Watch.” You scan her, then press enlighten, and immediately Gwen remembers her life dating Brad, as well as her life dating Stacey.<br>\r\n<br>\r\n“Holy shit! You weren’t lying!”<br>\r\n<br>\r\n“What? I haven’t even done anything yet.” You said, confused.<br>\r\n<br>\r\n“I remember everything before you used that app, AND I remember dating YOUR girlfriend! That’s crazy!”<br>\r\n<br>\r\n“Wait what? I didn’t know it would make you aware of swaps I already did.” You started to get nervous, the app said you can’t reverse ‘enlightenment’, and if she remembers her original life...how does she react?</span></div></div>",
            "created":1563651720,
            "id":2689827,
            "title":"Enlighten Gwen, swap bodies with her, and try s..."
        },
        "1112211212212222212122":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Let’s just swap with each other",
                "Let’s go with your idea and become Stacey and Brad"
            ],
            "content":"<div class=\"\"><div> <span>“Do you realize what this means? We can be or DO anything we want!” She smiled brightly.<br>\r\n<br>\r\n“You’re not...mad?” You asked, hesitantly.<br>\r\n<br>\r\n“Surprisingly...no.” She smiled sweetly at you, while caressing your cheek. “It’s probably because, even though I remember thinking of you as nothing more than a dork, I also remember loving you more than anything in the world. I know it’s because of the swaps you made, but that knowledge doesn’t change how I feel about you NOW. I still love you SO much.” She kissed your neck.<br>\r\n<br>\r\n“Well then, I’ve got an idea you might be interested in.” You smile at her while caressing her hair. “How about we try swapping bodies and have sex as each other? We could experience sex as the opposite gender.”<br>\r\n<br>\r\n“I have another idea.” She looked deeply into your eyes. “Considering I remember loving Brad, as well as Stacey AND you, how about we swap lives with Stacey and Brad, so we can date each other without needing to keep it a secret. And we can swap bodies with them, too, so it’s a little like all four of us are dating. Our minds and their bodies. And you can even be Stacey so you can try sex as a girl. What do you say?” She bit her lower lip while smiling at you, awaiting your answer.</span></div></div>",
            "created":1563652380,
            "id":2689832,
            "title":"Excited"
        },
        "11122112122122222121221":{
            "author_id":"dcnpkya",
            "author_name":"SenickHunder ",
            "choices":[
                "Explore your new body",
                "Explore new reality"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets just swap with each other Gwen I love you for who you are.\" you say as you kiss her.<br>\r\n<br>\r\n\"This is why I love you to.\" Gwen replies.<br>\r\n<br>\r\n\"How about I make you younger that way we are in school together?\" you ask.<br>\r\n<br>\r\n\"I get to be sixteen again lets do it and swap bodies\" Gwen squeals with joy.</span></div></div>",
            "created":1576775640,
            "id":2761634,
            "title":"Let’s just swap with each other"
        },
        "111221121222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yesss",
                "Noooo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gender (you will only be treated as the opposite gender, no physical changes£</span></div></span></div>",
            "created":1420693200,
            "id":1915121,
            "title":"No"
        },
        "1112211212222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Middle name",
                "Pesonality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time to choose</span></div></span></div>",
            "created":1420693200,
            "id":1915123,
            "title":"Noooo"
        },
        "111221122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Lily",
                "Shelby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it?</span></div></span></div>",
            "created":1420606800,
            "id":1914896,
            "title":"Lily or shelby"
        },
        "1112211221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body or Clothing",
                "Life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap with Lily?</span></div></span></div>",
            "created":1420693200,
            "id":1915098,
            "title":"Lily"
        },
        "11122112211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it?</span></div></span></div>",
            "created":1420693200,
            "id":1915099,
            "title":"Body or Clothing"
        },
        "111221122111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Whole body",
                "Something specific"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you swap with her?</span></div></span></div>",
            "created":1490245200,
            "id":2294047,
            "title":"Body"
        },
        "1112211222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Life"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What eill you swap with Shelby</span></div></span></div>",
            "created":1420693200,
            "id":1915096,
            "title":"Shelby"
        },
        "11122112221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Body or clothing?</span></div></span></div>",
            "created":1420693200,
            "id":1915100,
            "title":"Body or clothing"
        },
        "111221122212":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Top/bottom",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Top, bottom or something else?</span></div></span></div>",
            "created":1423285200,
            "id":1929124,
            "title":"Clothing"
        },
        "1112211222121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Top",
                "Botom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it top?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nOr is it bottom?</span></div></span></div>",
            "created":1423285200,
            "id":1929128,
            "title":"Top/bottom"
        },
        "1112211222122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You could swap footwear...</span></div></span></div>",
            "created":1423285200,
            "id":1929125,
            "title":"Other"
        },
        "11122112221222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Makeup and accesories",
                "All clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it makeup and accesories or everything</span></div></span></div>",
            "created":1423285200,
            "id":1929127,
            "title":"Last chance"
        },
        "11122112222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yess",
                "Noo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap first names?</span></div></span></div>",
            "created":1423285200,
            "id":1929119,
            "title":"Life"
        },
        "111221122222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Personality? It woulb be fun to see a teenage boy with a little girl's personality and an adult woman's mannerisms.</span></div></span></div>",
            "created":1423285200,
            "id":1929120,
            "title":"Noo"
        },
        "1112211222222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Friends",
                "Romantic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Relationships?</span></div></span></div>",
            "created":1423285200,
            "id":1929121,
            "title":"No"
        },
        "11122112222221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Go, and find new targets to swap with",
                "Reject the invitation"
            ],
            "content":"<div class=\"\"><div> <span>(Blake: mannerisms: Mom, friends: Shelby)<br>\r\n<br>\r\n\"Blaaaaaaake!!\" Your mom screamed<br>\r\n\"What is it mother\" you ask calmly<br>\r\n\"Michelle's Mom asked if you would like to go on a playdate with Michelle, are you going or not?\" Your mom asked with an annoyed tone.</span></div></div>",
            "created":1423285200,
            "id":1929123,
            "title":"Friends"
        },
        "111222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yeah",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe her name?</span></div></span></div>",
            "created":1420606800,
            "id":1914719,
            "title":"Nope"
        },
        "1113":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Swap with your mother",
                "Swap with another family member",
                "something elsew"
            ],
            "content":"<div class=\"\"><div> <span>You select you and your mother and select Interests.<br>\r\nYou select the swapp button.<br>\r\nYour mum is now on her iphone and you are sat down really getting into the book your mum was just reading.<br>\r\nLater on you had finished.<br>\r\n\"I didn't know reading was that much fun.\" You say.<br>\r\n\"Then why are you always reading?\" Your mum asks you, she is still on her iphone, rhetorically.<br>\r\nYou put the pbook down and pick your iphone back up.<br>\r\nIt is missing alot of stuff but it did have swapp still. </span></div></div>",
            "created":1351746000,
            "id":1457881,
            "title":"You decide on something gigantic, so you take y..."
        },
        "11132":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your sister, Gwen?</span></div></span></div>",
            "created":1419483600,
            "id":1907416,
            "title":"Swap with another family member"
        },
        "111322":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Lily (13)",
                "Shelby (7)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap with Lily or Shelby</span></div></span></div>",
            "created":1423285200,
            "id":1929104,
            "title":"No"
        },
        "112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Clothing",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of swap?</span></div></span></div>",
            "created":1420606800,
            "id":1914793,
            "title":"Your dad watching the Lakers game"
        },
        "1121":{
            "author_id":"elanston05",
            "author_name":"Elang ",
            "choices":[
                "Dad in your old body",
                "Mom/wife"
            ],
            "content":"<div class=\"\"><div> <span>This’ll be fun! He’ll love reliving his glory days for a bit while I’ll get to strut around as the king of the castle. I Thankfully dad was asleep so when the transferred occurred he’d still be asleep just in my body. Good Lord he was a beast of a man! Standing at 6’4 he was hairy from head to foot(little less on his head nowadays though) and he had muscles on top of muscles! You could wash clothes on his abs and as a kid I used to climb his long legs like trees. Ooh this was going to be fun! Now let’s get this party started! I flipped the switch and the world went dark for a second and then I woke up in a seated position in front of the tv. Holy crap this worked! I leaned forward and felt the weight of my new body!! Then suddenly felt an extreme urge to go take a piss! So stumbled up(still getting used to the new height and weight) and stumbled to the bathroom. He the switch and when the light came, I saw my dad’s deep green eyes staring back at me! I would’ve looked longer but my bladder was about to burst! So I pulled his shorts down and to my very pleasant surprise out a very thick and soft 6.5 inches of cock! My God my dad was part horse! In my old body was big but not Mr.Ed big! Finally I just the stream flow and as it did i felt my new dick getting a thicker! Oh my God he’s a shower and a grower!! I finished and then shook off my new dick and put it away! Just then I heard a knock at the door! Who could that be?</span></div></div>",
            "created":1566762240,
            "id":2707687,
            "title":"Body"
        },
        "11211":{
            "author_id":"elanston05",
            "author_name":"Elang ",
            "choices":[
                "Come in the room",
                "Yell "
            ],
            "content":"<div class=\"\"><div> <span>Dad’s POV<br>\r\nThe last thing Greg remembers was falling asleep watching the Laker game! When he woke he was in his son Blake’s room! How’d that happen he wondered? As he stood up he felt really strange as he was some how lighter, must be that light beer helping with the poundage. But then he noticed that he wasn’t as tall as he used to be. He usually about a foot taller than the top of his son’s dresser but now he was eye level. Just then he caught a glimpse of something in son’s mirror! Damn that image looking back at him looked just like his son Blake! He waved his hand and the image waved back!!! What the hell??? I am not Blake! I am almost a foot taller than he is and probably have a good 75 pounds on him! But the reflection in the mirror told a different story! Instead of seeing his usually very large muscular chest covered in fur, he now saw a smaller although still slightly muscular chest with very little hair! He was the same way at 16. Puberty didn’t do the most damage until for the years of 16-20 for him. So Blake seem to be following in that pattern. Next he looked down and instead of seeing large hairy tree trunk like legs, he saw the average sized legs of a still developing 16 year old, who had not only skipped leg day but never even heard of it. Greg couldn’t resist it anymore, he had to see the package his son, but now he was working with. He then whipped his shorts down to reveal a 3.5 inch long, but thicker than average cock, resting on top of two medium sized chicken eggs balls. He knew this would change for Blake because he was the same size at this age until puberty blesses him with the trophy of manmeat he had now. <br>\r\nDuring all this exploring he felt the sudden need to go relieve himself. He runs to the door and knocks and two his surprise there is Greg’s old body staring back at him. <br>\r\n</span></div></div>",
            "created":1566763140,
            "id":2707690,
            "title":"Dad in your old body"
        },
        "112111":{
            "author_id":"elanston05",
            "author_name":"Elang ",
            "choices":[
                "You go to your room to jack off! ",
                "Take a cold shower in the master bath"
            ],
            "content":"<div class=\"\"><div> <span>Blake’s POV:<br>\r\nYou see your Dad in your old body at the door and pull him inside! No need to draw any more attention to the situation than necessary!<br>\r\n“What the hell is going on son? I fell asleep a full grown man and now I am a teenager!!!” Dad yelled.<br>\r\n“It’s an app called SWAPP! It allows to swap things with other people including bodies!” You say<br>\r\n“But I look like a kid!” Dad whines<br>\r\n“Well that’s because you are one now! You are still developing! Just you like this body was doing at that age. I just thought it’d be cool to experience the final product before I get to be this age! Damn dad you never said you were hung like a horse! This thing is massive!” You boast.<br>\r\n“Well son you never asked and plus it never seemed appropriate to talk about since you we are the only dick swinging members of this house!” Dad said.<br>\r\n“And dear Lord dad are you always this horny? I got hard taking a piss!” You say.<br>\r\n“I told you when you puberty does her full number on you, the testosterone is going to surge through you like a water hose. Speaking of hoses I have to drain mine now.” Your dad says he pushes you to the side so he can reach the toilet. He yanks his shorts down and you see your old smaller dick flop out. And then without warning you feel a stiffness in your current body’s dick! What? How I am attracted to this? That’s my old body! But your dick still stirred hardening to almost full erect status! I have to go take care of this!<br>\r\n</span></div></div>",
            "created":1566763920,
            "id":2707694,
            "title":"Come in the room"
        },
        "1123":{
            "author_id":"bnaga18",
            "author_name":"Bnaga18",
            "choices":[
                "Life",
                "Personality "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Life or personality </span></div></span></div>",
            "created":1431493200,
            "id":1977785,
            "title":"Other"
        },
        "11231":{
            "author_id":"bnaga18",
            "author_name":"Bnaga18",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Relationships? </span></div></span></div>",
            "created":1431493200,
            "id":1977787,
            "title":"Life"
        },
        "112311":{
            "author_id":"bnaga18",
            "author_name":"Bnaga18",
            "choices":[
                "Friendly",
                "Romantic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Friendly or romantic? </span></div></span></div>",
            "created":1431493200,
            "id":1977788,
            "title":"Yes"
        },
        "113":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Body",
                "Clothing",
                "Life or Personality"
            ],
            "content":"<div class=\"\"><div> <span>You aim your iPhone at Gwen and hit the Scan button. <br>\r\nAn image of her appears on the screen labeled \"Gwendolyn Virginia Fallor, 19\". <br>\r\n<br>\r\nThen you scan yourself. Another image appears, with the label \"Blake Thomas Fallor, 16\". <br>\r\n<br>\r\nThen you hit the Swap button. Four options appear. You pick...</span></div></div>",
            "created":1334120400,
            "id":1313638,
            "title":"Your sister Gwen painting her fingernails"
        },
        "1131":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Upper body",
                "Lower body",
                "Whole body swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What part or parts of her body do you swap?</span></div></span></div>",
            "created":1429678800,
            "id":1968064,
            "title":"Body"
        },
        "11311":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Chests",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What upper body part do you swap?</span></div></span></div>",
            "created":1493528400,
            "id":2312814,
            "title":"Upper body"
        },
        "113111":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                " Swap her Butt and hips",
                " You end up swapping her Vagina "
            ],
            "content":"<div class=\"\"><div> <span>You click on boobs and you start grow boobs and they grow up to g cups . You say “ these are just like my sister” you juggling and bouncing your breasts and you love the feeling and you start squeezing and pinching your nipples causing you to moan. You continue the do this and you get more horny and  aroused and your  sister catches you . You are surprised and she said “enjoy those big boobs of yours again huh bro?” You say “uhhhhh y-yeah” She says “it must be great being a boy and have your own pair of big breasts to play with.  I’m jealous  of how flat my chest is and how big yours are . But at this I got my big butt” she  turns her back to you and  you see her really big hips and butt.  You see she’s not wearing panties and  wearing see-through yoga pants .  Then she gives a big slap to  both her butt cheek  causing them to  jiggle a lot and  you get  aroused. She then  started Twerking in front of you and you  are very much  Erect . She  laughs and says “ I bet you wish you had a butt like mine but  i’m grateful I please have this“  she walks away swagging her hips and  her butt is jiggling a lot. You then...</span></div></div>",
            "created":1562654400,
            "id":2684209,
            "title":"Chests"
        },
        "113112":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "Arms",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Arms or other</span></div></span></div>",
            "created":1584810300,
            "id":2804656,
            "title":"Arms"
        },
        "1132":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Top",
                "Footwear, accesories, and make up.",
                "All Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You selected Clothing only out of curiosity. After you selected _______, you carefully pressed swap and braced for impact.</span></div></span></div>",
            "created":1334206800,
            "id":1314180,
            "title":"Clothing"
        },
        "11322":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "swap the rest of the clothing",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You opened your eyes.<br>\r\nShe was now sat down wearing your socks and no make up or accessories.<br>\r\nShe didn't have the nail polish set and was watching a girl's show.<br>\r\nYou looked down, You heard earing jiggling by your ears, you were now wearing tights, you can smell perfume and taste lipstick and feel alot of rings on fingers and toes.<br>\r\n<i>\"It's real,\" </i>.<br>\r\nYou need to use it again.</span></div></div>",
            "created":1351746000,
            "id":1457894,
            "title":"Footwear, accessories, and make up."
        },
        "113222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will you keep swapping with Gwen?</span></div></span></div>",
            "created":1420606800,
            "id":1914795,
            "title":"something else"
        },
        "1132222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Mom",
                "Sisters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will you swap with then?</span></div></span></div>",
            "created":1420606800,
            "id":1914797,
            "title":"No"
        },
        "11322222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Lily",
                "Shelby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which sister?</span></div></span></div>",
            "created":1420606800,
            "id":1914800,
            "title":"Sisters"
        },
        "11323":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Take her hair, and give her your body hair",
                "Swap back, this is too much."
            ],
            "content":"<div class=\"\"><div> <span>It was probably a mistake to make the first swap \"All clothing\" but you still stood there, starring at the yellow tube top that somehow was sitting firmly on your flat cheast. It made no sense, but it was an arousing feeling. Arousing enough to create a massive hard on, or it would have been if Gwen's black shorts and thong panties weren't so restricive. It only took a moment for you to adjust to standing in 3 inch, black open toed heels. The sunglasses, bracelet, necklace, and earings weren't much of an issue, but the make-up and mani-pedi were big slap to the face. Those were they icing on the cake when you were suddenly dressed just like your sister was only a moment ago. Gwen looked pretty caual in your t-shirt and jeans, but her hair had upset that look. Her hair was the last thing you needed to complete the look, minus a few other tweeks here and there along the line of body hair. So did you continue of swap back?</span></div></div>",
            "created":1334206800,
            "id":1314190,
            "title":"All Clothing"
        },
        "113231":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "swap breasts",
                "swap back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, now you swap her hair with yours and indeed this completes you look.<br>\r\nBut the nice top was still not filled out on the right places and you think and then…<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1352782800,
            "id":1467005,
            "title":"Take her hair, and give her your body hair"
        },
        "1133":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1334120400,
            "id":1313642,
            "title":"Life or Personality"
        },
        "11331":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "First Name, Middle Name, or Gender",
                "Relationships or Skills"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You select Life. <br>\r\n<br>\r\nFive more options appear. <br>\r\n<br>\r\nWhich one?</span></div></span></div>",
            "created":1334120400,
            "id":1313643,
            "title":"Life"
        },
        "113311":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "First Name",
                "Middle Name or Gender"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1334120400,
            "id":1313648,
            "title":"First Name, Middle Name, or Gender"
        },
        "1133111":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Scan your sister again",
                "Find someone else to swap with"
            ],
            "content":"<div class=\"\"><div> <span>You select First Name. Then you hit the \"Go\" button. <br>\r\n<br>\r\nThere's a flash of white light. <br>\r\n<br>\r\nYou look around. Nothing seems different. <br>\r\n<br>\r\n\"Hey, sis\" you say. <br>\r\n<br>\r\n\"Hi Gwen.\" she says. <br>\r\n<br>\r\nIt worked! She thinks your first name is Gwendolyn and her first name is Blake!<br>\r\n<br>\r\nShould you try another swap?</span></div></div>",
            "created":1334120400,
            "id":1313652,
            "title":"First Name"
        },
        "11331111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "talk to your new brohter",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Now you scan her again and now use the gender option.<br>\r\nThere is another flash of white light.<br>\r\nYou look around and this time it looks different, your former sister looks different, she is a boy now and  said: “Hey sis, what’s up?”<br>\r\nThis indicates that your gender is also changed and you are the younger sister now…<br>\r\n“Nothing special!” you answer now having also a girls voice….<br>\r\n</span></div></div>",
            "created":1343883600,
            "id":1396076,
            "title":"Scan your sister again"
        },
        "113311112":{
            "choices":[
                "Body",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have a sudden strong temptation to continue swapping even more things.</span></div></span></div>",
            "created":1388466000,
            "id":1718593,
            "title":"What next.."
        },
        "1133111121":{
            "choices":[
                "Whole Body",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one is it?</span></div></span></div>",
            "created":1388466000,
            "id":1718598,
            "title":"Body"
        },
        "11331111212":{
            "choices":[
                "Upper Body",
                "Lower Body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Upper or Lower Body?</span></div></span></div>",
            "created":1388466000,
            "id":1718602,
            "title":"Other"
        },
        "1133111122":{
            "choices":[
                "Clothing",
                "Life / Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one would it be?</span></div></span></div>",
            "created":1388466000,
            "id":1718597,
            "title":"Other"
        },
        "11331112":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Lily",
                "Shelby"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go back upstairs and look for...</span></div></span></div>",
            "created":1334120400,
            "id":1313653,
            "title":"Find someone else to swap with"
        },
        "1133112":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Middle Name",
                "Gender"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1352610000,
            "id":1465823,
            "title":"Middle Name or Gender"
        },
        "11331121":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping with gwen",
                "Swap with someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You then see a bright flash, and then you scan yourself, seeing that your name is now Blake Stephanie Fallor. After this you proceed to scan your sister and her name is now Gwen Paul Fallor<br>\r\n<br>\r\n\"This is so cool!\" You say</span></div></span></div>",
            "created":1420606800,
            "id":1914368,
            "title":"Middle Name"
        },
        "113311211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Life or Personality",
                "Body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap with Gwen?</span></div></span></div>",
            "created":1420606800,
            "id":1914369,
            "title":"Keep swapping with gwen"
        },
        "1133112111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it?</span></div></span></div>",
            "created":1420606800,
            "id":1914370,
            "title":"Life or Personality"
        },
        "11331121111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Relationships",
                "Gender (treated as the opposite gender, no physical changes)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap with your sisters life?</span></div></span></div>",
            "created":1420606800,
            "id":1914372,
            "title":"Life"
        },
        "11331122":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Nerdy ,shy but sexy  girl with a soft voice and  huge breast and butt ",
                "Bimbo "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You sister turns into a guy and you turn into a girl . What type of girl are you?</span></div></span></div>",
            "created":1563563220,
            "id":2689291,
            "title":"Gender"
        },
        "113312":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "relantionships",
                "skills"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one.</span></div></span></div>",
            "created":1344920400,
            "id":1404495,
            "title":"Relationships or Skills"
        },
        "1133121":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "1,2,3",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what relationships will you swap <br>\r\n1) friendly<br>\r\n2) family<br>\r\n3) romantic</span></div></span></div>",
            "created":1344920400,
            "id":1404497,
            "title":"relantionships"
        },
        "11331211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "1",
                "2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>1: is she now your wife<br>\r\n2: is she now your daughter</span></div></span></div>",
            "created":1419483600,
            "id":1907414,
            "title":"1,2,3"
        },
        "11331212":{
            "author_id":"genghiskhan",
            "author_name":"NotTheGuy",
            "choices":[
                "Romanctic",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just Romantic relations then?</span></div></span></div>",
            "created":1352610000,
            "id":1465478,
            "title":"others"
        },
        "1133122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you switch her makeup skills and fashion sense with yourself?</span></div></span></div>",
            "created":1419483600,
            "id":1907415,
            "title":"skills"
        },
        "11331222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about her cheerleading skills?</span></div></span></div>",
            "created":1420606800,
            "id":1914787,
            "title":"No"
        },
        "113312222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No, thats too weird"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about her flirting skills?</span></div></span></div>",
            "created":1420606800,
            "id":1914789,
            "title":"No"
        },
        "11332":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Applied it expertly",
                "Made a mess"
            ],
            "content":"<div class=\"\"><div> <span>After the flash, you looked at yourself and the first thing you noticed was that you needed a makeover, you were looking kind of sloppy, so you went to the bathroom, swaying your hips as you walked, as you checked yourself in the mirror you decided to put on some makeup</span></div></div>",
            "created":1419483600,
            "id":1907429,
            "title":"Personality"
        },
        "114":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Body",
                "Life",
                "Skill"
            ],
            "content":"<div class=\"\"><div> <span>You walked into your sister Lily's room. She was watching Degrassi, brushing her long blond hair.<br>\r\n\"What the hell are you doing in here?\"<br>\r\n\"Oh, nothing.\"<br>\r\nYou press scan. Both you and Lily appear on the screen.<br>\r\n<br>\r\nWhat does he press first?</span></div></div>",
            "created":1347771600,
            "id":1429275,
            "title":"Lily"
        },
        "1141":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Face",
                "Breast",
                "Groin"
            ],
            "content":"<div class=\"\"><div> <span>You press body. You can't decide what to press next though. How about hair?<br>\r\n\"Let's see if this works.\"<br>\r\nYou tap the hair button, and suddenly, your brown hair starts growing. And God, it hurts! You drop to your knees, and see Lily's hair retreating into her head. It becomes dirty blond, then brown, stopping when her hair was a perfect brown clean cut. Meanwhile, your hair was still growing. You grabbed a few strands, and looked at the swirling colors. Your brown hair was turning dirty blonde, and became a light blonde, falling to your waist.<br>\r\n\"I guess it does work.\"<br>\r\nYou smiled, and looked down at the app. You wondered what to swap next.</span></div></div>",
            "created":1347771600,
            "id":1429280,
            "title":"Body"
        },
        "11411":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Breast",
                "Whole body"
            ],
            "content":"<div class=\"\"><div> <span>\"Why not the rest of the head?\"<br>\r\n\"What are you talking about? Freak,\" said Lily.<br>\r\nYou press face, and scream in pain as your entire face starts to rearrange. Your blue eyes burn, becoming hazel. Your eyebrows start to shift, along with your ears, nose, and mouth. Whatever hair you had on your face sunk into the skin. When it was over, your head was now on the body of a 13 year old girl.<br>\r\n\"Okay. Let's get this over with.\"<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1347771600,
            "id":1429285,
            "title":"Face"
        },
        "114112":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Clothing",
                "Personality"
            ],
            "content":"<div class=\"\"><div> <span>\"Whole body? Might as well.\"<br>\r\n\"Seriously, why are you talking like that?\"<br>\r\nYou pressed body, and looked down, to see yourself becoming shorter, and slimmer. Your arms were losing hair, as were your legs. breasts started to grow, but soon stopped. Your nails now had manicures and pedicures.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1347858000,
            "id":1429560,
            "title":"Whole body"
        },
        "1141121":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><div> <span>You looked up at yourself. Well, your old body. It was your body. But it was wearing a tank top, and dark pants. It didn't look right. You chose the whole clothing option. A ringing in your ears started again, and when it stopped, your old body was wearing a black T-shirt and blue jeans. You had on the tank top and pants.<br>\r\n<br>\r\nWhat next?</span></div></div>",
            "created":1347944400,
            "id":1430481,
            "title":"Clothing"
        },
        "11411211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "there it is",
                "no age swap function"
            ],
            "content":"<div class=\"\"><div> <span>You have selected “life” and see the options you have now. Ok you have her body and her gender now, so you selected name and to test it you call her now:<br>\r\n“He Blake, why are watching those damned show?”<br>\r\n“I like it” was the answer and you think ok, and enjoy being her kind of but you are too young and search for an age option….<br>\r\n</span></div></div>",
            "created":1352782800,
            "id":1467001,
            "title":"Life"
        },
        "11412":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Play with your breasts",
                "Swap more"
            ],
            "content":"<div class=\"\"><div> <span>\"Why not the breasts?\" you thought as you go to your room to do it. <br>\r\n Once your in your room you close the door, and then press the breasts option, and then scream in pain as your breasts starts to rearrange. When it started you grab your chest and hold it, to feel intense pain their, you blush a little as your breasts become buds. As they start to expand they sort of jiggle causing you to groan. As the swap starts to end your shirt is a bit exposed. Your new breasts feel really sensitive, against your shirt you had taken it off with a struggle. Once you see the size of them you see they are CC-cup, you knew your sister started puberty close to 8 years old, and her breasts increased at 8 1/2 years old, but you didn't expect her to be this well developed for her age.<br>\r\nWhat to do now?</span></div></div>",
            "created":1412226000,
            "id":1865555,
            "title":"Breast"
        },
        "114122":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Masturbate with your new body",
                "See if anyone realizes the swap that occured"
            ],
            "content":"<div class=\"\"><div> <span>You decided to get rid of the sensitive of your breasts you need a bra. You go back to the swap page to switch clothing with your sister. You click on top for the clothing you then hear ringing. Once you do you see a bra on your breasts and your shirt you put down is now a girl's blue tank top. You didn't want people to annoy you with the way you dress. You go back to body option and click torso, arms, hands, waist, feet, legs, hips, butt, mouth, face, nose, ears, and facial hair, then swap them with your sister to feel extreme pain going through your body. Once its over you stand up to feel your pants fell down, but your underwear is loose, ignoring what happened you go to your mirror, to see you almost look like Lily and see what nice curves she was hiding underneath her pants, your kinda feel turn on by your body, but a little bit disturbed by it. You went back to clothing and swap footwear, accessories, and bottom to hear a ringing again. You look back at your clothes and see they are Lily's.  You went back to swap out some of your life with her for this to be less awkward. You swap both your first and middle name with her.</span></div></div>",
            "created":1412226000,
            "id":1865591,
            "title":"Swap more"
        },
        "1141221":{
            "author_id":"williamrn",
            "author_name":"WRN",
            "choices":[
                "Your sister knocks on the door",
                "Get dressed and go downstairs"
            ],
            "content":"<div class=\"\"><div> <span>You look at your door real quick and lock it and then closing the blinds in front of your window. You then take off your dress and bra to then see your breasts come out loosely but feel more heavy. You first pinch them to feel sexual pleasure going through your body. You then groped them to then feel sexual pleasure going through you. You then message and groped them for what felt like a eternity due to the amount of pleasure you were feeling then top to take a breather. You then place one of your hands where your penis is, to feel nothing there confirming you it was a true success. You put one of your hands to stretch your blue skirt and apparently blue panties, and use the other to use two of your fingers into your vagina, to experience more sexual pleasure then with your breasts. You slide the two down to have easier access to continue doing it to feel the sexual pleasure you never felt as a guy.</span></div></div>",
            "created":1420002000,
            "id":1909909,
            "title":"Masturbate with your new body"
        },
        "115":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Personality ",
                "Clothing ",
                "Sometihng else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see Shelby watching Phineas and Ferb.<br>\r\nSee hasn't noticed you.<br>\r\nYou select you and her on your iPhone.<br>\r\nWhat do you swap.</span></div></span></div>",
            "created":1351832400,
            "id":1458805,
            "title":"Your sister Shelby watching Phineus and Ferb"
        },
        "1151":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Swap back, this is too weird.",
                "Something is drawing you to Shelby's room",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You select personality and hit the swapp button.<br>\r\nShelby stand up, \"Why am <i>I</i> watching this child drivel,\" she complains in an uproar.<br>\r\nAfter she strides out the room like you would have done, you go and sit in front of the TV.<br>\r\n\"This looks good,\" You say quietly.<br>\r\nAbout an hour later, It ends.<br>\r\n\"Awww,\" you moan, \"It ended.\"<br>\r\nYou stand up, and walk up stairs.<br>\r\nYou look in your room.<br>\r\nShelby is on your xbox playing Call of duty, and she it enjoying and it really good at it. </span></div></div>",
            "created":1351832400,
            "id":1458806,
            "title":"Personality "
        },
        "11512":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Go swap with Shelby",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You turn around and see the door to Shelby's room is open.<br>\r\nYou walk slowly too it.<br>\r\nYou feel something drawing you too her room, but you know you shouldn't go.<br>\r\nBut you do.<br>\r\nYou look in and see dolls of varying sorts all around the pink room.<br>\r\nYou are drawn to the complete set of Phineas and Ferb dolls.<br>\r\nYou sat down to play with them, and got really into it.</span></div></div>",
            "created":1351832400,
            "id":1458810,
            "title":"Something is drawing you to Shelby's room"
        },
        "115122":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "You get tired",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe you get tired.</span></div></span></div>",
            "created":1351832400,
            "id":1458811,
            "title":"something else"
        },
        "1151221":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Swapp with someone else",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You had completely lost track of time.<br>\r\nYou yawn.<br>\r\nBefore you can do anything you fall asleep.<br>\r\nYour mother walks in.<br>\r\n\"Blake's played himself to exhaustion again,\" she says lifting you, with great difficulty, on to shelby's bed.<br>\r\nShe walks out, after closing the blind, turning off the light and closing the door on her way out.<br>\r\n<br>\r\n-The next morning-<br>\r\nYou wake up.<br>\r\n\"What this is Shelby's room.\" you think.<br>\r\nYou look around, \"But it is so cute and suites someone like me.\"<br>\r\nYou get up and go down stairs.<br>\r\nAt the table in the kitchen you see Mum, Gwen, Lily and Shelby (Dad was at work).<br>\r\nYou notice Shelby is wearing one of your Call of Duty shirts. It is way to big for her body.<br>\r\nYou thinks <i>\"You think if she going to wear my clothes, I'm going to wear hers,\"</i><br>\r\nYou pick up the iPhone and select yourself and her and swap clothing with her.<br>\r\nAfter the flash, She is still wearing the COD t-shirt but it fits her body in stead and you can she your underwear poking out the bottom of the shirt.<br>\r\nYou look down, You see a long pink nightie, and you can feel girl underwear restricting your groin.<br>\r\n<i>\"This is much better,\"</i> You think. </span></div></div>",
            "created":1351832400,
            "id":1458816,
            "title":"You get tired"
        },
        "11512211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Gwen, your big sister",
                "Your mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But with which member of your family?</span></div></span></div>",
            "created":1419483600,
            "id":1907420,
            "title":"Swapp with someone else"
        },
        "11512212":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Swapp with someone else",
                "Shelby comes in"
            ],
            "content":"<div class=\"\"><div> <span>After you had your breakfast, you head up stairs.<br>\r\nYour about to enter your room when Shelby pushes by.<br>\r\n\"I told you to stay out my room, Blake\" She said closing the door on you.<br>\r\nYou walked to Shelby's room.<br>\r\nIt was different but you couldn't tell what it was.<br>\r\n\"I don't like my name, Blake,\" You moan, \"Shelby sound better for me,\"<br>\r\nYou pick up your iPhone and target yourself and Shelby.<br>\r\nYou swap first names.<br>\r\nA list pops up of all thing you have swapped.<br>\r\nPersonality-Shelby<br>\r\nBedroom (Part of life)- Shelby<br>\r\nFist name-Shelby.<br>\r\n<br>\r\nYou don't remember the bedroom swap, the time of swap was when you were asleep.<br>\r\nBut that's okay, You likes this room better.</span></div></div>",
            "created":1351918800,
            "id":1459379,
            "title":"something else"
        },
        "115122121":{
            "author_id":"astrolight",
            "author_name":"Froslad",
            "choices":[
                "Go and look for a target.",
                "you are interrupted."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You loook at the remote, and around your room. \"I should swap some more,\" you say to your self.<br>\r\nDo you swap?</span></div></span></div>",
            "created":1369198800,
            "id":1595269,
            "title":"Swapp with someone else"
        },
        "115122122":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Life, Relationships, friendly.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Shelby walks in.<br>\r\n\"Shelby, come play with me.\" She demands (you had often done this in the past).<br>\r\n\"I don't want to play your stupid game,\" You tell her angrily.<br>\r\n\"I'm bored playing on my own, so come play with me,\"<br>\r\nYou thought that she would leave you alone if you could swapp.<br>\r\nYou picked up the iPhone, after you forced her to leave, You target yourself and her and swapped...<br>\r\n</span></div></div>",
            "created":1351918800,
            "id":1459382,
            "title":"Shelby comes in"
        },
        "1151221221":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "The phone rings...for you",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You select to swap friends.<br>\r\nYou heard Shelby Laughing and talking to your former friends.<br>\r\nYou go back into your new room.<br>\r\nWhen...</span></div></span></div>",
            "created":1351918800,
            "id":1459386,
            "title":"Life, Relationships, friendly."
        },
        "11512212211":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "When she comes over",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>The phone goes off, but your Mother picks it up.<br>\r\nAfter a few moments she yelled, \"Shelby,\"<br>\r\nForgetting your swap names, you didn't reply.<br>\r\n\"Shelby!\" Your mother shouts louder.<br>\r\nYou run down to her.<br>\r\n\"Shelby, Dionne is on the phone and she wants to talk to you.\" Dionne was Shelby's best friend, until you swapped friends.<br>\r\n\"Hey Shelby,\" You heard a seven year old girl shout enthusiastically down the phone, \"Mums going out and I was wondering if I could come over while she was out,\"<br>\r\n\"Mum,\" You move the phone away from your head, \"Can Dionne come by?\" <br>\r\n\"Of course she can,\" You mother smiles.<br>\r\n\"You can come over,\" You say to Dionne.<br>\r\n\"See you in 10 minutes.\" </span></div></div>",
            "created":1351918800,
            "id":1459391,
            "title":"The phone rings...for you"
        },
        "1152":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Swap again with someone else",
                "Check changes",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You deice you to swap clothes.<br>\r\nYou targeted yourself and Shelby.<br>\r\nYou highlight and swap clothing.<br>\r\nYou look down after the flash, You see pink socks, a long pink skirt and a Phineas and Ferb T-shirt.<br>\r\n\"It works,\" You say.<br>\r\n\"QUIET, I'm watching,\" You sister complains not noticing the COD t-shirt, combat pants and bare feet.<br>\r\n\"This is brilliant,\" You say.<br>\r\n\"SHUT UP,\" Shelby shouts loudly, pushing you out the door.</span></div></div>",
            "created":1351832400,
            "id":1458820,
            "title":"Clothing "
        },
        "11522":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Investigate the clothing",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You decide to check what has changed.<br>\r\nYou see photo's on the walls where you and Shelby have swap clothing.<br>\r\nexcept before she was born, then you were just wearing standard girl clothing.<br>\r\nIn your room you sore many skirts and t-shirts around the room with pink socks and underwear.<br>\r\nEven Phineas and Ferb cosplay. neatly hung up.<br>\r\n<br>\r\n </span></div></div>",
            "created":1351832400,
            "id":1458826,
            "title":"Check changes"
        },
        "1153":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Body",
                "Life",
                "somethinge"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>That leaves life, body and personal info.</span></div></span></div>",
            "created":1351918800,
            "id":1459715,
            "title":"Sometihng else"
        },
        "11531":{
            "author_id":"dragon47",
            "author_name":"Dragon47",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to go with the Whole Body Option?</span></div></span></div>",
            "created":1523509200,
            "id":2479035,
            "title":"Body"
        },
        "12":{
            "author_id":"tlapp98",
            "author_name":"Capre Diam",
            "choices":[
                "Dean and yourself?",
                "Leah and Marcus?",
                "Other?"
            ],
            "content":"<div class=\"\"><div> <span>          You decide to show Dean the app, so you head to his house. The first thing Dean does when you come over is offer you a soda. You accept, thinking you should at least hang out a little first. You sit down to play some Halo Reach. After 30 minutes of blowing grunt heads off with a Fuel Rod Gun on bottomless clip, you pull out your phone and show the app to Dean.<br>\r\n          The first thing Dean asks is very predictable.<br>\r\n\"Does it work?\" he asks his eyes shining.<br>\r\n\"I don't know yet. I haven't tried it,\" you reply, knowing you had him hooked as soon as he read what it could do.<br>\r\n\"I have an idea,\" Dean says. \"let's go upstairs and try it on us!\"<br>\r\n\"Dean, we've been best friends since the 2nd grade, but don't you think that would be a bit weird?\" you inquire.<br>\r\n\"Would you rather use my sister and brother, Leah and Marcus, as test subjects?\"<br>\r\nWho are you going to use the app on?</span></div></div>",
            "created":1347685200,
            "id":1428025,
            "title":"Off To Dean's"
        },
        "121":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Something simple, clothing",
                "Extreme, Body",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I think it would be better if we swapped,\" You said, thinking logically.<br>\r\n\"That's the spirit,\" He said while walking up the stairs.<br>\r\n-In your room-<br>\r\nYou enter and close the door.<br>\r\n\"Okay we can swap something from life, body, personality and clothing. What should we swap?\" You ask dean.</span></div></div>",
            "created":1351832400,
            "id":1458802,
            "title":"Dean and yourself?"
        },
        "1212":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Examine your body.",
                "Talk to Dean online"
            ],
            "content":"<div class=\"\"><div> <span>Blake's POV<br>\r\n          Dean for the most was an amazing best friend. Being surrounded with sisters, he became the brother I never had. And with this past few years, I spent more time with him than all my sister combined.<br>\r\n<br>\r\n          Everything went with a flash and it ended with one. The world around me mixed in a swirl that dwindled down with time. The sight around me still looks the same but somehow different in specific aspects. Like every object in the house became more vivid that I used to. <br>\r\n<br>\r\n           I stood up, still feeling disoriented. I knew the swap worked immediately as I saw my old body starting to wake up. \"Dean, the swap worked\" I said. My new voice is so smooth. That's what to expect as Dean is part of the choir club.<br>\r\n<br>\r\n          Dean stood up, still feeling disoriented like I do. He stretched his new lean arms and did some flexing. \"You need to buff up dude.\" he said. It's weird to see your own body move in front of you. Weirder when it talks to you. \"So this is how I look to other people. Cool.\" <br>\r\n<br>\r\n          \"So what do we do now?\" I asked. To be frank, I never thought past that. I half expected for the app to be a hoax and well it is not now that we tried it.<br>\r\n<br>\r\n          \"I know you would ask that. I watched many body swap films before and they usually try each other's lives.\" He sat beside me and fiddled with mine- I mean his finger tips. I really should cut them when I get back to my old bod. \"I like to see your sisters though.\"<br>\r\n<br>\r\n          \"Hahaha\" I laughed. My new laughter is weird and cute at the same time. \"Good luck getting to know them. I've been with them for my whole life and they still feel like strangers.\" That was a half lie. Me and Lily have a good relationship. I would help her in her assignments from time to time. Shelby on the other hand was a pain with her constant girly chatters. She's still a toddler so that would be expected. Talking about Gwen would send shivers down my spine.<br>\r\n<br>\r\n          We spent the rest of the afternoon talking about stuff. We took a reddit post as an inspiration to talk about expectations about each other's bodies. I told that my body have extreme BO when under stress or heat. So I advised he to double rub deodorant after shower. His body however always pees in 3 AM in the morning. I would feel a depression in my private parts when it happens.<br>\r\n<br>\r\n          And speaking about private parts, we've taken the liberties to know them. Dean's was cleanly shaven like mine but mine was bigger. His shaft was thicker though. Dean was surely ecstatic about his newfound length. He was about to try and jerk off until I warned him. \"Do it in my house not here\" I said. Seeing my own body jerk off would be the 3rd weirdest thing I've seen this year.<br>\r\n<br>\r\n          The latter part of the day, we spent gaming. Dean's parents or should I say my parents were kind enough to serve us dinner. Roasted chicken and mash potatoes on the side. Mrs. Mcleary asked Dean about school and he answered like how I would answer. His answer is good enough to fool all of them. Everyone's attention is on Dean so I kept quiet most of the time. Dean thanked everyone, mostly Mrs. McLeary at the end of the meal. <br>\r\n<br>\r\nAt the porch Dean and I talked for the last time. \"You're good at being me\" I said. He even has my scratching cheek mannerism. <br>\r\n<br>\r\n\"Besides Choir, I am also a part of the theater group. And from that I almost forgot. You have choir practice tomorrow at 1 PM. Just follow the others and don't make a fool of myself.\" We said our final goodbyes and off he went. I helped Mrs. McLeary in clearing up the dishes and off I went to my room. There are 3 hours left before I need to sleep. What should I do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1489813200,
            "id":2291241,
            "title":"Swap with my Best Friend"
        },
        "12121":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go for it. Pump his dick.",
                "Be a bro and respect his privacy."
            ],
            "content":"<div class=\"\"><div> <span>          For the most part, Dean's most noticeable features is his deep dimples when he smiles. Parents and adults alike, wanted to make him laugh and smile. I on the other hand was noticed because of my quiet nature. People thought it was cute when I was young but it soon became a weird thing to be latched on in your teens. Now people see me as an anti-social freak. Dean never left me all that time.<br>\r\n<br>\r\n          I tried to smile at the mirror. The dimple was surely there and it was surely cute like what people said it is. Beside smiling, I tried an assortment of faces. Some faces that Dean would surely do, given his naughty attitude. All this face making is becoming somewhat fun. But my brain wants more secrets to be found.<br>\r\n<br>\r\n          I've seen Dean half naked before. Especially when we were young and when we were playing at the public pool. But time passed, we got educated about the wonders of sex and then we got embarrassed about seeing each other's bodies. I'm not really a religious guy but I can compare it to Adam and Eve eating the forbidden fruit. Seeing Dean's half naked body is sight for sore eyes. He's been exercising and I didn't know. His schedule is already swamped with clubs and weekend hang outs with me. I traced along the ridges of his already forming abs. It's not as developed as the ones you see in boxer front labels but you know that they are there. Aside from his abs, I could feel that his biceps are also beefing up.<br>\r\n<br>\r\n          To go down further the rabbit how, I undressed my khakis and boxers to show up his schlong. His dick was whiter than mine albeit smaller than my own. The size however was replaced by thickness. So still equal to my standards. I held it against my palm and felt the steamy heat emanating from it. The beat of my heart syncopated with my dick and it sure was exhilarating. I could do it now and no one will ever know. Besides, Dean might be jerking off my dick the moment he got home. 7\" dick would be enough to get his pants down. But on the other hand, is this a probe on his privacy. I might be inside his body but ethics still restrain me.</span></div></div>",
            "created":1489899600,
            "id":2291636,
            "title":"Examine your body."
        },
        "121211":{
            "author_id":"comix02",
            "author_name":"comix",
            "choices":[
                "Keep going",
                "Stop"
            ],
            "content":"<div class=\"\"><div> <span>   Smirking, I decided to make the errection go away. I stroked it lightly, moaning from it. “A-ahhh~” is that came out of my mouth. I moaned louder, pumping Dean’s hard cock. I was overwhelmed by the feeling of pleasure. I admit, I wondered what would happen in a situation like this but I didn’t imagine the pleasure would feel so good. After a few more minutes of stroking Dean’s dick, pre cum started to leak out. I increased the force I used and stroked closer to the tip. “D-dean~” I moan. I felt my self close to edging. I Dean’s fingers around the tip over his dick. I shot out gun. I would’ve chosen to respect Dean’s privacy but I’m sure he wouldn’t have minded. </span></div></div>",
            "created":1522386000,
            "id":2472057,
            "title":"Go for it. Pump his dick."
        },
        "12122":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Woke up in the middle of the night.",
                "Woke up the next morning."
            ],
            "content":"<div class=\"\"><div> <span>          7:28 PM, I was playing \"Horizon: Zero Dawn\" when a notification disturbed from my game play. Luckily, I know Dean's password and every nook of his phone. And through it, I knew he was bisexual as I say gay and lesbian porn in his phone. That was a story for another day. I remember how embarrassed he was but we got over it. <br>\r\n<br>\r\nDean: Hey neat-freak, What's your computer password? <br>\r\nMe: Neat-freak? It's mudkip2004<br>\r\n<br>\r\n          That password was old as my childhood. Dean and I exchanged Pokemon cards when we were young. And through those years, Mudkip became my favorite started pokemon. Only that dumbass Misty would choose Treecko every time. That type-advantage picking bitch.<br>\r\n<br>\r\nMe: So how was your few hours in my life? Having fun?<br>\r\nDean: Gwen is nowhere to be found. Helped your middle sister in her assignments. Your sister is really dumb hahaha. Joke  <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/peace2.png\" alt=\"*Peace2*\" title=\"Peace2\" border=\"0\" width=\"15\" height=\"15\">  <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/peace2.png\" alt=\"*Peace2*\" title=\"Peace2\" border=\"0\" width=\"15\" height=\"15\"> .<br>\r\nMe: Don't say that, she's sensitive.<br>\r\nMe: Still, she dumb though.<br>\r\nDean: Shit! You sister is here. And she's crying! WTF! I'm going to talk to her.<br>\r\nMe: Don't talk to her.<br>\r\nDean: <i>Seen 7:32 PM</i><br>\r\n<br>\r\nI spent the next minutes sending \"dude\" at intervals of 2-3 minutes. At the tenth minute, he became offline and I resumed playing my game. The game helped me stray the thoughts of how he would fuck up my already dwindling relationship with my older sister. At 8:02 PM a notification came up.<br>\r\n<br>\r\nDean: Your sister is quite nice. We hugged and we talked.<br>\r\nMe: Really!? Wow.<br>\r\nDean: Her boyfriend broke up with her, at his birthday.<br>\r\nMe: Hahaha. The boy was a dick anyways.<br>\r\nDean: You're a dick too hahaha, joke. Anyways, we talked and she wants to talk to me again tomorrow.<br>\r\nDean: So what you doing in my bod right now.<br>\r\nMe: Playing Horizon. You?<br>\r\nDean: Create your own save file, don't overwrite mine. I'm masturbating btw.<br>\r\nMe: Ew!<br>\r\nDean: It's your body. Why are you disgusted?<br>\r\nMe: I'll pass. Clean up afterwards. I don't want to come back with a wet dick.<br>\r\nDean: Understood.<br>\r\n<br>\r\nThe conversation ended and I resumed back to playing. By 9 PM, my eyes are getting drowsy. I turned off my PS4 and went to sleep.</span></div></div>",
            "created":1489813200,
            "id":2291249,
            "title":"Talk to Dean online"
        },
        "121221":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Go to choir practice",
                "Ditch it and hang out with Dean"
            ],
            "content":"<div class=\"\"><div> <span>          Between my dreamless sleep, I woke up never really knowing why. The place around me was covered in perpetual darkness dimpled with the street light outside. Amidst the darkness, I know that I'm in strange territory. The lights are wrong, my bed is wrong, the smell of my room is wrong. But somehow, it felt like home. <br>\r\n<br>\r\n          Little by little, recollections of yesterday came back to me. The life changing swap. I still had doubts whether those memories were real or fantasy at all. One look at the dim mirror answered my question. Dean sat groggy in front of me. He is as much as confused by then. <br>\r\n<br>\r\n          I head for the bathroom to release nature's call. It was a long piss and a pleasure one as well. Judging from our talk yesterday, the time must be 3 AM. <br>\r\n<br>\r\n          Downstairs, I could already hear the clamor of pans and the smell of morning bacon. Mr. McLeary works for the local research institute and it demands early working hours. Dean says the job pay Wells but the bad side is that he does not see his father very much. It's true, I never seen him personally myself. <br>\r\n<br>\r\n          I decided not to go downstairs for the time being. The smell of bacon tempts me though but nah. Instead, I focused my time fiddling on the Swapp App. I downloaded it first at Dean's phone. It's surprising to think that a few hundred people downloaded the app. There were reviews and all were happy and giving thanks to the creator. The rating the app was given was 5 stars. <br>\r\n<br>\r\n          The user interface of the App was clunky and not user friendly. They were using the Comic San font for their subtitles and it was a definite no for app designers. At least, it doesn't have ads. <br>\r\n<br>\r\n          Besides the menu screen where it showed the type of swaps, there is also the preference setting which I haven't been before. The preference setting there were words that I recognize and jargons that I don't. Luckily, there were descriptions to define what each options does. <br>\r\n<br>\r\n✔ Auto-Enlighten. <br>\r\n          Allows both swap parties to be aware of the swap. Disable so target does not have recollections of the Swap. <br>\r\n✔ Unwanted Swap protection<br>\r\n           Protects user against stray swap rays. Does not guarantee a hundred percent success. <br>\r\n✔ Low Battery Mode<br>\r\n           Lessens battery drainage by decreasing CPU power usage. <br>\r\n🚫 Dark Mode<br>\r\n           Turns the background to black for easy app usage in the dark. <br>\r\n✔ Gamma-Ray shielding<br>\r\n           In the case of App malfunction, Gamma Ray bursts have 50 percent chance to happen. Turning this on will prevent unnecessary damage to the user. <br>\r\n🚫 Auto phone transference. <br>\r\n           Still in beta test. The phone is automatically transferred to the user in the case of a swap.<br>\r\n<br>\r\n           I turned on dark mode as the white background is burning my eyes. On Auto Phone transference, I'm having two conflicting thoughts to whether turn it on or remain it off. It could remain handy in the case of swapping with a stranger. In then end it to agree. I also, turned Auto-Enlighten to off. <br>\r\n<br>\r\nAt the bottom of the preference was a message. <br>\r\n<br>\r\n          <i>\"If any bugs or problems occur, contact me at g@g.org\" ~g. </i><br>\r\n<br>\r\n           Whether the app was made by the government or some supernatural hooligans, I don't care. Handling this kind of programs makes me powerful. I better message Dean about the settings. <br>\r\n<br>\r\n           In the morning, I had a small talk with mom. She asked me about school and I said it was fine. Fooling her was easy but not Dean's little sister. She's been eyeing me since the moment I went out my room. She's also asking weird questions like what is my favorite color or what is my favorite food. I knew Dean so I said Brown and then Machias' Peperoni Supreme Pizza. All my answers did not please her and she kept her eyes more on me. <br>\r\n<br>\r\n           After breakfast, I took a bath at my own bathroom. The McLeary family was rich enough to provide a bathroom for each bedroom. Dean's bathroom was plain, a few stocked soap and a huge shampoo at the side. It's a daily ritual for me to always masturbate before shower. It's now weird, almost all men does it but. They do it but they have no reason to it to others. Today's ritual will be weird as I'm jerking of to a dick that is not my own. <br>\r\n<br>\r\n           Afterwards, I took another piss at the toilet and proceeded to brush my teeth. It's disgusting to think that I'm brushing on a brush that came from another mouth. But I have another mouth and this toothbrush is for this mouth. So I proceeded with it. <br>\r\n<br>\r\n           The day outside is nice. Not too hot nor too cold. It's spring anyway and it's time to seize the weekend. Outside, I could see Lauren Teller talking someone to the phone. Dean admitted that even if he was bisexual, he still has a crush on Lauren. I don't really see why she's in to that girl. I admit that she does have some curves and a nice booth. The thing that's giving me off is her attitude. She is so slut material like she's the perfect embodiment of the stereotypical High school girl. <br>\r\n<br>\r\n           A message interrupted me from my brooding. It's from Dean and he's telling me to choir practice which I have forgotten about. Now, I have a choice. </span></div></div>",
            "created":1489986000,
            "id":2292503,
            "title":"Woke up in the middle of the night."
        },
        "1212212":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "His house?",
                "your house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It was a cold fall day and you ask Dean if you want to hang out instead of going to practice. Dean asks you where to hang out</span></div></span></div>",
            "created":1493960400,
            "id":2315309,
            "title":"Ditch it and hang out with Dean"
        },
        "121222":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Text her back now!",
                "Wait think this through and talk to Dean first"
            ],
            "content":"<div class=\"\"><div> <span>Its now Saturday morning you obviously have no school and wake up to notice you now have 'morning wood' popping out of your pajama pants. You quickly realize that you had a dream last night about Dean's crush - Lauren Teller. You begin to try to rub it down to make sure the wood goes away but you feel more in the want to jerk it but you decide not to. You open Dean's phone and see the time is now a little past ten in the morning. You see about a half hour ago you get a missed text message from Laura. You both like Laura, Dean mostly has a crush on her but shes bit of a drama queen. Anyway you open the text and it reads....<br>\r\n<br>\r\n\"Man Dean, cold winter morning comfortable in my bed with no one home and I need a cuddle buddy..When you wake up come over and be mine! ;)\"</span></div></div>",
            "created":1489899600,
            "id":2291724,
            "title":"Woke up the next morning."
        },
        "1212221":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Yes shes serious leave now!",
                "Dean chats with you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You text her back by waisting little time and basically getting to the point like are you serious?</span></div></span></div>",
            "created":1489986000,
            "id":2292200,
            "title":"Text her back now!"
        },
        "1212222":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Arriving at Lauren's",
                "On the way to Laurens"
            ],
            "content":"<div class=\"\"><div> <span>You go online and text Dean, and question the relationship with her.<br>\r\n<br>\r\nMe: Dude do you have anything going on with Lauren?<br>\r\nDean: Teller....?<br>\r\nMe: Yes!<br>\r\nDean: I saw recently she had the eyes for me, I would say im beginning to have a crush on her why?<br>\r\nMe: She told me when I woke up to go over to her house for a cuddle sesh..<br>\r\nDean: No way! Silena just texted you...well me the same thing. This is so weird<br>\r\nMe: Both of our crushes want to cuddle with us but we are in different bodies? <br>\r\nDean: This shall be fun, I kind of like it<br>\r\nMe: Just rolled out of bed and now Im going over there, best of luck my friend.<br>\r\nDean: Same goes for you...</span></div></div>",
            "created":1490072400,
            "id":2293082,
            "title":"Wait think this through and talk to Dean first"
        },
        "12122221":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Down to cuddle ",
                "Oh god"
            ],
            "content":"<div class=\"\"><div> <span>When you arrive at Lauren's to see only her car in the driveway you like how it's about to be nice and quiet just you and Lauren. As you knock on the door and waiting you think you look ridiculous in public with your pajama pants on yet your still tired and comfortable and just can't wait to cuddle with your good friend and Dean's crush. As Lauren opens the door you immediately get turned on when you see how Lauren is looking right now to see her a grey sleep shirt along with a matching 'I <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/heart.png\" alt=\"*Heart*\" class=\"emoteZ\" title=\"Heart\" border=\"0\" width=\"15\" height=\"15\"> NY' pajama pants with her hair tied up in a bun with glasses on?<br>\r\n<br>\r\n\"You like my outfit? You look cute in yours to, come on in sexy...\" Lauren says as you step into her house and take your shoes off and follow her to her room. \"I got these from my trip to New York City, they are really comfortable but speaking of sexy look at you!\"</span></div></div>",
            "created":1493528400,
            "id":2313158,
            "title":"Arriving at Lauren's"
        },
        "121222211":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Yes",
                "Sort of, shes acting kind of weird..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does the cuddle sesh go well?</span></div></span></div>",
            "created":1493874000,
            "id":2314863,
            "title":"Down to cuddle "
        },
        "1212222112":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Lauren makes a move",
                "You question her"
            ],
            "content":"<div class=\"\"><div> <span>An hour or so after arriving to Lauren's house both of you are laying in her bed watching Netflix. You are just turned on seeing her laying on your chest playing with you hair as your rubbing her hair also. You don't know whats going on but everytime Lauren talks to you she says \"Ja-Dean\" its almost like...no way she knows...</span></div></div>",
            "created":1494046800,
            "id":2315485,
            "title":"Sort of, shes acting kind of weird..."
        },
        "12122221121":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Ummm, what?!",
                "How do you know?!?"
            ],
            "content":"<div class=\"\"><div> <span>As you have a confused look on your face Lauren gets up from laying on your chest and lays on top of you get immediatly turned on. \"Woah..\" you say as you both have smiles on your faces. \"Something wrong Dean?!\" Lauren says as she puts her hand on your chest, you quickly say no. You both know what's about to happen as she leans in for the kiss.<br>\r\n<br>\r\nFor the next few minutes you two begin to makeout in her comfortable bed. While you think it's awkward your in Dean's body you don't care at the moment because you can't control it. Dean's emotions are doing the talking your just the soul inside his body living it. After a few minutes you came to your seneses after you hear the one word after it comes out of her mouth and that word was \"Blake!\"</span></div></div>",
            "created":1495688400,
            "id":2325167,
            "title":"Lauren makes a move"
        },
        "121222211211":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "That's awesome back to cuddling",
                "Still confused"
            ],
            "content":"<div class=\"\"><div> <span>\"What?! Blake?\" You say as you quickly push Lauren off of you as she has a shocked look on her face. \"Ummm...alright I have a confession to make Blake.\" Lauren says as you are still angry about the Blake part. \"Enough with saying Blake, I am Dean!\" You say with a pissed off tone. \"You can put your guard down Blake, I know it's you inside and not Dean.\" <i>What? How does she know? Or whoever is inside her body</i> you think to yourself as you have a confused look on your face.<br>\r\n<br>\r\n\"Huh?!\" You say as Lauren laughs a bit. \"Before you question my loyalty I will first off saying I am not even Lauren. It's me Silena...\" You say as you have a shocked look on your first but you get turned on knowing you just made out with Silena. \"What? Silena? You guys swapped bodies? How did you know about myself and Dean?\" You say as Silena reaches for Lauren's phone.<br>\r\n<br>\r\nSilena pulls up her text message conversation with Lauren which shows a screenshot, from Dean. Since Dean and Lauren are real close and love each other basically Dean admitted to her that you guys swapped bodies. So myself and Lauren not only decide to step into each other shoes but have a cuddle sesh with our crushes in each other bodies.\"</span></div></div>",
            "created":1501563600,
            "id":2362825,
            "title":"Ummm, what?!"
        },
        "123":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "YES",
                "No...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about you try to swap with your crush Silena?</span></div></span></div>",
            "created":1489813200,
            "id":2291431,
            "title":"Other?"
        },
        "13":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Clothing",
                "Life",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see Laura in the front room.<br>\r\nYou think that she is a good target because you two are good friend and somehow save yourself if something goes wrong.<br>\r\nYou target yourself and her and swapp.</span></div></span></div>",
            "created":1351832400,
            "id":1458847,
            "title":"Lauren"
        },
        "131":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping with her",
                "Swap with someone else",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You are now wearin Lauren's blue frilly top, her skinny jeans and her flats, as well as the little makeup she had on. You look over at lauren, and see that she is wearing your black t shirt, baggy jeans and sneakers, but this is all normal for her.</span></div></div>",
            "created":1419483600,
            "id":1907427,
            "title":"Clothing"
        },
        "132":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Name",
                "Relationships",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What in life?</span></div></span></div>",
            "created":1420779600,
            "id":1915458,
            "title":"Life"
        },
        "133":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "hesitate",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>gender would be nice....</span></div></span></div>",
            "created":1352782800,
            "id":1467007,
            "title":"something else"
        },
        "14":{
            "author_id":"space_man2",
            "author_name":"space_man2",
            "choices":[
                "Body: Extreme. Actual whole body swap.",
                "Body Parts only.",
                "Clothing",
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><div> <span>          Brock Rivers, the man with the piercing blue eyes, shining blond hair and pearly white teeth. Rumors say that he was of European descent. English or Italian I think. Those rumors were right though and to be specific, he was Half English and Half American. All those features came down with his diminutive stature. He became the laughing stock during his transfer at 3rd year. His optimistic character protected him from the shame. In the end, the laughs died down and he became a good friend to all. Still, there are people who found a way to laugh at him because he was a Mormon.<br>\r\n<br>\r\n          Unlike the stereotypical Mormons we see on television, he wasn't radical in making all the people around him into Mormons. He was rather quiet about his private life to be frank. We only found out he was a Mormon when Jessica Slate, the cashier's daughter and a widely known gossip queen, waved Brock's personal profile. Sure she was put in detention but Brock stood unfazed. He still went to school like it never happened. He was the bravest person I know.<br>\r\n<br>\r\n          Currently, he is integrating himself between me and Dean, my best friend. He hangs out with us every weekend and being a math wizard, he helps us in our assignments. The only bad thing I realize he has is his over protectiveness over his stuff. You literally can't borrow anything from him. From as simple as a pen to extremes such as money. Still, he is a great friend.<br>\r\n<br>\r\n<br>\r\n          It's Saturday morning and I sent him a message to come to my house. He was ecstatic enough to agree and he was bringing chips, a rare sight. Dean was out on his choir practice and he'll be here at 3 PM like always. I suppose that he will be bringing his new game he was bragging us all week. But with this new app in my hand, he'll be in a surprise more than his game. If it works though.<br>\r\n<br>\r\n          9 AM, Brock turned up at the porch clutching to a huge bag of chips. He was smiling all about as he greeted my mother. \"Hello Mrs. Fallor. Can I come in?\".<br>\r\n<br>\r\n          We went into my room and fired up my PS3. Sure it was outdated but it still has games that me, Dean and Brock likes. Brock likes GTA 5 the best. He likes to kill people, especially at night. I remember how happy he was when he shot someone. As he was busy waiting for the game to start, I activated my phone and went to the Swapp App. From the looks of the GUI, it is still primitive with the clunky user interface. It's embarrassing to look how they are still using the Comic Sans font. Like it was making the app more cuter. I clicked start and an assortment of options popped up. There was also this background sound that is annoying to hear to I muted my phone. Now which of the options should I use?</span></div></div>",
            "created":1489899600,
            "id":2291642,
            "title":"Brock"
        },
        "15":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Body",
                "Clothing",
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><div> <span>You send a text to Silena. \"U want to come over?\"<br>\r\n She replies \"sure. be there in ten minites\"<br>\r\n<br>\r\nTen minutes later, the doorbell rings. You answer it and Silena is there. \"What's up\" she says. <br>\r\n<br>\r\nYou can't think of what to say. \"I, uh, need to change shirts\" you tell her. <br>\r\n<br>\r\n\"Okay. I'll wait on the couch\" <br>\r\n<br>\r\nYou run up to your room and change shirts, then you come back down. She doesn't notice you come back down, so you scan her and hit Swap. Four new options come up on the screen. </span></div></div>",
            "created":1334120400,
            "id":1313661,
            "title":"Silena"
        },
        "151":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Head",
                "Upper body",
                "Lower body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick something from the...</span></div></span></div>",
            "created":1334120400,
            "id":1313663,
            "title":"Body"
        },
        "1511":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Hair",
                "Face",
                "Mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you swapped something from her head. But what?</span></div></span></div>",
            "created":1334466000,
            "id":1316356,
            "title":"Head"
        },
        "15111":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Keep swapping with Silena",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You selected hair and pressed swap. The brown hair didnt block your eyes but there was now hair hanging on both sides of your head, cutting off your perifial vision. Silena's bangs were visible when looking up, and they currently obscured your view of the ceiling fan. Now what?</span></div></div>",
            "created":1334466000,
            "id":1316362,
            "title":"Hair"
        },
        "151111":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Mouth",
                "Breast"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Two new options came up.which do you choose?</span></div></span></div>",
            "created":1347771600,
            "id":1429287,
            "title":"Keep swapping with Silena"
        },
        "1511111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Keep swapping",
                "Swap back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your mouth now felt plumper, and you could taste some lipstick on your lips.</span></div></span></div>",
            "created":1419483600,
            "id":1907425,
            "title":"Mouth"
        },
        "1512":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Torso",
                "Breast",
                "Arms or Hands"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You pick...</span></div></span></div>",
            "created":1334120400,
            "id":1313665,
            "title":"Upper body"
        },
        "15122":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "Keep swapping with Selina.",
                "Test the iPod on people outside."
            ],
            "content":"<div class=\"\"><div> <span>You decided against 'enlightning' Silena, and instead kept her 'unaware' of any changes that took place. You highlighted her breasts, which were a C-cup and then initiated the swap, but at first you didn't feel anything. \"Yeah...like I thought!\" you grumbled skeptically, looking at the ipod in your hand. But then you felt a strange tingling in your chest and you looked down to see it swelling outwards...pushing out your shirt. In just a few seconds a pair of breasts had formed on your chest, and your jaw fell open in shock.<br>\r\n<br>\r\n\"Wow!!\" you gasped, reaching up to grab your new 'additions'. Then you looked over at Silena and it took you a moment to realize that she was now flat-chested, and she had a considerably amount of chest hair too. \"Holy crap!\" you mumbled. \"It worked!\"<br>\r\n<br>\r\n\"What worked?\" a frowning Silena suddenly asked, having overheard you.<br>\r\n<br>\r\n\"Oh...nothing!\" you replied, shaking your head. Then when she looked away you pulled the top of your shirt out and peered down at the two fleshy mounds on your chest. A broad grin appeared on your face as you shook your torso a little and watched your breasts move. You quickly activated the iPod again and this time selected the 'Clothing' option, and you proceeded to swap Silena's underwear (including her panties) with your own. \"That's better!\" you smiled, seeing your boobs sat snugly in Silena's bra.<br>\r\n<br>\r\n\"Now what?\" you mused, wondering what to do next.<br>\r\n</span></div></div>",
            "created":1341637200,
            "id":1373269,
            "title":"Breast"
        },
        "151221":{
            "author_id":"damaho1",
            "author_name":"Mr. Scratch",
            "choices":[
                "swap again with Selina, now called Blake.",
                "swap again with Selina, now called Blake, but this time enlighten her."
            ],
            "content":"<div class=\"\"><div> <span>\"Swapping with her again would be nice...\", you thought while gently brushing over your new bra covered breasts. \"But what should it be?\".<br>\r\n<br>\r\nYou had to decide quickly before she gets bored and leaves or might ask you what you were doing. \"Okay...\", you began in your mind while processing your idea. \"I know that the physical swaps work... Let's try something less obvious.\". <br>\r\n<br>\r\nNot wanting to mess with any relationships or skills, yet, you decided for something very small, like her name. You activated the app again and scanned Selina. As fast as you could, you chose the name option and swapped. You did not feel different.<br>\r\n<br>\r\n\"Only one way to find out.\", you thought.<br>\r\n<br>\r\n\"So... Blake... You want something to drink?\", you ask her and felt weird immediately. You would have to get used to call your crush by your name. Although you had to admit that she did not look as beautiful as before she came here. Probably because she was flat chested but still, she was beautiful.<br>\r\n<br>\r\nSelina smiled at you. \"Yeah, that would be nice.\".<br>\r\n<br>\r\nYou quickly went to the kitchen but not in order to get her something to drink. You needed a moment to process that all of this really worked. \"This app is worth more than a million dollars! I can't figure out why it was free.\", you thought smilingly.<br>\r\n<br>\r\nYou then decided to...</span></div></div>",
            "created":1342155600,
            "id":1377533,
            "title":"Keep swapping with Selina."
        },
        "1512211":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "life",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what do you swap with her</span></div></span></div>",
            "created":1343624400,
            "id":1393736,
            "title":"swap again with Selina, now called Blake."
        },
        "15122111":{
            "author_id":"damaho1",
            "author_name":"Mr. Scratch",
            "choices":[
                "Romantic",
                "Friendly"
            ],
            "content":"<div class=\"\"><div> <span>You pressed your breasts together and smiled broadly. \"Okay then 'Blake'. Let's see if we can swap something else.\", you mumed and started the app once again. This time you chose the life option once more, being curious what else it could do.<br>\r\n<br>\r\n\"And what now?\", you thought. \"I think this would be interesting.\". With that you selected the \"relationship\" option. New options appeared.<br>\r\n<br>\r\n\"Hm? Romantic or Friendly... Which one to choose...\". You decided to choose:</span></div></div>",
            "created":1343624400,
            "id":1393769,
            "title":"life"
        },
        "151221112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are not so much into romance and select “friendly” and wait what will happen.<br>\r\nSuddenly new Blake, said: ”So Selina, did you find a boyfriend in the meantime?”<br>\r\n</span></div></span></div>",
            "created":1343883600,
            "id":1396081,
            "title":"Friendly"
        },
        "1512211122":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Personality",
                "Lower body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"No, 'Blake' I haven't.\"<br>\r\n'This is amazing!' he thought. 'What do I swap next?'<br>\r\n<br>\r\nWhat does he swap next?</span></div></span></div>",
            "created":1347944400,
            "id":1430266,
            "title":"no"
        },
        "15122111222":{
            "author_id":"derek666",
            "author_name":"WOW",
            "choices":[
                "Legs and feet",
                "hips butt and groin"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What part do you choose?</span></div></span></div>",
            "created":1348117200,
            "id":1431789,
            "title":"Lower body"
        },
        "151221112221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "done",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>since you do not want to loose your best friend right now you select only legs and feet</span></div></span></div>",
            "created":1352782800,
            "id":1467008,
            "title":"Legs and feet"
        },
        "1512211122212":{
            "author_id":"vladimir1",
            "author_name":"Vlad",
            "choices":[
                "Swap something else",
                "Lose control of the app"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Maybe you wanna be... you know, my girlfriend?\"<br>\r\nOh, that's coming too far... -you start to be scared a little bue also amazed.<br>\r\nYou decided to swap something else.<br>\r\n</span></div></span></div>",
            "created":1402635600,
            "id":1811515,
            "title":"keep swapping"
        },
        "15122111222122":{
            "author_id":"vladimir1",
            "author_name":"Vlad",
            "choices":[
                "Try to fix it",
                "Decide to be Silena (entirely, except your mind)"
            ],
            "content":"<div class=\"\"><div> <span>You tried to choose something but accidentally you push the button- \"randomize\" under the body parts section. You feeling weird and looking down. \"That's definitelly too much\".<br>\r\n\"What Silena? You said yes!?\"<br>\r\n\"Wait! Ehmm... I have a little problem here!\"- And it was a problem in fact.<br>\r\nRight now most of our body is Silena's exept your arms and heads. </span></div></div>",
            "created":1402635600,
            "id":1811518,
            "title":"Lose control of the app"
        },
        "151221112221222":{
            "author_id":"vladimir1",
            "author_name":"Vlad",
            "choices":[
                "Try to make your clone",
                "Ending"
            ],
            "content":"<div class=\"\"><div> <span>Well, Being Silena?<br>\r\nYou change your all body, now you look like Silena in every little aspect. No, you are now Silena!<br>\r\n\"Ok, I'm coming out!\" you come out of your room. :How am I looking now?<br>\r\n\"Ehmm, gorgeous! Georgeous as always!\"<br>\r\nSo she looks like me, she even think she is me now... cool!<br>\r\n\"Well, for what you were asking?\"<br>\r\n\"Ehmm... Wanna come with me for a date... NO! Dinner, just a dinner!\"<br>\r\n\"Sorry, I'm busy today, thanks for inviting me anyway, maybe other time\"<br>\r\n\"Well, okay. Bye\" You feel a bit sad about this but you are not interested in boys. You still have typical male mind.<br>\r\nYou look at your new body and feel good in it. <br>\r\n\"Ok, now I feel in love in myself... is there any app that can make my clone now?\"<br>\r\nYou think that's stupid idea. Right now you are a pretty and popular girl. our life as going to be amazing.<br>\r\nThe only thing that bother you now is that you still like girls, but you realize that maybe it may be even better...</span></div></div>",
            "created":1402635600,
            "id":1811530,
            "title":"Decide to be Silena (entirely, except your mind)"
        },
        "151222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "A hot redhead in her 20s",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you see outside?</span></div></span></div>",
            "created":1424062800,
            "id":1935421,
            "title":"Test the iPod on people outside."
        },
        "1512221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body/clothing",
                "Life/personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you swap with her?</span></div></span></div>",
            "created":1424062800,
            "id":1935429,
            "title":"A hot redhead in her 20s"
        },
        "15122211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Body",
                "Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Body or clothing?</span></div></span></div>",
            "created":1424062800,
            "id":1935430,
            "title":"Body/clothing"
        },
        "151222111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Upper body",
                "Lower body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you swap with her?</span></div></span></div>",
            "created":1424062800,
            "id":1935431,
            "title":"Body"
        },
        "1512221111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Head",
                "Upper body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Head or upper body?</span></div></span></div>",
            "created":1424062800,
            "id":1935433,
            "title":"Upper body"
        },
        "15122211111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap her long red hair?</span></div></span></div>",
            "created":1424062800,
            "id":1935434,
            "title":"Head"
        },
        "151222111112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap mouths (voice included)?</span></div></span></div>",
            "created":1424062800,
            "id":1935435,
            "title":"Something else"
        },
        "1512221111122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it anything between eyes, nose or ears?</span></div></span></div>",
            "created":1424062800,
            "id":1935438,
            "title":"No"
        },
        "15122211111222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Face swap",
                "Full head swap"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time to choose</span></div></span></div>",
            "created":1424062800,
            "id":1935441,
            "title":"No"
        },
        "15122211112":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you swap breasts?</span></div></span></div>",
            "created":1424062800,
            "id":1935442,
            "title":"Upper body"
        },
        "151222111122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Arms",
                "Hands"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Arms or hands?</span></div></span></div>",
            "created":1424062800,
            "id":1935446,
            "title":"Other"
        },
        "1512221111222":{
            "author_id":"casualapple2",
            "author_name":"Apple",
            "choices":[
                "Swps more with the redhead (or swap back)",
                "Swap with someone else"
            ],
            "content":"<div class=\"\"><div> <span>You select 'Swap Hands' and immediately feel a tingle in your hands that slowly dissapates. When you look at your left hand, you see a slimmer, slightly more tanned hand, with longer fingernails painted a lovely light blue. You check your other hand to find the same result. \"I like what you've done with your nails\", Silena comments cheerily as you admire your manicure.</span></div></div>",
            "created":1531695060,
            "id":2520217,
            "title":"Hands"
        },
        "1512222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "A middelaged mother with her baby",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could be outside?</span></div></span></div>",
            "created":1424062800,
            "id":1935422,
            "title":"Other"
        },
        "15122221":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Body/Clothing",
                "Life/Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap with the mother?</span></div></span></div>",
            "created":1474952400,
            "id":2215458,
            "title":"A middelaged mother with her baby"
        },
        "15122222":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "A 7 year old girl in a princess costume",
                "A buff 30 year old mechanic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Time to choose now!</span></div></span></div>",
            "created":1424062800,
            "id":1935426,
            "title":"Other"
        },
        "15123":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Arms",
                "Hands"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1334120400,
            "id":1313667,
            "title":"Arms or Hands"
        },
        "151232":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Swap something else with her",
                "\"Enlighten\" her"
            ],
            "content":"<div class=\"\"><div> <span>You select Hands. <br>\r\n<br>\r\nYour hands go numb and you are temporarily blinded. When you can see again, you look at your hands. <br>\r\n<br>\r\nThey are a little bit smaller, more smooth, slender, and just barely more tan. The perfectly manicured fingernails are painted a deep lavender. <br>\r\n<br>\r\nSilena hears you say \"wow\" and she looks at you. <br>\r\n<br>\r\n\"Wow what?\" she asks. <br>\r\n<br>\r\n\"Huh? Oh, uh, you just look really good in this light\" you say, pointing at her, seeing if she notices anything. <br>\r\n<br>\r\nShe acts like there's nothing wrong!<br>\r\n<br>\r\nYou decide to...</span></div></div>",
            "created":1334120400,
            "id":1313673,
            "title":"Hands"
        },
        "1512321":{
            "author_id":"comiccow6",
            "author_name":"Comiccow6",
            "choices":[
                "Arms",
                "Legs and Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will you swap?</span></div></span></div>",
            "created":1347944400,
            "id":1430265,
            "title":"Swap something else with her"
        },
        "152":{
            "author_id":"acejr",
            "author_name":"Ace",
            "choices":[
                "Top",
                "Footwear and headwear",
                "All Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What clothing did you swap?</span></div></span></div>",
            "created":1334206800,
            "id":1314201,
            "title":"Clothing"
        },
        "1521":{
            "author_id":"qwaszxpolkmn",
            "author_name":"The One and Only",
            "choices":[
                "Swap underwear with her",
                "Try a swap from the Petsonality category",
                "Hit the Enlighten button"
            ],
            "content":"<div class=\"\"><div> <span>You switch tops with her. There's a bright flash. <br>\r\n<br>\r\nWhen you can see again, you look down. You are now wearing Silena's lime green cami and her tight purple girl's hoodie. <br>\r\n<br>\r\n\"This is incredible!\" you think!<br>\r\n<br>\r\nThen she notices you behind her. She is wearing your black Call Of Duty tee shirt. <br>\r\n<br>\r\nNext, you...</span></div></div>",
            "created":1334206800,
            "id":1314281,
            "title":"Top"
        },
        "15211":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "Uncomfortable, swap something.",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You set it up to swap underwear, and you set it off.<br>\r\nYou feel constricted by the bra around your chest and your waist.<br>\r\nHow do you feel about this?</span></div></span></div>",
            "created":1357794000,
            "id":1505830,
            "title":"Swap underwear with her"
        },
        "15212":{
            "author_id":"hydress",
            "author_name":"Stardust",
            "choices":[
                "complete personality swap",
                "one part"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>will it be all or one part</span></div></span></div>",
            "created":1344920400,
            "id":1404499,
            "title":"Try a swap from the Petsonality category"
        },
        "152122":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Her girlyness",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What part of her personality?</span></div></span></div>",
            "created":1419483600,
            "id":1907422,
            "title":"one part"
        },
        "15213":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "She is shocked (happy)",
                "She is shocked (scared)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As soon as you press the button, a bright flash engulphs the wholeroom. When the flash subsides, Silena is very confused, so you explain to her what just happened and how you did it.<br>\r\nHow does Silena react?</span></div></span></div>",
            "created":1424062800,
            "id":1935400,
            "title":"Hit the Enlighten button"
        },
        "1522":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "You keep playing until its time for Silena to leave",
                "You swap some more with her",
                "You swap stuff with some family members downstairs"
            ],
            "content":"<div class=\"\"><div> <span>Once you hear the doorbell, you rush downstairs to open the door. On the other side you were greeted by Silena, looking beautiful as ever, dressed in a white tank top, some blue shorts, some low heeled sandals and her signature hipster glasses.<br>\r\n<br>\r\n\"So, whats up?\" Asked a cherrful Silena, her gorgeous raven-black hair seemingly glowing.<br>\r\n<br>\r\n\"Uh, not much, just wanted to hang out, wanna go upstairs to my room? We can play some videogames if you want? you reply, hoping she says yes.<br>\r\n<br>\r\n\"Sure, let's go\"<br>\r\n<br>\r\nAfter a while of playing some Mario Kart, you forgot about the app, and you were just enjoying Silena's company, and she was yours. But then you grabbed your phone to check the time and remembered the app, so you open it and decide to swap something with Silena. You settled on footwear and headwear.<br>\r\n<br>\r\nAfter pressing a button, there were no flashes or anything fancy, just the strange feeling that you were suddenly wearing glasses and that your feet were colder. You looked down and saw your hairy feet in girl sandals, which was kind of gross. Then you took off your glasses but immediatley put them back on since your vision got blurry. \"Huh, weird\" you muttered.<br>\r\n<br>\r\n\"Is something wrong?\" asked a now glasses-less Silena, also sporting your old sneakers, and even lime that she was still beautiful.<br>\r\n<br>\r\n\"Yeah, just hang on a sec.\" you say as you stand up, heading towards you closet. There you found a new, much bigger space for your new shoes, and boy were there more shoes. High heels, low heels, platforms, flats, sandals, you name it, everything was there. Even in one of your drawers you found some feminine beanies and berets, as well as some girlier-shaded sunglasses.<br>\r\n<br>\r\n\"What was that all about?\" asked Silena, who suspected nothing.<br>\r\n<br>\r\n\"Never mind, lets get back to the game.\"<br>\r\n<br>\r\n\"About time\" Silena said jokingly</span></div></div>",
            "created":1444971600,
            "id":2048172,
            "title":"Footwear and headwear"
        },
        "153":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Name",
                "Relationships",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What aspect in life?</span></div></span></div>",
            "created":1420779600,
            "id":1915457,
            "title":"Life"
        },
        "1531":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "First Name",
                "Middle Name"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First name or middle name?</span></div></span></div>",
            "created":1457154000,
            "id":2113322,
            "title":"Name"
        },
        "15312":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Keep Swapping",
                "Just talk to her for a little while"
            ],
            "content":"<div class=\"\"><div> <span>You decide you want to start small just to test the thing, see if it actually works. You know that her middle name is Lilly so you decide to start there. You navigate yourself to the Middle Name selection and then, well... you \"Swapp\". You then change shirts to legitimize your earlier claim and head down and ask her to tell you what your middle name is. \"Umm... Lilly? Why?\" She replies, confused. \"Nothing , just testing to see how much you know about me.\" Now that you've seen that it works, what do you decide to do next.</span></div></div>",
            "created":1460782800,
            "id":2134231,
            "title":"Middle Name"
        },
        "1532":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Friends",
                "Family",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Friends, family or both?</span></div></span></div>",
            "created":1424062800,
            "id":1935407,
            "title":"Relationships"
        },
        "15322":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "You swap romantic relationships",
                "Keep with swapping family"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry, family wasnt an option, but we can make it one!</span></div></span></div>",
            "created":1424062800,
            "id":1935408,
            "title":"Sorry"
        },
        "153221":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Ask her to be your girlfriend",
                "Swap some more"
            ],
            "content":"<div class=\"\"><div> <span>You pressed the button and the flash stunned you.<br>\r\nSince you knew Silena didn't have a boyfriend that was no big deal. But you still didn't know what changed. After a whole day of hanging out, a big conclusion jumped to your head, Silena is now the one with the crush!</span></div></div>",
            "created":1424062800,
            "id":1935411,
            "title":"You swap romantic relationships"
        },
        "1532211":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "You go out somewhere",
                "You decide to stay in"
            ],
            "content":"<div class=\"\"><div> <span>As you were sitting in the couch playing videogames, you ceased the opportunity.<br>\r\n\"Hey Silena?\"<br>\r\n\"What is it?\" She asked eagerly<br>\r\n\"Would you like to be my girlfriend?\"<br>\r\n\"OMG YES YES YES!!! Ive had a crush on you for like forever!\"<br>\r\n\"Awesome, then would you like to go on a date with me?\"<br>\r\n\"Yeah, where do we go?\"</span></div></div>",
            "created":1424062800,
            "id":1935414,
            "title":"Ask her to be your girlfriend"
        },
        "15322111":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "The mall",
                "The beach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you go out?</span></div></span></div>",
            "created":1424062800,
            "id":1935416,
            "title":"You go out somewhere"
        },
        "15322112":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Uh... Slight problem...",
                "Just play some more video games, save any plans for going out later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you guys do?</span></div></span></div>",
            "created":1457154000,
            "id":2113324,
            "title":"OK... Now what?"
        },
        "153221121":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Switch Back! It was better before!",
                "Switch something else, something to make this more normal"
            ],
            "content":"<div class=\"\"><div> <span>To your surprise you find that the swap also caused you to just think of Silena as a friend, Which puts you in an awkward situation considering that you were the one who instigated the date. \"How about we just stay in tonight?\" You ask, hoping that she wouldn't misunderstand. \"Sure! So what do you want to do?\" She says as she slowly approaches you. \"Uh... Well I have to go to the bathroom right now...\" You stand up and walk in the direction of the bathroom. Now what?</span></div></div>",
            "created":1457154000,
            "id":2113328,
            "title":"Uh... Slight problem..."
        },
        "1532211211":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Swap something...",
                "Just hang out with her for a while. No need for things to get weirder."
            ],
            "content":"<div class=\"\"><div> <span>As you duck into the bathroom you prepare to swap back romantic relationships. You figure that it was best to figure out how to get her to fall in love with you normally, with a little help of course. Right now though you just need to get things straightened out. You sneak back out of the bathroom and make the swap and you feel the emotions pouring back in. She looked so perfect so suddenly. It was hard to take in. She noticed you and walked up to you. \"Hey... um... listen... I know I got your hopes up with asking you out on that date... I'm really sorry. I don't even know why I did it. I just don't think of you that way.\" She seems to be preparing for you to be upset with her. Swapping the relationship around again made her the one who asked you out... and the one who felt awkward about it. \"Can we still be friends?\" She asks hopefully. You are absolutely crushed. You know that you are the one who asked her out but you just feel like your hopes and dreams had been raised up and dashed to the ground immediately. Your thoughts didn't seem to be affected by the app, but your emotions certainly are. You finally replied. \"Yeah... It's fine. We can still be friends.\" She looks relieved. You just don't know what to do now.</span></div></div>",
            "created":1466226000,
            "id":2166266,
            "title":"Switch Back! It was better before!"
        },
        "1532211212":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Oops...",
                "*sigh* Thank god..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you hit the wrong button or do you succeed?</span></div></span></div>",
            "created":1457154000,
            "id":2113331,
            "title":"Switch something else, something to make this m..."
        },
        "15322112121":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Body or Clothing",
                "Life or Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you switch?</span></div></span></div>",
            "created":1457154000,
            "id":2113332,
            "title":"Oops..."
        },
        "153221121211":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Body",
                "Clothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it then?</span></div></span></div>",
            "created":1457154000,
            "id":2113334,
            "title":"Body or Clothing"
        },
        "153221121212":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it then?</span></div></span></div>",
            "created":1457154000,
            "id":2113335,
            "title":"Life or Personality"
        },
        "15322112122":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Body or Clothes",
                "Life or Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you swap then?</span></div></span></div>",
            "created":1457154000,
            "id":2113353,
            "title":"*sigh* Thank god..."
        },
        "153221121221":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Body",
                "Clothes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1457154000,
            "id":2113355,
            "title":"Body or Clothes"
        },
        "153221121222":{
            "author_id":"draco115",
            "author_name":"Draco115",
            "choices":[
                "Life",
                "Personality"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1457154000,
            "id":2113356,
            "title":"Life or Personality"
        },
        "1533":{
            "author_id":"jprocha",
            "author_name":"JP",
            "choices":[
                "Gender (you dont change, but people will treat you like a girl)",
                "Middle name",
                "Her whole life! ( no physical changes)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What aspect in life?</span></div></span></div>",
            "created":1424062800,
            "id":1935404,
            "title":"Something else"
        }
    },
    "info":{
        "author_id":"qwaszxpolkmn",
        "author_name":"The One and Only",
        "brief_description":"You discover an iPod app that can swap anything between two people!",
        "created":1334124720,
        "description":"<td align=\"left\" class=\"norm\">Your name is Blake Fallor. You are a sixteen year old boy. You have brown hair and you are 5'6. <br>\r\n<br>\r\nFamily<br>\r\n   Trina- your mom. 41<br>\r\n   Greg- your dad. 46<br>\r\n   Gwen- sister. 19<br>\r\n   Lily- sister. 13<br>\r\n   Shelby- sister. 7<br>\r\n<br>\r\nFriends<br>\r\n   Dean McLeary- best friend<br>\r\n   Lauren Tell- good friend<br>\r\n   Brock Rivers- good friend<br>\r\n   Silena Robb- Lauren's best friend, your crush<br>\r\n<br>\r\nFeel free to add characters, but do NOT change those that are given. <br>\r\n<br>\r\nThe Swapp! app has five options (Scan, Swap, Enlighten, Undo, Reset)<br>\r\n<br>\r\n-Scan<br>\r\n---This is how you choose your two \"test subjects\". <br>\r\n<br>\r\n-Swap<br>\r\n---Body<br>\r\n------Face<br>\r\n------Hair<br>\r\n------Eyes<br>\r\n------Nose<br>\r\n------Mouth (this includes voice)<br>\r\n------Ears<br>\r\n------Facial Hair<br>\r\n------Torso<br>\r\n------Breast<br>\r\n------Arms<br>\r\n------Hands<br>\r\n------Waist<br>\r\n------Hips<br>\r\n------Butt<br>\r\n------Groin<br>\r\n------Legs<br>\r\n------Feet<br>\r\n------Whole Body Option<br>\r\n---Clothing<br>\r\n------Top (this includes dresses)<br>\r\n------Bottom<br>\r\n------Footwear<br>\r\n------Headwear (Glasses, hats, etc.)<br>\r\n------Underwear<br>\r\n------Accessories (Purse, wallet, jewelry, piercings, etc.)<br>\r\n------Makeup<br>\r\n------Tattoos<br>\r\n------All Clothing Option<br>\r\n---Life<br>\r\n------First Name<br>\r\n------Middle Name<br>\r\n------Gender (you will be treated as the opposite gender, but you will not physically change)<br>\r\n------Relationships<br>\r\n---------Friendly<br>\r\n---------Romantic<br>\r\n---Personality<br>\r\n<br>\r\n-Enlighten<br>\r\n---This allows you to make a person aware of the swaps. <br>\r\n-Undo (most recent action)<br>\r\n-Reset (all previous actions, except Enlighten)<br>\r\n<br>\r\nHave fun!<br>\r\n</td>",
        "id":1860702,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584810300,
        "modified":1584810300,
        "pretty_title":"Swapp!"
    }
}