{
    "chapters":{
        "1":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "The local tavern?",
                "Search buxholm forest for Camp Unity?",
                "A blacksmith across town?",
                "The hot springs?",
                "Somewhere else..."
            ],
            "content":"<div class=\"\"><div> <span>You are a regular ordinary human farmer living in a rural town on the outskirts of the kingdom of Larion. You don’t really have a name, so much as nicknames people give you, “farmboy” “peasant” and “boy” to name a few. Your pretty young for a farmer, only 20 years old. But since your father passed you’ve been living alone and taking care of the farm by yourself. You wake up one morning, ready to do what you do every average day, but as you go out to the fields you see a carriage riding up the road, it’s moving pretty fast so it catches your eye. You notice an insignia on the side that you instantly recognize, it’s a red heart with two swords crossed over it, the logo of the Fayron tribe... They’re nothing but trouble, Officially condemned by the kingdom. Stinking, smelly, gassy, disgusting women messing with men and taking them for their own entertainment. You actually have history with their leader Hilda Lazgar. She’s a large orc woman and suprisingly you used to date, but when you found out she was part of the Fayrons, their LEADER nonetheless you decided it would be best to break up. Obviously Hilda wasn’t pleased and she nearly captured you, you haven’t seen her since.<br>\r\n<br>\r\nThe carriage is getting closer so you lay down in the field hopefully unnoticed. You hear them stop right outside your farm, you peek through the grass to see what’s happening, who it could be? Is it Hilda herself? Here for her payback?  As you look the carriage doors open revealing a large woman, she has to be at least 9 feet tall! She has long blonde hair flowing freely, and a strong, toned looking physique. Her breast are moderately sized, maybe a c cup if she was normal sized. As she turns around to call her partner you see her round firm butt, not very fat or big but a very nice shape indeed. “Cmon Ebi! I don’t think he’s home hehe” the Amazonian says snickering. The other girl apparently named ‘Ebi’ Exits the carriage. It’s a Kobold! She’s wearing almost nothing, the only parts of her covered are her privates and breasts by a thing loincloth, this ‘Ebi’ is extremely voluptuous, being a little chubby but still very attractive. . “Alright I’m coming! I’m so excited! Hilda’s gonna love this!” The kobold seems very excited for what they’re gonna do, you begin to worry now as you now know they were sent by Hilda, so it can’t be good... “alright let’s do this” said the amazon. <br>\r\n<br>\r\nThey approach your house waking very sexily together, as they enter your home you can hear indistinguishable chatter and giggling, then you hear a noise that’s unmistakable *FRAAPPPPPPPPPPPPPPTTTTT*! You hear a colossal fart rip inside your home, you begin to realize what’s going to happen. “HNGGGGGG” you hear a loud grunt as a barrage of farts and cracking noises echo throughout your house. You can only sit and listen as your house gets bombed with gas and presumably shit. After about 10 minutes of nonstop gas, it stops. You see the two girls leaving, walking away giggling as they get into their carriage and leave, you almost don’t want to see the damage. <br>\r\n<br>\r\nAs you approach the house an unearthly smell hits you as you gag incredibly hard trying to not to vomit. You look inside and see most of your house covered in a thick brown paste, you navigate the wasteland into your room and find that they used your sheets and clothes as toilet paper for their muddy posteriors. This will take weeks to clean, let alone get the smell out. This is it, the moment you decide to put an end to Hilda’s cruel antics. Your going to stop Hilda and her tribe by hopefully capturing her and bringing her to the kingdom to be arrested for rebelling against the kingdom, and making men her tribes servants. Once Hilda is gone from the tribe, hopefully it will fall apart without her. But you need to find where she is first, she could be anywhere! You need to be careful, Hilda has undercover members all over, so you never know who you can trust! Where should you check first?</span></div></div>",
            "created":1601448600,
            "id":2912746,
            "title":"The start of your journey."
        },
        "11":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Bring you home with them.",
                "Let you go only after a little more fun."
            ],
            "content":"<div class=\"\"><div> <span>The tavern sounds like a good place to look, there’s usually some troublemakers there, they may have info on Hilda’s whereabouts. You head across town to the the bar, it starts to rain as you approach. A wooden sigh flaps in the wind, ‘The Heavy Stone Bar’ it reads. Another sign next to the door says ‘Ladies night! Women get 50% off!’ Sounds like theirs gonna be quite a few girls, maybe some will be able to help you. As you enter the crowded bar you seem to be the only male in the entire building, many different women of all kind, big and small, chubby and muscly are in the bar. You can’t help but feel shy as the crowd gets a bit quieter as eyes are drawn to you, a human male walking in. To most of these women you’re quite small, you feel intimidated as you go towards the barstools. As far as you can tell theirs only one seat left, it’s right between a female orc on the left and a female boar anthro on the right.<br>\r\n<br>\r\n<br>\r\n As you sit down you hear both women giggle, the boar woman looks to be at least 7 feet tall while the orc girl is around 8 feet tall, the boar woman is pretty chubby and visibly sweaty, she has a cute pudgy belly and a nice big butt. She’s wearing a loincloth around her privates and breast. As for the orc, she’s very voluptuous, having a little fat in the right areas, she had piercing blue eye, and black hair. “Well well well, look what we have here Yotul! A puny human male coming in the bar on ladies night! He’s taking up a spot for what could be a lucky lady getting half off!”  Says the boar. “You’re right Wasue! How rude of him to hog a chair when a lady could use it!” Says the orc who’s name is apparently Yotul. “You picked a bad place to sit tiny, cus alcohol makes me gassy!” Wasue leans over to her right as her butt peels from the sweat covered seat, she aims her butt at you as you see her large anus poke out from between her hairy ass. *BRRRRRRTTTTTT* You begin to cough and gag as the boar blows a steaming hot fart across your body. “Aaaaahhh that felt good.” <br>\r\n<br>\r\n<br>\r\nWasue plops her swampy ass back onto her chair as you try to recover. “You know Yotul, I heard humans make pretty good footrests.” Wasue says suggestively. “Is that so? Hmmm, I should test that rumor!” Yotul giggles as she turns to her right facing towards you and takes off her shoes and rests her stinky feet right on your lap, the smell makes you want to vomit. “About what we said before, he is taking up a spot for ladies night, but I got an idea!” Wasue says. Just then you feel Wasue grab you as she lifts you off the stool, you start trying to break free but it’s no use she’s to strong. She brings you around to her front side as she faces you towards her. She brings you up to her face... *URRRRRPPPPPPP* Wasue lets a sickly burp out right in your face, strings of spit fly out and cover you as you choke on her gas.<br>\r\n<br>\r\n<br>\r\n Wasue sets your in her lap facing towards her as she takes her cloth covering her breast off and wraps it around your body, essentially making you a backpack but on her front. She tightens the cloth as your shoved face first into her sweaty cleavage. You can feel her big belly push up against your whole body, *GLORP* *GRRGGGGGLLLL*. You can hear her belly gurgling and popping as your body sinks into it. “Ahhh that feels nice, see Yotul? Problem solved!” Wasue says with a laugh. After a few hours of being pasted to Wasue’s body it’s closing time at the bar, the customers begin to leave but what will Yotul and Wasue do with you? </span></div></div>",
            "created":1602038820,
            "id":2916446,
            "title":"The local tavern?"
        },
        "12":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "The cave.",
                "Outside in a tent.",
                "You’re not alone..."
            ],
            "content":"<div class=\"\"><div> <span>You decided your best chance at finding Hilda is in the camp itself, it will be risky but hopefully it will be worth it. You pack some supplies for camping and head out for the forest. As you approach the edge you begin to have second thoughts, but you’re determined, you press forward and continue your journey. As the sun begins to set you realize you need a place to sleep. There’s a nice patch of land in the distance where you could set up, or there’s a cave, although not super appealing it definitely seems safer than staying out in the open. Where do you sleep for the night?</span></div></div>",
            "created":1601449200,
            "id":2912749,
            "title":"Search Buxholm forest for Camp Unity?"
        },
        "122":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "A cow anthro!",
                "A bear anthro!",
                "Someone else..."
            ],
            "content":"<div class=\"\"><div> <span>You always did like sleeping in a tent, you set up your tent in the clearing and get inside. You get comfy as the cold night air washes over your tent, it’s not that large of a tent, big enough to fit maybe 3 people. As you begin to drift into sleep you hear a noise. *crack* it almost sounds like a twig breaking, you hear rustling and more cracks and begin to get nervous, what docks it be? Bandits? The Fayrons? As your mind races you hear the individual get closer and closer until it sounds like they’re right outside your tent! You hear the tent zipper unzipping as you cower in fear, as it’s opened you see... a butt? Two big bulbous cheeks push through the opening, you see them spread slightly as you hear a feminine grunt, *BRTTTTTTLLLPPPPPPPP*. The smell tent instantly becomes a Dutch oven as it’s filled with the sickening gas, you cough and gag as you hear the woman outside laugh at your dismay, as you focus your vision you can see that the butt clearly belongs to...</span></div></div>",
            "created":1602324600,
            "id":2918473,
            "title":"Outside in a tent."
        },
        "1221":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Zua needs milking.",
                "Zua’s ass in your face!?",
                "Loud gurgling from Zua’s stomach."
            ],
            "content":"<div class=\"\"><div> <span>You see a white butt with black spots and a long tail, it’s a cow anthro! “How ya hold-in up in there sugar?” She says giggling. You can only cough and gag in response as the rancid fumes from her gut wind engulfs your tent. “Brrrrr, it’s chilly out here! Mind if I come in?” She says as if you have a say in the matter. “I’ll take your coughing as a yes! Alright backing up!” You look up and see her back into the tent, her rear end bulging out at you, once she’s in the tent her butt is only a few inches away from you, you again see her cheeks push out slightly as you know what comes next. *PSSSSSSSHHHHHHH* an eye watering SBD pushes out of her tight hole as she wags her big bottom around, spreading the fumes. “Aaaaa what a relief! This tents a little snug though.” She was right it was snug, she was easily at least 8 feet tall with a chubby belly, a big ass, and large breast, it’s safe to say it was pretty cramped. “Oh well, guess we’ll make due with what we got!” She announces as she plops her massive booty onto your pelvis, her ass completely engulfs your lower body as she grinds around. “Lemme introduce myself.” She says as she turns around still sitting on your lap now facing towards you. Her massive breast in your face, barely contained by the cloth around them of what seems to be a makeshift bra, you look about her huge boobs and see her face, she’s actually really pretty, brown eyes, black hair tied into a ponytail, and a mischievous smile. “My name is Zuadnea, of Zua for short, and I just love messing with tiny humans like yourself... now obviously it’s very cold out and I need a nice warm place to stay the night, so I think I’m gonna sleep in here.” You can’t exactly tell a giant cow woman to leave your tent being a tiny human so you reluctantly oblige. “Oh good! Now I like sleeping on my back, so your gonna have the best mattress and pillows around!” Zua lays on her back and pats her bloated tummy. “Lay here, and out your head here.” She says as she jostles her tits. You crawl onto her body and lay down on her stomach which is audibly gurgling, and you nuzzle you’re head on her cleavage, she is wearing a bra so that makes things much less awkward. “Also of you can’t sleep I heard some nice warm milk will help, lucky for you, your sleeping on two jugs of milk waiting to be sipped.” You blush as you get comfortable on this bovines body as you drift into sleep. You wake up to...</span></div></div>",
            "created":1602334800,
            "id":2918541,
            "title":"A cow anthro!"
        },
        "123":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Skunkgirl!?",
                "Ebi the kobold!?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You have a strange feeling you’re being watched. You head forward trying to find better places to sleep but you can’t shake the feeling of being stalked. Every so often you’ll hear leaves shuffle or twigs break, luckily you brought your pitchfork to scare away potential threats. You hear footsteps behind you, you start to walk faster and the steps do the same. “Stay back!” You tell as you turn around with your pitchfork only to see there’s nothing there. You continue waking and here the footsteps again. You speed up even more and hear the individual behind you match your pace, you don’t dare look behind you enter a full on sprint trying to evade your stalker. But you were so worried about your stalker that you weren’t looking ahead if yourself and tripped over an exposed tree root. You panic as your pitchfork is flung away from the fall. You look up in the pale moonlight and see the one who was following you, it’s a...</span></div></div>",
            "created":1601449800,
            "id":2912751,
            "title":"You’re not alone..."
        },
        "1232":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Comply.",
                "Refuse to sleep on her ass."
            ],
            "content":"<div class=\"\"><div> <span>As your eyes focus you can see that it’s that kobold from earlier who trashed your house! “You!” You say angrily. “Yes me teehee. You see I didn’t actually leave with Progea, we knew you were there the whole time! The thought of shitting all over your house and you not being able to do a thing about and and have to listen to it was amazing!” Ebi said giddily. “So what are you doing in this place boy? You do know Camp unity is in this very forest, so either you didn’t know that, or you’re a fool.” Ebi says. “I came here to stop the Fayrons!” You say confidently. “BAHAHAHAHAHAAAAAA” Ebi bursts out laughing at you as you blush from embarrassment. “HAHA! YOU?! STOP THE FAYRONS!? ALONE!? BAHAHAHAHA” At this pint Ebi is rolling on the ground laughing at the prospect of you stopping them. “Your dumber than I thought farmboy! What were you planning? To take down Hilda that easy?”. “What am I gonna do with you...” Ebi says menacingly. “Nothing, you can’t stop me! I’m going to stop Hilda!”. As you try to walk past Ebi she runs up to you and does some kind of MMA takedown as she has you on your face sitting on your back, She pulls rope from her belt and hogties you and begins to carry you on her shoulder. Despite only being about 5’6 she’s incredibly strong. “You think you I’m a pushover little man? I could kick your ass 5 times over.” Ebi says angrily. “It’s a little late, so maybe we should sleep for the night... You got a tent right? Well I’ll set it up”. Ebi sets up the tent that’s fairly small. “Alright let’s hit the hay” she says as she carries you and sets you down in the tent. “If your wondering where you’ll lay your head, I got a fluffy pillow right here!” She smacks her ass as you realize your gonna have to use Ebi’s rancid ass cheeks as a pillow. “I gotta warn you, I fart a lot in my sleep” she says with a wink and a giggle. What do you do?</span></div></div>",
            "created":1601451060,
            "id":2912752,
            "title":"Ebi the kobold!?"
        },
        "13":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Ass worship/cleaning.",
                "Foot rub/worship.",
                "Snuggling."
            ],
            "content":"<div class=\"\"><div> <span>You’ve heard rumors of a blacksmith who knows anything and everything their is to know about Larion, whoever they are, they’re probably your best bet at finding Hilda. You find the blacksmith after a few directions from some other humans, you see the building “Ms Perleth’s Iron works”. This should be the place, you enter the building and approach the front desk, theirs no one their. “Hello? Ms Perleth? Anyone?” No answer. You hear distant hammering coming from the room behind the desk, you decide to investigate. You walk through the door as you enter a forge, it’s very warm as you see multiple forges spewing flames and molten metal dripping into containers. You travel deeper into the building as you spot someone, presumably Ms Perleth. As you walk closer you see that she is a little taller than you, wearing a protective helmet that obscures her face, she’s very voluptuous, with a large butt sticking out from behind her as she hammers away at her latest weapon.<br>\r\n<br>\r\n<br>\r\n “H-hello? Miss Perleth?” You ask cautiously not wanting to alarm her. “Yes that’s me.” She stops hammering as she turns around, she removes her helmet and reveal her face. She’s an elf, beautiful green eyes, silver hair, plump lips, a cute button nose, she was an absolute beauty. She’s had a little bit of grease smudged on her cheek and her hair was a bit messy. “So what are you here for?” She asks. “Well I’m trying to find information on the whereabouts of someone.” You say. “Sorry kid you got the wrong gal.” Ms Perleth says dismissively. “That can’t be right, I heard you know everything their is to know about Larion and it’s inhabitants.” You say curiously. “Ugh... look I’m just trying to be a blacksmith, I’m not into crime.” She says. “No you misunderstood me, I’m not a criminal I’m trying to stop someone who is.” You say. “Oh yeah who?” She says amused. “Hilda Lazgar...” you say plainly. Ms perleths expression quickly turns serious. “What are you crazy, the Fayrons will make you their servants for life! And trust me you don’t want to know what you'll have to do for them.” She says seriously. “Look it’s personal, I know it sounds crazy and impossible but please, just help me find her.” You beg. “Look, I don’t want to have this find it’s way back to me. If Hilda finds out I gave you info she’ll make sure I pay, I won’t necessarily be a servant, but she’ll probably wreck my shop or something among those lines. I can’t risk my safety for some crazy human on an impossible mission.” Ms Perleth says determined. <br>\r\n<br>\r\n<br>\r\n“What will it take? I’ll do anything!” You plead. “Hmmmmm anything? Well... I’ve always wanted to have a servant of my own.” She says sexily as you get nervous. “Tell you what, you be my servant doing anything I want you to do for 1 week, and I mean ANYTHING. It won’t be easy and it’ll be gnarly. In return I’ll tell you anything and everything you need to know about Hilda and the Fayrons. What do you think?” She proposes as she reaches out for a shake. Even though you’re extremely determined to stop hilda you even had second thoughts about this. You accept Ms Perleth’s deal and shake her hand. “Alright, starting now until next week, I own you...” she says menacingly. “Don’t worry I won’t be TOO rough on you, By the way my name is Ashera, but from here on you will refer to be as ‘Mistress’ or ‘Mistress Perleth”. She says. You’re already second guessing your decision. “Alright! First order of buisness is-“</span></div></div>",
            "created":1602040980,
            "id":2916468,
            "title":"A blacksmith across town"
        },
        "131":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "More fun.",
                "Bed."
            ],
            "content":"<div class=\"\"><div> <span>“Ass worship and cleaning! Let’s head to my room and we’ll get started cutie.” She winks as she sashays toward the front entrance as you follow. There’s a set of stairs in the main entrance room that leads up to her living quarters, it’s actually pretty well kept and expensive looking. “Woah, this looks expensive. How can you afford all this?” As you gaze at the multitude of expensive looking vases and and art. “You’d be surprised how much people pay for my weapons, I am the best of the best after all. However I do enjoy purchasing some of the more delicate examples of craftsmanship such as pottery or art.” As you continue through her living quarters you approach her bedroom. As you enter you see her room has a color scheme of scarlet red. There’s a large bed in the center of the room that’s big enough to fit 10 people! “So you have this place all to yourself?” You ask. “Yep, haven’t had a boyfriend in a long time...Stay here” she orders as you stand in her room as she walks over to her wardrobe, she opens it up to reveal many different types of clothes, silk robes, and lavish gowns. Who would have thought an elf who gets her hands dirty all day running a blacksmith can enjoy such elegant living arrangements and clothing? <br>\r\n<br>\r\n<br>\r\nAshera takes off her tank top as you see her bra, you blush heavily and try not to stare. “It’s ok to look my servant, you’ll be seeing a lot more of my body this next week.” You begin to get erect as you hear we say this. Ashera unclips her bra and reveals her DDD breast, perfectly shaped. She removes the rest of her clothing revealing her bodacious booty and succulent vagina. Ashera walks over to her bed, a slight bounce to her breast with each footfall. Alright servant, time to get worshiping. She crawls on to her bed and lays flat on her stomach, she spreads her legs revealing her slightly hairy, smelly anus and vagina. You crawl up the bed as you approach her rear. “Oh and I should warn you, I’m a very gassy elf. So I want you to sniff my farts like their a perfume got it?” She says seductively. Although you don’t like the smell of her rear you have to oblige because of your deal. The closer you get to her ass the more you realize it’s very smelly and sweaty,  a sour stench emanating from her crack prods your nose. “I feel pretty sweaty down there, how about you soak it up with your tongue?” She suggests. <br>\r\n<br>\r\n<br>\r\nYou reluctantly bring your tongue out and make contact with her crack, you begin to lick up and down as you feel sweat and slime coating your tongue. You gag loudly as she laughs seeming proud of her stench and taste. “Alright slave start licking my pucker, here I’ll push it out for you to make it easier.” She says. You look at her crack as you see her cute pink anus push its way out from between the mounds of flesh. “Give me a kiss.” She begins to wink with her anus almost taunting you as you lean in, your lips make contact as you plant little pecks on her hole. “You ever french kissed before slave? I can teach you.” Just the. You feel Ashera wrap her legs around the back of your head and plant your face deep into her crack as your lips are shoved up against her rear lips. You slowly stick your tongue in as you French kiss Ashera’s asshole. After about 5 minutes of French kissing you hear something, *grrrgggglll* “Do you hear that servant? I think she wants to say thank you hehe.” Ashera says smugly. *PSSSSHHHHHHHHHHHH* a silent but deadly fart coats your mouth in throat in it’s moist stench as you begin to wretch and gag trying to to vomit. “Oooohhh she really likes you” Ashera says as she wiggles her butt in your face. “Alright time for-“</span></div></div>",
            "created":1602043200,
            "id":2916487,
            "title":"Ass worship/cleaning."
        },
        "14":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Hilda!",
                "A snake anthro!",
                "A fairy!",
                "Someone else..."
            ],
            "content":"<div class=\"\"><div> <span>Hilda always did like a nice visit to the hot springs, maybe she’s there? Only one way to find! As you travel to the hot springs the sun starts to set and it gets a little colder outside, being in a nice warm sauna sounds nice right about now. As you arrive at the spa you see a sign, ‘Creatures of comfort spa’. Yep this is the place, you walk up to the front desk and see a human woman, she’s very cute with long blonde hair and blue eyes and a beautiful smile. “Hello sir! How can I help you?” She asks in a very upbeat tone. “Hi I was wondering if I’d be able to find out if a specific person has been here, is that possible?” You ask. “Well, giving away customer information is illegal so I unfortunately cannot help you...” she says. <br>\r\n<br>\r\n<br>\r\n“However, if you pay I can let you into the saunas, maybe whoever you’re looking for is still here?” She suggests. “Ok that sounds like a good idea, so if I pay I can enter any public sauna room?“ you ask curiously. “That’s correct, you can have access to someone’s private room if they let you, but only until your time is up, which should be a few hours.” She says. “Now I will warn you, this sauna is primarily used by females, it’s actually quite rare for us to see a male visitor, so please be on your best behavior!” She says. “Will do!” You hand her the money and enter the room behind her. As you walk through the hallway you think, Hilda’s probably in a private room, she’d definitely wouldn’t want to share a room with a bunch of other people. You see one of the private rooms and knock on the door, a rush of hot and quite smelly air washes over you, standing in front of you in the doorway is...</span></div></div>",
            "created":1602323520,
            "id":2918450,
            "title":"The hot springs?"
        },
        "15":{
            "author_id":"tucker777",
            "author_name":"Wilson54",
            "choices":[
                "Public restrooms?",
                "Strip club?",
                "At her old house?",
                "Somewhere else..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else could she be?</span></div></span></div>",
            "created":1602323880,
            "id":2918457,
            "title":"Somewhere else..."
        }
    },
    "info":{
        "author_id":"tucker777",
        "author_name":"Wilson54",
        "brief_description":"Journey through Larion as you encounter a multitude of rancid ladies!",
        "created":1601445720,
        "description":"<td align=\"left\" class=\"norm\">The kingdom of Larion has many inhabitants, regal kings, farmers, merchants and more. However one group in particular has become the bane of your existence. A tribe of all women known simply as “The Fayrons”. They are lead by a stunning and sexy orc woman named “Hilda Lazgar”. They primarily live in a settlement called “Camp Unity” located in the Buxholm forest. The camp gets its name from its diverse species of inhabitants. Hundreds of women Ranging anywhere from Fairies, to Elves, or Orcs to Kobolds, You name it. They even have a number of anthro women including anthro bears, tigers, snakes, and more. You and Hilda have a complicated past, couple that with the fact that the tribe takes men to be servants and slaves and you decide to try to stop them. How your going to do that has yet to be figured out.<br>\r\n<br>\r\n!!Please read the do’s and don’ts of the story!!<br>\r\n<br>\r\nDo’s (fetishes allowed) All Do’s with a ‘*’ symbol are primary kinks and recommended.<br>\r\n1. * Farts, burps, scat and water sports are allowed. Including ingesting. <br>\r\n2. * Non fatal vore, oral or anal.<br>\r\n3. * Sweat, musk, marking, stench, smell and swamp ass.<br>\r\n4. Feet activities<br>\r\n5. * Femdom/Sadism<br>\r\n6. Giantess<br>\r\n7. * Body worship<br>\r\n8. Mild Saliva play (no phlegm)<br>\r\n9. Lactation<br>\r\n10. Bodysuits<br>\r\n11. * chubby, tummy gurgles and noises.<br>\r\n12. Slime girls and goo<br>\r\n<br>\r\nDon’ts<br>\r\n1. No gore, death, killing, or significant or life threatening physical harm.<br>\r\n2. No under 18 individuals. No exceptions<br>\r\n3. No ‘mind break’ torture or pain torture. Only ‘torture’ in the sense of the listed fetishes. For example fart torture, or butt smothering torture.<br>\r\n4. No feral and no non anthropomorphic animals.<br>\r\n5. No male homosexual activity, lesbian activity is allowed. <br>\r\n6. No R*pe<br>\r\n7. No snot, earwax, blood, or mucus play.<br>\r\n8. CBT<br>\r\n<br>\r\nPlease try to have at least 700 characters in each chapter, but hit the max if you want!<br>\r\n<br>\r\n<br>\r\nAnyone is welcome to add! I encourage adding to the story as long as it stays within guidelines.<br>\r\n</td>",
        "id":2233573,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602738720,
        "modified":1602738720,
        "pretty_title":"The Smelly Women Of Larion."
    }
}