{
    "chapters":{
        "1":{
            "author_id":"kalil_rocks",
            "author_name":"Robloxian2912",
            "choices":[
                "You take your time since you're already late",
                "you hurry to school so you don't get in any more trouble",
                "You go through the truck that hit you",
                "The police arrive"
            ],
            "content":"<div class=\"\"><div> <span>           It was an early morning in February and 54° outside. I rolled over in my bed, still groggy from staying up late last night. As I rolled over, I saw that my alarm clock said <b>8:05 a.m.</b> and and panicked as I realized that school starts at 8:15. The only thing i could think about, as I jumped out of your bed, was how pissed at me Mom would be that I was late to school. For the most part, I lived by myself at home. My mom usually slept overnight at work and my dad died 5 years ago. My older sister was usually off doing who knows what with her boyfriend so that just left me home alone a lot.<br>\r\n           As I struggled to get out the house, an unsettling feeling in the air. At the time, I shrug it off being that I still stuck on the looming presence of the of being late for school. Mom would take away my phone for at least a week. The closer i got to school, the more uneasy I felt. Then it hit me. Literally, it hit me. A truck had just smacked right in to me going at least ten over the speed limit. Somehow, I managed to stand back up but i was unscathed from the impact. I checked on the person driving the truck and, to my surprise, no one was present. I looked back at my watch and my heart jumped as I realized school started 2 minutes ago!<br>\r\n<br>\r\n<br>\r\n<div align=\"center\">Shift to present tense</div></span></div></div>",
            "created":1536002940,
            "id":2542339,
            "title":"The accident"
        },
        "11":{
            "author_id":"barlen343",
            "author_name":"Barlen",
            "choices":[
                "Accidentally pull it off!",
                "Find that my penis is missing!",
                "Piss normally, still oblivious to my new ability.",
                "Sigh, as the jerks from earlier waltz in to bother me...",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>I looked away from my watch and back at the truck that just hit me, after running me over it parked itself, and wouldn’t look the slightest bit out of place to anyone besides me, the guy that just got run over by the fucker... I look at it a moment longer but no one jumps out of it, no clowns, no midgets, nada, just as empty as when it first flattened me. Speaking of flattening, I look down at myself again... no obvious injuries... no pain, the only evidence of the event is a dusty imprint of the vehicle’s grill on my shirt.<br>\r\n<br>\r\nWell I’m already late, and I do have some evidence that someone hit me... I suppose I could just pull an excuse out of my ass when I get into class, say some guy knocked me over and wouldn’t let me go until he was sure I was okay. Story straight in my head, I nod and make my way to class. It takes me several more minutes to get my stuff out of my locker and by the time I open the door to math it’s already ten minutes in. <br>\r\n<br>\r\nImmediately my teacher, Mr. Grayson, an older man that looks like he should be teaching at an old, stuffy university, notices me and fixes me with the evil eye. “Ah Mr. Johnson, so good of you to join us! Mind telling us why you are ten minutes late today?”<br>\r\n<br>\r\n“<i>Well, guess that means I’m still alive and haven’t been wandering around as a ghost!</i>” I think to myself before pointing at my shirt. “Some guy in a Toyota nearly turned me into a hood ornament, wouldn’t let me go until he was sure I was alright.”<br>\r\n<br>\r\nGrayson squints at the mark and then his eyes bulge. “You were ran over?! Are you alright?”<br>\r\n<br>\r\n“More like knocked on my butt... I’m fine, I feel fine!” I protest as he walks over, and lifts my shirt up in front of the class! I do work out so it’s not too embarrassing, but still! Of course, maybe it’s a good thing he does, turn out I wasn’t unscathed, my chest has a big red mark in the shape of the grill, and it’s a bit tender, but that’s it.<br>\r\n<br>\r\n“You’re sure that doesn’t hurt?”<br>\r\n<br>\r\n“It only hurts a little, please I’m fine!” I insist one last time before he concedes and let’s me put me shirt down.<br>\r\n<br>\r\n“Very well...” He turns back to his desk and takes out a nurse’s note and hands it to me. “Here, you may be seated- but if you start feeling any pain or anything else don’t hesitate to use that to go to the nurse.“<br>\r\n<br>\r\nFinally able to sit down I sigh and pull my books out, acutely aware of everyone staring at me... until Grayson smacks his book on his podium, nonverbally demanding all eyes on him as he once more goes into full hardass mode.<br>\r\n<br>\r\nClass passes pretty normally from there and the tenderness in my chest gets better instead of worse, and no new pains or problems pop up elsewhere. A few friends ask me if I’m okay, and a few assholes waste no time heckling me the moment Grayson’s back is turned, but other than that geometry passes normally and it’s time to head off to my next class... of course, it’s at that point my bladder points out that I haven’t emptied it yet today, good thing I have five minutes to get to my next class.<br>\r\n<br>\r\nI walk into the bathroom, stroll up to the stall and zip down to let the beast out and...<br>\r\n<br>\r\n</span></div></div>",
            "created":1603324860,
            "id":2926529,
            "title":"You take your time since you're already late"
        },
        "114":{
            "author_id":"barlen343",
            "author_name":"Barlen",
            "choices":[
                "Cower in fear and meekly beg for their junk back.",
                "Are turned on by this? What the hell?",
                "Act like they never had dicks to begin with... they’re also nicer."
            ],
            "content":"<div class=\"\"><div> <span>Of course... as fate would have it I’m not allowed to piss in peace, as the moment the door closes from my passing, it’s immediately thrown open... and a glance over confirms the culprit’s Chase and Lorenzo: both jocks with more muscle then brains, and a need to assert themselves as alphas anyway they can. Now, that would be fine... I’m no twerp, I could take both of them in a fight and they should know it, they learned that the hard way, after all. So instead of picking a fight or pushing me around what they do is play dirty. I sigh and hold it in...<br>\r\n<br>\r\n“Hey truck-bait, how’s it hanging?” Chase asks.<br>\r\n<br>\r\nThey take the urinals flanking mine... here we go again.<br>\r\n<br>\r\n“Hah, truck bait, nice... Probably same as last time; short, am I right?” Lorenzo elbows me, saw that coming, hence why I’m holding it at the moment. Also I’m not short, my dick is on the larger side of average. Normally that would be a good thing, except... the only thing these two morons are compensating for are their damn brains.<br>\r\n<br>\r\nThey both zip down and make a point of flopping as much of their junk out as they can, balls and everything, if you guessed that both of them are twice my size, congratulations you win a cookie. It’s just what they do, if you don’t kiss up to them they throw their muscles around, and if you can beat the snot out of them, like me, they dick shame you.<br>\r\n<br>\r\nChase grins like the cat that caught the canary as he helicopters his member and Lorenzo chuckles as he jerks his... then they both shove up next to me and shove their dongs into my urinal and start pissing.<br>\r\n<br>\r\n“Aww what’s the matter? Pee shy?” Chase asks innocently.<br>\r\n<br>\r\n“Or are you a homophobe? You know that bi is the new black, right? And hating gays is gay now, right?” Lorenzo murmurs as he tries to shove his cock closer to me.<br>\r\n<br>\r\nI grit my teeth and growl. I’d report these two assholes to the principal for sexual harassment, but the only other guy that I’m aware of that they do this to, did just that, and they managed to turn it on him, seeing as he kicked their asses and already got suspended once for it... <br>\r\n<br>\r\nNormally I’d just ignore them and wait till they finished and left,  but today... maybe it’s my close brush with the reaper today, but I’ve had it with both of them. I’m thinking one good grab and squeeze or twist should give them both a good reason to leave me alone, maybe threaten to rip their junk off. Not that I could or would... though I have to admit it would be awesome if their junk just fell off or something... and maybe I could put them on like they were my own... err... wait, where did that thought come from? I mean I know I’m kinda jealous of them but- Flick!<br>\r\n<br>\r\nI look down and see what happened, Chase has managed to squeeze close enough that his dick, that he’s still passing out of by the way, is close enough to touch mine, and he flicked it with his! That does it, enough is enough! In one movement I let go of my own member and grab the two’s junk right at their base’s with one hand each. Both gasp as I squeeze. “Alright this has gone on long enough, either you two stop it or-“ “Pop! Pop!”<br>\r\n<br>\r\nSeveral things happen at once, first a pair of loud pops echo in the bathroom and both cocks in my hand spray piss like firehoses for a split second before stopping entirely, all the while feeling heavier in my hands. I look down, and to my horror, both members are completely detached from their owners, and have taken their balls with them! Last but not least, Chase and Lorenzo:</span></div></div>",
            "created":1603331100,
            "id":2926569,
            "title":"Bullies."
        },
        "12":{
            "author_id":"kalil_rocks",
            "author_name":"Robloxian2912",
            "choices":[
                "Find it after class",
                "The girl you like picks it up",
                "it lands somewhere warm"
            ],
            "content":"<div class=\"\"><div> <span>          I hurried as fast as I could to my class. Out of breath, I slam through the door and everyone stared at me.<br>\r\n<br>\r\n\"Sorry I'm late, I got held up this morning\" I say struggling to breath<br>\r\n<br>\r\n\"Just take your seat, we will discuss this later, Mr. Johnson\" The teacher says angrily. Swiftly, I take to my seat in the middle of the class. Everyone is continuing to look at me and filling me with nervousness. To help cope with everyone looking at me, I start to play with my finger. \"Okay everyone, I want you to open your text books to...\" The teacher continues but i start to tune him out. My finger feels a bit funny but I ignore it too. I'm too focused on getting everyones stares off me to notice how hard I'm pulling my finger. Suddenly, I hear a soft pop so I look down. I immediately start to panic at the sight of my disconnected finger in my hand. I notice that somehow by hand isn't bleeding at all and the place where my finger once was is now smoothed over with a layer of skin. Seemingly out of nowhere, the teacher shouts \" Mr. Johnson, pay attention!\". I get startled and and watch my detached finger get flung in the air.<br>\r\n<br>\r\n\"Gah! I'm sorry I'll pay attention!\" I yell. Immediately after he looks away, I frantically search around the room for my finger<br>\r\n<br>\r\n</span></div></div>",
            "created":1536020280,
            "id":2542461,
            "title":"you hurry to school so you don't get in any..."
        },
        "122":{
            "author_id":"cosmoniums",
            "author_name":"Cosmoniums ",
            "choices":[
                "You remove your finger and give her back her nose",
                "You attack"
            ],
            "content":"<div class=\"\"><div> <span>You finally saw your finger, only to find it hitting Sarah in the nose. When it collided it seemed to remain stuck on the the tip of her nose. ‘I wanted to get closer to Sarah, but not like this.’ You thought to yourself. You were tempted to go over to Sarah and reclaim your finger, but you knew it would only make your teacher even angrier. <br>\r\n<br>\r\nLuckily there was a fire-drill minutes later giving you the perfect opportunity to get your finger back. You walked over to Sarah to try to get your finger back from her face. <br>\r\n<br>\r\n“Hey Sarah can I have my finger back?” You asked. <br>\r\n<br>\r\n“What finger?” Sarah asked. <br>\r\n<br>\r\n“The one attached to your nose.” You said. <br>\r\n<br>\r\n“Are you talking about my nose finger?” Sarah asked. <br>\r\n<br>\r\nFrustrated you decide to simply remove your finger from Sarah’s nose. Unexpectedly you find that her nose tore off of her face along with your finger. She looks at you holding her nose with anger. <br>\r\n<br>\r\n“Just because my nose isn’t attached doesn’t mean you can just take it!” Sarah yelled. <br>\r\n<br>\r\nYou looked at her nose and pondered what course of action you should take. <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1560899220,
            "id":2675375,
            "title":"The girl you like picks it up"
        }
    },
    "info":{
        "author_id":"kalil_rocks",
        "author_name":"Robloxian2912",
        "brief_description":"After an accident you are given the power to detach body parts!",
        "created":1536001740,
        "description":"<td align=\"left\" class=\"norm\">          After getting hit by a car, you are given the ability to detach body parts. <br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><font class=\"size5\" style=\"\">READ THIS FIRST</font></div><br>\r\nThis can your own body parts or someone else's. You don't have to physically touch the other persons body in order to make their parts come off. If you attach your body part to another persons body you can either decide to make it so can control the part or they can. This has to be before you switch the part. It is possible to attach a part to the wrong spot (putting a foot where your hand is supposed to go) but the part still maintains its original use (putting your nose on your stomach still allows you to smell from your nose). You can also decide if other people notice or not that their body parts have been changed around.<br>\r\n<br>\r\nSex is allowed<br>\r\nGay/lesbian stuff is allowed<br>\r\nNo scat/farting<br>\r\nNo killing<br>\r\n</td>",
        "id":2168048,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603331100,
        "modified":1603331100,
        "pretty_title":"Detachable Body Parts"
    }
}