{
    "chapters":{
        "1":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "The gentle butt-kicker Rushuna",
                "The precocious Mikan",
                "The reformed(?) Setsuna",
                "The wise Tenshi-sama",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Who will be the focus of your attention?<br>\r\n<br>\r\nRushuna Tendou:  The gorgeous, golden-haired, bath-addicted heroine of the series who travels through war-torn lands to spread Tenshi-sama's ideals with her companions Yajirou and Mikan.  Though she is a devout follower of the \"ultimate battle strategy\" that focuses on robbing an opponent of their will to fight by destroying the armor around their hearts, and as such has an unshakable respect for all living things, sometimes she needs to fall back on her incredible agility and skills with a gun that are as vast as her immense bosom before she can reach her adversaries.  Depending on what happens, though, she soon may find herself unable to even hold a gun.<br>\r\n<br>\r\nMikan Kurenai:  This spunky young girl who travels with Rushuna wields a vast array of balloons to perform just about any task she needs.  She is rather loud and mischievous and likes to badger the cynical samurai Yajirou who travels with them, but is a faithful companion who is learning about the ultimate battle strategy from Rushuna.<br>\r\n<br>\r\nSetsuna Oomido:  The antagonist of the series, Setsuna has the same training (and endowments) as Rushuna, but became convinced that Tenshi-sama's ideals were too slow and ineffective to unify the warring kingdoms.  Using the skills that she was taught in order to be Tenshi-sama's bodyguard, she imprisoned the young empress and took her place in order to end the feudal era through force.  Ultimately, she and her plans were defeated by Rushuna.  Despite their equal training and skills in combat, Rushuna ultimately gained the upper hand thanks to the ultimate battle strategy.  In the aftermath, Setsuna foresook her pursuit of power and decided to go on a journey of her own, but there's no telling how well Tenshi-sama's ideals will stick.<br>\r\n<br>\r\nTenshi-sama:  The young and elegantly beautiful empress of Tento who rules with a strong, gentle heart.  She is the one who taught Rushuna and others to stop an opponent by destroying their desire to fight.  Though not as tall or voluptuous as Rushuna and Setsuna, the two women meant to be her bodyguards and doubles, who knows what could change?</span></div></div>",
            "created":1153287060,
            "id":332371,
            "title":"Pick your character"
        },
        "11":{
            "author_id":"morningblue",
            "author_name":"T.J.",
            "choices":[
                "Giantess",
                "Shrinking",
                "Body expansion",
                "Breast expansion",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And what shall happen to the busty heroine of Grenadier?</span></div></span></div>",
            "created":1216533000,
            "id":557924,
            "title":"Choices for Rushuna"
        },
        "111":{
            "author_id":"magnuscorvus",
            "author_name":"MagnusCorvus",
            "choices":[
                "The group encounters someone along the way.",
                "They reach the old bath house without incident.",
                "Bandits!"
            ],
            "content":"<div class=\"\"><div> <span>Travelling to far-off regions in order to spread good will and stem the tide of violence in the age of warring states was good for the heart and soul, but not so much for a young lady's skin.  That was the rationale Rushuna used in order to go several miles out of their way to stop at a rustic old bath house, anyway, but Yajirou knew better than to get between his well-endowed companion and her indulgences.  That wouldn't stop him from complaining about it, however.<br>\r\n<br>\r\n\"You know, we could just keep following the main road and be in town by sundown.  I'm sure they have baths there.  Not to mention beds.  And hot food.\"<br>\r\n<br>\r\nRushuna just smiled, however, and tugged at her neckline to let her cavernous cleavage breathe.  \"Sure, but what's the hurry?  We can spend the night and won't be so dirty and sweaty when we do reach town.  Besides, I've heard the bathwater in this region was really something special!\"<br>\r\n<br>\r\n\"And don't go thinking you can do anything perverted just because we're out in the middle of nowhere, either,\" Mikan piped in, making a vein in Yajirou's forehead start throbbing.<br>\r\n<br>\r\n\"Like I ever have so far!\"  Rubbing his forehead, the swordsman sighed and asked, \"Okay, so if this bath is so special, why is it all the way out in the backroads instead of somewhere civilized?\"<br>\r\n<br>\r\nRushuna hmmmed and tapped her cheek in thought.  \"Well, the way I heard it, the water came from what the locals called the Divine Spring.  They would bathe in it for health, strength and prosperity.  But then one day, a gang of bandits showed up.  The people were strong enough to drive away the bandits whenever they came around, thanks to the blessing of the Divine Spring, so they didn't have anything to fear.  The bandit leader was jealous and angry, though, so he sneaked in one night under cover of darkness and planted a bomb right at the source of the water, sealing it up!  After that, without the blessing of the spring, the villagers slowly weakened and grew sick until they were targets for the bandits.  Eventually, they drifted away and abandoned the area, believing they'd been cursed by the spirit of the spring.\"<br>\r\n<br>\r\n\"Wow.  That's some story,\" Yajirou replied.  Then his eyebrow arched at Rushuna.  \"But even if it's true, wouldn't that mean the water's sealed off?\"<br>\r\n<br>\r\nThis made Rushuna laugh softly, looking a little embarassed as she held up two pickaxes.  \"Well, that's why I picked these up at that last town!\"<br>\r\n<br>\r\n\"So instead of taking an extra hour or two to get to a town with a bath, you go off on a side trip to an abandoned bath house that may or may not actually have any water at all?\"<br>\r\n<br>\r\n\"I guess it is kind of inconvenient.  Hehe!  Well, think of it as an adventure,\" Rushuna said as her companion just sighed to himself.  It was going to be a long couple of days, he could tell.</span></div></div>",
            "created":1216595520,
            "id":558198,
            "title":"Giantess"
        },
        "1112":{
            "author_id":"morningblue",
            "author_name":"T.J.",
            "choices":[
                "Mikan is confused by Rushuna’s growth",
                "Mikan asks how Rushuna grew in the first place",
                "That isn't Mikan coming in to check on her.."
            ],
            "content":"<div class=\"\"><div> <span>Rushuna, Yajirou, and Mikan safely made it to the supposed hot springs with very little trouble at all. Sure they ran into a few bandits here and there, but between Rushuna’s mastery with her gun, Yajirou’s sword techniques, and Mikan’s balloon mastery, they weren’t much of a threat to the trio.<br>\r\n<br>\r\nAnd it was just in time, too. Although not a hard or even tiring journey, it was a fairly lengthy one for Rushuna, and the heat from the sun only amplified her desire to get clean all the more. Mikan was feeling sweaty as well, also wanting to partake in the bath house’s water. Unfortunately, when they got there they realized something a little problematic.<br>\r\n<br>\r\n“It’s a little on the small side”, Mikan commented, barely looking big enough to contain all three travelers at the same time.<br>\r\n<br>\r\n“Kinda like you”, Yajirou added, giggling to himself as Mikan gave him a whack on the head. Rushuna, however, was already in the process of getting into the warm water, already taking off her belt and hat. Mikan then shooed Yashiro away from the bath house as the tired blonde stripped herself of all her clothes and stepped into the water.<br>\r\n<br>\r\n“Are you coming in, Mikan?” Rushuna asked the girl as she happily sighed in the spring’s warm water. It was practically perfect temperature for the tired out Senshi.<br>\r\n<br>\r\n“In a little bit. Until then I’ll keep a look out for bandits…and Yajirou”, Mikan responded as she kept an ever-present eye out for anyone suspicious right outside the bath house, with Yashiro out a little further out doing the same. As they did so, Rushuna dunked her head partially into the water and started blowing bubbles, amused by her doing so. As she did so, though, she felt a little…odd.<br>\r\n<br>\r\nRushuna looked at her body once more and noticed that her breasts were getting bigger very quickly! But how? Granted, Rushuna was only 16, so the idea of her growing taller (or bigger) was not out of the question, but now all of a sudden her already large chest was getting larger?! And it wasn’t the only part of her body growing, either. Her arms seemed to stretch out longer and longer away from her body, her neck, hair, and head joining them in their increasing size. Her legs then propelled the once average sized Senshi well above the water, her feet and butt growing alongside them. Soon after followed several other spurts of growth, and Rushuna quickly took out her giant feet from the water and sat on her knees to see her much smaller environment. At the end she had to at least be 25 feet tall…and naked.<br>\r\n<br>\r\n“Hmm? What happened?” Rushuna reacted to her giant size, picking up her gun with her right hand and examining it. “Aw! It looks like a toy gun now! How cute!”<br>\r\n<br>\r\nMikan, meanwhile, decided to check up on Rushuna to see if anything happened, as well as joining her friend in the water as well. Rushuna could hear the girl’s footsteps approaching ever closer to her as she did so. Instead of worrying about it, though, Rushuna was actually looking forward to Mikan’s shocked expression.<br>\r\n<br>\r\n“I wonder how Mikan will reply to this?” Rushuna smiled to herself, thinking of the possible odd faces she would make. “I hope she doesn’t get too scared by this..”<br>\r\n</span></div></div>",
            "created":1221672360,
            "id":583606,
            "title":"Rushuna gets bigger (in more ways than one)"
        },
        "11121":{
            "author_id":"morningblue",
            "author_name":"T.J.",
            "choices":[
                "Mikan comes back with Yajirou",
                "Rushuna notices her feet are looking a little smaller.."
            ],
            "content":"<div class=\"\"><div> <span>Mikan reacted to Rushuna's growth like any other, sane person would; mass confusion.<br>\r\n<br>\r\n\"What happened to you!?\" she asked her 25 foot tall companion, poking her body with her fingers to see whether or not this was actually the Rushuna she knew and traveled with in front of her eyes. \"I heard of growth spurts, but not like this..\"<br>\r\n<br>\r\n\"It seems the water has growing abilities\", the busty blonde replied to the girl's question, smiling as Mikan continued to poke her, which tickled a little to her.<br>\r\n<br>\r\n\"That's some strange water, then\", Mikan noted as she stared directly at the water below her. She decided to take out one of her non-inflated balloons and place it on top of the water, watching as it grew to four times its size! Rushuna was telling the truth after all.<br>\r\n<br>\r\n\"Does it grow clothes, too?\" Mikan asked, getting kind of excited by the potential of growth. No more being made fun off by Yajirou for being a \"shrimp\" or \"flat\" for her!<br>\r\n<br>\r\n\"I'm not sure. I was naked at the time\", Rushuna replied, feeling a little dizzy. \"Mikan, I'm feeling a little tired, honestly...could you call Yatchan over for me?\"<br>\r\n<br>\r\n\"No way. There's no telling what that pervert would do if he saw you like this!\" she was quick to reply, a disturbing image of Yajirou fondling Rushuna's naked body (mainly her breasts) going on through her mind. She shuddered greatly after thinking such a thing. <br>\r\n<br>\r\n\"He already acts weird enough around normal-sized woman!\"<br>\r\n<br>\r\n\"Yatchan's not like that\", Rushuna sternly explained to her normal sized friend, picking her up with her bigger hands. \"He's a very nice person and a wonderful companion! Please don't speak so rude of him!\" She then let go of the balloon user upon telling her this.<br>\r\n<br>\r\n\"Fine\", Mikan sighed. \"I'll go gather Pervert Boy. Just don't move, okay!?\"<br>\r\n<br>\r\n\"Got it!\" Rushuna nodded in reply as Mikan went to get Yajirou to guard the outside of the bath house. Although too small to put her body in it once again, maybe she could at least dunk her feet in it in the meantime..</span></div></div>",
            "created":1221754680,
            "id":583986,
            "title":"Mikan's surprise"
        },
        "12":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "giantess",
                "shrinking",
                "breast expansion",
                "butt expansion",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how does she change?</span></div></span></div>",
            "created":1330468800,
            "id":1285928,
            "title":"The precocious Mikan"
        },
        "13":{
            "author_id":"erik",
            "author_name":"Drez",
            "choices":[
                "Someone invites her to a hotel close to a magic hotspring",
                "Setsuna  decides to try these so-called magic hotspring ",
                "Rushuna enters the bar, along with Mikan and Yajirou ",
                "something else happens ",
                "something else happens "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<br>\r\n    Setsuna Oomido was a defeated woman.  But at least she lost to a worthy foe--herself. That made her laugh sourly as she drank sake from her cup.  It was Rushuna who had defeated her with the ultimate battle strategy that Setsuna herself had abandoned.  After that, Setsuna had ducked out and went on a journey of her own to see if the ultimate battle strategy worked for her or not.   She had some success with it.  A week ago, she came upon two families in the middle of an awful feud.  It had something to do with a son marrying a daughter, or some such.  Setsuna arrived just in time to prevent a murder...or possibly several murders.  To make a long story short, Setsuna had settled things with the battle strategy, and it worked.  True, she did slap the son because he tried to feel her up, but the strategy worked nevertheless.  <br>\r\n             Setsuna was at a small bar in a small town that was notable for its hotsprings.  Not just any hotsprings; these were \"magical\" hotsprings that gave a person magical powers.  There was someone from the village who could now shrink other people due to the magic of the hotsprings.  Setsuna really didn't believe the tales of the magical hotsprings.  She didn't come to the town because of the hotsprings; she just wanted to have some lunch and continued her journey.   <br>\r\n                           <br>\r\n</span></div></div>",
            "created":1221021780,
            "id":580343,
            "title":"Setsuna in a bar "
        }
    },
    "info":{
        "author_id":"magnuscorvus",
        "author_name":"MagnusCorvus",
        "brief_description":"Shrinking Rushuna, inflating Mikan, towering Setsuna and more.",
        "created":1153279200,
        "description":"<td align=\"left\" class=\"norm\">Following the events of the series \"Grenadier - The Smiling Senshi\" peace has been given a chance to take route in the feudal age.  But the female cast are met with unusual and unexpected transformations.<br>\r\n<br>\r\nPlease contribute posts with at least two paragraphs, and while some flexibility is necessary for this sort of story, please don't make the cast behave wildly out of character for no good reason.</td>",
        "id":1133526,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1330468800,
        "modified":1330468800,
        "pretty_title":"Grenadier Girl Sizeplay"
    }
}